{
  "id": "qbnll4",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1634685567.0,
  "title": "Request: I don't want to go into treatment because I'm terrified they'll make me restrict",
  "selftext": " \n\nI absolutely NEED to recover. I restrict on weekdays, then I b/p on the weekends. I'm constantly hungry, constantly thinking about food, completely obsessed with it. I'm underweight, always cold, have terrible insomnia. My tongue burns and I have near constant acid reflux due to purging. My teeth are discoloured and my skin is pale and breaks easily. I'm losing hair. I am not productive and cannot focus at work. I'm moody and irritable.\n\nBut I don't want to go into treatment. I'm already followed by therapists and dietitians and all they've done is make things worse.\n\nI hate meal plans. They're so restrictive. They only foster my obsessive tendencies around food. I see the meal plans they usually have in treatment centers and I already feel anxious because it feels like such little food. I already restrict myself. Getting told to restrict by professionals that are supposedly there to help you recover would be heart breaking. I don't want to eat at set times. I don't want to \"learn portion control\" and \"appropriate portion sizes\" (as if I don't know that myself). I don't want to \"eat balanced meals\". I don't want to \"enforce a controlled structure\". I don't want to be surrounded by other sick people like me and exchange tips and tricks. I don't want people to give me meals that don't satisfy me and then get told that binging is bad if I ask for more. I don't want to have to choose between freaking \"exchanges\" for a snack or a meal. I don't want to eat a single fist of protein sources or whatever. I just want to actually stop having an eating disorder, stop caring about food, stop being hungry, and start eating whatever I want without restriction. But I also know that if I did that right now that would mean binging and binging and binging and that would in turn mean purging. And I don't want to purge anymore.\n\nI also don't want to get into treatment and having to get scrutinized by a bunch of therapists who copy paste their education on me. No my ED is not about control. No I don't have trouble with my parents. No I don't feel fat. No I'm not doing this for attention. No I didn't have an unhealthy childhood. No I'm not using food to soothe my anxiety and numb unpleasant emotions. Yes I know that there is no good or bad food. Yes I know that two rice crackers is not a meal. I've been freaking screaming these things for ages and no one ever bothered to listen - I've been told that I'm in denial and that \"if I don't wanna change then no therapist will make you change\". Yes I do wanna change, I'm just scared to do so, and I'm looking for effective help and I don't feel a treatment center would be able to deliver that.\n\nBut I also no longer know the alternative. I used to think that having my own treatment team would be great but I've been repeatedly failed and now I'm worse than ever and I feel that I have no options left.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/qbnll4/request_i_dont_want_to_go_into_treatment_because/",
  "score": 59,
  "num_comments": 29,
  "comments": [
    {
      "id": "hhbt004",
      "author": "sorcerers_apprentice",
      "body": "There are treatment centers out there who encourage intuitive eating rather than exchanges. Usually, they *will* start you out on some kind of structured/portioned meal plan so that you can get used to eating an appropriate amount of food again first, but then they'll transition you to following your body's cues. The caveat here is that this initial meal plan will probably be very, very far from restrictive if you are underweight--it will probably be designed for weight gain. Just throwing that out there.\n\nBut if you don't think treatment is helpful...maybe it's not. I've always thought it just keeps me stuck in eating disorder world and disconnected from the \"real world\"/my actual hopes and dreams and goals in life. In that case, there are lots of resources out there that might appeal to you. Support groups (even for general mental health stuff--sometimes being around other ED people makes it worse), podcasts, workbooks... it's all about finding what helps you reach where you want to be. Sorry you're feeling so frustrated.",
      "created_utc": 1634706399.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hhbbu5o",
      "author": "runninginbubbles",
      "body": "I am really confused here. What exactly DO you want? You don't want inpatient, and you don't want outpatient. You don't want professionals who are educated to help you, you don't want anything that resembles a meal plan, you don't want anyone to enforce normal eating habits.What actually does *effective help* mean to you?\n\nI'm also curious, what is your ED about? What purpose does it serve? Why are you scared of change? If what you're saying is true - there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that? Why can't you binge and not purge, knowing that eventually your body will not longer need to binge? You obviously cannot be afraid of gaining weight if you are worried that treatment restricts your eating, most people are terrified of being given too much. \n\nI feel like you just want this magic wand waved, but thats not going to happen. You can recover on your own - you know what you need to do and you have the desire to do it - so go ahead? Most people who need treatment centres do so to learn the exact things you don't want a bar of (portion control, meal times etc) and to work through whats driving the ED (control/emotions etc which do not appear to apply to you).\n\nIf you do not want to go residential or outpatient, my practical advice would be to read Brain over Binge. Once you've committed yourself to stop purging and stop restricting, you will stop binging too. But it has to be in that order. It sounds too easy, but the way you're describing your ED, it sounds 'too easy,' I'm not sure if it's denial, but I really want you to think about WHY change is so hard. Because from what you've said, it's very much ALL about control.",
      "created_utc": 1634696860.0,
      "score": 30,
      "context": []
    },
    {
      "id": "hhbq6xj",
      "author": "None",
      "body": "Hey! The kind of approach you might be talking about - like without the meal plans - is one talked about by Tabitha Farrar, have you  heard of her? - she recovered on her own and is a big advocate for not using meal plans and over-psychologying things like control etc. She's got a 'no-shit' approach that's biologically focused, and she's a recovery coach. I've read her book Rehabilitate Rewire Recover (I think she has a few) and watch her YouTube videos and she answers so many QandAs on there, also about the continuous binging that you are worried about. You should check her out!",
      "created_utc": 1634704620.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hhc4lcp",
      "author": "Kitchen-Wind7362",
      "body": "You're obviously self aware. Maybe too much. It sounds like you know a lot about what hasn't triggered your ED but you don't seem to be coming up with solutions either. Health care professionals can only do what they can do. They are under immense pressure and mental healthcare is basically like wandering around in the dark trying to find objects. \n\nI think it's easy to forget that having an ED changes your brain and how you process things. There is obviously a constant battle in the brain because you know what to eat and when but you choose not to because of how it makes you feel. This means that to a large extent, you can't totally trust your own mind and do wonder if there is a sense of self sabotage with how you deal with health professionals. That was certainly the case when I was seeing them.\n\nAnyway, I hope you figure it out because it might hit a point where you have no say over your treatment and I'd really hate that for you.",
      "created_utc": 1634715456.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hhbe26j",
      "author": "None",
      "body": "Maybe look into Alsana? They’re supposed to do things a little less cut and dry/one size fits all, and more holistic and tailored to you. https://www.alsana.com/blog/alsana-treat-binge-eating-disorder/ you could also call them up and ask any concerns you have, prior to admission.",
      "created_utc": 1634697964.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hhcxanq",
      "author": "Boosey0910",
      "body": "You can't recover from an ED without addressing your relationship to food.  That's the difficult truth. But you CAN recover. And it's worth it and most people are terrified of giving it up and are ambivalent to getting help. What you are feeling is normal.  I hope you can find the help you need and deserve.",
      "created_utc": 1634736333.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hhb5fik",
      "author": "None",
      "body": "Why do you think you need to go into a treatment center to get treated? You can definitely work with professionals outside of a treatment center. \n\nSo what do you feel like your Ed is about? If it's not about control or weightloss or fear then what?\n\nIt's obvious that your bping on the weekends because you restrict on the weekdays. So how wouldn't a meal plan help you eat more on the weekdays so your not bping on the weekends? You could set the meals as literally whatever you want if you do it at home.... So why would it be restrictive if you WANT to eat more. Because clearly what your doing isn't working at all. So what's left to try. What exactly are you wanting to try. Because it seems like you just shut down every option without knowing that an option would even be.",
      "created_utc": 1634693818.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hhbqj1n",
      "author": "Appropriate_Mark9374",
      "body": "You might find some of her stuff useful:\n\nhttps://m.youtube.com/c/TabithaFarrar",
      "created_utc": 1634704824.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hhd69yb",
      "author": "updown27",
      "body": "It's extremely common to resist treatment because you believe the clinicians don't know what they're doing and/or will somehow make your condition worse. The truth is that your eating disorder will convince you of ANYTHING to save itself. You cannot trust yourself to guide your own recovery because your eating disorder voice is still too loud and very much integrated into your own psyche. \n\nIf you want to live, you MUST relinquish control of your treatment and trust your clinicians. \n\nMy motto in recovery was \"sounds wrong but I'll give it a try it\". \n\nAnd guess what, everything they told me to do worked. Because this is their job. Clinicians might not always be perfect but they sure know how to care for you better than you do right now. Literally anything is a step up from what you are doing right now.",
      "created_utc": 1634740411.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hhanrqt",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1634685571.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hhr0qlp",
      "author": "houston_veronica",
      "body": "OP, I truly understand your feelings.\n1. I was dx'd at age 30.\n2. I could not - for the life of me - attribute how ED was related to any issues of \"control\"; I had a beautiful childhood with a wonderful family, faith and all my needs met. No idea why the ED found me...except that my grandma, sister, niece and - to some degree my brother - all have EDs or ED-issues.  My sister and niece were full-on.\n\nWhile I believe in heredity's role, the truth is, I could not figure out why I am so \"fat-phobic\". I can look at someone who others may criticize as \"overweight\", and see nothing but beauty and grace in them. But - in myself - I simply cannot stand the idea of having to gain weight or becoming \"average\". I will never understand that, after having made it to age 30 and never thinking twice about this matter. (I had no problem ever - unless you count the few times growing up that I wanted to look better in a bikini, or admired some model, or whatnot. It was not an issue, and I would never, ever \"Diet\". I found diets so sad.)\n\nBUT: as it turns out, here I am. 17 years of restrictive anorexia. I have received treatment, and like you, I thought \"what could I learn or understand that I don't ALREADY know? I can write a book on nutrition, proper serving sizes, the idea that \"restriction makes you obsess\", \"secrets keep you sick\" and all the other things we learn in recovery.\nProblem is: you've got a real problem.\n\n- You don't want to gain weight, so you restrict all week and BP on the weekends. How is this actually working for you?...it seems like it sucks, from what I'm reading.  \n----> So let's say you actually follow the plan of an RD, that you deem \"restrictive\" because they won't let you eat 10 bowls of cereal or whatever you prefer.  How is their role in teaching you to try and eat more often, more reasonably, ANYWHERE as restrictive as you \"restricting all week\"?\nI don't deny that you have this feeling, and I understand what you feel.  You basically want carte blanche to eat all of anything and everything, and somehow not gain weight, and somehow not feel limited.\n\nThere is no such thing. You will either eat all you want, and gain the weight. Or, you will learn to eat reasonably, and eventually \"settle\" at a weight that is right for you*.\n*BY \"eat reasonably\" - and I speak from experience - meal plans for recovery can be as high as six-thousand calories. Eventually, that much food will make you feel extremely uncomfortable and to maintain, your body and mind will naturally desire that you stop eating at the amount that is RIGHT for your body.\nBut, to get to that point, you do have to eat a LOT.  No treatment center is going to put you on a diet when recovering from RAN. If that's what you have. (along with BP.)",
      "created_utc": 1635003681.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hkthypu",
      "author": "cjx888x",
      "body": "I think a fair amount of eating disorder treatment is part of a very non-inclusive system. Its based around a demographic of (largely) young, white, straight cis women who come from financially stable backgrounds because these are the people who could afford treatment and were the focus of eating disorder work for a very long time. This means treatments available were built up around them. People in the same demographic often have common backgrounds, so the professionals are seeing similar patterns in the sources of peoples issues etc etc.\n\nBasically, the shit is biased and doesn’t cover the variety of human experiences that actually exist. I have the same problem. Even my own therapist says she struggles to figure out where she can recommend me to go for additional support because there isn’t anything around that fits my needs.\n\nI just wanted to let you know that your aren’t alone. The system of treatment available out there right now isn’t for everyone, and having professionals tell you that you are the problem for not fitting into their treatment model instead of understanding that they aren’t giving you what you need is super invaliding and it sucks.",
      "created_utc": 1637039994.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hhcfra9",
      "author": "lothar42",
      "body": "Thank you for your comprehension. It often seems like if you didn't find treatment helpful then it MUST be your fault because you just didn't \"commit enough\".",
      "created_utc": 1634725539.0,
      "score": 3,
      "context": [
        {
          "id": "hhbt004",
          "author": "sorcerers_apprentice",
          "body": "There are treatment centers out there who encourage intuitive eating rather than exchanges. Usually, they *will* start you out on some kind of structured/portioned meal plan so that you can get used to eating an appropriate amount of food again first, but then they'll transition you to following your body's cues. The caveat here is that this initial meal plan will probably be very, very far from restrictive if you are underweight--it will probably be designed for weight gain. Just throwing that out there.\n\nBut if you don't think treatment is helpful...maybe it's not. I've always thought it just keeps me stuck in eating disorder world and disconnected from the \"real world\"/my actual hopes and dreams and goals in life. In that case, there are lots of resources out there that might appeal to you. Support groups (even for general mental health stuff--sometimes being around other ED people makes it worse), podcasts, workbooks... it's all about finding what helps you reach where you want to be. Sorry you're feeling so frustrated.",
          "created_utc": 1634706399.0
        }
      ]
    },
    {
      "id": "hhbv60l",
      "author": "lothar42",
      "body": "Hey, I'm OP, and since you brought up a lot of interesting questions and I did post similar threads on other subs already I thought I might as well show up and reply.\n\nHonestly, I don't even think my ED is \"about\" anything. I don't think there necessarily needs to be a \"purpose\" behind an ED, not a psychological one at least. At this point I think at least in my case it's primarily a biological thing. There might have been some psychological issues at play but whatever they were they're gone.\n\nMy ED developed out of the blue when I was an adult and I had no particular issues with food, myself or my body. I always had normal eating patterns before my ED and I'm very aware of how a normal person eats, which is why I don't need anyone \"teaching\" me. I know what goes with what and how a normal portion looks like etc. Once I showed my dietitian an example of what I'd eat pre ED and he said it's very close to what he would prescribe as a meal plan. I started losing weight for unrelated reasons and then it just kind of spiraled into an ED. I developed a strong fear of eating and gaining weight. After a while I sought the help of therapists, and basically the current one immediately told me it was about \"control\" and that in order to get rid of my ED I needed to realize that I didn't need \"control\" and that I had to face what made me feel \"out of control\".\n\nSo I thought, well, it must be right. I didn't know anything about EDs, and he was a professional, so I should trust him. I was very compliant with therapy and practised all his suggestions religiously, but after a long time and no change in terms of ED behaviours I started questioning all of it. I started realizing that it was actually (and still is) the ED itself that makes me feel \"out of control\", and that despite the good intentions of my therapist none of what he said *truly* reasonated within me. Actually it was making me worse, because focusing on the \"mental side\" just made me more and more entrenched in my daily ED routines to the point that I nearly got hospitalized. \n\nAt this point I started educating myself on the biological roots of an ED and I began viewing myself as someone with a phobia of flying. You can't \"just stop\" being scared of planes and \"just hop on a plane\" - you'll probably need assistance. But at the same time you wouldn't want a treatment center to tell you that hey, planes do crash, so you might wanna be cautious there!, cause that's just gonna feel counterproductive isn't it? \n\nEssentially I have a strong phobia of gaining weight. Plus I had someone in my family died of obesity-related health issues and I don't want that to happen to me. But I know that if I stop restricting I'll just binge myself to death (which is also why \"Brain over Binge\" never worked - I cannot \"stop restricting\" without binging). So basically I'd need someone that helps me with the transition without judging, and while reassuring me that at some point the binges will stop and I will settle down at a normal weight and I won't need to restrict anymore. Problem is, all the therapists I've met focus on unrelated stuff like control and all the dietitians do judge me if I eat \"too much\", e.g. if I eat three bowls of cereals in the morning instead of one and maybe then I finish the whole box before lunch together with other stuff. \n\nObviously I am also terrified of being given too much. But I know that a treatment center is never gonna give you \"too much\". I am terrified of *me* giving myself too much. At the same time, I'd rather keep restricting on my own terms than being made to restrict by a treatment team, which would feel incredibly soul crushing - it's like being teased with something you want and then seeing it go away. You'll think \"well why did you ever showed that to me in the first place, I'd rather not see it at all then\". One measly single muffin as a snack won't cut it. It's an out of sight out of mind kinda thing for me. It's just so hard to see the point of recovery when those who are supposed to help you recover promote habits that look and sound so similar to your ED.\n\nBasically the reason why I restrict these days is because then I know that if I binge the consequences in terms of weight gain won't be too terrible. In fact, when I'm VERY underweight, then sometimes I manage to let myself binge without feeling the need to purge afterwards.\n\nBy the way, I did explain all of this to my therapist multiple times in great detail. I made an effort to be constructive and see whether we could find a common ground. But I've only been met with a slightly condescending attitude like I was a poor fool who had just read way too much baseless quack pseudoscience somewhere online instead of trusting educated professionals like him. And that left me angry and frustrated - because I got tired of always being told I was in denial and never being listened to and got tired of him never wanting to question his own approach despite it not actually working.\n\nInitially I also told myself that maybe I *was* in denial, so I stuck to therapy and did my best to try and follow my therapist advice instead of being confrontational about it. And I have to say, it did help me with a lot of things in my life...but the ED habits only got worse and grew more and more unrelated to my emotional state.\n\nHonestly the people who've actually been able to help me somewhat are my parents and my friends, who basically always told me that my binges were just a response to restriction and they would ultimately go away. But of course they cannot just stay with me 24/7 and they're also humans so they snap and get tired of listening to my constant panic attacks everytime I eat \"too much\" and talking me out of them.\n\n> there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that?\n\n>you know what you need to do and you have the desire to do it - so go ahead? \n\nThat sounds true for most ED sufferers though, and for any phobia for that matter. There is nothing stopping us. I do know what I need to do and I want to do it - but I'm too terrified to actually do it. Sometimes I try - aka I binge - and I'm happy for a while, but then the fear kicks in and I purge.",
      "created_utc": 1634707925.0,
      "score": 4,
      "context": [
        {
          "id": "hhbbu5o",
          "author": "runninginbubbles",
          "body": "I am really confused here. What exactly DO you want? You don't want inpatient, and you don't want outpatient. You don't want professionals who are educated to help you, you don't want anything that resembles a meal plan, you don't want anyone to enforce normal eating habits.What actually does *effective help* mean to you?\n\nI'm also curious, what is your ED about? What purpose does it serve? Why are you scared of change? If what you're saying is true - there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that? Why can't you binge and not purge, knowing that eventually your body will not longer need to binge? You obviously cannot be afraid of gaining weight if you are worried that treatment restricts your eating, most people are terrified of being given too much. \n\nI feel like you just want this magic wand waved, but thats not going to happen. You can recover on your own - you know what you need to do and you have the desire to do it - so go ahead? Most people who need treatment centres do so to learn the exact things you don't want a bar of (portion control, meal times etc) and to work through whats driving the ED (control/emotions etc which do not appear to apply to you).\n\nIf you do not want to go residential or outpatient, my practical advice would be to read Brain over Binge. Once you've committed yourself to stop purging and stop restricting, you will stop binging too. But it has to be in that order. It sounds too easy, but the way you're describing your ED, it sounds 'too easy,' I'm not sure if it's denial, but I really want you to think about WHY change is so hard. Because from what you've said, it's very much ALL about control.",
          "created_utc": 1634696860.0
        }
      ]
    },
    {
      "id": "hhcftd1",
      "author": "lothar42",
      "body": "I'm OP, and I wrote a reply to a comment right above answering to some of your questions. :)",
      "created_utc": 1634725588.0,
      "score": 0,
      "context": [
        {
          "id": "hhb5fik",
          "author": "None",
          "body": "Why do you think you need to go into a treatment center to get treated? You can definitely work with professionals outside of a treatment center. \n\nSo what do you feel like your Ed is about? If it's not about control or weightloss or fear then what?\n\nIt's obvious that your bping on the weekends because you restrict on the weekdays. So how wouldn't a meal plan help you eat more on the weekdays so your not bping on the weekends? You could set the meals as literally whatever you want if you do it at home.... So why would it be restrictive if you WANT to eat more. Because clearly what your doing isn't working at all. So what's left to try. What exactly are you wanting to try. Because it seems like you just shut down every option without knowing that an option would even be.",
          "created_utc": 1634693818.0
        }
      ]
    },
    {
      "id": "hhdd63j",
      "author": "lothar42",
      "body": "I'm OP. I've done what clinicians told me for years. Often religiously and to the T. Never worked. I'm tired now.\n\nAlso I've had clinicians \n\n-advising me not to drink full fat milk (which I used to even during my ED) and switch to semi skimmed at breakfast. Guess what - never drank full fat since then.\n\n-telling me that binging was just a strategy to distract away from unpleasant emotions - mind you, I was dangerously underweight at that point and heavily restricting on a daily basis to the point that I had trouble climbing the stairs, and I would binge on broccoli or leftover chicken because I was starving to death.\n\n-telling me that 100 g of pasta was too much, 80 was the standard portion and I should use a scale to measure it.\n\n-\"scolding\" me because I had eaten more cereal than my meal plan.\n\n-telling me that they also were on a diet.\n\nI no longer trust my clinicians and I'm no longer gonna do what they tell me. Sorry not sorry. I do not share this view of clinicians necessarily knowing better. I'm glad it worked for you, but it blows my mind how EDs have the most dismal statistics - I think it's something like 1 in 2 people never fully recovering and 1 out of 5 dying - but instead of being a wake up call for clinicians to find new therapy approaches ASAP as a matter of urgency, it gets dismissed as just the patients being difficult.",
      "created_utc": 1634743282.0,
      "score": 1,
      "context": [
        {
          "id": "hhd69yb",
          "author": "updown27",
          "body": "It's extremely common to resist treatment because you believe the clinicians don't know what they're doing and/or will somehow make your condition worse. The truth is that your eating disorder will convince you of ANYTHING to save itself. You cannot trust yourself to guide your own recovery because your eating disorder voice is still too loud and very much integrated into your own psyche. \n\nIf you want to live, you MUST relinquish control of your treatment and trust your clinicians. \n\nMy motto in recovery was \"sounds wrong but I'll give it a try it\". \n\nAnd guess what, everything they told me to do worked. Because this is their job. Clinicians might not always be perfect but they sure know how to care for you better than you do right now. Literally anything is a step up from what you are doing right now.",
          "created_utc": 1634740411.0
        }
      ]
    },
    {
      "id": "hi8dn3e",
      "author": "lothar42",
      "body": "Thank you for your perspective.\n\nBut...what's the difference between \"eat 6,000 kcal reasonably\" and \"eat 6,000kcal of all I want\"? I do expect to gain weight by eating all I want, I would just hope for it not to be excessive and for my hunger to die down at some point.\n\nAlso, I've tried 3,000kcal for months, and they've done nothing :( (except make me gain weight obvs) And personally I've found that dietitians would always hesitate to give me anything more than 2,500 at the most.\n\nAnd also, it's not like I *don't know* how to eat normally or reasonably...I do know how. I just don't want it because it feels restrictive, and if I have to restrict, then I might as well do it on my own terms.",
      "created_utc": 1635332249.0,
      "score": 1,
      "context": [
        {
          "id": "hhr0qlp",
          "author": "houston_veronica",
          "body": "OP, I truly understand your feelings.\n1. I was dx'd at age 30.\n2. I could not - for the life of me - attribute how ED was related to any issues of \"control\"; I had a beautiful childhood with a wonderful family, faith and all my needs met. No idea why the ED found me...except that my grandma, sister, niece and - to some degree my brother - all have EDs or ED-issues.  My sister and niece were full-on.\n\nWhile I believe in heredity's role, the truth is, I could not figure out why I am so \"fat-phobic\". I can look at someone who others may criticize as \"overweight\", and see nothing but beauty and grace in them. But - in myself - I simply cannot stand the idea of having to gain weight or becoming \"average\". I will never understand that, after having made it to age 30 and never thinking twice about this matter. (I had no problem ever - unless you count the few times growing up that I wanted to look better in a bikini, or admired some model, or whatnot. It was not an issue, and I would never, ever \"Diet\". I found diets so sad.)\n\nBUT: as it turns out, here I am. 17 years of restrictive anorexia. I have received treatment, and like you, I thought \"what could I learn or understand that I don't ALREADY know? I can write a book on nutrition, proper serving sizes, the idea that \"restriction makes you obsess\", \"secrets keep you sick\" and all the other things we learn in recovery.\nProblem is: you've got a real problem.\n\n- You don't want to gain weight, so you restrict all week and BP on the weekends. How is this actually working for you?...it seems like it sucks, from what I'm reading.  \n----> So let's say you actually follow the plan of an RD, that you deem \"restrictive\" because they won't let you eat 10 bowls of cereal or whatever you prefer.  How is their role in teaching you to try and eat more often, more reasonably, ANYWHERE as restrictive as you \"restricting all week\"?\nI don't deny that you have this feeling, and I understand what you feel.  You basically want carte blanche to eat all of anything and everything, and somehow not gain weight, and somehow not feel limited.\n\nThere is no such thing. You will either eat all you want, and gain the weight. Or, you will learn to eat reasonably, and eventually \"settle\" at a weight that is right for you*.\n*BY \"eat reasonably\" - and I speak from experience - meal plans for recovery can be as high as six-thousand calories. Eventually, that much food will make you feel extremely uncomfortable and to maintain, your body and mind will naturally desire that you stop eating at the amount that is RIGHT for your body.\nBut, to get to that point, you do have to eat a LOT.  No treatment center is going to put you on a diet when recovering from RAN. If that's what you have. (along with BP.)",
          "created_utc": 1635003681.0
        }
      ]
    },
    {
      "id": "hhfu788",
      "author": "runninginbubbles",
      "body": "Hey, thanks for replying. I do agree with a lot of what you say, and totally believe that some people have a biological genetic predisposition to eating disorders, I think mine is too.\n\nWhile the 'cause' doesn't necessarily need to be psychological, the reason we *hold on* to our EDs, and are so resistant to treatment, is very much a psychological thing. This is what I mean by 'a purpose.' If our ED gave us no perceived benefit, or served no purpose, we'd give it up in an instant. But there is SOMETHING that keeps us hooked onto the thoughts. And for you it sounds like it's partly phobia of weight gain. Which is common in EDs, but it is psychological, and it's irrational - gaining weight is not a bad thing. You will not binge yourself to death, you will not become morbidly obese. (All phobias are psychological. And my grandma did a fear-of-flying course, they absolutely do share the chances of being in a crash - the minimal risk actually helps people realise planes are safe)\n\nNo one is 'judging you' or making you restrict. If you had three bowls of cereal at home, you'd probably restrict later on to compensate? That's contributing to this binge/restrict cycle. In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. In a few hours, you may be given a snack, and then lunch. That's what normal eating is. Until your brain knows that it will get food soon, it will constantly be urging you to binge.  You cannot trust your own brain right now to tell you what it needs, because it's starving. You need other people to make those decisions, and not wanting to do so, is a form of needing 'control.' You need to re-wire your brain, and the only way to do that is sustained, regular eating patterns. And if you can't do that in the community, you will need residential care to fix it.\n\n**Unfortunately with recovery, the only way through is to allow yourself to feel the guilt and discomfort when you binge, without purging, and without restricting. You will binge, it will happen. But you have to learn to sit with it and not compensate, that is the only way to stop doing so. You need to gain to a healthy weight, and you will feel fat. Recovery is uncomfortable. You will feel all the things that were suppressed by your ED.  And sometimes I believe that it's only during recovery, that we realise what exactly what our ED served us, what it's purpose was and the reason we relied so heavily on it.**",
      "created_utc": 1634780517.0,
      "score": 2,
      "context": [
        {
          "id": "hhbbu5o",
          "author": "runninginbubbles",
          "body": "I am really confused here. What exactly DO you want? You don't want inpatient, and you don't want outpatient. You don't want professionals who are educated to help you, you don't want anything that resembles a meal plan, you don't want anyone to enforce normal eating habits.What actually does *effective help* mean to you?\n\nI'm also curious, what is your ED about? What purpose does it serve? Why are you scared of change? If what you're saying is true - there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that? Why can't you binge and not purge, knowing that eventually your body will not longer need to binge? You obviously cannot be afraid of gaining weight if you are worried that treatment restricts your eating, most people are terrified of being given too much. \n\nI feel like you just want this magic wand waved, but thats not going to happen. You can recover on your own - you know what you need to do and you have the desire to do it - so go ahead? Most people who need treatment centres do so to learn the exact things you don't want a bar of (portion control, meal times etc) and to work through whats driving the ED (control/emotions etc which do not appear to apply to you).\n\nIf you do not want to go residential or outpatient, my practical advice would be to read Brain over Binge. Once you've committed yourself to stop purging and stop restricting, you will stop binging too. But it has to be in that order. It sounds too easy, but the way you're describing your ED, it sounds 'too easy,' I'm not sure if it's denial, but I really want you to think about WHY change is so hard. Because from what you've said, it's very much ALL about control.",
          "created_utc": 1634696860.0
        },
        {
          "id": "hhbv60l",
          "author": "lothar42",
          "body": "Hey, I'm OP, and since you brought up a lot of interesting questions and I did post similar threads on other subs already I thought I might as well show up and reply.\n\nHonestly, I don't even think my ED is \"about\" anything. I don't think there necessarily needs to be a \"purpose\" behind an ED, not a psychological one at least. At this point I think at least in my case it's primarily a biological thing. There might have been some psychological issues at play but whatever they were they're gone.\n\nMy ED developed out of the blue when I was an adult and I had no particular issues with food, myself or my body. I always had normal eating patterns before my ED and I'm very aware of how a normal person eats, which is why I don't need anyone \"teaching\" me. I know what goes with what and how a normal portion looks like etc. Once I showed my dietitian an example of what I'd eat pre ED and he said it's very close to what he would prescribe as a meal plan. I started losing weight for unrelated reasons and then it just kind of spiraled into an ED. I developed a strong fear of eating and gaining weight. After a while I sought the help of therapists, and basically the current one immediately told me it was about \"control\" and that in order to get rid of my ED I needed to realize that I didn't need \"control\" and that I had to face what made me feel \"out of control\".\n\nSo I thought, well, it must be right. I didn't know anything about EDs, and he was a professional, so I should trust him. I was very compliant with therapy and practised all his suggestions religiously, but after a long time and no change in terms of ED behaviours I started questioning all of it. I started realizing that it was actually (and still is) the ED itself that makes me feel \"out of control\", and that despite the good intentions of my therapist none of what he said *truly* reasonated within me. Actually it was making me worse, because focusing on the \"mental side\" just made me more and more entrenched in my daily ED routines to the point that I nearly got hospitalized. \n\nAt this point I started educating myself on the biological roots of an ED and I began viewing myself as someone with a phobia of flying. You can't \"just stop\" being scared of planes and \"just hop on a plane\" - you'll probably need assistance. But at the same time you wouldn't want a treatment center to tell you that hey, planes do crash, so you might wanna be cautious there!, cause that's just gonna feel counterproductive isn't it? \n\nEssentially I have a strong phobia of gaining weight. Plus I had someone in my family died of obesity-related health issues and I don't want that to happen to me. But I know that if I stop restricting I'll just binge myself to death (which is also why \"Brain over Binge\" never worked - I cannot \"stop restricting\" without binging). So basically I'd need someone that helps me with the transition without judging, and while reassuring me that at some point the binges will stop and I will settle down at a normal weight and I won't need to restrict anymore. Problem is, all the therapists I've met focus on unrelated stuff like control and all the dietitians do judge me if I eat \"too much\", e.g. if I eat three bowls of cereals in the morning instead of one and maybe then I finish the whole box before lunch together with other stuff. \n\nObviously I am also terrified of being given too much. But I know that a treatment center is never gonna give you \"too much\". I am terrified of *me* giving myself too much. At the same time, I'd rather keep restricting on my own terms than being made to restrict by a treatment team, which would feel incredibly soul crushing - it's like being teased with something you want and then seeing it go away. You'll think \"well why did you ever showed that to me in the first place, I'd rather not see it at all then\". One measly single muffin as a snack won't cut it. It's an out of sight out of mind kinda thing for me. It's just so hard to see the point of recovery when those who are supposed to help you recover promote habits that look and sound so similar to your ED.\n\nBasically the reason why I restrict these days is because then I know that if I binge the consequences in terms of weight gain won't be too terrible. In fact, when I'm VERY underweight, then sometimes I manage to let myself binge without feeling the need to purge afterwards.\n\nBy the way, I did explain all of this to my therapist multiple times in great detail. I made an effort to be constructive and see whether we could find a common ground. But I've only been met with a slightly condescending attitude like I was a poor fool who had just read way too much baseless quack pseudoscience somewhere online instead of trusting educated professionals like him. And that left me angry and frustrated - because I got tired of always being told I was in denial and never being listened to and got tired of him never wanting to question his own approach despite it not actually working.\n\nInitially I also told myself that maybe I *was* in denial, so I stuck to therapy and did my best to try and follow my therapist advice instead of being confrontational about it. And I have to say, it did help me with a lot of things in my life...but the ED habits only got worse and grew more and more unrelated to my emotional state.\n\nHonestly the people who've actually been able to help me somewhat are my parents and my friends, who basically always told me that my binges were just a response to restriction and they would ultimately go away. But of course they cannot just stay with me 24/7 and they're also humans so they snap and get tired of listening to my constant panic attacks everytime I eat \"too much\" and talking me out of them.\n\n> there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that?\n\n>you know what you need to do and you have the desire to do it - so go ahead? \n\nThat sounds true for most ED sufferers though, and for any phobia for that matter. There is nothing stopping us. I do know what I need to do and I want to do it - but I'm too terrified to actually do it. Sometimes I try - aka I binge - and I'm happy for a while, but then the fear kicks in and I purge.",
          "created_utc": 1634707925.0
        }
      ]
    },
    {
      "id": "hhdv82y",
      "author": "None",
      "body": "No it didn't really answer why meal plans that you make wouldn't work. If you set the meals in between restrictive and bingeing while you tackle your \"phobia\", why would that still be restricting? You'd have to force it for a while as you work through phobias with your therapist. If your eating isn't disorder based, why are you in eating disorder therapy? You could be seeking therapy for pocrescophobia if that's what you believe you have. There are lots of phobias that restrict food intake/mess with our relationship to food, I would drop the eating disorder aspect since that's not what it is and go into therapy for phobia that affects your ability to eat. And your bping because you're body makes you eat after all that restricting.\n\n*The quotes around phobia are not meant as sarcasm, just a direct quote from your reply 🙂 didn't want you to think I didn't believe you or anything.",
      "created_utc": 1634750448.0,
      "score": 6,
      "context": [
        {
          "id": "hhb5fik",
          "author": "None",
          "body": "Why do you think you need to go into a treatment center to get treated? You can definitely work with professionals outside of a treatment center. \n\nSo what do you feel like your Ed is about? If it's not about control or weightloss or fear then what?\n\nIt's obvious that your bping on the weekends because you restrict on the weekdays. So how wouldn't a meal plan help you eat more on the weekdays so your not bping on the weekends? You could set the meals as literally whatever you want if you do it at home.... So why would it be restrictive if you WANT to eat more. Because clearly what your doing isn't working at all. So what's left to try. What exactly are you wanting to try. Because it seems like you just shut down every option without knowing that an option would even be.",
          "created_utc": 1634693818.0
        },
        {
          "id": "hhcftd1",
          "author": "lothar42",
          "body": "I'm OP, and I wrote a reply to a comment right above answering to some of your questions. :)",
          "created_utc": 1634725588.0
        }
      ]
    },
    {
      "id": "hhe4rih",
      "author": "dido_and-zdenka",
      "body": "Oh, goodness, I am so angry on your behalf reading these comments from your treatment team! They are not recovery friendly at all and I can't imagine why they thought it was appropriate to tell you they were dieting....! What the actual hell. \n\nOthers here have recommended Tabitha Farrar's work. It's not perfect all the time but it honestly saved my life, personally. I had the same infuriating overpsychologising of my binge eating episodes (which for me personally were because I was *hungry*, not emotional, due to *not getting enough food*). You sound like you might be in the same place with that. I also really struggled with professionals who were very diet culture- y and triggering and I recovered with a mixture of my own efforts and professionals who had a non-restrictive approach. \n\nIf you're able to find a professional with a non-restrictive approach then that would probably be best but in the meantime I'd definitely recommend looking up resources like the above. \n\nI hope you find what you need soon 😊",
      "created_utc": 1634754253.0,
      "score": 2,
      "context": [
        {
          "id": "hhd69yb",
          "author": "updown27",
          "body": "It's extremely common to resist treatment because you believe the clinicians don't know what they're doing and/or will somehow make your condition worse. The truth is that your eating disorder will convince you of ANYTHING to save itself. You cannot trust yourself to guide your own recovery because your eating disorder voice is still too loud and very much integrated into your own psyche. \n\nIf you want to live, you MUST relinquish control of your treatment and trust your clinicians. \n\nMy motto in recovery was \"sounds wrong but I'll give it a try it\". \n\nAnd guess what, everything they told me to do worked. Because this is their job. Clinicians might not always be perfect but they sure know how to care for you better than you do right now. Literally anything is a step up from what you are doing right now.",
          "created_utc": 1634740411.0
        },
        {
          "id": "hhdd63j",
          "author": "lothar42",
          "body": "I'm OP. I've done what clinicians told me for years. Often religiously and to the T. Never worked. I'm tired now.\n\nAlso I've had clinicians \n\n-advising me not to drink full fat milk (which I used to even during my ED) and switch to semi skimmed at breakfast. Guess what - never drank full fat since then.\n\n-telling me that binging was just a strategy to distract away from unpleasant emotions - mind you, I was dangerously underweight at that point and heavily restricting on a daily basis to the point that I had trouble climbing the stairs, and I would binge on broccoli or leftover chicken because I was starving to death.\n\n-telling me that 100 g of pasta was too much, 80 was the standard portion and I should use a scale to measure it.\n\n-\"scolding\" me because I had eaten more cereal than my meal plan.\n\n-telling me that they also were on a diet.\n\nI no longer trust my clinicians and I'm no longer gonna do what they tell me. Sorry not sorry. I do not share this view of clinicians necessarily knowing better. I'm glad it worked for you, but it blows my mind how EDs have the most dismal statistics - I think it's something like 1 in 2 people never fully recovering and 1 out of 5 dying - but instead of being a wake up call for clinicians to find new therapy approaches ASAP as a matter of urgency, it gets dismissed as just the patients being difficult.",
          "created_utc": 1634743282.0
        }
      ]
    },
    {
      "id": "hhgjvpe",
      "author": "lothar42",
      "body": ">  In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. \n\nYes, and that's the problem I have with treatment. How is it not restriction, if I want more than one bowl? My ED brain also \"teaches\" me to never eat more than one bowl during normal days, or more than one fist of protein, or more than x grams of rice, even if I want more. So I literally cannot see the difference. Shouldn't recovery be about making me eat without any kind of restriction? And if it isn't, then how is it different from the ED itself, and why whould I bother embarking in recovery with a treatment center if I'm gonna have to restrict anyway? My brain is not just magically gonna stop wanting more than one bowl just because someone else says so, otherwise after years of carefully crafted meal plans I'd be 100% recovered.\n\nWith your reply you keep hinting that binging is somehow \"wrong\", that I should not trust my own brain because it will make me binge and that's a problem because...? This is literally why I'm scared of recovering - because I've been taught that binging or even just \"the urge to eat more\" is bad. What happens if in a treatment center I want three bowls and not one? Will I be denied more food because the urge to eat more is bad?? Will I get told to stick to one bowl, and with what motivation? What they will use as a threat against it? What's the problem if I respond to the urge to eat more? My ED brain thinks the urge to eat more is a huge problem and I'm VERY well trained to sit with it - honestly I'd hope a treatment center would be the opposite.\n\nYou just wrote that in a treatment center I can expect they will make me eat less than I want to. Why would I wanna go there?? Actually why would anyone recover there? You're just confirming each and every one of my fears, and I'd rather restrict on my own terms so that at least I can eat whatever I want on the weekends. \n\nGosh this makes me *so* mad. Treatment needs to change asap.",
      "created_utc": 1634794726.0,
      "score": 1,
      "context": [
        {
          "id": "hhbbu5o",
          "author": "runninginbubbles",
          "body": "I am really confused here. What exactly DO you want? You don't want inpatient, and you don't want outpatient. You don't want professionals who are educated to help you, you don't want anything that resembles a meal plan, you don't want anyone to enforce normal eating habits.What actually does *effective help* mean to you?\n\nI'm also curious, what is your ED about? What purpose does it serve? Why are you scared of change? If what you're saying is true - there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that? Why can't you binge and not purge, knowing that eventually your body will not longer need to binge? You obviously cannot be afraid of gaining weight if you are worried that treatment restricts your eating, most people are terrified of being given too much. \n\nI feel like you just want this magic wand waved, but thats not going to happen. You can recover on your own - you know what you need to do and you have the desire to do it - so go ahead? Most people who need treatment centres do so to learn the exact things you don't want a bar of (portion control, meal times etc) and to work through whats driving the ED (control/emotions etc which do not appear to apply to you).\n\nIf you do not want to go residential or outpatient, my practical advice would be to read Brain over Binge. Once you've committed yourself to stop purging and stop restricting, you will stop binging too. But it has to be in that order. It sounds too easy, but the way you're describing your ED, it sounds 'too easy,' I'm not sure if it's denial, but I really want you to think about WHY change is so hard. Because from what you've said, it's very much ALL about control.",
          "created_utc": 1634696860.0
        },
        {
          "id": "hhbv60l",
          "author": "lothar42",
          "body": "Hey, I'm OP, and since you brought up a lot of interesting questions and I did post similar threads on other subs already I thought I might as well show up and reply.\n\nHonestly, I don't even think my ED is \"about\" anything. I don't think there necessarily needs to be a \"purpose\" behind an ED, not a psychological one at least. At this point I think at least in my case it's primarily a biological thing. There might have been some psychological issues at play but whatever they were they're gone.\n\nMy ED developed out of the blue when I was an adult and I had no particular issues with food, myself or my body. I always had normal eating patterns before my ED and I'm very aware of how a normal person eats, which is why I don't need anyone \"teaching\" me. I know what goes with what and how a normal portion looks like etc. Once I showed my dietitian an example of what I'd eat pre ED and he said it's very close to what he would prescribe as a meal plan. I started losing weight for unrelated reasons and then it just kind of spiraled into an ED. I developed a strong fear of eating and gaining weight. After a while I sought the help of therapists, and basically the current one immediately told me it was about \"control\" and that in order to get rid of my ED I needed to realize that I didn't need \"control\" and that I had to face what made me feel \"out of control\".\n\nSo I thought, well, it must be right. I didn't know anything about EDs, and he was a professional, so I should trust him. I was very compliant with therapy and practised all his suggestions religiously, but after a long time and no change in terms of ED behaviours I started questioning all of it. I started realizing that it was actually (and still is) the ED itself that makes me feel \"out of control\", and that despite the good intentions of my therapist none of what he said *truly* reasonated within me. Actually it was making me worse, because focusing on the \"mental side\" just made me more and more entrenched in my daily ED routines to the point that I nearly got hospitalized. \n\nAt this point I started educating myself on the biological roots of an ED and I began viewing myself as someone with a phobia of flying. You can't \"just stop\" being scared of planes and \"just hop on a plane\" - you'll probably need assistance. But at the same time you wouldn't want a treatment center to tell you that hey, planes do crash, so you might wanna be cautious there!, cause that's just gonna feel counterproductive isn't it? \n\nEssentially I have a strong phobia of gaining weight. Plus I had someone in my family died of obesity-related health issues and I don't want that to happen to me. But I know that if I stop restricting I'll just binge myself to death (which is also why \"Brain over Binge\" never worked - I cannot \"stop restricting\" without binging). So basically I'd need someone that helps me with the transition without judging, and while reassuring me that at some point the binges will stop and I will settle down at a normal weight and I won't need to restrict anymore. Problem is, all the therapists I've met focus on unrelated stuff like control and all the dietitians do judge me if I eat \"too much\", e.g. if I eat three bowls of cereals in the morning instead of one and maybe then I finish the whole box before lunch together with other stuff. \n\nObviously I am also terrified of being given too much. But I know that a treatment center is never gonna give you \"too much\". I am terrified of *me* giving myself too much. At the same time, I'd rather keep restricting on my own terms than being made to restrict by a treatment team, which would feel incredibly soul crushing - it's like being teased with something you want and then seeing it go away. You'll think \"well why did you ever showed that to me in the first place, I'd rather not see it at all then\". One measly single muffin as a snack won't cut it. It's an out of sight out of mind kinda thing for me. It's just so hard to see the point of recovery when those who are supposed to help you recover promote habits that look and sound so similar to your ED.\n\nBasically the reason why I restrict these days is because then I know that if I binge the consequences in terms of weight gain won't be too terrible. In fact, when I'm VERY underweight, then sometimes I manage to let myself binge without feeling the need to purge afterwards.\n\nBy the way, I did explain all of this to my therapist multiple times in great detail. I made an effort to be constructive and see whether we could find a common ground. But I've only been met with a slightly condescending attitude like I was a poor fool who had just read way too much baseless quack pseudoscience somewhere online instead of trusting educated professionals like him. And that left me angry and frustrated - because I got tired of always being told I was in denial and never being listened to and got tired of him never wanting to question his own approach despite it not actually working.\n\nInitially I also told myself that maybe I *was* in denial, so I stuck to therapy and did my best to try and follow my therapist advice instead of being confrontational about it. And I have to say, it did help me with a lot of things in my life...but the ED habits only got worse and grew more and more unrelated to my emotional state.\n\nHonestly the people who've actually been able to help me somewhat are my parents and my friends, who basically always told me that my binges were just a response to restriction and they would ultimately go away. But of course they cannot just stay with me 24/7 and they're also humans so they snap and get tired of listening to my constant panic attacks everytime I eat \"too much\" and talking me out of them.\n\n> there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that?\n\n>you know what you need to do and you have the desire to do it - so go ahead? \n\nThat sounds true for most ED sufferers though, and for any phobia for that matter. There is nothing stopping us. I do know what I need to do and I want to do it - but I'm too terrified to actually do it. Sometimes I try - aka I binge - and I'm happy for a while, but then the fear kicks in and I purge.",
          "created_utc": 1634707925.0
        },
        {
          "id": "hhfu788",
          "author": "runninginbubbles",
          "body": "Hey, thanks for replying. I do agree with a lot of what you say, and totally believe that some people have a biological genetic predisposition to eating disorders, I think mine is too.\n\nWhile the 'cause' doesn't necessarily need to be psychological, the reason we *hold on* to our EDs, and are so resistant to treatment, is very much a psychological thing. This is what I mean by 'a purpose.' If our ED gave us no perceived benefit, or served no purpose, we'd give it up in an instant. But there is SOMETHING that keeps us hooked onto the thoughts. And for you it sounds like it's partly phobia of weight gain. Which is common in EDs, but it is psychological, and it's irrational - gaining weight is not a bad thing. You will not binge yourself to death, you will not become morbidly obese. (All phobias are psychological. And my grandma did a fear-of-flying course, they absolutely do share the chances of being in a crash - the minimal risk actually helps people realise planes are safe)\n\nNo one is 'judging you' or making you restrict. If you had three bowls of cereal at home, you'd probably restrict later on to compensate? That's contributing to this binge/restrict cycle. In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. In a few hours, you may be given a snack, and then lunch. That's what normal eating is. Until your brain knows that it will get food soon, it will constantly be urging you to binge.  You cannot trust your own brain right now to tell you what it needs, because it's starving. You need other people to make those decisions, and not wanting to do so, is a form of needing 'control.' You need to re-wire your brain, and the only way to do that is sustained, regular eating patterns. And if you can't do that in the community, you will need residential care to fix it.\n\n**Unfortunately with recovery, the only way through is to allow yourself to feel the guilt and discomfort when you binge, without purging, and without restricting. You will binge, it will happen. But you have to learn to sit with it and not compensate, that is the only way to stop doing so. You need to gain to a healthy weight, and you will feel fat. Recovery is uncomfortable. You will feel all the things that were suppressed by your ED.  And sometimes I believe that it's only during recovery, that we realise what exactly what our ED served us, what it's purpose was and the reason we relied so heavily on it.**",
          "created_utc": 1634780517.0
        }
      ]
    },
    {
      "id": "hhe3mem",
      "author": "lothar42",
      "body": "A meal plan would be restrictive because I want more than that. Unless the meal plan is like 10,000kcals but I'm not sure anyone would prescribe such a thing :D\n\nI mean, during my \"restriction days\" I don't eat that much differently from a standard meal plan anyway. I don't go to crazy lows usually.\n\nThe point about me seeking therapy for something else is actually great because I've been internally asking myself whether I do have an ED or not. But tbh I think that the phobia of gaining weight is in itself a defining characteristic of pretty much any ED so I do believe I still qualify. I do not think you have to have a certain background or underlying issue to have an ED if that makes sense. Plus it's absolutely interfering with my daily life and I do display many classic signs (purging being the most obvious one).",
      "created_utc": 1634753798.0,
      "score": 0,
      "context": [
        {
          "id": "hhb5fik",
          "author": "None",
          "body": "Why do you think you need to go into a treatment center to get treated? You can definitely work with professionals outside of a treatment center. \n\nSo what do you feel like your Ed is about? If it's not about control or weightloss or fear then what?\n\nIt's obvious that your bping on the weekends because you restrict on the weekdays. So how wouldn't a meal plan help you eat more on the weekdays so your not bping on the weekends? You could set the meals as literally whatever you want if you do it at home.... So why would it be restrictive if you WANT to eat more. Because clearly what your doing isn't working at all. So what's left to try. What exactly are you wanting to try. Because it seems like you just shut down every option without knowing that an option would even be.",
          "created_utc": 1634693818.0
        },
        {
          "id": "hhcftd1",
          "author": "lothar42",
          "body": "I'm OP, and I wrote a reply to a comment right above answering to some of your questions. :)",
          "created_utc": 1634725588.0
        },
        {
          "id": "hhdv82y",
          "author": "None",
          "body": "No it didn't really answer why meal plans that you make wouldn't work. If you set the meals in between restrictive and bingeing while you tackle your \"phobia\", why would that still be restricting? You'd have to force it for a while as you work through phobias with your therapist. If your eating isn't disorder based, why are you in eating disorder therapy? You could be seeking therapy for pocrescophobia if that's what you believe you have. There are lots of phobias that restrict food intake/mess with our relationship to food, I would drop the eating disorder aspect since that's not what it is and go into therapy for phobia that affects your ability to eat. And your bping because you're body makes you eat after all that restricting.\n\n*The quotes around phobia are not meant as sarcasm, just a direct quote from your reply 🙂 didn't want you to think I didn't believe you or anything.",
          "created_utc": 1634750448.0
        }
      ]
    },
    {
      "id": "hhgmssn",
      "author": "runninginbubbles",
      "body": "Okay, so say we let you eat without restriction? What will happen? You'll binge? Then what, you'll panic, and purge or restrict? A person who is so deep in their ED cannot make decisions around food, your decision is too clouded by what your ED has to say about it. You need to let someone make the decisions for you, and accept that perhaps you don't know best when you're in this frame of mind. You being combative isn't helping. A treatment centre won't make you restrict. \nBinge eating is self harm behaviour, so I'm not going to say it's good. Look, the only way you're going to stop binging is by NOT restricting or purging afterwards. You have to be able to sit with a binge.",
      "created_utc": 1634796942.0,
      "score": 1,
      "context": [
        {
          "id": "hhbbu5o",
          "author": "runninginbubbles",
          "body": "I am really confused here. What exactly DO you want? You don't want inpatient, and you don't want outpatient. You don't want professionals who are educated to help you, you don't want anything that resembles a meal plan, you don't want anyone to enforce normal eating habits.What actually does *effective help* mean to you?\n\nI'm also curious, what is your ED about? What purpose does it serve? Why are you scared of change? If what you're saying is true - there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that? Why can't you binge and not purge, knowing that eventually your body will not longer need to binge? You obviously cannot be afraid of gaining weight if you are worried that treatment restricts your eating, most people are terrified of being given too much. \n\nI feel like you just want this magic wand waved, but thats not going to happen. You can recover on your own - you know what you need to do and you have the desire to do it - so go ahead? Most people who need treatment centres do so to learn the exact things you don't want a bar of (portion control, meal times etc) and to work through whats driving the ED (control/emotions etc which do not appear to apply to you).\n\nIf you do not want to go residential or outpatient, my practical advice would be to read Brain over Binge. Once you've committed yourself to stop purging and stop restricting, you will stop binging too. But it has to be in that order. It sounds too easy, but the way you're describing your ED, it sounds 'too easy,' I'm not sure if it's denial, but I really want you to think about WHY change is so hard. Because from what you've said, it's very much ALL about control.",
          "created_utc": 1634696860.0
        },
        {
          "id": "hhbv60l",
          "author": "lothar42",
          "body": "Hey, I'm OP, and since you brought up a lot of interesting questions and I did post similar threads on other subs already I thought I might as well show up and reply.\n\nHonestly, I don't even think my ED is \"about\" anything. I don't think there necessarily needs to be a \"purpose\" behind an ED, not a psychological one at least. At this point I think at least in my case it's primarily a biological thing. There might have been some psychological issues at play but whatever they were they're gone.\n\nMy ED developed out of the blue when I was an adult and I had no particular issues with food, myself or my body. I always had normal eating patterns before my ED and I'm very aware of how a normal person eats, which is why I don't need anyone \"teaching\" me. I know what goes with what and how a normal portion looks like etc. Once I showed my dietitian an example of what I'd eat pre ED and he said it's very close to what he would prescribe as a meal plan. I started losing weight for unrelated reasons and then it just kind of spiraled into an ED. I developed a strong fear of eating and gaining weight. After a while I sought the help of therapists, and basically the current one immediately told me it was about \"control\" and that in order to get rid of my ED I needed to realize that I didn't need \"control\" and that I had to face what made me feel \"out of control\".\n\nSo I thought, well, it must be right. I didn't know anything about EDs, and he was a professional, so I should trust him. I was very compliant with therapy and practised all his suggestions religiously, but after a long time and no change in terms of ED behaviours I started questioning all of it. I started realizing that it was actually (and still is) the ED itself that makes me feel \"out of control\", and that despite the good intentions of my therapist none of what he said *truly* reasonated within me. Actually it was making me worse, because focusing on the \"mental side\" just made me more and more entrenched in my daily ED routines to the point that I nearly got hospitalized. \n\nAt this point I started educating myself on the biological roots of an ED and I began viewing myself as someone with a phobia of flying. You can't \"just stop\" being scared of planes and \"just hop on a plane\" - you'll probably need assistance. But at the same time you wouldn't want a treatment center to tell you that hey, planes do crash, so you might wanna be cautious there!, cause that's just gonna feel counterproductive isn't it? \n\nEssentially I have a strong phobia of gaining weight. Plus I had someone in my family died of obesity-related health issues and I don't want that to happen to me. But I know that if I stop restricting I'll just binge myself to death (which is also why \"Brain over Binge\" never worked - I cannot \"stop restricting\" without binging). So basically I'd need someone that helps me with the transition without judging, and while reassuring me that at some point the binges will stop and I will settle down at a normal weight and I won't need to restrict anymore. Problem is, all the therapists I've met focus on unrelated stuff like control and all the dietitians do judge me if I eat \"too much\", e.g. if I eat three bowls of cereals in the morning instead of one and maybe then I finish the whole box before lunch together with other stuff. \n\nObviously I am also terrified of being given too much. But I know that a treatment center is never gonna give you \"too much\". I am terrified of *me* giving myself too much. At the same time, I'd rather keep restricting on my own terms than being made to restrict by a treatment team, which would feel incredibly soul crushing - it's like being teased with something you want and then seeing it go away. You'll think \"well why did you ever showed that to me in the first place, I'd rather not see it at all then\". One measly single muffin as a snack won't cut it. It's an out of sight out of mind kinda thing for me. It's just so hard to see the point of recovery when those who are supposed to help you recover promote habits that look and sound so similar to your ED.\n\nBasically the reason why I restrict these days is because then I know that if I binge the consequences in terms of weight gain won't be too terrible. In fact, when I'm VERY underweight, then sometimes I manage to let myself binge without feeling the need to purge afterwards.\n\nBy the way, I did explain all of this to my therapist multiple times in great detail. I made an effort to be constructive and see whether we could find a common ground. But I've only been met with a slightly condescending attitude like I was a poor fool who had just read way too much baseless quack pseudoscience somewhere online instead of trusting educated professionals like him. And that left me angry and frustrated - because I got tired of always being told I was in denial and never being listened to and got tired of him never wanting to question his own approach despite it not actually working.\n\nInitially I also told myself that maybe I *was* in denial, so I stuck to therapy and did my best to try and follow my therapist advice instead of being confrontational about it. And I have to say, it did help me with a lot of things in my life...but the ED habits only got worse and grew more and more unrelated to my emotional state.\n\nHonestly the people who've actually been able to help me somewhat are my parents and my friends, who basically always told me that my binges were just a response to restriction and they would ultimately go away. But of course they cannot just stay with me 24/7 and they're also humans so they snap and get tired of listening to my constant panic attacks everytime I eat \"too much\" and talking me out of them.\n\n> there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that?\n\n>you know what you need to do and you have the desire to do it - so go ahead? \n\nThat sounds true for most ED sufferers though, and for any phobia for that matter. There is nothing stopping us. I do know what I need to do and I want to do it - but I'm too terrified to actually do it. Sometimes I try - aka I binge - and I'm happy for a while, but then the fear kicks in and I purge.",
          "created_utc": 1634707925.0
        },
        {
          "id": "hhfu788",
          "author": "runninginbubbles",
          "body": "Hey, thanks for replying. I do agree with a lot of what you say, and totally believe that some people have a biological genetic predisposition to eating disorders, I think mine is too.\n\nWhile the 'cause' doesn't necessarily need to be psychological, the reason we *hold on* to our EDs, and are so resistant to treatment, is very much a psychological thing. This is what I mean by 'a purpose.' If our ED gave us no perceived benefit, or served no purpose, we'd give it up in an instant. But there is SOMETHING that keeps us hooked onto the thoughts. And for you it sounds like it's partly phobia of weight gain. Which is common in EDs, but it is psychological, and it's irrational - gaining weight is not a bad thing. You will not binge yourself to death, you will not become morbidly obese. (All phobias are psychological. And my grandma did a fear-of-flying course, they absolutely do share the chances of being in a crash - the minimal risk actually helps people realise planes are safe)\n\nNo one is 'judging you' or making you restrict. If you had three bowls of cereal at home, you'd probably restrict later on to compensate? That's contributing to this binge/restrict cycle. In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. In a few hours, you may be given a snack, and then lunch. That's what normal eating is. Until your brain knows that it will get food soon, it will constantly be urging you to binge.  You cannot trust your own brain right now to tell you what it needs, because it's starving. You need other people to make those decisions, and not wanting to do so, is a form of needing 'control.' You need to re-wire your brain, and the only way to do that is sustained, regular eating patterns. And if you can't do that in the community, you will need residential care to fix it.\n\n**Unfortunately with recovery, the only way through is to allow yourself to feel the guilt and discomfort when you binge, without purging, and without restricting. You will binge, it will happen. But you have to learn to sit with it and not compensate, that is the only way to stop doing so. You need to gain to a healthy weight, and you will feel fat. Recovery is uncomfortable. You will feel all the things that were suppressed by your ED.  And sometimes I believe that it's only during recovery, that we realise what exactly what our ED served us, what it's purpose was and the reason we relied so heavily on it.**",
          "created_utc": 1634780517.0
        },
        {
          "id": "hhgjvpe",
          "author": "lothar42",
          "body": ">  In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. \n\nYes, and that's the problem I have with treatment. How is it not restriction, if I want more than one bowl? My ED brain also \"teaches\" me to never eat more than one bowl during normal days, or more than one fist of protein, or more than x grams of rice, even if I want more. So I literally cannot see the difference. Shouldn't recovery be about making me eat without any kind of restriction? And if it isn't, then how is it different from the ED itself, and why whould I bother embarking in recovery with a treatment center if I'm gonna have to restrict anyway? My brain is not just magically gonna stop wanting more than one bowl just because someone else says so, otherwise after years of carefully crafted meal plans I'd be 100% recovered.\n\nWith your reply you keep hinting that binging is somehow \"wrong\", that I should not trust my own brain because it will make me binge and that's a problem because...? This is literally why I'm scared of recovering - because I've been taught that binging or even just \"the urge to eat more\" is bad. What happens if in a treatment center I want three bowls and not one? Will I be denied more food because the urge to eat more is bad?? Will I get told to stick to one bowl, and with what motivation? What they will use as a threat against it? What's the problem if I respond to the urge to eat more? My ED brain thinks the urge to eat more is a huge problem and I'm VERY well trained to sit with it - honestly I'd hope a treatment center would be the opposite.\n\nYou just wrote that in a treatment center I can expect they will make me eat less than I want to. Why would I wanna go there?? Actually why would anyone recover there? You're just confirming each and every one of my fears, and I'd rather restrict on my own terms so that at least I can eat whatever I want on the weekends. \n\nGosh this makes me *so* mad. Treatment needs to change asap.",
          "created_utc": 1634794726.0
        }
      ]
    },
    {
      "id": "hhegu1i",
      "author": "None",
      "body": "But the fear of gaining weight in eating disorder is a manifestation of the control aspect of the Ed which you claim you do not have at all. And since you reject all Ed treatment then you should just drop that identity that you have with that and seek help for a phobia instead 🙂 its like how emetophobia (terrible spelling!!) Will cause severe restriction in sufferers not because they have an eating disorder but because they have an intense irrational fear of getting food poisoning but it would definitely present as an Ed. Of course you don't have that one, just an example of how Ed behaviour can be present without having an Ed.",
      "created_utc": 1634759042.0,
      "score": 2,
      "context": [
        {
          "id": "hhb5fik",
          "author": "None",
          "body": "Why do you think you need to go into a treatment center to get treated? You can definitely work with professionals outside of a treatment center. \n\nSo what do you feel like your Ed is about? If it's not about control or weightloss or fear then what?\n\nIt's obvious that your bping on the weekends because you restrict on the weekdays. So how wouldn't a meal plan help you eat more on the weekdays so your not bping on the weekends? You could set the meals as literally whatever you want if you do it at home.... So why would it be restrictive if you WANT to eat more. Because clearly what your doing isn't working at all. So what's left to try. What exactly are you wanting to try. Because it seems like you just shut down every option without knowing that an option would even be.",
          "created_utc": 1634693818.0
        },
        {
          "id": "hhcftd1",
          "author": "lothar42",
          "body": "I'm OP, and I wrote a reply to a comment right above answering to some of your questions. :)",
          "created_utc": 1634725588.0
        },
        {
          "id": "hhdv82y",
          "author": "None",
          "body": "No it didn't really answer why meal plans that you make wouldn't work. If you set the meals in between restrictive and bingeing while you tackle your \"phobia\", why would that still be restricting? You'd have to force it for a while as you work through phobias with your therapist. If your eating isn't disorder based, why are you in eating disorder therapy? You could be seeking therapy for pocrescophobia if that's what you believe you have. There are lots of phobias that restrict food intake/mess with our relationship to food, I would drop the eating disorder aspect since that's not what it is and go into therapy for phobia that affects your ability to eat. And your bping because you're body makes you eat after all that restricting.\n\n*The quotes around phobia are not meant as sarcasm, just a direct quote from your reply 🙂 didn't want you to think I didn't believe you or anything.",
          "created_utc": 1634750448.0
        },
        {
          "id": "hhe3mem",
          "author": "lothar42",
          "body": "A meal plan would be restrictive because I want more than that. Unless the meal plan is like 10,000kcals but I'm not sure anyone would prescribe such a thing :D\n\nI mean, during my \"restriction days\" I don't eat that much differently from a standard meal plan anyway. I don't go to crazy lows usually.\n\nThe point about me seeking therapy for something else is actually great because I've been internally asking myself whether I do have an ED or not. But tbh I think that the phobia of gaining weight is in itself a defining characteristic of pretty much any ED so I do believe I still qualify. I do not think you have to have a certain background or underlying issue to have an ED if that makes sense. Plus it's absolutely interfering with my daily life and I do display many classic signs (purging being the most obvious one).",
          "created_utc": 1634753798.0
        }
      ]
    },
    {
      "id": "hhgotk9",
      "author": "lothar42",
      "body": ">Then what, you'll panic, and purge or restrict? \n\nThe purpose of therapy should be helping me not do it.\n\n>A treatment centre won't make you restrict. \n\nThey will, if I want more than they give and they don't allow me to get it. Which is exactly what my ED does.\n\nI mean what does restriction even mean then? \n\n>Binge eating is self harm behaviour\n\nSo if a starving boy in Syria binges, he's self harming?\n\nAnd btw, this also sounds very similar to what my ED brain tells me. That binging is bad, that I don't really need that food, and therefore I should keep restricting because it's all just in my head and one bowl of cereal is enough.",
      "created_utc": 1634798585.0,
      "score": 1,
      "context": [
        {
          "id": "hhbbu5o",
          "author": "runninginbubbles",
          "body": "I am really confused here. What exactly DO you want? You don't want inpatient, and you don't want outpatient. You don't want professionals who are educated to help you, you don't want anything that resembles a meal plan, you don't want anyone to enforce normal eating habits.What actually does *effective help* mean to you?\n\nI'm also curious, what is your ED about? What purpose does it serve? Why are you scared of change? If what you're saying is true - there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that? Why can't you binge and not purge, knowing that eventually your body will not longer need to binge? You obviously cannot be afraid of gaining weight if you are worried that treatment restricts your eating, most people are terrified of being given too much. \n\nI feel like you just want this magic wand waved, but thats not going to happen. You can recover on your own - you know what you need to do and you have the desire to do it - so go ahead? Most people who need treatment centres do so to learn the exact things you don't want a bar of (portion control, meal times etc) and to work through whats driving the ED (control/emotions etc which do not appear to apply to you).\n\nIf you do not want to go residential or outpatient, my practical advice would be to read Brain over Binge. Once you've committed yourself to stop purging and stop restricting, you will stop binging too. But it has to be in that order. It sounds too easy, but the way you're describing your ED, it sounds 'too easy,' I'm not sure if it's denial, but I really want you to think about WHY change is so hard. Because from what you've said, it's very much ALL about control.",
          "created_utc": 1634696860.0
        },
        {
          "id": "hhbv60l",
          "author": "lothar42",
          "body": "Hey, I'm OP, and since you brought up a lot of interesting questions and I did post similar threads on other subs already I thought I might as well show up and reply.\n\nHonestly, I don't even think my ED is \"about\" anything. I don't think there necessarily needs to be a \"purpose\" behind an ED, not a psychological one at least. At this point I think at least in my case it's primarily a biological thing. There might have been some psychological issues at play but whatever they were they're gone.\n\nMy ED developed out of the blue when I was an adult and I had no particular issues with food, myself or my body. I always had normal eating patterns before my ED and I'm very aware of how a normal person eats, which is why I don't need anyone \"teaching\" me. I know what goes with what and how a normal portion looks like etc. Once I showed my dietitian an example of what I'd eat pre ED and he said it's very close to what he would prescribe as a meal plan. I started losing weight for unrelated reasons and then it just kind of spiraled into an ED. I developed a strong fear of eating and gaining weight. After a while I sought the help of therapists, and basically the current one immediately told me it was about \"control\" and that in order to get rid of my ED I needed to realize that I didn't need \"control\" and that I had to face what made me feel \"out of control\".\n\nSo I thought, well, it must be right. I didn't know anything about EDs, and he was a professional, so I should trust him. I was very compliant with therapy and practised all his suggestions religiously, but after a long time and no change in terms of ED behaviours I started questioning all of it. I started realizing that it was actually (and still is) the ED itself that makes me feel \"out of control\", and that despite the good intentions of my therapist none of what he said *truly* reasonated within me. Actually it was making me worse, because focusing on the \"mental side\" just made me more and more entrenched in my daily ED routines to the point that I nearly got hospitalized. \n\nAt this point I started educating myself on the biological roots of an ED and I began viewing myself as someone with a phobia of flying. You can't \"just stop\" being scared of planes and \"just hop on a plane\" - you'll probably need assistance. But at the same time you wouldn't want a treatment center to tell you that hey, planes do crash, so you might wanna be cautious there!, cause that's just gonna feel counterproductive isn't it? \n\nEssentially I have a strong phobia of gaining weight. Plus I had someone in my family died of obesity-related health issues and I don't want that to happen to me. But I know that if I stop restricting I'll just binge myself to death (which is also why \"Brain over Binge\" never worked - I cannot \"stop restricting\" without binging). So basically I'd need someone that helps me with the transition without judging, and while reassuring me that at some point the binges will stop and I will settle down at a normal weight and I won't need to restrict anymore. Problem is, all the therapists I've met focus on unrelated stuff like control and all the dietitians do judge me if I eat \"too much\", e.g. if I eat three bowls of cereals in the morning instead of one and maybe then I finish the whole box before lunch together with other stuff. \n\nObviously I am also terrified of being given too much. But I know that a treatment center is never gonna give you \"too much\". I am terrified of *me* giving myself too much. At the same time, I'd rather keep restricting on my own terms than being made to restrict by a treatment team, which would feel incredibly soul crushing - it's like being teased with something you want and then seeing it go away. You'll think \"well why did you ever showed that to me in the first place, I'd rather not see it at all then\". One measly single muffin as a snack won't cut it. It's an out of sight out of mind kinda thing for me. It's just so hard to see the point of recovery when those who are supposed to help you recover promote habits that look and sound so similar to your ED.\n\nBasically the reason why I restrict these days is because then I know that if I binge the consequences in terms of weight gain won't be too terrible. In fact, when I'm VERY underweight, then sometimes I manage to let myself binge without feeling the need to purge afterwards.\n\nBy the way, I did explain all of this to my therapist multiple times in great detail. I made an effort to be constructive and see whether we could find a common ground. But I've only been met with a slightly condescending attitude like I was a poor fool who had just read way too much baseless quack pseudoscience somewhere online instead of trusting educated professionals like him. And that left me angry and frustrated - because I got tired of always being told I was in denial and never being listened to and got tired of him never wanting to question his own approach despite it not actually working.\n\nInitially I also told myself that maybe I *was* in denial, so I stuck to therapy and did my best to try and follow my therapist advice instead of being confrontational about it. And I have to say, it did help me with a lot of things in my life...but the ED habits only got worse and grew more and more unrelated to my emotional state.\n\nHonestly the people who've actually been able to help me somewhat are my parents and my friends, who basically always told me that my binges were just a response to restriction and they would ultimately go away. But of course they cannot just stay with me 24/7 and they're also humans so they snap and get tired of listening to my constant panic attacks everytime I eat \"too much\" and talking me out of them.\n\n> there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that?\n\n>you know what you need to do and you have the desire to do it - so go ahead? \n\nThat sounds true for most ED sufferers though, and for any phobia for that matter. There is nothing stopping us. I do know what I need to do and I want to do it - but I'm too terrified to actually do it. Sometimes I try - aka I binge - and I'm happy for a while, but then the fear kicks in and I purge.",
          "created_utc": 1634707925.0
        },
        {
          "id": "hhfu788",
          "author": "runninginbubbles",
          "body": "Hey, thanks for replying. I do agree with a lot of what you say, and totally believe that some people have a biological genetic predisposition to eating disorders, I think mine is too.\n\nWhile the 'cause' doesn't necessarily need to be psychological, the reason we *hold on* to our EDs, and are so resistant to treatment, is very much a psychological thing. This is what I mean by 'a purpose.' If our ED gave us no perceived benefit, or served no purpose, we'd give it up in an instant. But there is SOMETHING that keeps us hooked onto the thoughts. And for you it sounds like it's partly phobia of weight gain. Which is common in EDs, but it is psychological, and it's irrational - gaining weight is not a bad thing. You will not binge yourself to death, you will not become morbidly obese. (All phobias are psychological. And my grandma did a fear-of-flying course, they absolutely do share the chances of being in a crash - the minimal risk actually helps people realise planes are safe)\n\nNo one is 'judging you' or making you restrict. If you had three bowls of cereal at home, you'd probably restrict later on to compensate? That's contributing to this binge/restrict cycle. In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. In a few hours, you may be given a snack, and then lunch. That's what normal eating is. Until your brain knows that it will get food soon, it will constantly be urging you to binge.  You cannot trust your own brain right now to tell you what it needs, because it's starving. You need other people to make those decisions, and not wanting to do so, is a form of needing 'control.' You need to re-wire your brain, and the only way to do that is sustained, regular eating patterns. And if you can't do that in the community, you will need residential care to fix it.\n\n**Unfortunately with recovery, the only way through is to allow yourself to feel the guilt and discomfort when you binge, without purging, and without restricting. You will binge, it will happen. But you have to learn to sit with it and not compensate, that is the only way to stop doing so. You need to gain to a healthy weight, and you will feel fat. Recovery is uncomfortable. You will feel all the things that were suppressed by your ED.  And sometimes I believe that it's only during recovery, that we realise what exactly what our ED served us, what it's purpose was and the reason we relied so heavily on it.**",
          "created_utc": 1634780517.0
        },
        {
          "id": "hhgjvpe",
          "author": "lothar42",
          "body": ">  In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. \n\nYes, and that's the problem I have with treatment. How is it not restriction, if I want more than one bowl? My ED brain also \"teaches\" me to never eat more than one bowl during normal days, or more than one fist of protein, or more than x grams of rice, even if I want more. So I literally cannot see the difference. Shouldn't recovery be about making me eat without any kind of restriction? And if it isn't, then how is it different from the ED itself, and why whould I bother embarking in recovery with a treatment center if I'm gonna have to restrict anyway? My brain is not just magically gonna stop wanting more than one bowl just because someone else says so, otherwise after years of carefully crafted meal plans I'd be 100% recovered.\n\nWith your reply you keep hinting that binging is somehow \"wrong\", that I should not trust my own brain because it will make me binge and that's a problem because...? This is literally why I'm scared of recovering - because I've been taught that binging or even just \"the urge to eat more\" is bad. What happens if in a treatment center I want three bowls and not one? Will I be denied more food because the urge to eat more is bad?? Will I get told to stick to one bowl, and with what motivation? What they will use as a threat against it? What's the problem if I respond to the urge to eat more? My ED brain thinks the urge to eat more is a huge problem and I'm VERY well trained to sit with it - honestly I'd hope a treatment center would be the opposite.\n\nYou just wrote that in a treatment center I can expect they will make me eat less than I want to. Why would I wanna go there?? Actually why would anyone recover there? You're just confirming each and every one of my fears, and I'd rather restrict on my own terms so that at least I can eat whatever I want on the weekends. \n\nGosh this makes me *so* mad. Treatment needs to change asap.",
          "created_utc": 1634794726.0
        },
        {
          "id": "hhgmssn",
          "author": "runninginbubbles",
          "body": "Okay, so say we let you eat without restriction? What will happen? You'll binge? Then what, you'll panic, and purge or restrict? A person who is so deep in their ED cannot make decisions around food, your decision is too clouded by what your ED has to say about it. You need to let someone make the decisions for you, and accept that perhaps you don't know best when you're in this frame of mind. You being combative isn't helping. A treatment centre won't make you restrict. \nBinge eating is self harm behaviour, so I'm not going to say it's good. Look, the only way you're going to stop binging is by NOT restricting or purging afterwards. You have to be able to sit with a binge.",
          "created_utc": 1634796942.0
        }
      ]
    },
    {
      "id": "hhgk18f",
      "author": "lothar42",
      "body": ">But the fear of gaining weight in eating disorder is a manifestation of the control aspect of the Ed \n\nNo, it's a manifestation of the fear of gaining weight. Before my ED I had no fear of gaining weight because my hunger cues were normal and I wouldn't need to eat five bowls of cereal one after the other to feel minimally full and satisfied.\n\nI'm not sure about the rest, I still don't think there's a much of a difference, many people with EDs I know are literally just scared of gaining weight and don't have an underlying issue behind it. Plus I do not have an identity, I just have an illness.",
      "created_utc": 1634794843.0,
      "score": 1,
      "context": [
        {
          "id": "hhb5fik",
          "author": "None",
          "body": "Why do you think you need to go into a treatment center to get treated? You can definitely work with professionals outside of a treatment center. \n\nSo what do you feel like your Ed is about? If it's not about control or weightloss or fear then what?\n\nIt's obvious that your bping on the weekends because you restrict on the weekdays. So how wouldn't a meal plan help you eat more on the weekdays so your not bping on the weekends? You could set the meals as literally whatever you want if you do it at home.... So why would it be restrictive if you WANT to eat more. Because clearly what your doing isn't working at all. So what's left to try. What exactly are you wanting to try. Because it seems like you just shut down every option without knowing that an option would even be.",
          "created_utc": 1634693818.0
        },
        {
          "id": "hhcftd1",
          "author": "lothar42",
          "body": "I'm OP, and I wrote a reply to a comment right above answering to some of your questions. :)",
          "created_utc": 1634725588.0
        },
        {
          "id": "hhdv82y",
          "author": "None",
          "body": "No it didn't really answer why meal plans that you make wouldn't work. If you set the meals in between restrictive and bingeing while you tackle your \"phobia\", why would that still be restricting? You'd have to force it for a while as you work through phobias with your therapist. If your eating isn't disorder based, why are you in eating disorder therapy? You could be seeking therapy for pocrescophobia if that's what you believe you have. There are lots of phobias that restrict food intake/mess with our relationship to food, I would drop the eating disorder aspect since that's not what it is and go into therapy for phobia that affects your ability to eat. And your bping because you're body makes you eat after all that restricting.\n\n*The quotes around phobia are not meant as sarcasm, just a direct quote from your reply 🙂 didn't want you to think I didn't believe you or anything.",
          "created_utc": 1634750448.0
        },
        {
          "id": "hhe3mem",
          "author": "lothar42",
          "body": "A meal plan would be restrictive because I want more than that. Unless the meal plan is like 10,000kcals but I'm not sure anyone would prescribe such a thing :D\n\nI mean, during my \"restriction days\" I don't eat that much differently from a standard meal plan anyway. I don't go to crazy lows usually.\n\nThe point about me seeking therapy for something else is actually great because I've been internally asking myself whether I do have an ED or not. But tbh I think that the phobia of gaining weight is in itself a defining characteristic of pretty much any ED so I do believe I still qualify. I do not think you have to have a certain background or underlying issue to have an ED if that makes sense. Plus it's absolutely interfering with my daily life and I do display many classic signs (purging being the most obvious one).",
          "created_utc": 1634753798.0
        },
        {
          "id": "hhegu1i",
          "author": "None",
          "body": "But the fear of gaining weight in eating disorder is a manifestation of the control aspect of the Ed which you claim you do not have at all. And since you reject all Ed treatment then you should just drop that identity that you have with that and seek help for a phobia instead 🙂 its like how emetophobia (terrible spelling!!) Will cause severe restriction in sufferers not because they have an eating disorder but because they have an intense irrational fear of getting food poisoning but it would definitely present as an Ed. Of course you don't have that one, just an example of how Ed behaviour can be present without having an Ed.",
          "created_utc": 1634759042.0
        }
      ]
    },
    {
      "id": "hhjnvhr",
      "author": "runninginbubbles",
      "body": ">*They will, if I want more than they give and they don't allow me to get it. Which is exactly what my ED does. I mean what does restriction even mean then?*\n\nRestriction is eating less than what your body requires. A treatment centre will not do that, and I highly doubt you will be hungry when you're there. They give you enough. \"If i want more than what they give and they don't allow me to get it\" - that just sounds childish imo.\n\n&#x200B;\n\n>*That binging is bad, that I don't really need that food, and therefore I should keep restricting because it's all just in my head and one bowl of cereal is enough.*\n\nYou're forgetting there is plenty of middle ground. Just because binging is bad doesn't mean you should keep restricting. Restricting is even more bad for you. Both are self-harming. (And three bowls of cereal is not a binge - I am talking about binge eating as in thousands of calories in one sitting) Your binges are purely reactive eating, that is a response to starvation. They will not stop until you start eating enough and regularly. \n\n&#x200B;\n\n>*So if a starving boy in Syria binges, he's self harming?*\n\nAre you actually comparing eating disorders to extreme poverty?   \n\n\nI'm going to leave the conversation here. Until you accept that you need to stop restricting in order to stop binging (or reactively eating.. whatever you call it), you will not get better. I had extreme hunger for about 8 months, and most certainly binge ate most days. I eventually gained to a healthy weight, and now I don't binge. It's been seven years since I weight restored.",
      "created_utc": 1634853875.0,
      "score": 1,
      "context": [
        {
          "id": "hhbbu5o",
          "author": "runninginbubbles",
          "body": "I am really confused here. What exactly DO you want? You don't want inpatient, and you don't want outpatient. You don't want professionals who are educated to help you, you don't want anything that resembles a meal plan, you don't want anyone to enforce normal eating habits.What actually does *effective help* mean to you?\n\nI'm also curious, what is your ED about? What purpose does it serve? Why are you scared of change? If what you're saying is true - there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that? Why can't you binge and not purge, knowing that eventually your body will not longer need to binge? You obviously cannot be afraid of gaining weight if you are worried that treatment restricts your eating, most people are terrified of being given too much. \n\nI feel like you just want this magic wand waved, but thats not going to happen. You can recover on your own - you know what you need to do and you have the desire to do it - so go ahead? Most people who need treatment centres do so to learn the exact things you don't want a bar of (portion control, meal times etc) and to work through whats driving the ED (control/emotions etc which do not appear to apply to you).\n\nIf you do not want to go residential or outpatient, my practical advice would be to read Brain over Binge. Once you've committed yourself to stop purging and stop restricting, you will stop binging too. But it has to be in that order. It sounds too easy, but the way you're describing your ED, it sounds 'too easy,' I'm not sure if it's denial, but I really want you to think about WHY change is so hard. Because from what you've said, it's very much ALL about control.",
          "created_utc": 1634696860.0
        },
        {
          "id": "hhbv60l",
          "author": "lothar42",
          "body": "Hey, I'm OP, and since you brought up a lot of interesting questions and I did post similar threads on other subs already I thought I might as well show up and reply.\n\nHonestly, I don't even think my ED is \"about\" anything. I don't think there necessarily needs to be a \"purpose\" behind an ED, not a psychological one at least. At this point I think at least in my case it's primarily a biological thing. There might have been some psychological issues at play but whatever they were they're gone.\n\nMy ED developed out of the blue when I was an adult and I had no particular issues with food, myself or my body. I always had normal eating patterns before my ED and I'm very aware of how a normal person eats, which is why I don't need anyone \"teaching\" me. I know what goes with what and how a normal portion looks like etc. Once I showed my dietitian an example of what I'd eat pre ED and he said it's very close to what he would prescribe as a meal plan. I started losing weight for unrelated reasons and then it just kind of spiraled into an ED. I developed a strong fear of eating and gaining weight. After a while I sought the help of therapists, and basically the current one immediately told me it was about \"control\" and that in order to get rid of my ED I needed to realize that I didn't need \"control\" and that I had to face what made me feel \"out of control\".\n\nSo I thought, well, it must be right. I didn't know anything about EDs, and he was a professional, so I should trust him. I was very compliant with therapy and practised all his suggestions religiously, but after a long time and no change in terms of ED behaviours I started questioning all of it. I started realizing that it was actually (and still is) the ED itself that makes me feel \"out of control\", and that despite the good intentions of my therapist none of what he said *truly* reasonated within me. Actually it was making me worse, because focusing on the \"mental side\" just made me more and more entrenched in my daily ED routines to the point that I nearly got hospitalized. \n\nAt this point I started educating myself on the biological roots of an ED and I began viewing myself as someone with a phobia of flying. You can't \"just stop\" being scared of planes and \"just hop on a plane\" - you'll probably need assistance. But at the same time you wouldn't want a treatment center to tell you that hey, planes do crash, so you might wanna be cautious there!, cause that's just gonna feel counterproductive isn't it? \n\nEssentially I have a strong phobia of gaining weight. Plus I had someone in my family died of obesity-related health issues and I don't want that to happen to me. But I know that if I stop restricting I'll just binge myself to death (which is also why \"Brain over Binge\" never worked - I cannot \"stop restricting\" without binging). So basically I'd need someone that helps me with the transition without judging, and while reassuring me that at some point the binges will stop and I will settle down at a normal weight and I won't need to restrict anymore. Problem is, all the therapists I've met focus on unrelated stuff like control and all the dietitians do judge me if I eat \"too much\", e.g. if I eat three bowls of cereals in the morning instead of one and maybe then I finish the whole box before lunch together with other stuff. \n\nObviously I am also terrified of being given too much. But I know that a treatment center is never gonna give you \"too much\". I am terrified of *me* giving myself too much. At the same time, I'd rather keep restricting on my own terms than being made to restrict by a treatment team, which would feel incredibly soul crushing - it's like being teased with something you want and then seeing it go away. You'll think \"well why did you ever showed that to me in the first place, I'd rather not see it at all then\". One measly single muffin as a snack won't cut it. It's an out of sight out of mind kinda thing for me. It's just so hard to see the point of recovery when those who are supposed to help you recover promote habits that look and sound so similar to your ED.\n\nBasically the reason why I restrict these days is because then I know that if I binge the consequences in terms of weight gain won't be too terrible. In fact, when I'm VERY underweight, then sometimes I manage to let myself binge without feeling the need to purge afterwards.\n\nBy the way, I did explain all of this to my therapist multiple times in great detail. I made an effort to be constructive and see whether we could find a common ground. But I've only been met with a slightly condescending attitude like I was a poor fool who had just read way too much baseless quack pseudoscience somewhere online instead of trusting educated professionals like him. And that left me angry and frustrated - because I got tired of always being told I was in denial and never being listened to and got tired of him never wanting to question his own approach despite it not actually working.\n\nInitially I also told myself that maybe I *was* in denial, so I stuck to therapy and did my best to try and follow my therapist advice instead of being confrontational about it. And I have to say, it did help me with a lot of things in my life...but the ED habits only got worse and grew more and more unrelated to my emotional state.\n\nHonestly the people who've actually been able to help me somewhat are my parents and my friends, who basically always told me that my binges were just a response to restriction and they would ultimately go away. But of course they cannot just stay with me 24/7 and they're also humans so they snap and get tired of listening to my constant panic attacks everytime I eat \"too much\" and talking me out of them.\n\n> there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that?\n\n>you know what you need to do and you have the desire to do it - so go ahead? \n\nThat sounds true for most ED sufferers though, and for any phobia for that matter. There is nothing stopping us. I do know what I need to do and I want to do it - but I'm too terrified to actually do it. Sometimes I try - aka I binge - and I'm happy for a while, but then the fear kicks in and I purge.",
          "created_utc": 1634707925.0
        },
        {
          "id": "hhfu788",
          "author": "runninginbubbles",
          "body": "Hey, thanks for replying. I do agree with a lot of what you say, and totally believe that some people have a biological genetic predisposition to eating disorders, I think mine is too.\n\nWhile the 'cause' doesn't necessarily need to be psychological, the reason we *hold on* to our EDs, and are so resistant to treatment, is very much a psychological thing. This is what I mean by 'a purpose.' If our ED gave us no perceived benefit, or served no purpose, we'd give it up in an instant. But there is SOMETHING that keeps us hooked onto the thoughts. And for you it sounds like it's partly phobia of weight gain. Which is common in EDs, but it is psychological, and it's irrational - gaining weight is not a bad thing. You will not binge yourself to death, you will not become morbidly obese. (All phobias are psychological. And my grandma did a fear-of-flying course, they absolutely do share the chances of being in a crash - the minimal risk actually helps people realise planes are safe)\n\nNo one is 'judging you' or making you restrict. If you had three bowls of cereal at home, you'd probably restrict later on to compensate? That's contributing to this binge/restrict cycle. In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. In a few hours, you may be given a snack, and then lunch. That's what normal eating is. Until your brain knows that it will get food soon, it will constantly be urging you to binge.  You cannot trust your own brain right now to tell you what it needs, because it's starving. You need other people to make those decisions, and not wanting to do so, is a form of needing 'control.' You need to re-wire your brain, and the only way to do that is sustained, regular eating patterns. And if you can't do that in the community, you will need residential care to fix it.\n\n**Unfortunately with recovery, the only way through is to allow yourself to feel the guilt and discomfort when you binge, without purging, and without restricting. You will binge, it will happen. But you have to learn to sit with it and not compensate, that is the only way to stop doing so. You need to gain to a healthy weight, and you will feel fat. Recovery is uncomfortable. You will feel all the things that were suppressed by your ED.  And sometimes I believe that it's only during recovery, that we realise what exactly what our ED served us, what it's purpose was and the reason we relied so heavily on it.**",
          "created_utc": 1634780517.0
        },
        {
          "id": "hhgjvpe",
          "author": "lothar42",
          "body": ">  In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. \n\nYes, and that's the problem I have with treatment. How is it not restriction, if I want more than one bowl? My ED brain also \"teaches\" me to never eat more than one bowl during normal days, or more than one fist of protein, or more than x grams of rice, even if I want more. So I literally cannot see the difference. Shouldn't recovery be about making me eat without any kind of restriction? And if it isn't, then how is it different from the ED itself, and why whould I bother embarking in recovery with a treatment center if I'm gonna have to restrict anyway? My brain is not just magically gonna stop wanting more than one bowl just because someone else says so, otherwise after years of carefully crafted meal plans I'd be 100% recovered.\n\nWith your reply you keep hinting that binging is somehow \"wrong\", that I should not trust my own brain because it will make me binge and that's a problem because...? This is literally why I'm scared of recovering - because I've been taught that binging or even just \"the urge to eat more\" is bad. What happens if in a treatment center I want three bowls and not one? Will I be denied more food because the urge to eat more is bad?? Will I get told to stick to one bowl, and with what motivation? What they will use as a threat against it? What's the problem if I respond to the urge to eat more? My ED brain thinks the urge to eat more is a huge problem and I'm VERY well trained to sit with it - honestly I'd hope a treatment center would be the opposite.\n\nYou just wrote that in a treatment center I can expect they will make me eat less than I want to. Why would I wanna go there?? Actually why would anyone recover there? You're just confirming each and every one of my fears, and I'd rather restrict on my own terms so that at least I can eat whatever I want on the weekends. \n\nGosh this makes me *so* mad. Treatment needs to change asap.",
          "created_utc": 1634794726.0
        },
        {
          "id": "hhgmssn",
          "author": "runninginbubbles",
          "body": "Okay, so say we let you eat without restriction? What will happen? You'll binge? Then what, you'll panic, and purge or restrict? A person who is so deep in their ED cannot make decisions around food, your decision is too clouded by what your ED has to say about it. You need to let someone make the decisions for you, and accept that perhaps you don't know best when you're in this frame of mind. You being combative isn't helping. A treatment centre won't make you restrict. \nBinge eating is self harm behaviour, so I'm not going to say it's good. Look, the only way you're going to stop binging is by NOT restricting or purging afterwards. You have to be able to sit with a binge.",
          "created_utc": 1634796942.0
        },
        {
          "id": "hhgotk9",
          "author": "lothar42",
          "body": ">Then what, you'll panic, and purge or restrict? \n\nThe purpose of therapy should be helping me not do it.\n\n>A treatment centre won't make you restrict. \n\nThey will, if I want more than they give and they don't allow me to get it. Which is exactly what my ED does.\n\nI mean what does restriction even mean then? \n\n>Binge eating is self harm behaviour\n\nSo if a starving boy in Syria binges, he's self harming?\n\nAnd btw, this also sounds very similar to what my ED brain tells me. That binging is bad, that I don't really need that food, and therefore I should keep restricting because it's all just in my head and one bowl of cereal is enough.",
          "created_utc": 1634798585.0
        }
      ]
    },
    {
      "id": "hhl2w3m",
      "author": "lothar42",
      "body": "Wow, I am...speechless. You just sound like my ED does, and say the same things, it's quite amusing. Especially with the 'childish' bit. Basically you're telling me that a. it's childish to eat what you want (despite it being what I've done my whole life before my ED) and b. I will never be able to do it in a treatment center. This is literally what my ED brain tells to me.\n\nI'm so glad I always managed to stay the hell away from a treatment center. Never ever gonna touch one of those. No wonder the professionals working in those centers have consistently managed to make me worse rofl.",
      "created_utc": 1634879323.0,
      "score": -1,
      "context": [
        {
          "id": "hhbbu5o",
          "author": "runninginbubbles",
          "body": "I am really confused here. What exactly DO you want? You don't want inpatient, and you don't want outpatient. You don't want professionals who are educated to help you, you don't want anything that resembles a meal plan, you don't want anyone to enforce normal eating habits.What actually does *effective help* mean to you?\n\nI'm also curious, what is your ED about? What purpose does it serve? Why are you scared of change? If what you're saying is true - there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that? Why can't you binge and not purge, knowing that eventually your body will not longer need to binge? You obviously cannot be afraid of gaining weight if you are worried that treatment restricts your eating, most people are terrified of being given too much. \n\nI feel like you just want this magic wand waved, but thats not going to happen. You can recover on your own - you know what you need to do and you have the desire to do it - so go ahead? Most people who need treatment centres do so to learn the exact things you don't want a bar of (portion control, meal times etc) and to work through whats driving the ED (control/emotions etc which do not appear to apply to you).\n\nIf you do not want to go residential or outpatient, my practical advice would be to read Brain over Binge. Once you've committed yourself to stop purging and stop restricting, you will stop binging too. But it has to be in that order. It sounds too easy, but the way you're describing your ED, it sounds 'too easy,' I'm not sure if it's denial, but I really want you to think about WHY change is so hard. Because from what you've said, it's very much ALL about control.",
          "created_utc": 1634696860.0
        },
        {
          "id": "hhbv60l",
          "author": "lothar42",
          "body": "Hey, I'm OP, and since you brought up a lot of interesting questions and I did post similar threads on other subs already I thought I might as well show up and reply.\n\nHonestly, I don't even think my ED is \"about\" anything. I don't think there necessarily needs to be a \"purpose\" behind an ED, not a psychological one at least. At this point I think at least in my case it's primarily a biological thing. There might have been some psychological issues at play but whatever they were they're gone.\n\nMy ED developed out of the blue when I was an adult and I had no particular issues with food, myself or my body. I always had normal eating patterns before my ED and I'm very aware of how a normal person eats, which is why I don't need anyone \"teaching\" me. I know what goes with what and how a normal portion looks like etc. Once I showed my dietitian an example of what I'd eat pre ED and he said it's very close to what he would prescribe as a meal plan. I started losing weight for unrelated reasons and then it just kind of spiraled into an ED. I developed a strong fear of eating and gaining weight. After a while I sought the help of therapists, and basically the current one immediately told me it was about \"control\" and that in order to get rid of my ED I needed to realize that I didn't need \"control\" and that I had to face what made me feel \"out of control\".\n\nSo I thought, well, it must be right. I didn't know anything about EDs, and he was a professional, so I should trust him. I was very compliant with therapy and practised all his suggestions religiously, but after a long time and no change in terms of ED behaviours I started questioning all of it. I started realizing that it was actually (and still is) the ED itself that makes me feel \"out of control\", and that despite the good intentions of my therapist none of what he said *truly* reasonated within me. Actually it was making me worse, because focusing on the \"mental side\" just made me more and more entrenched in my daily ED routines to the point that I nearly got hospitalized. \n\nAt this point I started educating myself on the biological roots of an ED and I began viewing myself as someone with a phobia of flying. You can't \"just stop\" being scared of planes and \"just hop on a plane\" - you'll probably need assistance. But at the same time you wouldn't want a treatment center to tell you that hey, planes do crash, so you might wanna be cautious there!, cause that's just gonna feel counterproductive isn't it? \n\nEssentially I have a strong phobia of gaining weight. Plus I had someone in my family died of obesity-related health issues and I don't want that to happen to me. But I know that if I stop restricting I'll just binge myself to death (which is also why \"Brain over Binge\" never worked - I cannot \"stop restricting\" without binging). So basically I'd need someone that helps me with the transition without judging, and while reassuring me that at some point the binges will stop and I will settle down at a normal weight and I won't need to restrict anymore. Problem is, all the therapists I've met focus on unrelated stuff like control and all the dietitians do judge me if I eat \"too much\", e.g. if I eat three bowls of cereals in the morning instead of one and maybe then I finish the whole box before lunch together with other stuff. \n\nObviously I am also terrified of being given too much. But I know that a treatment center is never gonna give you \"too much\". I am terrified of *me* giving myself too much. At the same time, I'd rather keep restricting on my own terms than being made to restrict by a treatment team, which would feel incredibly soul crushing - it's like being teased with something you want and then seeing it go away. You'll think \"well why did you ever showed that to me in the first place, I'd rather not see it at all then\". One measly single muffin as a snack won't cut it. It's an out of sight out of mind kinda thing for me. It's just so hard to see the point of recovery when those who are supposed to help you recover promote habits that look and sound so similar to your ED.\n\nBasically the reason why I restrict these days is because then I know that if I binge the consequences in terms of weight gain won't be too terrible. In fact, when I'm VERY underweight, then sometimes I manage to let myself binge without feeling the need to purge afterwards.\n\nBy the way, I did explain all of this to my therapist multiple times in great detail. I made an effort to be constructive and see whether we could find a common ground. But I've only been met with a slightly condescending attitude like I was a poor fool who had just read way too much baseless quack pseudoscience somewhere online instead of trusting educated professionals like him. And that left me angry and frustrated - because I got tired of always being told I was in denial and never being listened to and got tired of him never wanting to question his own approach despite it not actually working.\n\nInitially I also told myself that maybe I *was* in denial, so I stuck to therapy and did my best to try and follow my therapist advice instead of being confrontational about it. And I have to say, it did help me with a lot of things in my life...but the ED habits only got worse and grew more and more unrelated to my emotional state.\n\nHonestly the people who've actually been able to help me somewhat are my parents and my friends, who basically always told me that my binges were just a response to restriction and they would ultimately go away. But of course they cannot just stay with me 24/7 and they're also humans so they snap and get tired of listening to my constant panic attacks everytime I eat \"too much\" and talking me out of them.\n\n> there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that?\n\n>you know what you need to do and you have the desire to do it - so go ahead? \n\nThat sounds true for most ED sufferers though, and for any phobia for that matter. There is nothing stopping us. I do know what I need to do and I want to do it - but I'm too terrified to actually do it. Sometimes I try - aka I binge - and I'm happy for a while, but then the fear kicks in and I purge.",
          "created_utc": 1634707925.0
        },
        {
          "id": "hhfu788",
          "author": "runninginbubbles",
          "body": "Hey, thanks for replying. I do agree with a lot of what you say, and totally believe that some people have a biological genetic predisposition to eating disorders, I think mine is too.\n\nWhile the 'cause' doesn't necessarily need to be psychological, the reason we *hold on* to our EDs, and are so resistant to treatment, is very much a psychological thing. This is what I mean by 'a purpose.' If our ED gave us no perceived benefit, or served no purpose, we'd give it up in an instant. But there is SOMETHING that keeps us hooked onto the thoughts. And for you it sounds like it's partly phobia of weight gain. Which is common in EDs, but it is psychological, and it's irrational - gaining weight is not a bad thing. You will not binge yourself to death, you will not become morbidly obese. (All phobias are psychological. And my grandma did a fear-of-flying course, they absolutely do share the chances of being in a crash - the minimal risk actually helps people realise planes are safe)\n\nNo one is 'judging you' or making you restrict. If you had three bowls of cereal at home, you'd probably restrict later on to compensate? That's contributing to this binge/restrict cycle. In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. In a few hours, you may be given a snack, and then lunch. That's what normal eating is. Until your brain knows that it will get food soon, it will constantly be urging you to binge.  You cannot trust your own brain right now to tell you what it needs, because it's starving. You need other people to make those decisions, and not wanting to do so, is a form of needing 'control.' You need to re-wire your brain, and the only way to do that is sustained, regular eating patterns. And if you can't do that in the community, you will need residential care to fix it.\n\n**Unfortunately with recovery, the only way through is to allow yourself to feel the guilt and discomfort when you binge, without purging, and without restricting. You will binge, it will happen. But you have to learn to sit with it and not compensate, that is the only way to stop doing so. You need to gain to a healthy weight, and you will feel fat. Recovery is uncomfortable. You will feel all the things that were suppressed by your ED.  And sometimes I believe that it's only during recovery, that we realise what exactly what our ED served us, what it's purpose was and the reason we relied so heavily on it.**",
          "created_utc": 1634780517.0
        },
        {
          "id": "hhgjvpe",
          "author": "lothar42",
          "body": ">  In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. \n\nYes, and that's the problem I have with treatment. How is it not restriction, if I want more than one bowl? My ED brain also \"teaches\" me to never eat more than one bowl during normal days, or more than one fist of protein, or more than x grams of rice, even if I want more. So I literally cannot see the difference. Shouldn't recovery be about making me eat without any kind of restriction? And if it isn't, then how is it different from the ED itself, and why whould I bother embarking in recovery with a treatment center if I'm gonna have to restrict anyway? My brain is not just magically gonna stop wanting more than one bowl just because someone else says so, otherwise after years of carefully crafted meal plans I'd be 100% recovered.\n\nWith your reply you keep hinting that binging is somehow \"wrong\", that I should not trust my own brain because it will make me binge and that's a problem because...? This is literally why I'm scared of recovering - because I've been taught that binging or even just \"the urge to eat more\" is bad. What happens if in a treatment center I want three bowls and not one? Will I be denied more food because the urge to eat more is bad?? Will I get told to stick to one bowl, and with what motivation? What they will use as a threat against it? What's the problem if I respond to the urge to eat more? My ED brain thinks the urge to eat more is a huge problem and I'm VERY well trained to sit with it - honestly I'd hope a treatment center would be the opposite.\n\nYou just wrote that in a treatment center I can expect they will make me eat less than I want to. Why would I wanna go there?? Actually why would anyone recover there? You're just confirming each and every one of my fears, and I'd rather restrict on my own terms so that at least I can eat whatever I want on the weekends. \n\nGosh this makes me *so* mad. Treatment needs to change asap.",
          "created_utc": 1634794726.0
        },
        {
          "id": "hhgmssn",
          "author": "runninginbubbles",
          "body": "Okay, so say we let you eat without restriction? What will happen? You'll binge? Then what, you'll panic, and purge or restrict? A person who is so deep in their ED cannot make decisions around food, your decision is too clouded by what your ED has to say about it. You need to let someone make the decisions for you, and accept that perhaps you don't know best when you're in this frame of mind. You being combative isn't helping. A treatment centre won't make you restrict. \nBinge eating is self harm behaviour, so I'm not going to say it's good. Look, the only way you're going to stop binging is by NOT restricting or purging afterwards. You have to be able to sit with a binge.",
          "created_utc": 1634796942.0
        },
        {
          "id": "hhgotk9",
          "author": "lothar42",
          "body": ">Then what, you'll panic, and purge or restrict? \n\nThe purpose of therapy should be helping me not do it.\n\n>A treatment centre won't make you restrict. \n\nThey will, if I want more than they give and they don't allow me to get it. Which is exactly what my ED does.\n\nI mean what does restriction even mean then? \n\n>Binge eating is self harm behaviour\n\nSo if a starving boy in Syria binges, he's self harming?\n\nAnd btw, this also sounds very similar to what my ED brain tells me. That binging is bad, that I don't really need that food, and therefore I should keep restricting because it's all just in my head and one bowl of cereal is enough.",
          "created_utc": 1634798585.0
        },
        {
          "id": "hhjnvhr",
          "author": "runninginbubbles",
          "body": ">*They will, if I want more than they give and they don't allow me to get it. Which is exactly what my ED does. I mean what does restriction even mean then?*\n\nRestriction is eating less than what your body requires. A treatment centre will not do that, and I highly doubt you will be hungry when you're there. They give you enough. \"If i want more than what they give and they don't allow me to get it\" - that just sounds childish imo.\n\n&#x200B;\n\n>*That binging is bad, that I don't really need that food, and therefore I should keep restricting because it's all just in my head and one bowl of cereal is enough.*\n\nYou're forgetting there is plenty of middle ground. Just because binging is bad doesn't mean you should keep restricting. Restricting is even more bad for you. Both are self-harming. (And three bowls of cereal is not a binge - I am talking about binge eating as in thousands of calories in one sitting) Your binges are purely reactive eating, that is a response to starvation. They will not stop until you start eating enough and regularly. \n\n&#x200B;\n\n>*So if a starving boy in Syria binges, he's self harming?*\n\nAre you actually comparing eating disorders to extreme poverty?   \n\n\nI'm going to leave the conversation here. Until you accept that you need to stop restricting in order to stop binging (or reactively eating.. whatever you call it), you will not get better. I had extreme hunger for about 8 months, and most certainly binge ate most days. I eventually gained to a healthy weight, and now I don't binge. It's been seven years since I weight restored.",
          "created_utc": 1634853875.0
        }
      ]
    },
    {
      "id": "hp2pjub",
      "author": "Nickmidkiff",
      "body": "Dumbass alert 🚨",
      "created_utc": 1639852234.0,
      "score": 1,
      "context": [
        {
          "id": "hhbbu5o",
          "author": "runninginbubbles",
          "body": "I am really confused here. What exactly DO you want? You don't want inpatient, and you don't want outpatient. You don't want professionals who are educated to help you, you don't want anything that resembles a meal plan, you don't want anyone to enforce normal eating habits.What actually does *effective help* mean to you?\n\nI'm also curious, what is your ED about? What purpose does it serve? Why are you scared of change? If what you're saying is true - there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that? Why can't you binge and not purge, knowing that eventually your body will not longer need to binge? You obviously cannot be afraid of gaining weight if you are worried that treatment restricts your eating, most people are terrified of being given too much. \n\nI feel like you just want this magic wand waved, but thats not going to happen. You can recover on your own - you know what you need to do and you have the desire to do it - so go ahead? Most people who need treatment centres do so to learn the exact things you don't want a bar of (portion control, meal times etc) and to work through whats driving the ED (control/emotions etc which do not appear to apply to you).\n\nIf you do not want to go residential or outpatient, my practical advice would be to read Brain over Binge. Once you've committed yourself to stop purging and stop restricting, you will stop binging too. But it has to be in that order. It sounds too easy, but the way you're describing your ED, it sounds 'too easy,' I'm not sure if it's denial, but I really want you to think about WHY change is so hard. Because from what you've said, it's very much ALL about control.",
          "created_utc": 1634696860.0
        },
        {
          "id": "hhbv60l",
          "author": "lothar42",
          "body": "Hey, I'm OP, and since you brought up a lot of interesting questions and I did post similar threads on other subs already I thought I might as well show up and reply.\n\nHonestly, I don't even think my ED is \"about\" anything. I don't think there necessarily needs to be a \"purpose\" behind an ED, not a psychological one at least. At this point I think at least in my case it's primarily a biological thing. There might have been some psychological issues at play but whatever they were they're gone.\n\nMy ED developed out of the blue when I was an adult and I had no particular issues with food, myself or my body. I always had normal eating patterns before my ED and I'm very aware of how a normal person eats, which is why I don't need anyone \"teaching\" me. I know what goes with what and how a normal portion looks like etc. Once I showed my dietitian an example of what I'd eat pre ED and he said it's very close to what he would prescribe as a meal plan. I started losing weight for unrelated reasons and then it just kind of spiraled into an ED. I developed a strong fear of eating and gaining weight. After a while I sought the help of therapists, and basically the current one immediately told me it was about \"control\" and that in order to get rid of my ED I needed to realize that I didn't need \"control\" and that I had to face what made me feel \"out of control\".\n\nSo I thought, well, it must be right. I didn't know anything about EDs, and he was a professional, so I should trust him. I was very compliant with therapy and practised all his suggestions religiously, but after a long time and no change in terms of ED behaviours I started questioning all of it. I started realizing that it was actually (and still is) the ED itself that makes me feel \"out of control\", and that despite the good intentions of my therapist none of what he said *truly* reasonated within me. Actually it was making me worse, because focusing on the \"mental side\" just made me more and more entrenched in my daily ED routines to the point that I nearly got hospitalized. \n\nAt this point I started educating myself on the biological roots of an ED and I began viewing myself as someone with a phobia of flying. You can't \"just stop\" being scared of planes and \"just hop on a plane\" - you'll probably need assistance. But at the same time you wouldn't want a treatment center to tell you that hey, planes do crash, so you might wanna be cautious there!, cause that's just gonna feel counterproductive isn't it? \n\nEssentially I have a strong phobia of gaining weight. Plus I had someone in my family died of obesity-related health issues and I don't want that to happen to me. But I know that if I stop restricting I'll just binge myself to death (which is also why \"Brain over Binge\" never worked - I cannot \"stop restricting\" without binging). So basically I'd need someone that helps me with the transition without judging, and while reassuring me that at some point the binges will stop and I will settle down at a normal weight and I won't need to restrict anymore. Problem is, all the therapists I've met focus on unrelated stuff like control and all the dietitians do judge me if I eat \"too much\", e.g. if I eat three bowls of cereals in the morning instead of one and maybe then I finish the whole box before lunch together with other stuff. \n\nObviously I am also terrified of being given too much. But I know that a treatment center is never gonna give you \"too much\". I am terrified of *me* giving myself too much. At the same time, I'd rather keep restricting on my own terms than being made to restrict by a treatment team, which would feel incredibly soul crushing - it's like being teased with something you want and then seeing it go away. You'll think \"well why did you ever showed that to me in the first place, I'd rather not see it at all then\". One measly single muffin as a snack won't cut it. It's an out of sight out of mind kinda thing for me. It's just so hard to see the point of recovery when those who are supposed to help you recover promote habits that look and sound so similar to your ED.\n\nBasically the reason why I restrict these days is because then I know that if I binge the consequences in terms of weight gain won't be too terrible. In fact, when I'm VERY underweight, then sometimes I manage to let myself binge without feeling the need to purge afterwards.\n\nBy the way, I did explain all of this to my therapist multiple times in great detail. I made an effort to be constructive and see whether we could find a common ground. But I've only been met with a slightly condescending attitude like I was a poor fool who had just read way too much baseless quack pseudoscience somewhere online instead of trusting educated professionals like him. And that left me angry and frustrated - because I got tired of always being told I was in denial and never being listened to and got tired of him never wanting to question his own approach despite it not actually working.\n\nInitially I also told myself that maybe I *was* in denial, so I stuck to therapy and did my best to try and follow my therapist advice instead of being confrontational about it. And I have to say, it did help me with a lot of things in my life...but the ED habits only got worse and grew more and more unrelated to my emotional state.\n\nHonestly the people who've actually been able to help me somewhat are my parents and my friends, who basically always told me that my binges were just a response to restriction and they would ultimately go away. But of course they cannot just stay with me 24/7 and they're also humans so they snap and get tired of listening to my constant panic attacks everytime I eat \"too much\" and talking me out of them.\n\n> there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that?\n\n>you know what you need to do and you have the desire to do it - so go ahead? \n\nThat sounds true for most ED sufferers though, and for any phobia for that matter. There is nothing stopping us. I do know what I need to do and I want to do it - but I'm too terrified to actually do it. Sometimes I try - aka I binge - and I'm happy for a while, but then the fear kicks in and I purge.",
          "created_utc": 1634707925.0
        },
        {
          "id": "hhfu788",
          "author": "runninginbubbles",
          "body": "Hey, thanks for replying. I do agree with a lot of what you say, and totally believe that some people have a biological genetic predisposition to eating disorders, I think mine is too.\n\nWhile the 'cause' doesn't necessarily need to be psychological, the reason we *hold on* to our EDs, and are so resistant to treatment, is very much a psychological thing. This is what I mean by 'a purpose.' If our ED gave us no perceived benefit, or served no purpose, we'd give it up in an instant. But there is SOMETHING that keeps us hooked onto the thoughts. And for you it sounds like it's partly phobia of weight gain. Which is common in EDs, but it is psychological, and it's irrational - gaining weight is not a bad thing. You will not binge yourself to death, you will not become morbidly obese. (All phobias are psychological. And my grandma did a fear-of-flying course, they absolutely do share the chances of being in a crash - the minimal risk actually helps people realise planes are safe)\n\nNo one is 'judging you' or making you restrict. If you had three bowls of cereal at home, you'd probably restrict later on to compensate? That's contributing to this binge/restrict cycle. In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. In a few hours, you may be given a snack, and then lunch. That's what normal eating is. Until your brain knows that it will get food soon, it will constantly be urging you to binge.  You cannot trust your own brain right now to tell you what it needs, because it's starving. You need other people to make those decisions, and not wanting to do so, is a form of needing 'control.' You need to re-wire your brain, and the only way to do that is sustained, regular eating patterns. And if you can't do that in the community, you will need residential care to fix it.\n\n**Unfortunately with recovery, the only way through is to allow yourself to feel the guilt and discomfort when you binge, without purging, and without restricting. You will binge, it will happen. But you have to learn to sit with it and not compensate, that is the only way to stop doing so. You need to gain to a healthy weight, and you will feel fat. Recovery is uncomfortable. You will feel all the things that were suppressed by your ED.  And sometimes I believe that it's only during recovery, that we realise what exactly what our ED served us, what it's purpose was and the reason we relied so heavily on it.**",
          "created_utc": 1634780517.0
        },
        {
          "id": "hhgjvpe",
          "author": "lothar42",
          "body": ">  In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. \n\nYes, and that's the problem I have with treatment. How is it not restriction, if I want more than one bowl? My ED brain also \"teaches\" me to never eat more than one bowl during normal days, or more than one fist of protein, or more than x grams of rice, even if I want more. So I literally cannot see the difference. Shouldn't recovery be about making me eat without any kind of restriction? And if it isn't, then how is it different from the ED itself, and why whould I bother embarking in recovery with a treatment center if I'm gonna have to restrict anyway? My brain is not just magically gonna stop wanting more than one bowl just because someone else says so, otherwise after years of carefully crafted meal plans I'd be 100% recovered.\n\nWith your reply you keep hinting that binging is somehow \"wrong\", that I should not trust my own brain because it will make me binge and that's a problem because...? This is literally why I'm scared of recovering - because I've been taught that binging or even just \"the urge to eat more\" is bad. What happens if in a treatment center I want three bowls and not one? Will I be denied more food because the urge to eat more is bad?? Will I get told to stick to one bowl, and with what motivation? What they will use as a threat against it? What's the problem if I respond to the urge to eat more? My ED brain thinks the urge to eat more is a huge problem and I'm VERY well trained to sit with it - honestly I'd hope a treatment center would be the opposite.\n\nYou just wrote that in a treatment center I can expect they will make me eat less than I want to. Why would I wanna go there?? Actually why would anyone recover there? You're just confirming each and every one of my fears, and I'd rather restrict on my own terms so that at least I can eat whatever I want on the weekends. \n\nGosh this makes me *so* mad. Treatment needs to change asap.",
          "created_utc": 1634794726.0
        },
        {
          "id": "hhgmssn",
          "author": "runninginbubbles",
          "body": "Okay, so say we let you eat without restriction? What will happen? You'll binge? Then what, you'll panic, and purge or restrict? A person who is so deep in their ED cannot make decisions around food, your decision is too clouded by what your ED has to say about it. You need to let someone make the decisions for you, and accept that perhaps you don't know best when you're in this frame of mind. You being combative isn't helping. A treatment centre won't make you restrict. \nBinge eating is self harm behaviour, so I'm not going to say it's good. Look, the only way you're going to stop binging is by NOT restricting or purging afterwards. You have to be able to sit with a binge.",
          "created_utc": 1634796942.0
        },
        {
          "id": "hhgotk9",
          "author": "lothar42",
          "body": ">Then what, you'll panic, and purge or restrict? \n\nThe purpose of therapy should be helping me not do it.\n\n>A treatment centre won't make you restrict. \n\nThey will, if I want more than they give and they don't allow me to get it. Which is exactly what my ED does.\n\nI mean what does restriction even mean then? \n\n>Binge eating is self harm behaviour\n\nSo if a starving boy in Syria binges, he's self harming?\n\nAnd btw, this also sounds very similar to what my ED brain tells me. That binging is bad, that I don't really need that food, and therefore I should keep restricting because it's all just in my head and one bowl of cereal is enough.",
          "created_utc": 1634798585.0
        },
        {
          "id": "hhjnvhr",
          "author": "runninginbubbles",
          "body": ">*They will, if I want more than they give and they don't allow me to get it. Which is exactly what my ED does. I mean what does restriction even mean then?*\n\nRestriction is eating less than what your body requires. A treatment centre will not do that, and I highly doubt you will be hungry when you're there. They give you enough. \"If i want more than what they give and they don't allow me to get it\" - that just sounds childish imo.\n\n&#x200B;\n\n>*That binging is bad, that I don't really need that food, and therefore I should keep restricting because it's all just in my head and one bowl of cereal is enough.*\n\nYou're forgetting there is plenty of middle ground. Just because binging is bad doesn't mean you should keep restricting. Restricting is even more bad for you. Both are self-harming. (And three bowls of cereal is not a binge - I am talking about binge eating as in thousands of calories in one sitting) Your binges are purely reactive eating, that is a response to starvation. They will not stop until you start eating enough and regularly. \n\n&#x200B;\n\n>*So if a starving boy in Syria binges, he's self harming?*\n\nAre you actually comparing eating disorders to extreme poverty?   \n\n\nI'm going to leave the conversation here. Until you accept that you need to stop restricting in order to stop binging (or reactively eating.. whatever you call it), you will not get better. I had extreme hunger for about 8 months, and most certainly binge ate most days. I eventually gained to a healthy weight, and now I don't binge. It's been seven years since I weight restored.",
          "created_utc": 1634853875.0
        },
        {
          "id": "hhl2w3m",
          "author": "lothar42",
          "body": "Wow, I am...speechless. You just sound like my ED does, and say the same things, it's quite amusing. Especially with the 'childish' bit. Basically you're telling me that a. it's childish to eat what you want (despite it being what I've done my whole life before my ED) and b. I will never be able to do it in a treatment center. This is literally what my ED brain tells to me.\n\nI'm so glad I always managed to stay the hell away from a treatment center. Never ever gonna touch one of those. No wonder the professionals working in those centers have consistently managed to make me worse rofl.",
          "created_utc": 1634879323.0
        }
      ]
    }
  ]
}