{
  "id": "qhjgfo",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1635414675.0,
  "title": "Request: I’m triggered and depressed",
  "selftext": "I decided to spend time with my friend for his birthday. I used to have bulimia and recovered from it. Took years for me to be okay with eating again.\n\n&#x200B;\n\nMy friend was looking at old videos of us from 2 years ago and said “back then when you used to be skinny.” And I’m honestly so hurt that my friend would say this to me knowing how insecure I’ve been about my body.\n\n&#x200B;\n\nNow I feel so triggered. I want to go back home and forget about his birthday. I also don’t have anyone that I’d call a close friend. I feel so alone and misunderstood. How do I recover from this? Am I overreacting? Am I too sensitive? Idk",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/qhjgfo/request_im_triggered_and_depressed/",
  "score": 48,
  "num_comments": 9,
  "comments": [
    {
      "id": "hid8ej2",
      "author": "speakloudly",
      "body": "You're not over reacting. This is normal and it's okay. You are HEALTHY. That's what matters. \nIt was really hard for me to accept changes and people's stupid two cent comments of them noticing said changes. But you have to try to look at that photo differently. \nWere you healthy in that photo ? Probably not. \nWere you in the vicious cycle of ED? probably. \nWere you even happy? Probably not. \n\nThose things matter more. You got this babes. You're stronger than words",
      "created_utc": 1635419773.0,
      "score": 31,
      "context": []
    },
    {
      "id": "hiefx34",
      "author": "una_verdadera_lata",
      "body": "You are definitely allowed to feel hurt. You are not too anything, and your feelings are valid. I think it’s a good moment to reflect on how we, as people with eating disorders automatically assign a positive value to that word, “skinny” and all of the things that we associate with it. I promise your friend does not think negatively of you for getting healthy, it is again your ED trying to lure you back in and twisting his words so that ”skinny” is good and you ”arent good” anymore. That is the OPPOSITE of true. being in a healthier place physically and mentally will make you a better friend, a better person, a better student, etc- all EXTREMELY “good” things. dont let your ED convince you otherwise. Also, I’m not sure of your ages but often times younger males tend to not really think about their words- they say things without thinking about the implications- I promise he was not trying to hurt you or make a negative comment about your appearance- sometimes even my husband who is well into his 30s suffers from “foot in mouth” disorder ;)",
      "created_utc": 1635439746.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hid6iqe",
      "author": "throwaway38473864",
      "body": "No you’re not too sensitive. That’s really unfair of your friend to have said",
      "created_utc": 1635418453.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hielrvc",
      "author": "DoctorMojito",
      "body": "Noooo, not being too sensitive at all. That’s absurdly rude and inappropriate—it would be regardless if he didn’t know you’ve felt insecure, but the fact that he does know makes it worse.\n\nEDs are inherently isolating. I’ve felt the same in the past and realllly been feeling the same lately—like I don’t have close friends and so it feels inevitable to put up with insensitivity.\n\nIdk if you’re looking for suggestions but if you are, one thing that’s REALLY helped lately for me lately is attending a weekly zoom support group for eating disorders. It hasn’t solved my problems but it has made me feel so much less alone…and like maybe trying to make new friends wouldn’t be the worst idea in the world, haha.\n\nSending you lots of love and support, stranger.",
      "created_utc": 1635442019.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hig173d",
      "author": "Inevitable_Echo_4405",
      "body": "Your definitely not too sensitive. And I’m so so sorry this happened. It’s never ok to comment on someone’s weight, no matter what the situation. Maybe try talking to them to find out their intentions, if negative I’d suggest considering whether they have your best interests at heart. \nStay safe x",
      "created_utc": 1635463235.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hid1okn",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1635414675.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hif14me",
      "author": "None",
      "body": "Sorry but that’s not a friend.",
      "created_utc": 1635448012.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hlpsgde",
      "author": "MeSecretFormulrrr",
      "body": "Hm, I think it’s mostly redefining what “skinny” means - it is not a compliment. Maybe substitute the word with “malnourished” “unhealthy” “undernourished” etc. as your internal dialogue. This will take time. That way going forward, if/when this comment comes up again you reply with “ya, look how undernourished I was. I’m much healthier now.” A true friend will whole heartedly agree. That your health is #1. And remember that it takes time to redistribute weight and maybe longer than 2 years. You are probably still healing.",
      "created_utc": 1637632410.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hierif5",
      "author": "speakloudly",
      "body": "This is such amazing advice !\n\nED is like a dark shadow that tries to suck you back, that is so true. \n\nThanks for sharing such wonderful advice",
      "created_utc": 1635444222.0,
      "score": 6,
      "context": [
        {
          "id": "hiefx34",
          "author": "una_verdadera_lata",
          "body": "You are definitely allowed to feel hurt. You are not too anything, and your feelings are valid. I think it’s a good moment to reflect on how we, as people with eating disorders automatically assign a positive value to that word, “skinny” and all of the things that we associate with it. I promise your friend does not think negatively of you for getting healthy, it is again your ED trying to lure you back in and twisting his words so that ”skinny” is good and you ”arent good” anymore. That is the OPPOSITE of true. being in a healthier place physically and mentally will make you a better friend, a better person, a better student, etc- all EXTREMELY “good” things. dont let your ED convince you otherwise. Also, I’m not sure of your ages but often times younger males tend to not really think about their words- they say things without thinking about the implications- I promise he was not trying to hurt you or make a negative comment about your appearance- sometimes even my husband who is well into his 30s suffers from “foot in mouth” disorder ;)",
          "created_utc": 1635439746.0
        }
      ]
    }
  ]
}