{
  "id": "qjmxky",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1635676748.0,
  "title": "Request: My best friend told me I was getting chubby, and I don’t know how to process that.",
  "selftext": "She was not trying to be mean or anything, in fact she meant it in a good way. I got sad and she tried to tell me it was alright, but I’m just so shook. Recovery has made me feel very fat, and now my best friend has confirmed my worst fears. It stinks because I’ve tried asking my doctor, my therapists, and crisis lines for advice on losing weight, and they always just reassure me and distract me away from those goals. I just feel so alone and I wish there was something people could say to help me be healthier with my body. Any advice on feeling better about my body?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/qjmxky/request_my_best_friend_told_me_i_was_getting/",
  "score": 65,
  "num_comments": 8,
  "comments": [
    {
      "id": "hir49ay",
      "author": "None",
      "body": "Hey I’m just commenting to offset that other person’s unhelpful comment so that that’s not the only comment you receive. \n\nIt’s absolutely natural that you feel a complicated and/ or negative way about your recovery experience & the idea of gaining weight. It’s a faux pas to comment on other people’s bodies like that, so your friend messed up there, especially if she knows about your ED experience. So your feelings of hurt are totally valid, you shouldn’t have to go around having people talk to you like that.\n\nI don’t have any particular advice with the getting to accept your body thing. But what I will say is that it’s likely there are at least some people you know of, whether personally or celebrities, who have the same or higher weights than you who you find beautiful. So think about them, and try to stop holding yourself to a tougher standard. And remember how horrible it is to NOT be in recovery. I think it’s so cool that you’re recovering, as recovery means life will get better for you. So good for you, keep going, enjoy your life how it’s meant to be lived.",
      "created_utc": 1635679337.0,
      "score": 46,
      "context": []
    },
    {
      "id": "hitfi1f",
      "author": "None",
      "body": "Your friend should not be commenting on your body. Expesially when you are going through this. listen to me.YOU ARE FUCKING GORGEOUS. No matter your size. If anyone cares about your body drop those bitches.",
      "created_utc": 1635718694.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hiuh5rf",
      "author": "Illustrious-Ad-1667",
      "body": "She has no right to say that. That’s not a good friend.",
      "created_utc": 1635738087.0,
      "score": 0,
      "context": []
    },
    {
      "id": "hir3eeo",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1635678680.0,
      "score": -4,
      "context": []
    },
    {
      "id": "hir0uuw",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1635676748.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hjbtcbj",
      "author": "addiviv",
      "body": "Hey, I know it’s a problem in your mind and the last thing you want to do is speak to a loved one about what to do, it’s an incredibly hard and toxic mindset and something that I wouldn’t wish on anyone. If you want someone to talk to them just let me know because as someone who went through it, I can’t let other people go through that whilst I know they have issues. And that goes to anyone reading this. If you need someone to speak to about it, let me know.:)",
      "created_utc": 1636057519.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hjwsozg",
      "author": "KayB1010",
      "body": "I am so sorry your friend said that to you. I am also in recovery and your feelings are so a valid. My first suggestion would to try to set up boundaries with the people in your inner circle. It was really hard for me to do but I had to tell my friends and family to not comment on my body whether it is a good thing or a bad thing because either way I end up obsessing on their comment. I also learned from my therapist about body neutrality and it is helping me a lot. It’s the idea that you are content in the way your body looks. This has really helped me because I have found that body love takes up the same amount of space and energy in my brain as hating my body does so I am learning to just be neutral with my body and the way it looks.",
      "created_utc": 1636442550.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hium6tf",
      "author": "KaatjePlaatje",
      "body": "Well worded!  Also, there are days in which you will be more bloated and periods in your life in which you weigh more. The fact that she . At that point, thought you looked a bit bigger, doesn’t mean that it’s true and if you did in fact gain a few, that doesn’t have to be forever. In my experience, recovery will do a lot with your body; gaining fat stores (which are healthy up to a certain point! So that’s good) and probably also adding water weight because of changes in your metabolism. Your body needs to find a new equilibrium. If you want it to be, this can be just a phase. Weight doesn’t have yo be forever. It fluctuates. Gaining a bit is okay and loosing a bit in a healthy way is okay too. But leave the diets or exercise for when you’ve recovered. One thing at a time",
      "created_utc": 1635741162.0,
      "score": 3,
      "context": [
        {
          "id": "hir49ay",
          "author": "None",
          "body": "Hey I’m just commenting to offset that other person’s unhelpful comment so that that’s not the only comment you receive. \n\nIt’s absolutely natural that you feel a complicated and/ or negative way about your recovery experience & the idea of gaining weight. It’s a faux pas to comment on other people’s bodies like that, so your friend messed up there, especially if she knows about your ED experience. So your feelings of hurt are totally valid, you shouldn’t have to go around having people talk to you like that.\n\nI don’t have any particular advice with the getting to accept your body thing. But what I will say is that it’s likely there are at least some people you know of, whether personally or celebrities, who have the same or higher weights than you who you find beautiful. So think about them, and try to stop holding yourself to a tougher standard. And remember how horrible it is to NOT be in recovery. I think it’s so cool that you’re recovering, as recovery means life will get better for you. So good for you, keep going, enjoy your life how it’s meant to be lived.",
          "created_utc": 1635679337.0
        }
      ]
    }
  ]
}