{
  "id": "qkaidv",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1635760152.0,
  "title": "Request: struggling with binge eating. idk what to do and idk who to talk to",
  "selftext": " \n\ni have never talked about it with anyone but my entire life ive struggled with binge eating and eating as a form of emotional coping. im 22 and still havent figured out how to stop. but i am doing a lot better and lost a lot of weight over the last 2 years, but its getting bad again. so today i tried to ask one of my close friends if he can hold me accountable and not let me eat more than 2 times a day. (dont worry its not starving myself, i would still be getting enough calories and i make sure to eat nutritious foods) so i messed up and told him and he immediately says \"then why did u eat, go puke it out right now\" hes not a bad person...i know he only said that cuz he doesnt understand since he never had to deal with it and i never really opened up to him about it before. but i felt really terrible and guilty after he said that so i signed out of all my socials and i just wanna be invisible now. every single day i tell myself ok today is the day i start to get better. then every single day i mess up and just let it spiral. idk what to do and idk who to talk to :(",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/qkaidv/request_struggling_with_binge_eating_idk_what_to/",
  "score": 39,
  "num_comments": 12,
  "comments": [
    {
      "id": "hivdivj",
      "author": "house_for_sale",
      "body": "Maybe try to look for DBT specialist in your place of stay. It's one of the principals of such a therapy that therapist are available outside the meetings (via SMS or call) and they can give you some advice and strategies to cope with crisis (such as urge to BE)",
      "created_utc": 1635764941.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hivy4mr",
      "author": "in_the_sheyd",
      "body": "So there’s an increasing body of literature out there that suggests that for a significant percentage of people with BED a contributing factor driving their eating disorder may be pathological hunger caused by a metabolic disorder. It’s worth talking to your primary care provider.\n\nI’m sorry to hear about how your friend responded when you reached out for help. What they said was super insensitive and unhelpful.",
      "created_utc": 1635776861.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hiwz58p",
      "author": "RoseAtelier",
      "body": "Whatever u do, don’t throw up. It takes u down a dark and scary route. I’ve been there and this behaviour eventually brought me to life’s rock bottom and ED/MH rock bottom. \n\nWhat helped me stop was eat whatever u want at all hours to begin with. You’re gonna feel like you’re binge eating all day long but eventually I didn’t feel the urge to eat all day anymore and intuitive eating kicked in. I was stuck in a binge eating cycle for 2 years in my teens (gained 20kg through that), and what kept me in it was after every binge, I tried to “eat healthy” the next day but then binge again at night. This is because the “eat healthy” during the day was a form of restriction for me, not allowing myself sweets etc but those mental deprivations can trigger another binge. \n\nFor other people, what helped is eating balanced meals. But don’t let urself get hungry… it’s always hard in the beginning and restricting of any form WILL cause another binge",
      "created_utc": 1635792664.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hiwj878",
      "author": "wolfshadow1995",
      "body": "I would see if your PCP or anyone you know can recommend a psychiatrist. I used to struggle with minor binge eating and was prescribed prozac (mainly for issues with depression). Prozac is also prescribed for binge eating disorder also and it definitely helped me to not feel urges to eat a lot at one time. I felt more in control. \nAside from that, DBT therapy is really helpful for binge eating and any kind of disordered eating. \nWhat you’re going through is serious and is not your fault! I would recommend distancing yourself from anyone who convinces you to purge your food or supports you doing it.",
      "created_utc": 1635786122.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hixfx3j",
      "author": "Thisistradition",
      "body": "That sounds hard. It can be very confusing for people who don't have ED to understand what's actually helping vs harming! I obsessively count calories and my spouse thought it would be helpful to encourage the counting lol. I would get a baseline understanding of what sort of support you need. A good way to do that is with a doctor or a therapist who can direct you from there. If that's not an option, CBT (cognitive behavioral therapy) workbooks for ana/mia/binging might be a good option. You can find workbooks cheap on eBay(3-15$). There's lots of free worksheets online as well! CBT helps you recognize why you react the way that you do, identify thought patterns and triggers etc. I try to be really careful on who I lean on w mental health because not everyone can handle it. If he is a good support then maybe doing some research himself might be a good idea.",
      "created_utc": 1635799453.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hiyijp8",
      "author": "lara_m_c",
      "body": "What your friend said is so not okay and is also really counterproductive! I'm so sorry you're going through this. Know that lots of other people (myself included) have been where you are now, and you aren't alone! Though my ED issues have never involved purging, I know from experience that restrictive things like undereating/purging almost always make things worse. They set off a back and forth swing between binging and restricting that gets more and more severe and harder and harder to break out of. \n\nOne recommendation I have is to try to get away from the \"new day\" mentality where every day you tell yourself that this is a new day and you'll start eating healthier today. For me, that mentality just caused me to write off any day where I wasn't perfect and spiral out of control because if the day was already ruined I might as well just keep eating. And then the next day I would try to restrict extra hard to make up for it, end up caving at the end of the day because I was exhausted and hungry, and start the cycle all over again. When I stopped doing this and started trying to treat every new eating choice as completely independent, it helped me a ton. \n\nIf you can, talk to a therapist. Mine helped me so much with getting over my shame around eating, which I think is probably the root of my ED issues. And definitely tell your friend that what they said isn't okay (if/when you feel up to it). It's never okay to tell someone to purge, full stop, it doesn't matter if you asked them to help keep track of your eating.",
      "created_utc": 1635816265.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hiynter",
      "author": "sandgoon1235",
      "body": "Hi there here are some things that helped me in the long run\n\nDon't deprive yourself of anything. For example if you are forbidding yourself from eating sweets  or more than 2 times a day then you are setting yourself up for failure because we are humans who give into temptation. So you need to talk to yourself like a friend - \n\n\"I know you love \\_\\_\\_ so I bought you some. They are yours to keep and you can have them anytime. They aren't going anywhere so you can have some now AND later if you want.\" \n\nJust knowing that in the back of your mind can really help. \n\nIt is mental gymnastics in a way, and it wont fix overnight. But celebrate the little victories. One day you will be so secure knowing that you really can have any food you want whenever you want, you wont feel the demon breathing down your neck. You might see it places but it wont control you like it use to. \n\nAnd another note with the 2 meals thing. Your demon loves making you feel shitty and setting strict boundaries is like its dream come true. The only way around that is **absolutely no food rules.** \n\nYou can have food goals like \n\n\\- Eat with a friend \n\n\\- Try something new for lunch \n\n\\- Learn how to cook falafel or pomegranate pie  \n\n&#x200B;\n\nThe first step is recognizing the problem the next is being willing to do something about it. \n\n&#x200B;\n\n**You are on the right track and you have millions cheering you on. YOU GOT THIS.**",
      "created_utc": 1635818648.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hiz2cov",
      "author": "thats_scrummy",
      "body": "Fellow binger here… I found that having a therapist, nutritionist, and going to Overeaters Anonymous meetings REALLY help me, particularly OA. It’s exactly what it sounds like - Alcoholics Anonymous for eating. It’s all about working the twelve steps to stop overeating and gives you the tools to cope in other ways. Totally free.",
      "created_utc": 1635826075.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hjs577g",
      "author": "Aggressive_Mousse343",
      "body": "You need to try to understand your emotions. Try to find them. Than try to understand them. And than you need to feel these emotions. It can be (it will be , I’m sorry) so hurt, it will make you cry. But when you binge eating, you try to suppress, eat this feeling, this emotions. And it destroys you from the inside.\r  \nRemember when your body (in fact your brain and mind) wants to eat, actually your body give you a sign , that you are not okay right now.\r  \nYou should be grateful to it, and you should learn to listen to yourself!",
      "created_utc": 1636358787.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hiv7rhf",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1635760152.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hiyj0rm",
      "author": "alexr1824",
      "body": "I've struggled with binging too, pretty much my whole life until I got it under control a few years ago. 1 thing that helped me is portioning out all of my food I know I am going to eat the night before. All my snacks. If I have crackers or cookies I will put them in a baggie the night before and only allow myself to eat what I have prepared. I also write down the total number of calories I will be consuming if I only eat what I have meal prepped. You aren't alone! I hope this helps in some way.",
      "created_utc": 1635816484.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hiwcoyt",
      "author": "No_Bodybuilder_5658",
      "body": "Good thought. I actually have adrenal issues, maybe that's why mine has gotten worse recently. I was just diagnosed last year 🙄 years of struggling and all it took was one test!",
      "created_utc": 1635783352.0,
      "score": 1,
      "context": [
        {
          "id": "hivy4mr",
          "author": "in_the_sheyd",
          "body": "So there’s an increasing body of literature out there that suggests that for a significant percentage of people with BED a contributing factor driving their eating disorder may be pathological hunger caused by a metabolic disorder. It’s worth talking to your primary care provider.\n\nI’m sorry to hear about how your friend responded when you reached out for help. What they said was super insensitive and unhelpful.",
          "created_utc": 1635776861.0
        }
      ]
    }
  ]
}