{
  "id": "qooe0v",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1636291184.0,
  "title": "Request: How to talk to preteen",
  "selftext": "&#x200B;\n\nMy niece is 10 I fear she may have an ED I noticed when she comes over she always goes to the bathroom after eating. A few times she has “gotten sick” in the bathroom and could not finish her food. Both her parents have made multiple comments on her weight and I tell them to stop every time. I’m worried about her I don’t know if I am jumping to conclusions she is very open with me so I feel she would be honest I just don’t know how to start a conversation. Is ten years old young to start an ED. I apologize in advance if this could be triggering for anyone. I just want ti help her before it could be too late if it is a thing. Thank you.\n\n&#x200B;\n\n I don’t want to put the idea in her mind if she hasn’t done these things purposely But I want to have a conversation",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/qooe0v/request_how_to_talk_to_preteen/",
  "score": 64,
  "num_comments": 13,
  "comments": [
    {
      "id": "hjohsxv",
      "author": "None",
      "body": "You could and should put the idea into her head, that bulimia nervosa is a life threatening, long-term damage inflicting behavior that will kill or ruin her eventually. \n\nNot in such drastic terms, maybe, but she better gets off the train now before it's too late.\n\nAnd I don't think that in this day and age, 10 years is too young to consider such things... There are case reports of younger children coping with trauma through eating disorders.\nShe is about to hit puberty, so the pressure to be a \"pretty thin girl\" is about to start. She is already confronted with this very specific beauty standard for the female body, so she might be exactly doing what you think she is doing.\n\nI share your concerns. \n\nTalk to her in private. The idea won't be new to her.",
      "created_utc": 1636297345.0,
      "score": 34,
      "context": []
    },
    {
      "id": "hjom79p",
      "author": "None",
      "body": "i started just as young. it’s never too young.",
      "created_utc": 1636299184.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hjp5sqm",
      "author": "mochakatpuccino",
      "body": "I began purging and feeling bad about my own weight in the 7th grade. I would say 10 years old could easily be old enough to struggle with these issues, especially in this day and age with the internet. I remember triggering myself through ED tumblr, imagine ED tik tok or any platforms that kids use today. Scary.",
      "created_utc": 1636306962.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hjowmf6",
      "author": "Farfromvalid",
      "body": "I started at 8, please talk to her",
      "created_utc": 1636303336.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hjoe7r3",
      "author": "None",
      "body": "Someone can have an ED at any age. The best thing to do is to ask if there is anything she wants to talk about and let her know that you will always be here if she wants to tell you anything.",
      "created_utc": 1636295813.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hjpaic9",
      "author": "waist-land",
      "body": "I wish I had someone looking out for me when I was her age. Please talk to her.",
      "created_utc": 1636308842.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hjqbx4a",
      "author": "blueberries-Any-kind",
      "body": "Eating disorders are extremely concurrent with to a lot of Other mental health things.. particularly trauma (Abuse of any kind/neglect). \n\nI didn’t even realize I had an eating disorder until 30. 10 year olds are young even if 10 year old girls can be very articulate compared to boys. Their logic and reasoning is obviously still very undeveloped. I think we forget that sometimes. We are reactionary beings. \n\nThey might not have the logic or self awareness to understand what’s going on with themselves so it is a great idea to check in. \n\nI’m the shortest person in my family because I was neglected and malnourished. I wish desperately I had intervention at 10 years old. It was the first time I wanted to kill myself. I desperately needed therapy. I wish anyone in my life had intervened.",
      "created_utc": 1636323609.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hjs4skg",
      "author": "TrueTransSoulRebel22",
      "body": "She definitely isn’t too young. Like others have already said, I was about her age when my ED started. I have several chronic GI issues now. Studies show that early intervention is incredibly helpful with EDs too. I wonder all the time how different things would be if mine had been noticed earlier. Next time you’re alone with her I would open up a conversation about it. Be honest about your concerns, but try not to be accusatory. She might be unaware of the dangers of what she’s doing or that it’s even an eating disorder. We didn’t learn about EDs until 7th grade and I already had been engaging in behaviors before then.",
      "created_utc": 1636358437.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hjo4sn0",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1636291184.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hngl9jh",
      "author": "rubdubintub",
      "body": "I remember being this age and my parents being suspicious. Their suspicions resulted in my father mocking me at the dinner table while I was in the bathroom to a table full of guests, and no end in my behavior. Be careful how you intervene because if you are not delicate your niece may still be struggling in 10 years.",
      "created_utc": 1638800246.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hjqz1dt",
      "author": "None",
      "body": "I started engaging in bulimic behaviors around the same age, and now I have chronic GI issues, a hole in my stomach, no enamel on my teeth, and extensive trauma. Please please please take this person’s advice.",
      "created_utc": 1636333914.0,
      "score": 5,
      "context": [
        {
          "id": "hjohsxv",
          "author": "None",
          "body": "You could and should put the idea into her head, that bulimia nervosa is a life threatening, long-term damage inflicting behavior that will kill or ruin her eventually. \n\nNot in such drastic terms, maybe, but she better gets off the train now before it's too late.\n\nAnd I don't think that in this day and age, 10 years is too young to consider such things... There are case reports of younger children coping with trauma through eating disorders.\nShe is about to hit puberty, so the pressure to be a \"pretty thin girl\" is about to start. She is already confronted with this very specific beauty standard for the female body, so she might be exactly doing what you think she is doing.\n\nI share your concerns. \n\nTalk to her in private. The idea won't be new to her.",
          "created_utc": 1636297345.0
        }
      ]
    },
    {
      "id": "hjogv3w",
      "author": "peterpan_215",
      "body": "Thank you i’m gonna try and say that today before she goes home. We usually talk about a lot like school and crushes etc I hope she’d be open to sharing if so.",
      "created_utc": 1636296940.0,
      "score": 8,
      "context": [
        {
          "id": "hjoe7r3",
          "author": "None",
          "body": "Someone can have an ED at any age. The best thing to do is to ask if there is anything she wants to talk about and let her know that you will always be here if she wants to tell you anything.",
          "created_utc": 1636295813.0
        }
      ]
    },
    {
      "id": "hjoyxk5",
      "author": "None",
      "body": "You sound like a very good outlet for her",
      "created_utc": 1636304240.0,
      "score": 8,
      "context": [
        {
          "id": "hjoe7r3",
          "author": "None",
          "body": "Someone can have an ED at any age. The best thing to do is to ask if there is anything she wants to talk about and let her know that you will always be here if she wants to tell you anything.",
          "created_utc": 1636295813.0
        },
        {
          "id": "hjogv3w",
          "author": "peterpan_215",
          "body": "Thank you i’m gonna try and say that today before she goes home. We usually talk about a lot like school and crushes etc I hope she’d be open to sharing if so.",
          "created_utc": 1636296940.0
        }
      ]
    }
  ]
}