{
  "id": "qyx5ij",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1637508175.0,
  "title": "Request: Boyfriend with ED lying",
  "selftext": " \n\nMy boyfriend and I have had several conversations about his eating disorder but mostly very emotional ones with both of us crying and me begging him to stop purging because his eating disorder is effecting our relationship. And in every conversation he agrees he will get help. Within a few days of those conversations he’s back to purging and I check in with him and will say “I’ve noticed you doing this\\_\\_\\_\\_ are you okay?” but he always says he’s fine and that’s nothing but he also repeatedly reminds me he hates talking about it which I get it but he hides so much from me and when he’s starting back up again he lies to me about going to the bathroom.\n\nI keep seeing online that i am not supposed to take his secrecy personally but it’s so hard to not feel like he’s lying to me and abusing my trust, and now I feel like my trust for him is being effected too.\n\nHow do I tell him AGAIN that his eating disorder is effecting our relationship, and that I can’t keep having these conversations begging him to get help and him agreeing and then he stops for a few days just to start back up again?\n\nI need advice as a significant other on how to help him, but I also need advice on when should I stop trying to help someone who obviously doesn’t actually want help or get better?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/qyx5ij/request_boyfriend_with_ed_lying/",
  "score": 45,
  "num_comments": 10,
  "comments": [
    {
      "id": "hlirof6",
      "author": "MaryContrary26",
      "body": "How much do you know about eating disorders? Would it surprise you to know that my ED came before my husband? My friends? My job? And that I didn't recover for any of them? I recovered when I was ready, for me. It may sound horrible but there was no \"we\" when I was deep in the ED. I wasn't capable of really connecting with anyone. I was fixated on ED related thoughts that circled around in my head and everything else was pretty much peripheral. I can't speak for your bf but if he doesn't want to recover maybe consider what you want or what you can handle?",
      "created_utc": 1637510041.0,
      "score": 56,
      "context": []
    },
    {
      "id": "hlj2blm",
      "author": "wesjag03",
      "body": "As someone who has lied to my spouse about my ED. Trust us it’s not personal, in my experience I just don’t want to hurt them. He probably wants help but is scared. This disorder is like an addiction, it takes over the mind. Don’t take it personally that you can’t help him. After all for many it takes years of professionals aiding in recovery.",
      "created_utc": 1637514415.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hlk9vm0",
      "author": "None",
      "body": "To be blunt and honest, there is nothing you can do or say to get him to stop until he is ready. I was bulimic for 10 years before I got the willingness and courage to address it. My friends knew, my family knew, my therapist knew. None of them had any chance of getting through to me until I got through to myself.",
      "created_utc": 1637531897.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hliuyl8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1637511392.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hlkw3s3",
      "author": "blueberries-Any-kind",
      "body": "I was married to someone who was an addict for many years, the relational behaviors you are describing are exactly what it was like when I was with him. I desperately KNEW I couldn’t change him, we would have conversations where he promised to get better, to cut down, to try harder to fix it. But then it just lead to lying. The more pressure I put, the more secretive he got. \n\nIt’s desperately sad and painful when people can’t/won’t quit the things that are destroying their life and/or their relationship or other important things in their life. The only thing you can do in this time is to put up your own boundaries. If you notice him doing xyz, then the only thing you can change or work with are your own reactions. For example- You can now decide that his choice to not get help is something you can’t or can’t live with- and you can leave or stay in the relationship. This is your time to make a decision, because he’s unfortunately not ready. You can decide to accept where he is at if you can live with you can continue to encourage him to get help, but it’s a slippery slope into begging- and may come with a world of pain/disappointment. \n\nThere will be a turning point, but it may not come for years - literally. I’ve had eating problems for 10-15 yrs. Even my doctor looking me in my eyes and telling me I had an eating disorder over and over for a year couldn’t get me to change. I literally had to come the conclusion on my own. It happened while I was completely alone for a weekend while my partner was away. \n\nA huge part of relationships are about accepting the person you are with, and deciding what you can and can’t live with. That might sound like tough love, but at its core it’s about both partners being able to live their truth. \n\nThings like addiction (which I kind of think EDs are similar to), and EDs, are that they are serving an underlying purpose. I found out a year after my husband and I broke up and he was molested.. and I grew up with so much trauma also. He was using his addiction to numb and I was doing something similar. While both things were absolutely horrible for our bodies they did serve a purpose in some ways. My ex is still not sober, and I am happy I have found recovery. \n\n“Help is the sunny side of control”",
      "created_utc": 1637541784.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hll21pw",
      "author": "fabs1171",
      "body": "It’s easier and less confronting to purge than it is to address the issues at the root cause of the eating disorder. \n\nI am highly educated with a stressful and successful career but I have had some form of an eating disorder since I was 17 and it’s only been the last 5 years that I’ve started addressing the cause of my disorder. Just like an addict, I’ve used a relationship with food as my coping mechanism rather than talking about the feelings of self worth, abandonment, poor self esteem, shame, guilt etc but I didn’t realise that was what I was doing. I thought I had the control but the reality is the ED had the control and until I was ready to delve into the ‘why’ I wouldn’t be able to stop. It’s sucks and it’s easier to binge/purge than to address my feelings. \n\nI refer to them as my demons, they tell me that there’s so much that’s wrong with me that there’s no way I’m worthy, loved, valued etc and it took me an acute depressive episode with significant suicidal ideation, failed suicide attempt and a complete inability to work before I was able to understand why I had my ED and start facing the causes of it. \n\nI started on medication and see my psychiatrist every week. I’ve had great successes and huge failures but I’m still moving forward - I don’t want to be controlled by my demons and food. \n\nAddressing my traumas, I have physically lost so much - left my emotionally abusive marriage after being with him for 28 years, he accused me of stealing when I was attempting to take some shared property as well as property that was mine gifted to my by my granny upon her death - with my name scratched into the back of it by my granny. I walked out of the house with my clothes and car. I had no ability to fight it, I chose to abandon my religion as it was also a basis for my ED so I lost my identity and the support of the church. I lost a very close friend - who we’d had family holidays with, children grew up together and we both had a grandchild a day apart but she decided it was too hard to remain friends. I was so devastated at that abandonment and was completely unprepared for that. Recently she has reconnected with me and I’ve started to navigate what that friendship will look like. \n\nSorry for the long reply - right now your boyfriend finds comfort in his ED rather than trying to find the cause of it. He has to be ready to lose his support system (the ED) as well as others that might find it too traumatic for them and that is so hard \n\nPM me if you have any questions",
      "created_utc": 1637544594.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hll38jb",
      "author": "Zahraa112",
      "body": "from experience , I lied plenty of times to my friends about improving. I love them, it’s not personal. But at that time I was processing things different. I didn’t want to disappoint them and myself, and another part of me wanted to keep going because I would feel guilty if not. \n\nWhen he’s ready, he’ll open up with you about it, or he’ll get better. Getting better from ED’s are like, 80% self readiness. With you supporting him, he’ll get there. He’s not abusing trust, he probably thinks he’s fine. I believed I was fine and didn’t care about the danger risks. \n\nAnd honestly, when venting, my friends started picking up on my ED habits, so maybe he’s trying to protect you.\n\nED’s are a big deal. I knew it was unhealthy and didn’t care. For a while, I thought it was good. It’s a vicious cycle. When you try to stop, you feel yourself falling back. Opening up about it is hard, because at times I myself believe it’s not “bad”, and that’s your brain playing tricks on you",
      "created_utc": 1637545149.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hlin8ci",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1637508175.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hlitrc3",
      "author": "throwaway53728648",
      "body": "I do and don’t know about them and I’ve been trying to understand. It’s so hard to not feel like he’s abusing my trust by lying to me when I know it’s not personal.\n\nHe’s made comments to me and his friends that seem like cries for help, like “I really hate how my body looks” and “as the scale goes down I don’t like how I look more so maybe if I lose another 10 pounds I’ll finally be happy” and “I feel like I can’t eat or else I’ll gain weight and I’ll be more unhappy with how I look”\n\nSo he’s open with how unhappy he is about himself, and we have had so many conversations where he admits he doesn’t want to be bulimic and wishes he loved himself, but then he also says “shrinks are only for people who are fucked in the head” \n\nWe have had many conversations about his ED and I’ve told him I want to be honest with me every time and not hide things from me so I can try to help him be happy and love himself and this time has been the worst with him lying and keeping secrets from me and I’m not sure what changed. I’ve told him I can’t handle being lied to and that’s a big deal to me and I may not know exactly how to help but honesty is important.",
      "created_utc": 1637510891.0,
      "score": 1,
      "context": [
        {
          "id": "hlirof6",
          "author": "MaryContrary26",
          "body": "How much do you know about eating disorders? Would it surprise you to know that my ED came before my husband? My friends? My job? And that I didn't recover for any of them? I recovered when I was ready, for me. It may sound horrible but there was no \"we\" when I was deep in the ED. I wasn't capable of really connecting with anyone. I was fixated on ED related thoughts that circled around in my head and everything else was pretty much peripheral. I can't speak for your bf but if he doesn't want to recover maybe consider what you want or what you can handle?",
          "created_utc": 1637510041.0
        }
      ]
    },
    {
      "id": "hlj1n2y",
      "author": "throwaway53728648",
      "body": "I have made him a list of different ways to get help, with dietitians numbers, therapists numbers , in person and online, friends of mines numbers I know who have had EDs and anonymous support groups meeting time and places.The only thing I haven’t done is offered to go with him but I can try!",
      "created_utc": 1637514140.0,
      "score": 3,
      "context": [
        {
          "id": "hliuyl8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1637511392.0
        }
      ]
    },
    {
      "id": "hljlutm",
      "author": "MaryContrary26",
      "body": "I'm a pretty honest person but I wasn't when I was in the disorder for a lot of reasons. I didn't want to admit how sick I was, my brain played tricks on me and sometime I didn't even know how sick I was, if I was transparent about everything and about not wanting to get help people would get frustrated and lose patience, they didn't understand my experience anyway, and I didn't even want to share my private little hell with anyone completely. I agree that his dishonesty pushes loved ones away but maybe addiction  isolates the sufferer, maybe the addict self-isolates to protect the addiction, maybe both.",
      "created_utc": 1637522180.0,
      "score": 4,
      "context": [
        {
          "id": "hlirof6",
          "author": "MaryContrary26",
          "body": "How much do you know about eating disorders? Would it surprise you to know that my ED came before my husband? My friends? My job? And that I didn't recover for any of them? I recovered when I was ready, for me. It may sound horrible but there was no \"we\" when I was deep in the ED. I wasn't capable of really connecting with anyone. I was fixated on ED related thoughts that circled around in my head and everything else was pretty much peripheral. I can't speak for your bf but if he doesn't want to recover maybe consider what you want or what you can handle?",
          "created_utc": 1637510041.0
        },
        {
          "id": "hlitrc3",
          "author": "throwaway53728648",
          "body": "I do and don’t know about them and I’ve been trying to understand. It’s so hard to not feel like he’s abusing my trust by lying to me when I know it’s not personal.\n\nHe’s made comments to me and his friends that seem like cries for help, like “I really hate how my body looks” and “as the scale goes down I don’t like how I look more so maybe if I lose another 10 pounds I’ll finally be happy” and “I feel like I can’t eat or else I’ll gain weight and I’ll be more unhappy with how I look”\n\nSo he’s open with how unhappy he is about himself, and we have had so many conversations where he admits he doesn’t want to be bulimic and wishes he loved himself, but then he also says “shrinks are only for people who are fucked in the head” \n\nWe have had many conversations about his ED and I’ve told him I want to be honest with me every time and not hide things from me so I can try to help him be happy and love himself and this time has been the worst with him lying and keeping secrets from me and I’m not sure what changed. I’ve told him I can’t handle being lied to and that’s a big deal to me and I may not know exactly how to help but honesty is important.",
          "created_utc": 1637510891.0
        }
      ]
    }
  ]
}