{
  "id": "r1v5xa",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1637841980.0,
  "title": "Request: I have difficulty eating, even putting food in my mouth. I've been starving myself.",
  "selftext": " \n\nI can't eat, I just can't bring myself to put food in my mouth. I don't feel hungry at all. I go through the entire day without eating anything. I don't understand how my body still has the energy to function, but I'm very concerned about my loss of appetite. I cry a lot realizing that I have food in front of me but I'm unable to eat it. This used to happen to me in the past too, but this time the problem has been so prolonged that it's alarming. I don't feel hungry at all. It's like my mind is refusing to accept food. What do I do?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/r1v5xa/request_i_have_difficulty_eating_even_putting/",
  "score": 44,
  "num_comments": 6,
  "comments": [
    {
      "id": "hm1zuhb",
      "author": "Aeimr_exe",
      "body": "Hey, I've been struggling with it too lately. Don't feel the need to eat quickly, take your time. First, if you panic, take deep breaths and do simple yoga exercises to calm you down.\nThen, you can put some fresh water on your face if you feel nauseous when looking at the food.\nAnd you can watch something at the same time, like a show you like or a YouTube video, not to think about food and eat without really realizing it. \n\nI hope that will work for you 💕",
      "created_utc": 1637861109.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hm28kuu",
      "author": "Sleepy_Ren",
      "body": "Hi OP, I would highly suggest to seek out professional help if you're feeling very scared and vulnerable. \n\nBut if that's not possible for you, I second what u/Aeimr_exe says. Distracting yourself while eating is a good idea. You could even Zoom call a trusted friend to eat with you, so you can feel supported. Don't pressure yourself, it's going to be very bad for you to eat the quantity you used to eat before the ED tomorrow. Go little by little: maybe today could be a piece of toast with some spread you like, and tomorrow could be the toast and some fruit, and keep increasing the quantity slowly. \n\nYou're not alone in this, you can tell this to someone you trust if you think that'll make you feel better. I'm very glad you reached out to us, you're so brave and amazing <3\n\nI want to let you know that my dm's are open if you'd like to talk or ask any questions you have. \n\nWe love you and take care :)",
      "created_utc": 1637864753.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hm0ya4d",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1637841980.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hm3mmak",
      "author": "None",
      "body": "Most eating disorders stem from earlier trauma - I'm a psychotherapist with an ED and also in research relating to this. If you're feeling particularly anxious/upset/worried (outside of the ED) it affects our gut, our appetite, our ability to enjoy taste and texture etc. As others have suggested, I find it helpful to do something else while I eat. I eat when I remember (no hunger) so no set meal time, and I don't mull it over too long, eat and run, so to speak. I'm either engaged in a conversation in rl or online, or I'm doing something else to occupy my mind.",
      "created_utc": 1637888335.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hm4slo8",
      "author": "blueberries-Any-kind",
      "body": "Hey there. So sorry you’re going through this\n :( If you’re lack of appetite is stemming from anxiety (Mine was) you could try getting a massage- I’ve found that so helpful in jump starting my appetite because it helps my nervous system calm down. I’ve also found going for a fun swim (not necessarily for weight loss, but just to connect with my body) will trigger my appetite because it reminds me of being a kid and being hungry after swimming in the summers- the smell of the chlorine, the feeling of wet hair.. Maybe there’s something you can think of for you might be a positive trigger like swimming is for me. Something that used to make you super hungry, or you associated in a positive way with eating - even if it’s just a snack. \n\nI’d also recommend going to a doctor if you can. I am fairly certain there are hunger triggering drugs they can prescribe you to help you get started on your journey in recovery. You’re headed the right direction! Don’t give up hope 💜",
      "created_utc": 1637913197.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hmg1gnf",
      "author": "summerinsummerisle",
      "body": "do you have an overactive gag reflex or is it just a lack of appetite? ive found eating food i really love helps, even if i don’t eat much of it. cbd oil can help some, also distracting myself as much as possible when I eat.",
      "created_utc": 1638132673.0,
      "score": 1,
      "context": []
    }
  ]
}