{
  "id": "r1v8qv",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1637842278.0,
  "title": "Request: How to enjoy Thanksgiving at my bf’s family’s house when they barely eat?",
  "selftext": " \n\nI’m going over to my boyfriend’s family’s Thanksgiving tomorrow. This will be my first big holiday since being diagnosed with an ED and entering recovery.\n\nThis holiday is already a challenge for me, but going to his family’s place is going to make it even harder for me. Simply put: they barely eat.\n\nYou know those scenes in movies where someone cooks an extravagantly large breakfast, just for another character to take a bite of toast, say they’re stuffed, and leave? That is my boyfriend’s family to a tee.\n\nI’ve been out to dinner with them several times. They’ll eat a small portion of whatever it is they order, then take the rest home.\n\nHis mother is the type of mom who eats a yogurt for breakfast and doesn’t eat anything else all day. He’s adopted some of these same habits, and it’s understandable: the eating patterns you’re raised around are typically the ones you eventually adopt yourself.\n\nI want to enjoy the day and not stress about it when I inevitably feel hungry for dinner and want to eat more than they eat. I’m so stressed about this already and I can feel myself dreading what should be a nice day.\n\nAny advice would be helpful :/",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/r1v8qv/request_how_to_enjoy_thanksgiving_at_my_bfs/",
  "score": 45,
  "num_comments": 8,
  "comments": [
    {
      "id": "hm11le3",
      "author": "sarahannebutterfield",
      "body": "I am in the same boat only it is my parents who are the ones who barely eat and my nana is currently vocal about being on a diet. What I'm doing to prepare is reminding myself that food has no moral value, it is just food. And I try to view the situation as I feel more sorry for them because they're missing out on happy parts of life for arbitrary reasons.",
      "created_utc": 1637844328.0,
      "score": 21,
      "context": []
    },
    {
      "id": "hm1m2in",
      "author": "tymopa",
      "body": "When I went to intensive outpatient treatment for EDs we tackled this concern. The worry that someone is watching and monitoring food intake is no joke. We had to learn to follow what the body says not our other unhealthy thoughts. So if possible, and this is easier said than done, enjoy the food despite their tablespoon serving of mashed potatoes. I've also had to train people not to make comments. It's not fun, but I think people in general need to shut the hell up and mind their own business about what other people are eating.  If you're inclined, i would love to hear how it went.",
      "created_utc": 1637855170.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hm1dtzk",
      "author": "heythankscanyoustop",
      "body": "My Fiancé to a T. It's hard, being surrounded by people who have smaller appetites or just don't eat at the same times as you. I've started reminding myself that every body and metabolism are different, my needs are different from everyone else's and honouring my hunger and dietary needs comes before conformity",
      "created_utc": 1637851309.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hm1v8he",
      "author": "None",
      "body": "Try to remind yourself every single persons body operates differently and has different needs. When I start to compare I simply repeat to myself “they are not me” and it works to release myself from the comparison trap",
      "created_utc": 1637859151.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hm3xgne",
      "author": "Daddy_urp",
      "body": "I’m sorry, this sounds stressful. It’s easy to say “just eat what you want who cares” but it’s actually very hard to do. Try to have a yummy filling breakfast beforehand so if you end up feeling too overwhelmed you know that you’ve already nourished your body a bit. And try to remind yourself that food isn’t bad, we need it to survive, and if you need more food you should get it to help your body and your mind.",
      "created_utc": 1637894055.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hm0yoib",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1637842278.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hm51ttp",
      "author": "Ketamine-pigeon",
      "body": "Ah, I’ve dealt with this. As a bulimic, my Ed has caused me to binge. Meanwhile my twin has anorexia. And then two other family members have Eds. So I can’t eat a meal at a big gathering without wanting to rip my skin off afterwards. My tip? Black everyone out and focus on your plate. You have suffered for a long time and worked hard to be able to finally enjoy a meal. The food is your fight for survival, it’s your gift at the end of the tunnel. Fuck the other people. Just relish and enjoy your food. Bc it’s not about them. It’s about the joy you experience eating. They can go fuck themselves if they end the meal with a comment like “wow you put away a lot”. Yes tf I did. Bc I almost died a few times. You’ll get it buddy, good luck",
      "created_utc": 1637920782.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hm7sw7k",
      "author": "lil_microwave_oven",
      "body": "just eat normally",
      "created_utc": 1637972813.0,
      "score": 1,
      "context": []
    }
  ]
}