{
  "id": "r90sjh",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1638656787.0,
  "title": "Request: I’m a healthy weight, but it’s getting progressively harder to eat and easier to starve myself",
  "selftext": " \n\nI feel like I’m in the middle of developing an eating disorder. I’m a healthy weight, but it’s getting progressively harder to eat and easier to starve myself. Every time I see food with high calories I mentally gag and feel sick. I can’t bring myself to eat them. My thoughts are getting more and more focused on eating and my body and how I can lose weight. I also eat only fruit for breakfast and skip dinner completely. How do I make these thoughts stop and return to my old eating habits?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/r90sjh/request_im_a_healthy_weight_but_its_getting/",
  "score": 38,
  "num_comments": 6,
  "comments": [
    {
      "id": "hnaqw98",
      "author": "Free-_-thinker",
      "body": "Intuitive eating. I’m recovering from anorexia, like I obsessively weighed my food, and counted all the calories, but I realized that our bodies actually know what they need. When I eat unhealthy stuff one day like chocolate (still can’t believe I’m eating chocolate again) I crave healthy stuff the next day, so it’s all kinda even. Also I researched some stuff, and eating a lot one day won’t do shit. Like if you eat a normal amount most of the time and then one day you eat twice the amount of calories, nothing will really happen. I never eat twice the amount, but it helps me relax about it, and just eat when I’m hungry. What also helped me not wanna lose more weight, is the starvation mode your body enters once it’s too thin, like then you have to eat such a small amount to not gain weight, and to get out of this, you’d have to gain a bunch, to lose that again, and that just sounds unnecessarily stressful. I’d recommend looking up the negative effects of anorexia, and how gaining weight isn’t even that easy, that it just happens on accident, and wish you the best to get out before it gets really bad. I can for sure say, that even tho I wanted to be skinny for so long, it really wasn’t worth it, and there was never once a point where I liked myself more cuz I lost a lot of weight. More like the opposite. Recovery is helping me to get along with myself more",
      "created_utc": 1638687967.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hn94q9k",
      "author": "Em42",
      "body": "When I was working high energy jobs I drank a lot of protein shakes. I couldn't always force myself to eat but at least I could force myself to drink them without making myself sick. Not just boring ones like ensure either, good stuff like bolthouse farms vanilla chai and mocha flavors, and other brands you find at like health food stores. It at least gave me the energy I needed to make it through shifts when I was in a bad place.",
      "created_utc": 1638659309.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hnbdi9v",
      "author": "TrueTransSoulRebel22",
      "body": "With eating disorders there is a higher chance of recovery with early intervention. I would recommend seeing a therapist and dietician that specifically treat people with EDs now so they can help you get back on track. The podcast Food Psych by Christy Harrison is also really great.",
      "created_utc": 1638705956.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hn8ys30",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1638656788.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hncsut1",
      "author": "sandopsio",
      "body": "Do you know what brought them on? The restrictive eating patterns and thoughts you describe are an eating disorder. It's important to get help and advocate for the support you need to combat these thoughts as you've said and be able to eat in a more recovered way. Something usually triggers it developing, whether it's a life transition or stressful event (or trauma), heightened anxiety, lack of support etc. It may seem gradual (as you call it developing) but every second of it progressing is serious and the best time to get support and help and work toward recovery is always now. Do you see a therapist? When your thoughts are focused on your body, can you tell what's behind them? Can you tell those thoughts that your body isn't the problem, and that you deserve compassion, and then ask those thoughts what they really need from you?",
      "created_utc": 1638730214.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hnlgjlh",
      "author": "M1nn1m0use",
      "body": "Changing what you eat changes your body and cravings so your body craving different foods isn’t necessarily bad, it’s just what you’re conditioning your body to expect/want which may be different from how you were before. But fear of food or food groups isn’t healthy long term so Definitely talk to a professional about it to help you better understand what your body needs/is asking for vs. Other reasons certain foods may make you feel bad about yourself. \n \nif you’re worried and can’t get help quick, In the meantime don’t punish yourself or panic thinking somethings wrong with you because it’s not, anytime you have an intrusive thought like that just give it space to exist so you can try to examine it like a scientist and find the root cause instead of feeling bad for thinking it. If that’s too much right now, at least try to eat with people who you feel comfortable with that don’t have symptoms to help you reinforce and feel comfortable eating what you used to. If that’s too much, up the quantity of foods you’re comfortable with and use affirmations like “I’m putting gas in the car so it can run”, “all food is fuel and by eating this I’m giving myself the strength to kick ass and take names today”, “there’s no such thing as bad or good foods and by listening to my body’s intuition I’m being the healthiest I can be”, “everything in moderation, even moderation” and try to see what’s causing you to feel this way now specifically. You aren’t alone and you’re already ahead of the game seeking advice so be very proud of yourself for that! But if you can talk to a professional do it ASAP to be proactive protecting yourself, and if not, keep reaching out here so you have people to talk to ♥️",
      "created_utc": 1638886974.0,
      "score": 1,
      "context": []
    }
  ]
}