{
  "id": "rdxfh3",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1639220144.0,
  "title": "Request: how to survive in a society obsessed with calories",
  "selftext": " \n\nI’m afraid I’m going to be haunted by calories for the rest of my life. They’re everywhere, food packets, menus, online ordering. The vending machines at my university have stickers on them that say “calories count.” I’ve memorized the calorie counts for all of the food I eat regularly. I’ve struggled with eating disorders off-and-on for nine years and there’s been a running tally of my daily caloric intake for that entire timespan. I know that nutrition labels are important for others but I don’t want to see them anymore. I don’t know what to do.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/rdxfh3/request_how_to_survive_in_a_society_obsessed_with/",
  "score": 50,
  "num_comments": 6,
  "comments": [
    {
      "id": "ho42cj8",
      "author": "tryingtorecover54",
      "body": "So, therapy therapy therapy. I've had to start eating whole unpackaged foods. If I go out im not ordering my SO is (which is stressful as im celiac. But he's very good) and he removes all nutrition labels from foods he brings in the house, salads, anything. Food scales are gone, tape measures gone, completely recovery based. If im out with friends, there is always one who will take on the roll of asking what sounds good and knows my allergies as well, I also will communicate these with the wait staff and kitchen.",
      "created_utc": 1639224591.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ho44o8q",
      "author": "toddy791",
      "body": "Seems like seeing these labels, and seeing them everywhere, has you very distraught. They hold a lot of power over you.\n\nIf you have the opportunity, I'd say this is an issue to take to a therapist. A lot of them offer the first session for free, so you can see how you feel with them.\n\nI believe there is a way forward for you where you don't have to feel this way. I hope you find it.",
      "created_utc": 1639226142.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ho4lvgo",
      "author": "OverContest",
      "body": "A very long process of learning not to avoid, but to understand what calories are, people have different needs, and their benefits to certain society populations. A lot of therapy on self focus, rationalising, and to begin with, focusing on getting yourself to a healthier place, with or without calorie info, it's okay to do avoid to begin \n- but eventually become content with them.",
      "created_utc": 1639235395.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ho4mrxh",
      "author": "houston_veronica",
      "body": "I think that in time, you will be desensitized to this, because it will become so commonplace. It's still new right now, but like a lot of other negative visuals that can spike your ED thoughts, it's going to be something you will conquer. There isn't always a sunny resolution - ED's are such that we have to deal with 'triggers' for life, because we can't escape food, body image messages, other unhealthy people, and stress, which creates the need to cope.  \n\nIt helps to remember that everyone is on a different path. Someone in the world may struggle with their weight in the opposite direction, and for them, these calorie facts are something that help them stay on track. Or maybe not.  But try to keep your eyes physically and mentally on your own needs/plate requirements. EVERYONE is going to be at a different place, and they will talk about it - diets, healthy/unhealthy eating habits, etc.  The best thing you can do is confront this little by little and keep track of all the wins you're having. (\"win\" = eating the best way to defy your ED, and to stay strong. Even if you feel a little sad after, you still won. Keep up the great work, OP!!)",
      "created_utc": 1639235823.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ho3w5rj",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1639220144.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ho4dre8",
      "author": "Emotional-Plankton86",
      "body": "That sounds like such an amazing supportive environment <3",
      "created_utc": 1639231342.0,
      "score": 10,
      "context": [
        {
          "id": "ho42cj8",
          "author": "tryingtorecover54",
          "body": "So, therapy therapy therapy. I've had to start eating whole unpackaged foods. If I go out im not ordering my SO is (which is stressful as im celiac. But he's very good) and he removes all nutrition labels from foods he brings in the house, salads, anything. Food scales are gone, tape measures gone, completely recovery based. If im out with friends, there is always one who will take on the roll of asking what sounds good and knows my allergies as well, I also will communicate these with the wait staff and kitchen.",
          "created_utc": 1639224591.0
        }
      ]
    }
  ]
}