{
  "id": "rs85jy",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1640887965.0,
  "title": "Request: so bloated my skin hurts",
  "selftext": " \n\nWhen I first start eating more again I get bloated everywhere, so much so that my stomach sticks out in a way that makes me look like my best friend did at 4 months pregnant. I could deal with the appearance change, it’s easy enough to hide with loose clothes, but it’s really painful. My skin hurts to the touch like a bruise, and not just over my stomach but over my entire body. Like my whole body is one giant bruise. Does anyone else have any experience with this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/rs85jy/request_so_bloated_my_skin_hurts/",
  "score": 39,
  "num_comments": 11,
  "comments": [
    {
      "id": "hqm2pcv",
      "author": "None",
      "body": "i felt the same thing while i was at the hospital, what they told us was that we had to lay down face up for 1 or 2 hours after eating, try sleeping if you can. Something else they told us was to do these movements: put your hand on your lower right side of your stomach and go in circles from left to right, im bad at explaining i[ hope this image clears it up](https://images.app.goo.gl/Bu91yueigZPRbH9m6). Try drinking water at every meal but do it slowly and without drinking to much (we were given 2L a day, try something similar)\n\nMost important, keep going!! something really motivating that they told us was that eating better is like working out, the first weeks/months its painful and your muscles (stomach) get sore, but if you keep going, everyday it will get easier, like if you trained everyday, the muscles get used to the work out and what used to be painful isnt anymore :-) i hope this helped",
      "created_utc": 1640907454.0,
      "score": 17,
      "context": []
    },
    {
      "id": "hqlfkqk",
      "author": "rosieco",
      "body": "Hey! I don’t condone pills for EVERYTHING, but I have a pill for this that helps me! \n\nI have been pretty in control for the past few years but still get  dark times where I restrict, and coming back to normal eating habits physically hurts. My little secret is that I take Midol for it! I often have several of the issues Midol helps during these times-cramping/muscle aches, headaches, bloating, lack of energy. It’s like an ibuprofen+caffeine+anti-bloat-GENIUS! Midol is my miracle drug I use it all monthlong, it may be marketed as period relief but it does so much more! I sound like a total shill, but I always keep a few of these puppies in my purse just in case.\n\nGood luck out there!",
      "created_utc": 1640898173.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hqltwy4",
      "author": "Creepy-Algae9946",
      "body": "the bruise thing is 100% me too omg i’ve been telling everyone this and they don’t get it but FUCK its uncomfortable and hurts!! it makes eating more feel so wrong😣😣 just gotta push thru it tho, it wont last forever!",
      "created_utc": 1640903862.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hqmv8aw",
      "author": "Impressive-Panda-412",
      "body": "THIS!!!!! This is not talked about enough!!!!! During my refeeding stage I felt like my body was trying to jump out of my skin. I felt so tight and I was bloated to the point of my fingers not being able to close without struggle. Some things that really helped me deal was staying TF away from tight clothes and finding comfort in sweat pants or looser fitting jeans (which thank god loose clothes is trendy). To cope with the negative mentality and mindset I journaled and really focused on my body- it’s needs, it’s signaling, etc. and I’d take some walks or talk with my support system. Lastly to cope with physical pain I used “Phazyme”, “Tums”, and “Gas-ex”. Good luck!!!",
      "created_utc": 1640919957.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hqlmav7",
      "author": "admiral_asswank",
      "body": "CBD can act as an antispasmodic and antiinflammatory drug which greatly alleviates the pain from IBS-like symptoms. However, for a small minority of people it can cause diarrhoea for the first few doses.\n\nIt may also help with your (possible) anxiety -But regardless I would absolutely consult a physician before you rely on any recommendations from here.\n\nBest of luck friend",
      "created_utc": 1640900819.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hqmdukc",
      "author": "None",
      "body": "Hey friend. Very proud you’ve come this far! When I started eating again I ended up getting pancreatitis from the influx of food and fats. My stomach pain was unbearable all the time and still can be. I get bloated still but not as bad. I would try and take align in the morning and see if it helps. I guess it’s one of the best probiotics for gut issues that eating disorders can cause (I’m not a doc though). Maybe keep a food diary and track what makes it worse. Veggies can set me off very badly so I need to be careful when I eat them. \n\nTry getting a carb fat and protein in with each meal/ snack to help with digestion (I know this can be hard to do especially with a history of eating disorders).\n\nHow long have you been eating more? You are probably retaining a lot of water and your body is hanging onto your sodium for dear life (creating more water retention). Are your feet or legs swollen? Keep up the water intake and keep up your salt intake as well. Eventually your body will flush everything out when it realizes you aren’t restricting/ throwing up etc.\n\nYou could also try adding an electrolyte drink to your day. Some Gatorade can be full of sugar but I usually drink something called EAAs that you can get at most supplement stores. It is usually calorie free but just contains a lot of the essential amino acids we deplete out of our system during the day or when not eating the best.\n\nAs for the pain everywhere, ive had a few med professionals and non professionals chime in on this as I’ve dealt with this too. Eating disorders cause mass chaos in your body and it’s hard for the body to maintain homeostasis, be happy, and not be in a constant state of worry basically. It’s always stressed about when it’ll get food, how much, if we will throw it up etc. when we start in recovery it can cause a mass inflammation through your body as it’s trying to regain some “composure” and that homeostasis. I am a nurse so I do have some med background but I’m not an eating disorder expert at all. This makes sense to me as I was usually sore and tired during the peak of my ED but when I first started my recovery it got quite bad. Your body needs a lot of time to heal, our bodies our amazing but I think ED’s cause them to go into a constantly stressed state. \n\nSorry that was very long lol. I hope something I said helped. Again, huge huge congrats on coming so far ❤️",
      "created_utc": 1640912096.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hqmhdnh",
      "author": "YukiHase",
      "body": "I've been feeling this way lately too. Even right now. It's frequently on/off because when it gets bad it triggers me to restrict, only for it to come back worse. It hurts just like you described... I just want it to end.",
      "created_utc": 1640913650.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hqoug4g",
      "author": "pussyeater411",
      "body": "im so sorry",
      "created_utc": 1640964284.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hqkp84e",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1640887965.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqocbqd",
      "author": "punkstarlucy",
      "body": "The massage is really a life saver. I do it every time I over eat",
      "created_utc": 1640954756.0,
      "score": 3,
      "context": [
        {
          "id": "hqm2pcv",
          "author": "None",
          "body": "i felt the same thing while i was at the hospital, what they told us was that we had to lay down face up for 1 or 2 hours after eating, try sleeping if you can. Something else they told us was to do these movements: put your hand on your lower right side of your stomach and go in circles from left to right, im bad at explaining i[ hope this image clears it up](https://images.app.goo.gl/Bu91yueigZPRbH9m6). Try drinking water at every meal but do it slowly and without drinking to much (we were given 2L a day, try something similar)\n\nMost important, keep going!! something really motivating that they told us was that eating better is like working out, the first weeks/months its painful and your muscles (stomach) get sore, but if you keep going, everyday it will get easier, like if you trained everyday, the muscles get used to the work out and what used to be painful isnt anymore :-) i hope this helped",
          "created_utc": 1640907454.0
        }
      ]
    },
    {
      "id": "hqmjeky",
      "author": "YukiHase",
      "body": "I might try this. Do you get the ones specifically for bloat?",
      "created_utc": 1640914561.0,
      "score": 1,
      "context": [
        {
          "id": "hqlfkqk",
          "author": "rosieco",
          "body": "Hey! I don’t condone pills for EVERYTHING, but I have a pill for this that helps me! \n\nI have been pretty in control for the past few years but still get  dark times where I restrict, and coming back to normal eating habits physically hurts. My little secret is that I take Midol for it! I often have several of the issues Midol helps during these times-cramping/muscle aches, headaches, bloating, lack of energy. It’s like an ibuprofen+caffeine+anti-bloat-GENIUS! Midol is my miracle drug I use it all monthlong, it may be marketed as period relief but it does so much more! I sound like a total shill, but I always keep a few of these puppies in my purse just in case.\n\nGood luck out there!",
          "created_utc": 1640898173.0
        }
      ]
    }
  ]
}