{
  "id": "rs8ep7",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1640888620.0,
  "title": "Request: being triggered by partner",
  "selftext": " i have a new partner. she's great and everything but she's much smaller than me (5'1'' to my 5'9''). She has a small appetite to begin with but she recently started taking meds for her ADHD. The pills are causing her to have an even smaller appetite. Like yesterday, she didn't until dinner and her dinner was small. she's triggering the fuck out of me. she picked up that she was triggering me and pressured me to get into the details of what, exactly, is triggering (and to me it's like.. obvious, but whatever). i didn't want to get into it with her because: 1) it feels unfair to her to demand she eat more, more often 2) i'm worried that even if i tell her what's triggering she won't make the changes. or she would try to make changes but it won't last and then i will get resentful because it's something we've talked openly about. 3) i'm embarrassed by the whole thing i guess i don't know what i'm asking here. i just needed to get that off my chest and also see if anyone else has a similar experience.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/rs8ep7/request_being_triggered_by_partner/",
  "score": 53,
  "num_comments": 10,
  "comments": [
    {
      "id": "hql8o7p",
      "author": "annekevictoria",
      "body": "I definitely understand… my partner also eats one meal a day (though it is pretty large) and often fasts. It has helped me to be totally honest with him about my experience with EDs and how it triggers me. He does not change his behavior because eating is obviously a personal choice, but we openly talk about it when I feel triggered and he reassures me that there is nothing wrong with the way I eat. \n\nI would advise being totally honest about this, if not it will absolutely cause resentment if you don’t openly share how you feel with her. If your relationship with her is something you hope to be long-term, this is not worth hiding or feeling embarrassed about. Also, don’t expect her to change how she eats. You will need to accept and support both of your differences to create a joyful relationship. Honesty is key. Blessings!",
      "created_utc": 1640895454.0,
      "score": 22,
      "context": []
    },
    {
      "id": "hqlhaip",
      "author": "None",
      "body": "After my 6 year long relationship ended last year, I dated a guy for a couple months who would forget to eat all day and basically had to struggle to keep the lbs on. It wasn’t the only reason I broke it off but there’s no way I could have been in a relationship like that long term. It was too triggering for me. Obviously I didn’t have a big stake in that relationship yet because it was so new, so I’m not advising you to break up with your partner, but I definitely recommend having a conversation with her about your feelings. Sometimes that’s all that’s needed. You can preface it by telling her you know there’s nothing she can do about it but that it’s triggering for you and you just wanted to get that off your chest. You can’t expect her or ask her to eat more—that’s you projecting onto her. But you can let her know you’re feeling concerned but that you don’t want to be controlling. It’s a nuanced situation and I think the answer is just communication rather than taking any specific action. Just be honest and express yourself!",
      "created_utc": 1640898849.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hqoua6x",
      "author": "Daddy_urp",
      "body": "This is a hard situation. I don’t mean to sound harsh but you definitely can’t ask her to eat more to avoid triggering you. What she puts into her body is her choice. In my eyes there are two choices. Choice number one is communication. You can communicate that her decisions are triggering for you and can mutually decide to take mealtime separately. That way you don’t see how much or little she consumes and can focus on your eating, not hers. You can also be open in the moment when she’s triggering you so you can talk it though and she can hopefully make you feel better. Obviously you can’t say “you’re triggering me” every meal time but every once in a while when you’re feeling really bad you can say “hey ___, I’m having a hard time with food and my body at the moment. Can I have some reassurances?” (I don’t know specifically how you ask for reassurances in your relationship this is just how I do it in mine.” \n\nSecond is parting ways. Something like this is a big deal, the way she fuels her body is harming your mental health. Neither of you can really change that, just avoid it for a time. If you harp on her about it then she will feel villainized for her eating patterns which she doesn’t deserve. It seems like she might have issues with food as well which is a whole other issue if that’s true. If you keep this all to yourself your resentment will grow until you explode. I don’t see this relationship lasting particularly long with an issue like this. I’m sorry if it sounds harsh, it’s just a strangers opinion online so don’t take it too much to heart.",
      "created_utc": 1640964211.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hqm4a66",
      "author": "None",
      "body": "It seems that she’s having a hard time, maybe just be supportive instead of making this about you? Or if you want to express yourself, do it clearly and a have a chat with her, but keep in mind that the priority is her, her needs, her mental health, not your feelings",
      "created_utc": 1640908110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqkqyif",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1640888622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqnmf45",
      "author": "houston_veronica",
      "body": "There is nothing weird about your feelings, OP. They are so normal when it comes to having an ED; no one really understands these things unless they've dealt firsthand with one.\nI would recommend reframing your thinking as much as possible; remember how different you both are in size/shape. Even if you both were the same size, her needs would be different from yours depending on factors that I can't begin to list because they all vary. \nIf you aren't already, can you check into seeing an RD to help you ensure you are eating enough? maybe hearing from a professional would help solidify your own need to feel ok about eating what is right for you. \nYour own recovery comes first; that is before any other relationship, since life (your own ability to live/thrive) is essential to be in relationships. If she does not understand, there are many resources that help support those in relationships with others who live with EDs. Youtube has a ton of videos, along with NEDA (www.nationaleatingdisorders.org) to help people understand the most common issues surrounding EDs.\nHang in there, don't stop fighting.",
      "created_utc": 1640934806.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hr8xkyh",
      "author": "Misc_Item_67",
      "body": "Coming at this as someone with ADHD (and a mostly-recovered ED) myself - \n\nAs someone with ADHD, I find myself often asking questions or making comments that are too invasive/personal without  knowing it or just without thinking first. — This is your partner and I imagine you know this about them. \n\nGenerally speaking, people with ADHD also don’t mind or sometimes simply prefer blunt responses - or responses that are to the straight to the point. I wouldn’t worry too much about the direct communication from their end.\n\nMy advice is open communication, if and/or when you are ready for it. Talk about is triggering you and you can both talk about ways to go around it. Maybe even write down a few points that you want to raise so that it’s all covered. \n**(Sorry if the last point is irrelevant, I can’t remember anything if I don’t write it down)\n\nThe communication can also go both ways - from experience it took me 1-2 years to stabilise my eating routine when I started my ADHD meds - so know that your partner is also currently on their own food-related journey. Maybe you can find ways to both support each other. \n\nMy best wishes to you both",
      "created_utc": 1641322843.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqpa3bw",
      "author": "None",
      "body": "I second this. OP, you absolutely cannot ask her to change her eating habits. You cannot change her or her eating habits and it isn't fair to expect her to just to avoid triggering you. So your only other options are eating separately, communicating how you feel *without guilting her for her eating habits*.",
      "created_utc": 1640970842.0,
      "score": 4,
      "context": [
        {
          "id": "hqoua6x",
          "author": "Daddy_urp",
          "body": "This is a hard situation. I don’t mean to sound harsh but you definitely can’t ask her to eat more to avoid triggering you. What she puts into her body is her choice. In my eyes there are two choices. Choice number one is communication. You can communicate that her decisions are triggering for you and can mutually decide to take mealtime separately. That way you don’t see how much or little she consumes and can focus on your eating, not hers. You can also be open in the moment when she’s triggering you so you can talk it though and she can hopefully make you feel better. Obviously you can’t say “you’re triggering me” every meal time but every once in a while when you’re feeling really bad you can say “hey ___, I’m having a hard time with food and my body at the moment. Can I have some reassurances?” (I don’t know specifically how you ask for reassurances in your relationship this is just how I do it in mine.” \n\nSecond is parting ways. Something like this is a big deal, the way she fuels her body is harming your mental health. Neither of you can really change that, just avoid it for a time. If you harp on her about it then she will feel villainized for her eating patterns which she doesn’t deserve. It seems like she might have issues with food as well which is a whole other issue if that’s true. If you keep this all to yourself your resentment will grow until you explode. I don’t see this relationship lasting particularly long with an issue like this. I’m sorry if it sounds harsh, it’s just a strangers opinion online so don’t take it too much to heart.",
          "created_utc": 1640964211.0
        }
      ]
    },
    {
      "id": "hr11305",
      "author": "Witchy_w0man_",
      "body": "I don’t understand how the priority is OP’s SO’s feelings and mental health and not both? Can’t we hold room for the mental health of both parties in a partnership? That is the whole point right? OP is coming to an appropriate place to vent their feelings and ask for advice, they are not acting selfishly here. They are acknowledging and communicating their triggers rather than turning to behaviors and that’s awesome.",
      "created_utc": 1641181369.0,
      "score": 4,
      "context": [
        {
          "id": "hqm4a66",
          "author": "None",
          "body": "It seems that she’s having a hard time, maybe just be supportive instead of making this about you? Or if you want to express yourself, do it clearly and a have a chat with her, but keep in mind that the priority is her, her needs, her mental health, not your feelings",
          "created_utc": 1640908110.0
        }
      ]
    },
    {
      "id": "hqmgh85",
      "author": "lara_m_c",
      "body": "I get that your intent here was to say that there might be something going on for OP's partner too, but your phrasing is kinda unnecessarily harsh. OP and their partner's health and feelings both matter here! And OP talking about their own feelings and mental health doesn't mean that they're making it about themself or disregarding their partner.",
      "created_utc": 1640913249.0,
      "score": 9,
      "context": [
        {
          "id": "hqm4a66",
          "author": "None",
          "body": "It seems that she’s having a hard time, maybe just be supportive instead of making this about you? Or if you want to express yourself, do it clearly and a have a chat with her, but keep in mind that the priority is her, her needs, her mental health, not your feelings",
          "created_utc": 1640908110.0
        }
      ]
    }
  ]
}