{
  "id": "rw894m",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1641339883.0,
  "title": "Request: Fiancé body shaming me",
  "selftext": " \n\nWe recently started living together everyday he says  things about my body or weight but last night NYE I was getting dressed  really nice and he wouldn’t leave me alone and called my lower stomach  disgusting and it has to go and grabbing on bits of fat skin. I’m not  sure how to feel I just took everything off and tried to avoid him no  Happy New Years. He did apologizes and weirdly stick around last night I  just wanted him to go on with his plans. Im not sure how to discuss how  this makes me feel to him or just loose the weight and go back to my  old eating pattern. I’d already been in the hospital for not eating and  when I got out he would order me food everyday without me asking he  actually did that recently I just don’t know what to do anymore. He also  won’t let me get a body mirror in the house so idek how I really look.  Sorry to vent like this you’re welcome to cut out whatever you want",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/rw894m/request_fiancé_body_shaming_me/",
  "score": 76,
  "num_comments": 34,
  "comments": [
    {
      "id": "hra6454",
      "author": "None",
      "body": "Dump him immediately. Any decent person would never ever bully their significant other about their appearance. The fact that he’s doing it when he fully knows your history of disordered eating is a million times worse. He’s mean, he’s a bully, and he’s most likely trying to put you down for his own gain. Sometimes people do this to make you feel like you’re unworthy and no one else will ever love you to make you feel like you’re “stuck” with them. It’s disgusting and you need to leave him and block his number. I’m so sorry you’ve had to deal with him.",
      "created_utc": 1641340083.0,
      "score": 153,
      "context": []
    },
    {
      "id": "hra625h",
      "author": "gumrocks",
      "body": "This is so toxic.",
      "created_utc": 1641340061.0,
      "score": 52,
      "context": []
    },
    {
      "id": "hraa0fx",
      "author": "so_very_trans",
      "body": "Hi there! You need to leave this man, love! You will see it more clearly when you look back on it years in the future. This behavior isn’t ok and is exactly the kind of person you need to purge from your life. It’s ok to feel unsure about it now, but this is certainly not the way others can treat you.",
      "created_utc": 1641341680.0,
      "score": 35,
      "context": []
    },
    {
      "id": "hra71ej",
      "author": "iforgotmyedaccount",
      "body": "It doesn’t matter if he apologized. No partner should ever, ever grab your stomach and call it disgusting. What an asshole. You deserve better than an asshole. Better that you find out now than when you’ve wasted more time on him.",
      "created_utc": 1641340457.0,
      "score": 37,
      "context": []
    },
    {
      "id": "hrakp2d",
      "author": "ThestralBreeder",
      "body": "He is sending very strange messages.... supporting refeeding, yet not consulting you. Supporting you not bodychecking in a mirror...and yet saying horrifying things about your body!!! You should absolutely get counseling and consider if this is the kind of partner you need.",
      "created_utc": 1641346099.0,
      "score": 21,
      "context": []
    },
    {
      "id": "hrarlma",
      "author": "Cheekygirl97",
      "body": "That’s abusive behaviour, you need someone who will make you feel desired 100% of the time, someone who won’t talk about your weight PERIOD. You deserve to feel beautiful, I don’t need to see you to know you are. Please dump him, I promise you you’re going to be ok if you dump him",
      "created_utc": 1641349004.0,
      "score": 17,
      "context": []
    },
    {
      "id": "hratmp4",
      "author": "None",
      "body": "He sounds like he is emotionally abusive. Please don’t marry him. If he is like this now, imagine how much worse once you are married.",
      "created_utc": 1641349837.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hrau3wj",
      "author": "CeLaVieluv",
      "body": "Ew. Get rid of him. What an asshole. Hopefully karma will get him back by taking his hairline",
      "created_utc": 1641350040.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hrb26ai",
      "author": "crycry_chemtrails",
      "body": "This is just abusive. You deserve better than this.",
      "created_utc": 1641353555.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hrbb56r",
      "author": "AdBorn6074",
      "body": "Please bestie, this behavior will likely never change. You don't want to live with that judgement and thinking about your every move with that person. Leave him",
      "created_utc": 1641357786.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hrbh6tt",
      "author": "blueberries-Any-kind",
      "body": "About 6 years ago I posted on reddit about my boyfriend who was making me feel bad. Everyone told me to dump him. I got super mad at them all for suggesting that and got engaged to him shortly after. I had the wedding out of a fairytale and was divorced 2 years later! \n\nThis is absolutely abuse and you are following a path of destruction unless you leave or get major couple intervention quickly that he is committed to. Get help IMMEDIATELY or get out!!!!",
      "created_utc": 1641360960.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hraygru",
      "author": "tymopa",
      "body": "I am so sorry you have had to deal with this. I can't agree more with everyone. He doesn't deserve you. He is abusing you. This makes me so sad.",
      "created_utc": 1641351910.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hrbrhuv",
      "author": "Jaded_Collection_716",
      "body": "This is abuse. Men like this do not change. Dont waste time on him. Tell ppl close to u about this and get help leaving him, hugs,",
      "created_utc": 1641367389.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hrbj32u",
      "author": "S2yydrj",
      "body": "Wtf, this man has to go. Thats disgusting and abusive behavior. You deserve a hell of a lot better than that",
      "created_utc": 1641362028.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hrctsa9",
      "author": "cat-wool",
      "body": "What everyone else said about him being toxic. But also it seems like he thinks ordering you food and having you eat it & not letting you see yourself in a full length mirror mean your ED is gone. Which shows a massive lack of understanding of an ED that can imo, only come from willful ignorance. Your body and looking at it and having feelings about it isn’t the enemy of recovery, and making that taboo/not “allowed” in a home that is yours too…sounds like a terrible combo along with criticizing your body bc HE is allowed to?? Nahhh son.\n\nLike never even mind that he’s taking control of what you eat away from you, like how could he/anyone be so unaware of the most basic ED tenant—it’s about control lol wtf he sounds…not great unless he’s genuinely just stupid.",
      "created_utc": 1641392407.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hrd91ah",
      "author": "_UsernamesRhard_",
      "body": "I know it’s hard to hear but you should strongly consider ending things. My ex did this EXACT thing to me years ago and I wish I would’ve noticed the red flag then. Looking in the mirror together she literally grabbed my stomach and said the same Exact thing I stg. She had this nasty annoyed look on her face too when she did it. Now years later even though I’ve been hitting the gym a lot I have such body dysmorphia from all the other things she criticized about my appearance. Don’t let it fester, cut it off now.\n\nI believe the fact you’ve come here to post about is also a sign you’re already heading in the direction of ending things which is good.",
      "created_utc": 1641398628.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hrbna34",
      "author": "mrwilliamschue",
      "body": "He knew exactly what he was doing and could potentially be trying to get you to relapse. Also you should be able to get a body mirror and make your own decisions. You deserve better— he sounds like an abusive asshole",
      "created_utc": 1641364578.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hrbxvtu",
      "author": "None",
      "body": "Throw the whole man out",
      "created_utc": 1641372074.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hrd97be",
      "author": "Few_Ad_246",
      "body": "As someone who has a partner with ED Type 2 I can say I would NEVER do this to her. His actions are disgusting, inexcusable, and flat out wrong. You can't begin recovery let alone live in a state of recovery with someone who treats you like that. People tend to ridicule what they don't understand, even if they say they understand. He doesn't care about you the way he says he does if he does things like this to you. You have to get away from anything that is a threat to your well-being. It may hurt, but it is the right thing to do.",
      "created_utc": 1641398692.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hrc0igy",
      "author": "ECG88",
      "body": "This is abuse and unfortunately it's only going to decline from here. As someone who has been through this, please leave this awful human being",
      "created_utc": 1641374052.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hrcksfy",
      "author": "Lopsided-College9290",
      "body": "I'm so sorry this has happened to you. And I 100% agree with the comments, leave him. Not only is he emotionally abusive he's also confused about how to treat u and is giving contradictory messages that cannot be good for you mental health.",
      "created_utc": 1641387984.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hrcm0hu",
      "author": "imlost_n_ilikeithere",
      "body": "There’s nothing to discuss with him. You need to leave this creep immediately without excuses. Take your shit and go. You don’t need to “break up” or explain anything to that jerk.",
      "created_utc": 1641388637.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hreiq1j",
      "author": "DoktorVinter",
      "body": "Hello, leave him. He's emotionally abusing you, tbh. This is NOT okay. Do not put up with this. LEAVE LEAVE LEAVE.",
      "created_utc": 1641415903.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hretvhm",
      "author": "None",
      "body": "Literally leave this man, don’t marry him if he’s going to fat shame you. If he’s like this know he’ll probably continue it or it’ll get worse. You deserve someone better.",
      "created_utc": 1641420483.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hra5md3",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1641339884.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hrgz2o8",
      "author": "Paprikakidneybeans4",
      "body": "Please leave him. As soon as possible",
      "created_utc": 1641460977.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hrtahg1",
      "author": "SUZQ154",
      "body": "So sorry you are going through this.  I understand!  My ex-husband used to make fun of me and I would laugh along with others about myself!  I didn't know what else to do!  Then I finally understood he was  being abusive!  \n\nA book which helped me to change my own destructive behaviors and get out of the relationship was \"Emotionally Destructive Relationship\".  [https://bit.ly/3hu8jjJ](https://bit.ly/3hu8jjJ)  You might want to check it out!  It gives strategies to get out of the relationship and build new ones, focusing on faith and positive self-image.  Hope this will help you as much as it helped me.",
      "created_utc": 1641669849.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hs0fm9y",
      "author": "Outliar111",
      "body": "This breaks my heart so much. My BF is very supportive of my ED recovery. Iv gained a significant amount of weight back during recovery and he supports me adjusting to my new way of life and encourages me. You can do better than him. Find someone who will be your support in a healthy way. I’m rooting for you. I hope you can find peace in your recovery and also not tolerate that sort of abuse.",
      "created_utc": 1641784967.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hsm9tpl",
      "author": "fullglass0_0",
      "body": "Emotional abuse. Remove him from your life- it'll be hard but you should never settle for someone that puts you down like that.",
      "created_utc": 1642161644.0,
      "score": 1,
      "context": []
    },
    {
      "id": "htplhjv",
      "author": "IntegrityPerspective",
      "body": "This man is manipulative and abusive. Leave him for your well-being and mental/emotional safety.",
      "created_utc": 1642832124.0,
      "score": 1,
      "context": []
    },
    {
      "id": "httiyd7",
      "author": "None",
      "body": "That is messed up. That would get under anybody's skin regardless of whether they have ED or not. Since you struggle with ED you need to leave.",
      "created_utc": 1642900878.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hu699eh",
      "author": "None",
      "body": "Sorry for what you're going through.  It's a red flag 🚩 for your mental health dump him.same with me , but with my family, especially my mother and sister, they destroy my self-confidence every day to the point that I wish I could die and not live with them.",
      "created_utc": 1643129862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hv2tmge",
      "author": "DollarStore-Cheese",
      "body": "Anyone who bodyshames you should be kicked to the curb. People who love you shouldn't give a crud about your body as long as you're recovering. I'm sorry he's like this, but it's not worth it if it can end up in a relapse",
      "created_utc": 1643681313.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hre6300",
      "author": "ElementalYosh",
      "body": "Yeah, it sounds like controlling behavior. The back and forth, “helping” her by ordering food she doesn’t ask for and then immediately putting her down the second he looks at her? Just a lot of bad vibes here.\n\nOP, you don’t need to take this abuse. No partner should ever say such negative things about your body.",
      "created_utc": 1641410726.0,
      "score": 4,
      "context": [
        {
          "id": "hrakp2d",
          "author": "ThestralBreeder",
          "body": "He is sending very strange messages.... supporting refeeding, yet not consulting you. Supporting you not bodychecking in a mirror...and yet saying horrifying things about your body!!! You should absolutely get counseling and consider if this is the kind of partner you need.",
          "created_utc": 1641346099.0
        }
      ]
    }
  ]
}