{
  "id": "rzpbxk",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1641726160.0,
  "title": "Request: How can I lose weight after recovering from anorexia?",
  "selftext": "How can I lose weight after recovering from anorexia? When I was 16 I started counting calories and walking excessively. Eventually I lost xx  pounds and was hospitalized for anorexia nervosa and atheltica. I’m at a healthy weight now, but my problem is that I continue to gain weight. I’m in the process of joining the army and I’m not far from my upper weight limit for my height. No matter how hard I try to not eat everything in sight, my extreme hunger continues to make me eat thousands of calories a day. I know I’m eating enough because when I am able to stick to it, my weight remains the same on the scale, but eventually I binge and my weight has slowly been going up. I’m concerned that by the time I leave for bootcamp I’ll be too heavy.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/rzpbxk/request_how_can_i_lose_weight_after_recovering/",
  "score": 67,
  "num_comments": 21,
  "comments": [
    {
      "id": "hrwggks",
      "author": "None",
      "body": "This is a question for a professional dietitian",
      "created_utc": 1641726338.0,
      "score": 80,
      "context": []
    },
    {
      "id": "hrwh3wc",
      "author": "None",
      "body": "This is a professional case, though imo focus on intuitive eating (responding to actual hunger cues and eating till satiated) + regular physical activity = your body naturally should become lean overtime\nAlso seems like youre very young - if thats the case, its normal for weight to be fluctuating a lot.",
      "created_utc": 1641726846.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hrya7q5",
      "author": "None",
      "body": "Although I understand your issue, I think if you struggle to stop eating, you really should NOT stop eating! During my recovery I had a whole period where I would just... eat. It was awful. But my body needed it. You have so many calories to make up for, of course your body needs those nutrients!! \n\nBest of luck with the army, and with recovery, I know its tough. I'd suggest you talk to a professional dietitian about this. Maybe you even have one you know from your ED treatment?",
      "created_utc": 1641755957.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hrzhz9d",
      "author": "devsalebmarak",
      "body": "As others have written, you would probably benefit from seeking advice from a registered dietician, particularly because you're in recovery from an ED and don't want to jeopardize your progress. But you also might want to seek out nutritionally dense foods that can satisfy hunger cravings without adding too many calories. For example, steamed vegetables, legumes, fish, pasta alternatives like hearts of palm pasta, oatmeal, really fortified smoothies (I make one with coconut water, banana, spinach, yogurt and almond milk that is really filling and very healthy), etc. Good luck!",
      "created_utc": 1641771666.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hrwg87o",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1641726160.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hs08hbf",
      "author": "None",
      "body": "Maybe try talking to a therapist, a doctor and get on a program that will be healthy and designed for you so you're in the constraints that are designed for u",
      "created_utc": 1641782053.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hs000ly",
      "author": "WoodsofNYC",
      "body": "I echo what other people have said: please, please, please go to a nutritionist. Also get the advice of your doctor. Consider therapy if you are not in therapy already. I am going to sound very old when I say this but I’m a little concerned about your plans to go into a physically taxing situation when you may not be medically stable. I don’t know if you are or you aren’t. I’m not a doctor and I can’t diagnose you. Your hunger may be a part of your eating disorder but it also may be a medical issue. Take care of yourself.",
      "created_utc": 1641778648.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hrxsnow",
      "author": "whatsgonnahappentous",
      "body": "A dietitian or even a therapist might be able to help, you can remind yourself to eat when ur hungry and to stop when ur full, practice intuitive eating, even if youre eating junk food also eat healthy foods with it that is filling, you can make a big salad of everything you like to put in there, thats what i personally used to do, it helped for a while, or i eat oatmeal with milk coacoa and fruit, try to eat less or cut out sugar as it makes you cravings worse, i think snacking is what mostly makes u gain wait in between meals, try to eat healthier snacks like hummus and carrots or cucumbers or lettuce or sugar free healthy cookies, or some mixed nuts, drink tea and lots of water, another thing thAt is important is getting enough sleep and eating ur meals at the same time everyday (have a routine) for example ur breakfast at 7, lunch at 12 everyday….i hope this will help and you will get better, i know how frustrating it can be as i am also dealing with this",
      "created_utc": 1641749712.0,
      "score": 0,
      "context": []
    },
    {
      "id": "hryg3re",
      "author": "firmdietcokebeliever",
      "body": "I would highly recommend you seek out a professional for this!! \n\nHowever I would suggest meal prepping. I have a binge eating disorder and it's the only way I can stay on track. Unfortunately with anorexia meal prepping might lead you down a dangerous path back into calorie counting, I know those urges are hard to ignore but you've done so great already 👍  either way I wish you luck on your journey!! \n\nP.s. Putting on weight isn't necessarily a bad thing!! It might be muscle forming, try not to focus heavily on the scale instead focus on what's going into your body.",
      "created_utc": 1641758046.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hs0d68u",
      "author": "TallInspection2088",
      "body": "Just want to know, are you eating nourishing foods? Restricting can put one in a bad place. Perhaps your body will feel more satisfied if you give it good nourishment. Good luck!",
      "created_utc": 1641783947.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hs1qh7s",
      "author": "Mahmoudobaid",
      "body": "You should consult a specialist",
      "created_utc": 1641811799.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hs9ny48",
      "author": "cjx888x",
      "body": "Side note: Joining the army might potentially be helpful as well (not as a substitute for continued professional help.) Bootcamp is very structured environment which some people find helpful for ED/addiction/etc. It takes a way a lot of the ‘what ifs’ and personal control in your day which makes it harder to engage in those behaviors, which is useful for breaking the cycle of habit. It also helps nurture awareness of food as fuel, which can be very healing.",
      "created_utc": 1641939440.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hsbbhxn",
      "author": "None",
      "body": "hey. i myself was in this exact same situation. if you’re within 10lbs of the weight limit you’re fine. you eventually shed it off the first two weeks of training. they say this to kind of get you on your feet and stay active so it’s not a slap in the face when you arrive. for now all i can tell you is to drink lots and lots of water like tons. Eat 3 times a day do some walking for about an hour and sleep really well. hope this helps.",
      "created_utc": 1641965712.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hu6n699",
      "author": "None",
      "body": "i’m in a similar situation!! recovered from anorexia a little while ago and since i’m big into weightlifting now, i’m currently cutting a bit of weight for physique building purposes. \ni hired a NASM certified dietitian and trainer who made me a meal plan and workout plan. so far it’s really working out for me and i highly recommend that!",
      "created_utc": 1643134968.0,
      "score": 1,
      "context": []
    },
    {
      "id": "husqnq3",
      "author": "m3a_",
      "body": "This might not work for everyone but say to yourself that your only going to eat at mealtimes and have a productive day because when I’m doing things it’s easier to distract myself from the thought of food. Hope this helps",
      "created_utc": 1643508230.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hrws02o",
      "author": "FrustratedPenguins",
      "body": "I second this. I would seek out a registered dietitian (not a “nutritionist “, as that is a meaningless label anyone can use). Ideally, find a registered dietitian that specializes in clients with eating disorders.",
      "created_utc": 1641734083.0,
      "score": 29,
      "context": [
        {
          "id": "hrwggks",
          "author": "None",
          "body": "This is a question for a professional dietitian",
          "created_utc": 1641726338.0
        }
      ]
    },
    {
      "id": "hs65q7j",
      "author": "One_Paleontologist65",
      "body": "Agreed, and I would probably add a therapist specializing in eating disorders on top of it. Already framing it as losing weight can be slippery slope, and having a therapist at the ready to monitor thoughts and actions in conjunction with a dietician seems like a pretty safe bet.",
      "created_utc": 1641878413.0,
      "score": 2,
      "context": [
        {
          "id": "hrwggks",
          "author": "None",
          "body": "This is a question for a professional dietitian",
          "created_utc": 1641726338.0
        }
      ]
    },
    {
      "id": "hrz9tdc",
      "author": "quinoabrogle",
      "body": "The problem with intuitive eating when ED starts so young is hunger cues just aren't consistent or accurate :/",
      "created_utc": 1641768618.0,
      "score": 7,
      "context": [
        {
          "id": "hrwh3wc",
          "author": "None",
          "body": "This is a professional case, though imo focus on intuitive eating (responding to actual hunger cues and eating till satiated) + regular physical activity = your body naturally should become lean overtime\nAlso seems like youre very young - if thats the case, its normal for weight to be fluctuating a lot.",
          "created_utc": 1641726846.0
        }
      ]
    },
    {
      "id": "hryzdmj",
      "author": "LankyDrgnLAd775",
      "body": "I third this. Dietitian's can help you build a proper diet based on your body's needs and your metabolism.",
      "created_utc": 1641764859.0,
      "score": 7,
      "context": [
        {
          "id": "hrwggks",
          "author": "None",
          "body": "This is a question for a professional dietitian",
          "created_utc": 1641726338.0
        },
        {
          "id": "hrws02o",
          "author": "FrustratedPenguins",
          "body": "I second this. I would seek out a registered dietitian (not a “nutritionist “, as that is a meaningless label anyone can use). Ideally, find a registered dietitian that specializes in clients with eating disorders.",
          "created_utc": 1641734083.0
        }
      ]
    },
    {
      "id": "hrza1lf",
      "author": "None",
      "body": "I know :( Its a general issue with disordered eating patterns unfortunately and it takes a lot of time and hard work …",
      "created_utc": 1641768702.0,
      "score": 5,
      "context": [
        {
          "id": "hrwh3wc",
          "author": "None",
          "body": "This is a professional case, though imo focus on intuitive eating (responding to actual hunger cues and eating till satiated) + regular physical activity = your body naturally should become lean overtime\nAlso seems like youre very young - if thats the case, its normal for weight to be fluctuating a lot.",
          "created_utc": 1641726846.0
        },
        {
          "id": "hrz9tdc",
          "author": "quinoabrogle",
          "body": "The problem with intuitive eating when ED starts so young is hunger cues just aren't consistent or accurate :/",
          "created_utc": 1641768618.0
        }
      ]
    }
  ]
}