{
  "id": "s2701r",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1641996247.0,
  "title": "Request: my girlfriend is recovering from an eating disorder and I’m kind of scared",
  "selftext": " \n\nSo I recently started dating this girl who confessed to me that she used to have an eating disorder, that she would count the calories of every single thing she ate and even induced herself to vomit. I felt horrible when she confessed this to me and I tried to be as understanding as possible, and it seems I’ve done a good job, but I’m still not sure. She has expressed concerns about her looks, she has told me she is fat when she really isn’t, perhaps not skinny, but not fat at all. Also saying she has no boobs, things like that. I have told her many, many times that her body is beautiful in every way and that I think she is perfect no matter what she looks like. She has seemed to make a lot of progress, especially because she hasn’t made those kind of comments in a while. Still, I am scared to talk with her about topics like diets, calories, anything that could make her start thinking about those things again.\n\nI guess my question is: what are the things I absolutely should NOT do/say to her, and what should I do/say to her?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/s2701r/request_my_girlfriend_is_recovering_from_an/",
  "score": 50,
  "num_comments": 34,
  "comments": [
    {
      "id": "hsdbzea",
      "author": "iforgotmyedaccount",
      "body": "Don’t bring up weight, calories, etc. Let her guide you in what she’s comfortable with. Definitely don’t tell her that thing you wrote about her not being skinny. Just tell her she’s beautiful without making it about her weight. Easy.",
      "created_utc": 1642007349.0,
      "score": 27,
      "context": []
    },
    {
      "id": "hsczqkc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1642002698.0,
      "score": 32,
      "context": []
    },
    {
      "id": "hsdf8ij",
      "author": "LucyBlue16",
      "body": "For me, not talking about the elephant in the corner is giving that elephant more importance than needed. I don’t see why you can’t ask her what she’s comfortable talking about and what she’s rather not discuss. But I think it’s important to be able to talk about food and eating and body image because these are part of the human experience and shouldn’t be taboo. Of course find things other than her appearance to comment on and compliment her on. But please ask her what she needs from you and your relationship.",
      "created_utc": 1642008559.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hsef1c7",
      "author": "cjx888x",
      "body": "One thing I think people misunderstand is the idea that it is helpful to tell people with ED that they look good/not fat/etc etc. or to try to convince them to change their mind on their opinion of their own body. One of the healthiest things you can do for someone with ED is stop talking about bodies at all. Even yours, or other peoples. Even good things. Body talk- both good and bad- has become such a constant part of our culture and it plays a big role in ED. When you comment on anyones body in any way, it reflects the notion that body appearances matter to you. People with ED hear that, and it has an impact on them.\n\nSo start teaching yourself to stop that. Grab a journal and jot down ways to compliment or talk about your gf, yourself, and others, in ways that have nothing to do with bodies. Think about those things, and practice it. This stuff will go a long way to helping your gf feel safe around you, and it’s something that is helpful to everyone around you. Think of things people had control over- commenting on peoples body is making a judgement call on something they had no choice in. \n\nExample: ‘that dress makes you look fierce!’ \n                ‘I dig your new piercing!\n                ‘she looks stylish as hell.’ \n‘Did you see that dudes haircut? I would never!’",
      "created_utc": 1642021912.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hsebmxx",
      "author": "unkreativername0",
      "body": ">when she really isn’t, **perhaps not skinny**, but not fat at all.\n\nDefinitely don't say this to her lmao.",
      "created_utc": 1642020678.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hsectml",
      "author": "unkreativername0",
      "body": "I would suggest:\n\n* Keep on making honest compliments, but don't overdo it.\n* Also, focus on compliments that aren't only about her looks/body.\n* Avoid talking to her about  diets, calories etc.\n* Focus on non-food-centered activities.\n* Just ask her what would be helpful.\n\nWishing you two the best!",
      "created_utc": 1642021109.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hssa2rn",
      "author": "PastelSprite",
      "body": "NEDA has a good resource for this. I think it may actually be in the “parent toolkit”(looks like page 12 of the pdf).\n\n&nbsp;\n\nFrom my perspective as someone with an ED: don’t talk about dieting, calories, weight, other people’s bodies, etc. My ED is triggered by numbers and high stress, especially together. I relapsed when I experienced 2 back to back deaths in the middle of a stressful semester at college, and then my bf bought a scale after I’d requested he not(it took me 15-16 years to let go of my scale- I happily smashed it and had a few years of health lol). I knew I couldn’t have it in the house especially during a relapse. I think I may have gotten out of it easier had I not known my weight. I saw how much I’d lost out of depression, and became obsessed with seeing how far it could drop. \n\n&nbsp;\n\nI feel very uncomfortable when he and others talk about dieting, weight loss, or even do exactly what I do and criticize their bodies. \nI agree to not tell her she’s “not skinny but not fat”. My bf said something like that to me when I was underweight(I am very short so I guess I didn’t look as thin as I was, but still). He unknowingly did and said a lot of things that ended up sticking with me.\n\n&nbsp;\n\nWhen you compliment your gf(and others even), it might also be good to compliment her on non-weight aspects of herself. If she says she looks fat “I don’t think so” should be sufficient. Of course, it may be best to ask her the question you posted here.\n\n&nbsp;\n\nIn the end, even if you said she looked skinny it wouldn’t be helpful. When my bf did say I looked very thin, I found it motivating, or my mind would twist things to think he was lying. When I clearly wasn’t thin and he’d say that, I started suspecting that he was just lying. At some points I thought I looked awful; my butt went concave at my LW and I complained about it and he said it looked fine. That made me think maybe I was delusional and looked healthy but thought I looked thinner. He later said he was worried but didn’t know what to say. I can imagine that position must be very difficult. \n\n&nbsp;\n\nI don’t blame him in any of those incidents, the situation is complex. It was a mess. I try not to complain about my body as much right now, but of course it’s very hard not to.",
      "created_utc": 1642266147.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hsexs3v",
      "author": "mstarflower",
      "body": "I had an ED myself a while ago… \n\nsimply put here are some things not to say:\n\n“You look healthy”\n-this seems perfectly fine to say but people with eating disorders have a completely different way of thinking about these things. \n\n”you must be hungry” ; “ are you going to eat all that?” or any comments suggesting that she is eating too much food. these are comments that can be very triggering for those with EDs.\n\nalso, try to avoid saying anything in regards to her figure… \n\nsay:\n\n“you are beautiful” \n“you are strong” \nany words of encouragement.\n\nI think it’s very meaningful that you care enough to look into this. Not all people are that considerate. props to you",
      "created_utc": 1642029098.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hsezilf",
      "author": "p3rky13",
      "body": "Respect for reaching out. My girlfriend is the exact same, the only difference I have from you is that I came into her life before the disorder was diagnosed, I was with her through her treatment, and I’m still with her after. The strategy is: compliments. Don’t make any criticism if it has anything to do with her body or eating. Tell her that she’s beautiful and that you love the way she looks 24/7. If she’s still recovering and her weight/appearance changes still do the same thing. Don’t make specific comments on things about her body that could change. If it does change then she may think that you don’t like how she looks anymore. Just a generic, you think she’s gorgeous, all the time.",
      "created_utc": 1642029810.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hsf2gf2",
      "author": "None",
      "body": "I like that you're so considerate of what would trigger your girlfriend, honestly I wish more people in my life cared enough to try and not to trigger me!!\n\nI'd say things to avoid for sure would be any kind of diet talk ('have you heard of xyzzy diet?' and so forth), 'punishing' behaviors even if you only talk about them (like saying you're going to have to go for a run because you ate chocolate, ...) and don't put moral value on food ('oh were being so bad today for having pizza!'). \n\nThen I'd also say to avoid any numbers; mentions of calories, your weight, how many hours you've exercised, etc... Those things are particularly triggering to people with eating disorders.\n\nKeep encouraging her, if she needs to talk about it be there for her but don't 'over' control her either - it doesn't help if someone is constantly watching what you eat. Hope this helps!!",
      "created_utc": 1642031024.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hsfytkg",
      "author": "sandopsio",
      "body": "It’s great that you’re asking, and seeking out resources to be supportive/do no harm. It shows that you’re a caring person who wants to learn. \n\nEveryone has different “triggers” but in general, I would NOT comment on anybody’s body size/weight. Many people, even people without eating disorders could do without these topics of discussion. Same with talk about “good” vs. “bad” foods/food judgements, portion sizes, etc. Attaching judgement to food and/or the body can affect different people in harmful ways. For example, I have an eating disorder, my mom does not. However, my dad made a comment about my mom’s portion size and it was hurtful to her even though she doesn’t have an eating disorder. \n\nGood things to do are to maybe ask your girlfriend if she has any triggers you should avoid or that she wants you to know about, ask how you can support her. Don’t be afraid to be honest about your own concerns, worries and needs. Beyond that, I think just talking about normal things helps. I had a boyfriend who I didn’t tell about my eating disorder early on, but he still supported me by picking up on the fact that I was anxious after eating (even if he didn’t know why) and bringing up a subject that he knew I loved. We talked about that and the distraction really helped me feel calmer.",
      "created_utc": 1642045802.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hsh8wzl",
      "author": "DoktorVinter",
      "body": "I agree with others here, to not focus on her body at all. Although, what I would've liked hearing when I was at my sickest, was probably: \"You are worth living. You are worth everything in this life. You are beautiful inside and out. You are a good person and you are not defined by your body. I love you no matter what and will always be here to support you. You are not alone.\"\n\nBut not everyone feels the same way of course.",
      "created_utc": 1642076894.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hsckc8e",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1641996248.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hsdqb4m",
      "author": "FrustratedPenguins",
      "body": "I would ask her what is helpful. Ask her if there any topic she would like to discuss, or anything that she would prefer you not say or mention. My guess is that she finds discussion of diet and weight loss triggering, as that is common, but she might not! I love that you were trying to do your best to help her feel comfortable. I would just be open about it with her and tell her you don’t want to say anything that is harmful and you want to support her.",
      "created_utc": 1642012651.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hsdstil",
      "author": "justanewbiehereonred",
      "body": "Hey, as hard as it is you guys should probably have a talk about boundaries with that and stuff, but if you think she is not ready yet, or if she says she doesn’t wanna have this convo now, maybe just don’t talk about calories, too much about food, don’t talk about other gurls bodies, and don’t make comments you think will trigger her. \nBut having the talk is probably the best",
      "created_utc": 1642013588.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hseoqdo",
      "author": "Agile_Pin_3837",
      "body": "Hi, I've lived with disorderd eating for years, so the below is based on my own experience.\n\nI'd suggest talking to her about what conversations are triggering for her and what she is comfortable talking about. As a rule, conversations about weight, calories, healthy/unhealthy food or habits orbody appearance is not particularly helpful (for anyone really!) and it doesn't matter if it's a comment in relation to her or someone else. \n\nSometimes I find that I can becomes preoccupied with food and at those times struggle to eat, so one of my friends has helped me to learn to cook and prepare tasty meals. It's a fun thing to do together and might take away some fear with food (this is my personal experience, so definitely worth a conversation first!) \n\nI think for me the important thing is being there for her, listening non-judgementally and compassionately. It's not a choice and is exhausting, and when you have an ED you can feel judged all the time by yourself yourself well-meaning others. Sometimes if I'm struggling my friends will ask me \"solution or strop\" where they will either help me problem solve or let me rant and they listen and agree with my moaning! \n\nYou're in a tough position, but clearly care enough to reach out to support her. Keep the lines of communication open, if you notice signs of relapse, talk to her about her feelings (not food/eating habits) and reiterate that you want to help. You'll probably make a few mistakes along the way, but she will feel better for the fact that you are keen to support her.\n\nGood luck to the both of you 😊",
      "created_utc": 1642025526.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hsfew3v",
      "author": "Kare_TheBear",
      "body": "DON'T talk about anything related to weight/eating. Even as far as \"what do you want to eat?\" Could potentially trigger her depending on her state at the time. \n\nI think the better bet is to circle things like that back to yourself. \"Hey, I'm hungry. Do you want anything?\" \n\nI wouldn't call her \"beautiful\" because in her mind she is equating beauty to weight. Compliment her hair, makeup, outfit. Tell her she is glowing, she looks happy. Be specific; I love your smile. I love being in your presence. You make me feel happy. \n\nIt's hard to reprogram and adjust how you uplift someone, it gets easier as you keep going. It seems like you care about her, enough to search up an eating disorder thread and ask for advice to assist her. \n\nYou got this, dude. 💪🏻 You're going to say things that might poke her in a way that you didn't intend for, but that is not your fault. I hope she appreciates your effort.",
      "created_utc": 1642036937.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hsg91op",
      "author": "thenemesissss",
      "body": "as someone that struggles with disordered eating and has a very caring fiancé. i could share some things my fiancé does with me. so my fiancé was in the room when my weight was mentioned through drs of them expressing concern so she became latched onto the idea of helping me get better. she’s had friends that have struggled with eds so i guess it was much easier for her to handle me. the biggest thing she did was help me with meal plans. which consisted of smaller meals and also bringing protein smoothies into the mix of things. if i ever appeared to be getting fixated on anything, she would usually catch on and actually not even mention it. her thing she likes to do is talk to me about something interesting. something she knows i’ll pay attention to instead of overthinking. then with any form of fear foods, she would help me through them by eating with me. no matter how long it took. she has always been patient with me. when i started putting on weight, she wouldn’t acknowledge it unless if i said something myself. there was points where i would literally stare at myself and find things to nitpick at myself about but she prevented that. she caught on to me living in baggy clothes would help so she would sometimes just put me in one of her hoodies and sweatpants. which would definitely be big on me with her being taller than me but it took my mind off of that. as i’ve gotten mentally better, she did eventually start to acknowledge it but as “happy weight” since my mental health was obviously improving itself. she would be there for me through my therapy sessions and everything too. for me, i sort of had to stay in supervision with drs. like i was able to be at home with her but like there was constant dr appointments mostly because she wanted to just make sure everything is okay internally. which helped me a lot since i do battle with health anxiety also. another thing that really helped me that she did was that she would allow “bad days” with food but she would make sure i didn’t make it a habit. basically that i wasn’t falling backwards. which is something she honestly has remained passive aggressive about but i know i understand where it’s coming from. only wouldn’t recommend that since your girlfriend appears a little fragile at the moment. it’s been a little over 4 months of me taking recovery seriously and it’s actually been somewhat good. i tend to feel a lot more confident in it alone from being in her care bc i know she will catch me if i fall backwards. so the best thing i could say about this, just be a safe space for her. communication can really help through this part. learning what she’s sensitive about and what is okay to talk about can really help. if she ever does come off as “stubborn” don’t take it personally. it is usually the guilt trip that comes with it, especially if she is very self aware that something isn’t right. just simply being there can help. \n\ni wish you guys the best! ❤️",
      "created_utc": 1642050981.0,
      "score": 1,
      "context": []
    },
    {
      "id": "htam5fw",
      "author": "majorassburger",
      "body": "I just fucked up a new relationship by not knowing how to handle past ED issues she had. Exercise and clean eating is a hobby of mine I guess - I enjoy figuring out what foods fuel my workouts and seeing my body change in relation to how I eat. As a result I often talk about this. Well it was triggering her and I didn’t know, until it came out in a bit of a rage dumping…!\n\nI feel terrible that I may have set her back on her journey. The relationship is over, but I’ve learned a valuable lesson about how to treat people.",
      "created_utc": 1642580647.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hseghmq",
      "author": "Beelung",
      "body": "hi, I’m the person who submited the request. No, I haven’t and would never say something like that to her and I abstain myself from making any kind of comment on her body which is like, the normal thing to do I guess. I just added it in the post I guess just to give a little more context about the situation, and I understand where you are coming from. Thanks for commenting :)",
      "created_utc": 1642022442.0,
      "score": 4,
      "context": [
        {
          "id": "hsdbzea",
          "author": "iforgotmyedaccount",
          "body": "Don’t bring up weight, calories, etc. Let her guide you in what she’s comfortable with. Definitely don’t tell her that thing you wrote about her not being skinny. Just tell her she’s beautiful without making it about her weight. Easy.",
          "created_utc": 1642007349.0
        }
      ]
    },
    {
      "id": "hsd6ehv",
      "author": "610-Kat",
      "body": ">Why would you want to talk to her about diets and kcal at all?\n\nIt's a pretty common theme actually, it's triggering for us but this doesn't mean that no one should talk about food, diet, exercising and so on.\nIt's just something to avoid with someone struggling with an ed, of course.",
      "created_utc": 1642005254.0,
      "score": 15,
      "context": [
        {
          "id": "hsczqkc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1642002698.0
        }
      ]
    },
    {
      "id": "hssb4s5",
      "author": "PastelSprite",
      "body": "I agree with this. If you’re afraid you may forget something, definitely ask her to make you a list instead. If you have any questions about the things, definitely ask.",
      "created_utc": 1642266561.0,
      "score": 1,
      "context": [
        {
          "id": "hsdf8ij",
          "author": "LucyBlue16",
          "body": "For me, not talking about the elephant in the corner is giving that elephant more importance than needed. I don’t see why you can’t ask her what she’s comfortable talking about and what she’s rather not discuss. But I think it’s important to be able to talk about food and eating and body image because these are part of the human experience and shouldn’t be taboo. Of course find things other than her appearance to comment on and compliment her on. But please ask her what she needs from you and your relationship.",
          "created_utc": 1642008559.0
        }
      ]
    },
    {
      "id": "hseh5ui",
      "author": "Beelung",
      "body": "Hi, I’m the person who submitted the request. \n\nThanks a lot! Your comment really makes a lot of sense and made me think a little, I will take that into consideration. \n\nWhat do you think would be the appropriate response to something like “Oh this pants make me look fat” or a comment like that, which has happened before and she has said she feels comforted by my answers but I’d like to know what would you think is the better idea",
      "created_utc": 1642022684.0,
      "score": 3,
      "context": [
        {
          "id": "hsef1c7",
          "author": "cjx888x",
          "body": "One thing I think people misunderstand is the idea that it is helpful to tell people with ED that they look good/not fat/etc etc. or to try to convince them to change their mind on their opinion of their own body. One of the healthiest things you can do for someone with ED is stop talking about bodies at all. Even yours, or other peoples. Even good things. Body talk- both good and bad- has become such a constant part of our culture and it plays a big role in ED. When you comment on anyones body in any way, it reflects the notion that body appearances matter to you. People with ED hear that, and it has an impact on them.\n\nSo start teaching yourself to stop that. Grab a journal and jot down ways to compliment or talk about your gf, yourself, and others, in ways that have nothing to do with bodies. Think about those things, and practice it. This stuff will go a long way to helping your gf feel safe around you, and it’s something that is helpful to everyone around you. Think of things people had control over- commenting on peoples body is making a judgement call on something they had no choice in. \n\nExample: ‘that dress makes you look fierce!’ \n                ‘I dig your new piercing!\n                ‘she looks stylish as hell.’ \n‘Did you see that dudes haircut? I would never!’",
          "created_utc": 1642021912.0
        }
      ]
    },
    {
      "id": "hsfdjlq",
      "author": "Beelung",
      "body": "Hi, I’m op. \n\nAnother person commented addressing the same thing and I just wanna point out that no, I will never say this to her. I guess I just added that there to add more context on the situation perhaps? I’m not sure, that just what came to my mind at the moment but it wasn’t with a bad intention. \n\nEven then, I understand where you are coming from and I appreciate the concern. \n\nThanks for commenting! :)",
      "created_utc": 1642036327.0,
      "score": 3,
      "context": [
        {
          "id": "hsebmxx",
          "author": "unkreativername0",
          "body": ">when she really isn’t, **perhaps not skinny**, but not fat at all.\n\nDefinitely don't say this to her lmao.",
          "created_utc": 1642020678.0
        }
      ]
    },
    {
      "id": "hsei22i",
      "author": "Beelung",
      "body": "Hi, op here. \n\nSo she has been recovering for a while now and we have done multiple food-related dates. She likes to cook so we have even shared breakfast at her house where she prepared it herself and things like that. She also enjoys food/eating outside like baked goods and things like that and she hasn’t expressed any negative emotion about these, in the contrary she encourages these so I guess this is fine right? \n\nI feel like I will end up asking her directly everything but we haven’t been able to see each other in person for a while because of covid so I wanted to have more of a general response from people that probably know better than me \n\nThanks for commenting btw :)",
      "created_utc": 1642023010.0,
      "score": 1,
      "context": [
        {
          "id": "hsectml",
          "author": "unkreativername0",
          "body": "I would suggest:\n\n* Keep on making honest compliments, but don't overdo it.\n* Also, focus on compliments that aren't only about her looks/body.\n* Avoid talking to her about  diets, calories etc.\n* Focus on non-food-centered activities.\n* Just ask her what would be helpful.\n\nWishing you two the best!",
          "created_utc": 1642021109.0
        }
      ]
    },
    {
      "id": "huuzh9c",
      "author": "stripedcicada",
      "body": "Hi there! I’ve been reading a bunch of posts trying to learn how to help my bf of 2yrs. May I ask, did your fiancé approach the conversation with you by asking what topics were off limits?",
      "created_utc": 1643555952.0,
      "score": 2,
      "context": [
        {
          "id": "hsg91op",
          "author": "thenemesissss",
          "body": "as someone that struggles with disordered eating and has a very caring fiancé. i could share some things my fiancé does with me. so my fiancé was in the room when my weight was mentioned through drs of them expressing concern so she became latched onto the idea of helping me get better. she’s had friends that have struggled with eds so i guess it was much easier for her to handle me. the biggest thing she did was help me with meal plans. which consisted of smaller meals and also bringing protein smoothies into the mix of things. if i ever appeared to be getting fixated on anything, she would usually catch on and actually not even mention it. her thing she likes to do is talk to me about something interesting. something she knows i’ll pay attention to instead of overthinking. then with any form of fear foods, she would help me through them by eating with me. no matter how long it took. she has always been patient with me. when i started putting on weight, she wouldn’t acknowledge it unless if i said something myself. there was points where i would literally stare at myself and find things to nitpick at myself about but she prevented that. she caught on to me living in baggy clothes would help so she would sometimes just put me in one of her hoodies and sweatpants. which would definitely be big on me with her being taller than me but it took my mind off of that. as i’ve gotten mentally better, she did eventually start to acknowledge it but as “happy weight” since my mental health was obviously improving itself. she would be there for me through my therapy sessions and everything too. for me, i sort of had to stay in supervision with drs. like i was able to be at home with her but like there was constant dr appointments mostly because she wanted to just make sure everything is okay internally. which helped me a lot since i do battle with health anxiety also. another thing that really helped me that she did was that she would allow “bad days” with food but she would make sure i didn’t make it a habit. basically that i wasn’t falling backwards. which is something she honestly has remained passive aggressive about but i know i understand where it’s coming from. only wouldn’t recommend that since your girlfriend appears a little fragile at the moment. it’s been a little over 4 months of me taking recovery seriously and it’s actually been somewhat good. i tend to feel a lot more confident in it alone from being in her care bc i know she will catch me if i fall backwards. so the best thing i could say about this, just be a safe space for her. communication can really help through this part. learning what she’s sensitive about and what is okay to talk about can really help. if she ever does come off as “stubborn” don’t take it personally. it is usually the guilt trip that comes with it, especially if she is very self aware that something isn’t right. just simply being there can help. \n\ni wish you guys the best! ❤️",
          "created_utc": 1642050981.0
        }
      ]
    },
    {
      "id": "hsdikgu",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1642009792.0,
      "score": 7,
      "context": [
        {
          "id": "hsczqkc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1642002698.0
        },
        {
          "id": "hsd6ehv",
          "author": "610-Kat",
          "body": ">Why would you want to talk to her about diets and kcal at all?\n\nIt's a pretty common theme actually, it's triggering for us but this doesn't mean that no one should talk about food, diet, exercising and so on.\nIt's just something to avoid with someone struggling with an ed, of course.",
          "created_utc": 1642005254.0
        }
      ]
    },
    {
      "id": "hsey01q",
      "author": "cjx888x",
      "body": "Honestly? I think seeking our sense of self and esteem from outside sources only makes the problem worse, even if it makes you feel good in the moment. \n\nI can’t tell you what to do, but if it was my gf? I would sit down and talk to her. I would tell her that I 1000% respect the struggle of what she is dealing with. Then, I would tell her that I care too much about her well being to engage in ‘body talk’ with her. I would tell her that I am always here for her, and if she is feeling insecure or sad or anything and needs love or support, that I want her to ask. But I need to set a boundary for her to not ask me to engage in body talk with her, because I don’t feel ok about doing something that is harmful to her. \n\nPeople who has illnesses like ED and addiction try to find a way to get needs met in very unhealthy ways, and they take their loved ones down with them while causing themselves more harm. It should never ever be your job to tell her how to get better or do the work for her, but its totally appropriate for you to set boundaries to prevent you from enabling her or causing harm.",
      "created_utc": 1642029188.0,
      "score": 4,
      "context": [
        {
          "id": "hsef1c7",
          "author": "cjx888x",
          "body": "One thing I think people misunderstand is the idea that it is helpful to tell people with ED that they look good/not fat/etc etc. or to try to convince them to change their mind on their opinion of their own body. One of the healthiest things you can do for someone with ED is stop talking about bodies at all. Even yours, or other peoples. Even good things. Body talk- both good and bad- has become such a constant part of our culture and it plays a big role in ED. When you comment on anyones body in any way, it reflects the notion that body appearances matter to you. People with ED hear that, and it has an impact on them.\n\nSo start teaching yourself to stop that. Grab a journal and jot down ways to compliment or talk about your gf, yourself, and others, in ways that have nothing to do with bodies. Think about those things, and practice it. This stuff will go a long way to helping your gf feel safe around you, and it’s something that is helpful to everyone around you. Think of things people had control over- commenting on peoples body is making a judgement call on something they had no choice in. \n\nExample: ‘that dress makes you look fierce!’ \n                ‘I dig your new piercing!\n                ‘she looks stylish as hell.’ \n‘Did you see that dudes haircut? I would never!’",
          "created_utc": 1642021912.0
        },
        {
          "id": "hseh5ui",
          "author": "Beelung",
          "body": "Hi, I’m the person who submitted the request. \n\nThanks a lot! Your comment really makes a lot of sense and made me think a little, I will take that into consideration. \n\nWhat do you think would be the appropriate response to something like “Oh this pants make me look fat” or a comment like that, which has happened before and she has said she feels comforted by my answers but I’d like to know what would you think is the better idea",
          "created_utc": 1642022684.0
        }
      ]
    },
    {
      "id": "hsg6lzu",
      "author": "unkreativername0",
      "body": "Hey! I totally got your intention with adding that, I wasn't meant to sound rude or anything – so sorry if I did. Wishing you the best!",
      "created_utc": 1642049684.0,
      "score": 1,
      "context": [
        {
          "id": "hsebmxx",
          "author": "unkreativername0",
          "body": ">when she really isn’t, **perhaps not skinny**, but not fat at all.\n\nDefinitely don't say this to her lmao.",
          "created_utc": 1642020678.0
        },
        {
          "id": "hsfdjlq",
          "author": "Beelung",
          "body": "Hi, I’m op. \n\nAnother person commented addressing the same thing and I just wanna point out that no, I will never say this to her. I guess I just added that there to add more context on the situation perhaps? I’m not sure, that just what came to my mind at the moment but it wasn’t with a bad intention. \n\nEven then, I understand where you are coming from and I appreciate the concern. \n\nThanks for commenting! :)",
          "created_utc": 1642036327.0
        }
      ]
    },
    {
      "id": "huv8sld",
      "author": "thenemesissss",
      "body": "not exactly, that’s only because me and her always been extremely transparent. like that was always apart of us. when it came down to my eating disorder, there wasn’t really much said, it was just the whole “you need to get better and i’m here for you” because her thing was for me to understand i’m not about to go through it alone. there was only like one time she triggered me, unintentionally, she was trying to be happy about weight i put on. i spoke to her about it and haven’t had a problem since, she learned to express happiness about it without being too direct with what’s going on. i also had a journey of kind of figuring out what even caused my eating disorder to get so bad, pinpointing triggers basically. a lot of it had to do with the environment i was in during high school so there’s not really a way that will happen again. there wasn’t much for her to say, other than getting the help that i need to fully recover. there are some points where she’s learned to dial back the passive aggressive thing, usually on my not so great days, she’s learned to become comforting in that manner. i’ve been slowly not having to be fully dependent on her, if that makes sense? for me in the beginning i had zero hunger signals so i used to have to depend on her to remind me to eat something small basically every hour. now i’m starting to get more into intuitive eating instead of having to plan all the time. \n\ndefinitely talk to them about everything, if you can. it’s important to understand the person specifically instead of a bigger base because everyone is different. some people are more sensitive, some are not. i know for me and my wife, we’ve just always had transparency and deep conversations apart of our friendship that eventually led into the romantic relationship we started. \n\nsome of the basic things are usually to not mention weight, how their body physically looks, how much they’re eating, those kind of things. i know you may not mean any harm, because my wife used to do the same, but in the brain of a person with an ed, it triggers the little voice in our heads to just completely stop. we are usually overwhelmed with the thought of food, which is why my wife specifically has actually taught me how to just mindlessly eat by having me engaged in conversations with her. it’s not going to be perfect but it’s definitely something to try. those are just usually some of the normal off limit kind of things that tend to be more universal but definitely talk to them so you can know what harms them personally.",
      "created_utc": 1643559712.0,
      "score": 2,
      "context": [
        {
          "id": "hsg91op",
          "author": "thenemesissss",
          "body": "as someone that struggles with disordered eating and has a very caring fiancé. i could share some things my fiancé does with me. so my fiancé was in the room when my weight was mentioned through drs of them expressing concern so she became latched onto the idea of helping me get better. she’s had friends that have struggled with eds so i guess it was much easier for her to handle me. the biggest thing she did was help me with meal plans. which consisted of smaller meals and also bringing protein smoothies into the mix of things. if i ever appeared to be getting fixated on anything, she would usually catch on and actually not even mention it. her thing she likes to do is talk to me about something interesting. something she knows i’ll pay attention to instead of overthinking. then with any form of fear foods, she would help me through them by eating with me. no matter how long it took. she has always been patient with me. when i started putting on weight, she wouldn’t acknowledge it unless if i said something myself. there was points where i would literally stare at myself and find things to nitpick at myself about but she prevented that. she caught on to me living in baggy clothes would help so she would sometimes just put me in one of her hoodies and sweatpants. which would definitely be big on me with her being taller than me but it took my mind off of that. as i’ve gotten mentally better, she did eventually start to acknowledge it but as “happy weight” since my mental health was obviously improving itself. she would be there for me through my therapy sessions and everything too. for me, i sort of had to stay in supervision with drs. like i was able to be at home with her but like there was constant dr appointments mostly because she wanted to just make sure everything is okay internally. which helped me a lot since i do battle with health anxiety also. another thing that really helped me that she did was that she would allow “bad days” with food but she would make sure i didn’t make it a habit. basically that i wasn’t falling backwards. which is something she honestly has remained passive aggressive about but i know i understand where it’s coming from. only wouldn’t recommend that since your girlfriend appears a little fragile at the moment. it’s been a little over 4 months of me taking recovery seriously and it’s actually been somewhat good. i tend to feel a lot more confident in it alone from being in her care bc i know she will catch me if i fall backwards. so the best thing i could say about this, just be a safe space for her. communication can really help through this part. learning what she’s sensitive about and what is okay to talk about can really help. if she ever does come off as “stubborn” don’t take it personally. it is usually the guilt trip that comes with it, especially if she is very self aware that something isn’t right. just simply being there can help. \n\ni wish you guys the best! ❤️",
          "created_utc": 1642050981.0
        },
        {
          "id": "huuzh9c",
          "author": "stripedcicada",
          "body": "Hi there! I’ve been reading a bunch of posts trying to learn how to help my bf of 2yrs. May I ask, did your fiancé approach the conversation with you by asking what topics were off limits?",
          "created_utc": 1643555952.0
        }
      ]
    },
    {
      "id": "hsdwz77",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1642015154.0,
      "score": 3,
      "context": [
        {
          "id": "hsczqkc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1642002698.0
        },
        {
          "id": "hsd6ehv",
          "author": "610-Kat",
          "body": ">Why would you want to talk to her about diets and kcal at all?\n\nIt's a pretty common theme actually, it's triggering for us but this doesn't mean that no one should talk about food, diet, exercising and so on.\nIt's just something to avoid with someone struggling with an ed, of course.",
          "created_utc": 1642005254.0
        },
        {
          "id": "hsdikgu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1642009792.0
        }
      ]
    },
    {
      "id": "huvkjn0",
      "author": "stripedcicada",
      "body": "Thank you so much for your response, i really want to have a similar approach, in the sense of partnership through this journey. I brought it up previously in a “I’m concerned and I love you” kind of way, he basically said he already knew he had a problem before I brought it up and has already “solved it” which was not true he just became (what he thought was) better at concealing it. Now it has gone much farther and I want to help if he’ll let me. \n\nThank you again for responding, wishing you and your wife the best!",
      "created_utc": 1643564223.0,
      "score": 2,
      "context": [
        {
          "id": "hsg91op",
          "author": "thenemesissss",
          "body": "as someone that struggles with disordered eating and has a very caring fiancé. i could share some things my fiancé does with me. so my fiancé was in the room when my weight was mentioned through drs of them expressing concern so she became latched onto the idea of helping me get better. she’s had friends that have struggled with eds so i guess it was much easier for her to handle me. the biggest thing she did was help me with meal plans. which consisted of smaller meals and also bringing protein smoothies into the mix of things. if i ever appeared to be getting fixated on anything, she would usually catch on and actually not even mention it. her thing she likes to do is talk to me about something interesting. something she knows i’ll pay attention to instead of overthinking. then with any form of fear foods, she would help me through them by eating with me. no matter how long it took. she has always been patient with me. when i started putting on weight, she wouldn’t acknowledge it unless if i said something myself. there was points where i would literally stare at myself and find things to nitpick at myself about but she prevented that. she caught on to me living in baggy clothes would help so she would sometimes just put me in one of her hoodies and sweatpants. which would definitely be big on me with her being taller than me but it took my mind off of that. as i’ve gotten mentally better, she did eventually start to acknowledge it but as “happy weight” since my mental health was obviously improving itself. she would be there for me through my therapy sessions and everything too. for me, i sort of had to stay in supervision with drs. like i was able to be at home with her but like there was constant dr appointments mostly because she wanted to just make sure everything is okay internally. which helped me a lot since i do battle with health anxiety also. another thing that really helped me that she did was that she would allow “bad days” with food but she would make sure i didn’t make it a habit. basically that i wasn’t falling backwards. which is something she honestly has remained passive aggressive about but i know i understand where it’s coming from. only wouldn’t recommend that since your girlfriend appears a little fragile at the moment. it’s been a little over 4 months of me taking recovery seriously and it’s actually been somewhat good. i tend to feel a lot more confident in it alone from being in her care bc i know she will catch me if i fall backwards. so the best thing i could say about this, just be a safe space for her. communication can really help through this part. learning what she’s sensitive about and what is okay to talk about can really help. if she ever does come off as “stubborn” don’t take it personally. it is usually the guilt trip that comes with it, especially if she is very self aware that something isn’t right. just simply being there can help. \n\ni wish you guys the best! ❤️",
          "created_utc": 1642050981.0
        },
        {
          "id": "huuzh9c",
          "author": "stripedcicada",
          "body": "Hi there! I’ve been reading a bunch of posts trying to learn how to help my bf of 2yrs. May I ask, did your fiancé approach the conversation with you by asking what topics were off limits?",
          "created_utc": 1643555952.0
        },
        {
          "id": "huv8sld",
          "author": "thenemesissss",
          "body": "not exactly, that’s only because me and her always been extremely transparent. like that was always apart of us. when it came down to my eating disorder, there wasn’t really much said, it was just the whole “you need to get better and i’m here for you” because her thing was for me to understand i’m not about to go through it alone. there was only like one time she triggered me, unintentionally, she was trying to be happy about weight i put on. i spoke to her about it and haven’t had a problem since, she learned to express happiness about it without being too direct with what’s going on. i also had a journey of kind of figuring out what even caused my eating disorder to get so bad, pinpointing triggers basically. a lot of it had to do with the environment i was in during high school so there’s not really a way that will happen again. there wasn’t much for her to say, other than getting the help that i need to fully recover. there are some points where she’s learned to dial back the passive aggressive thing, usually on my not so great days, she’s learned to become comforting in that manner. i’ve been slowly not having to be fully dependent on her, if that makes sense? for me in the beginning i had zero hunger signals so i used to have to depend on her to remind me to eat something small basically every hour. now i’m starting to get more into intuitive eating instead of having to plan all the time. \n\ndefinitely talk to them about everything, if you can. it’s important to understand the person specifically instead of a bigger base because everyone is different. some people are more sensitive, some are not. i know for me and my wife, we’ve just always had transparency and deep conversations apart of our friendship that eventually led into the romantic relationship we started. \n\nsome of the basic things are usually to not mention weight, how their body physically looks, how much they’re eating, those kind of things. i know you may not mean any harm, because my wife used to do the same, but in the brain of a person with an ed, it triggers the little voice in our heads to just completely stop. we are usually overwhelmed with the thought of food, which is why my wife specifically has actually taught me how to just mindlessly eat by having me engaged in conversations with her. it’s not going to be perfect but it’s definitely something to try. those are just usually some of the normal off limit kind of things that tend to be more universal but definitely talk to them so you can know what harms them personally.",
          "created_utc": 1643559712.0
        }
      ]
    },
    {
      "id": "hsgsb3h",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1642064225.0,
      "score": 3,
      "context": [
        {
          "id": "hsczqkc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1642002698.0
        },
        {
          "id": "hsd6ehv",
          "author": "610-Kat",
          "body": ">Why would you want to talk to her about diets and kcal at all?\n\nIt's a pretty common theme actually, it's triggering for us but this doesn't mean that no one should talk about food, diet, exercising and so on.\nIt's just something to avoid with someone struggling with an ed, of course.",
          "created_utc": 1642005254.0
        },
        {
          "id": "hsdikgu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1642009792.0
        },
        {
          "id": "hsdwz77",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1642015154.0
        }
      ]
    },
    {
      "id": "huw0s6o",
      "author": "thenemesissss",
      "body": "you’re welcome :) i’m sure you simply caring is enough itself. i did figure out my wife did have her suspensions about my eating habits but basically had no clue how to approach it. so the irony of me seeing drs for other things and having my GP at the time push recovery, it sort of helped her figure out how to go about it. i was personally given the chance to recover on my own since they could tell my wife would keep me on top of it. there are days i’ll get upset with her but she knows to not take it personally. it’s usually just me being frustrated with myself. it did eventually get to the point where i’d need some guidance from people like dietitians and people in that realm. along with my therapist i’ve already had for the last couple years, really helped guide my wife as a supportive s/o. so if it ever gets to that point, those drs can definitely help with guidance as a support system. \n\nin the meantime, could possibly just help slowly gear them onto the path of recovery. see if they could possibly try it on their own, it’s completely okay if they can’t. that’s why we have drs that specialize in eating disorders. just remember tho, they have to want it for themselves. so possibly help them find reasons to recover and have them remember those things in the back of their mind. definitely just try to focus on the mental part because i’ve realized once you have that motivation mentally, it can keep you pushing through any physical things. since eating disorders are a mental disorder that causes physically effects to the body. \n\nthank you! i wish you and your s/o the best too! ❤️",
      "created_utc": 1643570377.0,
      "score": 2,
      "context": [
        {
          "id": "hsg91op",
          "author": "thenemesissss",
          "body": "as someone that struggles with disordered eating and has a very caring fiancé. i could share some things my fiancé does with me. so my fiancé was in the room when my weight was mentioned through drs of them expressing concern so she became latched onto the idea of helping me get better. she’s had friends that have struggled with eds so i guess it was much easier for her to handle me. the biggest thing she did was help me with meal plans. which consisted of smaller meals and also bringing protein smoothies into the mix of things. if i ever appeared to be getting fixated on anything, she would usually catch on and actually not even mention it. her thing she likes to do is talk to me about something interesting. something she knows i’ll pay attention to instead of overthinking. then with any form of fear foods, she would help me through them by eating with me. no matter how long it took. she has always been patient with me. when i started putting on weight, she wouldn’t acknowledge it unless if i said something myself. there was points where i would literally stare at myself and find things to nitpick at myself about but she prevented that. she caught on to me living in baggy clothes would help so she would sometimes just put me in one of her hoodies and sweatpants. which would definitely be big on me with her being taller than me but it took my mind off of that. as i’ve gotten mentally better, she did eventually start to acknowledge it but as “happy weight” since my mental health was obviously improving itself. she would be there for me through my therapy sessions and everything too. for me, i sort of had to stay in supervision with drs. like i was able to be at home with her but like there was constant dr appointments mostly because she wanted to just make sure everything is okay internally. which helped me a lot since i do battle with health anxiety also. another thing that really helped me that she did was that she would allow “bad days” with food but she would make sure i didn’t make it a habit. basically that i wasn’t falling backwards. which is something she honestly has remained passive aggressive about but i know i understand where it’s coming from. only wouldn’t recommend that since your girlfriend appears a little fragile at the moment. it’s been a little over 4 months of me taking recovery seriously and it’s actually been somewhat good. i tend to feel a lot more confident in it alone from being in her care bc i know she will catch me if i fall backwards. so the best thing i could say about this, just be a safe space for her. communication can really help through this part. learning what she’s sensitive about and what is okay to talk about can really help. if she ever does come off as “stubborn” don’t take it personally. it is usually the guilt trip that comes with it, especially if she is very self aware that something isn’t right. just simply being there can help. \n\ni wish you guys the best! ❤️",
          "created_utc": 1642050981.0
        },
        {
          "id": "huuzh9c",
          "author": "stripedcicada",
          "body": "Hi there! I’ve been reading a bunch of posts trying to learn how to help my bf of 2yrs. May I ask, did your fiancé approach the conversation with you by asking what topics were off limits?",
          "created_utc": 1643555952.0
        },
        {
          "id": "huv8sld",
          "author": "thenemesissss",
          "body": "not exactly, that’s only because me and her always been extremely transparent. like that was always apart of us. when it came down to my eating disorder, there wasn’t really much said, it was just the whole “you need to get better and i’m here for you” because her thing was for me to understand i’m not about to go through it alone. there was only like one time she triggered me, unintentionally, she was trying to be happy about weight i put on. i spoke to her about it and haven’t had a problem since, she learned to express happiness about it without being too direct with what’s going on. i also had a journey of kind of figuring out what even caused my eating disorder to get so bad, pinpointing triggers basically. a lot of it had to do with the environment i was in during high school so there’s not really a way that will happen again. there wasn’t much for her to say, other than getting the help that i need to fully recover. there are some points where she’s learned to dial back the passive aggressive thing, usually on my not so great days, she’s learned to become comforting in that manner. i’ve been slowly not having to be fully dependent on her, if that makes sense? for me in the beginning i had zero hunger signals so i used to have to depend on her to remind me to eat something small basically every hour. now i’m starting to get more into intuitive eating instead of having to plan all the time. \n\ndefinitely talk to them about everything, if you can. it’s important to understand the person specifically instead of a bigger base because everyone is different. some people are more sensitive, some are not. i know for me and my wife, we’ve just always had transparency and deep conversations apart of our friendship that eventually led into the romantic relationship we started. \n\nsome of the basic things are usually to not mention weight, how their body physically looks, how much they’re eating, those kind of things. i know you may not mean any harm, because my wife used to do the same, but in the brain of a person with an ed, it triggers the little voice in our heads to just completely stop. we are usually overwhelmed with the thought of food, which is why my wife specifically has actually taught me how to just mindlessly eat by having me engaged in conversations with her. it’s not going to be perfect but it’s definitely something to try. those are just usually some of the normal off limit kind of things that tend to be more universal but definitely talk to them so you can know what harms them personally.",
          "created_utc": 1643559712.0
        },
        {
          "id": "huvkjn0",
          "author": "stripedcicada",
          "body": "Thank you so much for your response, i really want to have a similar approach, in the sense of partnership through this journey. I brought it up previously in a “I’m concerned and I love you” kind of way, he basically said he already knew he had a problem before I brought it up and has already “solved it” which was not true he just became (what he thought was) better at concealing it. Now it has gone much farther and I want to help if he’ll let me. \n\nThank you again for responding, wishing you and your wife the best!",
          "created_utc": 1643564223.0
        }
      ]
    },
    {
      "id": "hslw6xk",
      "author": "610-Kat",
      "body": "I'm not saying it's universal, I was just saying that in my experience my classmates and friends have been way more toxic than a typically toxic environment. It was more like a flow of consciousness (idk if \"flusso di coscienza\" is translated like this)",
      "created_utc": 1642151444.0,
      "score": 2,
      "context": [
        {
          "id": "hsczqkc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1642002698.0
        },
        {
          "id": "hsd6ehv",
          "author": "610-Kat",
          "body": ">Why would you want to talk to her about diets and kcal at all?\n\nIt's a pretty common theme actually, it's triggering for us but this doesn't mean that no one should talk about food, diet, exercising and so on.\nIt's just something to avoid with someone struggling with an ed, of course.",
          "created_utc": 1642005254.0
        },
        {
          "id": "hsdikgu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1642009792.0
        },
        {
          "id": "hsdwz77",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1642015154.0
        },
        {
          "id": "hsgsb3h",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1642064225.0
        }
      ]
    },
    {
      "id": "huwsmqs",
      "author": "stripedcicada",
      "body": "This is so very helpful, especially the piece on the drs helping the support system learn how to be a good support. I deeply appreciate your transparency and willingness to be detailed. 🤗\nI am definitely taking all of this into account while keeping in mind everyone is different. \nI’m planning on opening that conversation tonight if he’s open to having it and if not I’ll try again soon. \n\nMany thanks friend",
      "created_utc": 1643580802.0,
      "score": 2,
      "context": [
        {
          "id": "hsg91op",
          "author": "thenemesissss",
          "body": "as someone that struggles with disordered eating and has a very caring fiancé. i could share some things my fiancé does with me. so my fiancé was in the room when my weight was mentioned through drs of them expressing concern so she became latched onto the idea of helping me get better. she’s had friends that have struggled with eds so i guess it was much easier for her to handle me. the biggest thing she did was help me with meal plans. which consisted of smaller meals and also bringing protein smoothies into the mix of things. if i ever appeared to be getting fixated on anything, she would usually catch on and actually not even mention it. her thing she likes to do is talk to me about something interesting. something she knows i’ll pay attention to instead of overthinking. then with any form of fear foods, she would help me through them by eating with me. no matter how long it took. she has always been patient with me. when i started putting on weight, she wouldn’t acknowledge it unless if i said something myself. there was points where i would literally stare at myself and find things to nitpick at myself about but she prevented that. she caught on to me living in baggy clothes would help so she would sometimes just put me in one of her hoodies and sweatpants. which would definitely be big on me with her being taller than me but it took my mind off of that. as i’ve gotten mentally better, she did eventually start to acknowledge it but as “happy weight” since my mental health was obviously improving itself. she would be there for me through my therapy sessions and everything too. for me, i sort of had to stay in supervision with drs. like i was able to be at home with her but like there was constant dr appointments mostly because she wanted to just make sure everything is okay internally. which helped me a lot since i do battle with health anxiety also. another thing that really helped me that she did was that she would allow “bad days” with food but she would make sure i didn’t make it a habit. basically that i wasn’t falling backwards. which is something she honestly has remained passive aggressive about but i know i understand where it’s coming from. only wouldn’t recommend that since your girlfriend appears a little fragile at the moment. it’s been a little over 4 months of me taking recovery seriously and it’s actually been somewhat good. i tend to feel a lot more confident in it alone from being in her care bc i know she will catch me if i fall backwards. so the best thing i could say about this, just be a safe space for her. communication can really help through this part. learning what she’s sensitive about and what is okay to talk about can really help. if she ever does come off as “stubborn” don’t take it personally. it is usually the guilt trip that comes with it, especially if she is very self aware that something isn’t right. just simply being there can help. \n\ni wish you guys the best! ❤️",
          "created_utc": 1642050981.0
        },
        {
          "id": "huuzh9c",
          "author": "stripedcicada",
          "body": "Hi there! I’ve been reading a bunch of posts trying to learn how to help my bf of 2yrs. May I ask, did your fiancé approach the conversation with you by asking what topics were off limits?",
          "created_utc": 1643555952.0
        },
        {
          "id": "huv8sld",
          "author": "thenemesissss",
          "body": "not exactly, that’s only because me and her always been extremely transparent. like that was always apart of us. when it came down to my eating disorder, there wasn’t really much said, it was just the whole “you need to get better and i’m here for you” because her thing was for me to understand i’m not about to go through it alone. there was only like one time she triggered me, unintentionally, she was trying to be happy about weight i put on. i spoke to her about it and haven’t had a problem since, she learned to express happiness about it without being too direct with what’s going on. i also had a journey of kind of figuring out what even caused my eating disorder to get so bad, pinpointing triggers basically. a lot of it had to do with the environment i was in during high school so there’s not really a way that will happen again. there wasn’t much for her to say, other than getting the help that i need to fully recover. there are some points where she’s learned to dial back the passive aggressive thing, usually on my not so great days, she’s learned to become comforting in that manner. i’ve been slowly not having to be fully dependent on her, if that makes sense? for me in the beginning i had zero hunger signals so i used to have to depend on her to remind me to eat something small basically every hour. now i’m starting to get more into intuitive eating instead of having to plan all the time. \n\ndefinitely talk to them about everything, if you can. it’s important to understand the person specifically instead of a bigger base because everyone is different. some people are more sensitive, some are not. i know for me and my wife, we’ve just always had transparency and deep conversations apart of our friendship that eventually led into the romantic relationship we started. \n\nsome of the basic things are usually to not mention weight, how their body physically looks, how much they’re eating, those kind of things. i know you may not mean any harm, because my wife used to do the same, but in the brain of a person with an ed, it triggers the little voice in our heads to just completely stop. we are usually overwhelmed with the thought of food, which is why my wife specifically has actually taught me how to just mindlessly eat by having me engaged in conversations with her. it’s not going to be perfect but it’s definitely something to try. those are just usually some of the normal off limit kind of things that tend to be more universal but definitely talk to them so you can know what harms them personally.",
          "created_utc": 1643559712.0
        },
        {
          "id": "huvkjn0",
          "author": "stripedcicada",
          "body": "Thank you so much for your response, i really want to have a similar approach, in the sense of partnership through this journey. I brought it up previously in a “I’m concerned and I love you” kind of way, he basically said he already knew he had a problem before I brought it up and has already “solved it” which was not true he just became (what he thought was) better at concealing it. Now it has gone much farther and I want to help if he’ll let me. \n\nThank you again for responding, wishing you and your wife the best!",
          "created_utc": 1643564223.0
        },
        {
          "id": "huw0s6o",
          "author": "thenemesissss",
          "body": "you’re welcome :) i’m sure you simply caring is enough itself. i did figure out my wife did have her suspensions about my eating habits but basically had no clue how to approach it. so the irony of me seeing drs for other things and having my GP at the time push recovery, it sort of helped her figure out how to go about it. i was personally given the chance to recover on my own since they could tell my wife would keep me on top of it. there are days i’ll get upset with her but she knows to not take it personally. it’s usually just me being frustrated with myself. it did eventually get to the point where i’d need some guidance from people like dietitians and people in that realm. along with my therapist i’ve already had for the last couple years, really helped guide my wife as a supportive s/o. so if it ever gets to that point, those drs can definitely help with guidance as a support system. \n\nin the meantime, could possibly just help slowly gear them onto the path of recovery. see if they could possibly try it on their own, it’s completely okay if they can’t. that’s why we have drs that specialize in eating disorders. just remember tho, they have to want it for themselves. so possibly help them find reasons to recover and have them remember those things in the back of their mind. definitely just try to focus on the mental part because i’ve realized once you have that motivation mentally, it can keep you pushing through any physical things. since eating disorders are a mental disorder that causes physically effects to the body. \n\nthank you! i wish you and your s/o the best too! ❤️",
          "created_utc": 1643570377.0
        }
      ]
    },
    {
      "id": "huxhavg",
      "author": "thenemesissss",
      "body": "you’re welcome!! i hope it’ll all get better eventually❤️",
      "created_utc": 1643590244.0,
      "score": 1,
      "context": [
        {
          "id": "hsg91op",
          "author": "thenemesissss",
          "body": "as someone that struggles with disordered eating and has a very caring fiancé. i could share some things my fiancé does with me. so my fiancé was in the room when my weight was mentioned through drs of them expressing concern so she became latched onto the idea of helping me get better. she’s had friends that have struggled with eds so i guess it was much easier for her to handle me. the biggest thing she did was help me with meal plans. which consisted of smaller meals and also bringing protein smoothies into the mix of things. if i ever appeared to be getting fixated on anything, she would usually catch on and actually not even mention it. her thing she likes to do is talk to me about something interesting. something she knows i’ll pay attention to instead of overthinking. then with any form of fear foods, she would help me through them by eating with me. no matter how long it took. she has always been patient with me. when i started putting on weight, she wouldn’t acknowledge it unless if i said something myself. there was points where i would literally stare at myself and find things to nitpick at myself about but she prevented that. she caught on to me living in baggy clothes would help so she would sometimes just put me in one of her hoodies and sweatpants. which would definitely be big on me with her being taller than me but it took my mind off of that. as i’ve gotten mentally better, she did eventually start to acknowledge it but as “happy weight” since my mental health was obviously improving itself. she would be there for me through my therapy sessions and everything too. for me, i sort of had to stay in supervision with drs. like i was able to be at home with her but like there was constant dr appointments mostly because she wanted to just make sure everything is okay internally. which helped me a lot since i do battle with health anxiety also. another thing that really helped me that she did was that she would allow “bad days” with food but she would make sure i didn’t make it a habit. basically that i wasn’t falling backwards. which is something she honestly has remained passive aggressive about but i know i understand where it’s coming from. only wouldn’t recommend that since your girlfriend appears a little fragile at the moment. it’s been a little over 4 months of me taking recovery seriously and it’s actually been somewhat good. i tend to feel a lot more confident in it alone from being in her care bc i know she will catch me if i fall backwards. so the best thing i could say about this, just be a safe space for her. communication can really help through this part. learning what she’s sensitive about and what is okay to talk about can really help. if she ever does come off as “stubborn” don’t take it personally. it is usually the guilt trip that comes with it, especially if she is very self aware that something isn’t right. just simply being there can help. \n\ni wish you guys the best! ❤️",
          "created_utc": 1642050981.0
        },
        {
          "id": "huuzh9c",
          "author": "stripedcicada",
          "body": "Hi there! I’ve been reading a bunch of posts trying to learn how to help my bf of 2yrs. May I ask, did your fiancé approach the conversation with you by asking what topics were off limits?",
          "created_utc": 1643555952.0
        },
        {
          "id": "huv8sld",
          "author": "thenemesissss",
          "body": "not exactly, that’s only because me and her always been extremely transparent. like that was always apart of us. when it came down to my eating disorder, there wasn’t really much said, it was just the whole “you need to get better and i’m here for you” because her thing was for me to understand i’m not about to go through it alone. there was only like one time she triggered me, unintentionally, she was trying to be happy about weight i put on. i spoke to her about it and haven’t had a problem since, she learned to express happiness about it without being too direct with what’s going on. i also had a journey of kind of figuring out what even caused my eating disorder to get so bad, pinpointing triggers basically. a lot of it had to do with the environment i was in during high school so there’s not really a way that will happen again. there wasn’t much for her to say, other than getting the help that i need to fully recover. there are some points where she’s learned to dial back the passive aggressive thing, usually on my not so great days, she’s learned to become comforting in that manner. i’ve been slowly not having to be fully dependent on her, if that makes sense? for me in the beginning i had zero hunger signals so i used to have to depend on her to remind me to eat something small basically every hour. now i’m starting to get more into intuitive eating instead of having to plan all the time. \n\ndefinitely talk to them about everything, if you can. it’s important to understand the person specifically instead of a bigger base because everyone is different. some people are more sensitive, some are not. i know for me and my wife, we’ve just always had transparency and deep conversations apart of our friendship that eventually led into the romantic relationship we started. \n\nsome of the basic things are usually to not mention weight, how their body physically looks, how much they’re eating, those kind of things. i know you may not mean any harm, because my wife used to do the same, but in the brain of a person with an ed, it triggers the little voice in our heads to just completely stop. we are usually overwhelmed with the thought of food, which is why my wife specifically has actually taught me how to just mindlessly eat by having me engaged in conversations with her. it’s not going to be perfect but it’s definitely something to try. those are just usually some of the normal off limit kind of things that tend to be more universal but definitely talk to them so you can know what harms them personally.",
          "created_utc": 1643559712.0
        },
        {
          "id": "huvkjn0",
          "author": "stripedcicada",
          "body": "Thank you so much for your response, i really want to have a similar approach, in the sense of partnership through this journey. I brought it up previously in a “I’m concerned and I love you” kind of way, he basically said he already knew he had a problem before I brought it up and has already “solved it” which was not true he just became (what he thought was) better at concealing it. Now it has gone much farther and I want to help if he’ll let me. \n\nThank you again for responding, wishing you and your wife the best!",
          "created_utc": 1643564223.0
        },
        {
          "id": "huw0s6o",
          "author": "thenemesissss",
          "body": "you’re welcome :) i’m sure you simply caring is enough itself. i did figure out my wife did have her suspensions about my eating habits but basically had no clue how to approach it. so the irony of me seeing drs for other things and having my GP at the time push recovery, it sort of helped her figure out how to go about it. i was personally given the chance to recover on my own since they could tell my wife would keep me on top of it. there are days i’ll get upset with her but she knows to not take it personally. it’s usually just me being frustrated with myself. it did eventually get to the point where i’d need some guidance from people like dietitians and people in that realm. along with my therapist i’ve already had for the last couple years, really helped guide my wife as a supportive s/o. so if it ever gets to that point, those drs can definitely help with guidance as a support system. \n\nin the meantime, could possibly just help slowly gear them onto the path of recovery. see if they could possibly try it on their own, it’s completely okay if they can’t. that’s why we have drs that specialize in eating disorders. just remember tho, they have to want it for themselves. so possibly help them find reasons to recover and have them remember those things in the back of their mind. definitely just try to focus on the mental part because i’ve realized once you have that motivation mentally, it can keep you pushing through any physical things. since eating disorders are a mental disorder that causes physically effects to the body. \n\nthank you! i wish you and your s/o the best too! ❤️",
          "created_utc": 1643570377.0
        },
        {
          "id": "huwsmqs",
          "author": "stripedcicada",
          "body": "This is so very helpful, especially the piece on the drs helping the support system learn how to be a good support. I deeply appreciate your transparency and willingness to be detailed. 🤗\nI am definitely taking all of this into account while keeping in mind everyone is different. \nI’m planning on opening that conversation tonight if he’s open to having it and if not I’ll try again soon. \n\nMany thanks friend",
          "created_utc": 1643580802.0
        }
      ]
    }
  ]
}