{
  "id": "s5pr3w",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1642378452.0,
  "title": "Request: i finally confessed to my closest friends that i have an eating disorder",
  "selftext": "i finally confessed to my closest friends that i have an eating disorder. i told them one of my biggest fears would that people would watch my every move, watch what i eat, watch when i go to the bathroom, etc. once they knew what was going on. they asked how they can support me because i don't want attention, so i don't want to be constantly checked up on, but i also don't know what to tell them. i am wondering if other people can say what their friends/family did that was helpful during their recovery.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/s5pr3w/request_i_finally_confessed_to_my_closest_friends/",
  "score": 42,
  "num_comments": 4,
  "comments": [
    {
      "id": "hsz5osf",
      "author": "trashman_12",
      "body": "First of all, congratulations for taking the leap! It took me years to mention having an ED to any of my friends, but it felt really good to do it. Just like you I was concerned about monitoring and definitely didn't want that. I'm not sure how old you are but I talked with my friends about telling me if it seemed to them like I was spiralling (e.g. drinking or smoking way more than usual, going out a lot etc) as this often went hand in hand with relapse. I also mentioned to them that usually I won't reply to group chat messages around weight/weight loss/gym/diet (theirs, not my own) and not to take offence but it's just something I'm uncomfortable with.",
      "created_utc": 1642380986.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ht02ygj",
      "author": "Alexwinner15",
      "body": "Good job homie👏 i promise they want to help you  so please be honest with them. Happy to see others reaching out like I did",
      "created_utc": 1642395849.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ht0crhm",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1642401609.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hsyzj98",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1642378452.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ht2y55l",
      "author": "Blackkqueen",
      "body": "What I can say, You have most likely an ED. If Your partner is not a psychologist, don't let him determine Your diagnose! Your ED seems like binge-restrict cycle one. Good luck and stay strong!",
      "created_utc": 1642450541.0,
      "score": 2,
      "context": [
        {
          "id": "ht0crhm",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1642401609.0
        }
      ]
    }
  ]
}