{
  "id": "saqxin",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1642934412.0,
  "title": "Request:Has anyone else damaged the way their body can handle food?",
  "selftext": " \n\nI (19) had/have bulemia and BED and since I've been trying to eat more recently because I've been going to the gym and can't make progress without protein and such but I just can't eat the same as pre Ed without feeling ill.\n\nI can't eat anything or drink anything without being noticeably bloated, literally a glass of water and you can already see it from what I look like first thing in the morning.\n\nWhen I eat I can't eat much without getting full, today I had a bagel and my brain really wanted another one because I wasn't satisfied but my stomach already hurt from just that and I couldn't eat anything else despite wanting to.\n\nDoes anyone know if this will be like this forever and I've just got to try and adapt/ build up the amount I eat?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/saqxin/requesthas_anyone_else_damaged_the_way_their_body/",
  "score": 69,
  "num_comments": 26,
  "comments": [
    {
      "id": "htv8viq",
      "author": "edensrotting",
      "body": "for me, it feels like food takes too much to digest and i feel uncomfortably full for a long time, as if the food was stuck together inside of my stomach",
      "created_utc": 1642935749.0,
      "score": 26,
      "context": []
    },
    {
      "id": "htw7rpd",
      "author": "None",
      "body": "I’m 32 and have had bulimia for 17 years (mostly recovered now) and I tend to eat pretty slow. I always take home leftovers and try to graze throughout the day to help with feeling bloated because that triggers me (even water). Might be helpful? Of course if you are able to I’d talk to a doctor.",
      "created_utc": 1642954815.0,
      "score": 14,
      "context": []
    },
    {
      "id": "htwbcoz",
      "author": "Ev_Do_",
      "body": "Hi! I was actively bulimic for about 11 and have been binge/purge free for the past 4 years… it took my digestive system a while to recover- as in not feeling bloated/gassy/excessively full after eating. Seeing a nutritionist who specialized in ED recovery was super helpful for me to understand the science/physiology behind my body healing and what to expect, and the healing process. They also helped me with making a game plan for how/when to eat and how to get back to intuitive eating over time. If you have access/funds to get counseling, and/or see a Ed nutritionist, I highly recommend it! \nWishing you the best and know that you can and will heal! You aren’t broken. Your body isn’t broken. It just takes time. 🧡\nEdit: Also- I recommend not looking at yourself in the mirror too much… it can really exacerbate the feeling of being too full- especially in reference to you saying you can see a difference with drinking a glass of water… for a while I only had mirrors where I could see my face, and not my whole body. It helped me get away from fixating on how I thought I looked, and move towards noticing how my body felt/how I felt in my body.",
      "created_utc": 1642956217.0,
      "score": 12,
      "context": []
    },
    {
      "id": "htwa5zq",
      "author": "yalocalcrackhead",
      "body": "I (18f) have been in recovery for over a year but I’ve massively screwed up my GI tract. I can’t eat too much at one time or I physically won’t be able to keep it in (I get stomach cramps and horrible loose stool, I think I gave myself IBS). \nWhat I do is I eat several tiny meals throughout the day as opposed to two or three big meals. It’s been working for me so far :)",
      "created_utc": 1642955755.0,
      "score": 12,
      "context": []
    },
    {
      "id": "htwwu56",
      "author": "None",
      "body": "Get tested for gastroparesis! I was diagnosed in 2018 because I was having the same symptoms as you. The best way to overcome gastroparesis is to eat as regularly as possible. It’s difficult and I understand that you have to honor when you’re not feeling good, but try to get meals/snacks in as regularly as possible.",
      "created_utc": 1642964463.0,
      "score": 8,
      "context": []
    },
    {
      "id": "htw7l38",
      "author": "Eastern_Low6498",
      "body": "After starving myself for so long I cant feel hunger anymore.",
      "created_utc": 1642954742.0,
      "score": 14,
      "context": []
    },
    {
      "id": "htwbd8g",
      "author": "barbarapleon",
      "body": "Yes, this also happened to me and boy was it a real pain. It will get better, but, if you have the chance maybe ask a doctor about some medications for gastric protection and for booating. Your stomach might be a bit damaged and it’s definitely very sensitive right now so they might also tell you to avoid certain things that might irritate your stomach, such as spicy dishes or overly greasy stuff, also garlic and legumes can cause bloating. Definitely try to keep up going to the gym, this is what has helped me most for opening up my appetite, and helps me eat a lot more now. Also drink enough water because that will help with bloating and to have better digestion. Avoid high sodium intake because it might lead you to fluid retention. Try spreading your caloric intake throughout your day in small meals so you do not feel so full but still eat healthy amounts. I’m not going to lie, it’s a tough process but it will get better.",
      "created_utc": 1642956224.0,
      "score": 3,
      "context": []
    },
    {
      "id": "htwujzs",
      "author": "kimmy23-",
      "body": "It’ll get better if you just keep eating when you’re hungry. Stop eating when you feel full. I’m on a similar journey and I eat many many times throughout the day, but never a lot at once. But it slowly has gotten better and I’ve noticed my hunger cues have improved.",
      "created_utc": 1642963575.0,
      "score": 3,
      "context": []
    },
    {
      "id": "htxpjgm",
      "author": "None",
      "body": "same. i have gastroparesis, ibs, and pots and i think the cause is my ED. my stomach gets full to the point of sickness before i ever feel full. it takes me days to have a BM. or it runs right through me. i vomit involuntary frequently. if i get hot it exacerbates my stomach problems and i throw up. anything i eat or drink makes me extremely bloated, especially if it’s wheat or pasta. only bonus is that i rarely if ever feel hungry. \n\nprobiotics help. drinking water helps. eating small amounts frequently helps. it hurts but the more you eat the more your body gets used to eating.",
      "created_utc": 1642975554.0,
      "score": 3,
      "context": []
    },
    {
      "id": "htxrujo",
      "author": "deathpotato24",
      "body": "I've been recovered for a year now, still whenever I eat I hiccup after almost every meal, despite eating slowly. Sometimes if I eat too much I have to fight with my body not to throw up. Not because Im making myself, but because my body starts to reject the food, and tries to throw it up. It's an inconvenience, but after a year I've just gotten used to it and it doesn't really bother me since I know how to deal with it.",
      "created_utc": 1642976446.0,
      "score": 3,
      "context": []
    },
    {
      "id": "htxwgac",
      "author": "updown27",
      "body": "You're going through refeeding. It's extremely uncomfortable. I highly suggest seeking guidance from a professional ED therapist and dietician. There are clinics all over the country that can do virtual therapy to help you get through this difficult period. It gets better but it's tough to force yourself through the healing process without help.",
      "created_utc": 1642978185.0,
      "score": 3,
      "context": []
    },
    {
      "id": "htyrc6z",
      "author": "None",
      "body": "I'm 26, been in recovery since I was 20, and my GI tract is pretty messed up. I already had IBS before but since starting recovery I started having pain basically every time I ate. After a lot of doctors visits, I found a medication that worked for me when I was 22 and have been taking it almost every day since then. I still hope to eventually be able to go off it, though, and in the past few months I was at least able to decrease my dose from 3 pills a day to 2. It's really frustrating to feel like my illness might have permanently affected my health but there's not really much I can do besides take care of myself and hope that it will improve over time.",
      "created_utc": 1642990722.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hvex2q0",
      "author": "Intrepid-Committee11",
      "body": "Am just starting All-In after 25 years of bulimia and anorexia. I’m 40 years old. It’s challenging to eat so much, but my appetite increases every day I feed it. When I’m too full I take a shot of apple cider vinegar. REALLY helps with digestion. (Dilute with water or take pill form). And I take probiotics daily. Still bloated, but it’s supposed to pass in time. The ACV helps keep me from having a rock of food in my stomach, helps break it down, and relieves heartburn (I know it seems counterintuitive, but it truly feels like a miracle) I’m not a doctor, but this has helped me immensely. Also, I’m eating and craving lots of processed foods. It’s imperative in recovery to go for the processed versions bc it’s easier to digest…another challenge for my ED brain, but it’s helped so much.",
      "created_utc": 1643892994.0,
      "score": 3,
      "context": []
    },
    {
      "id": "htye4y9",
      "author": "AnaDion94",
      "body": "I go from fine to starving with very little in between. And I think my digestive system is fucked because I now get awful random bouts of gas at night that feel like I’m being stabbed in the torso. \nEDs definitely take a toll on the body.",
      "created_utc": 1642985196.0,
      "score": 2,
      "context": []
    },
    {
      "id": "htyed35",
      "author": "Prestigious-Menu",
      "body": "It definitely takes time to get better but it DOES get better, I promise. I do still have some stomach issues (functional dyspepsia) but that popped up tears after I was in recovery so I’m not sure if it’s related.",
      "created_utc": 1642985293.0,
      "score": 2,
      "context": []
    },
    {
      "id": "huayjq3",
      "author": "HardlyAnyHoney",
      "body": "I  wasn't bulimic but I did stop eating for a while and after recovering I couldn't eat like I used to, stomach got full fast, I was always bloated and in pain. I got a stomaching emptying test done they said  I had slight gastroparesis nothing too extreme. During the test they give you eggs or oatmeal that are radioactive they then take pictures every half hour or so to measure how long it takes your body to digest the food.  What you are describing is exactly how I felt so I highly recommend you speak to your doctor about maybe getting a stomach emptying test done.  I should also note this was over 2 years ago for me and I am able to eat almost like I use to more than I was able to when I was recovering sometimes gastroparesis is temporary but I am not a doctor. Anyway good luck :)",
      "created_utc": 1643211016.0,
      "score": 2,
      "context": []
    },
    {
      "id": "htv74on",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1642934413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hu2z7i1",
      "author": "None",
      "body": "i had that too. took a few years to figure it out again",
      "created_utc": 1643064622.0,
      "score": 1,
      "context": [
        {
          "id": "htw7l38",
          "author": "Eastern_Low6498",
          "body": "After starving myself for so long I cant feel hunger anymore.",
          "created_utc": 1642954742.0
        }
      ]
    },
    {
      "id": "htwv0f6",
      "author": "kimmy23-",
      "body": "Also I would definitely recommend seeing someone like a therapist about this problem if you haven’t already. Good luck to you!",
      "created_utc": 1642963754.0,
      "score": 1,
      "context": [
        {
          "id": "htwujzs",
          "author": "kimmy23-",
          "body": "It’ll get better if you just keep eating when you’re hungry. Stop eating when you feel full. I’m on a similar journey and I eat many many times throughout the day, but never a lot at once. But it slowly has gotten better and I’ve noticed my hunger cues have improved.",
          "created_utc": 1642963575.0
        }
      ]
    },
    {
      "id": "ifc9hz8",
      "author": "VvE8009",
      "body": "If the pain is on the right side under your ribs, especially if you ate someting hard, like an apple, it could be your stomach valve. I go to a homeopath, his drops make  80%of the pain go away in one day, it works. Ive been to dietitians, no help.",
      "created_utc": 1657286275.0,
      "score": 1,
      "context": [
        {
          "id": "htyrc6z",
          "author": "None",
          "body": "I'm 26, been in recovery since I was 20, and my GI tract is pretty messed up. I already had IBS before but since starting recovery I started having pain basically every time I ate. After a lot of doctors visits, I found a medication that worked for me when I was 22 and have been taking it almost every day since then. I still hope to eventually be able to go off it, though, and in the past few months I was at least able to decrease my dose from 3 pills a day to 2. It's really frustrating to feel like my illness might have permanently affected my health but there's not really much I can do besides take care of myself and hope that it will improve over time.",
          "created_utc": 1642990722.0
        }
      ]
    },
    {
      "id": "hud98jk",
      "author": "vpblackheart",
      "body": "Anorexia\n\nI have similar long-term issues. I am fine, but minutes later I feel as if I am starving. I take a few bites and I am so stuffed I can barely breathe.\n\nI no longer have \"bad\" foods but I do sometimes return to old coping diets.",
      "created_utc": 1643241142.0,
      "score": 2,
      "context": [
        {
          "id": "htye4y9",
          "author": "AnaDion94",
          "body": "I go from fine to starving with very little in between. And I think my digestive system is fucked because I now get awful random bouts of gas at night that feel like I’m being stabbed in the torso. \nEDs definitely take a toll on the body.",
          "created_utc": 1642985196.0
        }
      ]
    },
    {
      "id": "ifc9sqy",
      "author": "VvE8009",
      "body": "Try charcoal pills, little while before you eat. Probiotics great for daily use.",
      "created_utc": 1657286413.0,
      "score": 1,
      "context": [
        {
          "id": "htye4y9",
          "author": "AnaDion94",
          "body": "I go from fine to starving with very little in between. And I think my digestive system is fucked because I now get awful random bouts of gas at night that feel like I’m being stabbed in the torso. \nEDs definitely take a toll on the body.",
          "created_utc": 1642985196.0
        }
      ]
    },
    {
      "id": "hu6axyo",
      "author": "Eastern_Low6498",
      "body": "Did you get your hunger back? If so what did you do to?",
      "created_utc": 1643130487.0,
      "score": 1,
      "context": [
        {
          "id": "htw7l38",
          "author": "Eastern_Low6498",
          "body": "After starving myself for so long I cant feel hunger anymore.",
          "created_utc": 1642954742.0
        },
        {
          "id": "hu2z7i1",
          "author": "None",
          "body": "i had that too. took a few years to figure it out again",
          "created_utc": 1643064622.0
        }
      ]
    },
    {
      "id": "ifcj7kr",
      "author": "None",
      "body": "It's on the left typically but thanks",
      "created_utc": 1657290547.0,
      "score": 1,
      "context": [
        {
          "id": "htyrc6z",
          "author": "None",
          "body": "I'm 26, been in recovery since I was 20, and my GI tract is pretty messed up. I already had IBS before but since starting recovery I started having pain basically every time I ate. After a lot of doctors visits, I found a medication that worked for me when I was 22 and have been taking it almost every day since then. I still hope to eventually be able to go off it, though, and in the past few months I was at least able to decrease my dose from 3 pills a day to 2. It's really frustrating to feel like my illness might have permanently affected my health but there's not really much I can do besides take care of myself and hope that it will improve over time.",
          "created_utc": 1642990722.0
        },
        {
          "id": "ifc9hz8",
          "author": "VvE8009",
          "body": "If the pain is on the right side under your ribs, especially if you ate someting hard, like an apple, it could be your stomach valve. I go to a homeopath, his drops make  80%of the pain go away in one day, it works. Ive been to dietitians, no help.",
          "created_utc": 1657286275.0
        }
      ]
    },
    {
      "id": "hudap9n",
      "author": "AnaDion94",
      "body": "I find that eating more often, alternating light and heavier meals is the best way for me to make sure I’m eating enough during the day. Or lots of small portions just sort of scattered throughout the day. Also helps keep fear foods at bay because it’s hard to be afraid of anything if I’m only eating a bit at a time anyways.",
      "created_utc": 1643241743.0,
      "score": 2,
      "context": [
        {
          "id": "htye4y9",
          "author": "AnaDion94",
          "body": "I go from fine to starving with very little in between. And I think my digestive system is fucked because I now get awful random bouts of gas at night that feel like I’m being stabbed in the torso. \nEDs definitely take a toll on the body.",
          "created_utc": 1642985196.0
        },
        {
          "id": "hud98jk",
          "author": "vpblackheart",
          "body": "Anorexia\n\nI have similar long-term issues. I am fine, but minutes later I feel as if I am starving. I take a few bites and I am so stuffed I can barely breathe.\n\nI no longer have \"bad\" foods but I do sometimes return to old coping diets.",
          "created_utc": 1643241142.0
        }
      ]
    },
    {
      "id": "hu6dxem",
      "author": "None",
      "body": "Eventually yes. Took a long time to start to recognize it again, and the initial signs never had to do with my stomach. I'd be irritable or tired for no reason or I'd just feel \"off\". Eventually I'd start to get upset stomachs which I ended up realizing was hunger. It took years of regular mealtimes and forcing myself to eat even if I wasn't hungry. I started with safe foods, then tried to incorporate the occasional unsafe food (sugar free yogurts, stuff like that). I also used alcohol as an appetite stimulant (DO NOT DO THIS I BEG ANYONE READING IT RUINED MY LIFE IN DIFFERENT BUT EQUALLY TERRIBLE WAYS).",
      "created_utc": 1643131591.0,
      "score": 2,
      "context": [
        {
          "id": "htw7l38",
          "author": "Eastern_Low6498",
          "body": "After starving myself for so long I cant feel hunger anymore.",
          "created_utc": 1642954742.0
        },
        {
          "id": "hu2z7i1",
          "author": "None",
          "body": "i had that too. took a few years to figure it out again",
          "created_utc": 1643064622.0
        },
        {
          "id": "hu6axyo",
          "author": "Eastern_Low6498",
          "body": "Did you get your hunger back? If so what did you do to?",
          "created_utc": 1643130487.0
        }
      ]
    }
  ]
}