{
  "id": "sare5f",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1642936208.0,
  "title": "request: anyone else feel the atypical diagnosis of anorexia is a bit invalidating?",
  "selftext": " \n\nmaybe it's just me but. most mental illnesses don't require a physical symptom to diagnose? it makes you feel like you can't even justify recovery and I'm not sick enough to deserve it. atypical is such an unnecessary word and adds fuel to the fire for me.\n\ni had a psychiatrist tell me last week that my problems weren't that concerning because my bmi is normal, despite the large number of concerning things i was telling her about. i was left feeling completely invalidated and just not enough. even if its to do with treatment you don't have to be underweight to suffer physically and be at severe risk with malnutrition? idk. its a hard one. it's hard to try and convince myself to recover from a problem when I'm being told it's not a problem:(",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/sare5f/request_anyone_else_feel_the_atypical_diagnosis/",
  "score": 69,
  "num_comments": 12,
  "comments": [
    {
      "id": "htvsktq",
      "author": "None",
      "body": "I really think it’s a bad psychiatrist. He or She didn’t consult where your mind is at in all of this which is literally their job and they just looked at the numbers (bmi). You should definitely consider finding another one.",
      "created_utc": 1642948327.0,
      "score": 16,
      "context": []
    },
    {
      "id": "htx74ks",
      "author": "bbstrawb",
      "body": "I’m so sorry your psychiatrist said that. Unfortunately it’s not easy to find good ones nowadays :( I got an atypical anorexia diagnosis but I was reassured that it was taken just as seriously and that the treatment is the same, given regular blood tests and stuff because it really is life threatening no matter your BMI.",
      "created_utc": 1642968515.0,
      "score": 5,
      "context": []
    },
    {
      "id": "htxvqof",
      "author": "sandopsio",
      "body": "There are so many components to the illness and all are extremely serious, as it has such a high mortality rate and is difficult to treat. The psychological component should be taken seriously as well as the behavioral and physical effects. It concerns me that your psychiatrist does not seem educated when it comes to EDs. You absolutely deserve treatment, specialized care and recovery.",
      "created_utc": 1642977910.0,
      "score": 3,
      "context": []
    },
    {
      "id": "htz2kto",
      "author": "Sad-Parsnip9728",
      "body": "When i was in this eating disorder program i was the only bulimic there, i made a friend who was anorexic but had binging episodes. Still they diagnosed her with ana. So i agree, It is invalidating to call anorexia atypical when the person isn’t underweight. I understand where you’re coming from. And your psychiatrist sucks balls.",
      "created_utc": 1642995213.0,
      "score": 3,
      "context": []
    },
    {
      "id": "htx4b24",
      "author": "paninihead97",
      "body": "They shouldnt have said that, my ED was raging much more and I suffered more at higher bmis than at lower bmis. Weight is just a manifestation, the suffering needs to be treated",
      "created_utc": 1642967412.0,
      "score": 5,
      "context": []
    },
    {
      "id": "htzch0h",
      "author": "cjx888x",
      "body": "I think it’s a common struggle with ED. Usually more from friends/family than doctors though- sorry you dealt with someone who didn’t make you feels good about the situation. Honestly, the DSM diagnostic stuff can make most people feel like shit in the right situation. They are, after all, labels. And labels that some random person is throwing at us based on very little info. \n\nDon’t let yourself believe you aren’t sick enough to deserve treatment. You wouldn’t have been bothered by this if your gut didn’t already tell you that you need/deserve it.",
      "created_utc": 1642999927.0,
      "score": 2,
      "context": []
    },
    {
      "id": "htzek61",
      "author": "WorkingBackground471",
      "body": "My shrink and so many others have labeled my eating habits many things. I just like to stick to “ED” or “my eating disorder” .. you don’t need a doctor to validate what you and they know is unhealthy behavior. Focus your attention on what you can manage about your eating disorder and probable recovery rather than a label for it if that’s possible for you. Part of ED behavior and what lies within, beneath, throughout an eating disorder is the possible feeling that you may never have felt validated in childhood, as a teen, at however old you were when it began through the now. Validate yourself and step out of the “diagnosis” box.",
      "created_utc": 1643001059.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hu3rsli",
      "author": "pr1ncessliz",
      "body": "That doctor is just encouraging it to become a bigger problem. Don’t let your eating disorder win. Recovery is so worth it",
      "created_utc": 1643079694.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hu5k0gb",
      "author": "kicalzzz",
      "body": "I am so so sorry that you had to hear that from your Psych. I 100% agree that the label is invalidating. I found that when I was at my highest weight I was struggling so much more than I was at my lowest. People can only really understand this when they've gone through it, but just remember that being labelled 'atypical' does not mean that you are struggling any less or don't deserve the same treatment as those with so-called \"typical\" EDs. Fuck the system honestly, its all bullshit",
      "created_utc": 1643119788.0,
      "score": 2,
      "context": []
    },
    {
      "id": "huda1xu",
      "author": "vpblackheart",
      "body": "If you can, select a new doctor. Your BMI has zero to do with an eating disorder. That is a huge misconception.🙄",
      "created_utc": 1643241478.0,
      "score": 2,
      "context": []
    },
    {
      "id": "htv9hzq",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1642936208.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i11rgfw",
      "author": "None",
      "body": "atypical is just different because it comes with some different physical symptoms. your psychiatrist is very insensitive for what they said, but please know it does not invalidate you. \n\nyou are enough and deserve to feel as such. your diagnosis doesn't mean you aren't sick, it just means you aren't the same sick as certain other people. those terms don't mean \"more\" or \"less\".  it's not important to compare yourself to them. there are different labels so everyone can be cared for. take care of yourself, and know we're here for you ♡",
      "created_utc": 1647540675.0,
      "score": 1,
      "context": []
    }
  ]
}