{
  "id": "siliz1",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1643798179.0,
  "title": "finally decided to drop calorie counting!",
  "selftext": "honestly, this is such a huge step for me. i'm genuinely so excited to have food freedom again, and for someone who has been tracking for the past 2-3 years, i'm so proud of myself for doing this. it's so hard to do, because i feel like i have all the calories of everything memorized, but i think that in time, i will be able to forget them altogether, and i cannot wait for that day to come. in my experience, tracking calories has only made me miserable and, as i went through a lot of extreme hunger, would only further trigger me and binge episodes, etc, even though i know that recovery \"binges\" are a part of recovery. i hope someone can be proud of me :)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/siliz1/finally_decided_to_drop_calorie_counting/",
  "score": 91,
  "num_comments": 17,
  "comments": [
    {
      "id": "hv9xgf2",
      "author": "adamwestforpresident",
      "body": "This is an amazing progress through recovery :) Food freedom is wonderful, and you can be really proud of you! :)",
      "created_utc": 1643810067.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hv9xow7",
      "author": "mommacoty1",
      "body": "Congrats!! As someone who used MFP app for over a decade, and has now been in ED recovery for a year, I know how freeing it can be to stop tracking food.  It may take a little while, but you can get to a point where you stop mentally tallying calories or carbs anytime you have food in front of you. \nBe proud of yourself.  This is a huge step towards food freedom, which you deserve to have!",
      "created_utc": 1643810172.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hvara13",
      "author": "Maricellabella",
      "body": "Yes!! I refuse to do calorie counting or CICO (iirc)\n\nAs someone with Bulimia Nervosa it makes everything worse. I focused on eating foods high in protein and make me feel good after eating them. It's done wonders alongside casual weight lifting",
      "created_utc": 1643821690.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hvdh6x0",
      "author": "None",
      "body": "we are proud of you!!! that’s a major fkn step in food freedom. i dropped calorie counting some years ago and i could never go back. someone else here said that focusing on what foods satiate you and feel good  after eating was key for them in food freedom, and i totally agree\n\nanyway congratulations warrior<3",
      "created_utc": 1643859946.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hv9dh1l",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1643798179.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hvabwev",
      "author": "None",
      "body": "yay! good job :) super proud of you <3",
      "created_utc": 1643816029.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hvbbfzn",
      "author": "Ambystomatigrinum",
      "body": "Fantastic! This stranger is proud of you! Its a hard change, and it can be uncomfortable at first, but it really does feel so much better.",
      "created_utc": 1643829104.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hvbnn11",
      "author": "Noraaaahhhhnnn",
      "body": "I'm so proud of you!!",
      "created_utc": 1643833757.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hvcfbxg",
      "author": "Budget_Sir_8315",
      "body": "Congratulations",
      "created_utc": 1643844045.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hvd7ko0",
      "author": "VariousConflict5090",
      "body": "That was the beginning of recovery for me - it's tough but stick with it.",
      "created_utc": 1643855772.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hvjq69b",
      "author": "Michelleyes",
      "body": "How do you stop? I am ready to stop but it’s something I’ve done for a decade and I feel like one I’d have a mental break down and two I have mostly everything memorized. I want to take this step to freedom but idk how.",
      "created_utc": 1643972763.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hwgkc82",
      "author": "bowlingsloths",
      "body": "yay yay!! awesome progress!! major fucking progress",
      "created_utc": 1644550617.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hysbjfr",
      "author": "VegetasButt",
      "body": "This is good! When I was at my healthiest in my younger years, I didn't calorie count at all. I simply looked at ingredients and avoided processed foods and preservatives as much as I could, though not 100% of course. One day at a time, I felt a little better than the previous day and eventually it was effortless. I felt so clean inside and out.\n\nThe thing that made me fall back into old habits was being in a very toxic relationship, but I am working on recovering from it all again.\n\nCheers to you and hope you reach your goals!",
      "created_utc": 1646061633.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i1fsf3m",
      "author": "Pacinopiticinu123",
      "body": "Whether anyone responds im not sure but i wanted to voice my problems on here as this states that this is where i can express my thoughts, emotions and battle with ongoing binge eating disorder.\n\nWhen i was a kid i was quite chubby and i always loved sugar chocolates and cakes. I loved food and had no fear of any type. Last spring i decided to change for the better and try and attempt a \" healthy lifestyle \". I believed at first it was successful and in 3-4 months i was looking leaner than i had ever been and i loved the way i looked and as this was done over the period of the covid lockdown i felt i accomplished it with ease. I then thought i should carry on eating in a big deficit as my face would look better as id already started to get a chiseled Jaw and my face was looking very healthy. My mom had told me how proud she was and i was so proud of my self too. In the summer months i was so confident in myself. Then after the lockdown had ended i had started to see my friends in which i hadn't seen in 2 years and they were all shocked. \" you look so good \" \" how did you manage to transform ? \" they would say. I got compliments on my looks and body and  i loved every minute of it, of course i did after all i was always the chubby kid from school who was the one who wouldn't get any validation or attention from any person really. Then as the winter months came my mom started to say \" i think youve lost enough weight, stop now \" she would say this for a month and then thats when it became a problem i noticed i had become underweight but i would never admit it id carry on the deficit and then as October came i started to feel more and more hungry. This was when i developed a binge eating disorder a severe one that ive had from October 2021 to right this very day. Im a male currently 19 5'8 and weigh 9 stone 7 my body fat i dont know but ive definitely gained alot of the fat back on my lower belly and im suffering mentally. I want that good feeling back but i constantly binge heavily. I wanted to come on here as a last resort to help overcome this horrific cycle and i wanted to see if anyone can help me overcome it.",
      "created_utc": 1647803585.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i2h40hg",
      "author": "IcecreamCohn31",
      "body": "Same! Def understand the \"memorizing\" calories problem. But don't worry, stick with it long enough and you'll forget those numbers.",
      "created_utc": 1648495741.0,
      "score": 1,
      "context": [
        {
          "id": "hvd7ko0",
          "author": "VariousConflict5090",
          "body": "That was the beginning of recovery for me - it's tough but stick with it.",
          "created_utc": 1643855772.0
        }
      ]
    },
    {
      "id": "i2h5o6w",
      "author": "IcecreamCohn31",
      "body": "So for me, I used to actually write it out. I never kept track of it in an official way, but if you look at my old notebooks, in the margins are little math problems. Those were me tallying up my calories. First I stopped that.\n\nThen the hard part - when you have the calories memorized in your head. I practiced intuitive eating. For example, I would look at a PBJ sandwich and instantly know the calorie calculations in my head, but instead of fixating on it, I would focus instead on my stomach. I'd say a little mantra something like \"I need these nutrients to stay healthy and be able to go to ... \\[insert thing I was excited for\\].\"\n\nThe OTHER thing that helped me was actually baking! During my initial ED recovery, I got really into baking and actually took baking classes! I felt learning the art of baking and getting my hands dirty helped me appreciate the food more as an actual art form. So instead of focusing on the calories, I would simply enjoy my craft and the efforts of my labor. When I'd go to bakeries, I would look at trying the different baked goods as \"research\" to help me get better at baking. \n\nAnyways, different stuff works for different people, but for me what helped the most was wanting to be a part of my life again and using that as a motivator. Once you consciously stop counting calories it becomes a habit. I still struggle on and off again with my ED but ever since I stopped calorie counting I haven't started doing it again.",
      "created_utc": 1648496427.0,
      "score": 1,
      "context": [
        {
          "id": "hvjq69b",
          "author": "Michelleyes",
          "body": "How do you stop? I am ready to stop but it’s something I’ve done for a decade and I feel like one I’d have a mental break down and two I have mostly everything memorized. I want to take this step to freedom but idk how.",
          "created_utc": 1643972763.0
        }
      ]
    }
  ]
}