{
  "id": "sm2m47",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1644169461.0,
  "title": "How can you tell when a diet has slipped into an ED?",
  "selftext": " \n\nI’m 35 years old and I’ve been dieting on and off for the last 5 years. It started out as a positive thing for my health, because I’m a small framed woman (5 foot 2/157cm tall) and being at a higher weight was giving me knee pain.\n\nDieting “worked”: I hit a substantial weight loss goal, then moved my goal lower, and then lower again. The weight has stayed off, with a mild fluctuation here and there. Everything I’ve lost has been through restriction and periods of intense cardio. I use a food tracking app and find myself very wrapped up in the numbers each day.\n\nNow I’m at my lowest weight, still within a healthy range for my height, but I get a sensation of being out of control when I try to eat “normally” that is, not restricting. I’m craving the control of knowing precisely how much I’m eating at all times. It makes me feel safe, in a way I can’t really explain. I want to lose even more weight in order to hit some random number in my head then I’ll feel like I’m okay.\n\nDoes this sound like an ED? Feeling like a bit of a mess to be honest.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/sm2m47/how_can_you_tell_when_a_diet_has_slipped_into_an/",
  "score": 48,
  "num_comments": 11,
  "comments": [
    {
      "id": "hvu56cm",
      "author": "Square-Opportunity30",
      "body": "Hello - there is a bit of a difference in \"disordered- eating\" vs an \"eating disorder\" - a lot more people engage in disordered eating than having an eating disorder. I am hearing that you are feeling concerned. I am wondering if you've thought about connecting with a therapist and or a registered dietician (they often are most knowledagable about EDs).   \n\n\nI hear you feeling out of control...i am curious what is the fear regarding eating for joy? is it being afraid of weight gain? and if u gain a bit weight - whats ur narrative around it.   \n\n\nwe know developmentally our weight tends to fluctuate. I am also curious how do you think ur life would be different when you hit that goal weight?   \n\n\nI feel that u r posting here cuz u r feeling that maybe u r at a point it might be a good idea to talk to somebody about this...what r the therapeautic resources like in ur community?",
      "created_utc": 1644170086.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hvugdm1",
      "author": "None",
      "body": "> “I get a sensation of being out of control when I eat “normally” that is, not restricting.  I’m craving the control of knowing precisely how much I’m eating at all times. It makes me feel safe, in a way I can’t really explain.  I want to lose even more weight in order to hit some random number in my head then I’ll feel like I’m okay.”\n\nLet’s be clear I am not a professional, but it sounds like this is disordered eating. When I was underweight, I had the exact same feelings and did those exact same things. I can definitely relate to what you’re saying, and that was when I was at my lowest place mentally.\n\nSeems like people can stop diets when the diet is over. Disordered eating may start that way, but is much more difficult to stop than a regular diet.\n\nI wish you all the best ❤️\n\nIf at all possible, sounds like a bit of therapy might be appropriate to help you out of this. No matter how much you weigh or how you look, you’re worthy",
      "created_utc": 1644174524.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hvvtpqh",
      "author": "-317",
      "body": "This is very very similar to the way my ED started. If these eating habits have become obsessive and life interfering, then it might be a disorder. My advice would be to talk to a professional about your concerns. They can help you sort through things and get some more clarity on the severity of the situation.",
      "created_utc": 1644195170.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hvzx3yu",
      "author": "justanewbiehereonred",
      "body": "There are many things to say but one basic is : is it obsessive? Is it taking too much space on your brain ? Is it the biggest, or a very big part of ur life ? If so, look into it",
      "created_utc": 1644269538.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hvu3liu",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1644169463.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hzxo8ns",
      "author": "newportz69",
      "body": "Honestly, if youre keeping strict track of your calories (like using an app) and keep moving your goal weight lower, i'd say your mindset is already unhealthy. you don't need to be an unhealthy weight to be mentally or physically unhealthy. bodies are unique and dont always align with what is socially or even academically accepted. i would (if possible ofc) try to reach out to a dietician (ONE WHO DOES NOT SHARE WEIGHT LOSS PLANS). if a dietician or therapist ever recommends moderation ( as in 'you can have one cookie') or talks about their own body, thats a huge red flag. good luck and feel free to reach out!",
      "created_utc": 1646801074.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i1fo3ar",
      "author": "Crunchysuds",
      "body": "My metric was when I couldn't stop. My diets turned into ed behaviour when I realised I couldn't go back to eating like I did before the diet. I absolutely couldn't deviate from the diet anymore even if I wanted to. That's how I knew.",
      "created_utc": 1647801726.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i1kv0on",
      "author": "desconocio84",
      "body": "When you have anxiety attacks from failing the diet. If you missed a step or fucked up once and you are calculating how many kalories (aka: fat you are going to add) you are adding because of it it's an eating disorder.",
      "created_utc": 1647896387.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i1rnvz2",
      "author": "the_green_python",
      "body": "Definitely sounds like disordered eating. I wonder if there are changes you can make to feel comfortable while not jeopardizing your health. If the thought of unrestricted eating scares you, it might be a good idea to set a higher calorie goal to sustain your weight. That way, you aren't giving up that control, but the boundaries are healthy.\n\nAnother thing that has helped me is setting a healthy acceptable weight range. If I drop below a certain weight, I really try to gain it back. Tricks for getting the calories: eating high calorie snacks, drinking meal replacement shakes.\n\nOther advice about seeing professionals is best if possible. Just thought I'd offer some alternative solutions.",
      "created_utc": 1648020577.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i24re5m",
      "author": "DetroitVeganGirl",
      "body": "Wow this is how I feel and we are the same age and height",
      "created_utc": 1648252016.0,
      "score": 1,
      "context": []
    }
  ]
}