{
  "id": "sm2our",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1644169657.0,
  "title": "how do i stop myself from relapsing in college, where no one is willing to admit they have an ed",
  "selftext": "long story short, i was severely under weight first years of high school and worked very hard to fight the habits and put the weight back on. i was finally at a good place when i graduated high school. first year at college and this is so hard. everyone skips meals or only eats incredibly small portions. it makes me anxious togo and eat by myself so when they skip meals i skip meals. i never finish my plate because they all had much less than i did. i feel myself slipping back into old habits and i don’t know how to stop it. i want to be health and i want to have a good relationship with food, but it is so hard because it feels like i’m the only one trying. i need literally any advice anyone has to offer.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/sm2our/how_do_i_stop_myself_from_relapsing_in_college/",
  "score": 74,
  "num_comments": 7,
  "comments": [
    {
      "id": "hvyotej",
      "author": "hurrduhhurr",
      "body": "You have to resolve in your heart that you are on your own path. Not anybody else's. It doesn't matter what they're doing. And I know first hand how difficult that is. The thing that made the biggest difference for me in recovery I learned to implement from my therapist is \"opposite actions\". So the opposite of what your ED voice tells you. You will feel like crap, but you have to do it anyway if you want to get better.  What are your reasons for recovery? List them. Repeat them in your head. If you know it is taking you to a bad place by following what others are doing, LISTEN to that little voice and do the opposite. You may be the one to help them with recognizing their own problem with food.\n\nXx",
      "created_utc": 1644252361.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hvu434c",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1644169658.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hzxnn2y",
      "author": "newportz69",
      "body": "hey, my ed went insane when i got to college, so i understand the struggle. i would make friends who are turly there for you. its gonna take time and shit, but i have the most supportive friends someone could ask for now. also, be honest. honesty has helped me sosososososososo much with staying accountable with my mental health. AND REMEMBER: this is a mental disorder, not a physical one; you don't know what everyone is eating when youre not with them, you dont know how people perceive you, and you arent always conscious of what is the ed talking or not. ive been thru it all so feel welcome to reach out to me or respond. i totally have ur back",
      "created_utc": 1646800750.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i024b7r",
      "author": "Its0hs0qui3t",
      "body": "I relapsed when I went to college. Ive been trying to develope better habits. Im the same way where I need to eat with someone, most of the time ur classes will line up with your friends so you will always have someone to eat with, atleast in my case. I eat alot of protien bars and im starting to try and do protien shakes as well. I also always have safe foods in my dorm so if im to anxious to eat I have something to eat that wont make me upset.",
      "created_utc": 1646880373.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i0wv6ds",
      "author": "None",
      "body": "They’re stressed. It’s not because they’re healthier than you.",
      "created_utc": 1647453655.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i1245lr",
      "author": "IngeSullwald",
      "body": "They might be eating small meals…but how many calories are those meals (and snacks)? They might be eating sweets and stuff you don’t know about. You are your own journey! Don’t ever feel like you’re not doing enough because the fact that you posted this means you are trying much harder that most people",
      "created_utc": 1647545568.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hwtgfzt",
      "author": "BuenosAiresBurp",
      "body": "that is such a good advice.  \nI think It is part of ones journey to learn not to compare.  \nI started university at 30, in something that most people are very focused on achieving really well at. This are mainly girls that are 10 years younger, very smart and motivated and many of them very skinny (as well as other aspects important for beauty standards).   \nI felt really bad for some time because I felt i lack a lot of everything.   \nBut then I stopped comparing. Everyone has ones own journey and past, good and bad. I know it is so much more than this, but I lived with these thoughts most of my life and I got really tired, lol.    \n\n\nBe you, you´ll be fine. Life is good, don´t waste it on such draining things.",
      "created_utc": 1644782456.0,
      "score": 4,
      "context": [
        {
          "id": "hvyotej",
          "author": "hurrduhhurr",
          "body": "You have to resolve in your heart that you are on your own path. Not anybody else's. It doesn't matter what they're doing. And I know first hand how difficult that is. The thing that made the biggest difference for me in recovery I learned to implement from my therapist is \"opposite actions\". So the opposite of what your ED voice tells you. You will feel like crap, but you have to do it anyway if you want to get better.  What are your reasons for recovery? List them. Repeat them in your head. If you know it is taking you to a bad place by following what others are doing, LISTEN to that little voice and do the opposite. You may be the one to help them with recognizing their own problem with food.\n\nXx",
          "created_utc": 1644252361.0
        }
      ]
    }
  ]
}