{
  "id": "sm2t45",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1644169941.0,
  "title": "Does anyone else feel like eating disorders are similar to drug addictions? I feel like an addict with my ED",
  "selftext": " \\-my Ana got really bad one summer and I’m much better now but I feel like it’s always there and every now and then it creeps back up. Just like addicts can get clean but it doesn’t mean they’re no longer addicts. Even if they’re not drinking or using, they’re still thinking about it obsessively and struggling with it. - I have relapses -I feel so much guilt because I know I’m hurting my body by not giving it what it needs. I have self love and want to nourish, heal, and strengthen my body. But it’s hard when the Ana is there holding me back. Just like addicts know what they’re doing hurts them and maybe they want to get better but its not that easy.  \n\\-I feel like an outsider with it. Just like addicts say people on the outside don’t understand, I feel like people without ED’s don’t. It’s a whole other world.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/sm2t45/does_anyone_else_feel_like_eating_disorders_are/",
  "score": 367,
  "num_comments": 76,
  "comments": [
    {
      "id": "hvuanxx",
      "author": "Aggravating_Fly_7362",
      "body": "I agree. I can feel myself possibly heading into a relapse with mine now. I know it. I feel it. Yet it’s such a struggle. \nAnd I’m also a recovering addict so I can say with me the obsession of both are very similar, yet I struggle with ED more. \n\nI hope you find some peace and can nourish your body even though it’s hard sometimes. Sending so much love.",
      "created_utc": 1644172246.0,
      "score": 29,
      "context": []
    },
    {
      "id": "hvugoz8",
      "author": "Queenofwands1212",
      "body": "It is very similar yes.  I have lived both sides. Drug addiction, and ed/ exercise addiction. I find that recovering  an ed is way harder than any drug addiction or alcohol problem. I am clean and sober and it hasn’t been that hard for me. But the ed is more of a mental disorder which goes deeper than just substance and habits. We can’t go cold turkey off food. So it’s more of a mental brain re wiring that needs to occur which can feel\nNearly impossible to folks like me who have had an ed of all various types for 17 years",
      "created_utc": 1644174647.0,
      "score": 23,
      "context": []
    },
    {
      "id": "hvuzeld",
      "author": "420awesomesauce",
      "body": "I parked behind a store to eat Popeyes so no one could see me yesterday... It's not my first time either. My dad saw me then asked why. It felt like I was watching a drug use special from a sitcom",
      "created_utc": 1644182188.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hvv44jd",
      "author": "Euphoric_Individual5",
      "body": "Yep.  I was diagnosed with EDNOS with compulsive exercise. I have to be incredibly careful with working out because it so easily triggers back into the hyper fixation",
      "created_utc": 1644184111.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hvuhlxl",
      "author": "None",
      "body": "They are!!! Bulimia for a long time felt like a save space when everything was going bad in my life.",
      "created_utc": 1644175013.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hvuokwo",
      "author": "Content_Chemistry_34",
      "body": "1000%. But it’s so much harder to “stay sober” i.e. eat and function like you don’t have an eating disorder because we can’t just cut the drug of choice. As an addict, I know I can’t do drugs in moderation. It’s all or nothing. Yet as ed addicts we’re supposed to “use” food in moderation? I’ve found that approaching it with kindness and lenience helps. I know it’s something I will always struggle with and there will be times that are worse, days that are better, etc. as long as I stick to the long-term goal of recovery it helps to not get too attached to any relapses. Hope you stay strong, it’s so much harder than quitting something cold turkey but you wouldn’t be here if you weren’t able to do it :)",
      "created_utc": 1644177813.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hvvie4h",
      "author": "lolsappho",
      "body": "As an addict and someone with an ED, they feel the exact same way. Both are secretive, shameful, and force you to lie, hide (yourself, your body, your habits). Also my compulsion to stash and stock up feels the same with alcohol, drugs, and food. The ED almost killed me, the addiction has almost killed me a handful of times. You think you have control of it but it has control of you. They’re the same thing. Just different types of obsession connected to it.",
      "created_utc": 1644190102.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hvwmncz",
      "author": "None",
      "body": "I agree 100%. It always bothered me that it seems like the assumption is that people with EDs recover and then don’t struggle with their ED after that, whereas the assumption for people with substance use issues is that it’s a lifelong battle (not in a negative way, but just that it’s lifelong). I recovered physically from my ED 7 years ago but mentally I struggle and will continue to struggle every day.",
      "created_utc": 1644208902.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hvvsu58",
      "author": "Separate_Tangelo7138",
      "body": "Absolutely. It’s like an adrenaline rush knowing what you’re doing is bad which makes it more enticing (for me at least). I’m somewhat recovered but for me all that really means is I’m not super underweight because the addictive behaviors never totally go away. \n\nI still can’t help but check calories a lot of the time and tally them up in my head throughout the day. When I’m relapsing I get a sort of “high” by looking at triggering content. I’m addicted to critiquing my body in the mirror anytime I walk past one. When I go to someone’s house and they have a scale I have to get on it even though I really don’t want to know.",
      "created_utc": 1644194772.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hvuemen",
      "author": "mixedmediamadness",
      "body": "Yes. 100%",
      "created_utc": 1644173819.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hvupiau",
      "author": "Budget_Sir_8315",
      "body": "Yes.laxtives are my drug.",
      "created_utc": 1644178192.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hvuz92e",
      "author": "rileyyj001",
      "body": "Absolutely. Controls every aspect of my life, 24/7 and I cannot stop engaging in every single thing/behavior I feel it tells me to do 💔",
      "created_utc": 1644182125.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hvxycco",
      "author": "coteachermomma",
      "body": "My therapist said they are both housed in the same part of the brain. If I relapse right now, it’s with my eating disorder and not with my drinking. Yesterday I restricted and this morning I made the toast like I’ve done for the last three weeks and I started eating. I consider that a win",
      "created_utc": 1644241042.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hw1bt88",
      "author": "None",
      "body": "I’m struggling like crazy but I really believe this is true and that it’s valid in an explanation has to how it feels .. I don’t know anyone close to me who’s been through this and honestly my family and my boyfriend do or say things that trigger me often but I never speak up I just eat & mentally self harm as I regret everything I’ve done ..",
      "created_utc": 1644291172.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hwft7c9",
      "author": "MRR_99",
      "body": "I agree, I’ve been fighting against my ED for almost 6 years now, and it feels like it’ll never end, like I’m almost addicted to it, I’m just tired and done😔",
      "created_utc": 1644538394.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hxjvkhv",
      "author": "graciebrookes",
      "body": "It's the same. I've struggled with both.",
      "created_utc": 1645254351.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hz4sney",
      "author": "InevitableWerewolf21",
      "body": "Me too my whole body hurts",
      "created_utc": 1646275144.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hvvingh",
      "author": "uwucan",
      "body": "yes absolutely. im working on recovering now and i eat lots more than i used to and am happy about it but i have this creeping fear in the back of my head that ill relapse when i start to gain more weight back. fucked up part is i like how i look right now and i like my body but im not healthy at this weight, im scared once i get back to a healthy weight itll all come flooding back",
      "created_utc": 1644190213.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hvvjkww",
      "author": "rachiedoubt",
      "body": "I feel they are similar but not the same. The way I look at it, eating disorders are more similar to behavior addictions rather than addictions to substance, like gambling or shopping addictions. People can get addicted or dependent on the chemicals that are released from purging or starving, but food itself can’t really be addictive because we need it to survive. Another way they are similar is that they are both acts of self-destruction. Eating disorder and addiction are both slow suicide, and when one harms oneself that way... it becomes a part of them forever. Same with self-injury. It has to be managed and cared for to help keep it from gaining control again. We CAN heal, but it will always be part of us. Or at least, that’s how I feel.",
      "created_utc": 1644190618.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hvvst35",
      "author": "asteriskelipses",
      "body": "I think professionals would agree with you",
      "created_utc": 1644194759.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hvvh1o4",
      "author": "nodaybuttoday__",
      "body": "You might feel this way, but their comparison is just a matter of opinion and not an accepted fact. If it helps you make sense of your recovery that’s great. I personally find the whole “food addict” thing to be extremely fatphobic and it actually was the exact phraseology/attitude that drove me into restriction after joining and leaving Overeaters Anonymous.",
      "created_utc": 1644189519.0,
      "score": -1,
      "context": []
    },
    {
      "id": "hvwd8k3",
      "author": "bland-kid",
      "body": "I understand the feeling very very well. I haven’t been deep in my personal behaviours for years but every day they’re shrieking at me and I never will be rid of it. I think recovery is more about learning how to avoid giving into those self destructive voices, feelings and habits. I’m not and have never been in recovery but I’ve had some form of undiagnosed ED for at least 9 years. I’ve had bad times and more relaxed times, but the addictive feeling hasn’t ended and the behaviours haven’t subsided. I’ve only pushed aside the behaviours that drive me away from people I love. However, every night, I’m kept up by thoughts about how I shouldn’t have done that and I should’ve followed through with the disordered thoughts. It doesn’t go away, but parts do get easier and it’s all in its own time. [sorry if I rambled]",
      "created_utc": 1644204252.0,
      "score": 0,
      "context": []
    },
    {
      "id": "hvu4t5w",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1644169941.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hvx1v6g",
      "author": "bearspiracy",
      "body": "as a recovering addict with an ED, yes",
      "created_utc": 1644218031.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hvxymud",
      "author": "Liv60",
      "body": "Feels like I'm always gonna be like that",
      "created_utc": 1644241188.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hvywzlx",
      "author": "AdAccording5944",
      "body": "Totally, I find myself sharing a lot of traits with the profile of a drug addict.",
      "created_utc": 1644255573.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hw93hsp",
      "author": "ToriSaidSo",
      "body": "i can't deal with myself self m\\*tilating by starving whenever I feel like I'm not doing anything right. I keep going back. I was 15 at the time and now I can't totally get rid of it\n\nthis thing is haunting me because my head tells me it'll feel better",
      "created_utc": 1644429110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hwgz045",
      "author": "nothappyignoringsad",
      "body": "My sister said she is addicted to the high she experiences when she purges, its essentially an addiction",
      "created_utc": 1644558241.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hwl7bdj",
      "author": "heym00nbaby",
      "body": "Hell yes. Our scale decided to poop out today. I paced around the bathroom, patting my legs and snapping my fingers (anxious habits of mine), changed the batteries twice, tried turning it on who knows how many times, cried a while.... when I told my husband he sent me an Amazon link to a new one a shortly later, while I was already on my fourth or fifth online search for one in town to pick up today. The Amazon one wouldn't be here till Sunday and I could tell he was so baffled as to why that was not soon enough. It was a shameful moment for sure. Even recognizing this very \"addict\" situation while it was happening I bought one on my break from work....",
      "created_utc": 1644630725.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hxmf7ws",
      "author": "Prestigious-Bug-7641",
      "body": "Yes.. and as an addict in recovery I can totally recognise this in myself- but the ED is more twisted, for me.. like physically needing food but thinking it's bad and trying to abstain from it but needing it all the time- the difference being that logically I know food is good and I need it to live, whereas logically I knew the drugs were bad for me and did me no favours whatsoever- So I totally get what you mean, OP- For me it's like a relapse into another addiction..🤔😩😁",
      "created_utc": 1645304106.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hxozzyq",
      "author": "applepie93",
      "body": "It's not just similar to a drug addiction, it's a drug addiction (except maybe anorexia)",
      "created_utc": 1645357806.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hxw5b6e",
      "author": "comic_shans_15",
      "body": "I've never struggled with drug addiction, so my experience is somewhat naive, but I have had this thought before. I've tried to explain to people how I really can't try the various \"diet lifestyle\" apps or workout challenges they recommend, because I know I'll become obsessive about it, and it doesn't get across.",
      "created_utc": 1645484269.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hy5iyto",
      "author": "Atracadora_Tallin",
      "body": "I’ve drawn this comparison often with my Mia/Ana and while not a perfect analogy, I think there’s definitely a lot of similar patterns.",
      "created_utc": 1645651728.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hy6ap6p",
      "author": "None",
      "body": "YES",
      "created_utc": 1645663072.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hybg6op",
      "author": "BudgetTumbleweed5883",
      "body": "its addicting and normal- i feel the way abt other things like sh. once u start its hard to stop and it fucks with u a lot. i hope things get better <33",
      "created_utc": 1645749669.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hymqsto",
      "author": "TerracottaRobin",
      "body": "I'm currently having a relapse now, It sucks. Bad. but all of the \"good feelings\" I get from it overpower everything else. I went through hell with my eating disorder before Christmas, managed to get a hang of it for a month and a half and then relapsed again. It's so tiring.",
      "created_utc": 1645959390.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hyvedwi",
      "author": "assplunderer",
      "body": "It is very similar. I’m going on 1000 days clean off of drugs and somehow this all started at about 400 days clean. It’s addicting and I get a buzz off of it after a few days, and it’s a control thing as well. Very similar to a drug addiction.",
      "created_utc": 1646108115.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hz45sht",
      "author": "Better-Investment697",
      "body": "It's almost exactly the same thing. I'm an addict with an eating disorder...... Usually when I'm in recovery with one thing the other thing becomes a huge problem...... I switch back and forth from my eating disorder to drugs.",
      "created_utc": 1646264022.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hz72scl",
      "author": "Therandomderpdude",
      "body": "I agree. I am a fully recovered anorexic for 6 years now. \n\nLooking back I can see that it was strongly linked to the lack of control in my life at the time, and the sense of achievement I got from it felt amazing, even tho It was the most painful part of my life. Just like drugs and addicts, you get addicted to the feeling, even tho it kills you. \n\nWhen I spiral into depression from time to time, I can sometimes still hear the voice of « you don’t deserve food» and I am still romanticizing the feeling of complete control and achievement from time to time, even tho I know I am better than that, and I deserve to nourish my body.  \n\nI think after recovery you don’t let the voice have power, so it diminishes. From what I experienced as agonising screaming has gone down to a silent whisper that can easily be ignored.",
      "created_utc": 1646323230.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hz7vspu",
      "author": "daniellesdeadd",
      "body": "Absolutely.",
      "created_utc": 1646334361.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hzf8snu",
      "author": "None",
      "body": "Well I am a drug addict also and I find protein shakes help massively with my ED.\n\nSo my protein shakes normally contain oats, fruit, whole milk, 2 scoops of protein powder, ice cream.\n\nSometimes I add other things just depends what I've got in.\n\nBut yeah I feel your pain, having an ED sucks.",
      "created_utc": 1646461955.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hzm36ce",
      "author": "Tricky_World3497",
      "body": "As someone who has both and eating disorder and a drug addiction (recovering from substance abuse 10 month- still currently active in ED) they are both addictions really, but instead of heroin I want an empty stomach and control in my life. They are both unhealthy coping mechanisms, just like SH is!",
      "created_utc": 1646596017.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i05gd3n",
      "author": "humbledbyit",
      "body": "yes, that's why some people go to 12 step progams such as OA to get relief from the mental obsession driving them to use food in crazy ways.",
      "created_utc": 1646943740.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i096gv5",
      "author": "reddithelpmeplease1",
      "body": "I’m a heroin addict and I have an eating disorder and they’re virtually the same thing.",
      "created_utc": 1647014953.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i0adrr1",
      "author": "Adorable_Still6195",
      "body": "i did a research paper on this! basically, the feeling between having an eating disorder and a drug addiction are very similar because of the rewards sent to your brain, but the one difference is that restricting sends the brain these reward signals while taking drugs gives your brain the reward signals.",
      "created_utc": 1647031891.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i0pjyhi",
      "author": "Top-Comedian-5427",
      "body": "Hii! I just have something to vent about cause I have no one to talk to if you're willing to read.  \nSo...  \nMy parents constantly compare me to my older sister and cousin. My older sister weighs fourty+lbs lighter than me and my cousin weighs more than thirty+lbs heavier. Either saying I should look like her(my sister) or I'll end up looking and acting like her(my cousin). I've never been the skinny child, I'm the fat girl in everything I'm involved in. I've developed an ED, I starve myself, when I eat too much I use laxatives(sorry TMI) and I excessively workout until I'm satisfied. I need that control and that hunger to feel like I please my family.  \nMy mom was having dessert last night and I said no to her offer many many times bc she didn't respect my answer. She looked shocked and said \"Wow and you're known for eating\". ::((  \nMy mom also compares me to my sixty yr old grandma(her mom). One day my grandma said \"I think I'm small than Top-Comedian-5427! Don't you think?\" and my mom replied, \"I'm not sure, hard to tell, she's just got a bigger build and didn't get the good looks or genes.\"  \nI have a toxic family and I can't wait till I'm eighteen(two years left). Idk if my ed with continue? But I am definitely addicted to the feeling I get from my ED.   \nThank you all for reading this. Sorry for my rant, yall are the first people to know about my ED (:",
      "created_utc": 1647317204.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i0umanq",
      "author": "Impressive_Two9334",
      "body": "TW: relapse. \n\nI’m feeling that a lot right now. I can’t stand the weight I gained from being on SSRIs and honesty now that my emotions are more stable I feel numb most of the time. I’m trying not to get caught in the spiral again but I’ve been dipping my toe in and I realize how much I miss it",
      "created_utc": 1647407963.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i0yxj7h",
      "author": "pagan_pickle",
      "body": "I'm studying to become a substance abuse counselor. Eating disorders are considered an addiction and are apart of the curriculum. Many people with ED see substance abuse counselors to find coping mechanisms to keep their minds away from their ED.",
      "created_utc": 1647484613.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i1316st",
      "author": "the_fuck68",
      "body": "I’ve also found that it’s very similar to having and abusive boyfriend. it’s like you’re the victim and the abuser.",
      "created_utc": 1647558577.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i1el2nt",
      "author": "Murky_Ad4932",
      "body": "recovered here hi, I had this feeling while recovering and after many ed relapses I finally was ed-free. Life is truly better and worthy when you are healthy. The world is very dark and you are kind of in some sort of horrible trance when you are sick. If you are even considering recovery, please go trough that, I PROMISE you will see yourself and life like it really is. Mind is very tricky remember that",
      "created_utc": 1647785460.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i1fse29",
      "author": "Pacinopiticinu123",
      "body": "Whether anyone responds im not sure but i wanted to voice my problems on here as this states that this is where i can express my thoughts, emotions and battle with ongoing binge eating disorder.\n\nWhen i was a kid i was quite chubby and i always loved sugar chocolates and cakes. I loved food and had no fear of any type. Last spring i decided to change for the better and try and attempt a \" healthy lifestyle \". I believed at first it was successful and in 3-4 months i was looking leaner than i had ever been and i loved the way i looked and as this was done over the period of the covid lockdown i felt i accomplished it with ease. I then thought i should carry on eating in a big deficit as my face would look better as id already started to get a chiseled Jaw and my face was looking very healthy. My mom had told me how proud she was and i was so proud of my self too. In the summer months i was so confident in myself. Then after the lockdown had ended i had started to see my friends in which i hadn't seen in 2 years and they were all shocked. \" you look so good \" \" how did you manage to transform ? \" they would say. I got compliments on my looks and body and  i loved every minute of it, of course i did after all i was always the chubby kid from school who was the one who wouldn't get any validation or attention from any person really. Then as the winter months came my mom started to say \" i think youve lost enough weight, stop now \" she would say this for a month and then thats when it became a problem i noticed i had become underweight but i would never admit it id carry on the deficit and then as October came i started to feel more and more hungry. This was when i developed a binge eating disorder a severe one that ive had from October 2021 to right this very day. Im a male currently 19 5'8 and weigh 9 stone 7 my body fat i dont know but ive definitely gained alot of the fat back on my lower belly and im suffering mentally. I want that good feeling back but i constantly binge heavily. I wanted to come on here as a last resort to help overcome this horrific cycle and i wanted to see if anyone can help me overcome it.",
      "created_utc": 1647803572.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i1gcc10",
      "author": "Random_T29",
      "body": "I agree",
      "created_utc": 1647812081.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i1q3t3l",
      "author": "zillabirdblue",
      "body": "They're both addiction.",
      "created_utc": 1647989926.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i1qeyio",
      "author": "zillabirdblue",
      "body": "Have extremly same question and tried to post to ask seeking help but not trusty enough to do so. I've been admin and mod on forums and I get it to some degree but FFS. This isn't a pro ana forum. Need and would love to get help but I'm not worthy.",
      "created_utc": 1647994808.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i1r4jh2",
      "author": "zillabirdblue",
      "body": "I'm failing in lawschool and sabotaging my dream because if I get any calories in at all it's vodka. I got a second chance and I'm fucking it up again. I hate myself and frankly wish I don't have loved ones so I can't disappoint them or devastate them so I can kill myself. Also, I hope there isn't something beyond this life on earth. It you end this pain and then wake up in another life???? Fucking cruel.",
      "created_utc": 1648006963.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i1zltt4",
      "author": "Aammggg",
      "body": "Yes both are deadly. I’ve been in and out of treatment since my early yrs of my childhood. During my times of trying to get better and relapsing I met both people with ED’s and drug addictions and both got similar descriptions and trauma. With me it feels like a repetitive addiction, something I know I can die over but something I can control. But you can’t cause ur already addicted.",
      "created_utc": 1648159792.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i22ptgp",
      "author": "IcecreamCohn31",
      "body": "ABSOLUTELY. I feel like it's like filling the space one addiction leaves behind. When my ED is in check I  feel like I often replace the addiction with weed, alcohol, or even work addiction. It's a hard cycle to break. And I totally hear what you are saying - even when it's in check - it's still there.  I think it's important to be mindful that mental health issues don't just disappear, we are constantly working to manage them, just like clinical depression and anxiety.",
      "created_utc": 1648221810.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i2c3uvx",
      "author": "Bloepbloepblue",
      "body": "It really depends on the ED and it’s presentation. I would describe mine like OCD but with food. I suffered from both but my ED feels very different and not much like an addiction, more like an anxiety disorder. I don’t use to it to tune out the world at all, I use it to stay in it. I don’t know, it depends on everyone’s own experience with these things.",
      "created_utc": 1648402128.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i3effnn",
      "author": "mongoloid_raccoon",
      "body": "Yes! I never understood addiction until I experienced that first hand. The thing I realised is that a big problem is not wanting to get better.",
      "created_utc": 1649104862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i4ctxlt",
      "author": "WoodpeckerNo378",
      "body": "Absolutely. I’ve seen how addicting bulimia can be, and I know anorexia is addictive. Starvation makes me high, and so does an unhealthy amount of exercise. The combination of the two was always my favorite drug. Whenever I looked like I had recovered somewhat, it was really because I just swapped addictions and was abusing alcohol. These addictions can co exist, but for me, extreme anorexia is phased out with alcohol or vice versa. Much of my past treatment was built on the knowledge that eating disorders are addictions. That’s why long term residential treatment can be so effective. It breaks the cycle. Relapses are very hard to avoid, though, so staying with therapy and checking in with a therapist or psychiatrist is pretty crucial for sustained recovery. \nWhenever I think I’m doing well, I stop going to treatment and then eventually relapse. You think I’d learn to listen to my own advice! 🙄",
      "created_utc": 1649718356.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hxmfgkq",
      "author": "Prestigious-Bug-7641",
      "body": "Totally exactly what I would have said if I'd found the right words- my response post was much longer but I basically was trying to say the same thing😁",
      "created_utc": 1645304211.0,
      "score": 1,
      "context": [
        {
          "id": "hvuanxx",
          "author": "Aggravating_Fly_7362",
          "body": "I agree. I can feel myself possibly heading into a relapse with mine now. I know it. I feel it. Yet it’s such a struggle. \nAnd I’m also a recovering addict so I can say with me the obsession of both are very similar, yet I struggle with ED more. \n\nI hope you find some peace and can nourish your body even though it’s hard sometimes. Sending so much love.",
          "created_utc": 1644172246.0
        }
      ]
    },
    {
      "id": "hw0kdt4",
      "author": "ellleveeTBD",
      "body": "Yes!! How can we find peace and balance when we need it to live and thrive but having it can also do the opposite to us?!\n\nI wish someone could teach me how to eat all over again. I feel like I don’t even know how to do it right anymore.",
      "created_utc": 1644279141.0,
      "score": 10,
      "context": [
        {
          "id": "hvugoz8",
          "author": "Queenofwands1212",
          "body": "It is very similar yes.  I have lived both sides. Drug addiction, and ed/ exercise addiction. I find that recovering  an ed is way harder than any drug addiction or alcohol problem. I am clean and sober and it hasn’t been that hard for me. But the ed is more of a mental disorder which goes deeper than just substance and habits. We can’t go cold turkey off food. So it’s more of a mental brain re wiring that needs to occur which can feel\nNearly impossible to folks like me who have had an ed of all various types for 17 years",
          "created_utc": 1644174647.0
        }
      ]
    },
    {
      "id": "i1qke49",
      "author": "zillabirdblue",
      "body": "I have a deep belief that my ED is a symbol of strength since starving yourself is sacrifice and pain but drinking or using is a weakness since it's easy. Both are self sabotaging and keep you from your potential but I can't distinguish the reality.",
      "created_utc": 1647997253.0,
      "score": 3,
      "context": [
        {
          "id": "hvugoz8",
          "author": "Queenofwands1212",
          "body": "It is very similar yes.  I have lived both sides. Drug addiction, and ed/ exercise addiction. I find that recovering  an ed is way harder than any drug addiction or alcohol problem. I am clean and sober and it hasn’t been that hard for me. But the ed is more of a mental disorder which goes deeper than just substance and habits. We can’t go cold turkey off food. So it’s more of a mental brain re wiring that needs to occur which can feel\nNearly impossible to folks like me who have had an ed of all various types for 17 years",
          "created_utc": 1644174647.0
        }
      ]
    },
    {
      "id": "hz4sssv",
      "author": "InevitableWerewolf21",
      "body": "That's true, I feel u on that one",
      "created_utc": 1646275215.0,
      "score": 2,
      "context": [
        {
          "id": "hvugoz8",
          "author": "Queenofwands1212",
          "body": "It is very similar yes.  I have lived both sides. Drug addiction, and ed/ exercise addiction. I find that recovering  an ed is way harder than any drug addiction or alcohol problem. I am clean and sober and it hasn’t been that hard for me. But the ed is more of a mental disorder which goes deeper than just substance and habits. We can’t go cold turkey off food. So it’s more of a mental brain re wiring that needs to occur which can feel\nNearly impossible to folks like me who have had an ed of all various types for 17 years",
          "created_utc": 1644174647.0
        }
      ]
    },
    {
      "id": "hz4sy9n",
      "author": "InevitableWerewolf21",
      "body": "I have bulimia too",
      "created_utc": 1646275287.0,
      "score": 2,
      "context": [
        {
          "id": "hvuhlxl",
          "author": "None",
          "body": "They are!!! Bulimia for a long time felt like a save space when everything was going bad in my life.",
          "created_utc": 1644175013.0
        }
      ]
    },
    {
      "id": "hw0kkv0",
      "author": "ellleveeTBD",
      "body": "It’s the secret part for me… this is mine and no one can have it or change it or do anything to it.\n\n…even if it’s killing me",
      "created_utc": 1644279230.0,
      "score": 2,
      "context": [
        {
          "id": "hvvie4h",
          "author": "lolsappho",
          "body": "As an addict and someone with an ED, they feel the exact same way. Both are secretive, shameful, and force you to lie, hide (yourself, your body, your habits). Also my compulsion to stash and stock up feels the same with alcohol, drugs, and food. The ED almost killed me, the addiction has almost killed me a handful of times. You think you have control of it but it has control of you. They’re the same thing. Just different types of obsession connected to it.",
          "created_utc": 1644190102.0
        }
      ]
    },
    {
      "id": "hvvwj22",
      "author": "sarathedime",
      "body": "TW: mentions of drugs, alcohol, high\n\n I believe the words “addict” are referring to using the eating disorder itself as an addiction— a maladaptive coping mechanism, similar to how drugs and alcohol may be used to cope and then become an addiction. I agree that the term “food addiction” is extremely harmful, but it’s a little different than referring to the ED itself as a form of addiction. \n\nI’m currently researching the neuropsychology of eating disorders (just on an undergrad level, no primary data myself unfortunately) and on many levels it can present with similar behaviors and desires as an addiction. It’s not exactly the same of course, but it may prove helpful in figuring out how to treat the ED if someone feels their ED is an addiction. I feel mine is a coping mechanism because it dulls emotions and gives me a “high,” similar to how drugs/alcohol/other maladaptive coping skills do. Of course, they ARE bad coping mechanisms, and it may feel insensitive to both ED sufferers and those who suffer from addictions to compare the two\n\nBut your feelings are so so valid because “food addict” is literally disgusting. Everyone needs food. There isn’t a single living thing that doesn’t require food. It’s a dumb term, I agree",
      "created_utc": 1644196454.0,
      "score": 7,
      "context": [
        {
          "id": "hvvh1o4",
          "author": "nodaybuttoday__",
          "body": "You might feel this way, but their comparison is just a matter of opinion and not an accepted fact. If it helps you make sense of your recovery that’s great. I personally find the whole “food addict” thing to be extremely fatphobic and it actually was the exact phraseology/attitude that drove me into restriction after joining and leaving Overeaters Anonymous.",
          "created_utc": 1644189519.0
        }
      ]
    },
    {
      "id": "hxp093y",
      "author": "applepie93",
      "body": "For me it's more: you feel *awful*, you binge, you feel better, then you feel bad, then you \"purge\", and you feel okay for a few hours. Since I'm a man and it's not anorexia, no professional has ever accepted to help me (I tried four times), I'm on my own.",
      "created_utc": 1645358006.0,
      "score": 1,
      "context": [
        {
          "id": "hwgz045",
          "author": "nothappyignoringsad",
          "body": "My sister said she is addicted to the high she experiences when she purges, its essentially an addiction",
          "created_utc": 1644558241.0
        }
      ]
    },
    {
      "id": "i28r8vu",
      "author": "Old-Connection-6637",
      "body": "You can never really end the cycle unless you choose to recover. Recovery is different for everyone, and it may be helpful to you to talk to your mom about what’s been going on. She seems to be concerned, so you may be able to set up an apt to see a therapist or nutritionist with her. It’s terrifying to talk to your parents about your ED, but it may be what saves your life.",
      "created_utc": 1648332057.0,
      "score": 1,
      "context": [
        {
          "id": "i1fse29",
          "author": "Pacinopiticinu123",
          "body": "Whether anyone responds im not sure but i wanted to voice my problems on here as this states that this is where i can express my thoughts, emotions and battle with ongoing binge eating disorder.\n\nWhen i was a kid i was quite chubby and i always loved sugar chocolates and cakes. I loved food and had no fear of any type. Last spring i decided to change for the better and try and attempt a \" healthy lifestyle \". I believed at first it was successful and in 3-4 months i was looking leaner than i had ever been and i loved the way i looked and as this was done over the period of the covid lockdown i felt i accomplished it with ease. I then thought i should carry on eating in a big deficit as my face would look better as id already started to get a chiseled Jaw and my face was looking very healthy. My mom had told me how proud she was and i was so proud of my self too. In the summer months i was so confident in myself. Then after the lockdown had ended i had started to see my friends in which i hadn't seen in 2 years and they were all shocked. \" you look so good \" \" how did you manage to transform ? \" they would say. I got compliments on my looks and body and  i loved every minute of it, of course i did after all i was always the chubby kid from school who was the one who wouldn't get any validation or attention from any person really. Then as the winter months came my mom started to say \" i think youve lost enough weight, stop now \" she would say this for a month and then thats when it became a problem i noticed i had become underweight but i would never admit it id carry on the deficit and then as October came i started to feel more and more hungry. This was when i developed a binge eating disorder a severe one that ive had from October 2021 to right this very day. Im a male currently 19 5'8 and weigh 9 stone 7 my body fat i dont know but ive definitely gained alot of the fat back on my lower belly and im suffering mentally. I want that good feeling back but i constantly binge heavily. I wanted to come on here as a last resort to help overcome this horrific cycle and i wanted to see if anyone can help me overcome it.",
          "created_utc": 1647803572.0
        }
      ]
    },
    {
      "id": "i0my8fz",
      "author": "Aggressive_Hunter_72",
      "body": "When u said “I wish someone could teach me to eat all over again” I FELT",
      "created_utc": 1647277046.0,
      "score": 5,
      "context": [
        {
          "id": "hvugoz8",
          "author": "Queenofwands1212",
          "body": "It is very similar yes.  I have lived both sides. Drug addiction, and ed/ exercise addiction. I find that recovering  an ed is way harder than any drug addiction or alcohol problem. I am clean and sober and it hasn’t been that hard for me. But the ed is more of a mental disorder which goes deeper than just substance and habits. We can’t go cold turkey off food. So it’s more of a mental brain re wiring that needs to occur which can feel\nNearly impossible to folks like me who have had an ed of all various types for 17 years",
          "created_utc": 1644174647.0
        },
        {
          "id": "hw0kdt4",
          "author": "ellleveeTBD",
          "body": "Yes!! How can we find peace and balance when we need it to live and thrive but having it can also do the opposite to us?!\n\nI wish someone could teach me how to eat all over again. I feel like I don’t even know how to do it right anymore.",
          "created_utc": 1644279141.0
        }
      ]
    },
    {
      "id": "i1qrh3n",
      "author": "Queenofwands1212",
      "body": "I agree with this. In my experience. The Ed seems more of a resiliency mental illness, the drugs are more of a weakness mental illness. I know this is fucked up to think but since I’ve lived both experiences it’s kinda funny to reflect back",
      "created_utc": 1648000459.0,
      "score": 2,
      "context": [
        {
          "id": "hvugoz8",
          "author": "Queenofwands1212",
          "body": "It is very similar yes.  I have lived both sides. Drug addiction, and ed/ exercise addiction. I find that recovering  an ed is way harder than any drug addiction or alcohol problem. I am clean and sober and it hasn’t been that hard for me. But the ed is more of a mental disorder which goes deeper than just substance and habits. We can’t go cold turkey off food. So it’s more of a mental brain re wiring that needs to occur which can feel\nNearly impossible to folks like me who have had an ed of all various types for 17 years",
          "created_utc": 1644174647.0
        },
        {
          "id": "i1qke49",
          "author": "zillabirdblue",
          "body": "I have a deep belief that my ED is a symbol of strength since starving yourself is sacrifice and pain but drinking or using is a weakness since it's easy. Both are self sabotaging and keep you from your potential but I can't distinguish the reality.",
          "created_utc": 1647997253.0
        }
      ]
    },
    {
      "id": "hvvwpll",
      "author": "nodaybuttoday__",
      "body": "Yes, precisely. I’m an addict with an ED and whenever anyone tries to conflate them I get a little annoyed because people assume that BED=food addiction and that all fat people with EDs are just uncontrollably and ravenously eating ourselves to death. But if it helps someone make sense of their ED, that’s their story—I just don’t ever think it’s ok or safe to make it a universal projection.\n\nIt’s really just about pathologizing food and fat people so we can be blamed for the conditions that create our very real disordered eating.",
      "created_utc": 1644196538.0,
      "score": 2,
      "context": [
        {
          "id": "hvvh1o4",
          "author": "nodaybuttoday__",
          "body": "You might feel this way, but their comparison is just a matter of opinion and not an accepted fact. If it helps you make sense of your recovery that’s great. I personally find the whole “food addict” thing to be extremely fatphobic and it actually was the exact phraseology/attitude that drove me into restriction after joining and leaving Overeaters Anonymous.",
          "created_utc": 1644189519.0
        },
        {
          "id": "hvvwj22",
          "author": "sarathedime",
          "body": "TW: mentions of drugs, alcohol, high\n\n I believe the words “addict” are referring to using the eating disorder itself as an addiction— a maladaptive coping mechanism, similar to how drugs and alcohol may be used to cope and then become an addiction. I agree that the term “food addiction” is extremely harmful, but it’s a little different than referring to the ED itself as a form of addiction. \n\nI’m currently researching the neuropsychology of eating disorders (just on an undergrad level, no primary data myself unfortunately) and on many levels it can present with similar behaviors and desires as an addiction. It’s not exactly the same of course, but it may prove helpful in figuring out how to treat the ED if someone feels their ED is an addiction. I feel mine is a coping mechanism because it dulls emotions and gives me a “high,” similar to how drugs/alcohol/other maladaptive coping skills do. Of course, they ARE bad coping mechanisms, and it may feel insensitive to both ED sufferers and those who suffer from addictions to compare the two\n\nBut your feelings are so so valid because “food addict” is literally disgusting. Everyone needs food. There isn’t a single living thing that doesn’t require food. It’s a dumb term, I agree",
          "created_utc": 1644196454.0
        }
      ]
    },
    {
      "id": "i1qwcac",
      "author": "zillabirdblue",
      "body": "I'm trying to get sober but I think my ED is harder to tackle.",
      "created_utc": 1648002758.0,
      "score": 1,
      "context": [
        {
          "id": "hvugoz8",
          "author": "Queenofwands1212",
          "body": "It is very similar yes.  I have lived both sides. Drug addiction, and ed/ exercise addiction. I find that recovering  an ed is way harder than any drug addiction or alcohol problem. I am clean and sober and it hasn’t been that hard for me. But the ed is more of a mental disorder which goes deeper than just substance and habits. We can’t go cold turkey off food. So it’s more of a mental brain re wiring that needs to occur which can feel\nNearly impossible to folks like me who have had an ed of all various types for 17 years",
          "created_utc": 1644174647.0
        },
        {
          "id": "i1qke49",
          "author": "zillabirdblue",
          "body": "I have a deep belief that my ED is a symbol of strength since starving yourself is sacrifice and pain but drinking or using is a weakness since it's easy. Both are self sabotaging and keep you from your potential but I can't distinguish the reality.",
          "created_utc": 1647997253.0
        },
        {
          "id": "i1qrh3n",
          "author": "Queenofwands1212",
          "body": "I agree with this. In my experience. The Ed seems more of a resiliency mental illness, the drugs are more of a weakness mental illness. I know this is fucked up to think but since I’ve lived both experiences it’s kinda funny to reflect back",
          "created_utc": 1648000459.0
        }
      ]
    },
    {
      "id": "i1r1fdg",
      "author": "Queenofwands1212",
      "body": "Oh 1000000% . I easily got sober but the Ed is not as easy. You can’t just go cold Turkey off food or Behauvors like it’s easy to go cold Turkey off a drug or alcohol substance",
      "created_utc": 1648005300.0,
      "score": 2,
      "context": [
        {
          "id": "hvugoz8",
          "author": "Queenofwands1212",
          "body": "It is very similar yes.  I have lived both sides. Drug addiction, and ed/ exercise addiction. I find that recovering  an ed is way harder than any drug addiction or alcohol problem. I am clean and sober and it hasn’t been that hard for me. But the ed is more of a mental disorder which goes deeper than just substance and habits. We can’t go cold turkey off food. So it’s more of a mental brain re wiring that needs to occur which can feel\nNearly impossible to folks like me who have had an ed of all various types for 17 years",
          "created_utc": 1644174647.0
        },
        {
          "id": "i1qke49",
          "author": "zillabirdblue",
          "body": "I have a deep belief that my ED is a symbol of strength since starving yourself is sacrifice and pain but drinking or using is a weakness since it's easy. Both are self sabotaging and keep you from your potential but I can't distinguish the reality.",
          "created_utc": 1647997253.0
        },
        {
          "id": "i1qrh3n",
          "author": "Queenofwands1212",
          "body": "I agree with this. In my experience. The Ed seems more of a resiliency mental illness, the drugs are more of a weakness mental illness. I know this is fucked up to think but since I’ve lived both experiences it’s kinda funny to reflect back",
          "created_utc": 1648000459.0
        },
        {
          "id": "i1qwcac",
          "author": "zillabirdblue",
          "body": "I'm trying to get sober but I think my ED is harder to tackle.",
          "created_utc": 1648002758.0
        }
      ]
    },
    {
      "id": "i1u7pge",
      "author": "zillabirdblue",
      "body": "I'm glad it was easy to get sober, congrats! That's lucky. I wish I could get sober easily. 😔",
      "created_utc": 1648065482.0,
      "score": 1,
      "context": [
        {
          "id": "hvugoz8",
          "author": "Queenofwands1212",
          "body": "It is very similar yes.  I have lived both sides. Drug addiction, and ed/ exercise addiction. I find that recovering  an ed is way harder than any drug addiction or alcohol problem. I am clean and sober and it hasn’t been that hard for me. But the ed is more of a mental disorder which goes deeper than just substance and habits. We can’t go cold turkey off food. So it’s more of a mental brain re wiring that needs to occur which can feel\nNearly impossible to folks like me who have had an ed of all various types for 17 years",
          "created_utc": 1644174647.0
        },
        {
          "id": "i1qke49",
          "author": "zillabirdblue",
          "body": "I have a deep belief that my ED is a symbol of strength since starving yourself is sacrifice and pain but drinking or using is a weakness since it's easy. Both are self sabotaging and keep you from your potential but I can't distinguish the reality.",
          "created_utc": 1647997253.0
        },
        {
          "id": "i1qrh3n",
          "author": "Queenofwands1212",
          "body": "I agree with this. In my experience. The Ed seems more of a resiliency mental illness, the drugs are more of a weakness mental illness. I know this is fucked up to think but since I’ve lived both experiences it’s kinda funny to reflect back",
          "created_utc": 1648000459.0
        },
        {
          "id": "i1qwcac",
          "author": "zillabirdblue",
          "body": "I'm trying to get sober but I think my ED is harder to tackle.",
          "created_utc": 1648002758.0
        },
        {
          "id": "i1r1fdg",
          "author": "Queenofwands1212",
          "body": "Oh 1000000% . I easily got sober but the Ed is not as easy. You can’t just go cold Turkey off food or Behauvors like it’s easy to go cold Turkey off a drug or alcohol substance",
          "created_utc": 1648005300.0
        }
      ]
    }
  ]
}