{
  "id": "tvyz5z",
  "subreddit": "EatingDisorders",
  "author": "limeadegelatin",
  "created_utc": 1649069126.0,
  "title": "am i an enabler?",
  "selftext": "My girlfriend has had an ed for about 2 years. I’m really glad she trusts me and tells me about her experience but i’m struggling to support her in a safe way. \n\nShe has a list of safe foods that i pick from when we eat together. I help her get out of meals with her family and I find myself making excuses for her when she disappears to go purge. I want to support her and make her feel comfortable but at the same time i feel like I’m somehow enabling her ed. While I’m really worried about making her feel uncomfortable, I’m even more worried about her safety. I know I can’t force her to recover but am i doing the wrong thing by making it easier for her to continue this lifestyle?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/tvyz5z/am_i_an_enabler/",
  "score": 67,
  "num_comments": 11,
  "comments": [
    {
      "id": "i3cf8th",
      "author": "Common_Fly2384",
      "body": "Yes definitely, you are making her bad lifestyle more liveable. I do understand why but the shame and all the hiding she normally would have to do, should actually make her realize how bad her situation is and make her willing to recover. She should also talk to a professional because this can cause a lot of harm to her body  but also to her mental health. You covering her probably made her think that it's kind of okay, which it isn't.\nBut it's not really you fault because who knows how to handle these situations? \n\nTry to talk her into seeing a psychologist because if she doesn't want this to go on and killing her body and worsening her mental health, she will have to see somebody because she will not be able to do it alone. Also talk about you feeling guilty, maybe it makes her think twice about recovery. Just don't make it all about you of course. I know this is a lot but just tell her how you feel.\n\n(I'm not really good in this and I don't know your girlfriend of course) \nBut I hope it helps a little?",
      "created_utc": 1649075630.0,
      "score": 39,
      "context": []
    },
    {
      "id": "i3cpfi8",
      "author": "None",
      "body": "It’s time to ask professional help and address her issues with the support of experts",
      "created_utc": 1649080608.0,
      "score": 20,
      "context": []
    },
    {
      "id": "i3cy158",
      "author": "FiggyMint",
      "body": "If possible can you talk to her about it honestly? I know we humans love to avoid the biggest elephant in the room but if it can be addressed without it turning hostile it's probably a good time to get to it.",
      "created_utc": 1649084239.0,
      "score": 14,
      "context": []
    },
    {
      "id": "i3cevp4",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1649075433.0,
      "score": 40,
      "context": []
    },
    {
      "id": "i3dk2om",
      "author": "Chupie496",
      "body": "The book codependent no more really helped me recognize my enabling behaviors and consciously think about them. She might not be willing to go to therapy and you can't force anyone to get better but you certainly can take care of yourself. Therapy has been monumental for me in stopping my enabling habits and starting to care for myself instead of constantly thinking about my partner and what he will do next, I think you would really benefit from it too. And hey! Maybe if your partner sees you taking steps to get healthier mentally she might follow suit.",
      "created_utc": 1649092933.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i3ezuin",
      "author": "cburnard",
      "body": "yes",
      "created_utc": 1649112983.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i3fy4qf",
      "author": "yellowposy2",
      "body": "You’ve gotten a lot of good advice but yeah, it’s time to talk to her. Let her know you’re worried about her, and that you love her and want to support her and would love to help her find a therapist or a program that would be supportive for her. It’s likely she won’t be ready or receptive at first but let her know you’re doing your best to support her, and you need to prioritize her health. Eating disorders are life threatening, and purging is EXTREMELY hard on the body.\n\n\n\nSupportive things you can do for her in the meantime: try to keep her favorite foods on hand but don’t force it on her. If you notice she’s not eating, mention it to her: “hey, I haven’t seen you eat since Sunday and I’m worried about you. How can I support you right now?” Try to keep an open dialogue as much as possible, but don’t force it. You’re doing your best, and at the end of the day her mental health is her responsibility, but like I said eating disorders can cause death in patients that do not look near-death (heart issues are especially common in those with EDs). I’m not trying to scare you, but trying to impress how extremely serious her situation is. Sending you love and support.",
      "created_utc": 1649127457.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i3g816u",
      "author": "evilmachina",
      "body": "You can start talking to her about how you feel about the situation. Letting her know you feel bad whenever you cover up for her because inside you know that this is damaging her. Basically let her know how you feel about doing these actions that you know will eventually hurt her body and mind, and will lead to her going to the hospital or even worse, her death. Try to be very careful with your wording because people with ED may believe you’re against so you have to let her know you are worried because you love her and don’t want to hurt her.",
      "created_utc": 1649132541.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i3f2yfe",
      "author": "edshenabler",
      "body": "I know exactly how you feel and have had the same issues. There is no easy answer. On the one hand I wanted to help and support the person I loved at the time through her issues without judgement but also didn’t want to make things worse. But you can only suggest recovery so many times before they tune you out so then harm reduction seems like the best step. I wish I knew the right answer but no matter what I never judged and tried my best to make her feel better and happy",
      "created_utc": 1649114123.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i47ir5a",
      "author": "None",
      "body": "I’m in this same boat my girlfriend recently told me of her binge eating disorder followed by bulimia. I joined to learn peoples thoughts on this and to get an idea how to help her get better. I’ve had many a sleepless night in the barracks because of worrying completely about her life, she’s told me her heart feels strained and one time she couldn’t get up from the floor and she accepted her death right there. All I can say man is keep her motivated to do better if she sees this is negatively affecting you she’ll alienate herself in shame. You are the only one that knows just as I am, don’t force her to tell anyone she seeks help when she wants to seek it out. I recently got her to start looking into therapy I didn’t force her to I just gave her information given to me by my MFLAC. To answer your question, yes you are enabling her don’t feel shamed by that just become better, stop making excuses for her, encourage her to talk to someone, look up this website ANAD to educate yourself on the gravity of the situation. Do not force her to get help let her go at her pace but that doesn’t mean to help her hide the sickness, she trusts you man don’t lose it by telling people and don’t lose her by letting her fall deeper and deeper you’re stuck in the middle and it sucks man, but keep your head up and don’t lose yourself worrying about her. I have and I’m just now picking up the pieces.",
      "created_utc": 1649623036.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i3cf5j8",
      "author": "limeadegelatin",
      "body": "what should i be doing instead then",
      "created_utc": 1649075581.0,
      "score": 9,
      "context": [
        {
          "id": "i3cevp4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1649075433.0
        }
      ]
    },
    {
      "id": "i3cfmza",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1649075840.0,
      "score": 40,
      "context": [
        {
          "id": "i3cevp4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1649075433.0
        },
        {
          "id": "i3cf5j8",
          "author": "limeadegelatin",
          "body": "what should i be doing instead then",
          "created_utc": 1649075581.0
        }
      ]
    },
    {
      "id": "i3eepo2",
      "author": "mongoloid_raccoon",
      "body": "That's kind of harsh. If it's really what she wants, ruining her relationship with her family and making her be in situations where she will likely feel very panicked isn't going to help. She needs to want to get better first though, so therapy is still a good idea.",
      "created_utc": 1649104591.0,
      "score": 7,
      "context": [
        {
          "id": "i3cevp4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1649075433.0
        },
        {
          "id": "i3cf5j8",
          "author": "limeadegelatin",
          "body": "what should i be doing instead then",
          "created_utc": 1649075581.0
        },
        {
          "id": "i3cfmza",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1649075840.0
        }
      ]
    }
  ]
}