{
  "id": "u27vnu",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1649793389.0,
  "title": "how do you stop body checking?",
  "selftext": "i’ve struggled with an ED for around seven years and have made a lot of progress in recovery. the only part i can’t seem to kick is body checking constantly. \n\nthe obsessive need to check my body takes up a lot of my thoughts during the day. sometimes it makes it hard to focus on anything else. how do you stop? i don’t want to spend every day obsessing about my appearance any more, it just makes me sad",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/u27vnu/how_do_you_stop_body_checking/",
  "score": 40,
  "num_comments": 10,
  "comments": [
    {
      "id": "i4hwta9",
      "author": "bi-ti-lly",
      "body": "I’ve gotten a LOT better in regards to body checking over the last year thanks to something my partner told me once:\n“I’m not unattractive, I’m just not my type”\n\nThis reframed my thinking almost immediately, and I hope it can help someone else in need!",
      "created_utc": 1649807036.0,
      "score": 14,
      "context": []
    },
    {
      "id": "i4h44ry",
      "author": "AzzyKaz",
      "body": "I covered up mirrors in my house for awhile and everytime I caught myself body checking I would force myself to do something else. It's really difficult but in my experience it takes sheer discipline to stop. Also if you start thinking about it try to distract yourself, watch a video or play a game or something.",
      "created_utc": 1649794781.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i4j39tf",
      "author": "chasingravioli",
      "body": "I covered or got rid of my mirrors. I put beautiful tapestries over them.",
      "created_utc": 1649827060.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i4k45uj",
      "author": "sweetparamour79",
      "body": "So I just went through this with my therapist. \n\nCount out how many times you body check a day including where. \nThen you set a goal on how much you want to reduce it each week and slowly cut it down more each week. \n\nIt'll go back up sometimes but the goal is to be conscious of it and reduce it.",
      "created_utc": 1649853916.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i4hsseq",
      "author": "None",
      "body": "I probably body check less than I used to. It used to be multiple times a day, now it’s just once every other day. When I body check now, I’m looking at my body not as something to change or fix, but just something that “is”.",
      "created_utc": 1649805303.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i4mj838",
      "author": "Regina_Lee1",
      "body": "Hi, friend!\n\nRecovering from eating disorders can be a hard path. Checking the scale all the time and looking yourself in the mirror can be stressful sometimes. My advice to you is don't overthink too much. Recovering is a long way to process. I have been there too. What you are going through right now is to have a healthy life. We will try to look everywhere to see something odd about us, but the truth is we are more than our external appearance. Our worthiness and sufficiency can't be found in how we look. Go easy on yourself. Take one step at a time in your recovery process. Let the past in the past, learn from that. You will be able to get fully recovered. ",
      "created_utc": 1649888763.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i4nxgwn",
      "author": "princessxoxo100",
      "body": "I tend to do this a lot too, whenever I have the urge to check my body, I try to tell my self to stop and think of positive little affirmations to tell about myself. It doesn't always work but it helps block the urges to sometimes",
      "created_utc": 1649912641.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i4uutsn",
      "author": "FioLachtGerne",
      "body": "If it is possible with ur Mirror, you can turn them around and only turn it back if u really need it to look up your outfit or something. For me, I find myself checking body in the mirror less.",
      "created_utc": 1650044191.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i4lwmbg",
      "author": "None",
      "body": "i think i’m going to give this a try. thank you for your advice!",
      "created_utc": 1649879634.0,
      "score": 1,
      "context": [
        {
          "id": "i4k45uj",
          "author": "sweetparamour79",
          "body": "So I just went through this with my therapist. \n\nCount out how many times you body check a day including where. \nThen you set a goal on how much you want to reduce it each week and slowly cut it down more each week. \n\nIt'll go back up sometimes but the goal is to be conscious of it and reduce it.",
          "created_utc": 1649853916.0
        }
      ]
    },
    {
      "id": "i4mlyut",
      "author": "sweetparamour79",
      "body": "You are welcome. We also did this in tandem with tackling avoidance behaviours. So I wrote down 5 things I avoid. For me it was seeing myself bloated. My full length reflection. Wearing tight clothes. Eating an unsafe food. \n\nThen I had to challenge myself to complete each task a few times a week and write how it felt. Basically you should feel worse before you feel better. \n\nI have had these behaviours for 16 years but wanted to get help before falling pregnant. \nI am now pregnant and actually coping with my body changes and these behaviours have lessened significantly.",
      "created_utc": 1649889948.0,
      "score": 1,
      "context": [
        {
          "id": "i4k45uj",
          "author": "sweetparamour79",
          "body": "So I just went through this with my therapist. \n\nCount out how many times you body check a day including where. \nThen you set a goal on how much you want to reduce it each week and slowly cut it down more each week. \n\nIt'll go back up sometimes but the goal is to be conscious of it and reduce it.",
          "created_utc": 1649853916.0
        },
        {
          "id": "i4lwmbg",
          "author": "None",
          "body": "i think i’m going to give this a try. thank you for your advice!",
          "created_utc": 1649879634.0
        }
      ]
    }
  ]
}