{
  "id": "u444jk",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1650014497.0,
  "title": "I do not eat enough",
  "selftext": "F19\nI don’t know where to post this. People close to me have mentioned (with good intentions) that it’s very obvious I had a ED but I never looked into it. \n\nI have struggled with food my entire life. We were poor growing up. I am not exactly rolling in cash as a first gen college student either. Always been a chunky kid, struggled with weight yk how it goes. I was a athlete. Played sports my entire life. Water, contact, XC you name it. Worked, full schedule etc. \n\nI just can’t eat. I truly think if a medical professional saw my eating habits they’d put me on a feeding tube. I hardly eat 800 calories daily. I don’t really eat junk. Nothing high calorie either. Just barley eat one meal a day. But when I do I am always so full. \nOr if for example I had yogurt for breakfast why would I eat three hours later at lunch? If I wake up I’ll just go about my day and maybe before I leave, “oh I forgot I was gonna grab something, well”. I have no appetite but I know I need to eat. I work a demanding job, have sleeping troubles, my mood swings, depression, anxiety attacks. These all can be traced back to my eating habits. I want to get better but I don’t know what to do. \n\nI also wanted to ask\nIs this self harm? Sometimes a part of me convinces myself that I don’t deserve a meal. Don’t need to buy groceries this week. Can anyone relate ?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/u444jk/i_do_not_eat_enough/",
  "score": 39,
  "num_comments": 9,
  "comments": [
    {
      "id": "i4tsx47",
      "author": "Sun_on_my_shoulders",
      "body": "Try and do three small meals a day, breakfast lunch and dinner. Then you can work your way to 1200 calories. This is what I did since I can’t afford treatment!",
      "created_utc": 1650028078.0,
      "score": 17,
      "context": []
    },
    {
      "id": "i4u4jyy",
      "author": "dredged_dm",
      "body": "> I don't deserve a meal \n\nFirst, this isn't medical advise, I'm not a professional, just someone with a diagnosed ED who is in recovery. This for sure sounds like you have an ED to me. If you are intentionally restricting your intake because you don't feel like you deserve it, that sure meets what I would call self-harm. You should seriously consider seeing a mental health professional if that is an option open to you.",
      "created_utc": 1650033471.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i4tfpxc",
      "author": "None",
      "body": "Could be an ED, idk. EDs have more to do with the motivation behind your behaviors than your behaviors themselves. In other words, it's not just about how little you're eating, it's about *why* you're eating so little.\n\nBut regardless of what it is, it sounds like you need professional help.",
      "created_utc": 1650020101.0,
      "score": 18,
      "context": []
    },
    {
      "id": "i4u8sp7",
      "author": "huuugggttfdf",
      "body": "Seems like an Ed but also treating depression i think would help you",
      "created_utc": 1650035260.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i4vvc47",
      "author": "None",
      "body": "I am not trying to come at you, just thought I'd let you know the rules state you cannot state numbers (such as calories)! it's triggering <3",
      "created_utc": 1650059912.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i4wjpjq",
      "author": "macchiatobxtch",
      "body": "check out r/ARFID, you might resonate with some of the stories there",
      "created_utc": 1650071517.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i4u2wef",
      "author": "None",
      "body": "Do you have any meal suggestions?",
      "created_utc": 1650032760.0,
      "score": 5,
      "context": [
        {
          "id": "i4tsx47",
          "author": "Sun_on_my_shoulders",
          "body": "Try and do three small meals a day, breakfast lunch and dinner. Then you can work your way to 1200 calories. This is what I did since I can’t afford treatment!",
          "created_utc": 1650028078.0
        }
      ]
    },
    {
      "id": "i4vxxa9",
      "author": "None",
      "body": "maybe I'm wrong?? I just read it in the rules, but I see everyone else posting numbers!! so do whatever you want lmao <3",
      "created_utc": 1650061095.0,
      "score": 2,
      "context": [
        {
          "id": "i4vvc47",
          "author": "None",
          "body": "I am not trying to come at you, just thought I'd let you know the rules state you cannot state numbers (such as calories)! it's triggering <3",
          "created_utc": 1650059912.0
        }
      ]
    },
    {
      "id": "i4uazgt",
      "author": "None",
      "body": "When you do eat- try to find healthy fats like avocado, tuna, nuts, olives, cheeses. My favorite go-to is a nice charcuterie plate. Dried fruit & chocolate go together really well. That way you can nosh in a grazing type of way that may not feel as overwhelming or commital.",
      "created_utc": 1650036177.0,
      "score": 13,
      "context": [
        {
          "id": "i4tsx47",
          "author": "Sun_on_my_shoulders",
          "body": "Try and do three small meals a day, breakfast lunch and dinner. Then you can work your way to 1200 calories. This is what I did since I can’t afford treatment!",
          "created_utc": 1650028078.0
        },
        {
          "id": "i4u2wef",
          "author": "None",
          "body": "Do you have any meal suggestions?",
          "created_utc": 1650032760.0
        }
      ]
    }
  ]
}