{
  "id": "u5whs8",
  "subreddit": "EatingDisorders",
  "author": "GooGoobs",
  "created_utc": 1650230339.0,
  "title": "My girlfriend doesn't want recovery and i can't handle it. Any advice?",
  "selftext": "My girlfriend has recently decided that she doesn't want recovery because she isn't ready for it. I understand her decision and i still will be there for her no matter what, but honestly it's killing me inside. I can't get out of my head the bad  thoughts, I'm so worried and scared. I want to be strong for her, and I don't know what to do :( i love her with all my heart and i really want to spend the rest of my life with her but I'm just so scared for her health and everything. Do you have any advice?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/u5whs8/my_girlfriend_doesnt_want_recovery_and_i_cant/",
  "score": 47,
  "num_comments": 22,
  "comments": [
    {
      "id": "i558d9h",
      "author": "None",
      "body": "personally me and my partner both have eds and are both actively trying to recovery from it but we agreed that if we slip back into habits and choose not to recover, then me and him will break up.\n\nIt caused our relationship SO much strain in the past from both being in bad mindsets and not trying to recover so that's why we chose this for us.\n\nIf your girlfriend is choosing not to recover, maybe it's best to go separate ways. I understand you love her and that's wonderful but having someone who's not trying to recover can be dangerous and draining for both parties obviously. \n\nI've been on both sides of it here. All you can do is try to help her recover but if she doesn't and it's really hurting you, I do think it's best to go separate ways.",
      "created_utc": 1650239137.0,
      "score": 40,
      "context": []
    },
    {
      "id": "i55cbqz",
      "author": "None",
      "body": "I’m so sorry you’re experiencing this. EDs can be so difficult and even traumatic to witness. There’s a term for it called “Secondary Trauma/Vicarious Trauma”. Are you open or available to going to a therapist or counselor for your own self? They can help give you guidance on how to deal with her illness.",
      "created_utc": 1650240965.0,
      "score": 15,
      "context": []
    },
    {
      "id": "i5555ln",
      "author": "laurewod",
      "body": "what about harm reduction strategies?",
      "created_utc": 1650237653.0,
      "score": 10,
      "context": []
    },
    {
      "id": "i5616g4",
      "author": "tracyf600",
      "body": "She's not there yet. Is she in any kind of therapy?",
      "created_utc": 1650252991.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5eaxw7",
      "author": "boobbers",
      "body": "i’m the girlfriend and these comments are incredibly disheartening ): i wanted to explain myself by saying i know that me choosing not to recover from my ed right now hurt my girlfriend. i even told her that maybe separating would be the best thing because i didn’t want to hurt her. i chose not to recover because i truly didn’t believe i was ready to handle it and give it my all. i’m scared of losing the comfort and security anorexia gave me and i’m scared that my second attempt at recovery will go the same as my first. i’ve already had bad experiences with attempted recovery and what i’ve learned from them is that i need to be committed to recovery for it to be successful. i didn’t believe i could be committed any time soon because of other reasons and i knew that if i failed i would be back at rock bottom. i wanted to put myself first and allow myself to become ready for recovery. my eating disorder told me lots of things, especially that if i recovered i was giving up on myself and my goals and i couldn’t let that go. my sick brain rationalized not choosing recovery. the more i learned how much it actually hurt my girlfriend, the people around me, and myself i realized just how much living with an eating disorder is not possible. it is not sustainable. even if i didn’t realize it, i was choosing starvation over everyone and everything else. knowing that, i was disgusted with myself way more than anorexia ever made me disgusted with myself. i don’t think i’ll ever be completely ready for recovery, and that’s okay. but i learned i need to attempt it without thinking it’s going to fail in order to keep and repair my relationships and heal myself. i can’t live knowing i’m hurting so many people so greatly, and that the one person i love so much could leave me because i hurt her so badly. recovery won’t be easy but it’s the only option i’m going to consider and the only option that will allow me to live happily and have a future. i’m going to therapy soon (i was always open to therapy) and i’m currently really motivated for recovery. i know it’ll take a while and be a struggle but i believe i can recover. it will only get easier from here on out and i’m glad i have such a loving girlfriend to support me and good friends/family that love me. i’m truly lucky and i almost forgot that completely.",
      "created_utc": 1650403081.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i56yz6g",
      "author": "how2dresswell",
      "body": "try to stand back and look at this situation objectively. swap the ED with a different type of addiction- substance abuse. what would you do if your gf wasn't ready to recover from a drug addiction? sometimes this puts the severity of the disease into perspective\n\ni think you need to give her an ultimatum. you'll stand by her to get her through recovery, or you are out. right now, she is actively and openly choosing an ED over you. her ED absolutely impacts & controls every facet of her life, including you. it will be a long, lonely, heart-breaking, and frustrating relationship for you if she doesn't want recovery. have you advocated for her choosing YOU in the relationship? spin it this way. it's her choice- you or the ED.  she'll either understand and open up to recovery... or continue to be in denial, get mad at you, and pick her ED over you . and at that point  it might be easier for you to walk away",
      "created_utc": 1650278615.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i56rtoe",
      "author": "ispariz",
      "body": "You need to accept that you cannot change her or help her. You can support her in doing it, and you can (and should) refuse to enable her hurting herself, but you cannot fix this for her.\n\nYou have two options: stay with her knowing she may never get better, and could die. Or move on with your life.\n\nHonestly, I'd give her the ultimatum of couples therapy or a break. That might make her realize how important this is for you.\n\nYou also have to be prepared for her to choose her eating disorder over you. In a way, she already is. Maybe not deliberately, but it is happening. You need to make it clear that you need to come first, not the disease. Boundaries, expectations, and communication are key here. Don't let her have her cake and eat it too.",
      "created_utc": 1650272676.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i55qyk8",
      "author": "100basicbitch100",
      "body": "There is no such a thing doesn't want a recovery, except really special cases. She is not ready for it, she is scared, but deep down in her heart, she wants it. Just slow things down, tell are that your here for her, and do help her. just not so fast and intensive. help her help herself, help her feel ready.",
      "created_utc": 1650247819.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i56r91m",
      "author": "GooGoobs",
      "body": "The thing is that i don't want to go separate ways :(  i want to be the person who will be there through hard times even like that. i believe in her and i have hope, she knows it hurts me and she is really sad about it, because that's the last thing she wants to do,but she can't recovery now, she isn't ready. I want to be there for her and make her feel loved  but bad thoughts are so painful and i don't know how I can deal with them",
      "created_utc": 1650272184.0,
      "score": 12,
      "context": [
        {
          "id": "i558d9h",
          "author": "None",
          "body": "personally me and my partner both have eds and are both actively trying to recovery from it but we agreed that if we slip back into habits and choose not to recover, then me and him will break up.\n\nIt caused our relationship SO much strain in the past from both being in bad mindsets and not trying to recover so that's why we chose this for us.\n\nIf your girlfriend is choosing not to recover, maybe it's best to go separate ways. I understand you love her and that's wonderful but having someone who's not trying to recover can be dangerous and draining for both parties obviously. \n\nI've been on both sides of it here. All you can do is try to help her recover but if she doesn't and it's really hurting you, I do think it's best to go separate ways.",
          "created_utc": 1650239137.0
        }
      ]
    },
    {
      "id": "i56rd2c",
      "author": "GooGoobs",
      "body": "I haven't thought about therapy for myself, because i believe that everything will be okay and it's just temporary",
      "created_utc": 1650272279.0,
      "score": 0,
      "context": [
        {
          "id": "i55cbqz",
          "author": "None",
          "body": "I’m so sorry you’re experiencing this. EDs can be so difficult and even traumatic to witness. There’s a term for it called “Secondary Trauma/Vicarious Trauma”. Are you open or available to going to a therapist or counselor for your own self? They can help give you guidance on how to deal with her illness.",
          "created_utc": 1650240965.0
        }
      ]
    },
    {
      "id": "i56qcpz",
      "author": "GooGoobs",
      "body": "No she isn't, she doesn't want it because she isn't ready",
      "created_utc": 1650271405.0,
      "score": 2,
      "context": [
        {
          "id": "i5616g4",
          "author": "tracyf600",
          "body": "She's not there yet. Is she in any kind of therapy?",
          "created_utc": 1650252991.0
        }
      ]
    },
    {
      "id": "i575onu",
      "author": "GooGoobs",
      "body": "The other thing is that i don't want to force her, she was in recovery one year ago by force and it ended up really bad on her mental health, not just because of Ed. She doesn't want to be forced again",
      "created_utc": 1650283253.0,
      "score": 6,
      "context": [
        {
          "id": "i56yz6g",
          "author": "how2dresswell",
          "body": "try to stand back and look at this situation objectively. swap the ED with a different type of addiction- substance abuse. what would you do if your gf wasn't ready to recover from a drug addiction? sometimes this puts the severity of the disease into perspective\n\ni think you need to give her an ultimatum. you'll stand by her to get her through recovery, or you are out. right now, she is actively and openly choosing an ED over you. her ED absolutely impacts & controls every facet of her life, including you. it will be a long, lonely, heart-breaking, and frustrating relationship for you if she doesn't want recovery. have you advocated for her choosing YOU in the relationship? spin it this way. it's her choice- you or the ED.  she'll either understand and open up to recovery... or continue to be in denial, get mad at you, and pick her ED over you . and at that point  it might be easier for you to walk away",
          "created_utc": 1650278615.0
        }
      ]
    },
    {
      "id": "i56qkzz",
      "author": "GooGoobs",
      "body": "How can I do that?",
      "created_utc": 1650271608.0,
      "score": 2,
      "context": [
        {
          "id": "i55qyk8",
          "author": "100basicbitch100",
          "body": "There is no such a thing doesn't want a recovery, except really special cases. She is not ready for it, she is scared, but deep down in her heart, she wants it. Just slow things down, tell are that your here for her, and do help her. just not so fast and intensive. help her help herself, help her feel ready.",
          "created_utc": 1650247819.0
        }
      ]
    },
    {
      "id": "i56rsl3",
      "author": "bellasuperstring",
      "body": "She can recover now. Her ED is the reason she isn't doing it now. That isn't your rational GF talking. It is her ED saying she isn't ready. She's manipulating you when she says that. \n\nLife is far from perfect and you need to decide what to do on your own, but if you have talked about it and her ED is taking precedence over your needs and feelings then you do not have a very fair relationship. I'm not at all saying she's a bad person. This of just the reality of her untreated illness and the more people around her pretend her life is normal or bearable and support her NOT getting treated, the longer she will do it and risk her own health while being completely inconsiderate of her loved ones. \n\nYou don't have a future together if she refuses treatment.",
      "created_utc": 1650272650.0,
      "score": 18,
      "context": [
        {
          "id": "i558d9h",
          "author": "None",
          "body": "personally me and my partner both have eds and are both actively trying to recovery from it but we agreed that if we slip back into habits and choose not to recover, then me and him will break up.\n\nIt caused our relationship SO much strain in the past from both being in bad mindsets and not trying to recover so that's why we chose this for us.\n\nIf your girlfriend is choosing not to recover, maybe it's best to go separate ways. I understand you love her and that's wonderful but having someone who's not trying to recover can be dangerous and draining for both parties obviously. \n\nI've been on both sides of it here. All you can do is try to help her recover but if she doesn't and it's really hurting you, I do think it's best to go separate ways.",
          "created_utc": 1650239137.0
        },
        {
          "id": "i56r91m",
          "author": "GooGoobs",
          "body": "The thing is that i don't want to go separate ways :(  i want to be the person who will be there through hard times even like that. i believe in her and i have hope, she knows it hurts me and she is really sad about it, because that's the last thing she wants to do,but she can't recovery now, she isn't ready. I want to be there for her and make her feel loved  but bad thoughts are so painful and i don't know how I can deal with them",
          "created_utc": 1650272184.0
        }
      ]
    },
    {
      "id": "i583wpx",
      "author": "violetgay",
      "body": "Eating disorders are very similar to addictions in the way they affect the individual and the people around them. ☹️ The person does have to be ready to recover. \n\nAdvice for her: recovery can start small. It's something you have to practice, you dont have to stop everything all at once. Harm reduction is important, every little bit counts. I think it might benefit her to find a therapist if she doesn't already have one. Eating disorders often result from some sort of trauma, so even just starting to process that is a step in the right direction. Learn some coping techniques. \n\nI am in therapy but I don't talk about my ED with my therapist (which is bad, I should be open about it, im just personally worried they'll change my medications if Im honest). But the work I've done in therapy has helped me with my ED a lot on it's own. Once she trusts her therapist she may be more likely to be willing to take steps to address the ED directly. \n\nThere are also peer support groups, but I wouldn't advise that until she's further on her journey cause people with EDs can be competitive and it might do more harm than good rn.\n\nAdvice for you: this is a really intense thing you're going through with her. You fears and emotions are valid. I think you should find a support group for people whose loved ones struggle with EDs. You might even be able to find one online. Here is one I found with a quick Google, just scroll down the page and you'll see the loved ones option: [link](https://centerfordiscovery.com/groups/). It is free! \n\nAlso, and this is IMPORTANT. If it's too much for you to handle, it is okay to back out until she makes changes in her life to get better. It does not make you a bad person. It does not mean you don't love her. Again, EDs are like addictions and loved ones should set boundaries to protect their own mental health and wellbeing. \n\nI was in a relationship when I was young and very deep in my mental illness and it was far too much for him to cope with. He tried, but the stress of it eventually eroded our relationship and we were totally codependent. It wasn't healthy for either of us and it did not end well. Just be careful. My relationship was not your relationship, but I've seen the same pattern play out in other people's lives too. \n\n\nThank you so much for trying to support her and reaching out for advice.",
      "created_utc": 1650298846.0,
      "score": 3,
      "context": [
        {
          "id": "i558d9h",
          "author": "None",
          "body": "personally me and my partner both have eds and are both actively trying to recovery from it but we agreed that if we slip back into habits and choose not to recover, then me and him will break up.\n\nIt caused our relationship SO much strain in the past from both being in bad mindsets and not trying to recover so that's why we chose this for us.\n\nIf your girlfriend is choosing not to recover, maybe it's best to go separate ways. I understand you love her and that's wonderful but having someone who's not trying to recover can be dangerous and draining for both parties obviously. \n\nI've been on both sides of it here. All you can do is try to help her recover but if she doesn't and it's really hurting you, I do think it's best to go separate ways.",
          "created_utc": 1650239137.0
        },
        {
          "id": "i56r91m",
          "author": "GooGoobs",
          "body": "The thing is that i don't want to go separate ways :(  i want to be the person who will be there through hard times even like that. i believe in her and i have hope, she knows it hurts me and she is really sad about it, because that's the last thing she wants to do,but she can't recovery now, she isn't ready. I want to be there for her and make her feel loved  but bad thoughts are so painful and i don't know how I can deal with them",
          "created_utc": 1650272184.0
        }
      ]
    },
    {
      "id": "i56z2et",
      "author": "how2dresswell",
      "body": "it's not temporary",
      "created_utc": 1650278686.0,
      "score": 10,
      "context": [
        {
          "id": "i55cbqz",
          "author": "None",
          "body": "I’m so sorry you’re experiencing this. EDs can be so difficult and even traumatic to witness. There’s a term for it called “Secondary Trauma/Vicarious Trauma”. Are you open or available to going to a therapist or counselor for your own self? They can help give you guidance on how to deal with her illness.",
          "created_utc": 1650240965.0
        },
        {
          "id": "i56rd2c",
          "author": "GooGoobs",
          "body": "I haven't thought about therapy for myself, because i believe that everything will be okay and it's just temporary",
          "created_utc": 1650272279.0
        }
      ]
    },
    {
      "id": "i596sp6",
      "author": "Lindsey7618",
      "body": "Eating disorders are never temporary. Even after you recover, it's an ongoing battle and it never goes away. Most of us believe 100% recovery is impossible. It's also possible to develop a different eating disorder while in recovery for another, e.g. developing bulimia after recovering from anorexia.",
      "created_utc": 1650314472.0,
      "score": 4,
      "context": [
        {
          "id": "i55cbqz",
          "author": "None",
          "body": "I’m so sorry you’re experiencing this. EDs can be so difficult and even traumatic to witness. There’s a term for it called “Secondary Trauma/Vicarious Trauma”. Are you open or available to going to a therapist or counselor for your own self? They can help give you guidance on how to deal with her illness.",
          "created_utc": 1650240965.0
        },
        {
          "id": "i56rd2c",
          "author": "GooGoobs",
          "body": "I haven't thought about therapy for myself, because i believe that everything will be okay and it's just temporary",
          "created_utc": 1650272279.0
        }
      ]
    },
    {
      "id": "i56tmyx",
      "author": "XTianoElCurioso",
      "body": "Is she under any kind of medical supervision? Even if she decides that she is not ready for therapy she should be seen by a medic on a regular basis. From where I stand that should really be non-negotiable. Doing this could also be a way to figure out to what extent she is willing to look at the risks of what she is doing. \nEDs tend to find ‘nests’ - spaces in family life where they are not disturbed and can go about their unhealthy business. Often families stop challenging EDs because people say things like your girlfriend does - that they are ‘not ready’. What is the message here?: is it - ‘stop asking me to change’? If that is the message then I would agree with other posters and it might be time to think about what your needs are in this relationship. This might not mean you have to break up but you might have to think a out how much support you CAN actually provide for someone who is not ready. You are at risk of setting both of you up to fail if you try to support someone who is not willing to make changes. You might decide the share and enjoy other parts of your relationship but I would also be clear on when the downsides outweigh the good parts. \nThis is not easy. And it should not feel easy because that nature of EDs is that they are difficult. I feel for you but I’m glad you seek support. \nRemember, you can only be a good support if you think about your own needs first. You need a solid basis to help from.",
      "created_utc": 1650274239.0,
      "score": 5,
      "context": [
        {
          "id": "i5616g4",
          "author": "tracyf600",
          "body": "She's not there yet. Is she in any kind of therapy?",
          "created_utc": 1650252991.0
        },
        {
          "id": "i56qcpz",
          "author": "GooGoobs",
          "body": "No she isn't, she doesn't want it because she isn't ready",
          "created_utc": 1650271405.0
        }
      ]
    },
    {
      "id": "i57aft1",
      "author": "tracyf600",
      "body": "Recovery is like drug addiction. She has to be ready.",
      "created_utc": 1650285996.0,
      "score": 4,
      "context": [
        {
          "id": "i5616g4",
          "author": "tracyf600",
          "body": "She's not there yet. Is she in any kind of therapy?",
          "created_utc": 1650252991.0
        },
        {
          "id": "i56qcpz",
          "author": "GooGoobs",
          "body": "No she isn't, she doesn't want it because she isn't ready",
          "created_utc": 1650271405.0
        }
      ]
    },
    {
      "id": "i57fv0d",
      "author": "prolapsedbeehole",
      "body": "Hey. Just curious if you would want to DM me. I'm going through thr same experience and I know how hard it is",
      "created_utc": 1650288741.0,
      "score": 2,
      "context": [
        {
          "id": "i5616g4",
          "author": "tracyf600",
          "body": "She's not there yet. Is she in any kind of therapy?",
          "created_utc": 1650252991.0
        },
        {
          "id": "i56qcpz",
          "author": "GooGoobs",
          "body": "No she isn't, she doesn't want it because she isn't ready",
          "created_utc": 1650271405.0
        }
      ]
    },
    {
      "id": "i589967",
      "author": "how2dresswell",
      "body": "i don't think a conversation, emphasizing how her ED affects YOU, is forcing her. it's just  bringing her back to reality",
      "created_utc": 1650300965.0,
      "score": 2,
      "context": [
        {
          "id": "i56yz6g",
          "author": "how2dresswell",
          "body": "try to stand back and look at this situation objectively. swap the ED with a different type of addiction- substance abuse. what would you do if your gf wasn't ready to recover from a drug addiction? sometimes this puts the severity of the disease into perspective\n\ni think you need to give her an ultimatum. you'll stand by her to get her through recovery, or you are out. right now, she is actively and openly choosing an ED over you. her ED absolutely impacts & controls every facet of her life, including you. it will be a long, lonely, heart-breaking, and frustrating relationship for you if she doesn't want recovery. have you advocated for her choosing YOU in the relationship? spin it this way. it's her choice- you or the ED.  she'll either understand and open up to recovery... or continue to be in denial, get mad at you, and pick her ED over you . and at that point  it might be easier for you to walk away",
          "created_utc": 1650278615.0
        },
        {
          "id": "i575onu",
          "author": "GooGoobs",
          "body": "The other thing is that i don't want to force her, she was in recovery one year ago by force and it ended up really bad on her mental health, not just because of Ed. She doesn't want to be forced again",
          "created_utc": 1650283253.0
        }
      ]
    },
    {
      "id": "i58evcs",
      "author": "GooGoobs",
      "body": "Yeah of course!",
      "created_utc": 1650303244.0,
      "score": 1,
      "context": [
        {
          "id": "i5616g4",
          "author": "tracyf600",
          "body": "She's not there yet. Is she in any kind of therapy?",
          "created_utc": 1650252991.0
        },
        {
          "id": "i56qcpz",
          "author": "GooGoobs",
          "body": "No she isn't, she doesn't want it because she isn't ready",
          "created_utc": 1650271405.0
        },
        {
          "id": "i57fv0d",
          "author": "prolapsedbeehole",
          "body": "Hey. Just curious if you would want to DM me. I'm going through thr same experience and I know how hard it is",
          "created_utc": 1650288741.0
        }
      ]
    }
  ]
}