{
  "id": "u6dclt",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1650289004.0,
  "title": "How to beat the “screw it” urge?",
  "selftext": "How do I stop giving in when the f*** switch comes? I will be on track for days and then have a piece of chocolate or slice of pizza and the “screw it” switch will flip and it will all be downhill from there. I will then eat as much as I can because it tastes too good to stop.\n\nI am very uncomfortable in my body.\n\nThoughts like: \n“I have so much weight to lose, might as well enjoy this before I go all in”\n\n“Tomorrow I’ll start again”\n\n“I only ever feel satisfied when I’ve eaten it all so why not”\n\nI just want peace. \n\nAny help/advice/experience? X",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/u6dclt/how_to_beat_the_screw_it_urge/",
  "score": 56,
  "num_comments": 8,
  "comments": [
    {
      "id": "i57q2zb",
      "author": "Organic_Werewolf_317",
      "body": "Are you in therapy or any sort of treatment, if that’s accesible to you? If not, please please seek it out if you can. What you’re referring to is commonly known as the “last supper”, eating all the “unhealthy” foods you can so you can “get back on track” tomorrow or next week or whenever. \n\nWhen I was in treatment, I ate “junk food” every single day for two months. I had restricted and only binged on them for so long that I craved them constantly and felt so guilty every time, but after a couple months of allowing myself to eat them whenever I wanted, those foods no longer have that power over me. I don’t eat a pint of ice cream or an entire bag of chips in one sitting anymore because I know I can always have more later, so there’s no scarcity mindset. \n\nI’m definitely unhappy with and uncomfortable in my body, have gained a lot of weight in the past year of treatment, and I still have a long way to go in recovery.  But I finally feel at peace with so many foods that used to have such control over me, and I hope you’re able to find the same peace someday.",
      "created_utc": 1650293249.0,
      "score": 16,
      "context": []
    },
    {
      "id": "i57i97o",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1650289856.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i581dh4",
      "author": "ThatQuietGirl314",
      "body": "In addition to therapy, mindfulness can be very helpful with this line of thinking. Putting effort into preparing food, developing good mealtime habits, and understanding your triggers are good ways to maintain a healthy easting mindset. Think about what initiates these thoughts. Is it stress? Are you so hungry that you feel the urge to eat a lot? Is there a scarcity mindset (It will be awhile before my next \"cheat day\" so best make the most of it.)? Be aware of these factors and develop strategies to handle challenges when they arise. \n\nAn additional approach would be removing the restriction mentality. Work to erase thought patterns along the lines of \"food x is bad\", \"no more x food for x period of time\", \"it would take x to burn of this\", \"I ate x now x bad consequences\", etc. Take time when you eat to erase the binge mentality (spacing meals and snacks, giving yourself a bit of time before you get seconds etc.)",
      "created_utc": 1650297832.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5a4enz",
      "author": "hurrduhhurr",
      "body": "I know I can't have it in the house if it's a \"binge\" food. For me, I know this would be chips, candy, or cookies. I will get them out in public as treats in small portions so I know I cannot over indulge. \n\nAlso, it was told to me, \"If you get a flat tire on your vehicle, you wouldn't slash the other three\".",
      "created_utc": 1650329249.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5aljti",
      "author": "fourcornersbones",
      "body": "I try to think in smaller increments so that way the damage isn’t as bad. Instead of having a bad day, try to reframe it as a bad meal. Maybe I had a really unhealthy lunch, that doesn’t mean I need to mess up my dinner. Or AM vs PM.",
      "created_utc": 1650336742.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5crogg",
      "author": "0-768457",
      "body": "I’ve heard this comes from restricting \n\nLike\nI’m going to just use broccoli for an example because broccoli is a food that’s neutral to me, I don’t mind it, but I don’t adore it either. Feel free to substitute with anything that fits the description for you. \n\nIf someone just sets a bowl of broccoli in front of me, I might have a couple of pieces, maybe a little more if I’m just in a broccoli mood that day, but probably not very much. I’d just have as much as I want, and then be done. \n\nNow, if someone set that bowl in front of me and said “You can’t have this. It isn’t for you. Don’t touch it, you can’t have it.”\nThat would make me *want* it. That would make me react as if this is a scarce thing. So, whenever they did let me have some, I’d probably take a lot of it. \nNow, maybe this wouldn’t happen the first time, but if I learned the pattern that broccoli isn’t allowed 90% of the time, then, during that 10% where it *is* allowed, I would go overboard. \n\nIf using a food here doesn’t really click as much, you could replace the bowl of broccoli with a specific video game, or a book, or a website, or a musician. \n\nBy limiting something and mentally labeling it as “bad,” you’re making it something of a ‘forbidden fruit,’ which makes you want it more and makes you think it’s limited, so, when you actually do have it, you go overboard because you don’t know when you can have it again. \n\n\nI tested myself with this by giving myself to have ice cream whenever I wanted. Still had a lot of issues with other foods, but ice cream, I just let myself go nuts. For the first few weeks it was BAD, I had a big carton (?) of ice cream in like three days and then got another one immediately after. I was going through it like crazy for the first three weeks or so. Then I slowed down a little, a carton lasted over a week. Now I’m capable of having ice cream in the freezer for over a month, easily, not because I restrict myself, but because I just don’t want it. And when I do want it, I have a bowl, and then I’m fine. I don’t go as crazy over it because I know it’s there whenever I want. \n\nI would honestly recommend trying to give yourself permission with at least one of the foods you mentioned, because that “might as well” type of thought really did go away after I decided that ice cream was ‘allowed’\n\n(I will say it wasn’t an instantaneous guilt free thing, it took me a while to get to where I stopped feeling as guilty for it, but when I decided that guilt or not, I *deserve* some goddamn ice cream, that binge urge went down drastically)",
      "created_utc": 1650382351.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i58dslx",
      "author": "None",
      "body": "I can definitely relate, I’m sorry your going through this. Here’s what helps me, it’s not a sure fire solution but it can’t hurt. \n\n1. (This one is cheesy but I think it’s important) Remind yourself this is apart of the processes, urges happen, binges happen, that doesn’t mean you’re any further from getting better. It will take many tries, just like everything, so at least now you’ve gotten one more bump in the road behind you. \n\n2. Okay, actionable thing; don’t restrict too much. Often when we get strong urges like this it’s from built up desires finally surfacing. It’s tempting to eat as little as possible but that will make you desire more food and eventually that desire will be too much. \n\n3. Similarly, plan for minor indulgences. If we stop ourselves from having our favorite foods, the desire to have them will just get stronger. It’s better to plan for it then let it unfold when the fuck it switch comes up. It also is just a healthier lifestyle, the goal should be a healthier relationship with food. It’s okay to have treats here and there. Also, I think the planning thing can help prevent the fuck it switch from being flipped. It does for me, anyway. \n\n3. When the fuck it switch does get flipped (it will happen and that will be okay), I like to reset immediately. For me, the “I’ll start tomorrow” is usually a trap (insert Bo Burnham, “but tomorrow never comes, it’s always today. Makes Annie more depressing” lol). Starting tomorrow rarely works for me so I will literally say out loud “I’m starting right now.” Sure, I had too much food but I don’t need to let myself become victim of the sunk cost fallacy, I can get back on the horse right now. If fact, it’s easier to do it then because I just ate a lot lol. I can just have a normal sized dinner and be perfectly satisfied. \n\n\n\nAnyway, that’s what works for me. Hopefully at least one of them will help, I hope you take the first one to heart especially. A lot of this is a mind game for me so I’ve found changing my mindset is huge. For me, thought spirals are public enemy number one but you can catch them with intentional and generous thoughts. Best of luck, OP! You’re don’t better than you know!",
      "created_utc": 1650302811.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5bhrqq",
      "author": "desconocio84",
      "body": "You just described how I feel every day, I also don't know how to stop. The only things that makes me at least try the next day is the fact that my dad had the same problem with tobacco and tried really hard as a child to help him stop and nothing worked, 2020 he lost a lung to cancer. I don't want my possible future children to feel like I'm killing myself slowly and they can't do anything about it. Remember why you are tying to heal, for me is the family I want to have, were my kids can have a healthier childhood than me. For you it could be all the things you want to do with your life, think of swiming in the sea, feeling the fresh air of a mountain or going to a music concert. Not getting better will eventually prevent you form doing the things that you love.\n\nMost times this thought don't help when I'm falling down a spiral at 3am but then I just remind myself that the spiral will only last a few hours and that after that I will actually see what I want to do (like getting period craps like \"ok it's going to be exactly 52h, after that I'll feel better\") I hope it helps!",
      "created_utc": 1650357549.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i57io3t",
      "author": "None",
      "body": "I behave in the exact same way when I restrict and when I eat balanced. Which is what is so frustrating!!",
      "created_utc": 1650290046.0,
      "score": 2,
      "context": [
        {
          "id": "i57i97o",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1650289856.0
        }
      ]
    }
  ]
}