{
  "id": "u6hueu",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1650301002.0,
  "title": "Anyone frustrated when looking back at their childhood?",
  "selftext": "I (twenty five f) am working towards recovery from my eating disorder. I’ve started therapy, and I’m doing so have really been looking at moments from my childhood where I exhibited ED behavior. Like, as young as seven.  Everyone in my family is overweight, and I am as well, so it was largely brushed off. There are moments I can clearly remember binging and my parents knew about it. They scolded me for eating so much and hiding it but never actually did anything to try and address it. Anyone else have similar experiences? It’s very frustrating to look at as an adult. I’m also the youngest of 6 kids, so it’s not like I was their first.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/u6hueu/anyone_frustrated_when_looking_back_at_their/",
  "score": 43,
  "num_comments": 20,
  "comments": [
    {
      "id": "i58rfp2",
      "author": "tbw95",
      "body": "Yes. A bit different. My sisters and I (4 total) were all taught terrible eating habits as children. Punished if we did not eat everything on our plates (eating past the point of fullness) for any meal. I can remember my sister being incredibly uncomfortable and full but being forced to stay in her high chair until everything was eaten. At the same time our parents always criticized our weight in front of the others, and still tell us we look “great” if we’re an “acceptable” weight. As young teens and adults, all of us developed eating disorders (bulimia, anorexia, binge eating, etc.) and have continuously cycled through them.",
      "created_utc": 1650308243.0,
      "score": 21,
      "context": []
    },
    {
      "id": "i58hceq",
      "author": "None",
      "body": "Oh god, yes. This describes me so well. My family is overweight, I would eat too much, I ate alone when at all possible, I was clearly self conscious about my body (wearing jackets in 90F weather, never swimming without a swim shirt, etc.). Like, how did nobody say anything? In hindsight I’m pretty sure my mom and brother have had a history with eating disorders and they just don’t talk to me about it. Then suddenly, I get in shape and they all complain about how skinny I am. It’s so frustrating. \n\nMy rant aside, I absolutely relate. It’s hard to look back and not wonder why an otherwise loving family ignored obvious signs. I try to give them the most generous interpretation I can, maybe they genuinely didn’t see it. Maybe they tried to correct behaviors in ways I didn’t see so that I wouldn’t feel bad. It’s definitely hard though. Thanks for the excuse to vent, OP lol. I definitely understand where you’re coming from.",
      "created_utc": 1650304230.0,
      "score": 11,
      "context": []
    },
    {
      "id": "i59e0ex",
      "author": "rileyyj001",
      "body": "Jesus, what I would give to have just 30 seconds with my 4-year-old self 😕",
      "created_utc": 1650317558.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i594rsy",
      "author": "ExperienceRough",
      "body": "My family was incredibly indulgent. I always had so many snacks and treats, and a big dessert every night after my massive meal. We would have massive spreads of snacks for movie nights and things like that. I noticed I would eat way more than my friends in social settings. I’m 5’4 and my highest weight was around 165. I was constantly called fat and told I needed to lose weight. Now that I’m 130 and try to eat normal portion sizes at events, I’m criticized for that as well and it’s assumed I’m starving myself. No one is supportive either way. Also told frequently by older family members that I won’t be able to keep it off and it will come back. (I am in my 30s so hardly have the metabolism of a teen/20 year old so not sure what they’re getting at.)",
      "created_utc": 1650313651.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i59mckl",
      "author": "None",
      "body": "Yep. I was a chronic overeater  I'd have 3rds of dinner if there was enough food. Sometimes if eat my brothers portions before he got home and get in trouble",
      "created_utc": 1650321304.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i5an3ku",
      "author": "fourcornersbones",
      "body": "Yup.\n\nI have felt fat and enormous literally my entire life. I remember crying when I (measurements) >!first weighed 100 lbs. I was 13 and 5’5”, so it was absolutely a healthy weight and I was very active and muscular!<. It still wrecked me.\n\nLooking at pictures, I can see I was a healthy and active child, but I’ve always felt disgusting.",
      "created_utc": 1650337453.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i5bfrmo",
      "author": "AinoNaviovaat",
      "body": "Hell yeah. \nI was forced to eat everything on my plate even if the texture bugged me (autism) but at the same time mom banned all unhealthy food from the house, so we never had pizza, junk food, chocolate, Nutella, nothing.\nGuess who started binging in secret?",
      "created_utc": 1650355829.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i5b6m72",
      "author": "nintendopee",
      "body": "not with ED, but with other mental health issues like social anxiety. i feel bad for my younger self. so lost and alone battling these terrible thoughts on the daily, having such trouble coping on a day to day basis doing simple tasks. i feel like my childhood/teen hood was wasted obsessing over things that didn’t matter. time i can’t have back.",
      "created_utc": 1650348505.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i5cnfmv",
      "author": "justhereforclits",
      "body": "Looking back on childhood, I realize my eating disorder was developed as the only controllable I had in my situation. My parents were both so emotionally abusive and then neglectful + unavailable that it made sense I found something to place my focus on.\n\nThe perpetuation of the eating disorder is what hurts me most. Ya know when you look back at little-you and you're just like UGH SHE JUST NEEDED HELP.\n\nI had a mental breakdown getting ready for an Easter celebration when I was 15/16.... my dad's solution was to DVR a documentary on a French woman who lived her entire life with active anorexia and died, them forced me to sit and watch it by myself a day or so later.\n\nMy mom's solution from 9 and up was to offer me tips!!!!!! Think about gross stuff to make yourself nauseous, if you're just going to throw it up make sure you don't eat expensive food, here is some generic brand Adderall alternative to suppress your appetite. \n\nIt's really easy to get angry and feel down about it. When that happens I try to remind myself that I am here for me now, even though I wasn't always on my own team, and I can care for and love myself better than they ever could, and then we try to do one thing to support current-me.",
      "created_utc": 1650380734.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i5cyhsp",
      "author": "abdamschroder",
      "body": "What's worse for me is that one of my parents was in a treatment facility for an ED when I was little- I didn't find that out until recently. I definitely displayed behaviors my parents should have picked up on, particularly since one of them was also struggling. It's so hard as an adult to start the healing journey.",
      "created_utc": 1650384981.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5anqap",
      "author": "elainebenes_",
      "body": "Hi there- I’m not sure that I’ll be of much help but I just wanted to genuinely apologize for the pain you felt growing up. I developed my eating disorder when I was around 11 and was heavily influenced by a family member. At 27, I look back at those days with genuine compassion for my younger self- even though I actively battle with ED. Internal Family Systems (IFS) is a really effective therapy that I’ve used for other parts of my life; I think it would be helpful to look at that part that feels angry and validate it. And then ask it how it’s going to help you moving forward and give it lots of understanding and love. You are doing the best you can/ when you were a kid and where you are right now.",
      "created_utc": 1650337733.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5coh6r",
      "author": "romansanrio",
      "body": "yes. i often remember when i was in middle school i had this crush tell me he didn’t like me bc i was fat so i began to sorta like fast. i wouldn’t eat breakfast or lunch in schools only eat dinner at home and i lost some weight but i think that was the start of my bad relationship with food. \n\nthen in high school i got really depressed and i just sorta ate whatever would make me feel happy and i gained so much weight.  by the time i turned 18 which was when i weighted the most ever i got depressed again and it had the opposite effect. eating no longer made me happy so i ate a lot less and i did lose some weight gained it all back during the pandemic. \n\ni had a breast reduction shortly after the lockdown and i am not happy with the results so i wanted to work on myself and my eating habits but i never had good eating habits to begin with and i don’t have the time to LEARN to eat better so now i’m on like a really restrictive diet. i have lost a ton a weight but my health is all over the place and whenever i think about my eating habits in the past i do get kinda angry for having such bad eating habits but it also get sad bc i feel like i’ll never get back to a place where I don’t restrict what i eat. i won’t ever have that freedom again food simply does not make me happy anymore. \n\ni’ve been overweight for as long as i can remember i always kinda blamed it on my family being overweight but i never had a good relationship with food. i’d just eat what they gave me. (my family is hispanic so the food is definitely not healthy but it’s what i was raised with). it feels like i’m too old to revert the damage. maybe some day i won’t hate eating as much.",
      "created_utc": 1650381141.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5d9mhu",
      "author": "Placeboeff",
      "body": "What really upsets me is memories coming up about comments on my body/weight as a child. Comments like that, especially coming from loved ones, can lead to so much damage.. I'm constantly living in fear of those comments being made once again.",
      "created_utc": 1650389200.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i58g170",
      "author": "tmackenzie99",
      "body": "I’n away I’m happy as it made me who I am today",
      "created_utc": 1650303708.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i58fu9u",
      "author": "tmackenzie99",
      "body": "I can relate I suffered fail\nAnorexia from the age of 8 for 3 years",
      "created_utc": 1650303631.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i58v48g",
      "author": "None",
      "body": "So sorry you all went through that. It seems that unfortunately this is much more common than I anticipated.",
      "created_utc": 1650309760.0,
      "score": 6,
      "context": [
        {
          "id": "i58rfp2",
          "author": "tbw95",
          "body": "Yes. A bit different. My sisters and I (4 total) were all taught terrible eating habits as children. Punished if we did not eat everything on our plates (eating past the point of fullness) for any meal. I can remember my sister being incredibly uncomfortable and full but being forced to stay in her high chair until everything was eaten. At the same time our parents always criticized our weight in front of the others, and still tell us we look “great” if we’re an “acceptable” weight. As young teens and adults, all of us developed eating disorders (bulimia, anorexia, binge eating, etc.) and have continuously cycled through them.",
          "created_utc": 1650308243.0
        }
      ]
    },
    {
      "id": "i58ixta",
      "author": "None",
      "body": "Thank you for responding!!\nI’m so sorry you’ve experienced this as well. I have memories of crying in a dressing room at like 15 because nothing fit and my mom was like “yeah it sucks right, sometimes that’s just how it is”. I really thought that this was normal. It’s not. My family still has issues with food and the way they talk about it is horrible. Avoiding conversations about it recently has been helping a bit. \nIf you ever want to rant/vent you’re more than welcome to message me and we can talk :)",
      "created_utc": 1650304858.0,
      "score": 4,
      "context": [
        {
          "id": "i58hceq",
          "author": "None",
          "body": "Oh god, yes. This describes me so well. My family is overweight, I would eat too much, I ate alone when at all possible, I was clearly self conscious about my body (wearing jackets in 90F weather, never swimming without a swim shirt, etc.). Like, how did nobody say anything? In hindsight I’m pretty sure my mom and brother have had a history with eating disorders and they just don’t talk to me about it. Then suddenly, I get in shape and they all complain about how skinny I am. It’s so frustrating. \n\nMy rant aside, I absolutely relate. It’s hard to look back and not wonder why an otherwise loving family ignored obvious signs. I try to give them the most generous interpretation I can, maybe they genuinely didn’t see it. Maybe they tried to correct behaviors in ways I didn’t see so that I wouldn’t feel bad. It’s definitely hard though. Thanks for the excuse to vent, OP lol. I definitely understand where you’re coming from.",
          "created_utc": 1650304230.0
        }
      ]
    },
    {
      "id": "i5driwz",
      "author": "None",
      "body": "Yep. I completely understand that. Whenever my family starts talking about food/body appearance/weight, I just ask to change the conversation.",
      "created_utc": 1650395902.0,
      "score": 1,
      "context": [
        {
          "id": "i5d9mhu",
          "author": "Placeboeff",
          "body": "What really upsets me is memories coming up about comments on my body/weight as a child. Comments like that, especially coming from loved ones, can lead to so much damage.. I'm constantly living in fear of those comments being made once again.",
          "created_utc": 1650389200.0
        }
      ]
    },
    {
      "id": "i58hy91",
      "author": "Eastern_Low6498",
      "body": "In what way did it help you? Everyone says everything happens for a reason but I can't think of a single reason for my ED. Its done nothing but ruin my life and i absolutely hate it.",
      "created_utc": 1650304468.0,
      "score": 3,
      "context": [
        {
          "id": "i58g170",
          "author": "tmackenzie99",
          "body": "I’n away I’m happy as it made me who I am today",
          "created_utc": 1650303708.0
        }
      ]
    },
    {
      "id": "i58ke2x",
      "author": "None",
      "body": "Those dismissed “it happens” comments are the worst, they’re so frustrating. If it isn’t a normal thing then they’re gas lighting you but even if it is a normal thing they’re ignoring your emotions entirely. Sorry you’re dealing with that, makes it hard to talk to them at all. \n\nAnd that’s so kind! I really appreciate the offer, that means a lot! If you ever need the same I’m happy to help where I can!",
      "created_utc": 1650305436.0,
      "score": 5,
      "context": [
        {
          "id": "i58hceq",
          "author": "None",
          "body": "Oh god, yes. This describes me so well. My family is overweight, I would eat too much, I ate alone when at all possible, I was clearly self conscious about my body (wearing jackets in 90F weather, never swimming without a swim shirt, etc.). Like, how did nobody say anything? In hindsight I’m pretty sure my mom and brother have had a history with eating disorders and they just don’t talk to me about it. Then suddenly, I get in shape and they all complain about how skinny I am. It’s so frustrating. \n\nMy rant aside, I absolutely relate. It’s hard to look back and not wonder why an otherwise loving family ignored obvious signs. I try to give them the most generous interpretation I can, maybe they genuinely didn’t see it. Maybe they tried to correct behaviors in ways I didn’t see so that I wouldn’t feel bad. It’s definitely hard though. Thanks for the excuse to vent, OP lol. I definitely understand where you’re coming from.",
          "created_utc": 1650304230.0
        },
        {
          "id": "i58ixta",
          "author": "None",
          "body": "Thank you for responding!!\nI’m so sorry you’ve experienced this as well. I have memories of crying in a dressing room at like 15 because nothing fit and my mom was like “yeah it sucks right, sometimes that’s just how it is”. I really thought that this was normal. It’s not. My family still has issues with food and the way they talk about it is horrible. Avoiding conversations about it recently has been helping a bit. \nIf you ever want to rant/vent you’re more than welcome to message me and we can talk :)",
          "created_utc": 1650304858.0
        }
      ]
    }
  ]
}