{
  "id": "ua0zd7",
  "subreddit": "EatingDisorders",
  "author": "Florplesmug",
  "created_utc": 1650703201.0,
  "title": "Is there an eating disorder where you basically cannot stop eating?",
  "selftext": "Like the title says, I am curious/concerned. To clarify, I mean eating but not purging. Basically CONSTANTLY eating on some level, but not just snacking. Outright having extra meals in the middle of the night or early in the 4am black sky mornings? I ask because I cant find any information on search engines, so the algorithm might have decided I am not worthy to know what I am dealing with. I have had times when (especially when alone) I am audibly screaming at my body to stop, and still eating. I just want to know if I have some kind of basic lable to put on it.\n\nEDIT: To clarify, I am already overweight",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ua0zd7/is_there_an_eating_disorder_where_you_basically/",
  "score": 53,
  "num_comments": 21,
  "comments": [
    {
      "id": "i5v417y",
      "author": "in_the_sheyd",
      "body": "What you're looking for is an eating disorder called binge eating disorder. It's one of the more common eating disorders so most therapists and the like who work with people with eating disorders should be pretty familiar with it. I hope you're able to find the kind of support you need and are comfortable receiving.",
      "created_utc": 1650711157.0,
      "score": 45,
      "context": []
    },
    {
      "id": "i5vdz1l",
      "author": "BorderlineBarbieUwU",
      "body": "this sounds like bed to me but im not a doctor",
      "created_utc": 1650717765.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i5vvopu",
      "author": "ruggerodeceglie_",
      "body": "it is called binge eating disorder (BED). It's a real hell. I've been trough anorexia for like 5/6 months. Than, after the summer, i started bingeing until i feel like i have to throw up (i don't have bulimia, even if sometimes i try to throw up). If you think that you suffer of binge get help immediately.\nLast thing: you are beautiful, remember it :)) \n\nSorry fot any grammar error, i'm from Italy.",
      "created_utc": 1650726492.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i5xnwm7",
      "author": "cyclothymicdinosaur",
      "body": "If you're constantly hungry, or never full I would suggest going to a doctor to make sure there's nothing up with your hormones or another underlying condition. It could very well be BED, but it's best to be sure and check with a medical professional.",
      "created_utc": 1650755462.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i5v7m19",
      "author": "Anfie22",
      "body": "Binge eating disorder or food addiction",
      "created_utc": 1650713809.0,
      "score": 11,
      "context": []
    },
    {
      "id": "i5w533b",
      "author": "None",
      "body": "I’m not sure if it’s binge eating bc binges tend to be discrete instances of eating massive amounts of calories, not eating constantly. Constant food intake could be a symptom of a biological issue like thyroid imbalance, so a medical checkup would be a good idea. Hyperphagia is also a symptom of atypical depression. Also eating a lot/frequently messes up your body’s hunger and satiety cues. We have a hormone called leptin that tells us when we’re full and need to stop eating. But if we eat a lot, our bodies become resistant to leptin, so you’re basically on a downward spiral where your body wants more food bc its always getting food. \n\nThere could be other reasons; a medical professional could make suggestions and potentially suggest medication.",
      "created_utc": 1650730634.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i5w7ooz",
      "author": "killerqueen2004",
      "body": "BED, PWS",
      "created_utc": 1650731780.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5worrt",
      "author": "None",
      "body": "Compulsive eating.",
      "created_utc": 1650739283.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5w9x99",
      "author": "little_bug_person",
      "body": "I think a binge eating disorder is possibility but I would urge you to do some reading about Prader Willi Syndrome in case that’s a better fit.",
      "created_utc": 1650732762.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i5ywusa",
      "author": "None",
      "body": "Yeah it is binge eating disorder, however this can also be a result of extreme starvation, it is best to speak with a specialist",
      "created_utc": 1650779445.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5z0kqd",
      "author": "Pardijntje",
      "body": "It doesn’t sound like BED to me. Are craving the stimulation of food? Maybe you could find your answers in ADHD.",
      "created_utc": 1650782195.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5vt8ed",
      "author": "duderancherooni",
      "body": "https://www.eatingrecoverycenter.com/conditions/compulsive-overeating",
      "created_utc": 1650725378.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5vsimm",
      "author": "Menapocalypse1",
      "body": "Get to a doctor asap and ask about\nBupropion. It helps with ocd without weight gain. Good luck. Dont go this alone.",
      "created_utc": 1650725049.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i5wgarg",
      "author": "EDRD621",
      "body": "BED-like eating disorder. Doesn't need to fit the exact criteria, I would probably proceed with treatment in the exact same way with this presentation as I would for a clear case of BED.",
      "created_utc": 1650735544.0,
      "score": 0,
      "context": []
    },
    {
      "id": "i5x7fc3",
      "author": "pricklycactass",
      "body": "Yep. That’s Binge Eating Disorder, or BED. It’s very real. You can be medicated for it. I am.",
      "created_utc": 1650747770.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i5xq1s7",
      "author": "SecretEmergency4491",
      "body": "Binge eating",
      "created_utc": 1650756460.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i5yyxm5",
      "author": "OkStructure3528",
      "body": "BED. Binge eating disorder",
      "created_utc": 1650780966.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i5z0rlr",
      "author": "Gumnutbaby",
      "body": "It can be binge eating disorder (BED). But when I had episodes like this after my daughter was born I thought it was my BED returning, my psychologist diagnosed me with Post Natal Anxiety and Depression. Overeating can be associated with depression as much as stopping eating.   \nEating behaviour can be complex, it’s always good to have a chat to a therapist as there could be a number of things that need addressing.",
      "created_utc": 1650782340.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i5z0s2m",
      "author": "cotuza",
      "body": "maybe you should look into Prader Willi's Syndrome. \"People with Prader-Willi syndrome want to eat constantly because they never feel full (hyperphagia), and they usually have trouble controlling their weight.\"",
      "created_utc": 1650782351.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i5xwg1w",
      "author": "Yazoo74",
      "body": "What medication are you on for it? How long did it take to take real effect?",
      "created_utc": 1650759608.0,
      "score": 1,
      "context": [
        {
          "id": "i5x7fc3",
          "author": "pricklycactass",
          "body": "Yep. That’s Binge Eating Disorder, or BED. It’s very real. You can be medicated for it. I am.",
          "created_utc": 1650747770.0
        }
      ]
    },
    {
      "id": "i5xxvhs",
      "author": "pricklycactass",
      "body": "Vyvanse. It starts working immediately. It’s a stimulant and it makes you not hungry.",
      "created_utc": 1650760319.0,
      "score": 2,
      "context": [
        {
          "id": "i5x7fc3",
          "author": "pricklycactass",
          "body": "Yep. That’s Binge Eating Disorder, or BED. It’s very real. You can be medicated for it. I am.",
          "created_utc": 1650747770.0
        },
        {
          "id": "i5xwg1w",
          "author": "Yazoo74",
          "body": "What medication are you on for it? How long did it take to take real effect?",
          "created_utc": 1650759608.0
        }
      ]
    }
  ]
}