{
  "id": "udnd8x",
  "subreddit": "EatingDisorders",
  "author": "willieslens",
  "created_utc": 1651122389.0,
  "title": "No binge tips",
  "selftext": "im practically begging for anything to help me  right now. whether you think the tip is stupid or not please help",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/udnd8x/no_binge_tips/",
  "score": 39,
  "num_comments": 32,
  "comments": [
    {
      "id": "i6iwn28",
      "author": "super0rganism",
      "body": "This might be obvious but if your not doing this already eat breakfast lunch and dinner at regular times. Make sure it's enough and don't diet.",
      "created_utc": 1651148524.0,
      "score": 49,
      "context": []
    },
    {
      "id": "i6i59rs",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1651127021.0,
      "score": 49,
      "context": []
    },
    {
      "id": "i6j9iu4",
      "author": "PsychoticOctopus",
      "body": "There are usually two main reason people binge:\r\n\n1. Physical restriction - you are literally eating too few calories/not enough nutrients to support your body's energy needs/healthy body function and the binges are your body's way of making up for it. \r\n2. Emotional restriction - you are telling yourself that certain foods are \"off limits\" - for example, \"I can't have cookies and potato chips because these foods are bad for me\" - so eating the \"forbidden\" foods is ALLL you can think about (because that's just the way the human brain works.) \r\n\nI trust that you can figure out which one you are (it may be both). \r\n\nIf you're in bucket 1, you need to eat food - when you're hungry, when you're not hungry but know that you won't have a chance to eat for a while and will be ravenous later, at regular intervals throughout the day, until you are full. You need to eat well-balanced meals (fats, proteins, and, YES, even carbs.) You may find that you need to eat bigger meals in order to feel full than before your eating disorder, but that's okay - your body is making up for potentially years of restriction. Your hunger levels will settle eventually.  \r\n\nIf you're in bucket 2, you need to stop telling yourself that you are \"not allowed\" certain foods. You need to have these foods around and available whenever you want them. Sure, you may \"overdo\" it at first, but eventually these foods will lose their novelty (ie you will get bored of them). You will probably even find that eventually you won't want them anymore/choose to put something different on your plate instead! \r\n\nI would also look into the Intuitive Eating protocol for fixing your relationship with food (basically, it teaches you what I already mentioned above and more). There are tons of great Intuitive Eating resources online, including the original Intuitive Eating book. Good luck!",
      "created_utc": 1651154653.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i6icjsj",
      "author": "comewiththevandals",
      "body": "the distraction tips are a band aid over a bullethole. if you are malnourished there is a very good reason you feel the need to binge.\nif you arent malnourished there are other reasons like coping with emotions, boredom, and medical conditions.",
      "created_utc": 1651133158.0,
      "score": 25,
      "context": []
    },
    {
      "id": "i6ixdpf",
      "author": "shyangeldust",
      "body": "I got an app called Rise Up\n\nIt’s for disordered eating \n\nIt’s been helpful for me",
      "created_utc": 1651148921.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i6ipux8",
      "author": "apdunshiz",
      "body": "I am a recovering Disordered Eater. I still have my slips weekly, sometimes multiple times a week, but it is much more manageable.\n\nMy advice - quit dieting, quit exercising, quit counting calories\n\nFocus on yourself. Go to therapy and get on medication if necessary (I am still on medication and have been from the ages of 21 when I had severe depression and suicidal thoughts, to today, where I am 32. I am also a male.\n\nDisordered eating comes when you have mentally changed your thinking with food and what food really is. It ALL has nutrition in some way, so it is all \"good\". Do not restrict anything but that does not mean you have a free range to eat an entire box of cookies, or three, like I used to do.\n\nThe biggest thing that worked for me was changing my environment. I was in the Army and I needed in-patient treatment to get me out of the Army for 30 days. This got me semi-better but I think therapy is definitely beneficial even without inpatient.\n\nhope this helps!",
      "created_utc": 1651144459.0,
      "score": 11,
      "context": []
    },
    {
      "id": "i6l0npe",
      "author": "Puzzleheaded_Top37",
      "body": "Are you struggling with BED? Or are you restricting? If you’re restricting then it feels kinda unethical to give tips, I’m sorry. \n\nIf you’re dealing with BED (which I had before I did a fun lil ED swap🤪) then I highly recommend journaling, yoga, meditation, or literally any form of mindfulness. I know it sounds stupid and cliche, but really taking the time to listen to what your body, mind, and emotions are experiencing without judgement or shame does so much for binge eating.",
      "created_utc": 1651180022.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i6ia3k4",
      "author": "westcoast_pixie",
      "body": "First of all, if you’re hungry- you eat. Eat some grapes or some sliced cucumber. Have a big glass of icy water or some lemon water. Satisfy yourself in a positive way. Don’t tell yourself that you can’t eat anything. Write down what’s going on emotionally- are there needs that aren’t being met? Set a small personal goal for the weekend. Make a plan to declutter or decorate a space in your home. Put on a face mask and listen to your favourite song. Don’t forget to drink the water 🌻",
      "created_utc": 1651130974.0,
      "score": 10,
      "context": []
    },
    {
      "id": "i6jjp1o",
      "author": "autistmouse",
      "body": "I got past bingeing and restricting the same way, about a serving each of three foods every three hours. Setting alarms to remember when i was restricting. And setting a timer for 20 minutes to see if the urge went away when binge urges hit in between. I also had a lot of support including professional which i can’t recommend enough. But as far as a action the above is what it really came down to. Good luck, you are stronger than your urges! If you end up using a behavior try not to judge yourself. Every moment is a chance to succeed for that moment 💪",
      "created_utc": 1651158898.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i6jwi93",
      "author": "Tinslee_Bliss",
      "body": "The book Brain over Binge helped me a bit",
      "created_utc": 1651164103.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i6k0x66",
      "author": "Anxiousboop",
      "body": "Find out what triggers your binges / why you binge. Keep a small journal or a note on your phone and record anything and everything you can remember before a binge. A trigger can be anything from a feeling, a person, an interaction...anything. A binge could be a way to self soothe id avoid the stress/feeling. Once you find the trigger, find out what you can do to mitigate it and eat at regularly scheduled times.\n\nEditing to add - going for walks, A short meditation video / app, finding a song or play list, podcast, journaling, short video are great ways to mitigate a stressor / trigger to avoid a binge.",
      "created_utc": 1651165874.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i6kr7z9",
      "author": "None",
      "body": "Let go of the restriction mindset - think you can have anything in any quantities but focus on feeling good physicially especially, overtime this will guide you to achieve somewhat of a balance when it comes to food",
      "created_utc": 1651176323.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i6ik479",
      "author": "SlimJimonSaturn",
      "body": "I drink protein shake it really fills me up",
      "created_utc": 1651140116.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i6i7p3a",
      "author": "lemondrop53",
      "body": "I drink water or paint my nails. Painting my nails was a last resort but hey if you have the time you can have great looking nails too!",
      "created_utc": 1651128952.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i6i9y2p",
      "author": "Pretty_Winter_4693",
      "body": "Gum, hard candy, and lollipops! Seems kinda counterproductive at times, but I get the sugar free ones so I don't feel as guilty. I usually binge eat because I need to do something, and gum/hard candy/lollipops help.",
      "created_utc": 1651130840.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i6jg0cz",
      "author": "-Wheatley-",
      "body": "gumgumgumgumgumgumgumgumgumgumgum",
      "created_utc": 1651157374.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i6i9a6t",
      "author": "kerryrenee1995",
      "body": "I usually Whiten my teeth lol",
      "created_utc": 1651130278.0,
      "score": 0,
      "context": []
    },
    {
      "id": "i6j6275",
      "author": "newdoll455",
      "body": "Try imagine maggots all over the food. Make the image so repulsive that the thought of the food totaly disgusts you.",
      "created_utc": 1651153143.0,
      "score": -3,
      "context": []
    },
    {
      "id": "i6kmgaa",
      "author": "None",
      "body": "have a personal mirror and write “accountability Mirror” on it. David goggins type shit. that’s help me A LOt. Place sticky notes with goals on the mirror",
      "created_utc": 1651174484.0,
      "score": 0,
      "context": []
    },
    {
      "id": "i6justn",
      "author": "bellasuperstring",
      "body": "I have BED and am on medication that absolutely changed my life. \n\nHaving said that, the thing that helped me the most was to try to eat a little something every time I even thought of food. I actually read this on a post in here and it has helped me tons! When you have ED you do not have a very solid connection to when your body is actually hungry, so whenever you find yourself thinking about food chances are you probably need to eat. \n\nThis has really helped me even out my eating and get more nutritious meals without binging",
      "created_utc": 1651163414.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i6kcraf",
      "author": "Aphanizomenon",
      "body": "Meditation. Sounds weird but when you're aware of your feelings and cravings it can really help\nHeadspace has a course that's on binging",
      "created_utc": 1651170612.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i6l1w4g",
      "author": "None",
      "body": "best thing for me was just eating. eating what i had deemed off limits and keeping it in the house. you will feel out of control for a bit but after awhile you begin to lose the all or nothing mindset and the urge to binge subsides. eat as intuitively as possible and without distraction, sitting down and focusing on your meal and the satisfaction you feel from your food. check in with yourself throughout the meal and assess your fullness levels. if youre still hungry, eat! if you feel yourself reaching satiety, slow down and pause for a bit. eating what i wanted, eating enough, and being mindful whilst eating helped me gain my hunger cues and my love for food back",
      "created_utc": 1651180533.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i6l8ahu",
      "author": "Happygolucky14lev",
      "body": "I remember being super overwhelmed with my binging. I use to binge every day or even multiple times a day. What has helped me tremendously is working a 12 step recovery program. I’ve been given freedom from the binging if I work the program. It’s a solution to life because binging wasn’t my problem it was the solution I was using to cope with life. So when I have a new solution to life I no longer need to use food to manage and get by. I’d be happy to share more if helpful.",
      "created_utc": 1651183222.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i6ldgcv",
      "author": "lamp_on_a_nightstand",
      "body": "Don't restrict yourself don't diet if you eat enough and what you want regularly you won't feel the need to binge anymore, from experience",
      "created_utc": 1651185539.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i6lhkfo",
      "author": "mxssmara",
      "body": "Drink warm water :)",
      "created_utc": 1651187439.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i6juc3y",
      "author": "EDRD621",
      "body": "Agree. Temptations to binge are largely biological. It’s not until you actually eat consistently and foods that you ENJOY that you stop binging. \n\nThere are other things to work on, such as coping behaviors, but binging is largely a result of biological urges.",
      "created_utc": 1651163224.0,
      "score": 18,
      "context": [
        {
          "id": "i6iwn28",
          "author": "super0rganism",
          "body": "This might be obvious but if your not doing this already eat breakfast lunch and dinner at regular times. Make sure it's enough and don't diet.",
          "created_utc": 1651148524.0
        }
      ]
    },
    {
      "id": "i6khra2",
      "author": "Prestigious-Menu",
      "body": "This is the best piece of advice from my dietician.",
      "created_utc": 1651172629.0,
      "score": 7,
      "context": [
        {
          "id": "i6iwn28",
          "author": "super0rganism",
          "body": "This might be obvious but if your not doing this already eat breakfast lunch and dinner at regular times. Make sure it's enough and don't diet.",
          "created_utc": 1651148524.0
        }
      ]
    },
    {
      "id": "i6igwlg",
      "author": "VanillaReady9669",
      "body": "Huh. I haven't thought of this. \nMy brain is stubborn. When I say no to certain foods, it just makes me want it even more. But the later thing. \nCool. I will try it out. Thank You.",
      "created_utc": 1651137215.0,
      "score": 20,
      "context": [
        {
          "id": "i6i59rs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1651127021.0
        }
      ]
    },
    {
      "id": "i6in4gm",
      "author": "rileyyj001",
      "body": "Agree! We used a “Delay Goal” tactic in my IOP Program. Set an amount of time you can handle to delay the binge, but allow yourself to do it in the end, and each time push that amount a little more. Say 30 mins to start…next time 35…next time 40. It’s not about restricting, it’s about dealing with the urge, and understanding you *do* have the power to decide for yourself what you ultimately want to do. And if 30 mins is too much to start, do 20, 10, what ever feels manageable.",
      "created_utc": 1651142505.0,
      "score": 13,
      "context": [
        {
          "id": "i6i59rs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1651127021.0
        }
      ]
    },
    {
      "id": "i6iczhl",
      "author": "KitCatapult",
      "body": "This is a really good point. The reasons matter a whole lot. I feel like something important here would include seeking out a professional. I have a great PCP and a dietitian, though I know not everyone can access this kind of help. But yeah the \"why\" is critical.",
      "created_utc": 1651133561.0,
      "score": 8,
      "context": [
        {
          "id": "i6icjsj",
          "author": "comewiththevandals",
          "body": "the distraction tips are a band aid over a bullethole. if you are malnourished there is a very good reason you feel the need to binge.\nif you arent malnourished there are other reasons like coping with emotions, boredom, and medical conditions.",
          "created_utc": 1651133158.0
        }
      ]
    },
    {
      "id": "i6jwn0y",
      "author": "None",
      "body": "The tip to give up restrictions is met with a lot of snippiness on these forums.  In my experience.",
      "created_utc": 1651164155.0,
      "score": 1,
      "context": [
        {
          "id": "i6iwn28",
          "author": "super0rganism",
          "body": "This might be obvious but if your not doing this already eat breakfast lunch and dinner at regular times. Make sure it's enough and don't diet.",
          "created_utc": 1651148524.0
        },
        {
          "id": "i6juc3y",
          "author": "EDRD621",
          "body": "Agree. Temptations to binge are largely biological. It’s not until you actually eat consistently and foods that you ENJOY that you stop binging. \n\nThere are other things to work on, such as coping behaviors, but binging is largely a result of biological urges.",
          "created_utc": 1651163224.0
        }
      ]
    },
    {
      "id": "i6l3okh",
      "author": "EDRD621",
      "body": "Well, yeah.  Eating disorders are very difficult to recover from because there are neurological changes that really ground some belief systems - the best someone can do is actively try to throw out information they believe to be true in their mind. I often tell clients to “Check their certainty”. If you’re certain about anything, there’s a pretty high likelihood that you’re wrong. The paradox is real.",
      "created_utc": 1651181270.0,
      "score": 3,
      "context": [
        {
          "id": "i6iwn28",
          "author": "super0rganism",
          "body": "This might be obvious but if your not doing this already eat breakfast lunch and dinner at regular times. Make sure it's enough and don't diet.",
          "created_utc": 1651148524.0
        },
        {
          "id": "i6juc3y",
          "author": "EDRD621",
          "body": "Agree. Temptations to binge are largely biological. It’s not until you actually eat consistently and foods that you ENJOY that you stop binging. \n\nThere are other things to work on, such as coping behaviors, but binging is largely a result of biological urges.",
          "created_utc": 1651163224.0
        },
        {
          "id": "i6jwn0y",
          "author": "None",
          "body": "The tip to give up restrictions is met with a lot of snippiness on these forums.  In my experience.",
          "created_utc": 1651164155.0
        }
      ]
    },
    {
      "id": "i6lj2ep",
      "author": "None",
      "body": "K, but I just think it’s annoying when a person makes a post begging for any tips to help them not binge anymore, then they’re rude when you tell them they won’t stop binging if the don’t stop restricting.  Don’t ask if you don’t want to know.",
      "created_utc": 1651188145.0,
      "score": 0,
      "context": [
        {
          "id": "i6iwn28",
          "author": "super0rganism",
          "body": "This might be obvious but if your not doing this already eat breakfast lunch and dinner at regular times. Make sure it's enough and don't diet.",
          "created_utc": 1651148524.0
        },
        {
          "id": "i6juc3y",
          "author": "EDRD621",
          "body": "Agree. Temptations to binge are largely biological. It’s not until you actually eat consistently and foods that you ENJOY that you stop binging. \n\nThere are other things to work on, such as coping behaviors, but binging is largely a result of biological urges.",
          "created_utc": 1651163224.0
        },
        {
          "id": "i6jwn0y",
          "author": "None",
          "body": "The tip to give up restrictions is met with a lot of snippiness on these forums.  In my experience.",
          "created_utc": 1651164155.0
        },
        {
          "id": "i6l3okh",
          "author": "EDRD621",
          "body": "Well, yeah.  Eating disorders are very difficult to recover from because there are neurological changes that really ground some belief systems - the best someone can do is actively try to throw out information they believe to be true in their mind. I often tell clients to “Check their certainty”. If you’re certain about anything, there’s a pretty high likelihood that you’re wrong. The paradox is real.",
          "created_utc": 1651181270.0
        }
      ]
    }
  ]
}