{
  "id": "uhapmk",
  "subreddit": "EatingDisorders",
  "author": "hsushsbsisus",
  "created_utc": 1651563013.0,
  "title": "I don't even care about my weight anymore I just struggle to eat",
  "selftext": "When this started, I wanted to be thin. I'd body check and exercise. But now, I really do want to eat more. I never body check, I don't even think about my weight or body much. I just can't eat much. It makes me so frustrated I want to cry sometimes. Its like I've lost my desire for food. Has this happened to anyone else? Is this my eating disorder or could this be my depression?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/uhapmk/i_dont_even_care_about_my_weight_anymore_i_just/",
  "score": 88,
  "num_comments": 17,
  "comments": [
    {
      "id": "i74vo2v",
      "author": "No_Necessary8052",
      "body": "Literally me.  I thought being skinny would make me happy but now I regret it because I can't dig myself out of the hole.  I would guess it's that after giving your body a reason to not want to eat food, it's hard for our body to switch gears, even if our brain has.  You should look into drinking Ensure meal replacement drinks! It's helped me a lot",
      "created_utc": 1651565313.0,
      "score": 24,
      "context": []
    },
    {
      "id": "i75mgi0",
      "author": "freckles-on-a-ginger",
      "body": "Hey, I feel you, I’m in a similar boat. Part of the issue is probably your appetite shrinking and your body not being used to food. \nMaybe try to make scheduled times to eat meals, get into a routine so that you eventually start feeling hungry when those certain times roll around. \nI know it’s hard to force yourself to eat, especially if you get nauseas or anything. But it’s important to make sure you at least eat a little bit of something at your planned times so that you will eventually be able to eat more. Even if it’s not much, anything helps. \nSomeone else suggested meal replacement smoothies, which is a good idea! Other foods like apple sauce are pretty light on the tummy. \nLastly, be gentle with yourself. You’ve been through a lot and recovery is not easy. You deserve to be happy! \nGood luck, I believe in you!",
      "created_utc": 1651583722.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i760x5o",
      "author": "Ceramic-fennel",
      "body": "I also struggle with this, I don’t feel like I can get any nutrients in because I can’t stomach anything besides sweets",
      "created_utc": 1651589874.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i763ovi",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1651590983.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i75ua2q",
      "author": "uwucan",
      "body": "when i started recovery it was really difficult to eat because my appetite and hunger cues had literally left my body completely. i had to start with breakfast milkshakes ( lots of heavy cream to bulk up the calories ) in order to get anything down. over time with regular meals your appetite will come back and regulate itself normally but it takes a couple weeks of forcing yourself to get food dowm even when your body wants to reject it",
      "created_utc": 1651587171.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i768ud4",
      "author": "ButtersTheSpaceKitty",
      "body": "How long have you been in recovery for? It's okay to be at this point now but it's completely possible to work through this, it just takes time. You're re-teaching your body and brain how to eat- that's a huge amount of learning to do! \n\nTry to eat something little every three hours or so, and try to not go longer than 5 hours without eating anything. Hunger can actually make nausea/eating worse/harder sometimes. \n\nEnsures are great if you are concerned about getting all your nutrients. You can blend them up with bananas or even ice cream to mix it up a bit!",
      "created_utc": 1651592987.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i76b9pf",
      "author": "Aaron92-sadtranny",
      "body": "Yeah. I dont count calories, i dont want to be thin, i dont feel guilty when i eat. I just feel very unconfortable with food, i dont like eating, and many foods disgust me. I am tires of feeling weak, but i cant help it, i just fast",
      "created_utc": 1651593925.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i75mb3b",
      "author": "None",
      "body": "I’ve run into this as well. I lost a lot of weight from not eating and now that I’m ready to start eating, being healthy, exercising, I can’t get myself to stomach a reasonable/livable amount of calories.",
      "created_utc": 1651583650.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i781lvc",
      "author": "codys1822",
      "body": "I can definitely relate. I had to “eat mechanically” for a while…frequent meals regardless of hunger. The meals had to be calorically dense as well. After a little while of doing this, the hunger cues started kicking in. It is easy to backslide, though. You need to be consistent with this for a while before things start to normalize.",
      "created_utc": 1651619757.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i787o85",
      "author": "Ironicbanana14",
      "body": "I have the same problem. Food smells so good or looks so good, but when i actually eat, it doesn't even taste as good as it smelled... this happens with everything i eat. Then i just feel really sad, unsatisfied, and i dont want more than a couple bites.",
      "created_utc": 1651622628.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i78sb4e",
      "author": "thebillboardssaid",
      "body": "i’m going through this too :( i also have depression so it definitely could be emphasized/enabled by that. it’s so hard",
      "created_utc": 1651631906.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i7ebi05",
      "author": "InsuranceThink7660",
      "body": "I dont really know what’s happening to me but i have not been on a weight loss journey but my symptoms are pretty similar, before i eat i start to feel sick, sometimes even the thought of food makes me feel sick, i have stopped having breakfast and sometimes lunch just because i cant seem to get myself to eat, i try to force myself to eat but it doesnt work, am I suffering from an ed because honestly i just want to know what’s happening, my sister was bulimic for 2 years but i dont think i am as i dont force it out, i cant even get it in, i dont feel nauseous or anything just dont want to eat, anyone know what this is?",
      "created_utc": 1651733681.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i76nb1q",
      "author": "None",
      "body": "I went through the same phase when I went into recovery last year. It was about 3 months were I just would barely eat, not because I wanted to lose weight but because everything just seemed disgusting to me. It would take so much energy to eat anything. I made a lot of smoothies so I could just sip throughout the day to get at least some stuff in. It got better, but it took time. I also struggle with depression so this could be a factor that’s affecting your desire for food as well. \n\n\nMaybe try going to the grocery store and looking for foods that have a higher calorie and nutrition level. Even if it’s high calorie wraps with some chicken and lettuce inside. Even animal crackers with apple sauce! I went through a phase where I ate that a lot. Carrots with ranch dip (so good omg!). \n\nThe less you feed your body the worse it gets. I think you have to train yourself to want to eat again after so many years of food being the enemy. \n\nIf you have a good support system bring them to the grocery store with you and get them to show you foods they like to eat. There is so many things I would avoid when I was restricting so it’s like you don’t even know what to eat anymore.\n\nAnd if you are comfortable with going out to eat get your support system to help you choose your food. It may sound dumb but going out to eat the first few times for me was seriously traumatic and so stressful. A few times I went to some nice restaurants and just got chicken nuggets 😂😂😂 I had a very toxic ex at the time and he would get so mad at me for not being able to decide what I wanted. Make sure you are surrounded by supportive people, it’s huge for recovery. \n\nAlso go to a nice coffee place like Starbucks or Tim hortons (Canadian here). And get a super fun drink that you wouldn’t usually get. Now that you have been able to let go of the obsession with the scale and have a healthier view of your body it’s time to experiment!! Ask the barista to make you their favourite drink!! The first time I went to Starbucks in my recovery was such a milestone to me. It’s truly the little things. \n\nIf you ever need to chat feel free to message me. But it does get better. ❤️❤️",
      "created_utc": 1651598587.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i77d02p",
      "author": "oliviahope1992",
      "body": "Same 😔",
      "created_utc": 1651609261.0,
      "score": 1,
      "context": [
        {
          "id": "i74vo2v",
          "author": "No_Necessary8052",
          "body": "Literally me.  I thought being skinny would make me happy but now I regret it because I can't dig myself out of the hole.  I would guess it's that after giving your body a reason to not want to eat food, it's hard for our body to switch gears, even if our brain has.  You should look into drinking Ensure meal replacement drinks! It's helped me a lot",
          "created_utc": 1651565313.0
        }
      ]
    },
    {
      "id": "i77day2",
      "author": "oliviahope1992",
      "body": "Gosh it takes me about 2 hrs when I'm alone :( I end up reheating a lot ;/",
      "created_utc": 1651609379.0,
      "score": 2,
      "context": [
        {
          "id": "i763ovi",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1651590983.0
        }
      ]
    },
    {
      "id": "i8r2z72",
      "author": "RomeoAlbertus",
      "body": "No but I came here looking for this same answer..\n I would really like to know. It makes me feel like I’m dying. I mean we are all dying lol but you know what I mean",
      "created_utc": 1652655233.0,
      "score": 1,
      "context": [
        {
          "id": "i7ebi05",
          "author": "InsuranceThink7660",
          "body": "I dont really know what’s happening to me but i have not been on a weight loss journey but my symptoms are pretty similar, before i eat i start to feel sick, sometimes even the thought of food makes me feel sick, i have stopped having breakfast and sometimes lunch just because i cant seem to get myself to eat, i try to force myself to eat but it doesnt work, am I suffering from an ed because honestly i just want to know what’s happening, my sister was bulimic for 2 years but i dont think i am as i dont force it out, i cant even get it in, i dont feel nauseous or anything just dont want to eat, anyone know what this is?",
          "created_utc": 1651733681.0
        }
      ]
    },
    {
      "id": "i77qtmr",
      "author": "Afraid_Good547",
      "body": "In recovery from ED people should be eating twice as much as a normal person. My psychiatrist wanted me to go to the psychiatric hospital but when i heard ED department had to have 5 meals a day I immediately thought hell no.",
      "created_utc": 1651614975.0,
      "score": 1,
      "context": [
        {
          "id": "i76nb1q",
          "author": "None",
          "body": "I went through the same phase when I went into recovery last year. It was about 3 months were I just would barely eat, not because I wanted to lose weight but because everything just seemed disgusting to me. It would take so much energy to eat anything. I made a lot of smoothies so I could just sip throughout the day to get at least some stuff in. It got better, but it took time. I also struggle with depression so this could be a factor that’s affecting your desire for food as well. \n\n\nMaybe try going to the grocery store and looking for foods that have a higher calorie and nutrition level. Even if it’s high calorie wraps with some chicken and lettuce inside. Even animal crackers with apple sauce! I went through a phase where I ate that a lot. Carrots with ranch dip (so good omg!). \n\nThe less you feed your body the worse it gets. I think you have to train yourself to want to eat again after so many years of food being the enemy. \n\nIf you have a good support system bring them to the grocery store with you and get them to show you foods they like to eat. There is so many things I would avoid when I was restricting so it’s like you don’t even know what to eat anymore.\n\nAnd if you are comfortable with going out to eat get your support system to help you choose your food. It may sound dumb but going out to eat the first few times for me was seriously traumatic and so stressful. A few times I went to some nice restaurants and just got chicken nuggets 😂😂😂 I had a very toxic ex at the time and he would get so mad at me for not being able to decide what I wanted. Make sure you are surrounded by supportive people, it’s huge for recovery. \n\nAlso go to a nice coffee place like Starbucks or Tim hortons (Canadian here). And get a super fun drink that you wouldn’t usually get. Now that you have been able to let go of the obsession with the scale and have a healthier view of your body it’s time to experiment!! Ask the barista to make you their favourite drink!! The first time I went to Starbucks in my recovery was such a milestone to me. It’s truly the little things. \n\nIf you ever need to chat feel free to message me. But it does get better. ❤️❤️",
          "created_utc": 1651598587.0
        }
      ]
    }
  ]
}