{
  "id": "uk2r0u",
  "subreddit": "EatingDisorders",
  "author": "2sad2be_rad",
  "created_utc": 1651887955.0,
  "title": "Boyfriend’s fitness journey is triggering to me",
  "selftext": "My boyfriend recently got back into fitness and is taking it very seriously. This means restricting what he’s eating, how much he’s eating, measuring everything he eats, going to the gym almost daily for hours… every time it comes up in conversation, I want to have a meltdown. Even him just telling me he’s going to the gym makes me want to cry. It’s become the source of a lot of our fights and he says I’m becoming controlling. I’m not trying to be, but hearing or seeing anything related to his physique makes me feel a million different emotions at once. How do I stop making this about me? How do I stop seeing what he’s doing and comparing myself? Feeling guilty and hating myself and taking it out on him. He asked me why I didn’t care when he was unhealthy and eating poorly, he doesn’t understand that I don’t consider what he’s doing now to be healthy… I just want to live a life without the extremes. 🥲",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/uk2r0u/boyfriends_fitness_journey_is_triggering_to_me/",
  "score": 50,
  "num_comments": 21,
  "comments": [
    {
      "id": "i7p0jdb",
      "author": "PsychoticOctopus",
      "body": "Well, first of all, have you tried explaining your feelings to him in a calm, rational manner (losing your shit when you see him pack his bag for the gym doesn't count) and asking that he tone down the fitness/calorie talk around you until are in a place with your recovery where these topics aren't triggering? If you have, and he's STILL doing it, there might be some bigger issues around him respecting your boundaries and you may want to re-evaluate whether this is your person.\r  \n\r  \nIf you haven't, I would have the conversation with him and see how he reacts. Here are some tips that I think might help:\r\n\n1. Don't try to have the conversation \"in the heat of the moment,\" such as when he is packing his gym bag or taking out the kitchen scale to portion out his food. He won't be receptive to anything you have to say in this situation - to him, it will just look like you're \"losing your shit over nothing, again\" and that you're \"crazy.\" \r\n2. Keep in mind that, just like you, he is human and does not always have the emotional bandwidth to be receptive/empathetic to what you are about to say. I would start by making him aware that you need to have a conversation, but letting HIM pick when and where he is ready to talk: \"hey, I have a couple of things that I really need to talk to you about, but I don't want to do this until you feel like you are in a space where you can give me like 30 minutes to talk about it. This isn't anything bad or alarming, there's just a few things about me that I wanted to open up and share with you - let me know when you are ready for me to do so.\" \r\n3. When you are having the conversation, make sure that your language is \"me-focused\" and not \"him-focused.\" For example, don't say: \"when **you** take out the kitchen scale to measure your food **you** make me feel like **you** think I'm fat and **you** would be more attracted to me if I lost weight.\" This kind of language is likely to make anyone feel accused and defensive. He will probably just come back with \"well, I didn't **intend** to make you feel that way - sounds like this is your own issue.\" Instead, try saying: \"hey, I know that this will sound irrational, and please know that I'm aware that this is completely **my** own issue, but **I** just need you to know that when **I** see you take out the kitchen scale to measure your food **I** get this little ED voice inside **my** head telling **me** that **I** need to eat less and it reminds **me** of a time when **I** was really struggling with **my** ED.\" He can't really argue with how you feel.\r\n4. To the extent that you're comfortable, try to explain the nuances of your eating disorder. He might just not be aware. He can't be empathetic or know how to help you unless you can get a little vulnerable and let him in on what you're going through. Try saying something like: \"You know that little ED voice I hear when I see the kitchen scale? When I was ill, this little voice always told me that I need to eat fewer calories/burn more calories than everyone else. It lead me to do some really unhealthy things with my diet and exercise. I am so much happier now that I am in recovery and no longer doing these behaviors, but when I start hearing that little voice again it makes me scared that I am relapsing into my ED.\"\r\n5. Let's be honest, having a partner that you can't talk to about your hobbies/interests can feel really shitty - let him know that ED recovery is a journey, and that you won't be in this place forever: \"Please know that one of my main goals in recovery is to be able to talk about workouts and calories with you without feeling triggered - and I know that I'll get there eventually - but I'm just not there yet.\" \r\n6. Finally, do it in a kind and empathetic way, but set a clear boundary in terms of how you want to proceed in this relationship: \"You have been working so hard to make positive changes for your health, and I want you to know that the rational part of my brain is so happy for you/proud of you. Unfortunately, the ED part of my brain is not ready to hear about it yet. I have to ask that you please stop talking about the gym/calories/etc. around me until I am a bit further along in my recovery and can hear these things without feeling triggered.\"\r\n\nThere - you just approached the conversation in a calm, collected, empathetic, and vulnerable way. You were respectful. You kept it about yourself. You communicated your needs. Unless this person is a complete monster, he can't really NOT be receptive to anything you've just said. (And, again, if he responds badly or his behavior doesn't change, please re-evaluate whether you want to be in this relationship.) \r  \nWould love an update on how it goes - you've got this and good luck!",
      "created_utc": 1651941806.0,
      "score": 15,
      "context": []
    },
    {
      "id": "i7ogku1",
      "author": "wesjag03",
      "body": "Same fucking boat. My husband and I met at 10 and have just clicked since. We were always around the same size. When dating my Ed was at its worse and he was his most active so we were Around the same size. Now I have gotten a lot better and due to chronic pain couldn’t be as active. We both gained maybe 10-15? Still very average size. Now he’s losing again and working out, etc. and I have been non stop thinking “what if he starts to weight less.”",
      "created_utc": 1651932718.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i7nv2ew",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1651919462.0,
      "score": 14,
      "context": []
    },
    {
      "id": "i7pmewr",
      "author": "annaeatk",
      "body": "I understand where you’re coming from. I love and support my partner in their health journey, but damn if I’m not jealous of how easy it seems for them. They just commit to eating healthier and working out and they get the body they want. I obsess over food and exercise and can never do it healthily I just take it to the extremes.",
      "created_utc": 1651951556.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i7nmw9b",
      "author": "bot_hair_aloon",
      "body": "I know when I was going through my ED, it really helped me that my bf was so unphased by his appearance. I can't imagine how hard this is for you. \n\nI would have a conversation with him. You need to put yourself first here. Tell him you're not comfortable being around him when he is measuring his food, it's harmful to your health to hear about calories and weight loss. If he cares about you this won't be an issue. You're health is more important than him getting shredded. Although, I'm convinced these guys have EDs aswell.",
      "created_utc": 1651912085.0,
      "score": 10,
      "context": []
    },
    {
      "id": "i7onwff",
      "author": "codys1822",
      "body": "This is tough! I’m a male recovering..and seeing anyone’s fitness journey is triggering to me, let alone a partner.",
      "created_utc": 1651936154.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i7nqmgq",
      "author": "Tea-rex-",
      "body": "Try if you can to sit down and explain that although you are happy for him and his journey, exactly why his actions are triggering. My bf got a fitness watch, I know I cannot have one in my recovery, and it was very triggering seeing him check it all the time, comment on numbers, activity etc. I explained that when you do x, it triggers this thought for me, I then feel like x, and it can make me …. (Deliberately not giving my examples). He slowly understood and stopped checking his watch in front of me. \n\nI really don’t think you’re making it about yourself, your mental health and recovery is so very important and you have to protect yourself. You’re right that what he’s doing doesn’t seem to be healthy, those are habits than can lead to an ED, so I think you can also express that you’re concerned about him given your experience.",
      "created_utc": 1651915504.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i7o3hma",
      "author": "Daddy_urp",
      "body": "I think you need to have a serious conversation with him about ways to avoid you feeling this way. He is absolutely not in the wrong here, so don’t be accusatory in the conversation or treat him like a bad guy. You need to be clear with what you need - “please don’t tell me when you’re going to the gym because it makes me feel _____, just say you’re going out” - “don’t open calorie tracking apps around me please, I feel like ____ when you do and I’m trying to avoid those feelings” - “measure your food before or after I’m in a room, seeing food  measured can trigger ___ ”. Explain why you need these things, and how his actions have made you feel, even though those feelings are irrational. Make it clear that you aren’t angry with him and that you know this is your issue to deal with, but those little changes would make life easier for you and shouldn’t disrupt his.",
      "created_utc": 1651925576.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i7n9bna",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1651901092.0,
      "score": -6,
      "context": []
    },
    {
      "id": "i7pp72r",
      "author": "None",
      "body": "Sounds like you’re on different pages and maybe you should consider your options. See a therapist that specializes in ED recovery, or break up with him if it’s too overwhelming.",
      "created_utc": 1651952829.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i7pyeqy",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1651956988.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i7olus1",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1651935213.0,
      "score": 0,
      "context": [
        {
          "id": "i7nv2ew",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1651919462.0
        }
      ]
    },
    {
      "id": "i7oz6qo",
      "author": "bellasuperstring",
      "body": "She shouldn't disrupt his life, but he can disrupt hers?\n\nHuh... blows my mind that people come to an eating disorder sub to stick it to people with ED, but here we are. \n\nI'd leave the asshole before he had time to pack up his protein powder.",
      "created_utc": 1651941204.0,
      "score": 0,
      "context": [
        {
          "id": "i7o3hma",
          "author": "Daddy_urp",
          "body": "I think you need to have a serious conversation with him about ways to avoid you feeling this way. He is absolutely not in the wrong here, so don’t be accusatory in the conversation or treat him like a bad guy. You need to be clear with what you need - “please don’t tell me when you’re going to the gym because it makes me feel _____, just say you’re going out” - “don’t open calorie tracking apps around me please, I feel like ____ when you do and I’m trying to avoid those feelings” - “measure your food before or after I’m in a room, seeing food  measured can trigger ___ ”. Explain why you need these things, and how his actions have made you feel, even though those feelings are irrational. Make it clear that you aren’t angry with him and that you know this is your issue to deal with, but those little changes would make life easier for you and shouldn’t disrupt his.",
          "created_utc": 1651925576.0
        }
      ]
    },
    {
      "id": "i7nmp76",
      "author": "bot_hair_aloon",
      "body": " I know you're trying to help but you're not meant to numbers associated with share weight, weight loss, weight gain ect ect. That can be really triggering for people. Just letting you know! Just on the ED sub, there's other subreddits where that's possible.\n\nI just read the rest of your comment. This is an ED subreddit. DO NOT encourage people to loose weight. Wtf.",
      "created_utc": 1651911909.0,
      "score": 9,
      "context": [
        {
          "id": "i7n9bna",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651901092.0
        }
      ]
    },
    {
      "id": "i7nqcpl",
      "author": "Tea-rex-",
      "body": "I know you might mean well but your comment isn’t very constructive. I think OP needs to try communicate her concerns to her partner and explain why it is triggering. I agree he won’t be doing it out of spite but that doesn’t mean he should disregard her mental health and recovery. I’ve had a similar situation with either housemates or my bf and it’s extremely difficult to navigate through that when you’re trying to move away from ED behaviours. As advice for the future when commenting on ED subreddits, please be careful and avoid stating numbers and I don’t think anyone should encourage others to lose weight or diet etc. that’s really damaging and feeds into this social idea that everyone needs to be trying to do such things and can reinforce unhealthy, damaging  actions.",
      "created_utc": 1651915250.0,
      "score": 3,
      "context": [
        {
          "id": "i7n9bna",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651901092.0
        }
      ]
    },
    {
      "id": "i7ozrug",
      "author": "bellasuperstring",
      "body": "Wow. Yeah, this is going from one eating disorder to another. Terrible idea. It's fucking scary that people come here and try to suggest something like this as a healthy solution to any ED. Mods must be sleeping.",
      "created_utc": 1651941464.0,
      "score": 1,
      "context": [
        {
          "id": "i7n9bna",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651901092.0
        }
      ]
    },
    {
      "id": "i7quq5c",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1651973002.0,
      "score": 2,
      "context": [
        {
          "id": "i7pyeqy",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1651956988.0
        }
      ]
    },
    {
      "id": "i7p43fy",
      "author": "PsychoticOctopus",
      "body": ">It seems here that your partner and OP's issue the the lack of ability to empathize and be accepting of their partners goals and hobbies. This is far more unhealthy in my opinion\n\nYou're right, it IS unhealthy - that's why it's an eating **disorder**. Honestly, I really hate that they're called \"eating\" disorders because that makes it sound like the eating is the problem, when really it's a mental health issue. OP is unable to empathize with her boyfriend (or anyone) when it comes to diet/exercise because part of the disorder is a compulsive need to outdiet and outexercise everyone else. It' actually quite isolating for the person going through it and damaging to their relationships.\n\nI'm by no means saying that it's easy to be in a romantic relationship with someone  who struggles with mental health, but if OP's boyfriend can't make allowances for her illness (and let's be honest, not mentioning your diet is kind of a small allowance), they simply might not be a good match.",
      "created_utc": 1651943351.0,
      "score": 6,
      "context": [
        {
          "id": "i7nv2ew",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1651919462.0
        },
        {
          "id": "i7olus1",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651935213.0
        }
      ]
    },
    {
      "id": "i7oyp0m",
      "author": "bellasuperstring",
      "body": "Not every diet ends in an eating disorder, but every eating disorder starts with a diet. \n\nI suspect the \"therapy\" you speak of would encourage the person with ED to care enough about themselves to leave the person who is obsessively eating/dieting/working out if they continued to display unhealthy or triggering behaviors. \n\nI think your comment is really inappropriate and quite ignorant for an ED sub. It seems like it tries to shame people with ED for trying to get away from the very thing that triggers their problems. You certainly don't have to have an obsessive gym or diet routine to be healthy. \n\nPutting up with behavior that takes you back into the throws of the *#1 killer of all mental health issues* is NOT WORTH IT.",
      "created_utc": 1651940986.0,
      "score": 4,
      "context": [
        {
          "id": "i7nv2ew",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1651919462.0
        },
        {
          "id": "i7olus1",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651935213.0
        }
      ]
    },
    {
      "id": "i7pnvau",
      "author": "vFactorized",
      "body": "Going to the gym is fine, but excessively tracking what you eat / what you spend is unhealthy. Not enough or too much can be unhealthy.",
      "created_utc": 1651952221.0,
      "score": 2,
      "context": [
        {
          "id": "i7nv2ew",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1651919462.0
        },
        {
          "id": "i7olus1",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651935213.0
        }
      ]
    },
    {
      "id": "i7pam5k",
      "author": "Daddy_urp",
      "body": "I’m sorry, I don’t know how my suggestion was me “sticking it” to OP. I don’t think anyone should disrupt anyones life which is why I suggested a conversation where she can address ways he can avoid triggering her. It would not be fair to ask him to change his habits because of her disordered eating, he has a right to eat or work out like he wants. He can make changes though that help her without disrupting his life which is what I was suggesting. I don’t think the reasonable response to your partner wanting to lose weight is “leave him”.",
      "created_utc": 1651946220.0,
      "score": 2,
      "context": [
        {
          "id": "i7o3hma",
          "author": "Daddy_urp",
          "body": "I think you need to have a serious conversation with him about ways to avoid you feeling this way. He is absolutely not in the wrong here, so don’t be accusatory in the conversation or treat him like a bad guy. You need to be clear with what you need - “please don’t tell me when you’re going to the gym because it makes me feel _____, just say you’re going out” - “don’t open calorie tracking apps around me please, I feel like ____ when you do and I’m trying to avoid those feelings” - “measure your food before or after I’m in a room, seeing food  measured can trigger ___ ”. Explain why you need these things, and how his actions have made you feel, even though those feelings are irrational. Make it clear that you aren’t angry with him and that you know this is your issue to deal with, but those little changes would make life easier for you and shouldn’t disrupt his.",
          "created_utc": 1651925576.0
        },
        {
          "id": "i7oz6qo",
          "author": "bellasuperstring",
          "body": "She shouldn't disrupt his life, but he can disrupt hers?\n\nHuh... blows my mind that people come to an eating disorder sub to stick it to people with ED, but here we are. \n\nI'd leave the asshole before he had time to pack up his protein powder.",
          "created_utc": 1651941204.0
        }
      ]
    },
    {
      "id": "i7omkgx",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1651935547.0,
      "score": -4,
      "context": [
        {
          "id": "i7n9bna",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651901092.0
        },
        {
          "id": "i7nmp76",
          "author": "bot_hair_aloon",
          "body": " I know you're trying to help but you're not meant to numbers associated with share weight, weight loss, weight gain ect ect. That can be really triggering for people. Just letting you know! Just on the ED sub, there's other subreddits where that's possible.\n\nI just read the rest of your comment. This is an ED subreddit. DO NOT encourage people to loose weight. Wtf.",
          "created_utc": 1651911909.0
        }
      ]
    },
    {
      "id": "i7p04kl",
      "author": "Waltiez",
      "body": "Well, I went from like being fat and lazy and eating fast food all the time to like eating Whole Foods, and excercising several times a week. I still eat like 2000 calories a day so I think this is a lot healthier than I was before. Sorry it’s so fucking scary to you I must have really spooked you.",
      "created_utc": 1651941623.0,
      "score": -2,
      "context": [
        {
          "id": "i7n9bna",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651901092.0
        },
        {
          "id": "i7ozrug",
          "author": "bellasuperstring",
          "body": "Wow. Yeah, this is going from one eating disorder to another. Terrible idea. It's fucking scary that people come here and try to suggest something like this as a healthy solution to any ED. Mods must be sleeping.",
          "created_utc": 1651941464.0
        }
      ]
    },
    {
      "id": "i7p0dvr",
      "author": "bellasuperstring",
      "body": "You have an eating disorder and you think you should have to accept this behavior in your life? I'm sad for you. Yeah, I hope we can all be strong enough to see other's disordered restricting and binge exercise patterns and be strong enough not to fall into them ourselves. But to think you should put yourself through that every singke day. I truly feel badly for you. \n\nNot every diet ends in an eating disorder, but every eating disorder starts with a diet.",
      "created_utc": 1651941738.0,
      "score": 2,
      "context": [
        {
          "id": "i7n9bna",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651901092.0
        },
        {
          "id": "i7nmp76",
          "author": "bot_hair_aloon",
          "body": " I know you're trying to help but you're not meant to numbers associated with share weight, weight loss, weight gain ect ect. That can be really triggering for people. Just letting you know! Just on the ED sub, there's other subreddits where that's possible.\n\nI just read the rest of your comment. This is an ED subreddit. DO NOT encourage people to loose weight. Wtf.",
          "created_utc": 1651911909.0
        },
        {
          "id": "i7omkgx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1651935547.0
        }
      ]
    },
    {
      "id": "i7q6ym9",
      "author": "None",
      "body": "It isn't as simple as \"get therapy\" though. You can be in therapy for literal years and still struggle when things like this happen, especially if it's a \"new\" trigger.",
      "created_utc": 1651960972.0,
      "score": 1,
      "context": [
        {
          "id": "i7n9bna",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651901092.0
        },
        {
          "id": "i7nmp76",
          "author": "bot_hair_aloon",
          "body": " I know you're trying to help but you're not meant to numbers associated with share weight, weight loss, weight gain ect ect. That can be really triggering for people. Just letting you know! Just on the ED sub, there's other subreddits where that's possible.\n\nI just read the rest of your comment. This is an ED subreddit. DO NOT encourage people to loose weight. Wtf.",
          "created_utc": 1651911909.0
        },
        {
          "id": "i7omkgx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1651935547.0
        }
      ]
    },
    {
      "id": "i7p17xz",
      "author": "bellasuperstring",
      "body": "I mean, yeah... this is life and death for a lot of people. So, it bothers me a lot. \n\nYour comment goes against every bit of research about eating disorders. It's made with good intent, I'm sure, but it's quite dangerous and unhelpful here.",
      "created_utc": 1651942098.0,
      "score": 2,
      "context": [
        {
          "id": "i7n9bna",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651901092.0
        },
        {
          "id": "i7ozrug",
          "author": "bellasuperstring",
          "body": "Wow. Yeah, this is going from one eating disorder to another. Terrible idea. It's fucking scary that people come here and try to suggest something like this as a healthy solution to any ED. Mods must be sleeping.",
          "created_utc": 1651941464.0
        },
        {
          "id": "i7p04kl",
          "author": "Waltiez",
          "body": "Well, I went from like being fat and lazy and eating fast food all the time to like eating Whole Foods, and excercising several times a week. I still eat like 2000 calories a day so I think this is a lot healthier than I was before. Sorry it’s so fucking scary to you I must have really spooked you.",
          "created_utc": 1651941623.0
        }
      ]
    }
  ]
}