{
  "id": "ulzeug",
  "subreddit": "EatingDisorders",
  "author": "nelson__mandel",
  "created_utc": 1652125286.0,
  "title": "To people who had anorexia as teenagers/kids",
  "selftext": "I had anorexia at 14 and had no periods for a while. It disrupted my puberty and after I started eating again my breasts never grew that much. Can anyone relate and does anyone know if there’s anything to do about it?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ulzeug/to_people_who_had_anorexia_as_teenagerskids/",
  "score": 68,
  "num_comments": 27,
  "comments": [
    {
      "id": "i7yqxzz",
      "author": "None",
      "body": "Interesting, I never thought of this until I saw your post. I developed anorexia & bulimia at 16, I also am on the smaller side, and my chest is the first place I lose weight at my skinniest I was wearing little girls bras as that's all that would fit. My back teeth are also rotted away from my bulimic period (I'm 31 now). I think it also messed my hormones up as I started getting ovarian cysts at 17 that have never gone away. I absolutely believe having an ED during those ages can mess our bodies up.",
      "created_utc": 1652128415.0,
      "score": 26,
      "context": []
    },
    {
      "id": "i7z5i3m",
      "author": "velvetforest",
      "body": "Yes; I began suffering with disordered eating when I was 12 and I also struggled for years with not feeling “womanly” bc of my small chest. What helped me was birth control! Specifically the Xulane patch has increased my breast size the most and I’m really happy with it (the Nuvaring also helped, just not as much). Hope this helps, I know how it is.",
      "created_utc": 1652134636.0,
      "score": 13,
      "context": []
    },
    {
      "id": "i7z0t41",
      "author": "luvoclock",
      "body": "i began binge eating and purging when i was about 12/13 and haven’t received recovery until last year actually. i’m 20 now and of course, my ed has stunted my physical growth. my doctor told me i’d reach 5’6 but i didn’t grow past the age of 13. my periods were always very irregular, i once went almost 8 months without a period. \n\ni do know that recovery is the best option but unfortunately i don’t think we can reverse some of the damage we’ve done to our bodies, or atleast i don’t think i can.",
      "created_utc": 1652132585.0,
      "score": 10,
      "context": []
    },
    {
      "id": "i7zan13",
      "author": "Its_Sunny_Char",
      "body": "I developed ana at 13 yo and my chest never grew or looked more womanly :/ I'm 18 and pretty much recovered now but even though I gained a lot of the weight back, it went mostly to my hips and thighs but nothing to my chest and I hate it :(",
      "created_utc": 1652136950.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i7zjruk",
      "author": "kellis744",
      "body": "Yes this happened to me. Anorexic from 15-17. My periods stopped and did not start again. My breasts basically deflated. After a few years (normal weight) I went to the dr about the periods and got an ultrasound. I had ovarian cysts that made the dr suspect pcos but she said it also could be that I really screwed up my hormones with the anorexia. I did not have other symptoms of pcos. She told me it wasn’t dangerous to not get my period, so I waited until my husband and I were ready to conceive. I needed hormone therapy via pills and shots in the abdomen but I got my period back in 3 months and got pregnant with a healthy and perfect baby girl. Since then my periods have been normal and my hormones have evened out. \n\nI was very sick from taking a new anti depressant last year and couldn’t eat much at all. My periods stopped for 2 months and I was sure they wouldn’t come back but since I have been off that medication and eating normally they have returned. I’m 34, I didn’t have a period for about 14 years.",
      "created_utc": 1652141152.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i7za83z",
      "author": "None",
      "body": "I had anorexia when I was 10-12 ish, during what should have been my growth spurt. Spurt never really emerged, I only grew a little bit and I'm the shortest one in my family. Even my mom is taller than me.",
      "created_utc": 1652136760.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i7zzrba",
      "author": "imagroovysnack",
      "body": "i took fenugreek supplements for a while (to help with weight loss) but the side effects were larger boobs and maple syrup scented body odour, and come to think of it my breast size never reduced after that. I’ve had anorexia on and off (by which i mean extreme restriction on and off) from 13yrs to age 20 currently and both putting on just a few more kgs, the fenugreek (i only took it for a few months) and not wearing any bras are the only things i can think of that contribute to my increase by 2x cup sizes. I was an A-B till about 17, now i’m more C-D. I’ve been on birth control for a while too, i don’t know if that contributes. I do recommend fenugreek though, i noticed no change in my weight loss at the time, so it won’t have any affect on anyones recovery, and it’s best noted for its health benefits (especially for pregnant women) and breast enlargement. it won’t work miracles but it’s nice. The syrup smell is a little odd but it’s better than classic sweat smell lol",
      "created_utc": 1652148322.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i807ozf",
      "author": "twinkletoeswwr",
      "body": "My breasts were super tiny, after being anorexic from age 15-17.   Then I did something that I hope others can learn from.  I succumbed to pressure from my family and got a boob job.  I just had them removed last year (after having them for 23 years) due to relentless and worsening chronic fatigue syndrome.  There is an illness called breast implant illness that looks a lot like CFS so I had them out just to see if the implant were causing my symptoms.  Now my breasts are all deformed.  But I’m happy to be small again.  How knows what they would be like if I’d never had the augmentation.  Or even never had the ED.",
      "created_utc": 1652152096.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i89j05g",
      "author": "None",
      "body": "Same here!",
      "created_utc": 1652319829.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i7zcgfn",
      "author": "flavorless-soup",
      "body": "i had anorexia when i was 13, and only managed to have my period by the time i turned 15, despite having a family of early bloomers. idk if i would consider myself lucky or unlucky (i am a trans male now), but i went from wearing little girls bras to having to wear two binders because my chest feels *too* large. i might be over-exaggerating cause of dysmorphia, i’m a C cup. either way, i mean to say that sometimes the damage can be reversed. i had a very very severe situation with anorexia, so you can really come back from anything with genetic lottery ig?",
      "created_utc": 1652137786.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i7zy8ch",
      "author": "_Axelotl_",
      "body": "I’m a male with anorexia, I’ve had it since I was 13 (about 8 years) and it stunted my growth significantly. I feel bad about it to this day and I’m very self conscious of my height.",
      "created_utc": 1652147646.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i801yzl",
      "author": "no_uapples",
      "body": "my breasts are growing too much wish we could swap. i am relapsing hard rn and i hate it here",
      "created_utc": 1652149326.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i806765",
      "author": "kevican",
      "body": "My boobs were always small, then I got pregnant and BAM. They look stupid and pornographic on my frame now that I’m breastfeeding.",
      "created_utc": 1652151360.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i80b7ys",
      "author": "apatheticthegirl",
      "body": "Hey there, great question! I developed bulimia when I was 15 and have had irregular periods since then. My boobs used to be an A cup, but around the time I turned 20, I started noticing more regular cycles. My boobs grew a bit, and now they fluctuate with my cycle; note, this could be from my hormonal IUD implanted around this time. \n\nI am now 24 and somewhat regular for periods and bra size, but now I’m starting to notice problems with my teeth. Low key pissed I was able to hurt my body so much as a teenager; recovery is 10000% the best option and lifelong mindset is so important, it just sucks knowing some of damage is irreversible… keep on brushing and flossing!!!",
      "created_utc": 1652153892.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i80ulp0",
      "author": "runninginbubbles",
      "body": "I developed anorexia shortly after my periods started aged 15. I pretty much went through a second puberty aged 21-23 after I weight restored. My breasts grew to a pretty normal size I think - well small by society standards (like a B cup). My issue is that I don't want them, I want them gone. I am so distressed by my female body it's destroying me. \n\nAnorexia definitely disrupts growth, not just physical but emotional and sexual too. Go easy on yourself, you can catch up - your body has just experienced a bit of trauma that it needs to recover from!",
      "created_utc": 1652166385.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i8156md",
      "author": "JustSad1",
      "body": "It affect my growth too",
      "created_utc": 1652175700.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i81d21b",
      "author": "UnderstandingAfter72",
      "body": "I can definitely relate to your history at least. I developed anorexia aged around 11. I had one period when I just turned 12, and didn't have another for exactly 10 years and 2 months. My breasts still grew  and were comically large compared with my body when I was very unwell, but probably not as large as they could have been given my genetics. My family is Easter European, and my shorter-than-me mother had size H cup size (UK cup sizes) in her early 20s.\n\nAt the healthy weight i usually sit at, I wear a 32E/F bra. Recently, I lost weight due to work stress and am about 1.5 BMI points below this. I'm now a tight DD or loose E cup. So personally, I store quite a lot of weight in my boobs and their size is very sensitive to weight changes. But obviously this will vary from person to person. I will note though, that my boobs did start having major growth spurts when I got my period back. I went from a loose D/tight E to the E/F in less than a year, without gaining much weight elsewhere. \n\nOther than gaining more weight, making sure you have regular periods, or getting a boob job, I don't think there is much you can do to grow them. But know that bigger breasts aren't very fun to have. Nor are they generally viewed as more attractive by men despite what we've been told to believe. So have confidence in your wonderful body!!!",
      "created_utc": 1652181692.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i81py5u",
      "author": "DiscombobulatedPay51",
      "body": "I had it when I was 17-19 and my breasts have never been very big. Even when I was at my heaviest they were only a B cup and now I’m an A cup but at my lowest weight I should have been wearing a double A or training bra. I don’t think it has to do with my eating but I suppose it could. I’ve never given it much thought\n\nI lost my period for 2 years and it’s just now come back. The flow and sexual hormones I’m feeling are much stronger than ever before but it’s completely normal otherwise. My breasts feel like they’re “filling out” slowly so maybe the two are related?",
      "created_utc": 1652188809.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i81ygrb",
      "author": "Thesocialtaco",
      "body": "So this is why my titties small ): \n\n\nI developed full blown bulimia at 16\n\nI say full blown because I had an episode around 4/5. For some reason my parents never blind twice at their child throwing up mid dinner and coming back to eat more.",
      "created_utc": 1652192612.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i822t2z",
      "author": "annaeatk",
      "body": "I had AN at 13, but I honestly don’t know if my periods ever stopped they’ve always been irregular. I also had had periods for over 2 years by the point and was told by the doc I was probably done growing so my body had been developing enough I’m not sure it really affected anything.",
      "created_utc": 1652194390.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i82d5pl",
      "author": "turnipkitty112",
      "body": "I developed anorexia at 13, and I had a very small chest before that. I never had any problems with puberty or anything, after being weight restored I grew an inch at 15, and my breasts got a bit bigger but still relatively small. I went on birth control at 16 and that made them grow a fair amount, even though I was/still am underweight. One thing is though that I only lost my period for a few months. If you lost yours for longer it might be different. I do have other lasting side effects though. EDs can really mess up your body.",
      "created_utc": 1652198467.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i82jufh",
      "author": "BooksThings",
      "body": "You’re not the only one.  I started showing signs of anorexia at 14.  That was the same year I started my period.  I do feel like it interfered with my puberty.  My breasts never grew.  I’m still an AA cup to this day.  Even after giving birth twice and having weight fluctuation over the past 20 yrs, my breast never grew much in size.  I was underweight for all of my teenage years and off and on in my early 20’s.  \n\nI always wondered if disordered eating and underweight during puberty had something to do with it.  \n\nAlso, I’m the only woman in my family with small breasts.  So, there has to be a correlation with anorexia during puberty.",
      "created_utc": 1652201079.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i82nbdi",
      "author": "fayethegaye17",
      "body": "even with my ed, i still went through that part of puberty. everyone in my family has a very Womanly Body and there was no avoiding it 😭",
      "created_utc": 1652202463.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i82vd4b",
      "author": "Purple_lotuss15",
      "body": "I developed anorexia at age 9, so I had seriously delayed menarche. Kind of makes me wonder if I messed my body up since I was restricting when my body needed that energy for puberty… I always wonder what I would look like and where my weight would’ve naturally distributed had I just eaten normally…maybe I’d actually have breasts and feel more feminine… \nI’ve restricted for 18 years and over exercised and haven’t had a period for years at a time. Having a period was (and still is) super triggering because it feels like I’m a failed anorexic…idk \n\nI’m still profoundly orthorexic into my late 20s… 18 years of restriction probably really did a number on how I developed. I screwed up my hormones and birth control never helped with my chest or the hormone issues from low estrogen.",
      "created_utc": 1652205748.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i836giv",
      "author": "None",
      "body": "Yes, mine are still flat as a board pretty much. I believe that may be just a side effect of how it inhibited our development. I had breasts (maybe a B or C cup) prior to my ED at 17 and I’m now 21 with barely an A cup. I’m not angry about it as I quite like the smaller chest but it doesn’t make me feel less feminine at times. You aren’t alone with the small chest!",
      "created_utc": 1652210245.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iai6ot3",
      "author": "fishweenie",
      "body": "i had anorexia from ages 11-14 and i was basically flat chested till i hit 17. i’m 20 now and have C cups",
      "created_utc": 1653881489.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i820otf",
      "author": "krolikzajchik",
      "body": "100% \nI’m 22, my ed started at around 11-12, I’m 3 years into recovery (had mostly bulimia which fucked up my teeth and then orthorexia) but some damage is irreversible, sadly. \nWish u the best! Take care of yourself a much as you can and it’ll get better 💞",
      "created_utc": 1652193536.0,
      "score": 1,
      "context": [
        {
          "id": "i7z0t41",
          "author": "luvoclock",
          "body": "i began binge eating and purging when i was about 12/13 and haven’t received recovery until last year actually. i’m 20 now and of course, my ed has stunted my physical growth. my doctor told me i’d reach 5’6 but i didn’t grow past the age of 13. my periods were always very irregular, i once went almost 8 months without a period. \n\ni do know that recovery is the best option but unfortunately i don’t think we can reverse some of the damage we’ve done to our bodies, or atleast i don’t think i can.",
          "created_utc": 1652132585.0
        }
      ]
    }
  ]
}