{
  "id": "unjif5",
  "subreddit": "EatingDisorders",
  "author": "edgiestl0rd",
  "created_utc": 1652301886.0,
  "title": "i'm thinking bad things and i can't stop thinking them",
  "selftext": "my friend skipped breakfast for a couple days (out of exam week stress) and fainted at school. she's okay now. but i feel extremely guilty that i envy her. even when i starved for a year straight, even when i binged and restricted for months and months, i never fainted even once. i feel this crushing guilt that i was never \"doing enough\" in the first place. i feel even worse that i'm envying someone who fainted from hunger. if i lost consciousness, it would be like a sign that what i'm doing is working...i guess. but i genuinely wonder why i never lost my consciousness even after putting my body through so much, and it's happened to someone else after a couple days. i know it's a malicious thing to envy, and i don't know what to do",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/unjif5/im_thinking_bad_things_and_i_cant_stop_thinking/",
  "score": 83,
  "num_comments": 6,
  "comments": [
    {
      "id": "i89eg9c",
      "author": "None",
      "body": "EDs are competitive. Learned all about it in treatment. It’s a very sad and jarring feeling. \n\nBut what you are experiencing is normal. It’s just the nature of the disorder, unfortunately.",
      "created_utc": 1652317848.0,
      "score": 26,
      "context": []
    },
    {
      "id": "i89u4vc",
      "author": "sandopsio",
      "body": "Try not to judge yourself for having these thought. They're an ED symptom and the fact that you suffer from them is just more evidence that your ED is serious (though evidence isn't needed—we already know your ED is serious and you 100% deserve support, recovery, help and healing).\n\nOur bodies are unique and miraculous. It's unfair and tragic that some people die just months into having an ED…different people get different side effects literally according to the climate they live in (one may have air conditioning and one may not, low sodium could cause fainting), genetics, other preexisting conditions, anxiety, breathing, some deficiencies cause an impact right away while others cause a longterm impact that appears less severe because it's spread out over time, but causes serious damage later on, sometimes irreversible. All I know is that there's no point in allowing ED to compare. There is no \"winning\" your way into \"deserving\" recovery through ED's desires. One thing I know for sure is that ED will distort your view and thoughts. You can't trust it because it lies to you about everything, this included. I know it's hard but try to talk back to your ED and know you deserve full validation from yourself. It won't come from ED no matter what you do or what happens.",
      "created_utc": 1652325065.0,
      "score": 13,
      "context": []
    },
    {
      "id": "i88nwup",
      "author": "creebeebee",
      "body": "Same 🥲",
      "created_utc": 1652305810.0,
      "score": 10,
      "context": []
    },
    {
      "id": "i896rz9",
      "author": "Possible-Mistake868",
      "body": "Ugh I feel the same way, just remember your ED is still valid and you deserve treatment in whatever forms that is❤️",
      "created_utc": 1652314352.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i8c4h8c",
      "author": "kedikahveicer",
      "body": "When I was younger, I had similar thoughts. The older you get and more it drags on, though, the more likely you _may_ faint at some point. And let me tell you. When you're about double your age, 1. fainting WILL NOT be something you have time for! And 2. it will be a massive inconvenience before it's ever something that you 'want'. \n\nI keep getting really strong waves of dizziness EVERY TIME I stand up lately, even if I do it slowly. My vision goes funny, and I get a really weird and random hot flush pulsing through the top half of my body. I absolutely wish this wouldn't happen, yet I'm powerless to change how I eat at the moment. It's awful. \n\nIn an imaginary world, it seems great. Really, though.. In real life.. it's just a massively embarrassing ball-ache.... It's not the passing out that you want really, anyway.... Believe me - you're not missing anything worth missing!\n\nLike the other commenters say, it's not your fault you feel this way. But definitely don't believe it's worth it - totally isn't! I can assure you",
      "created_utc": 1652373001.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i896uy2",
      "author": "Possible-Mistake868",
      "body": "Happy cake day!! Have some cake! Gee cake sounds delish😅😅",
      "created_utc": 1652314393.0,
      "score": 5,
      "context": [
        {
          "id": "i88nwup",
          "author": "creebeebee",
          "body": "Same 🥲",
          "created_utc": 1652305810.0
        }
      ]
    }
  ]
}