{
  "id": "up5xm",
  "subreddit": "EatingDisorders",
  "author": "thatgirlnikkib",
  "created_utc": 1339038576.0,
  "title": "For those of you who see--literally see--yourselves as fat: do you have moments where you realise how skinny you are?",
  "selftext": "I'm recovering from (recovered from, perhaps) an eating disorder, and although I can generally control my eating habits, I still suffer hugely in terms of **not being able to accurately judge what my body looks like.** It varies so much from day to day that I know what I'm seeing must not be completely true (because bodies simply don't change as much as I see mine change in 24 hours), and **it's gotten to the point where I feel like I legitimately don't know what my body looks like**.\n\nSometimes I will see myself and think I look thin. Fit. Sexy, even. I'll notice muscles and bones and a flat tummy, I'll see a generally toned body. Other days, I see a disgusting mass of fat with no real shape to it other than round, jiggly.\n\nI just want to know what I look like.\n\nDoes anyone else have this problem, recovered or no? Do you ever find yourself wondering what you look like to other people?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/up5xm/for_those_of_you_who_seeliterally_seeyourselves/",
  "score": 39,
  "num_comments": 19,
  "comments": [
    {
      "id": "c4xbrci",
      "author": "BlackstarNoBlackstar",
      "body": "Yes. I honestly can't tell. It's a very strange feeling. I don't think I have BDD, but very often I have no legitimate way to tell (for example) how much I weigh, so I use a scale. That's even worse though, because that little number dominates the rest of my day and warps my perception of *everything*. A little kid looks at me at the grocery store? If I weigh less, I think he's a just a curious kid. I still don't look great, but I don't obsess about it and my mind turns to other things. If I weigh too much, he's staring at me because I'm a whale. ",
      "created_utc": 1339042991.0,
      "score": 16,
      "context": []
    },
    {
      "id": "c4xplam",
      "author": "RosieLalala",
      "body": "I figure that people with BDD are very smart. But when it comes to self-body image, we're as delusional as the most deluded schizophrenic.",
      "created_utc": 1339120127.0,
      "score": 6,
      "context": []
    },
    {
      "id": "c4xaz54",
      "author": "sacca7",
      "body": "What you describe is very common. Remember, every woman you see in a magazine, on TV, or in a film is selling you something: a product, an article to read, a show to watch, or a movie to watch. We've a society that has developed a rather warped perspective on what a healthy woman looks like. \n\n\nI just finished watching the NOVA on Dying to be thin, [linked here](http://video.pbs.org/video/1865661292) and linked for discussion in /r/eatingdisorders, and they go into this very topic quite a bit. You might find more answers there. \n",
      "created_utc": 1339039140.0,
      "score": 5,
      "context": []
    },
    {
      "id": "c4xfa6d",
      "author": "misspolkadot",
      "body": "I'm recovered and I empathize with you on that one still.  I don't think I have a severely distorted body image, but I think I still have a hard time seeing myself for what I truly am/look like.  Most days I can see how slender and petite I am and then some days I look in the mirror and see fat and flabby parts.  Or just have general dissatisfaction.  I think it's because I kind of \"zone-in\" on particular \"flaws\" and my mind exaggerates them.  I try my best to ignore it, but that doesn't always work.\n\nIt's frustrating, I agree.",
      "created_utc": 1339074650.0,
      "score": 3,
      "context": []
    },
    {
      "id": "c4xg8tp",
      "author": "amandatoryy",
      "body": "I find it so strange, i've kind of come to terms with the fact that i see something COMPLETELY different in the mirror than everyone else.  I get really aggravated about it too, no matter what, i always assume the comment made is some sly/backhand comment about me being fat. my boyfriend the other day was talking (i forget what about, I think metabolism rates or something) saying things like \"someone as small as you\" and \"tiny\" and I literally just got so mad at him for saying I was fat.  and then I was like...but that isn't what he said?  I just took it that way.  idk, this might not make sense. but i just had to let it go because it's obviously only in my head. \n\nso yes, everyday.",
      "created_utc": 1339080004.0,
      "score": 4,
      "context": []
    },
    {
      "id": "c4z49tr",
      "author": "verysecretusername",
      "body": "It's weird how hard it is to be objective, I know exactly what you're talking about. Some days I'll think I look obese but then if I step on a scale and I've lost any weight I can look back in the mirror and the image totally changes.",
      "created_utc": 1339430165.0,
      "score": 4,
      "context": []
    },
    {
      "id": "c4z86my",
      "author": "wasthehopedrunk",
      "body": "I used to be disgusted with my body in mirrors. But slowly, there are more and more days where it hits me like a truck how sickly skinny I am. I even get to a point that I envy people with a bit more fat, healthy looking people. I have no idea if I'm recovering, I'd like to think so. ",
      "created_utc": 1339446098.0,
      "score": 5,
      "context": []
    },
    {
      "id": "c4xe93d",
      "author": "fluffigkatt",
      "body": "Yeah, it's like that for me too. Some days I feel really good about myself, I see a beautiful, thin body. Other days I feel like an elephant. It has a lot to do with my weight, though. The days I feel like an elephant are the days that I've gained weight.",
      "created_utc": 1339064186.0,
      "score": 3,
      "context": []
    },
    {
      "id": "c4xj01h",
      "author": "aislingrose",
      "body": "I appear to change weight in a literal blink of an eye. My thighs go from almost-okay to huge in a moment. And that's not even taking perspective into account. This is with diagnosed BDD, so.",
      "created_utc": 1339091625.0,
      "score": 3,
      "context": []
    },
    {
      "id": "c4xkoe3",
      "author": "LycheeBear",
      "body": "I feel like that all the time. I look in the mirror and can see all of my flaws but then I look at a picture of myself and think, wow I am pretty skinny and good looking.\n\nI guess it also depends on the day. Days when I have high self confidence I think I look better and feel like I have a more accurate image of what I look like.",
      "created_utc": 1339098279.0,
      "score": 3,
      "context": []
    },
    {
      "id": "c4xokky",
      "author": "PixelThing",
      "body": "Yes I feel the same way. I'll be laying in bed on my side feeling my hip bones and there's a hollow but then I feel so fat every time I stand or look in the mirror.",
      "created_utc": 1339115110.0,
      "score": 3,
      "context": []
    },
    {
      "id": "c57oamh",
      "author": "Sharra_Blackfire",
      "body": "Take pictures of yourself with your head/face not visible. Print them out and put them in an envelope. Wait a day or two, then look at them as if they're magazine clippings. What do you think about the body you see? Look at it for a few days in a row to see if your perception of it changes, like it does when you look in a mirror / look down",
      "created_utc": 1341063747.0,
      "score": 3,
      "context": []
    },
    {
      "id": "c5qftxr",
      "author": "TheArchduchess",
      "body": "I feel the same exact way. I work in a clothing store, so there are a lot of mirrors around. I feel like I look different in each of them. Also, I'll look at photos of myself from maybe a year or so ago, and think that I looked so much better than I do now, even if my measurements haven't changed.",
      "created_utc": 1344498864.0,
      "score": 3,
      "context": []
    },
    {
      "id": "c56ojue",
      "author": "randommegs",
      "body": "I'm currently at a healthy weight and \"recovering\" but when I was at my lowest weight wise, and considered at a very low weight, I never saw myself as skinny. I could still grab places of \"fat\" (skin) and I thought I was practically obese.  I'd catch a glimpse of jutting collar bone and hipbone in the mirror and not even realize it was me. I'd see pictures and think \"wtf, there is no way I'm that skinny\". ",
      "created_utc": 1340867782.0,
      "score": 2,
      "context": []
    },
    {
      "id": "c6t55fd",
      "author": "None",
      "body": "http://www.mybodygallery.com/\nThis site really opened my eyes as to how the world see me as opposed to how I see myself. You can enter your height and weight, clothing size or measurements, and it will show a gallery of user submitted photos of people that are the same size as you. ",
      "created_utc": 1351473727.0,
      "score": 2,
      "context": []
    },
    {
      "id": "c4xlnnw",
      "author": "Palindr0mic",
      "body": "I do.\nI have no idea what I look like. Sometimes I am thin but it is fleeting, a second or so of vision. The rest I am varying degrees of fat. My boyfriend despairs. It sucks.A lot.",
      "created_utc": 1339102123.0,
      "score": 1,
      "context": []
    },
    {
      "id": "c56p7vg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1340873246.0,
      "score": 1,
      "context": []
    },
    {
      "id": "c584p2j",
      "author": "whatshallidowithIT",
      "body": "yes. I have no idea what I look like as an aggregate being.",
      "created_utc": 1341173712.0,
      "score": 1,
      "context": []
    },
    {
      "id": "c584pd4",
      "author": "whatshallidowithIT",
      "body": "I can second this...\n(and my voices can third, fourth, fifth, sixth, and seventh it)",
      "created_utc": 1341173752.0,
      "score": 6,
      "context": [
        {
          "id": "c4xplam",
          "author": "RosieLalala",
          "body": "I figure that people with BDD are very smart. But when it comes to self-body image, we're as delusional as the most deluded schizophrenic.",
          "created_utc": 1339120127.0
        }
      ]
    },
    {
      "id": "c584zee",
      "author": "RosieLalala",
      "body": "All three of us seem to think so. ",
      "created_utc": 1341175079.0,
      "score": 4,
      "context": [
        {
          "id": "c4xplam",
          "author": "RosieLalala",
          "body": "I figure that people with BDD are very smart. But when it comes to self-body image, we're as delusional as the most deluded schizophrenic.",
          "created_utc": 1339120127.0
        },
        {
          "id": "c584pd4",
          "author": "whatshallidowithIT",
          "body": "I can second this...\n(and my voices can third, fourth, fifth, sixth, and seventh it)",
          "created_utc": 1341173752.0
        }
      ]
    }
  ]
}