{
  "id": "upskgq",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1652569317.0,
  "title": "I'm getting food anxiety around my girlfriend",
  "selftext": "I haven't eaten since breakfast with my girlfriend, plus a snack and ice cream. I've been in anorexia recovery for 10 months, June 20th marking my 1 year full recovery.\n\nI relapsed hard during lockdown in my area, but have been recovering. But recovering alone. So eating around people is new for me, and being the only one eating around people is especially challenging. \n\nShe's insisting I have dinner at her house since I've stopped by for a sleepover. Thing is, she's eating lunch an hour ago while out for her mother. My anxiety is already peeking, I want to hit my head with my hands and start crying at the thought of eating in front of her. I know she won't judge me for eating, I'm in a safe place, but this is too overwhelming to think about. \n\nOn the other hand, it's been 10 months. 10 months of recovery, and it's time I do something challenging. I don't think I can bring myself to it though. I just don't know what to do. Does anyone have any possible advice for this type of challenge? Any help would be appreciated, thank you",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/upskgq/im_getting_food_anxiety_around_my_girlfriend/",
  "score": 57,
  "num_comments": 13,
  "comments": [
    {
      "id": "i8mye6q",
      "author": "Lab-Muted",
      "body": "I know it’s hard but I think the fact that you’re willing to acknowledge that you need a challenge is your heart telling you the right thing! Take on this challenge and use the fuel and anxiousness from it to just power you even more to try your best for her and yourself especially. I believe in you so much and you can do this!",
      "created_utc": 1652572995.0,
      "score": 15,
      "context": []
    },
    {
      "id": "i8mzpgl",
      "author": "cjx888x",
      "body": "ED’s are isolating as hell, even without pandemic stuff. I feel like I make progress when I am allowed to let my anxious thoughts out to people I trust, instead of having to keep the stress all in my head. Does she know your situation? If not, maybe its time to share that? If she does know, this would be a great time to ask her for support. \n\nIf you trust her, it might help to just let her know how scary this is for you and ask her to embark in the process with that in mind.",
      "created_utc": 1652573665.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i8ndrnm",
      "author": "Giraffe_lol",
      "body": "Eating with others is one of the biggest obstacles I face as well. Just gotta remember they are not watching you. It will take some time but to me it's better to face that challenge now than have to deal with it the rest of your hopefully long relationship. I've got ARFID so I don't know how helpful this advice is if at all.",
      "created_utc": 1652580912.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i8n8nku",
      "author": "None",
      "body": "Unless she's set on a \"normal\" dinner at the table maybe you can face away from eachother/sit side by side instead of face to face? Or do something like watch a movie or play a game for the first time(s) eating together to ease yourself into it? I know the goal is eventually to eat face to face and do nothing but it's ok to take it a little bit slow sometimes. Just remember that she loves you and wants you to be happy and safe, the most enjoyable dinner together for her is going to be the one where you're as happy, relaxed, and comfortable as you can be.",
      "created_utc": 1652578264.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i8ovibj",
      "author": "Homeo_Juliet",
      "body": "You mentioned in a comment she was aware of your ED. If she truly cares for you, she will not judge you one bit. My gf is in recovery. Some days are worse than others and she can’t control her anxiety. She either gives me a certain look or will verbally tell me she doesn’t want to eat in front of me. I just go play my video games or go outside for a bit. I don’t rush her and I never get upset over it. She needs support and no judgement from her partner. As do you. I think she’ll handle it better than you think. Good luck! You got this!",
      "created_utc": 1652619276.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i8pd54u",
      "author": "so_very_trans",
      "body": "Hi there! I wanna say that I understand this struggle, though I have ‘other specified’ ED. It can be really hard. The pandemic (this may not be entirely true for you, but it could be) increased anxiety levels for a lot of people in a lot of areas, surrounding a lot of things. For me, I have anxiety and my anxiety is increased surrounding eating around people and taking my mask off. Even in positions where the anxiety isn’t logically-based (as it often isn’t,) it’s higher. \n\nThis epidemic is unlike life for any of our parents and their parents! All of this is big and new and hard! It’s ok that there’s struggle. Remember that healing and recovery isn’t linear, OP! I would say have a frank conversation with your partner. If they don’t have an understanding of your disorder yet, they need to develop some as your partner. Logistically, I mean, for the relationship to be mutually benefitting. Talk with them and say look, there’s not much rhyme or reason, but some days I can’t eat well. I just can’t do it. Explain how you feel and tell them that you’re not trying to be rude or unkind or to opt out of a date or social engagement. And that on these days you’re happy to just be with them and have quality time together.",
      "created_utc": 1652627967.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i8qkifh",
      "author": "violetgay",
      "body": "Hey, how did it go? Did you end up doing it?",
      "created_utc": 1652647011.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i8n01yn",
      "author": "None",
      "body": "I wouldn't have let myself date her if she wasn't aware. I told her on our second date so she knew what she was getting herself into, but obviously didn't let myself date her until I was well invested in my recovery. I want to ask for her support, but I'm still scared she'll judge me. she doesn't know what to do specifically, but thank you for the advice, I'll keep it in mind, this is hard but your comment helped <3",
      "created_utc": 1652573844.0,
      "score": 8,
      "context": [
        {
          "id": "i8mzpgl",
          "author": "cjx888x",
          "body": "ED’s are isolating as hell, even without pandemic stuff. I feel like I make progress when I am allowed to let my anxious thoughts out to people I trust, instead of having to keep the stress all in my head. Does she know your situation? If not, maybe its time to share that? If she does know, this would be a great time to ask her for support. \n\nIf you trust her, it might help to just let her know how scary this is for you and ask her to embark in the process with that in mind.",
          "created_utc": 1652573665.0
        }
      ]
    },
    {
      "id": "i8nfrq7",
      "author": "None",
      "body": "I'm in anorexia recovery, but believe me, this was a much needed reminder, thank you for the advice, any feedback is making my night easier, thank you",
      "created_utc": 1652581972.0,
      "score": 3,
      "context": [
        {
          "id": "i8ndrnm",
          "author": "Giraffe_lol",
          "body": "Eating with others is one of the biggest obstacles I face as well. Just gotta remember they are not watching you. It will take some time but to me it's better to face that challenge now than have to deal with it the rest of your hopefully long relationship. I've got ARFID so I don't know how helpful this advice is if at all.",
          "created_utc": 1652580912.0
        }
      ]
    },
    {
      "id": "i8peoju",
      "author": "None",
      "body": "Thank you, I was able to eat in front of her and she also ate as well before she turned her back on me to continue the baking we had initially started. Everything went well and I was able to eat three meals a day instead of skip dinner. Thank you for your advice, it'll still help me with later challenges I know I'll have to acknowledge. :)",
      "created_utc": 1652628668.0,
      "score": 2,
      "context": [
        {
          "id": "i8ovibj",
          "author": "Homeo_Juliet",
          "body": "You mentioned in a comment she was aware of your ED. If she truly cares for you, she will not judge you one bit. My gf is in recovery. Some days are worse than others and she can’t control her anxiety. She either gives me a certain look or will verbally tell me she doesn’t want to eat in front of me. I just go play my video games or go outside for a bit. I don’t rush her and I never get upset over it. She needs support and no judgement from her partner. As do you. I think she’ll handle it better than you think. Good luck! You got this!",
          "created_utc": 1652619276.0
        }
      ]
    },
    {
      "id": "i8peboj",
      "author": "None",
      "body": "Thank you for the advice, explaining the anxiety with the pandemic makes complete sense, I just had to hear it from someone as well. Thank you! I'll use your advice and talk to her soon.",
      "created_utc": 1652628505.0,
      "score": 1,
      "context": [
        {
          "id": "i8pd54u",
          "author": "so_very_trans",
          "body": "Hi there! I wanna say that I understand this struggle, though I have ‘other specified’ ED. It can be really hard. The pandemic (this may not be entirely true for you, but it could be) increased anxiety levels for a lot of people in a lot of areas, surrounding a lot of things. For me, I have anxiety and my anxiety is increased surrounding eating around people and taking my mask off. Even in positions where the anxiety isn’t logically-based (as it often isn’t,) it’s higher. \n\nThis epidemic is unlike life for any of our parents and their parents! All of this is big and new and hard! It’s ok that there’s struggle. Remember that healing and recovery isn’t linear, OP! I would say have a frank conversation with your partner. If they don’t have an understanding of your disorder yet, they need to develop some as your partner. Logistically, I mean, for the relationship to be mutually benefitting. Talk with them and say look, there’s not much rhyme or reason, but some days I can’t eat well. I just can’t do it. Explain how you feel and tell them that you’re not trying to be rude or unkind or to opt out of a date or social engagement. And that on these days you’re happy to just be with them and have quality time together.",
          "created_utc": 1652627967.0
        }
      ]
    },
    {
      "id": "i8sf34y",
      "author": "None",
      "body": "Hi! I procrastinated eating until 10 pm. while baking, I told her I'd make mac and cheese for myself, a comfort food we always ate together. (She made me promise to be honest about when i feel hungry, so I felt too guilty to continue the night feeling hungry and not communicating it, especially since we specificallyvalue honesty in our relationship.) She said ok and let me tended to my meal. I had some left over in the pot and offered her to have some without pushing, and she decided to eat with me. I told her to not feel pressured to eat with me, it would make it easier but I need to learn to overcome certain obstacles and not continue to cater to it in order to make my life easier in the mean time. She admitted, though, that she also needs to learn to eat three meals a day and ate with me. It made me happy, though, and easier to overcome guilty and anxious thoughts.\n\nShe finished earlier than me though, but while she continued baking with her back to me, I ate comfortably. I was happy I didn't end up skipping a meal, and she was comforting enough to make me feel like I was in a safe environment, judge free. I was extremely overwhelmed earlier in the day, but later, while feeling tired and talking about a few issues with my girlfriend, I was extremely relaxed and felt safe. \n\nThank you for asking how it went! I'm ok and my girlfriend expressed that she's proud of me. I know this won't be the last time I struggle, but this also won't be the last time I succeed in overcoming anxious thoughts :)",
      "created_utc": 1652680818.0,
      "score": 1,
      "context": [
        {
          "id": "i8qkifh",
          "author": "violetgay",
          "body": "Hey, how did it go? Did you end up doing it?",
          "created_utc": 1652647011.0
        }
      ]
    },
    {
      "id": "i8q8vtv",
      "author": "Homeo_Juliet",
      "body": "That’s so awesome to hear!! I don’t know you, but I am so proud of you! It may never be that easy every time. It hits my gf out of nowhere sometimes so I continue to be patient. So do not feel discouraged if you have a bad day. Or even bad consecutive days. Maybe come up with a signal you can give your gf if it’s bad and you’re not able to verbalize it without crying. I’m sure she’ll be understanding! Keep up the great work! You’re amazing!",
      "created_utc": 1652641854.0,
      "score": 2,
      "context": [
        {
          "id": "i8ovibj",
          "author": "Homeo_Juliet",
          "body": "You mentioned in a comment she was aware of your ED. If she truly cares for you, she will not judge you one bit. My gf is in recovery. Some days are worse than others and she can’t control her anxiety. She either gives me a certain look or will verbally tell me she doesn’t want to eat in front of me. I just go play my video games or go outside for a bit. I don’t rush her and I never get upset over it. She needs support and no judgement from her partner. As do you. I think she’ll handle it better than you think. Good luck! You got this!",
          "created_utc": 1652619276.0
        },
        {
          "id": "i8peoju",
          "author": "None",
          "body": "Thank you, I was able to eat in front of her and she also ate as well before she turned her back on me to continue the baking we had initially started. Everything went well and I was able to eat three meals a day instead of skip dinner. Thank you for your advice, it'll still help me with later challenges I know I'll have to acknowledge. :)",
          "created_utc": 1652628668.0
        }
      ]
    }
  ]
}