{
  "id": "us04bk",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1652832526.0,
  "title": "my mom called me fat and likes me better when im sick.",
  "selftext": "Hi beautiful people I need to vent and would love advice and support. Im currently a 19 y/o female and finally fully recovered from my ED after 3-4 years of battling it. (although i do still struggle with body dysmorphia) I take care of myself and my body and love to lift weights! I have also been healing my relationship with food and finally feel like im in a great place. Today my mom said I should stop eating certain foods for breakfast (not going into detail to trigger anyone!) because they are “unhealthy and making me fat”. She also makes rude comments when i wear tight clothes and my gym attire even though im finally confident enough to wear them. After she made this comment out of seemingly no where, im honestly so hurt and i feel regretful for eating for the first time in almost a year from her comment. She treated me better when I was ill and I feel broken. I usually never let the words of others hurt me, but coming from my own mom…. :( she watched me almost die and this is what i get in return. I also can’t move out quite yet for many reasons i don’t feel like explaining right now lol but im planning to get out of here after i graduate from college. I mostly stay in my room and out of the house for obvious reasons. I also have spoke up about my feeling multiple times when she brings up my diet and still never seems to get it. lol plz send help:(\n\nedit: to touch on how she treated me better with my illness, she would often compliment my body and looks and now it’s like she wants me to hide myself more than ever before and anytime she comments on my appearance it’s an insult or backhanded comment. I also wanted to mention that i am at a healthy weight not over or under by any means so it’s not like she’s making these comments out of a concern for my health. she grew up in the generation of low waist jeans and vs models, if that gives you anymore explanation iykyk",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/us04bk/my_mom_called_me_fat_and_likes_me_better_when_im/",
  "score": 54,
  "num_comments": 32,
  "comments": [
    {
      "id": "i90qe9g",
      "author": "orchats",
      "body": "i am so sorry your mother treats you like this. she has no right to make comments on your body, especially when she knows you have been sick in the past. you're doing amazing and you deserve to feel good for the time and effort you've put into being healthy! you should see if you're able to do some counseling or confide in any friends/family you trust to talk about your mom. it'll help you build some safe spaces",
      "created_utc": 1652836811.0,
      "score": 18,
      "context": []
    },
    {
      "id": "i90ysvd",
      "author": "None",
      "body": "That is shameful that your mother speaks to you in those ways.\n\nCant apologize enough and just disturbed that you are in the situation where the women expected to  support you has knowingly chosen to tear you down.\n\ntrying to guilt trip you for eating and dressing as you are is inexcusable , having an eating disorder and body dysmorphia is hard enough and a saboteur you fight every day. \n\n\nAnd no matter what she says you are a beautiful somebody.\nYou are 19 years old. You wear what you’re happy and comfortable in. Crazy as you also struggle with body dysmorphia, and has no business making these comments toward you. \n\nYou do not feel guilty for eating please. You deserve to eat and have a happy relationship with food, and without having to dodge these cruel comments.\n\nAnd you deserve to be loved and supported unconditionally. \n\nthe confidence that you have worked for is not something she may try to take away from you, and I know it’s hard not to listen to mom and her insensitivity, but clearly has never been in the pain that is your place. \n\nI just hope you know that we are proud of you and that you are loved here and that again I am so sorry she would say these things to you. \n\nWords hurt so much especially when you struggle with the ailments that you have. and I can’t even imagine the strength it takes to stand there and take those things. \n\n\nyou have come so far and that best is coming. But In the meantime you deserve better too. You have my support always and deserve to keep going. 🫂",
      "created_utc": 1652840772.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i90ztl7",
      "author": "None",
      "body": "I’m sorry that your mom’s comments hurt you. As a mom to a daughter with a ED I have to admit that I have absentmindedly made comments to her that affect her in negative ways. She calls me on it, I profusely apologize and try to pathetically explain I didn’t mean it the way it sounded , and then consistently remind myself to keep my mouth shut about her food and appearance unless I’m being positive. Maybe your mom just needs a reminder as well. I only want my daughter to be happy and healthy and assuming your mom is the same way her ignorant comments could come from a place of concern that are having the opposite effect. \n\nI’m glad you are back on a healthy path. You are beautiful and deserving of the best. Always remember that. ❤️",
      "created_utc": 1652841271.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i90pdrc",
      "author": "None",
      "body": "I’m sorry you don’t deserve it my dad used to do this but it was not of any fault of his own (he doesn’t know I have this disease). It’s okay if it hurts please just don’t let it derail your progress",
      "created_utc": 1652836327.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i91b955",
      "author": "clairvoyanthoe",
      "body": "This sounds like projection. Nobody who is happy with their body has any reason to speak on anybody else’s. Because she’s doing this to her own daughter I’m guessing it’s deeply seated (seeded?) self hatred. Not your problem, but your pain is completely valid. Lifting is great and helped me so much with recovery! Keep it up! Don’t be afraid to create distance with her.",
      "created_utc": 1652847416.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i91us2o",
      "author": "juicepirate",
      "body": "Most women with an ED have a mother or grandmother with an ED. Your recovery is probably a trigger to your mom. Congratulations on your recovery, it’s all the more amazing that it means you need to stop carrying your mother’s problems for her, now she has to deal with her own illness and it’s probably all she sees when she tells you those things. Remember she is talking to herself. I know how hard it is but try to remember it’s all her and none you. You can probably understand this from what you went through. How an ED can affect everything around us, all of our relationships. And be even more proud to be better. I hope you can get out of there soon. You’re amazing and so strong!! Keep it up and it’s okay if you feel guilty sometimes, it comes and goes, you’re okay.",
      "created_utc": 1652862686.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i90v993",
      "author": "sourceInfinite",
      "body": "I am so proud of you for getting to where you are at now. I know that took a LOT of hard work and tears. You are so strong. You are amazing. You are beautiful. \n\nHugs!!!",
      "created_utc": 1652839089.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i90yen1",
      "author": "kikidelaney",
      "body": "I’m so sorry:( it sounds like your mother is awfully insensitive to your physical and mental health - please continue talking about this to everyone around you to keep that support system open and keep her words from affecting you!💕",
      "created_utc": 1652840578.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i90zp3r",
      "author": "mukesmikes",
      "body": "So sorry to hear this bro, you've very clearly worked hard to heal and I hope one day your mother can see that instead of projecting her insecurities. You deserve to feel good about yourself, continue to love yourself even if people have rude judgements they just haters you've got this!",
      "created_utc": 1652841211.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i91uijo",
      "author": "Numja",
      "body": "Talk to her about it. That how it makes you feel and that she should stop insulting you. If she doesn't stop, tell her you will also start insulting/criticise her. Like cloth, grey hair, decoration, stuff like that.\nDo it for a day and ask her how she felt. \n\nOr you can start to beep every time she says something mean, than she will realise how often she does it.\n\nOr you can (if you can) go full confrontation. If she said don't eat a bagel for breakfast eat a croissant. Just make the choice even more \"unhealthy\". (I know that is difficult with an ED).",
      "created_utc": 1652862433.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i91vi46",
      "author": "None",
      "body": "I don't want to speculate, and lead you to erroneous conclusions, so I'll just say insulate yourself from her influence and GTFO ASAP.",
      "created_utc": 1652863370.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i921gxa",
      "author": "justblippingby",
      "body": "I really feel for you because I share all of the same similarities, except for the main one with your mom getting on your back about looks. \nBtw I’m 21/F. \nI’m glad you’re going to the gym and lifting weights, that was the only way I was able to find consistency in recovery, the only thing that kept me on track. Other people’s comments don’t bother too much either, but those negative thoughts do come back sometimes and they can start to influence habits again. \nYou really have to be your own role model because you’ve been through it with having an ED and making it to the other side of recovery. With negative influences around you, you have to take a step back and break down all of the information/comments your receiving and ask yourself what holds value for you. Do you feel better with your freedom of eating what you want/need and lifting weights, or do you feel better on your old restrictive diet where your body is wasting away? \nI hope you have other good friends and leaders in your life to help guide you in the right direction even if your mom is pushing you down. You’ve got this! Keep your head held high and don’t look back",
      "created_utc": 1652868818.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i92c261",
      "author": "thenemesissss",
      "body": "i’m so sorry this happened to you. i don’t have much to say, but just know you aren’t alone. \n\nmy mom was, well is, like this. my mom is also a whole narcissist. i’ve had A LOT of realization with that woman since my life in general has been getting better. something that truly stuck with me tho is the very off reaction she had about my partner getting me help from my ed. i won’t go into detail, but my partner ended up taking me to the hospital due to how my body was rejecting food. my partner tried to speak to her over the phone just to let her know what’s going on and she just got very mad. neither one of us understand the reaction to this day. we knew she was neglectful of my health, spent years in that cycle with her. just never thought she would be okay with seeing me that bad with basically no emotion. other than anger. only thing i can truly connect is how much she actually hates my partner for helping me out. my mom always wished to keep me under her wing for basically forever, she wanted to cripple me. so i take it as that reaction was due to me finding someone that got me away from her and also got me the help i needed. tends to help my partner is like nowhere near phased by the way my mom acts, but it’s just draining. \n\ni no longer speak to her. i’ve went full no contact now and things have been better. it does hurt my inner child since i will probably never truly get the answer to why she had to do me (and even my sister) like that. although i see no answer better than continuing to suffer. \n\ni think the best thing you could really do in your situation is going distant. just not mentioning anything to her, that was something i did upon before getting kicked out at 17. my mom really knew nothing about me or my personal feelings because i knew it was pointless. i had other resources of a safe space, mostly my partner or sister. my partner was definitely the one that really knew about my mom, that’s why things played out the way they did. when you can move out, pls do that. right now, just take the time to really plan things. especially financially and everything. find a strong support system outside of her. it doesn’t sound like you may ever get much out of her until you are truly away from her. even then, i don’t feel like you should easily forgive her even if it gets better because of the way she constantly treated you this way. once you get away, don’t turn back. i know it sounds scary and hard to accept, but it’s so worth getting away from people that damage you. it took me forever to realize something wasn’t right about my mom and just know what we go through isn’t normal. might be “normal” due to society, but it’s actually not. don’t let anybody make you feel like you have to put up with this just because she’s your mother. lots of people like to hold the kid accountable for parents mistakes, but it’s all bs. if you know in the long run that it’ll help you, don’t be scared to do it. \n\nyou got this! <33 always here if you need anybody.",
      "created_utc": 1652876122.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i93z3ld",
      "author": "Live-Arm7068",
      "body": "My mom used to make comments all the time. My Cuban family always expected me to be losing weight and would say things that made me feel bad about myself. I finally gained enough confidence to set my boundaries with them. When my mom would tell me not to eat something, I would set a boundary with her. I would tell her to stop telling me what to eat, wear, etc. And that it was damaging. I'm not sure if your mom will listen. My mom did not take it seriously at first. After consistently telling her my boundaries she eventually learned and stopped. It's worth a try! It was so hard for me to get the courage to speak up for myself but I'm so glad I did.",
      "created_utc": 1652901504.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i9513b0",
      "author": "pollyhendricks23",
      "body": "My daughter and I went thru her ED together. She is my life and I always worry her but she’s healthy and away at college.  I’m happy to be your Mama!  You can come to me for anything and everything.  And my daughter will be your sister and friend!!  Seriously. Lmk.",
      "created_utc": 1652917875.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i90qmal",
      "author": "None",
      "body": "thank you, this is a great idea❤️ i appreciate you:)",
      "created_utc": 1652836917.0,
      "score": 4,
      "context": [
        {
          "id": "i90qe9g",
          "author": "orchats",
          "body": "i am so sorry your mother treats you like this. she has no right to make comments on your body, especially when she knows you have been sick in the past. you're doing amazing and you deserve to feel good for the time and effort you've put into being healthy! you should see if you're able to do some counseling or confide in any friends/family you trust to talk about your mom. it'll help you build some safe spaces",
          "created_utc": 1652836811.0
        }
      ]
    },
    {
      "id": "i9105aj",
      "author": "None",
      "body": "thank you so much for this, it means more than you know❤️ i needed to hear this, the world needs more people like you in it:,)",
      "created_utc": 1652841429.0,
      "score": 4,
      "context": [
        {
          "id": "i90ysvd",
          "author": "None",
          "body": "That is shameful that your mother speaks to you in those ways.\n\nCant apologize enough and just disturbed that you are in the situation where the women expected to  support you has knowingly chosen to tear you down.\n\ntrying to guilt trip you for eating and dressing as you are is inexcusable , having an eating disorder and body dysmorphia is hard enough and a saboteur you fight every day. \n\n\nAnd no matter what she says you are a beautiful somebody.\nYou are 19 years old. You wear what you’re happy and comfortable in. Crazy as you also struggle with body dysmorphia, and has no business making these comments toward you. \n\nYou do not feel guilty for eating please. You deserve to eat and have a happy relationship with food, and without having to dodge these cruel comments.\n\nAnd you deserve to be loved and supported unconditionally. \n\nthe confidence that you have worked for is not something she may try to take away from you, and I know it’s hard not to listen to mom and her insensitivity, but clearly has never been in the pain that is your place. \n\nI just hope you know that we are proud of you and that you are loved here and that again I am so sorry she would say these things to you. \n\nWords hurt so much especially when you struggle with the ailments that you have. and I can’t even imagine the strength it takes to stand there and take those things. \n\n\nyou have come so far and that best is coming. But In the meantime you deserve better too. You have my support always and deserve to keep going. 🫂",
          "created_utc": 1652840772.0
        }
      ]
    },
    {
      "id": "i910i04",
      "author": "None",
      "body": "thank you so much for this❤️ you’re an amazing mom for being aware and listening to your daughters feelings and concerns and taking the time to understand her struggles, im sure she’s very thankful for you:) thank you for the advice!!",
      "created_utc": 1652841601.0,
      "score": 3,
      "context": [
        {
          "id": "i90ztl7",
          "author": "None",
          "body": "I’m sorry that your mom’s comments hurt you. As a mom to a daughter with a ED I have to admit that I have absentmindedly made comments to her that affect her in negative ways. She calls me on it, I profusely apologize and try to pathetically explain I didn’t mean it the way it sounded , and then consistently remind myself to keep my mouth shut about her food and appearance unless I’m being positive. Maybe your mom just needs a reminder as well. I only want my daughter to be happy and healthy and assuming your mom is the same way her ignorant comments could come from a place of concern that are having the opposite effect. \n\nI’m glad you are back on a healthy path. You are beautiful and deserving of the best. Always remember that. ❤️",
          "created_utc": 1652841271.0
        }
      ]
    },
    {
      "id": "i90qiyc",
      "author": "None",
      "body": "thank you❤️ i appreciate you",
      "created_utc": 1652836872.0,
      "score": 3,
      "context": [
        {
          "id": "i90pdrc",
          "author": "None",
          "body": "I’m sorry you don’t deserve it my dad used to do this but it was not of any fault of his own (he doesn’t know I have this disease). It’s okay if it hurts please just don’t let it derail your progress",
          "created_utc": 1652836327.0
        }
      ]
    },
    {
      "id": "i92vhzy",
      "author": "nevermindthetime",
      "body": "Seated is correct. And I fully agree with everything you just said. \n\nOP, keep on recovering, you deserve to be well and healthy.",
      "created_utc": 1652885423.0,
      "score": 2,
      "context": [
        {
          "id": "i91b955",
          "author": "clairvoyanthoe",
          "body": "This sounds like projection. Nobody who is happy with their body has any reason to speak on anybody else’s. Because she’s doing this to her own daughter I’m guessing it’s deeply seated (seeded?) self hatred. Not your problem, but your pain is completely valid. Lifting is great and helped me so much with recovery! Keep it up! Don’t be afraid to create distance with her.",
          "created_utc": 1652847416.0
        }
      ]
    },
    {
      "id": "i92li2x",
      "author": "None",
      "body": "this is amazing advice, thank you❤️",
      "created_utc": 1652880978.0,
      "score": 1,
      "context": [
        {
          "id": "i91b955",
          "author": "clairvoyanthoe",
          "body": "This sounds like projection. Nobody who is happy with their body has any reason to speak on anybody else’s. Because she’s doing this to her own daughter I’m guessing it’s deeply seated (seeded?) self hatred. Not your problem, but your pain is completely valid. Lifting is great and helped me so much with recovery! Keep it up! Don’t be afraid to create distance with her.",
          "created_utc": 1652847416.0
        }
      ]
    },
    {
      "id": "i92lh0u",
      "author": "None",
      "body": "thank you for this reminder!! this is great insight❤️",
      "created_utc": 1652880964.0,
      "score": 1,
      "context": [
        {
          "id": "i91us2o",
          "author": "juicepirate",
          "body": "Most women with an ED have a mother or grandmother with an ED. Your recovery is probably a trigger to your mom. Congratulations on your recovery, it’s all the more amazing that it means you need to stop carrying your mother’s problems for her, now she has to deal with her own illness and it’s probably all she sees when she tells you those things. Remember she is talking to herself. I know how hard it is but try to remember it’s all her and none you. You can probably understand this from what you went through. How an ED can affect everything around us, all of our relationships. And be even more proud to be better. I hope you can get out of there soon. You’re amazing and so strong!! Keep it up and it’s okay if you feel guilty sometimes, it comes and goes, you’re okay.",
          "created_utc": 1652862686.0
        }
      ]
    },
    {
      "id": "i90zzny",
      "author": "None",
      "body": "thank you for the kind words❤️ the world needs more people like you:)",
      "created_utc": 1652841353.0,
      "score": 2,
      "context": [
        {
          "id": "i90v993",
          "author": "sourceInfinite",
          "body": "I am so proud of you for getting to where you are at now. I know that took a LOT of hard work and tears. You are so strong. You are amazing. You are beautiful. \n\nHugs!!!",
          "created_utc": 1652839089.0
        }
      ]
    },
    {
      "id": "i9101nc",
      "author": "None",
      "body": "Thank you so much for this motivation❤️ i appreciate you:,)",
      "created_utc": 1652841380.0,
      "score": 2,
      "context": [
        {
          "id": "i90yen1",
          "author": "kikidelaney",
          "body": "I’m so sorry:( it sounds like your mother is awfully insensitive to your physical and mental health - please continue talking about this to everyone around you to keep that support system open and keep her words from affecting you!💕",
          "created_utc": 1652840578.0
        }
      ]
    },
    {
      "id": "i9106is",
      "author": "None",
      "body": "thank you so much, i appreciate you❤️",
      "created_utc": 1652841446.0,
      "score": 1,
      "context": [
        {
          "id": "i90zp3r",
          "author": "mukesmikes",
          "body": "So sorry to hear this bro, you've very clearly worked hard to heal and I hope one day your mother can see that instead of projecting her insecurities. You deserve to feel good about yourself, continue to love yourself even if people have rude judgements they just haters you've got this!",
          "created_utc": 1652841211.0
        }
      ]
    },
    {
      "id": "i92mh6a",
      "author": "None",
      "body": "that’s the plan lol love this❤️",
      "created_utc": 1652881440.0,
      "score": 1,
      "context": [
        {
          "id": "i91vi46",
          "author": "None",
          "body": "I don't want to speculate, and lead you to erroneous conclusions, so I'll just say insulate yourself from her influence and GTFO ASAP.",
          "created_utc": 1652863370.0
        }
      ]
    },
    {
      "id": "i92lnue",
      "author": "None",
      "body": "thank you so much❤️ i hope your doing well, you’re an angel!!",
      "created_utc": 1652881055.0,
      "score": 2,
      "context": [
        {
          "id": "i921gxa",
          "author": "justblippingby",
          "body": "I really feel for you because I share all of the same similarities, except for the main one with your mom getting on your back about looks. \nBtw I’m 21/F. \nI’m glad you’re going to the gym and lifting weights, that was the only way I was able to find consistency in recovery, the only thing that kept me on track. Other people’s comments don’t bother too much either, but those negative thoughts do come back sometimes and they can start to influence habits again. \nYou really have to be your own role model because you’ve been through it with having an ED and making it to the other side of recovery. With negative influences around you, you have to take a step back and break down all of the information/comments your receiving and ask yourself what holds value for you. Do you feel better with your freedom of eating what you want/need and lifting weights, or do you feel better on your old restrictive diet where your body is wasting away? \nI hope you have other good friends and leaders in your life to help guide you in the right direction even if your mom is pushing you down. You’ve got this! Keep your head held high and don’t look back",
          "created_utc": 1652868818.0
        }
      ]
    },
    {
      "id": "i92mdgo",
      "author": "None",
      "body": "thank you so much, it’s sad but comforting to know im not the only one dealing with a similar situation. im so glad to hear you’re doing better! My partner is also my safe space and seems to care way more about my mental and physical health more than my mother. thank you for sharing your story with me, i appreciate you:)❤️ im always here aswell to chat!!",
      "created_utc": 1652881391.0,
      "score": 2,
      "context": [
        {
          "id": "i92c261",
          "author": "thenemesissss",
          "body": "i’m so sorry this happened to you. i don’t have much to say, but just know you aren’t alone. \n\nmy mom was, well is, like this. my mom is also a whole narcissist. i’ve had A LOT of realization with that woman since my life in general has been getting better. something that truly stuck with me tho is the very off reaction she had about my partner getting me help from my ed. i won’t go into detail, but my partner ended up taking me to the hospital due to how my body was rejecting food. my partner tried to speak to her over the phone just to let her know what’s going on and she just got very mad. neither one of us understand the reaction to this day. we knew she was neglectful of my health, spent years in that cycle with her. just never thought she would be okay with seeing me that bad with basically no emotion. other than anger. only thing i can truly connect is how much she actually hates my partner for helping me out. my mom always wished to keep me under her wing for basically forever, she wanted to cripple me. so i take it as that reaction was due to me finding someone that got me away from her and also got me the help i needed. tends to help my partner is like nowhere near phased by the way my mom acts, but it’s just draining. \n\ni no longer speak to her. i’ve went full no contact now and things have been better. it does hurt my inner child since i will probably never truly get the answer to why she had to do me (and even my sister) like that. although i see no answer better than continuing to suffer. \n\ni think the best thing you could really do in your situation is going distant. just not mentioning anything to her, that was something i did upon before getting kicked out at 17. my mom really knew nothing about me or my personal feelings because i knew it was pointless. i had other resources of a safe space, mostly my partner or sister. my partner was definitely the one that really knew about my mom, that’s why things played out the way they did. when you can move out, pls do that. right now, just take the time to really plan things. especially financially and everything. find a strong support system outside of her. it doesn’t sound like you may ever get much out of her until you are truly away from her. even then, i don’t feel like you should easily forgive her even if it gets better because of the way she constantly treated you this way. once you get away, don’t turn back. i know it sounds scary and hard to accept, but it’s so worth getting away from people that damage you. it took me forever to realize something wasn’t right about my mom and just know what we go through isn’t normal. might be “normal” due to society, but it’s actually not. don’t let anybody make you feel like you have to put up with this just because she’s your mother. lots of people like to hold the kid accountable for parents mistakes, but it’s all bs. if you know in the long run that it’ll help you, don’t be scared to do it. \n\nyou got this! <33 always here if you need anybody.",
          "created_utc": 1652876122.0
        }
      ]
    },
    {
      "id": "i9i08ur",
      "author": "None",
      "body": "this is the sweetest thing ever!! you’re an amazing mom thank you beautiful!🥰",
      "created_utc": 1653172441.0,
      "score": 1,
      "context": [
        {
          "id": "i9513b0",
          "author": "pollyhendricks23",
          "body": "My daughter and I went thru her ED together. She is my life and I always worry her but she’s healthy and away at college.  I’m happy to be your Mama!  You can come to me for anything and everything.  And my daughter will be your sister and friend!!  Seriously. Lmk.",
          "created_utc": 1652917875.0
        }
      ]
    },
    {
      "id": "iaxpahh",
      "author": "None",
      "body": "https://www.instagram.com/p/CeTvJXkOTIi/?igshid=YmMyMTA2M2Y=",
      "created_utc": 1654191332.0,
      "score": 1,
      "context": [
        {
          "id": "i90ysvd",
          "author": "None",
          "body": "That is shameful that your mother speaks to you in those ways.\n\nCant apologize enough and just disturbed that you are in the situation where the women expected to  support you has knowingly chosen to tear you down.\n\ntrying to guilt trip you for eating and dressing as you are is inexcusable , having an eating disorder and body dysmorphia is hard enough and a saboteur you fight every day. \n\n\nAnd no matter what she says you are a beautiful somebody.\nYou are 19 years old. You wear what you’re happy and comfortable in. Crazy as you also struggle with body dysmorphia, and has no business making these comments toward you. \n\nYou do not feel guilty for eating please. You deserve to eat and have a happy relationship with food, and without having to dodge these cruel comments.\n\nAnd you deserve to be loved and supported unconditionally. \n\nthe confidence that you have worked for is not something she may try to take away from you, and I know it’s hard not to listen to mom and her insensitivity, but clearly has never been in the pain that is your place. \n\nI just hope you know that we are proud of you and that you are loved here and that again I am so sorry she would say these things to you. \n\nWords hurt so much especially when you struggle with the ailments that you have. and I can’t even imagine the strength it takes to stand there and take those things. \n\n\nyou have come so far and that best is coming. But In the meantime you deserve better too. You have my support always and deserve to keep going. 🫂",
          "created_utc": 1652840772.0
        },
        {
          "id": "i9105aj",
          "author": "None",
          "body": "thank you so much for this, it means more than you know❤️ i needed to hear this, the world needs more people like you in it:,)",
          "created_utc": 1652841429.0
        }
      ]
    },
    {
      "id": "i92eldv",
      "author": "sourceInfinite",
      "body": "Do you know that the world needs you too? It does. You set an example of what it takes to overcome adversity. You set an example of self love despite a horrible illness. You are a person we can all look up to.",
      "created_utc": 1652877528.0,
      "score": 1,
      "context": [
        {
          "id": "i90v993",
          "author": "sourceInfinite",
          "body": "I am so proud of you for getting to where you are at now. I know that took a LOT of hard work and tears. You are so strong. You are amazing. You are beautiful. \n\nHugs!!!",
          "created_utc": 1652839089.0
        },
        {
          "id": "i90zzny",
          "author": "None",
          "body": "thank you for the kind words❤️ the world needs more people like you:)",
          "created_utc": 1652841353.0
        }
      ]
    },
    {
      "id": "i972z6r",
      "author": "thenemesissss",
      "body": "i’m very glad you have a safe space! it’s definitely a lot to deal with, but it’s okay because it does get better. <33",
      "created_utc": 1652964816.0,
      "score": 1,
      "context": [
        {
          "id": "i92c261",
          "author": "thenemesissss",
          "body": "i’m so sorry this happened to you. i don’t have much to say, but just know you aren’t alone. \n\nmy mom was, well is, like this. my mom is also a whole narcissist. i’ve had A LOT of realization with that woman since my life in general has been getting better. something that truly stuck with me tho is the very off reaction she had about my partner getting me help from my ed. i won’t go into detail, but my partner ended up taking me to the hospital due to how my body was rejecting food. my partner tried to speak to her over the phone just to let her know what’s going on and she just got very mad. neither one of us understand the reaction to this day. we knew she was neglectful of my health, spent years in that cycle with her. just never thought she would be okay with seeing me that bad with basically no emotion. other than anger. only thing i can truly connect is how much she actually hates my partner for helping me out. my mom always wished to keep me under her wing for basically forever, she wanted to cripple me. so i take it as that reaction was due to me finding someone that got me away from her and also got me the help i needed. tends to help my partner is like nowhere near phased by the way my mom acts, but it’s just draining. \n\ni no longer speak to her. i’ve went full no contact now and things have been better. it does hurt my inner child since i will probably never truly get the answer to why she had to do me (and even my sister) like that. although i see no answer better than continuing to suffer. \n\ni think the best thing you could really do in your situation is going distant. just not mentioning anything to her, that was something i did upon before getting kicked out at 17. my mom really knew nothing about me or my personal feelings because i knew it was pointless. i had other resources of a safe space, mostly my partner or sister. my partner was definitely the one that really knew about my mom, that’s why things played out the way they did. when you can move out, pls do that. right now, just take the time to really plan things. especially financially and everything. find a strong support system outside of her. it doesn’t sound like you may ever get much out of her until you are truly away from her. even then, i don’t feel like you should easily forgive her even if it gets better because of the way she constantly treated you this way. once you get away, don’t turn back. i know it sounds scary and hard to accept, but it’s so worth getting away from people that damage you. it took me forever to realize something wasn’t right about my mom and just know what we go through isn’t normal. might be “normal” due to society, but it’s actually not. don’t let anybody make you feel like you have to put up with this just because she’s your mother. lots of people like to hold the kid accountable for parents mistakes, but it’s all bs. if you know in the long run that it’ll help you, don’t be scared to do it. \n\nyou got this! <33 always here if you need anybody.",
          "created_utc": 1652876122.0
        },
        {
          "id": "i92mdgo",
          "author": "None",
          "body": "thank you so much, it’s sad but comforting to know im not the only one dealing with a similar situation. im so glad to hear you’re doing better! My partner is also my safe space and seems to care way more about my mental and physical health more than my mother. thank you for sharing your story with me, i appreciate you:)❤️ im always here aswell to chat!!",
          "created_utc": 1652881391.0
        }
      ]
    }
  ]
}