{
  "id": "uw65qt",
  "subreddit": "EatingDisorders",
  "author": "fuckedupdreamerx",
  "created_utc": 1653328630.0,
  "title": "THERAPY SCAM ALERT!! BWRT (BrainWorking Recursive Therapy) - Terence Watts",
  "selftext": "This is a super important post so pls don’t delete mods! I’m trying to get the word out about this so people in desperate help aren’t lied to. \n\nTerence Watts’s “BrainWorking Recursive Therapy” or, “BWRT” is a scam. This man is preying on vulnerable people by marketing this as a “full proof” solution to most mental health issues, without the (ACTUAL) evidence to back it up!!\n\nMany have deleted their original opinions voicing their doubts, or are too afraid to speak up, due to the threat of legal action and/or harassment. Honestly, it’s giving MLM / pyramid scheme / scientology vibes. \n\nI was so amazed at first, and truly believed I’d finally stumbled across a great solution to my problems, until I pondered how it really DID sound too good to be true… so I looked around to see what others had been saying about it. \n\nThe man has blocked me / deleted my comments on his Youtube videos, as he doesn’t want anyone to criticise his scheme and warn others. I wouldn’t be surprised if this post / my account got taken down too. So if I don’t respond or you don’t see this post anymore… well I guess you know why. \n\nMaybe some aspects of it can help for you as a byproduct… but I at least URGE everyone to apply critical thinking and do your own extensive research on it first before you come to any conclusions. \n\n\nHere are some links about BWRT to get you started:\n\n- https://www.clinpsy.org.uk/forum/viewtopic.php?t=21339\n\n - https://www.nomorepanic.co.uk/showthread.php?209740-Brain-working-recursive-Therapy\n\n- https://www.reddit.com/r/therapy/comments/ts8qya/does_anyone_have_experience_with_bwrt/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\n\nWatts gets his inspiration from [Benjamin Libet](https://www.bwrtuk.co.uk/bwrt/), whose theory about conscious and unconscious behaviour forms the basis of his theory. He talks about it a lot on his website and in his youtube videos. \n\n\nAlso, I found some interesting posts about Charles Linden - another “expert” who displays similar behaviours of secrecy, denial and harassment to Terence Watts:\n\n- https://psychonoclast.wordpress.com/2014/04/27/1-part-1-the-history-of-my-early-contact-with-the-linden-method/\n\n- https://www.clinpsy.org.uk/forum/viewtopic.php?t=2057\n\n\n(FYI: I still need to do some more research on this myself, so I am not claiming to be an expert on this matter.)\n\n————————————————————————\n\nEDIT: another very interesting link… [the Advertising Standards Agency says he breached the “UK code of non-broadcast advertising, sales promotion and direct marketing.”](https://www.ns-healthcare.com/news/terence-watts/)\n\n“The Terence Watts BWRT Institute was found guilty of claiming it could treat and/or diagnose several serious health problems including anxiety, infertility and diabetes without substantiating such claims.\n\nIn its findings, the ASA also concluded that an advertisement on the website discouraged people from seeking essential treatment and necessary medical supervision for conditions, including addiction, attention deficit hyperactivity disorder (ADHD), obsessive compulsive disorder (OCD), and thyroid problems.\n\nThe Advertising Standards Agency told Terence Watts the advert must not appear again in its current form, adding it should not claim or imply that BWRT can be used to treat conditions without demonstrating sufficient evidence.\n\nThe ASA also said the website should not reference conditions for which medical supervision is necessary when addressing those seeking treatment in the future.”\n\n\n\n…Thoughts??",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/uw65qt/therapy_scam_alert_bwrt_brainworking_recursive/",
  "score": 41,
  "num_comments": 0,
  "comments": []
}