{
  "id": "uyd7xv",
  "subreddit": "EatingDisorders",
  "author": "pinkapoppy_",
  "created_utc": 1653587286.0,
  "title": "Should discussion/images of food itself have a trigger warning?",
  "selftext": "I'm in a very small discord server with some friends, where about 5-10 of us are active and chat, and the rest of the people I'm assuming don't check the server or just get notifications. We were discussing cheese because I said I didn't like it, and we were joking about the mould etc. My friend received a DM from someone in the server asking if we could spoiler or put TWs for food. I don't know who it was or whether or not they were part of the conversation or just got notifications, but it just seems odd to be putting trigger warnings for food, when food is something that should be normalised for people with EDs rather than further creating a barrier of fear around it. Thoughts?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/uyd7xv/should_discussionimages_of_food_itself_have_a/",
  "score": 41,
  "num_comments": 18,
  "comments": [
    {
      "id": "ia3scbj",
      "author": "Daddy_urp",
      "body": "No, that’s too extreme.  I get TWs for SA or other death but food isn’t an extreme topic, there doesn’t need to be a TW for it.",
      "created_utc": 1653594036.0,
      "score": 37,
      "context": []
    },
    {
      "id": "ia3urxd",
      "author": "licegirl",
      "body": "No. Thats like saying water should have warnings. We need food to survive. Its a basic need. We cant hide from it forevwr",
      "created_utc": 1653595043.0,
      "score": 28,
      "context": []
    },
    {
      "id": "ia3r49w",
      "author": "hallwayhotdogs",
      "body": "very extreme.",
      "created_utc": 1653593529.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ia41n2w",
      "author": "slowgradient",
      "body": "We want to be mindful of other people, and I understand TWs for things like SA, but censoring a basic need like food is just going too far. \n\n\nI used to obsessively look at food pictures/videos when I was restricting. My brain would get a level of satiation when I would do this and it made restriction easier. In my case, viewing that stuff was playing a detrimental role to my recovery, but it’s my (and only my) responsibility to not use food imagery to harm myself.",
      "created_utc": 1653597942.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ia3qrfv",
      "author": "BvbblegvmBitch",
      "body": "Nope. I've heard this from other people with eating disorders before and I will forever disagree. \n\nIt is not your job to be responsible for their triggers. If this was an eating disorder server, sure but it's not. What do they do when they go outside and see food? Or their kitchen? If they are uncomfortable in the situation it's on them to remove themselves.",
      "created_utc": 1653593379.0,
      "score": 29,
      "context": []
    },
    {
      "id": "ia4rtpm",
      "author": "warmcaprisun",
      "body": "putting tws for food only further negatively reinforces that food is bad for that person. definitely don’t tw it, it will only make them worse off",
      "created_utc": 1653609932.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ia4aain",
      "author": "Gingers_got_no_soul",
      "body": "i mean, i find the mention of food quite distressing sometimes, but thats my problem, not theirs",
      "created_utc": 1653601711.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ia4bd5g",
      "author": "None",
      "body": "That seems pretty silly.  How are you going to discuss eating disorders without talking about food?",
      "created_utc": 1653602179.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ia4w173",
      "author": "pistolpxte",
      "body": "People should realize that they are responsible for managing their triggers. Especially when it comes to something so common and frankly essential.",
      "created_utc": 1653611990.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ia42pot",
      "author": "Oxiiana",
      "body": "No. People want a trigger warning for everything lately. It is your own personal responsibility to deal with triggers.",
      "created_utc": 1653598397.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ia5ytpk",
      "author": "pinkapoppy_",
      "body": "Update: I told my friend that a lot of people find it damaging, so we could instead use a CW (or if the person who messaged them is someone who just saw a notification then they could turn them off if they don’t check them). However she said that having an issue with TWs is a ‘mindset issue’ and that they’re not actually bad. So now we’re TWing food",
      "created_utc": 1653634099.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ia6ivae",
      "author": "aeroplanessky",
      "body": "I feel like there's no harm in asking for it. Why not just make a channel? Plenty of discords I'm in have one for this exact reason. Idk compassion goes a long way, not everyone's path to recovery is the same",
      "created_utc": 1653650931.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ia6vuj8",
      "author": "wildxxdaze",
      "body": "Interesting topic. It's important for those in recovery to identify triggers in order to help overcome challenges throughout recovery (lived experience here). For example, early recovery, my friends in a small whatsapp chat all shared recipes and meal pics where they'd been to cool restaraunts etc. They were all aware of my ED and recovery, and tbh when there would be a surge of notifications around recipes... food pics... emotions that would come up: frustration, annoyance, sometimes sadness that I would deny myself those foods even though I wanted them. What did this show? What I needed to work through and overcome to enjoy discussing food and meals freely, which I've only ever dreamed of! Sometimes exposure is needed, sometimes we take breaks because we need to protect ourselves and our recovery. Finding balance is when we heal.\n\nIt's hard to see the neccessity in 'TW' when discussing food, one of the wonderful parts of recovery is when food becomes exactly what it is again, rather than something that holds fear.",
      "created_utc": 1653658166.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ia4mmdu",
      "author": "so_very_trans",
      "body": "I think pictures of food are fine unless someone’s simply being a dick with it. Like, spamming pictures of something someone dislikes lol",
      "created_utc": 1653607410.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ia4p49c",
      "author": "littlebbchickenhead",
      "body": "I have binge & sometimes purge type eating disorder which I feel like might be most effected by this? Idk? And I say no, this is too much. I use TW pretty liberally but I don’t think I ever will for food",
      "created_utc": 1653608602.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iaqnndm",
      "author": "chucorfinn",
      "body": "i have an ed with bmi 14 and many of my other friends have an ed as well and no, tell them to get over themself and stop exaggerating like those ppl on tiktok that record themselves crying in front of food",
      "created_utc": 1654050696.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ia3vv7z",
      "author": "pinkapoppy_",
      "body": "I've seen discussion about this before, and if you think about it, tws are associated with negative and 'scary' things, like abuse or harm. So surely using tw for food makes it seem like it's also somehow wrong or scary?? Seems really counterintuitive especially since 'normalising' food is so important when it comes to eds. I saw someone compare the use of a food tw to how ed treatment is done - you're constantly thinking about food, talking about it etc. it's essentially exposure therapy and avoiding it is going to be more harmful, especially if it's with a warning which is usually associated w scary and bad things",
      "created_utc": 1653595497.0,
      "score": 12,
      "context": [
        {
          "id": "ia3qrfv",
          "author": "BvbblegvmBitch",
          "body": "Nope. I've heard this from other people with eating disorders before and I will forever disagree. \n\nIt is not your job to be responsible for their triggers. If this was an eating disorder server, sure but it's not. What do they do when they go outside and see food? Or their kitchen? If they are uncomfortable in the situation it's on them to remove themselves.",
          "created_utc": 1653593379.0
        }
      ]
    },
    {
      "id": "ia5yxz3",
      "author": "pinkapoppy_",
      "body": "it’s not an ed-discussion server, we just mentioned food a couple times",
      "created_utc": 1653634193.0,
      "score": 1,
      "context": [
        {
          "id": "ia4bd5g",
          "author": "None",
          "body": "That seems pretty silly.  How are you going to discuss eating disorders without talking about food?",
          "created_utc": 1653602179.0
        }
      ]
    }
  ]
}