{
  "id": "v3op2j",
  "subreddit": "EatingDisorders",
  "author": "crspwirebite",
  "created_utc": 1654221457.0,
  "title": "An unexpected thing that has helped me.",
  "selftext": "I started going camping with some friends. I didn't do it with my ED (binge eating, texture issues, picky eating) in mind at all. Purely just to get outside and trying to be social. \n\nThey take turns making meals on trips, and it's forced me to eat a lot of things I never would have tried on my own. They don't know about my ED. \n\nAt home I've made chili and corn. I've eaten some more breakfasts than usual. Had asparagus and peppers and a strawberry. I've never eaten any of those things before, but being around other people pushed me to try.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/v3op2j/an_unexpected_thing_that_has_helped_me/",
  "score": 62,
  "num_comments": 6,
  "comments": [
    {
      "id": "iazsiac",
      "author": "None",
      "body": "I can confirm that this is helpful. Using suicidal pressure to your benefit is a boss move lol",
      "created_utc": 1654225635.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ib07jbh",
      "author": "WhereBagel",
      "body": "me too! something about sharing food with friends while huddled around a fire makes it feel more safe to do wild stuff like down 3 Top Dogs and beans in a night, seeing my friends be so relaxed and playful with food has helped me a lot.",
      "created_utc": 1654234494.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ib08ucz",
      "author": "RhysyA",
      "body": "One day a friend came home from work with a pizza with 5 toppings I'd never tried, if I didn't make any friends in the last few years my diet would still be the most basic things. Power to ya :)",
      "created_utc": 1654235442.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ib26olh",
      "author": "Optimal_Diet9975",
      "body": "Camping & backpacking really helped me too. I got to see food more practically: as a source of energy. And the wilderness doesn’t have a lot of mirrors or social media, so my body dysmorphia wasn’t as bad.",
      "created_utc": 1654277649.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ib2q5yn",
      "author": "Queenofwands1212",
      "body": "Idk This probably wouldn’t work for me considering my auto immune issues and laundry list of food sensitivities. Wouldn’t be worth it",
      "created_utc": 1654286754.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ib2yrm4",
      "author": "jsully245",
      "body": "My last backpacking trip kinda set me right for a few days. Made it very explicit that if I don’t eat fully, I will not be safe. I don’t want to have any unnecessary fatigue while I’m hours from the nearest car and in rough terrain. Food is energy and we need energy to function properly :)",
      "created_utc": 1654291033.0,
      "score": 1,
      "context": [
        {
          "id": "ib26olh",
          "author": "Optimal_Diet9975",
          "body": "Camping & backpacking really helped me too. I got to see food more practically: as a source of energy. And the wilderness doesn’t have a lot of mirrors or social media, so my body dysmorphia wasn’t as bad.",
          "created_utc": 1654277649.0
        }
      ]
    }
  ]
}