{
  "id": "vhilbp",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1655832408.0,
  "title": "I FUCKING BROKE FREE",
  "selftext": "today, for the first time, i looked at my naked body in the mirror and thought “wow, incredible.” \n\ni have NEVER in my 20 years of living had any other thought about my naked body than “too fat.” i could cry. i’m finally starting to fucking break free from this miserable existence. \n\nit didn’t happen overnight. it took many years of treatment, hard work, and stopping myself when i have those hundreds of toxic thoughts day in and day out. i still have up and down moments—just last week i felt bad about myself for a few days. but shit, i am FINALLY starting to see the light. \n\ni never thought this would be possible. i never imagined this for myself. \n\ni’m sharing this because i am no different from anyone on this sub. if you’re struggling, this message is for you. no matter where you are, whether you’re in recovery or not. i joined r/EatingDisorders because i was struggling hard just like you. trust me, i was the last person to believe this was possible. but i need you to know that against all odds, is IS possible to *FULLY* and *COMPLETELY* turn your life around. \n\nif anyone needs some support or motivation my messages are open. sending you all the most love. \n\nWE’VE GOT THIS!!!!!!!!!!!!!!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/vhilbp/i_fucking_broke_free/",
  "score": 81,
  "num_comments": 6,
  "comments": [
    {
      "id": "id97n2y",
      "author": "ccwandco",
      "body": "I’m so glad!! I had a similar experience the other night where I just danced in the mirror naked (except for my underwear) for like an hour. It was very euphoric.",
      "created_utc": 1655863569.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id989bn",
      "author": "None",
      "body": "this makes me happy and gives me hope that i’ll reach this in my recovery. 🫶🏻",
      "created_utc": 1655863885.0,
      "score": 1,
      "context": []
    },
    {
      "id": "id9foak",
      "author": "_senator_patootie_",
      "body": "This makes my heart so incredibly happy! Congratulations on such a huge milestone on your recovery!",
      "created_utc": 1655867714.0,
      "score": 1,
      "context": []
    },
    {
      "id": "idapge5",
      "author": "shenayanay",
      "body": "So awesome! I'm so incredibly happy for you!",
      "created_utc": 1655901017.0,
      "score": 1,
      "context": []
    }
  ]
}