{
  "id": "vk6rw3",
  "subreddit": "EatingDisorders",
  "author": "I_like_birds_6716",
  "created_utc": 1656131110.0,
  "title": "Comments that used to upset me are now making me happy!!",
  "selftext": "I have a lot of really affectionate friends that I only met about a year ago. At first, when they'd do things like poke me or comment on how soft/squishy I am I'd feel sad about it. But now it's like \"yeah I am :D\" because they'll say it with such affection and adoration.\n\nI haven't fully recovered but the bad days are getting fewer and farther between. Honestly I'm so glad I met them, I feel much better about myself now. They'll call me cute/adorable a lot and god meeting them was probably the best thing to happen to me.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/vk6rw3/comments_that_used_to_upset_me_are_now_making_me/",
  "score": 42,
  "num_comments": 3,
  "comments": [
    {
      "id": "ido1x0f",
      "author": "Lingenue",
      "body": "Congrats ! No matter how our body is, it's never the problem ! It's all about how we consider it. Looks like you're choosing to love it and you're amazing for that.",
      "created_utc": 1656147023.0,
      "score": 11,
      "context": []
    },
    {
      "id": "idotuz9",
      "author": "sonic2cool",
      "body": "that's so nice!",
      "created_utc": 1656166526.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ido9op6",
      "author": "I_like_birds_6716",
      "body": "Thank you! And yes I totally agree. I think the main thing that helped me accept myself more was distancing myself from people who would make mocking comments about it and getting closer to those who would compliment me on it. I never used to think it was something that could be complimented but I'm finally starting to believe them :)",
      "created_utc": 1656153861.0,
      "score": 4,
      "context": [
        {
          "id": "ido1x0f",
          "author": "Lingenue",
          "body": "Congrats ! No matter how our body is, it's never the problem ! It's all about how we consider it. Looks like you're choosing to love it and you're amazing for that.",
          "created_utc": 1656147023.0
        }
      ]
    }
  ]
}