{
  "id": "vmdg91",
  "subreddit": "EatingDisorders",
  "author": "HNrose11",
  "created_utc": 1656387351.0,
  "title": "Why do I have to gain weight in E.D recovery if I’m at a normal weight?",
  "selftext": "I’m at a normal and “healthy weight” for my age and height, my E.D (anorexia) started when I was slightly overweight. I’m in a partial hospital and there telling me I need to weight restore, I know the doctors know best but I just don’t understand, why? It’s hard for me to fully commit if I don’t know why I’m doing it. honestly any advice would be appreciated! (Btw it’s not body dysmorphia I’ve a got a normal bmi and stuff). Thanks in advance!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/vmdg91/why_do_i_have_to_gain_weight_in_ed_recovery_if_im/",
  "score": 59,
  "num_comments": 26,
  "comments": [
    {
      "id": "ie1c75o",
      "author": "in_the_sheyd",
      "body": "It’s because if you are restricting and maintaining at a “healthy” BMI then it will gain some weight if you stop restricting. It’s not about putting on weight for the sake of putting on weight, it’s about letting your body settle into the weight it wants to be when you eat in healthy moderation.\n\nAnd on a personal level, one “atypical” anorexic to another, I’m really proud of you and all of us who are in your situation. It’s really scary but you’re doing it.",
      "created_utc": 1656410443.0,
      "score": 81,
      "context": []
    },
    {
      "id": "ie1m493",
      "author": "FoxiiFighter",
      "body": "Weight restoration isn't always about just gaining weight. It's also about re-fueling your malnourished body. \n\nSince you said anorexia, I'm assuming that you've starved yourself for quite some time. Weight aside, that means you've been missing out out key nutrients, macro and micro. Starvation has so many other consequences to our bodies, other than just the obvious weight loss. And you need nutrients to repair that damage. \n\nFor me, I went from obese to underweight - understanding that I had to starve myself to get there meant I had to come to terms with the fact that eating a normal, healthy amount of food was going to cause weight gain. But when my psych helped me re-frame it into a \"nutrition restoration\" type of situation, the weight gain seemed a little less scary, and definitely not permanent.",
      "created_utc": 1656417479.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ie1683c",
      "author": "anniekeepsontrying",
      "body": "Because if you have been restricting and losing weight your body has likely experienced some damaging and malnutrition so you need food to heal that. Also the weight you lost probably wasn’t meant to be lost. \nMaybe if you challenge the idea of weight gain being bad per se maybe that would help?",
      "created_utc": 1656405259.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ie1ft6j",
      "author": "None",
      "body": "The BMI system is dumb. Everyone’s resting/neutral body weight is different. When I was in recovery, I focused on eating the right amount of food to power my body and not restricting and let my body reach it’s neutral weight. I have no idea if my personal neutral falls in the BMI scale and I don’t care. It’s the weight I am when I’m feeding and fueling my body in the way it needs. \n\nDon’t focus on the scale! I know it’s hard, but If you keep pushing yourself to focus on what makes your body feel good and gives you energy, it will get easier. \n\nYou are so strong for doing this!! Proud of you!",
      "created_utc": 1656413288.0,
      "score": 18,
      "context": []
    },
    {
      "id": "ie395r2",
      "author": "The_Bastard_Henry",
      "body": "A BMI is not an accurate indicator of one's health. When I was at my lowest weight, it was still a \"healthy\" BMI, but I looked emaciated, so you could still be underweight. Also if you've been actively restricting for a long time, teaching your body to eat and digest again is very important. \n\nI'm happy you're getting treatment. I resisted for a long time and I can't believe how many years I wasted being sick. Stay strong, you can do it!!!",
      "created_utc": 1656442750.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ie0wyai",
      "author": "None",
      "body": "I recommend asking your doctors to explain it to you. They are the experts and should be able to explain their reasoning to you.\nYou may find that set point theory is helpful in understanding this as well. Basically, your body has a “set point” of weight that it will settle into when you are consistently nourishing yourself adequately. The set point is often a range of like 5-10 pounds. The idea is, your weight will self regulate. Your ED was restrictive, so you can expect your set point to be higher than your current weight. Additionally, restriction is thought to drive the set point up higher. Ultimately, dismantling your fatphobia and self hatred is the most important thing to self acceptance, but even within those beliefs, recognize that denying yourself nourishment will make your natural body size bigger so it goes against the eating disorder goals anyway.",
      "created_utc": 1656397591.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ie3dmn1",
      "author": "Sugarkitties1",
      "body": "hey, hope your doing okay today :)\nA thing I've learnt that if your having to restrict so badly to maintain a 'healthy' weight. It's probably not YOUR healthy weight.\nEveryones body is different,",
      "created_utc": 1656444530.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ie29ihf",
      "author": "thismindhurts",
      "body": "Likely because you’re actually underweight . If you’re restricting and at this weight then it’s not actually a healthy weight.\n\nEdit: I’m not talking bmi y’all can stop",
      "created_utc": 1656428661.0,
      "score": -1,
      "context": []
    },
    {
      "id": "ie2348n",
      "author": "None",
      "body": "Everyone else has already given you the answer so I'm just going to add my voice to the chorus of others saying I'm so proud of you for getting help! Stay strong :)",
      "created_utc": 1656425984.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ie4cxud",
      "author": "TypePrimary",
      "body": "For your specific E.D(anorexia), it means you have not been eating enough. A key sign that you are eating enough again, after not eating enough consistently, is gaining weight.",
      "created_utc": 1656459489.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ie4mzri",
      "author": "coteachermomma",
      "body": "Keep asking questions till you understand.",
      "created_utc": 1656464257.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ie55w3g",
      "author": "chioldren_swallower",
      "body": "In the vast majority of people tissues and muscles will need to be restored in Ed recovery. They carry the most nutrients/protein so your body uses them as fuel when it’s not getting enough nutrients for an extended period of time. So gaining weight is mostly because of muscle and tissue being restored. There’s definitely fat being gained but that’s just the body’s way of keeping you safe incase it’s not getting enough food again. Ik gaining weight is extremely hard in recovery, but you’ll be so much happier.",
      "created_utc": 1656473679.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ie59fop",
      "author": "smithscully",
      "body": "The way I understand it in my own recovery is that I will need to gain weight because I need to gain nutrients. Getting nutrients means needing to eat more food, and because my metabolism is ruined from chronic starvation, weight gain will come with the territory… I could eat less than would be normal for the needs of someone my height and sex and age but still gain weight because it’s more than my body has adjusted to (which is very little). I’m technically “obese” according to the bullshit BMI scale but I still need to gain weight/will gain weight because that’s the only way to get nutrients.",
      "created_utc": 1656475674.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ie791dv",
      "author": "pourrielle",
      "body": "Mandating \"weight restoration\" for healthy-weight people who struggle with restriction comes from set-point theory, which seemed to indicate that bodies have a certain \"set-point\" that they will fight to maintain.\n\nMore research has revealed that this isn't \\*quite\\* the case. It's more like \"settling-point\" theory. The body will \"settle\" at a weight once it's there for a few years, regardless of if that weight is healthy for the individual. \n\nUnfortunately, many people in the ED recovery space don't consider settling points and look at set points instead. A lot of treatment centres have begun to normalize binge eating in the name of weight restoration for patients. \n\nIf you can, find a treatment program that focuses on developing a healthy relationship with food rather than weight restoration. You shouldn't have to accept a weight that isn't healthy for you. If you must stay in treatment, then play along while you're there and begin working with a different team (if you can) as soon as you get out. You deserve to have a body that you feel comfortable in.",
      "created_utc": 1656519046.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ief0qbl",
      "author": "tendernesswilderness",
      "body": "Hi friend! It makes sense why you are asking what you're asking. I think they are trying to figure out a way to restore your individual nutritional status in the short term and set you up for the long term. Studies show the best chance of recovery is nutrition status plus a percentage. Don't let the percentage scare you. They know what they are doing.",
      "created_utc": 1656652951.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ie3995e",
      "author": "EDRD621",
      "body": "It’s not always true that eating more after a period of restriction leads to weight gain. I’ve seen the exact opposite plenty of times. In restriction your body does  make changes to reduce overall energy expenditure and with more consistent food intake it can begin to reverse these changes and in some people it can happen quite rapidly.",
      "created_utc": 1656442787.0,
      "score": 7,
      "context": [
        {
          "id": "ie1c75o",
          "author": "in_the_sheyd",
          "body": "It’s because if you are restricting and maintaining at a “healthy” BMI then it will gain some weight if you stop restricting. It’s not about putting on weight for the sake of putting on weight, it’s about letting your body settle into the weight it wants to be when you eat in healthy moderation.\n\nAnd on a personal level, one “atypical” anorexic to another, I’m really proud of you and all of us who are in your situation. It’s really scary but you’re doing it.",
          "created_utc": 1656410443.0
        }
      ]
    },
    {
      "id": "iox5307",
      "author": "Sillywilly2085",
      "body": "Did you gain a lot of weight back and did you loose any of that weight?",
      "created_utc": 1663505081.0,
      "score": 2,
      "context": [
        {
          "id": "ie1m493",
          "author": "FoxiiFighter",
          "body": "Weight restoration isn't always about just gaining weight. It's also about re-fueling your malnourished body. \n\nSince you said anorexia, I'm assuming that you've starved yourself for quite some time. Weight aside, that means you've been missing out out key nutrients, macro and micro. Starvation has so many other consequences to our bodies, other than just the obvious weight loss. And you need nutrients to repair that damage. \n\nFor me, I went from obese to underweight - understanding that I had to starve myself to get there meant I had to come to terms with the fact that eating a normal, healthy amount of food was going to cause weight gain. But when my psych helped me re-frame it into a \"nutrition restoration\" type of situation, the weight gain seemed a little less scary, and definitely not permanent.",
          "created_utc": 1656417479.0
        }
      ]
    },
    {
      "id": "iox58yp",
      "author": "Sillywilly2085",
      "body": "Did you gain a lot of weight. And When and how did you loose it?",
      "created_utc": 1663505160.0,
      "score": 2,
      "context": [
        {
          "id": "ie1m493",
          "author": "FoxiiFighter",
          "body": "Weight restoration isn't always about just gaining weight. It's also about re-fueling your malnourished body. \n\nSince you said anorexia, I'm assuming that you've starved yourself for quite some time. Weight aside, that means you've been missing out out key nutrients, macro and micro. Starvation has so many other consequences to our bodies, other than just the obvious weight loss. And you need nutrients to repair that damage. \n\nFor me, I went from obese to underweight - understanding that I had to starve myself to get there meant I had to come to terms with the fact that eating a normal, healthy amount of food was going to cause weight gain. But when my psych helped me re-frame it into a \"nutrition restoration\" type of situation, the weight gain seemed a little less scary, and definitely not permanent.",
          "created_utc": 1656417479.0
        }
      ]
    },
    {
      "id": "ie3452q",
      "author": "Queenofwands1212",
      "body": "This! I hate how recovery is so focused on weight. Why not focus on our eating habits and focusing on nourishing in a better way? Why does it have to be about gaining weight. Me like OP is healthy weight and I have no desire to “fully recover” because I am not ok with gaining more weight.",
      "created_utc": 1656440737.0,
      "score": 8,
      "context": [
        {
          "id": "ie1ft6j",
          "author": "None",
          "body": "The BMI system is dumb. Everyone’s resting/neutral body weight is different. When I was in recovery, I focused on eating the right amount of food to power my body and not restricting and let my body reach it’s neutral weight. I have no idea if my personal neutral falls in the BMI scale and I don’t care. It’s the weight I am when I’m feeding and fueling my body in the way it needs. \n\nDon’t focus on the scale! I know it’s hard, but If you keep pushing yourself to focus on what makes your body feel good and gives you energy, it will get easier. \n\nYou are so strong for doing this!! Proud of you!",
          "created_utc": 1656413288.0
        }
      ]
    },
    {
      "id": "ie3haxx",
      "author": "JuniperTheEnby",
      "body": "you can restrict and be any weight",
      "created_utc": 1656446002.0,
      "score": 5,
      "context": [
        {
          "id": "ie29ihf",
          "author": "thismindhurts",
          "body": "Likely because you’re actually underweight . If you’re restricting and at this weight then it’s not actually a healthy weight.\n\nEdit: I’m not talking bmi y’all can stop",
          "created_utc": 1656428661.0
        }
      ]
    },
    {
      "id": "ie35e5j",
      "author": "None",
      "body": "It took me a long time to let go of my fear of gaining weight. I haven’t weighed myself since deciding to go on the journey to recovery, but I know I gained weight after being so so so fearful of what that would mean. But that’s not how I try to look at it. I didn’t just gain weight; I reclaimed my health and happiness. Now, I truly feel happier and healthier than ever and I wish I had made this shift earlier in my life. I can’t believe I valued my weight over my happiness, my weight over my motivation, my weight over my intelligence, my weight over my energy, my weight over everything! It’s so scary to do, but my hope is for everyone in recovery to get there and feel the freedom it brought me.",
      "created_utc": 1656441243.0,
      "score": 5,
      "context": [
        {
          "id": "ie1ft6j",
          "author": "None",
          "body": "The BMI system is dumb. Everyone’s resting/neutral body weight is different. When I was in recovery, I focused on eating the right amount of food to power my body and not restricting and let my body reach it’s neutral weight. I have no idea if my personal neutral falls in the BMI scale and I don’t care. It’s the weight I am when I’m feeding and fueling my body in the way it needs. \n\nDon’t focus on the scale! I know it’s hard, but If you keep pushing yourself to focus on what makes your body feel good and gives you energy, it will get easier. \n\nYou are so strong for doing this!! Proud of you!",
          "created_utc": 1656413288.0
        },
        {
          "id": "ie3452q",
          "author": "Queenofwands1212",
          "body": "This! I hate how recovery is so focused on weight. Why not focus on our eating habits and focusing on nourishing in a better way? Why does it have to be about gaining weight. Me like OP is healthy weight and I have no desire to “fully recover” because I am not ok with gaining more weight.",
          "created_utc": 1656440737.0
        }
      ]
    },
    {
      "id": "iegdt2b",
      "author": "thismindhurts",
      "body": "Yes but how does that make it a healthy weight? Is a healthy weight not the one where you’re not starving yourself or are we all so sick that we really can’t steer clear of the bmi for a literal suffering person",
      "created_utc": 1656685161.0,
      "score": 1,
      "context": [
        {
          "id": "ie29ihf",
          "author": "thismindhurts",
          "body": "Likely because you’re actually underweight . If you’re restricting and at this weight then it’s not actually a healthy weight.\n\nEdit: I’m not talking bmi y’all can stop",
          "created_utc": 1656428661.0
        },
        {
          "id": "ie3haxx",
          "author": "JuniperTheEnby",
          "body": "you can restrict and be any weight",
          "created_utc": 1656446002.0
        }
      ]
    },
    {
      "id": "ie36ba9",
      "author": "Queenofwands1212",
      "body": "If I gained 40 lbs with my short frame I would be obese. I have no desire to gain weight. I think recovery IS possible for folks who want to maintain. But the Ed recovery community is so black and white thinking. This is why I love and follow the work of mindy pluzter",
      "created_utc": 1656441615.0,
      "score": 1,
      "context": [
        {
          "id": "ie1ft6j",
          "author": "None",
          "body": "The BMI system is dumb. Everyone’s resting/neutral body weight is different. When I was in recovery, I focused on eating the right amount of food to power my body and not restricting and let my body reach it’s neutral weight. I have no idea if my personal neutral falls in the BMI scale and I don’t care. It’s the weight I am when I’m feeding and fueling my body in the way it needs. \n\nDon’t focus on the scale! I know it’s hard, but If you keep pushing yourself to focus on what makes your body feel good and gives you energy, it will get easier. \n\nYou are so strong for doing this!! Proud of you!",
          "created_utc": 1656413288.0
        },
        {
          "id": "ie3452q",
          "author": "Queenofwands1212",
          "body": "This! I hate how recovery is so focused on weight. Why not focus on our eating habits and focusing on nourishing in a better way? Why does it have to be about gaining weight. Me like OP is healthy weight and I have no desire to “fully recover” because I am not ok with gaining more weight.",
          "created_utc": 1656440737.0
        },
        {
          "id": "ie35e5j",
          "author": "None",
          "body": "It took me a long time to let go of my fear of gaining weight. I haven’t weighed myself since deciding to go on the journey to recovery, but I know I gained weight after being so so so fearful of what that would mean. But that’s not how I try to look at it. I didn’t just gain weight; I reclaimed my health and happiness. Now, I truly feel happier and healthier than ever and I wish I had made this shift earlier in my life. I can’t believe I valued my weight over my happiness, my weight over my motivation, my weight over my intelligence, my weight over my energy, my weight over everything! It’s so scary to do, but my hope is for everyone in recovery to get there and feel the freedom it brought me.",
          "created_utc": 1656441243.0
        }
      ]
    },
    {
      "id": "iege4xh",
      "author": "JuniperTheEnby",
      "body": "an unhealthy weight does not mean underweight.",
      "created_utc": 1656685302.0,
      "score": 1,
      "context": [
        {
          "id": "ie29ihf",
          "author": "thismindhurts",
          "body": "Likely because you’re actually underweight . If you’re restricting and at this weight then it’s not actually a healthy weight.\n\nEdit: I’m not talking bmi y’all can stop",
          "created_utc": 1656428661.0
        },
        {
          "id": "ie3haxx",
          "author": "JuniperTheEnby",
          "body": "you can restrict and be any weight",
          "created_utc": 1656446002.0
        },
        {
          "id": "iegdt2b",
          "author": "thismindhurts",
          "body": "Yes but how does that make it a healthy weight? Is a healthy weight not the one where you’re not starving yourself or are we all so sick that we really can’t steer clear of the bmi for a literal suffering person",
          "created_utc": 1656685161.0
        }
      ]
    },
    {
      "id": "ie3o4a9",
      "author": "None",
      "body": "That’s great for you! It would also be great if you didn’t speak so negatively about gaining 40 lbs as I just shared that was the journey I went through. In a community where we’re all pursuing recovery, I hope you will be more sensitive in the future.",
      "created_utc": 1656448700.0,
      "score": 3,
      "context": [
        {
          "id": "ie1ft6j",
          "author": "None",
          "body": "The BMI system is dumb. Everyone’s resting/neutral body weight is different. When I was in recovery, I focused on eating the right amount of food to power my body and not restricting and let my body reach it’s neutral weight. I have no idea if my personal neutral falls in the BMI scale and I don’t care. It’s the weight I am when I’m feeding and fueling my body in the way it needs. \n\nDon’t focus on the scale! I know it’s hard, but If you keep pushing yourself to focus on what makes your body feel good and gives you energy, it will get easier. \n\nYou are so strong for doing this!! Proud of you!",
          "created_utc": 1656413288.0
        },
        {
          "id": "ie3452q",
          "author": "Queenofwands1212",
          "body": "This! I hate how recovery is so focused on weight. Why not focus on our eating habits and focusing on nourishing in a better way? Why does it have to be about gaining weight. Me like OP is healthy weight and I have no desire to “fully recover” because I am not ok with gaining more weight.",
          "created_utc": 1656440737.0
        },
        {
          "id": "ie35e5j",
          "author": "None",
          "body": "It took me a long time to let go of my fear of gaining weight. I haven’t weighed myself since deciding to go on the journey to recovery, but I know I gained weight after being so so so fearful of what that would mean. But that’s not how I try to look at it. I didn’t just gain weight; I reclaimed my health and happiness. Now, I truly feel happier and healthier than ever and I wish I had made this shift earlier in my life. I can’t believe I valued my weight over my happiness, my weight over my motivation, my weight over my intelligence, my weight over my energy, my weight over everything! It’s so scary to do, but my hope is for everyone in recovery to get there and feel the freedom it brought me.",
          "created_utc": 1656441243.0
        },
        {
          "id": "ie36ba9",
          "author": "Queenofwands1212",
          "body": "If I gained 40 lbs with my short frame I would be obese. I have no desire to gain weight. I think recovery IS possible for folks who want to maintain. But the Ed recovery community is so black and white thinking. This is why I love and follow the work of mindy pluzter",
          "created_utc": 1656441615.0
        }
      ]
    },
    {
      "id": "iegez8a",
      "author": "thismindhurts",
      "body": "Ahh I get where I was misleading. I probably should’ve prefaced better thatI’m not arguing that the classification is the issue, by bmi terms we know what they mean but in terms of actual health there’s nothing “healthy” about a weight that involves starving. Plenty of research supports the idea of a less objective measure of weight health and that subjective or metabolic measures could indicate someone’s underweight in terms of health[(Golubnitschaja et. al, 2021 is just one example I’d love to find more if I weren’t annoying haha)](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8368050/). Idk I just think clearly if you’re a bmi of X but it took doing damage to your body to get/maintain it then clearly that’s underweight for you. Like regardless of bmi if you are starving you’re probably in some form of energy deficit",
      "created_utc": 1656685661.0,
      "score": 1,
      "context": [
        {
          "id": "ie29ihf",
          "author": "thismindhurts",
          "body": "Likely because you’re actually underweight . If you’re restricting and at this weight then it’s not actually a healthy weight.\n\nEdit: I’m not talking bmi y’all can stop",
          "created_utc": 1656428661.0
        },
        {
          "id": "ie3haxx",
          "author": "JuniperTheEnby",
          "body": "you can restrict and be any weight",
          "created_utc": 1656446002.0
        },
        {
          "id": "iegdt2b",
          "author": "thismindhurts",
          "body": "Yes but how does that make it a healthy weight? Is a healthy weight not the one where you’re not starving yourself or are we all so sick that we really can’t steer clear of the bmi for a literal suffering person",
          "created_utc": 1656685161.0
        },
        {
          "id": "iege4xh",
          "author": "JuniperTheEnby",
          "body": "an unhealthy weight does not mean underweight.",
          "created_utc": 1656685302.0
        }
      ]
    }
  ]
}