{
  "id": "vy56uc",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1657724200.0,
  "title": "ED Recovery problems: Used to starve myself - now I can't stop eating :(",
  "selftext": "Hi. I'm asking for advice.\n\n&#x200B;\n\nI've struggled with disordered eating on and off since my teens. I'm now almost 30. I've been starving myself an awful lot, especially the last 3 years. \n\n&#x200B;\n\nIn January this year I decided to start treating my body right and focusing on getting strong and healthy looking instead of small, weak and sick looking. I've been lifting weights and working out several times a week since, and I've pushed myself to eat accordingly.\n\n&#x200B;\n\nWhat I'm finding is that it's hard for me to eat \"normal\". I can starve myself like I've done in the past, or I can over eat to \"make up for\" how restrictive and mean I've been to myself. I can't seem to find a balance. I'm obsessive over food all the time and I'm so fucking tired of thinking so much about it. I don't want to, I'm so fucking done.\n\nFor example when I eat my healthy sized, varied and delicious breakfast every morning, I get so sad after my last bite because it was the last bite. My thoughts run crazy with things like \"it's so unfair other people can eat how much they want but I have to control my portions\", \"I'm not full enough, I want to eat more but I cant, and I feel so bad for myself for never being satisfied\". I also find it extremely hard to control myself with delicious food. I recently got a new boyfriend who is an amazing cook, and whenever he makes something amazing (basically every fucking day) I'm struggling so incredibly much with not over eating to the point of great physical discomfort.\n\n&#x200B;\n\nIt's like my body wants revenge for all the starvation in the past. I want to eat or chew something all the time, unrelated to being hungry or not - even when I'm already really full. Then comes the \"this is unfair\"-thoughts and the shame and I'm just so exhausted by it all. I want to have a normal, calm and stress-less relationship to food. I want to not think about food and my body all the goddamn time.\n\n&#x200B;\n\nI'm wondering if anyone can relate, and if so, what are your ways of handling it? Have you found anything that has made it better and made your thoughts around food healthier?\n\nThanks",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/vy56uc/ed_recovery_problems_used_to_starve_myself_now_i/",
  "score": 100,
  "num_comments": 29,
  "comments": [
    {
      "id": "ig20rgk",
      "author": "None",
      "body": "It’s called extreme hunger and is VERY common in recovery. Go to the r/fuckeatingdisorders sub and you’ll find you are far from alone in this",
      "created_utc": 1657753379.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ig0t14s",
      "author": "officialjohngoodman",
      "body": "been there - ive noticed it recurs with hormonal fluctuation (like switching bc or any meds) or life changes. what helps me is to try and disassociate food with strong emotion and focus more on how your body is feeling while you eat. define for yourself strictly what it means to be full, bodily and not emotionally. i think eds for a lot of people cause us to lose tangible grasp on the concept of “satisfaction.” sterilize the negative association and think more on the sentiment - how much are you really enjoying these moments/meals when youre essentially in frenzy mode? my motto has been “relaxed awareness” and its helped me.\n\nhope that helps sorry youre going through it :/",
      "created_utc": 1657735927.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ig1yene",
      "author": "ciaowdy",
      "body": "I'm sorry you're experiencing this. I went through it to. Decided to just let myself eat when I felt hungry. Tried to eat healthily, but I recognized that a lot of my issues stemmed from attaching a sort of moral value to food ('good' foods, 'bad' foods), so I eventually just said fuck it! And let myself eat. It took me about a year for my hunger urges to regulate. I'm so glad I took the time to just let myself focus on food as fuel, and sometimes pleasure. I did gain weight, but I lost weight again eventually and am now at a healthy weight, eat relatively clean, and I do not agonize so much about what I am eating. I have days where I'll overeat, over indulge, or stress eat, but I find that I don't worry about it too much like would have in the past. Over the course of a week or so, you will naturally adjust your average caloric intake, IME. I guess I'm trying to say that this will pass. Try to work on your relationship with food and challenge your habits and beliefs. I recommend learning how to cook it you don't already know how!",
      "created_utc": 1657752368.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ig0o0yl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1657733984.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ig10vot",
      "author": "logicalinsanity675",
      "body": "I can definitely relate and I’m so sorry you’re going through this; it’s torturous. Your body is just trying to protect you, as annoying as it might be. Instead of just saying “I’m never bingeing again,” try to hold off the next time you get an urge. Hold off for 15 minutes, then let yourself do it. Next time , hold off for 30 mins, etc. And by hold off I mean literally sit there alone with your thoughts and zero distractions, not tv or music or anything. You’re re-training your brain to know that you don’t need those urges to binge anymore. There’s a misconception that if you just eat enough, the urges to binge will stop, but that’s not the case. Be patient with yourself and sit there with the urge either until you can’t stand it anymore, or until it goes away. The if you wait it out long enough (which I know is hard), it will eventually go away. Celebrate the little victories and don’t beat yourself up for falling back into old habits, because it’s never too late to try again the next day. Good luck! Also I recommend the book “brain over binge” which taught me a lot of this!",
      "created_utc": 1657738974.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ig1ecmf",
      "author": "ash5991",
      "body": " I'm about the same age as you and went through disordered eating since pre-teen/teen years. I've been obese, overweight, and average weight. I started trying to kick the ED behaviors in January  2021, kind of a new years resolution. I did gain about 13 pounds in the last year and a half, I'm not crazy about it, but my body is definitely more healthy and wayyy stronger. I was absolutely ravenous for months and it was so depressing for me. I went back and forth with ED behaviors for the first year or so, mostly binging. And it was so hard to find a happy medium. I think it really came down to time and commitment for me. I was a major calorie counter and deleting the apps that I used for that helped. I tried to just eat three healthy meals a day (not crazy healthy, just somewhere in the middle) and to give myself some grace. The last bit was probably the hardest. I'm sorry I can't really offer you any tips, just support. It's hard, but don't give up ❤",
      "created_utc": 1657744195.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ig14k2a",
      "author": "None",
      "body": "This is really common! I struggled with the same problem for *years*. \n\nWhile initially it was triggering, I found that logging my food intake was incredibly helpful. When you have an ED, you're thinking about what you've eaten and what you're going to eat next *all the time --* which is a huge cognitive load, not to mention emotionally draining. Logging what I ate allowed me to offset that load: the information was stored in my phone, and I could access it if I needed to, but more and more I found that I didn't need to. Logging gave my ED brain \"permission\" to stop obsessing over what I'd eaten and planning what I was going to eat next. It also allowed me to visually *see* my meals, which was really helpful when my ability to feel hungry/feel full was completely out of whack.\n\nAnother tip: tea. Weird, I know, but having a big collection of flavored teas (including dessert-y ones) that I can drink anytime has been really helpful for combating stress cravings. Half the time my ED brain doesn't \"know\" I'm filling up on a caramel-flavored beverage rather than, you know, eating caramels, so it \"allows\" me to feel full, the stress dissipates, and I realize I wasn't actually hungry to begin with.",
      "created_utc": 1657740391.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ig10zxr",
      "author": "AdministrativeBar621",
      "body": "im 37, been through this and possibly worse but ive recovered nicely. im here if u wanna talk in dms.",
      "created_utc": 1657739019.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ig2dgxq",
      "author": "helpmeplease1046",
      "body": "this is normal i can’t remember exactly what it’s called but i went through it too 2 years ago after attempting recovery as well!! i hope you are able to find balance soon!",
      "created_utc": 1657758985.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ig2jbg5",
      "author": "mosephis13",
      "body": "I can relate to this.  I was anorexic as a teenager, ballooned up in college.  Nearly anorexic again in my early 30s… then leveled out and have maintained a healthy weight in my 40s.\n\nI read a lot of books about intuitive eating and went to therapy.  I also focused on other things (picked up knitting as a hobby, later competed my MBA).  You’ll get there. Be patient with yourself - your body will learn that you’re not going to starve it again.",
      "created_utc": 1657761578.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ig1siiq",
      "author": "None",
      "body": "Read 'Mother Hunger' by Kelly McDaniel.",
      "created_utc": 1657749875.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ig28t61",
      "author": "None",
      "body": "I relate so much to you, and is important that we recognize our flaws and understand we are only human. That’s why is important to treat our body with respect and love, all those years of starving has made us feel now that we have to make up for the food we missed. My advice is that you respect your body and remind yourself that is okay to have big portions but the same way starving made you feel like in control, overeating makes you feel like you lost control which is also important as well. You can try dividing your portions to 6 meals a day so it tricks your brain into feeling like you are more.\nSending love and hugs and you’re not alone❤️",
      "created_utc": 1657756919.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ig2i2po",
      "author": "FloatingKoalas",
      "body": "I can relate to this. Everytime I slip in my recovery and go through a period of restricting over exercising and plain obsession with losing weight, I end up rebounding and not being able to find a balanced diet. Mainly because in that stage I am simply unable to manage food intake without risking going straight back into restriction so... I have learnt to kind of allow it and do a lot of meditation, restorative yoga and positive self talk, no matter how forced that feels on some days: the effect is that it shortens those rebound periods for me and I get to a place where I can have my healthiest relationship with food (which won't ever be 100% healthy) and not be obsessing about it 24/7.",
      "created_utc": 1657761021.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ig2k0u4",
      "author": "None",
      "body": "Intuitive eating helped me with this. At first after years of restricting, I would overeat but then I naturally got more of a balance and barely think about food other than a normal amount to plan and eat meals. It’s so nice to not obsess anymore. Hugs to you, not an easy journey but don’t give up. It takes time.",
      "created_utc": 1657761890.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ig3ngi5",
      "author": "sweetparamour79",
      "body": "Hello!!! I am 31 and I have experienced an eating disorder for 15 years. For me not tracking is not an option- I am having to relearn how to intuitively eat. \n\nI recommend either getting a nutritionist, nutrition coach or establishing some basic macros. Macros are great because it readjust how you think about calories and prevents you from going crazy on complete rubbish food (but you can also learn to work it in as well). A coach is good because they can help remind you of the process and adjust calories as your bodies metabolism recovers. \n\nAlso therapy, CBTE saved my sanity and has allowed me to get 27 weeks into a pregnancy with out starving myself and only having 2 bad mental days. There are SO many thought patterns that need to be revised and undone. \n\nThe journey is long but you deserve to feel good in your skin and you deserve to have other things occupy your mind.",
      "created_utc": 1657784824.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ig3nl3n",
      "author": "None",
      "body": "It seems very similar to my experience: I have been diagnosed with anorexia nervosa when I was 17. I had a very low weight for a couple of years; than I managed to maintain the minimum healthy weight for 6-7 years; I started running and pay more attention to regular, healthy meals..but the situation got out of control after two years. Binge eating episodes became more and more frequent and bigger. I gained 10 kg, despite running a lot (90-100 km per week). I tried to reduce and even substitute my running routine with a walking one, hoping that eating would become more manageable. I am still struggling...my therapist says that I should abandon control: stop counting the calories, stop weighting the food.. just enjoy every meal and eat whatever I feel like. But how can I do it?? I feel like I am always hungry..I wish I could find something stronger than food to fill my life.",
      "created_utc": 1657784931.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ig40lvg",
      "author": "None",
      "body": "I’m struggling with the same❤️ I just posted about extreme hunger and wondering what others on here have experienced with honoring the extreme desire for food. I linked a blog post by Tabitha Farrar (https://tabithafarrar.com/2017/02/anorexia-recovery-eating/) which I think you’ll find comforting. I’m struggling with allowing myself all the food my body and mind is telling me to eat, and I find it extremely hard to let go.",
      "created_utc": 1657795469.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ig49vet",
      "author": "kylemikahel",
      "body": "It's tough but common. Your body doesn't want to revenge, your body wats to heal. You body doesn't trust you. It thinks you'll starve after eating so it wants to eat as much as possible to protect itself. Honoring your hunger by allowing yourself to eat everything you want in the portion size your body is asking for is what you have to do to overcome this situation. If you don't do it, this phase will last longer and you may relapse bc of this frustrating feeling.\nBelieve, but it's just a phase and it will eventually end as soon as your body start trusting you. Search for \"extreme hunger\" i think it can help you to understand this feeling. Like, think you're in debt to your body. Now it's not asking but demanding you to pay for all the years you damaged it. Trust your body, you'll overcome it.",
      "created_utc": 1657801183.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ig4p3dj",
      "author": "hstormborn",
      "body": "This is the absolute worst. I’m either actively disordered or binge eating, no in between.",
      "created_utc": 1657808189.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ih2a7fi",
      "author": "haylibannon",
      "body": "i go through this, you are not alone and you can message me whenever!",
      "created_utc": 1658418027.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ihjsgfm",
      "author": "Puzzleheaded_lava",
      "body": "You CAN stop eating. You DO stop eating. When you're taking a shower or sleeping or doing something you enjoy. \n\nI know this might seem like a small silly adjustment...but honestly...I think it can make a huge difference in your mindset and that seems to be where your stress is coming from. Even if it's only \"I'm going to eat this this plate and then take a small break\" before you eat more, it can help you feel in control and remind yourself that you are able to gauge yourself and feel satiated. Take the time to say what you liked about a plate. What flavors and textures and smells you enjoyed. What felt good while you chewing, swallowing etc. Tell your boyfriend! Ask him about his techniques! Where did he learn the recipe? Does it have any special meaning to him? \n\nTell you body your going give it what it needs and check in with it. If you aren't satiated yet... then say \"I am going to nourish my body because it is asking me to respect it's needs!\" \n\nRecovery is tough. You can do it. I believe in you. It sounds like you are making a lot of progress even if it doesn't feel like it.",
      "created_utc": 1658732849.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ii7pfeh",
      "author": "Prize-Suggestion8623",
      "body": "I totally relate. Overeaters Anonymous (also for anorexics and bulimics) is a miracle. Check out oa.org for more information.",
      "created_utc": 1659150116.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ig3j6r2",
      "author": "None",
      "body": "I never knew this, thank you so much!!! I feel so much better knowing this <3 <3",
      "created_utc": 1657781439.0,
      "score": 3,
      "context": [
        {
          "id": "ig20rgk",
          "author": "None",
          "body": "It’s called extreme hunger and is VERY common in recovery. Go to the r/fuckeatingdisorders sub and you’ll find you are far from alone in this",
          "created_utc": 1657753379.0
        }
      ]
    },
    {
      "id": "ig3jc9y",
      "author": "None",
      "body": ">i think eds for a lot of people cause us to lose tangible grasp on the concept of “satisfaction.”\n\nyes this!",
      "created_utc": 1657781558.0,
      "score": 3,
      "context": [
        {
          "id": "ig0t14s",
          "author": "officialjohngoodman",
          "body": "been there - ive noticed it recurs with hormonal fluctuation (like switching bc or any meds) or life changes. what helps me is to try and disassociate food with strong emotion and focus more on how your body is feeling while you eat. define for yourself strictly what it means to be full, bodily and not emotionally. i think eds for a lot of people cause us to lose tangible grasp on the concept of “satisfaction.” sterilize the negative association and think more on the sentiment - how much are you really enjoying these moments/meals when youre essentially in frenzy mode? my motto has been “relaxed awareness” and its helped me.\n\nhope that helps sorry youre going through it :/",
          "created_utc": 1657735927.0
        }
      ]
    },
    {
      "id": "ig3qb34",
      "author": "None",
      "body": "this is such great advice. thank you so much. i'll try my best!",
      "created_utc": 1657787189.0,
      "score": 2,
      "context": [
        {
          "id": "ig1yene",
          "author": "ciaowdy",
          "body": "I'm sorry you're experiencing this. I went through it to. Decided to just let myself eat when I felt hungry. Tried to eat healthily, but I recognized that a lot of my issues stemmed from attaching a sort of moral value to food ('good' foods, 'bad' foods), so I eventually just said fuck it! And let myself eat. It took me about a year for my hunger urges to regulate. I'm so glad I took the time to just let myself focus on food as fuel, and sometimes pleasure. I did gain weight, but I lost weight again eventually and am now at a healthy weight, eat relatively clean, and I do not agonize so much about what I am eating. I have days where I'll overeat, over indulge, or stress eat, but I find that I don't worry about it too much like would have in the past. Over the course of a week or so, you will naturally adjust your average caloric intake, IME. I guess I'm trying to say that this will pass. Try to work on your relationship with food and challenge your habits and beliefs. I recommend learning how to cook it you don't already know how!",
          "created_utc": 1657752368.0
        }
      ]
    },
    {
      "id": "ig0r0qr",
      "author": "None",
      "body": "thank you so much for your reply. it really helps to know someone else experienced the same thing and that it passed. good luck with your recovery!",
      "created_utc": 1657735138.0,
      "score": 8,
      "context": [
        {
          "id": "ig0o0yl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1657733984.0
        }
      ]
    },
    {
      "id": "ig40b2r",
      "author": "KitCatapult",
      "body": "Ooh this is awesome help.",
      "created_utc": 1657795252.0,
      "score": 2,
      "context": [
        {
          "id": "ig14k2a",
          "author": "None",
          "body": "This is really common! I struggled with the same problem for *years*. \n\nWhile initially it was triggering, I found that logging my food intake was incredibly helpful. When you have an ED, you're thinking about what you've eaten and what you're going to eat next *all the time --* which is a huge cognitive load, not to mention emotionally draining. Logging what I ate allowed me to offset that load: the information was stored in my phone, and I could access it if I needed to, but more and more I found that I didn't need to. Logging gave my ED brain \"permission\" to stop obsessing over what I'd eaten and planning what I was going to eat next. It also allowed me to visually *see* my meals, which was really helpful when my ability to feel hungry/feel full was completely out of whack.\n\nAnother tip: tea. Weird, I know, but having a big collection of flavored teas (including dessert-y ones) that I can drink anytime has been really helpful for combating stress cravings. Half the time my ED brain doesn't \"know\" I'm filling up on a caramel-flavored beverage rather than, you know, eating caramels, so it \"allows\" me to feel full, the stress dissipates, and I realize I wasn't actually hungry to begin with.",
          "created_utc": 1657740391.0
        }
      ]
    },
    {
      "id": "ig56ttz",
      "author": "None",
      "body": "thank you for your comment and support! however, personally, i have a problem with this. i don’t want to fight my ed with another ed, which is how i see that potential situation. it’s just as bad to over eat as to under eat, and i want to stay in the middle. i want (to want to) be healthy. not malnourished and not overweight. it that will make it take longer for this phase to pass, then i’ll just have to deal with that. i find it very demotivating, but that’s just what i think is the right thing to do for myself",
      "created_utc": 1657815092.0,
      "score": 1,
      "context": [
        {
          "id": "ig49vet",
          "author": "kylemikahel",
          "body": "It's tough but common. Your body doesn't want to revenge, your body wats to heal. You body doesn't trust you. It thinks you'll starve after eating so it wants to eat as much as possible to protect itself. Honoring your hunger by allowing yourself to eat everything you want in the portion size your body is asking for is what you have to do to overcome this situation. If you don't do it, this phase will last longer and you may relapse bc of this frustrating feeling.\nBelieve, but it's just a phase and it will eventually end as soon as your body start trusting you. Search for \"extreme hunger\" i think it can help you to understand this feeling. Like, think you're in debt to your body. Now it's not asking but demanding you to pay for all the years you damaged it. Trust your body, you'll overcome it.",
          "created_utc": 1657801183.0
        }
      ]
    },
    {
      "id": "ig7nsa9",
      "author": "vunderfulme",
      "body": "Can this happen 20 years after being anorexic? I feel so emotional reading your comment. I feel like I never dealt wiith the trauma related to my anorexia. I thought I was ok.  But after having 3 children and now eating too\nmuch and being 80lbs overweight I feel like I will never be free of food controlling me. Why am I such a failure???",
      "created_utc": 1657851519.0,
      "score": 1,
      "context": [
        {
          "id": "ig49vet",
          "author": "kylemikahel",
          "body": "It's tough but common. Your body doesn't want to revenge, your body wats to heal. You body doesn't trust you. It thinks you'll starve after eating so it wants to eat as much as possible to protect itself. Honoring your hunger by allowing yourself to eat everything you want in the portion size your body is asking for is what you have to do to overcome this situation. If you don't do it, this phase will last longer and you may relapse bc of this frustrating feeling.\nBelieve, but it's just a phase and it will eventually end as soon as your body start trusting you. Search for \"extreme hunger\" i think it can help you to understand this feeling. Like, think you're in debt to your body. Now it's not asking but demanding you to pay for all the years you damaged it. Trust your body, you'll overcome it.",
          "created_utc": 1657801183.0
        }
      ]
    },
    {
      "id": "ig7qode",
      "author": "kylemikahel",
      "body": "You need to understand it's IMPOSSIBLE to jump from a restrictive ed to a non-restrictive one in a couple of months. Impossible. \nYou're not overeating, you're hungry but while keeping those behavior your body will never adjust your hunger so you will be stuck on this over/under eating and being sincere also stuck on Ed. \nThere's a lot of information about this topic on the internet, i think you should check if you have doubt about it. Best wishes on your journey.",
      "created_utc": 1657852895.0,
      "score": 1,
      "context": [
        {
          "id": "ig49vet",
          "author": "kylemikahel",
          "body": "It's tough but common. Your body doesn't want to revenge, your body wats to heal. You body doesn't trust you. It thinks you'll starve after eating so it wants to eat as much as possible to protect itself. Honoring your hunger by allowing yourself to eat everything you want in the portion size your body is asking for is what you have to do to overcome this situation. If you don't do it, this phase will last longer and you may relapse bc of this frustrating feeling.\nBelieve, but it's just a phase and it will eventually end as soon as your body start trusting you. Search for \"extreme hunger\" i think it can help you to understand this feeling. Like, think you're in debt to your body. Now it's not asking but demanding you to pay for all the years you damaged it. Trust your body, you'll overcome it.",
          "created_utc": 1657801183.0
        },
        {
          "id": "ig56ttz",
          "author": "None",
          "body": "thank you for your comment and support! however, personally, i have a problem with this. i don’t want to fight my ed with another ed, which is how i see that potential situation. it’s just as bad to over eat as to under eat, and i want to stay in the middle. i want (to want to) be healthy. not malnourished and not overweight. it that will make it take longer for this phase to pass, then i’ll just have to deal with that. i find it very demotivating, but that’s just what i think is the right thing to do for myself",
          "created_utc": 1657815092.0
        }
      ]
    }
  ]
}