{
  "id": "vzd08t",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1657851266.0,
  "title": "My friend has POTS and an ED and it’s getting scary",
  "selftext": "My friend has had an ED for years upon years and she was diagnosed with POTS a little over a year ago. I’m only here because her POTS has gotten worse on top of her already preexisting ED and it’s just ruining her every day life. Making her feel sick all the time. She doesn’t eat or drink anything because she says she doesn’t feel hungry or doesn’t want to eat/drink because it makes her feel sick. She used to be like an hourglass. Slim waist thick thighs. But she has lost so much weight I’ve never seen her so skinny in my life. Like she isn’t just “skinnier”. It looks like she’s slowly dying. It’s an extremely unhealthy skinny. She lives w me and I just don’t know what to do and she doesn’t have any drive to help herself either. She also has Covid rn and went to the hospital but they literally did nothing for her. They didn’t even give her fluids THAT SHE MOST DEFINITELY NEEDED because she isn’t eating.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/vzd08t/my_friend_has_pots_and_an_ed_and_its_getting_scary/",
  "score": 39,
  "num_comments": 6,
  "comments": [
    {
      "id": "ig89rog",
      "author": "sailor_mars25",
      "body": "Hey there, firstly I want to say you’re an incredible friend for seeking help on how to support her. I also have diagnosed POTS and anorexia, which is a horrible combination to have. I can understand where you’re coming from seeing her so sick, because at my lowest I was sooo sick all the time from my heart. Fear of fluid intake because you might gain is the worst part, people with POTS need way more water than people without, and then not eating enough sodium on top of that only exacerbates things. Unfortunately there isn’t much you can do about the ED besides support her as best you can, and let her know you’re there for her. There are lots of places that have resources on how to help loved ones with EDs, but since everyone is different I would recommend approaching her by asking how you could best help. (like my boyfriend does puzzles with me while we ate to distract me, and blocked out the nutrition labels on everything!) \n\nAs for helping with POTS; if she’s able to, try to get her to drink more water. I don’t really have any tricks to that since I also have a fluid intake mental block, but I know that I have to do it if I want to function. Though I do find putting lemon or lime juice in it makes drinking it a little easier. Sodium doesn’t have to come in food either, salt tablets and electrolyte pills are great ! You can get them on Amazon. Pickles, olives, salted duck eggs, kimchi, most any preserved food is great as well. If she has any safe foods have her add lots of salt to it. Finally, if it’s an option, she can do medication. I take propranolol (60mg ER), and it’s made the biggest improvement and has managed me down to minor symptoms when they used to be severe. \nAgain thank you for looking out for your friend like this, and I hope this helped if even a little bit.",
      "created_utc": 1657863464.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ig7nmz4",
      "author": "None",
      "body": "She also hasn’t been able to work for well over a year. So she’s stuck at home everyday feeling like absolute shit. Im just worried for her and want to help her. She’s practically my sister. Im also a male and have never had an ED so I just need help, helping her.",
      "created_utc": 1657851451.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ig8368x",
      "author": "Pinklemonade1996",
      "body": "I’m so sorry to hear this. Thank you for being a supportive friend. Is she an adult or is she less than 18?",
      "created_utc": 1657859384.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ig90ipg",
      "author": "plzkthx71",
      "body": "Pots and ed gang 😎🥲",
      "created_utc": 1657883838.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ig8vt7b",
      "author": "None",
      "body": "She’s 23",
      "created_utc": 1657880545.0,
      "score": 3,
      "context": [
        {
          "id": "ig8368x",
          "author": "Pinklemonade1996",
          "body": "I’m so sorry to hear this. Thank you for being a supportive friend. Is she an adult or is she less than 18?",
          "created_utc": 1657859384.0
        }
      ]
    },
    {
      "id": "igd57s9",
      "author": "Pinklemonade1996",
      "body": "All you can do at this point is support her and love her the best you can and tell her how much she means to you and that it would mean the world to you if she got better. Sadly you cannot commit her nor can her family because she’s an adult. But you can support her and love her and try your best to keep convincing her to get help.",
      "created_utc": 1657952929.0,
      "score": 1,
      "context": [
        {
          "id": "ig8368x",
          "author": "Pinklemonade1996",
          "body": "I’m so sorry to hear this. Thank you for being a supportive friend. Is she an adult or is she less than 18?",
          "created_utc": 1657859384.0
        },
        {
          "id": "ig8vt7b",
          "author": "None",
          "body": "She’s 23",
          "created_utc": 1657880545.0
        }
      ]
    }
  ]
}