{
  "id": "w063pv",
  "subreddit": "EatingDisorders",
  "author": "yourfavepenguinpingu",
  "created_utc": 1657939448.0,
  "title": "Small win! Went to the dentist after avoiding them for years even though I knew I had a problem",
  "selftext": "Not sure how relevant this is to the sub but no friends I can actually share this with for obvious reasons. \n\nGrowing up I always had issues with my teeth which are probably due to binging tendencies looking back now. My dentist at the time wasn’t the nicest of people around it even if he didn’t know and always used to make comments like “What procedure are we doing today then?” and “You’ve damaged another one *sigh*”. \n\nGood I got the treatments but his small side comments and attitude made me so anxious about going to the dentist. Once I moved location for university I didn’t really think anything about finding another dentist. Then something came up with one of my teeth a few years ago. At the time I hoped it would just go but obviously that never happened. About a year in I realised the only way to treat it was with antibiotics, but I still wasn’t ready to go back to the dentist so I just left it again🤧\n\nRecently one of my uni friends got a dental procedure done and was speaking about how nice the dentist was so I decided it was finally time to face my fears and have my teeth checked. Before this I was expecting him to ask why there are so many cavities etcetera so I was rehearsing mentally how to tell him that I have problems with food😅\n\nI went a few days ago and she was right. Super kind, didn’t chastise me for my teeth and made sure to explain everything to me so that I could understand it. \n\nI know this isn’t a step forward for the ED but it’s definitely a step forward in my mental and physical health🥹",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/w063pv/small_win_went_to_the_dentist_after_avoiding_them/",
  "score": 41,
  "num_comments": 8,
  "comments": [
    {
      "id": "igd4d7j",
      "author": "RuthMaudeJameison",
      "body": "You’re starting to take care of you. That’s wonderful!",
      "created_utc": 1657952331.0,
      "score": 4,
      "context": []
    },
    {
      "id": "igdk927",
      "author": "None",
      "body": "This has been a roadblock for me going to my dentist for the last like 5 years so thank you",
      "created_utc": 1657964565.0,
      "score": 3,
      "context": []
    },
    {
      "id": "igdd7a0",
      "author": "miakodaRainbows",
      "body": "If you ever have a doctor that speaks to you this way, switch doctors. I know as a young person we don't think about this but if they act that way they likely are giving pretty bad care.",
      "created_utc": 1657958862.0,
      "score": 6,
      "context": []
    },
    {
      "id": "igds1xt",
      "author": "None",
      "body": "Yay! That’s amazing. The dentist is a huge fear for me too so I get what a big deal it was to go.",
      "created_utc": 1657970510.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igghq8s",
      "author": "None",
      "body": "As a dental student, this was great to read",
      "created_utc": 1658015815.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ign7vc6",
      "author": "alwaysitchylena",
      "body": "I worked at a dental assistant for a year. Some dentists are assholes and some are great. Just the same as the rest of society. Some dentists I hated working with and others were such lovely people, not judgemental at all.",
      "created_utc": 1658153674.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igdndsk",
      "author": "yourfavepenguinpingu",
      "body": "please do go🥺 the doctor told me about how the damaged tooth got worse since I left it for so long and it really makes me regret not reaching out to someone much earlier",
      "created_utc": 1657967083.0,
      "score": 2,
      "context": [
        {
          "id": "igdk927",
          "author": "None",
          "body": "This has been a roadblock for me going to my dentist for the last like 5 years so thank you",
          "created_utc": 1657964565.0
        }
      ]
    },
    {
      "id": "igdnn2b",
      "author": "yourfavepenguinpingu",
      "body": "this is genuinely what I needed to hear as a kid, thank you for bringing it up",
      "created_utc": 1657967282.0,
      "score": 5,
      "context": [
        {
          "id": "igdd7a0",
          "author": "miakodaRainbows",
          "body": "If you ever have a doctor that speaks to you this way, switch doctors. I know as a young person we don't think about this but if they act that way they likely are giving pretty bad care.",
          "created_utc": 1657958862.0
        }
      ]
    }
  ]
}