{
  "id": "w11rfa",
  "subreddit": "EatingDisorders",
  "author": "Guilty_Battle3073",
  "created_utc": 1658042892.0,
  "title": "\"you look so healthy now!\" comments in recovery",
  "selftext": "i smell a relapse coming. how to deal with these?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/w11rfa/you_look_so_healthy_now_comments_in_recovery/",
  "score": 84,
  "num_comments": 12,
  "comments": [
    {
      "id": "igiycia",
      "author": "Potential-Baby-2285",
      "body": "LMFAOOO☠️Triggered, but no I hate that comment cause what I interpret that is you’re saying I’m DEFINITELY eating an looking plump. I’m still in recovery so sorry for being so raw. But definitely tell your family to not make comments about your weight or how good you’ve been eating, cause some peoples mind automatically goes to you called me fat which is obviously tied to the ED. Also I love the comments above ☝️*",
      "created_utc": 1658071207.0,
      "score": 24,
      "context": []
    },
    {
      "id": "igiapo2",
      "author": "_tooheavytohold_",
      "body": "I explicitly told everyone in my life that it's important to my recovery that no one makes comments on my body, including positive comments.",
      "created_utc": 1658058495.0,
      "score": 47,
      "context": []
    },
    {
      "id": "igiv09u",
      "author": "thriftstoremom",
      "body": "God people are idiots. I’m sorry",
      "created_utc": 1658069672.0,
      "score": 16,
      "context": []
    },
    {
      "id": "igj70xp",
      "author": "Lexylifeinpink",
      "body": "Ugh I’m so sorry I said to someone I was suffering with an eating disorder and they said I don’t look like  I am and I don’t need to lose weight and if I did lose weight it wouldn’t be the end of world 🙃",
      "created_utc": 1658075085.0,
      "score": 14,
      "context": []
    },
    {
      "id": "igjmvv6",
      "author": "waist-land",
      "body": "Set your boundaries. I tell people no comments on my body, and I don’t talk size or numbers. My SO did a couple sessions of family therapy with my therapist and that’s a great way for loved ones to learn and know what’s acceptable to say or comment on. It helped soooo much",
      "created_utc": 1658081948.0,
      "score": 9,
      "context": []
    },
    {
      "id": "igjtsh2",
      "author": "ccwandco",
      "body": "I laugh at anyone who genuinely thinks this comment is better than “you’ve put on weight”. You should never make comments about the body of a person recovering from any type of eating disorder, no matter what it is. It will just make things worse.",
      "created_utc": 1658084916.0,
      "score": 5,
      "context": []
    },
    {
      "id": "igk2w3l",
      "author": "kimjafo",
      "body": "I literally hate when anyone makes any comments, good or bad, on my appearance. It’s like I can feel the relapse in the air 😵‍💫 I’ve only learned to ignore it from certain people that I see a lot. My therapist has been a big help honestly. She’s told me to just explain to people what makes me comfortable/uncomfortable on the subject, just make sure you set boundaries.",
      "created_utc": 1658088831.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iglp0m8",
      "author": "emmabella614",
      "body": "What helps me is if someone wasn’t part of your recovery and doesn’t know better, is to tell myself they don’t know better or sometimes works",
      "created_utc": 1658116796.0,
      "score": 3,
      "context": []
    },
    {
      "id": "igkonan",
      "author": "TransitionNo7389",
      "body": "Personally i tell people not to comment on my body, my weight or what i am eating or have eaten that day. Along with comments that could be triggering like how much they have eaten that day. I am only a few weeks into recovery but this  is hard.",
      "created_utc": 1658098341.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igotdjb",
      "author": "booksB4Bros",
      "body": "I am right there with you - that's a huge trigger for me.  I picture that the person is thinking that I am \"really filling out\". Hang in there.",
      "created_utc": 1658176601.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igihmrq",
      "author": "YourRWaiFuUu",
      "body": "that’s the best way",
      "created_utc": 1658062906.0,
      "score": 15,
      "context": [
        {
          "id": "igiapo2",
          "author": "_tooheavytohold_",
          "body": "I explicitly told everyone in my life that it's important to my recovery that no one makes comments on my body, including positive comments.",
          "created_utc": 1658058495.0
        }
      ]
    }
  ]
}