{
  "id": "w3rsk5",
  "subreddit": "EatingDisorders",
  "author": "Wannabe_mrs_wallen",
  "created_utc": 1658337122.0,
  "title": "So…does anyone know how to stop?",
  "selftext": "How do I stop comparing myself? How do I stop feeling if I don’t workout, I’m stupid/ugly/etc.? How do I stop wanting to be  a stick? Stop craving validation?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/w3rsk5/sodoes_anyone_know_how_to_stop/",
  "score": 60,
  "num_comments": 23,
  "comments": [
    {
      "id": "igygdwj",
      "author": "serenajuul",
      "body": "I never stopped really, but it helped knowing that I had people around me who loved me regardless of these feelings. That’s the voice I had to change more than anything else; the one that told me the whole world *knew* I was horrible and gross and looked at me with disgust. I thought I had to be anorexic (skinny/pretty) for people to like or care about me and that’s the main thing I was trying to control/avoid. Now I’m super pregnant, about to have a baby, and definitely want to starve and workout and lose all the weight I’ve gained, but it’s not as bad. I know my bf loves me, I need to feed my baby (if you restrict too much you lose your milk), and I know I am genuinely loved by my friends and family, something I feel on a deeper level than I ever have in my life.\n\nI think it’s about finding things that make you feel genuine happiness and a sense of importance. For me, that was mending relationships and accepting my value in them, and contributing in a way that made me feel important and fulfilled. Baby was just a happy bonus that happened along the way \n\nOnce you find what brings you those positive feelings, the negative ones and voices are easier to tell “FUCK OFF”",
      "created_utc": 1658345683.0,
      "score": 20,
      "context": []
    },
    {
      "id": "igylmtk",
      "author": "peregilito",
      "body": "My short answer would be: you don’t. You don’t stop worrying, you don’t stop comparing, you don’t stop craving validation. You recognize those feelings, you honor them and you let them pass. You choose to do things differently, healthier. You decide to listen to yourself this time: you need to be nourished, you can be happy.",
      "created_utc": 1658347874.0,
      "score": 17,
      "context": []
    },
    {
      "id": "igz26m1",
      "author": "None",
      "body": "everyone here is saying that it doesn’t stop. and that sounds scary but it’s true. \n\nwe never stop comparing ourselves, it’s human nature to. the difference between sick people and healthy people is based on how much mental space it takes up. you know as someone struggling that these thoughts consume your whole mind and day and feed into our behaviours. but healthy people can recognize it, feel it for a few minutes, then move on.\n\nremember that someone else’s beauty isn’t the absence of your own.",
      "created_utc": 1658355032.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ih0n43y",
      "author": "Dragontales1461",
      "body": "I heard this from somewhere don’t remember where think it was from a drag queen lol but it’s been helping me a lil. Basically you name that negative voice in your head that says your not good enough, give it a name like Kevin idk whatever you want and when you hear it and it’s saying “your ugly” or something just tell him/them to fuck off and stfu. The thing is tho you need another voice, a positive one to counteract the negative one. Just think of people who love you and what they would say about you basically rewire your brain and coach it to have more of a balance. Sounds kinda dumb ik and for me it hasn’t gone away completely tbh sucks but at least for me shits happened through out my life that Ive internalized and I have been programmed to hate myself and compare myself to other people so have to reprogram yk even if I don’t believe what I’m telling myself I hope eventually I will. Idk if that helped but just know you’re not alone, I feel you.",
      "created_utc": 1658383905.0,
      "score": 6,
      "context": []
    },
    {
      "id": "igyzycv",
      "author": "None",
      "body": "Hi! So as others seem to be mentioning, the comparison never really goes away, we as humans naturally look at others to see how we add up, but however I have something to say about the working out. Once I changed my mindset and started working out to be strong not thin everything changed. A lot of my confidence has come from lifting weights and sometimes even working out with friends.",
      "created_utc": 1658354029.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ih0ba2z",
      "author": "treeeeeeeee96",
      "body": "It never stopped, but for me it took to getting to such a low point in my health that I just do not have any mental room left for caring as much about what my body looks like. I just want to be healthy and be able to do the things I used to",
      "created_utc": 1658376436.0,
      "score": 4,
      "context": []
    },
    {
      "id": "igzzbsk",
      "author": "Happygolucky14lev",
      "body": "I used to compare my body to others and get really sad when i wasnt measuring up. I got so jealous and then so mad i even had thoughts wishing bad on the person i was so jealous of. Then i would take unhealthy actions to change my body like excessive exercise or restricting my food which would then end usually in a worse binge. What helps me is working a twelve step program for compulsive eating and codependency. I no longer think the way i used to. I now have the sense of sanity restored to me where i know that i am just right for me as i am. I have my own capabilities and i am not meant to look like another person. Another miracle of the program is i can look in the mirror and smile and think well of myself even when i am not a stick. I feel so much healthier.",
      "created_utc": 1658370397.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ih09pfs",
      "author": "MixAccomplished1391",
      "body": "Maybe Find a famous person you like and has similar body to you mine is Mai Pha\n and stop following/engaging with toxic media content",
      "created_utc": 1658375567.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ih0j2rw",
      "author": "e_mm0505",
      "body": "Honestly it doesn’t stop, which is the sad part about everything. But for me I got so obsessed with counting calories, constantly mirror checking my body and feeling bad. To the point I would basically put a pause on my life that I was supposed to enjoy. Eventually I slowly started to be less observant about everything, I started to enjoy my life more by hanging out with friends more, starting new hobbies and not making my ED my personality or life. This, surprisingly, got me to eat semi-normally. I still eat less but that’s because I destroyed my appetite due to my ED. But I now compare less, I don’t degrade myself and make myself feel bad on purpose. Ofc there are days where I want to relapse but seeing how far I’ve gotten, I never relapse.",
      "created_utc": 1658381154.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ih1pnb7",
      "author": "coachkirsten",
      "body": "Comparison is one of the main culprits of unhappiness. It is rampant now more than ever as it’s one of the hallmarks of social media interactions and then bleeds over into real life. In one recovery food program I was in, we used the expression “compare and despair”. Comparing yourself to another person, their idealized image, your idealized image, yourself at a point in the past will always lead to feeling bad. Even if for a moment you feel better (than the object of comparison). It’s a trap that makes us feel unworthy, steals our power and raids our bank account as we buy things to fix our perceived flaws. \nIt has taken many years, okay 50, and I no longer compare myself with any regularity. Now, if I do feel it pop up, I know that there’s something going on inside of me that needs love and compassion. When I treat myself with kindness, unconditionally, that pattern of comparison (which used to monopolize my life) fades into the background. I did spend the better part of two years re-wiring my brain to get to this place. I was so tired of living that way, I was determined to find a way out. You are not alone💗",
      "created_utc": 1658409772.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ih7lgre",
      "author": "Nice_Cauliflower3648",
      "body": "I still have all those thoughts but what helps me from head diving into harming myself that way (mentally and physically) is finding something that requires me to take care of myself.\n\nMy passion in life is drawing and if I want to create many more artworks, I have to be in a healthy state of mind and body.\n\nSo I acknowledge those negative thoughts and let them pass because what's most important is to be able to do the things I love.\n\nand honestly...we only have one life...a limited amount of time. Re-accessing my priorities, what's worth it or not, really helped me.",
      "created_utc": 1658508892.0,
      "score": 3,
      "context": []
    },
    {
      "id": "igz6tro",
      "author": "rileyyj001",
      "body": "If you find out, let us know 🥲",
      "created_utc": 1658357169.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ih1tajx",
      "author": "NoriAvocado",
      "body": "Validation is not that bad, everyone wants it sometimes yk",
      "created_utc": 1658411363.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ih2pv5l",
      "author": "dummie619",
      "body": "I learned about \"moral neutrality\" from some therapists and that's helped me a lot. \n\nI have a tendency to assign so much moral value to my body, food, exercise, etc. I used to believe that I'm \"good\" if I do the \"good\" things that make me skinny and \"bad\" if I do the bad things that don't. \n\nBody positivity never worked for me. I don't think I'll ever get to a place where I love my body. I'm just trying to shift from \"I hate my body because it's not thin enough which means it's bad\" to \"This is my body. It is neither good nor bad. It is just my body. My body helps me do the things I need to do and I am grateful for that. Its purpose is to house me and help me move through life\". That's what moral neutrality is all about. \n\nIf any of that resonated with you, I'd recommend listening to The Love, Success, and Happiness podcast episode called \"Love your Body\". Despite the title, it introduced me to this concept of moral neutrality and has helped me a lot.",
      "created_utc": 1658423819.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iht248t",
      "author": "Character_Group_6225",
      "body": "My advice is useless, but I would always talk to myself. When I didn't want to eat that greasy burger and I found myself nitpicking it into tiny prices I would smack my arm and tell my body \"No.\" I don't know how to stop wanting to feel like a stick. When my head told me one thing/ the negative voice told me no I would quietly talk to it out loud and debate it I guess in a way lol. That sounds rather odd, but it helped a little bit I guess. I don't know to be honest. I guess to develop a voice that tells me to repeat bad patterns I argue with it. Sorry, I honestly don't know. That's just one thing that I did to help myself.\n\n The only reason I no longer have the eating disorder is because I was triggered by my job and stress so I used bad coping mechanisms over time and I quit before the busy season started again to avoid any triggers. Develop a rational mindset you know like the 2 angels on your shoulders and when you get the \"devil\" angel (so to say), debate it and practice your argument skills I guess haha...\nThen be stubborn about it and when you are stubborn about ignoring that bad voice that tells you to do something you reward yourself with something (you can start a collection of something and get creative) idk...\nJust an idea lol \nI'm not a psychologist.\nWhen you reward yourself like that you also boost chemicals in your brain so it may help. I'm not exactly certain cause everyone is different. Have an awesome day!",
      "created_utc": 1658892556.0,
      "score": 1,
      "context": []
    },
    {
      "id": "igziz2b",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1658362914.0,
      "score": 3,
      "context": [
        {
          "id": "igz26m1",
          "author": "None",
          "body": "everyone here is saying that it doesn’t stop. and that sounds scary but it’s true. \n\nwe never stop comparing ourselves, it’s human nature to. the difference between sick people and healthy people is based on how much mental space it takes up. you know as someone struggling that these thoughts consume your whole mind and day and feed into our behaviours. but healthy people can recognize it, feel it for a few minutes, then move on.\n\nremember that someone else’s beauty isn’t the absence of your own.",
          "created_utc": 1658355032.0
        }
      ]
    },
    {
      "id": "ih2q7tt",
      "author": "Wannabe_mrs_wallen",
      "body": "I’ll try it out, thanks! 😁",
      "created_utc": 1658423950.0,
      "score": 2,
      "context": [
        {
          "id": "ih0n43y",
          "author": "Dragontales1461",
          "body": "I heard this from somewhere don’t remember where think it was from a drag queen lol but it’s been helping me a lil. Basically you name that negative voice in your head that says your not good enough, give it a name like Kevin idk whatever you want and when you hear it and it’s saying “your ugly” or something just tell him/them to fuck off and stfu. The thing is tho you need another voice, a positive one to counteract the negative one. Just think of people who love you and what they would say about you basically rewire your brain and coach it to have more of a balance. Sounds kinda dumb ik and for me it hasn’t gone away completely tbh sucks but at least for me shits happened through out my life that Ive internalized and I have been programmed to hate myself and compare myself to other people so have to reprogram yk even if I don’t believe what I’m telling myself I hope eventually I will. Idk if that helped but just know you’re not alone, I feel you.",
          "created_utc": 1658383905.0
        }
      ]
    },
    {
      "id": "igz02z3",
      "author": "Wannabe_mrs_wallen",
      "body": "Thank you so much!! 🥹",
      "created_utc": 1658354086.0,
      "score": 1,
      "context": [
        {
          "id": "igyzycv",
          "author": "None",
          "body": "Hi! So as others seem to be mentioning, the comparison never really goes away, we as humans naturally look at others to see how we add up, but however I have something to say about the working out. Once I changed my mindset and started working out to be strong not thin everything changed. A lot of my confidence has come from lifting weights and sometimes even working out with friends.",
          "created_utc": 1658354029.0
        }
      ]
    },
    {
      "id": "ih2q66u",
      "author": "Wannabe_mrs_wallen",
      "body": "Thank you for the kind words! 🥹",
      "created_utc": 1658423933.0,
      "score": 1,
      "context": [
        {
          "id": "ih1pnb7",
          "author": "coachkirsten",
          "body": "Comparison is one of the main culprits of unhappiness. It is rampant now more than ever as it’s one of the hallmarks of social media interactions and then bleeds over into real life. In one recovery food program I was in, we used the expression “compare and despair”. Comparing yourself to another person, their idealized image, your idealized image, yourself at a point in the past will always lead to feeling bad. Even if for a moment you feel better (than the object of comparison). It’s a trap that makes us feel unworthy, steals our power and raids our bank account as we buy things to fix our perceived flaws. \nIt has taken many years, okay 50, and I no longer compare myself with any regularity. Now, if I do feel it pop up, I know that there’s something going on inside of me that needs love and compassion. When I treat myself with kindness, unconditionally, that pattern of comparison (which used to monopolize my life) fades into the background. I did spend the better part of two years re-wiring my brain to get to this place. I was so tired of living that way, I was determined to find a way out. You are not alone💗",
          "created_utc": 1658409772.0
        }
      ]
    },
    {
      "id": "igzc03p",
      "author": "Wannabe_mrs_wallen",
      "body": "Aww it’s okay. We can get through it, at some point 😂",
      "created_utc": 1658359621.0,
      "score": 1,
      "context": [
        {
          "id": "igz6tro",
          "author": "rileyyj001",
          "body": "If you find out, let us know 🥲",
          "created_utc": 1658357169.0
        }
      ]
    },
    {
      "id": "ih2q2yc",
      "author": "Wannabe_mrs_wallen",
      "body": "I’ll look into it, thanks!",
      "created_utc": 1658423900.0,
      "score": 1,
      "context": [
        {
          "id": "ih2pv5l",
          "author": "dummie619",
          "body": "I learned about \"moral neutrality\" from some therapists and that's helped me a lot. \n\nI have a tendency to assign so much moral value to my body, food, exercise, etc. I used to believe that I'm \"good\" if I do the \"good\" things that make me skinny and \"bad\" if I do the bad things that don't. \n\nBody positivity never worked for me. I don't think I'll ever get to a place where I love my body. I'm just trying to shift from \"I hate my body because it's not thin enough which means it's bad\" to \"This is my body. It is neither good nor bad. It is just my body. My body helps me do the things I need to do and I am grateful for that. Its purpose is to house me and help me move through life\". That's what moral neutrality is all about. \n\nIf any of that resonated with you, I'd recommend listening to The Love, Success, and Happiness podcast episode called \"Love your Body\". Despite the title, it introduced me to this concept of moral neutrality and has helped me a lot.",
          "created_utc": 1658423819.0
        }
      ]
    },
    {
      "id": "igzm08i",
      "author": "None",
      "body": "you as well!",
      "created_utc": 1658364329.0,
      "score": 2,
      "context": [
        {
          "id": "igz26m1",
          "author": "None",
          "body": "everyone here is saying that it doesn’t stop. and that sounds scary but it’s true. \n\nwe never stop comparing ourselves, it’s human nature to. the difference between sick people and healthy people is based on how much mental space it takes up. you know as someone struggling that these thoughts consume your whole mind and day and feed into our behaviours. but healthy people can recognize it, feel it for a few minutes, then move on.\n\nremember that someone else’s beauty isn’t the absence of your own.",
          "created_utc": 1658355032.0
        },
        {
          "id": "igziz2b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1658362914.0
        }
      ]
    },
    {
      "id": "igz05pa",
      "author": "None",
      "body": "Of course! Best of luck to you",
      "created_utc": 1658354119.0,
      "score": 2,
      "context": [
        {
          "id": "igyzycv",
          "author": "None",
          "body": "Hi! So as others seem to be mentioning, the comparison never really goes away, we as humans naturally look at others to see how we add up, but however I have something to say about the working out. Once I changed my mindset and started working out to be strong not thin everything changed. A lot of my confidence has come from lifting weights and sometimes even working out with friends.",
          "created_utc": 1658354029.0
        },
        {
          "id": "igz02z3",
          "author": "Wannabe_mrs_wallen",
          "body": "Thank you so much!! 🥹",
          "created_utc": 1658354086.0
        }
      ]
    }
  ]
}