{
  "id": "wiu5s7",
  "subreddit": "EatingDisorders",
  "author": "oopsihavebpd",
  "created_utc": 1659917196.0,
  "title": "What helps me eat",
  "selftext": "Surprisingly, seeing other people eat makes me want to eat.\nSo as a part of my recovery, I watch mukbangs on the regular. It's pretty cool I guess.\nI feel like it's an encouragement to eat. Idk.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/wiu5s7/what_helps_me_eat/",
  "score": 50,
  "num_comments": 9,
  "comments": [
    {
      "id": "ijebzp5",
      "author": "None",
      "body": "I was just wondering about why I do this and I think it might have to do with eating alone or having company but idk.",
      "created_utc": 1659929637.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ijfh26f",
      "author": "AnaDion94",
      "body": "Same, I think. Covid quarantine made it hard to eat. Then I starting eating dinner “with” my partner by sharing pics of our plates then eating at the same time, then I’d watch food documentaries. It’s hard to demonize eating when watching something celebrating food.",
      "created_utc": 1659958995.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ijfvqci",
      "author": "EscapeAffectionate72",
      "body": "eating w my mom or brother will always help me, just talking to them and eating casually helps me forgot about it",
      "created_utc": 1659966456.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ijhb3o2",
      "author": "emmabella614",
      "body": "The fact that I need to eat to have a chance at a full happy life",
      "created_utc": 1659986410.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ik3yit7",
      "author": "iieevaa",
      "body": "My doctors recommend me to during amino acids protein shakes as an extra supplements too so it helps a lot to gain extra calories to maintain needed vitamins for body",
      "created_utc": 1660383132.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ijgcmm9",
      "author": "Dutchie_Mike",
      "body": "It’s actually your brain telling you, that your body is in starvation mode.  It’s part of the neuroscience and brain chemistry alterations when deep in an eating disorder.  Your brain is trying to make you eat.  It has a lot to do with the frontal cortex and amount of decreased grey matter, also affecting your lepton, gherlin.   I have been in anorexia treatment and this is very common within that community,  it’s also a habit you need to break, thinking about food all day.",
      "created_utc": 1659973366.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ijgw46s",
      "author": "wormyunki",
      "body": "I always watch mukbangs with food I know I love cause it makes me want to eat",
      "created_utc": 1659980752.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ijhpd8r",
      "author": "AsterismRaptor",
      "body": "These help me eat too! Especially if I’m watching someone eat what I’m craving, I also find eating out with friends helps me eat as well :)",
      "created_utc": 1659992070.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iji03pe",
      "author": "emmabella614",
      "body": "If I don’t I’m a mess and everything revolves around it",
      "created_utc": 1659996346.0,
      "score": 1,
      "context": [
        {
          "id": "ijhb3o2",
          "author": "emmabella614",
          "body": "The fact that I need to eat to have a chance at a full happy life",
          "created_utc": 1659986410.0
        }
      ]
    }
  ]
}