{
  "id": "wr72ey",
  "subreddit": "EatingDisorders",
  "author": "Primary_Revenue_1412",
  "created_utc": 1660788556.0,
  "title": "Skinny girl eating disorder",
  "selftext": "I’m 20 y/o and extremely skinny to the point where nothing fits me. I’ve noticed I’ve not been able to eat full meals. Ex. I will order a rice bowl from chipotle, have 2 bites and convince myself I’m full and feel nauseous and gag if I force myself anymore. I’m always hungry bc of how little I eat but I cannot get myself to eat. My question is, do I have some type of eating disorder or is it just the fact that I eat too little so my stomach has adjusted to that amount.\n\nEdit- Thank you to everyone that left me a response and wished me a great recovery❤️. After reading all the comments I figured the issue is untreated anxiety (which i never would have thought of). I’m definitely going to look into getting professional help and once again I’m so grateful for everyone that made an effort to help me figure this out.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/wr72ey/skinny_girl_eating_disorder/",
  "score": 62,
  "num_comments": 21,
  "comments": [
    {
      "id": "ikr3bxs",
      "author": "tomatopotatotomato",
      "body": "I had this and finally figured out it was untreated anxiety, not an eating disorder. Food tasted like nothing to me (almost like sand?) and made me sick. Meanwhile my mind was running wild with anxious thoughts. I found myself weak, shaky, and hungry but unable to eat. As soon as I got into therapy and took some anti anxiety supplements I got my appetite back. I’m better now and now a red flag for me to be more aware of my mental health is that condition returning. Definitely get professional help and know you can make a full recovery and will feel much better. Good luck ❤️ you may also want to get a blood test to see if you have any deficiencies in minerals or nutrients such as potassium, vitamin d, b vitamins, magnesium, etc.",
      "created_utc": 1660794600.0,
      "score": 53,
      "context": []
    },
    {
      "id": "ikqumoa",
      "author": "now_you_own_me",
      "body": "You have to consider seeing a doctor, we can't really confirm what it is or if there's some other health issues going on that could be making it hard to eat. It sounds like you might, but we can't know for sure.",
      "created_utc": 1660790294.0,
      "score": 32,
      "context": []
    },
    {
      "id": "ikr7gqj",
      "author": "Large_Salt_3021",
      "body": "I don’t know how long this has been going on for you. But I get the same way when I’m stressed out or when I’m in a low from my bipolar",
      "created_utc": 1660796918.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ikqtfr1",
      "author": "fckinfinn",
      "body": "u should look into arfid, it sounds like u might have that. hope this helps!",
      "created_utc": 1660789741.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ikrtvuj",
      "author": "NatalieALx",
      "body": "this is a difficult one - anorexia for example is characterised by deliberate weight loss, over exercising, purging, sometimes the use of laxatives and stimulants, extreme fears of gaining weight, having a very distorted body image etc which from your post i’m not picking up on but maybe you do feel those things? someone mentioned ARFID above but i have no experience of ARFID myself to comment. and of course there are many forms of eating disorders or disordered eating that don’t fall into those categories. \n\ni would definitely see a doctor to check to see if there’s anything physical that’s causing the symptoms of fullness or nausea, it might also be worth checking in with a therapist to discuss your relationship with food and if there’s anything you can unpack there.",
      "created_utc": 1660813481.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ikrbi9h",
      "author": "CbackNstomach",
      "body": "I'm not a doctor but that sounds like gastroparesis. Your stomach doesn't move the food. It just sits there and you're always hungry but can't eat anymore.",
      "created_utc": 1660799442.0,
      "score": 6,
      "context": []
    },
    {
      "id": "iksy8ba",
      "author": "lavender_dreams1",
      "body": "This made me step back for a second because it’s exactly the same situation as my sister. She’s also 20, extremely thin and a very fussy eater that gets full after a few bites. \n\nShe’s currently on a waiting list for a dietician. I don’t know where you’re from but she’s from the UK. She hasn’t been diagnosed with anything yet, but we think it’s some kind of eating disorder. It may be EDNOS, as she doesn’t really fit into the category for anorexia or bulimia. It’s really heartbreaking to see her becoming so incredibly thin and frail. She fainted the other day and her hair is falling out. \n\nIt’s difficult for everyone involved, and whether it’s an ED or just a poor diet, I really hope you can get better soon ❤️",
      "created_utc": 1660835013.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ikuf2fi",
      "author": "mrwilliamschue",
      "body": "Do you take any medicine? I have medicine that has made me feel this way. I’ve also had an eating disorder and that could also potentially be it. Also gonna second everyone saying that it could be due to anxiety. Either way, talk to your doctor ab it",
      "created_utc": 1660855502.0,
      "score": 2,
      "context": []
    },
    {
      "id": "il4wfue",
      "author": "kfairy555",
      "body": "this is exactly how i’ve been feeling, and the smaller i get the more sad it is for me i’ve always had a very weird relationship with food and everybody trying to get me to eat more to gain weight and it’s like im trying im trying so hard but ill get two bites in like you said and im scared to take the third bc idk if it’s going to stay down. i came to visit my dads family and they’re all saying things like “why don’t you eat more?” “what are you bulimic?” “you’re about to disappear” “it makes me sad to see you like this” but i’ve never had much weight on me as is and like they’ve been watching me eat and it’s so bad bc i HAVE to force myself to eat so they can see me eat so i do t have to hear about how skinny i am pls i need help why can’t i eat im so hungry why is all food making me nauseous. i literally got nauseous looking at a burger king commercial. what is wrong with me",
      "created_utc": 1661043168.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ikqtb6p",
      "author": "None",
      "body": "I'm not an expert so don't rely on what I say but it sounds like you have an eating disorder. You should go to the doctor if you want a experts answer but it really sounds like you have one",
      "created_utc": 1660789682.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ikt4n9o",
      "author": "None",
      "body": "I've never struggled with an ED but at the height of my anxiety disorder I physically couldn't eat. I could WANT to eat, I could be hungry, but eating was physically difficult.\n\nI know other friends who had similar problems at times due to physical health problems. If this has been ongoing it's definitely something to get checked out.\n\nHave you tried focusing on easy to digest foods? Soup, crackers, digestive biscuits, toast, fruit... The sorts of things people eat when they are sick. It may be worth a shot if you're feeling hunger but struggling to eat. \n\nProtein drinks or smoothies are also great options to get your energy up.",
      "created_utc": 1660837601.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iktgp2d",
      "author": "zillabirdblue",
      "body": "Possibly, or it could be a medical conditions. Please go to a doctor! If you keep starving you will get very ill or die. Your body is most likely eating your muscles for the protein it needs to live and your heart is a muscle.",
      "created_utc": 1660842308.0,
      "score": 1,
      "context": []
    },
    {
      "id": "im6b57c",
      "author": "None",
      "body": "I am actually the same way. Even though I know I am hungry I feel like I am not after eating a few small bites from always not eating!! It is a bad thing everyone gets from a restrictive eating disorder. I just want you to know that you are not alone.",
      "created_utc": 1661720302.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iksah43",
      "author": "oof033",
      "body": "I have had an ED and the above^^ and very different, both terrible. Anxiety would make me throw up half the meals I ate, would struggle to get anything down, but I WANTED to eat. I saw a doctor and worked on anxiety management (specifically with the food issue), and it’s much easier and more enjoyable eating now. Op if it’s not intentional and your body is struggling to process ur food, consider this!! Hope you figure it out",
      "created_utc": 1660824621.0,
      "score": 7,
      "context": [
        {
          "id": "ikr3bxs",
          "author": "tomatopotatotomato",
          "body": "I had this and finally figured out it was untreated anxiety, not an eating disorder. Food tasted like nothing to me (almost like sand?) and made me sick. Meanwhile my mind was running wild with anxious thoughts. I found myself weak, shaky, and hungry but unable to eat. As soon as I got into therapy and took some anti anxiety supplements I got my appetite back. I’m better now and now a red flag for me to be more aware of my mental health is that condition returning. Definitely get professional help and know you can make a full recovery and will feel much better. Good luck ❤️ you may also want to get a blood test to see if you have any deficiencies in minerals or nutrients such as potassium, vitamin d, b vitamins, magnesium, etc.",
          "created_utc": 1660794600.0
        }
      ]
    },
    {
      "id": "iksdjpm",
      "author": "tomatopotatotomato",
      "body": "Yes I should have also said that I have had an ED before but that during those episodes it wasn’t my ED coming back but anxiety. I think that’s what made it confusing was that I wanted to eat. \n\nI just had a baby and a traumatic complication during birth. The first four days home I was so anxious about my health I couldn’t eat and it brought me right back to that time. As soon as I realized I couldn’t eat I realized my fears were only anxiety I needed to deal with.",
      "created_utc": 1660826204.0,
      "score": 2,
      "context": [
        {
          "id": "ikr3bxs",
          "author": "tomatopotatotomato",
          "body": "I had this and finally figured out it was untreated anxiety, not an eating disorder. Food tasted like nothing to me (almost like sand?) and made me sick. Meanwhile my mind was running wild with anxious thoughts. I found myself weak, shaky, and hungry but unable to eat. As soon as I got into therapy and took some anti anxiety supplements I got my appetite back. I’m better now and now a red flag for me to be more aware of my mental health is that condition returning. Definitely get professional help and know you can make a full recovery and will feel much better. Good luck ❤️ you may also want to get a blood test to see if you have any deficiencies in minerals or nutrients such as potassium, vitamin d, b vitamins, magnesium, etc.",
          "created_utc": 1660794600.0
        }
      ]
    },
    {
      "id": "ikt8iae",
      "author": "None",
      "body": "I’ve experienced this too and it definitely stemmed from severe anxiety just making it physically uncomfortable to eat. Unfortunately being perpetually hungry will continue to fuel your anxiety and it’s a cycle. A mental health issue that impacts your ability to eat normally is by definition disordered eating so it sounds like that may be going on for you. What helped me get out of this loop was identifying some foods that were very easy to eat and not feel too full. Shakes and smoothies worked well for me. You have to slowly practice eating more than feels comfortable and little by little your stomach will get used to the amount of food and be able to eat proper meals. It takes time, go slow and be patient and probably see someone about anxiety",
      "created_utc": 1660839127.0,
      "score": 2,
      "context": [
        {
          "id": "ikr3bxs",
          "author": "tomatopotatotomato",
          "body": "I had this and finally figured out it was untreated anxiety, not an eating disorder. Food tasted like nothing to me (almost like sand?) and made me sick. Meanwhile my mind was running wild with anxious thoughts. I found myself weak, shaky, and hungry but unable to eat. As soon as I got into therapy and took some anti anxiety supplements I got my appetite back. I’m better now and now a red flag for me to be more aware of my mental health is that condition returning. Definitely get professional help and know you can make a full recovery and will feel much better. Good luck ❤️ you may also want to get a blood test to see if you have any deficiencies in minerals or nutrients such as potassium, vitamin d, b vitamins, magnesium, etc.",
          "created_utc": 1660794600.0
        }
      ]
    },
    {
      "id": "ikqw16r",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1660790954.0,
      "score": -5,
      "context": [
        {
          "id": "ikqtfr1",
          "author": "fckinfinn",
          "body": "u should look into arfid, it sounds like u might have that. hope this helps!",
          "created_utc": 1660789741.0
        }
      ]
    },
    {
      "id": "il51k95",
      "author": "Primary_Revenue_1412",
      "body": "OMG I’m so relieved to know I’m not alone. I’ve also always been really skinny, even when I didn’t have a bad relationship with food so when people told me I was skinny I took it as a compliment. Now that I have developed a bad relationship with food it’s so draining when family is constantly concerned and making comments about my weight and my eating habits when I’m really trying. After reading all the comments I’ve realized it could actually be anxiety. I had a huge fall out with my best friends from high school 2 years ago and a few months after that, I started struggling with food and it only got worse. I wasn’t completely sad or depressed so I didn’t realize that situation effected my relationship with food. I few days ago we finally came together, went out for dinner and discussed our fall out and updated each other about our lives. I had never felt so relieved and happy in such a long time and surprisingly I was able to finish my dinner that night. I hope this helps, just know you’re not alone bc I know how frustrating this is. Prayers for your recovery ❤️",
      "created_utc": 1661045673.0,
      "score": 2,
      "context": [
        {
          "id": "il4wfue",
          "author": "kfairy555",
          "body": "this is exactly how i’ve been feeling, and the smaller i get the more sad it is for me i’ve always had a very weird relationship with food and everybody trying to get me to eat more to gain weight and it’s like im trying im trying so hard but ill get two bites in like you said and im scared to take the third bc idk if it’s going to stay down. i came to visit my dads family and they’re all saying things like “why don’t you eat more?” “what are you bulimic?” “you’re about to disappear” “it makes me sad to see you like this” but i’ve never had much weight on me as is and like they’ve been watching me eat and it’s so bad bc i HAVE to force myself to eat so they can see me eat so i do t have to hear about how skinny i am pls i need help why can’t i eat im so hungry why is all food making me nauseous. i literally got nauseous looking at a burger king commercial. what is wrong with me",
          "created_utc": 1661043168.0
        }
      ]
    },
    {
      "id": "ikqwhma",
      "author": "fckinfinn",
      "body": "there are many different types of arfid... i would know bc i have it",
      "created_utc": 1660791171.0,
      "score": 10,
      "context": [
        {
          "id": "ikqtfr1",
          "author": "fckinfinn",
          "body": "u should look into arfid, it sounds like u might have that. hope this helps!",
          "created_utc": 1660789741.0
        },
        {
          "id": "ikqw16r",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1660790954.0
        }
      ]
    },
    {
      "id": "il53vhv",
      "author": "kfairy555",
      "body": "thank you so much, honestly it definitely could be anxiety based bc i feel like it’s always hardest to eat when i’m thinking (i’m very bad overthinker) or emotional and it just causes me more anxiety and even just sadness that i’m hungry and can’t eat, i’ll cook a beautiful meal and be so excited to eat it (bc i literally love cooking, which makes this all the more frustrating) and not be able to eat it. thinking of going to see a therapist as well as a nutritionalist. i never even knew anxiety could affect my eating habits so thank you for bringing that to my attention. i hope all gets better for you as well<3",
      "created_utc": 1661046803.0,
      "score": 2,
      "context": [
        {
          "id": "il4wfue",
          "author": "kfairy555",
          "body": "this is exactly how i’ve been feeling, and the smaller i get the more sad it is for me i’ve always had a very weird relationship with food and everybody trying to get me to eat more to gain weight and it’s like im trying im trying so hard but ill get two bites in like you said and im scared to take the third bc idk if it’s going to stay down. i came to visit my dads family and they’re all saying things like “why don’t you eat more?” “what are you bulimic?” “you’re about to disappear” “it makes me sad to see you like this” but i’ve never had much weight on me as is and like they’ve been watching me eat and it’s so bad bc i HAVE to force myself to eat so they can see me eat so i do t have to hear about how skinny i am pls i need help why can’t i eat im so hungry why is all food making me nauseous. i literally got nauseous looking at a burger king commercial. what is wrong with me",
          "created_utc": 1661043168.0
        },
        {
          "id": "il51k95",
          "author": "Primary_Revenue_1412",
          "body": "OMG I’m so relieved to know I’m not alone. I’ve also always been really skinny, even when I didn’t have a bad relationship with food so when people told me I was skinny I took it as a compliment. Now that I have developed a bad relationship with food it’s so draining when family is constantly concerned and making comments about my weight and my eating habits when I’m really trying. After reading all the comments I’ve realized it could actually be anxiety. I had a huge fall out with my best friends from high school 2 years ago and a few months after that, I started struggling with food and it only got worse. I wasn’t completely sad or depressed so I didn’t realize that situation effected my relationship with food. I few days ago we finally came together, went out for dinner and discussed our fall out and updated each other about our lives. I had never felt so relieved and happy in such a long time and surprisingly I was able to finish my dinner that night. I hope this helps, just know you’re not alone bc I know how frustrating this is. Prayers for your recovery ❤️",
          "created_utc": 1661045673.0
        }
      ]
    },
    {
      "id": "ikqxlzu",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1660791708.0,
      "score": -4,
      "context": [
        {
          "id": "ikqtfr1",
          "author": "fckinfinn",
          "body": "u should look into arfid, it sounds like u might have that. hope this helps!",
          "created_utc": 1660789741.0
        },
        {
          "id": "ikqw16r",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1660790954.0
        },
        {
          "id": "ikqwhma",
          "author": "fckinfinn",
          "body": "there are many different types of arfid... i would know bc i have it",
          "created_utc": 1660791171.0
        }
      ]
    },
    {
      "id": "ikrcyh0",
      "author": "Pandatoke",
      "body": "There are 5 types according to google…",
      "created_utc": 1660800403.0,
      "score": 6,
      "context": [
        {
          "id": "ikqtfr1",
          "author": "fckinfinn",
          "body": "u should look into arfid, it sounds like u might have that. hope this helps!",
          "created_utc": 1660789741.0
        },
        {
          "id": "ikqw16r",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1660790954.0
        },
        {
          "id": "ikqwhma",
          "author": "fckinfinn",
          "body": "there are many different types of arfid... i would know bc i have it",
          "created_utc": 1660791171.0
        },
        {
          "id": "ikqxlzu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1660791708.0
        }
      ]
    }
  ]
}