{
  "id": "wxlh20",
  "subreddit": "EatingDisorders",
  "author": "pleasetalktomechris",
  "created_utc": 1661451665.0,
  "title": "What do you do when it's getting bad again?",
  "selftext": "I've struggled with disordered eating behaviour for a decade, but don't fall into the category of a diagnosis.\nI suffer of rejection sensitive dysphoria and it's been triggered on a big way. I'm so depressed and struggling to feed myself. My head hurts and I feel weak. I want to feel better but at the same time I don't. It's complicated when you're a bigger girl and soany people do want you to starve.\nThis is just stream of consciousness idk if anyone can help, I just feel too weak to cook or do anything.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/wxlh20/what_do_you_do_when_its_getting_bad_again/",
  "score": 72,
  "num_comments": 10,
  "comments": [
    {
      "id": "ilrzq30",
      "author": "HurlInteruppted",
      "body": "aww when it's getting bad again, I try to buy a lot of things I can put into the refrigerator and open.   \n\nYogurts with frozen berries, frozen rice and add sliced fresh pepper & frozen edamame.\n\nLet us know what food you like, maybe we can help?\n\nOtherwise, I try to talk with the one sole-support person I know won't judge me.   And, maybe I won't bring up food issues, but just the connection sometimes helps.\n\nKeep reaching out, you deserve to feel better, I truly understand the feeling of not thinking I don't, but truly, we all do.\n\nYou don't need to cook -- rn I'm doing frozen stuff and additionally trying fresh fruits to stimulate my appetite.",
      "created_utc": 1661457369.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ilrxbco",
      "author": "None",
      "body": "You poor thing, I'm really sorry you're hurting like this - taking care of yourself when you're depressed is hard enough and an ED on top of that is torture. Some things I do when I'm in this exact situation: \n\n1. bagged salads, canned beans, canned soups. they're cheap and easy to make when I just don't have the energy.\n2. water flavoring - I use Jordan's Skinny Syrups to make sure i stay hydrated.\n3. psychedelics - they are wonderful tools for healing: depression, anxiety, trauma, self-image and self-love. you don't have to go nuts or anything, but get ahold of some mushrooms and give it a shot. i've done so much healing thanks to those little guys.\n\ngood luck <3",
      "created_utc": 1661456435.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ils74n1",
      "author": "Cahya_Dechen",
      "body": "Hey,\nMy appetite really gets affected when I have periods of low mood.\n\nI agree with the tips on having easy foods around that don’t require any/much prep.\n\nI allow myself to eat less, but watch my obsessive thoughts. ED or not, we all go through periods of eating more or less, and so - for me - the important thing is to not let it snowball. So I keep an eye on it and if I didn’t eat much yesterday, today I make sure I eat more.\n\nSo, for me it’s about not taking advantage of the lack of appetite if that makes sense? I show my body care by making sure it does get fed and that way my mood doesn’t get worse. I don’t know about you, but the less I eat, the lower my mood gets, my sleep quality decreases, I’m irritable, tired, etc.\n\nTake care, it’s rough going through this 🌻",
      "created_utc": 1661460242.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ilsuqrr",
      "author": "Anonymoususer87",
      "body": "I started skipping meals about a year and a half ago. I went back to eating and stopped working out last August and gained 15 lbs. I went back to skipping meals in March and it’s been on and off since then. It’s definitely “gotten bad” for me again too. I eat salads, fruit, meat, and some junk food. I also work out for at least an hour most days. I’m trying to go back to eating 3 meals a day again but it’s been hard. Keep going we’ve got this:)",
      "created_utc": 1661470068.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iltp6qq",
      "author": "gongwhat",
      "body": "i suck it up bc that the only way i know how to.  so i just let myself get bad bc resisting makes me tired and i have long given up",
      "created_utc": 1661484194.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ilu2zn3",
      "author": "ImLINGLINGyay",
      "body": "Hi there, I too had disordered eating and suffered from rsd, so I totally get how hard it can be. It's normal to not want to get better, allow yourself to feel what you feel for a while, and you can move on after that. Maybe you can get yourself comfort food, preferringly easy to prep ones, and at least eat some every day, because you deserve to eat and care for yourself, no matter what those hateful people say. \n\nOn the other hand, speaking from experience, leaving those who always triggered my rsd made my daily life a lot better, even though it can feel hard to leave them, it's still a good choice and I never regretted it. Surround yourself with those who love you.\n\nAlso get some nice sleep, rest well, do things that make you feel good. Being big means...just big. It shouldn't be a negative thing when you are borned this way. It's just who you are. I'm sorry you're being treated this way, you deserve better.",
      "created_utc": 1661492385.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ilvjjm2",
      "author": "yardkale",
      "body": "i'm so sorry you're struggling like this right now. it's hard enough to feed ourselves, especially in a consistent and healthy way—when something triggers us and it conjures up a lot of deep rooted thoughts and beliefs (especially those perpetuated by societal \"norms\"/diet culture), it makes sense that it would be even harder to tend to ourselves. i know the feedback loop and the struggle of wanting two very contradictory things (recovery and thinness) can feel so daunting, exhausting, and frustrating to cope with.\n\ni'll say some things that maybe you already know: you deserve to be fed. you deserve to treat yourself with gentle compassion and patience. you deserve to be here, and you deserve to take up space. how can you show up for yourself with compassion right now, if even in the smallest of ways?\n\nit's okay to eat easy-to-prepare microwavable meals, or to snack on things throughout the day. i think others have made some neat suggestions regarding content! or, do you have a favorite restaurant to order out at—could you order delivery? something my therapist has suggested for me, during times where i've admitted i'm struggling to eat, is to ask my partner to prepare a meal for me or with me sometime (since i also really struggle to cook). it's a delicate balance, as i don't want to depend on someone else to feed me—but maybe you could reach out to a loved one and ask if they'd want to prepare a meal with you, or get food out with you.\n\ni know it's so hard, and you don't have to feel like you need to make all of the progress now. the most important thing right now, i think, is to tend to yourself in the way your body and your mind need. sending you love, healing, and support as you navigate such a difficult position.",
      "created_utc": 1661525080.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iltn9x4",
      "author": "Peepeehands01",
      "body": "The best thing for me when it gets bad again, is talking to my friends and family. I can tell people all I want about my eating disorder but I’m the only one who can change my opinion of it.",
      "created_utc": 1661483224.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ilv9i26",
      "author": "atf255",
      "body": "Hey! I‘ve struggled with disordered eating and I think it is truly best not to restrict some of the healthiest foods out there, such as fruits, vegetables and beans! You really do not need to restrict these foods, and they’re both nutritious and healthy. I basically never cook, and a quick no-effort meal is usually just some carrot sticks, fruit and canned beans! \nHope this might help!",
      "created_utc": 1661520936.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ilvg2dn",
      "author": "emmabella614",
      "body": "Eat at least 3 meals, find something tolerable but try to make it a meal, and a reasonable quantity, go to a support group online helps, it sucks doing it but it works for me, \nAlso just having that goal for myself I can do whatever non Ed thing I want and zapping/redirecting Ed thoughts\n\nIt’s hard but it works",
      "created_utc": 1661523692.0,
      "score": 1,
      "context": []
    }
  ]
}