{
  "id": "xezxan",
  "subreddit": "EatingDisorders",
  "author": "0ntheb0rderline",
  "created_utc": 1663256257.0,
  "title": "I DONT KNOW HOW TO EAT ANYMORE! HOW DOES A PERSON EAT????",
  "selftext": "Title says it all, I don't know how to eat. What am I supposed to do? Am I supposed to count my calories and macros, am I supposed to eat intuitively and eat whatever I want, am I supposed to do a meal plan or eat clean or do fasting or WHAT!?!?!?!? HOW DO PEOPLE EAT WITHOUT FUCKING UP ALL THE TIME AND HATING THEMSELVES I DONT GET IT!!!!! I've had eating disorders for 6 fucking years now and I haven't been able to eat normally since I was 14. I don't know what to do. I've tried all of the above and I keep on falling down the ED slide over and over. Tell me I'm not the only person who SERIOULSLY DOES NOT KNOW HOW TO EAT FOOD! I'm a grown adult, I have a job and a car but I don't know how to eat without having my guts and wanting to throw myself off a bridge. FUCK! My life is consumed by this thing. Its like a poisonous gas that leeks into every room of my house and toxifies every surface. It follows me wherever I go and I cannot enjoy my life one bit with it hanging around in the air. God damn I need some help. Someone please reach out.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/xezxan/i_dont_know_how_to_eat_anymore_how_does_a_person/",
  "score": 74,
  "num_comments": 21,
  "comments": [
    {
      "id": "iokq7qe",
      "author": "unclegoddess",
      "body": "you are allowed to feed yourself you dont have to feel guilty there are no rules you are beautiful and deserve to be nourished — there are no good or bad foods its all just food and it all gives us energy to keep goin, theres no such thing as fuckin up cuz there are no rules— good luck out there 💕",
      "created_utc": 1663272677.0,
      "score": 20,
      "context": []
    },
    {
      "id": "iol23zk",
      "author": "lifeisthebeautiful",
      "body": "You need help navigating this. Can you see your doctor to get a referral to someone? I wish I had more advice to offer I just think you need to seek out some services if any are available. Hang in there. You are not alone.",
      "created_utc": 1663277440.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iolaim7",
      "author": "redbradbury",
      "body": "I think eating disorders are the hardest of all substance issues (for lack of a better word) because we all have to eat. For someone who struggles with ED, the best plan is probably to just have a good plan. Otherwise, it’s a roller coaster. I agree with others- work with a licensed nutritionist who has experience with ED to help you come up with a plan that will act as guideposts for you. If nothing else, having an accountability partner is huge.",
      "created_utc": 1663280998.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iol7n3l",
      "author": "ohnoitsaslothcano",
      "body": "You are not alone. If it’s possible, I would suggest finding a therapist who works with eating disorders and having them suggest a dietician who has experience working with eating disorders to help guide you in creating a plan that will work for you.",
      "created_utc": 1663279753.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iolxhqh",
      "author": "moonie52",
      "body": "As much as it may sound pessimistic —but trust me, i can relate to this too well — it’s not entirely wrong to state that once you develop an ED, even if you recover, it’ll never really leave your side. There’ll always be a little back voice inside your head, or a little habit you think you quit that is still vigilant, even if weaker.\n\nAnd that fucks up your whole perception of what is “normal”. How many calories? Why do I feel the need to count anything? How do i balance? Is this enough? \n\nOf course this is not meant to make things worse, but that’s also why I think working on living with it and learn to manage ups and downs is better than putting on a fake scenario of “i’m free forever!!” \n\nIf you have the financial availability I recommend you to reach out to a nutritionist who works with EDs, it can really make a huge difference, wishing you the best! <3",
      "created_utc": 1663291461.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iolu8l1",
      "author": "coolofmetotry",
      "body": "I think intuitive eating is the best route, but if you have the resources seek help from a nutritionist, that way you know which foods will help your body gain back nutrients. for me it’s been hard letting go of the handle because eating after my “limit” or one of my fear foods often feels like I’m doing something illegal. but I try to think of the positive things eating gives me.\nmore energy to accomplish my goals. better skin. healthy hair. no longer freezing. my digestion is almost back to normal and I don’t feel pain as much. not dizzy anymore. even my mood has improved. so many good things. also how nice is it to be able to ENJOY eating with someone you love? I thought I’d never be able to, but I’m here. keep holding on <3",
      "created_utc": 1663290012.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iom7z9j",
      "author": "None",
      "body": "I feel your pain. It truly sucks! I’m married with a kid, and have had countless breakdowns to my husband because I just don’t know how to eat. Trying to figure out what to make for dinner is mainly my husbands job because I don’t even know what I like to eat. I wish I could be normal.",
      "created_utc": 1663296154.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iomnej4",
      "author": "Patient_Ad_3746",
      "body": "Dietician and meal plan. The nature of eating disorders means we can’t figure this part on our own, that’s the whole disorder. We need someone else’s non ED brain to help us. If you email an ED organization in your area / country they might be able to provide resources or hook you up with something free.",
      "created_utc": 1663304883.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iolbylf",
      "author": "None",
      "body": "i think i have hard orthorexia so dont totally take my advice but i used to be the same as you. now i just pick three meals to prep for 7 days (3 pr day) calorie count them to make sure im getting the right amount and keep it extremely clean ( no sugar, dairy, wheat, pesticides, processed food) it keeps my mind calm knowing im not hurting myself yet being healthy and maintaining weight",
      "created_utc": 1663281631.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ionxviw",
      "author": "EmoCatOnAGreenDay",
      "body": "My eating disorder didn’t last me as long as yours but I definitely remember the parts where it was most gripping, just as you’re experiencing. I don’t know if this is a good recommendation, but I might as well reach out with it. I was underaged, wouldn’t recommend you do it underaged, but I started smoking weed, it really calmed the crazy dysmorphia and the writhing kicking screaming feeling in my brain whenever I’d look at myself. It also makes you hungry and helps with nausea, so being high makes it incredibly easy to eat. However, I’d warn you about guilt. If you don’t want to be a regular user or don’t think you can do it without guilt, don’t. I know the guilt after a “binge” (I often considered a binge just a normal sized meal) can be soul crushing and maKe you feel hopeless because you feel like you just gave up on your dream of being skinny. With the help of weed, life changes, therapy, and good friends, I was able to shift my focus from trying to be skinny to trying to see myself at a healthy weight and be ok with it. I believe that some day, with or without substances, you will be able to look in the mirror and be proud.",
      "created_utc": 1663335880.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ioo1odb",
      "author": "SqueekySourpatch",
      "body": "There is a lot of great information out there about eating after recovery and while recovering however there is equally a lot of crap. \nThis is a little bit of what I was told by a dietitian that specializes in ED. \nNo fad diets or super restrictive diets, everything can be eaten in moderation. If tracking help you, track. If it harms you, don’t do it. Try to eat something every 4 hours to avoid getting overly hungry and practice listening to your body. Don’t do “good food” vs “bad food” there is nothing inherently wrong with your food or fantastic about it. It is made to fuel your body and it does exactly that so just let it do that. Demonizing and praising certain foods is just fuel for your ED to over restrict and inevitably binge it later. \nHope something here helps.",
      "created_utc": 1663337471.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ioopv6p",
      "author": "Cautious_Coat_3885",
      "body": "Let me teach you, you put the food in your mouth? Swallow repeat until you feel full. That's it I swear it's simple",
      "created_utc": 1663346896.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iooqs3k",
      "author": "None",
      "body": "I 100% feel this on an extremely personal level!!!! It’s SO HARD to learn how to eat. I have no idea how regular people eat or how much or how often. I have no regard for normal portion sizing. I thought the average woman ate 1200 cal a day and apparently that’s extremely low. I tried “intuitive eating” where I eat when I’m hungry but I’m so desensitized to hunger cues that I barely get or notice them unless I’m in actual pain. It’s draining when you WANT to get your shit together but have no idea how. The only thing that has even kinda helped me personally is working out because it stimulates my hunger but I’m afraid I’ll fall into unhealthy habits via working out 🙃 my fiancé helps because he packs me lunch and breakfast and we eat dinner together so he helps with my portions (he does physical education and used to be a personal trainer so he helps me make sure I get my daily nutrients) but if he doesn’t or I’m on my own I’m completely lost. It’s embarrassing to be 24 and not know how to do a basic function required for survival. Then I get nervous like if I have a kid how will I feed them!",
      "created_utc": 1663347247.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iop1210",
      "author": "CNicoleee",
      "body": "Hey I feel the frustration here. I made a post not too long ago when I was at an all time low and also not eating anything at all. I have since started implementing supplements into my every day life and idk if that’s a road you could try but maybe it might help. \nIt helps ease my mind that even if I’m not eating nutrition, I’m at least taking it in somehow. Then from taking the supplements to avoid a stomach ache you end up eating something small.\nI’ve read that supplements help open the appetite. At my worst I had no appetite, I had “cravings” but couldn’t touch the food once it was in front of me. Now these past couple days I’ve have been HUNGRY. Able to eat, nothing big, but actually able to take bites and feel like I’m actually eating. I started with a daily vitamin, then added a supplement for anxiety, magnesium, and then b-12. I don’t take them all at the same time, I just kind of cycle through them. \nI’m rooting for you. I know you feel out of control but this doesn’t define you.",
      "created_utc": 1663351213.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iqetyjn",
      "author": "you_are_amazing_ily",
      "body": "Literally I feel the exact same. I am forgetting how to eat properly.",
      "created_utc": 1664482746.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ioky2kf",
      "author": "0ntheb0rderline",
      "body": "Thats sweet of you to reply. When I wrote this I was really frustrated. I feel like I've tried everything and after a while it makes you feel really hopeless when nothing works.",
      "created_utc": 1663275789.0,
      "score": 8,
      "context": [
        {
          "id": "iokq7qe",
          "author": "unclegoddess",
          "body": "you are allowed to feed yourself you dont have to feel guilty there are no rules you are beautiful and deserve to be nourished — there are no good or bad foods its all just food and it all gives us energy to keep goin, theres no such thing as fuckin up cuz there are no rules— good luck out there 💕",
          "created_utc": 1663272677.0
        }
      ]
    },
    {
      "id": "iora4xm",
      "author": "None",
      "body": "I think it’s hard to be intuitive if you’ve been ignoring hunger cues for a long time. I think it’s best to have structure at first before going intuitive. That’s like 0 to 100.",
      "created_utc": 1663387973.0,
      "score": 1,
      "context": [
        {
          "id": "iolu8l1",
          "author": "coolofmetotry",
          "body": "I think intuitive eating is the best route, but if you have the resources seek help from a nutritionist, that way you know which foods will help your body gain back nutrients. for me it’s been hard letting go of the handle because eating after my “limit” or one of my fear foods often feels like I’m doing something illegal. but I try to think of the positive things eating gives me.\nmore energy to accomplish my goals. better skin. healthy hair. no longer freezing. my digestion is almost back to normal and I don’t feel pain as much. not dizzy anymore. even my mood has improved. so many good things. also how nice is it to be able to ENJOY eating with someone you love? I thought I’d never be able to, but I’m here. keep holding on <3",
          "created_utc": 1663290012.0
        }
      ]
    },
    {
      "id": "ipeq56y",
      "author": "StJimmyNeutron",
      "body": "I appreciate your insight, but I encourage you to refrain from using terms such as “clean eating” in an eating disorder forum. Our body needs sugar, dairy, wheat... etc. in order to perform its essential functions. For many folks on here, including myself, recovery means training our brains to believe that all food is good food- so long as it means you’re eating.",
      "created_utc": 1663808228.0,
      "score": 1,
      "context": [
        {
          "id": "iolbylf",
          "author": "None",
          "body": "i think i have hard orthorexia so dont totally take my advice but i used to be the same as you. now i just pick three meals to prep for 7 days (3 pr day) calorie count them to make sure im getting the right amount and keep it extremely clean ( no sugar, dairy, wheat, pesticides, processed food) it keeps my mind calm knowing im not hurting myself yet being healthy and maintaining weight",
          "created_utc": 1663281631.0
        }
      ]
    },
    {
      "id": "ip3fmwi",
      "author": "0ntheb0rderline",
      "body": "I've smoked week a fair bit and it makes me binge really badly. I'm glad you found something that worked though!",
      "created_utc": 1663611503.0,
      "score": 1,
      "context": [
        {
          "id": "ionxviw",
          "author": "EmoCatOnAGreenDay",
          "body": "My eating disorder didn’t last me as long as yours but I definitely remember the parts where it was most gripping, just as you’re experiencing. I don’t know if this is a good recommendation, but I might as well reach out with it. I was underaged, wouldn’t recommend you do it underaged, but I started smoking weed, it really calmed the crazy dysmorphia and the writhing kicking screaming feeling in my brain whenever I’d look at myself. It also makes you hungry and helps with nausea, so being high makes it incredibly easy to eat. However, I’d warn you about guilt. If you don’t want to be a regular user or don’t think you can do it without guilt, don’t. I know the guilt after a “binge” (I often considered a binge just a normal sized meal) can be soul crushing and maKe you feel hopeless because you feel like you just gave up on your dream of being skinny. With the help of weed, life changes, therapy, and good friends, I was able to shift my focus from trying to be skinny to trying to see myself at a healthy weight and be ok with it. I believe that some day, with or without substances, you will be able to look in the mirror and be proud.",
          "created_utc": 1663335880.0
        }
      ]
    },
    {
      "id": "iorg5i5",
      "author": "coolofmetotry",
      "body": "sure, but counting macros and calories doesn’t seem beneficial at all to recover, unless someone else is keeping track of those things. after eating for some time hunger cues are going to come back",
      "created_utc": 1663391751.0,
      "score": 1,
      "context": [
        {
          "id": "iolu8l1",
          "author": "coolofmetotry",
          "body": "I think intuitive eating is the best route, but if you have the resources seek help from a nutritionist, that way you know which foods will help your body gain back nutrients. for me it’s been hard letting go of the handle because eating after my “limit” or one of my fear foods often feels like I’m doing something illegal. but I try to think of the positive things eating gives me.\nmore energy to accomplish my goals. better skin. healthy hair. no longer freezing. my digestion is almost back to normal and I don’t feel pain as much. not dizzy anymore. even my mood has improved. so many good things. also how nice is it to be able to ENJOY eating with someone you love? I thought I’d never be able to, but I’m here. keep holding on <3",
          "created_utc": 1663290012.0
        },
        {
          "id": "iora4xm",
          "author": "None",
          "body": "I think it’s hard to be intuitive if you’ve been ignoring hunger cues for a long time. I think it’s best to have structure at first before going intuitive. That’s like 0 to 100.",
          "created_utc": 1663387973.0
        }
      ]
    },
    {
      "id": "ipndd50",
      "author": "None",
      "body": "refined sugar, wheat, and dairy have essential nutrients but aren't essential nutrients themselves. you can easily get them from other more beneficial foods",
      "created_utc": 1663971434.0,
      "score": 1,
      "context": [
        {
          "id": "iolbylf",
          "author": "None",
          "body": "i think i have hard orthorexia so dont totally take my advice but i used to be the same as you. now i just pick three meals to prep for 7 days (3 pr day) calorie count them to make sure im getting the right amount and keep it extremely clean ( no sugar, dairy, wheat, pesticides, processed food) it keeps my mind calm knowing im not hurting myself yet being healthy and maintaining weight",
          "created_utc": 1663281631.0
        },
        {
          "id": "ipeq56y",
          "author": "StJimmyNeutron",
          "body": "I appreciate your insight, but I encourage you to refrain from using terms such as “clean eating” in an eating disorder forum. Our body needs sugar, dairy, wheat... etc. in order to perform its essential functions. For many folks on here, including myself, recovery means training our brains to believe that all food is good food- so long as it means you’re eating.",
          "created_utc": 1663808228.0
        }
      ]
    }
  ]
}