{
  "id": "xhyuwa",
  "subreddit": "EatingDisorders",
  "author": "Greyzone96",
  "created_utc": 1663553000.0,
  "title": "Is there a way to tell my girlfriend she’s beautiful without triggering her ED?",
  "selftext": "As the title suggests I always want to tell my girlfriend she’s beautiful. I want to raise her self esteem and make her feel good about herself. But I’m aware that talking about looks can be a trigger and it could even be encouraging her bulimia. \n\nShe may think that me calling her beautiful is because of her ED. Like it’s helping her look good. I really don’t want to enable that and she needs to gain some weight. But I feel like if I tell her she looks good she’ll take it as a sign that she doesn’t need to change her habits. I really love her and just want her to be happy and healthy. But I’m scared of complimenting her.\n\nIs there a good way to boost her confidence while still encouraging her to keep eating? Or should I just refrain from saying anything about looks at all?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/xhyuwa/is_there_a_way_to_tell_my_girlfriend_shes/",
  "score": 62,
  "num_comments": 16,
  "comments": [
    {
      "id": "ip0poaf",
      "author": "yellowbeesinthewild",
      "body": "this is just my personal take, everyone’s ED is different so what I feel okay with might not feel okay to her. but compliments like “you have beautiful eyes” “your hair looks beautiful today” “i love that colour on you” “i love your dimples/freckles/nails/etc”  are safe to me and make me feel beautiful in a different way. stuff that makes me feel validated in my eating disorder (aka want to keep going further in it) is mostly in reference to my body, like saying they like my hipbones/other bones, telling me i look hot, complimenting me when i wear tight clothing but NOT when i wear looser clothing, or touching any thinner/boney areas a little too much.",
      "created_utc": 1663557614.0,
      "score": 56,
      "context": []
    },
    {
      "id": "ip0zdgw",
      "author": "rambanxious_hoodlamb",
      "body": "Compliment her by focusing on her personality/things she does that makes you smile. I’ve found that those types of compliments mean a lot more (both giving and receiving them).",
      "created_utc": 1663562983.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ip1n9x3",
      "author": "Candid_Side79",
      "body": "im no expert but try to compliment her features like her eyes, lips, hair or even her soft skin. just try to point out the things she change like hairstyle or different lipstick. \ngood luck",
      "created_utc": 1663581967.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ip2d2b8",
      "author": "KAI_IS_FINE",
      "body": "Can't think of anything to say. But I think it's extremely sweet that you're asking this and looking out for your partner like that and not wanting to trigger her ♡",
      "created_utc": 1663596225.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ip3lv6k",
      "author": "peachaleach",
      "body": "Honestly? I would ask her. Everyone with an ED has different triggers and will react differently to comments and compliments about their appearance. I think more than anything, open dialogue is important in relationships and while we can give you suggestions, the only person who can tell you what will and won't be helpful for her to hear is her.",
      "created_utc": 1663613915.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ip2gyd0",
      "author": "Purple_lotuss15",
      "body": "This is so sweet, kind, and considerate of you. I don’t have any particular advice, but kudos to you for being so conscious! I can tell you truly love her. Perhaps complimenting personality traits? It really means a lot when my husband does that! Also-if physical touch is her love language, a kind and gentle touch really makes me feel special, loved, and safe.",
      "created_utc": 1663597871.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ip3fukt",
      "author": "witchtitys",
      "body": "ithis is such a sweet question because you clearly care deeply for your gf and want her to be happy and healthy- a lot of people are not so considerate, but you are, and that’s just lovely. \ni know compliments about appearance can be somewhat of a minefield when dealing with EDs but some ideas could be\n-her laugh. ie; she has a beautiful laugh, it brings you such joy to hear her laugh, it’s music to your ears, etc\n-as previously mentioned: her smile. there’s not a more beautiful sight than her smile, she lights up the room with her smile things like that.\n-also i have to agree with compliments about her eyes, how a specific color makes her look even more radiant than usual, or a more sensual approach would be complimenting her lips, if that seems appropriate.\n\njust letting her know how much you care in little ways like bringing her flowers bc they were just so lovely they reminded you of her, random acts of affection/kindness, to me, are always appreciated. \n\njust by asking this question i’d say you are on the right track, so take what we’re all saying in the comments and use them as a jumping off point, or pick a few things to focus on; you know her best.",
      "created_utc": 1663611586.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ip3jyi0",
      "author": "None",
      "body": "i speak for a VAST majority of us, just fucking don’t. unless you’re willing to tell her extremely proana things she’ll get down on herself and find a way to turn it into “i’m fat” “my ed isn’t bad” “i’m not good enough” “other people have this why cant i” and can send her into a deep spiral. just don’t say anything to her. really you shouldn’t be commenting on her body or outer things if you know she has an ed because it’s so easy to twist things. tell her you love HER and that SHES beautiful, not her body. you love her for HER. just tell her how caring or nice or lovely she is. on the INSIDE.",
      "created_utc": 1663613173.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ip3qsx7",
      "author": "greeneyednfeisty",
      "body": "You're glowing, my heart is about to burst, I want to spoil you, what do you want to do this weekend? Anything I can help you with that you could use my obedient assistance?\nPick something you struggle with and practice, picking up your clothes, interrupting, anything that changes her mood. Do a chore she puts off.\nWhat's her love language? Look it up to find out.\nAsk lesbians how to have hand sex\nPut a blindfold on and let her do anything to you\nJust off the top of my head",
      "created_utc": 1663615948.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ip3w5vr",
      "author": "serenajuul",
      "body": "Personally, I’ve never felt like anyones compliments towards me were genuine. I think what “normal” people feel when they’re complimented is the same feeling I get when my partner looks at me with adoration. You can tell when someone’s eyes are saying “I love you,” it’s like a long, content, gentle smile, “I could stare at you for the rest of my life and everything would be okay” moment.\n\nComplimenting her and having her be receptive to it would probably feel good for you, but maybe it’s not her language per say. There are many other ways to make her feel beautiful and special. As far as avoiding triggers, there’s only so much you can do, so don’t beat yourself up too much if you accidentally say or do the wrong things. Intentions matter too. Your best is enough",
      "created_utc": 1663618215.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ip1zpwl",
      "author": "possums-",
      "body": "Assuming you’re of consenting age, oral sex without strings is the quickest way to make a woman feel beautiful. It’s not just words, it’s action and *shows her* that her body is beautiful and in a very intimate and often stigmatized (thanks Sigmund Freud) part of her body. It doesn’t bring her ED into play at all.\n\nApart from that, telling her can sometimes be triggering,  as can buying chocolates. Like others have said, if you’re just into compliments, try focusing on things that don’t have to do with her body.",
      "created_utc": 1663589919.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ip3o9du",
      "author": "youareinmybubble",
      "body": "Hey my best advice is to talk to her.   Tell her what you said here you want to encourage her and compliment her but don't want to trigger her so what would be the best way to do that.  Being open and honest can go far.   You could also say nice things about her without talking about her looks. Foe example when she had a great idea or solution to a problem, says sometign funny. you could say you are so creative , amazing, brilliant, funny  ext.  Or say I just love your smile, laugh , when you hug me like that.",
      "created_utc": 1663614896.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ip4647c",
      "author": "Present_Bumblebee",
      "body": "you could always keep it kinda vague or keep the beauty as a whole so it’s not JUST about specific body parts or the body at all like “i’m overwhelmed by your beauty” or “you lit the room up when you walked in” or “your outfit reflects your personality so well today” or “i love that color on you” or “i can’t wait to be seen out with you” \n\ni can’t speak for everyone but i tend to assume if my partner isn’t saying something about me when i get dressed up it’s because they’re thinking something negative and it can actually make my dysmorphia a lot worse cause i get sooo in my head about it.",
      "created_utc": 1663622391.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ipo1se5",
      "author": "Leah-unstoppable_",
      "body": "I wish I had an award for this",
      "created_utc": 1663983591.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ip0su1z",
      "author": "in_the_sheyd",
      "body": "Why don't you have a heart to heart with her and listen to what she has to say instead of asking us? Also maybe try just telling her that you love her or complementing things about her that aren't about her body. I suppose you should be doing a lot of that, anyway.",
      "created_utc": 1663559243.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ip1psth",
      "author": "rot4u",
      "body": "this is kinda random, just tell her u think she’s beautiful?",
      "created_utc": 1663583851.0,
      "score": -6,
      "context": []
    }
  ]
}