{
  "id": "xn5ry2",
  "subreddit": "EatingDisorders",
  "author": "helpplzsomeone",
  "created_utc": 1664057924.0,
  "title": "I found my close friend's edtwt and I need advice",
  "selftext": "Hi! This is a throwaway\n\nMe and my friend just found one of our best friend's edtwt and I'm super worried for her. We had no clue she had an ed and we've been friends with her since we were young teenagers (we're 21 now). I haven't had the best relationship with food throughout my life and I've always been extremely conscious of toxic thought patterns and toxic behaviors surrounding food because I wanted to avoid developing an ED, which means I'm very aware of the signs to look out for and I have never noticed any of them in her.\n\nI need advice on what to do now. I want to reach out to her in support and let her know I'm there for her, that I want to help her recover, but I don't know how to go about it. Do I tell her we've found her account? I'm scared she'll take it badly, because in a way we invaded her privacy and found out about something she probably didn't want us to know. At the same time, her edtwt is an old account that we used to follow, but she blocked us on it. My friend noticed she had blocked her and she checked from a different account and that's how she found out. I feel like somehow if she really didn't want us to find the account she would have made a new one.. I don't know. Maybe it's a cry for help in a way. She has only been active on edtwt for a few weeks.\n\nI can't really talk to her about her ed without mentioning the twitter account because, as I said, she has not shown us any sign of an ed, behavioral or physical. I don't know if it would help or harm her to know we know. I haven't told any of our other friends yet either, or her boyfriend.\n\nI really need help. I care for her so much. I don't know if I should tell her what I know. What would be best for her???",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/xn5ry2/i_found_my_close_friends_edtwt_and_i_need_advice/",
  "score": 42,
  "num_comments": 8,
  "comments": [
    {
      "id": "ipryrr3",
      "author": "None",
      "body": "This is my personal nightmare scenario lol. I’m sorry to hear about your friend and I’m sorry you two are in this tough spot. I don’t know the fully situation or anything but I can give you my perspective. \n\nPersonally, my heart would sink if I found out someone found a personal account like that. I’d probably panic and delete it or at least most posts and get more distant. The main thing I’d say it to just try to spend more time with here, encourage healthy behaviors, let her know she’s loved. You don’t need to say “something something your ED.” Just gentle nudge her in a positive direction. \n\nI don’t know if you should just never bring it up though. Personally, I would be mortified but it seems fair. I will say that her twitter might be a safe place for her that, although toxic, makes her feel comforted. Taking that away (or effectively taking it away by letting her know her friends know about it or have seen it) might not be the best. I guess the goal would be to get her to decide for herself that she doesn’t need it. \n\nObviously know all then usually ED stuff, don’t mention her body even in a positive way, don’t tell her she should eat more etc. etc. I’m sure you two know that so I’m not worried about that sort of thing. Wish I could give more constructive advice but that’s al I got lol. Best of luck, you two are great friends for caring about her enough to tread lightly here.",
      "created_utc": 1664061906.0,
      "score": 30,
      "context": []
    },
    {
      "id": "iptfp6n",
      "author": "SmileThen22",
      "body": "as someone who is also on edtwt, having someone i know find my account would be really stressful and would definitely make me panic if i knew.\ni think the best you can do is avoid bringing it up (that can make it worse in some cases) but trying to subtly nudge in the right direction without too much pressure.",
      "created_utc": 1664094360.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iptzg9l",
      "author": "og_jynt",
      "body": "Hi!\nThank you for being such a good friend, you are doing the right thing by asking for help to see what the best way to help your friend is. \n\nI myself have had an ED in the past, had many close friends with EDs, and now am working as a counselor for those who struggle with EDs of all ages. \n\nMy best advice would be to be honest with her. She is 21, which is an age where I imagine you two could have a mature conversation about how you're worried about her. \n\nYou know her better than I do, so if you think telling her you know about the twt account would make her isolate even more - don't bring it up. Use your best judgement. \n\nIf you don't tell her about the account, tell her you notice X symptoms and you want to make sure she's okay. Remind her she doesn't have to talk about anything she's not comfortable with, but that you're there for her and willing to listen and help in any way you can. \n\nIf she still refuses anything is wrong - don't stress yourself out trying to help her or get her to open up. It is not your responsibility as her friend to cure her. Don't completely forget about her ED, but continue to reach out if you see things are getting worse (aka: keep tabs on her twt account). If it's starting to get really bad and she's still refusing to open up - i would do the right thing and tell her you know about the account. Regardless of how she reacts. Tell her she needs help and if she refuses that's on her. She is an adult. I know she doesn't want an ED, nobody does. If you tell her you're worried about her and im sure she will listen. \n\nOverall, don't stress yourself out over helping her. You are her friend, not her mom, not her therapist. \n\nYou are a good friend. Reach out if you need any more advice!",
      "created_utc": 1664109229.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ipuw4qx",
      "author": "WilliamLovesCatz",
      "body": "I’ve been through a very similar thing except it was Pinterest for me. Only advice I can give you is that you should mention the twitter account and how you’re worried about them. Remember it’s not your place to force them to “recover” or even to tell on them. Show your support and don’t be pushy.",
      "created_utc": 1664124233.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ipsctl7",
      "author": "None",
      "body": "Not exactly the same scenario, but I accidentally stumbled upon my then 12 year old daughter’s twitter, and discovered she/they are non-binary and pan sexual.  It was listed publicly on their profile.\n\nIn my case, I’m glad I discovered it because I had no idea and now that I know their secret, I can be supportive.\n\nMy teen is now 17 and their father still doesn’t know. (We are divorced, and it’s not my place to share the information)",
      "created_utc": 1664068887.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ips8smo",
      "author": "helpplzsomeone",
      "body": "Spending more time with her would be the perfect thing to do but I don't know how to do that right now, we're both in uni and have insane schedules that don't match. We also work at the same place but we never work together (because of said unmatched schedules). Thanks for the advice tho I appreciate it",
      "created_utc": 1664066820.0,
      "score": 7,
      "context": [
        {
          "id": "ipryrr3",
          "author": "None",
          "body": "This is my personal nightmare scenario lol. I’m sorry to hear about your friend and I’m sorry you two are in this tough spot. I don’t know the fully situation or anything but I can give you my perspective. \n\nPersonally, my heart would sink if I found out someone found a personal account like that. I’d probably panic and delete it or at least most posts and get more distant. The main thing I’d say it to just try to spend more time with here, encourage healthy behaviors, let her know she’s loved. You don’t need to say “something something your ED.” Just gentle nudge her in a positive direction. \n\nI don’t know if you should just never bring it up though. Personally, I would be mortified but it seems fair. I will say that her twitter might be a safe place for her that, although toxic, makes her feel comforted. Taking that away (or effectively taking it away by letting her know her friends know about it or have seen it) might not be the best. I guess the goal would be to get her to decide for herself that she doesn’t need it. \n\nObviously know all then usually ED stuff, don’t mention her body even in a positive way, don’t tell her she should eat more etc. etc. I’m sure you two know that so I’m not worried about that sort of thing. Wish I could give more constructive advice but that’s al I got lol. Best of luck, you two are great friends for caring about her enough to tread lightly here.",
          "created_utc": 1664061906.0
        }
      ]
    },
    {
      "id": "iqg3rsd",
      "author": "helpplzsomeone",
      "body": "Thank you for your reply. I know there's a part of her that wants to recover from her tweets, but I also know eds involve not wanting to recover so she must be in a lot of conflict. U're right I'll have an honnest convo w her i think.",
      "created_utc": 1664502976.0,
      "score": 1,
      "context": [
        {
          "id": "iptzg9l",
          "author": "og_jynt",
          "body": "Hi!\nThank you for being such a good friend, you are doing the right thing by asking for help to see what the best way to help your friend is. \n\nI myself have had an ED in the past, had many close friends with EDs, and now am working as a counselor for those who struggle with EDs of all ages. \n\nMy best advice would be to be honest with her. She is 21, which is an age where I imagine you two could have a mature conversation about how you're worried about her. \n\nYou know her better than I do, so if you think telling her you know about the twt account would make her isolate even more - don't bring it up. Use your best judgement. \n\nIf you don't tell her about the account, tell her you notice X symptoms and you want to make sure she's okay. Remind her she doesn't have to talk about anything she's not comfortable with, but that you're there for her and willing to listen and help in any way you can. \n\nIf she still refuses anything is wrong - don't stress yourself out trying to help her or get her to open up. It is not your responsibility as her friend to cure her. Don't completely forget about her ED, but continue to reach out if you see things are getting worse (aka: keep tabs on her twt account). If it's starting to get really bad and she's still refusing to open up - i would do the right thing and tell her you know about the account. Regardless of how she reacts. Tell her she needs help and if she refuses that's on her. She is an adult. I know she doesn't want an ED, nobody does. If you tell her you're worried about her and im sure she will listen. \n\nOverall, don't stress yourself out over helping her. You are her friend, not her mom, not her therapist. \n\nYou are a good friend. Reach out if you need any more advice!",
          "created_utc": 1664109229.0
        }
      ]
    },
    {
      "id": "iqg3vje",
      "author": "helpplzsomeone",
      "body": "Thanks. I dont intend to be pushy, I know people need to want to recover in order to do so, all I can do is make myself available to help her if she wants me to.",
      "created_utc": 1664503022.0,
      "score": 1,
      "context": [
        {
          "id": "ipuw4qx",
          "author": "WilliamLovesCatz",
          "body": "I’ve been through a very similar thing except it was Pinterest for me. Only advice I can give you is that you should mention the twitter account and how you’re worried about them. Remember it’s not your place to force them to “recover” or even to tell on them. Show your support and don’t be pushy.",
          "created_utc": 1664124233.0
        }
      ]
    }
  ]
}