{
  "id": "xvghau",
  "subreddit": "EatingDisorders",
  "author": "goneonatrip",
  "created_utc": 1664893491.0,
  "title": "Can we talk about zero libido",
  "selftext": "Ugh",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/xvghau/can_we_talk_about_zero_libido/",
  "score": 37,
  "num_comments": 7,
  "comments": [
    {
      "id": "ir2gu1e",
      "author": "Bellissimabee",
      "body": "Yup, was one of the main reasons I chose to recover. I had zero interest in it at my lowest and my partner lost his interest in having sex with me because he admitted he didn't find my body attractive being so underweight and he was scared any kind of movement would hurt me.\n\nNot be attractive to him was the worst feeling, I love this man. We have been together 15 years, I wasn't about to let that fall apart because I was to scared to get help.\n\nNow after 6 years of never being in the mood, I've gained some weight and we are both at it like high school kids again. When I didn't have it I didn't miss it, but now it's back and I crave sex, it's like \"woah 6 years wasted\"",
      "created_utc": 1664917390.0,
      "score": 31,
      "context": []
    },
    {
      "id": "ir2ghsi",
      "author": "KjaereBabyGulrot",
      "body": "Ed mixed with my meds is just too tired to care about that",
      "created_utc": 1664917263.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ir3e6dp",
      "author": "starfirenitee",
      "body": "I feel like the antidepressants, insecurity and potential trauma one has had really affects it. What has helped other people?",
      "created_utc": 1664931992.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ir3tj5n",
      "author": "schuylersisters-",
      "body": "I feel so bad for my bf, i try to relax but idk… we kind of almost always stop. i tried to explain but i just cried lol",
      "created_utc": 1664939415.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ir57stn",
      "author": "Greedy_Coyote6584",
      "body": "this is one of the worst side effects of an ED. it sucks so bad having to turn down my gf just because i dont feel like it.",
      "created_utc": 1664974745.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ir50f2w",
      "author": "None",
      "body": "It happens to me too, I don’t really know why but i just cry in middle of things. I just feel horrible. He’s good about it but. Idk why it happens",
      "created_utc": 1664970802.0,
      "score": 2,
      "context": [
        {
          "id": "ir3tj5n",
          "author": "schuylersisters-",
          "body": "I feel so bad for my bf, i try to relax but idk… we kind of almost always stop. i tried to explain but i just cried lol",
          "created_utc": 1664939415.0
        }
      ]
    }
  ]
}