{
  "id": "y7cx1z",
  "subreddit": "EatingDisorders",
  "author": "dibedab",
  "created_utc": 1666113325.0,
  "title": "Obese after Anorexia",
  "selftext": "Hello! \n\nTldr; Can anyone relate to being obese before/after Anorexia? I feel so alone in this and need help with getting out of it. \n\nMy ED story:  \n\nI (F23) developed disordered eating styles due to growing up with CPTSD. For most of my life I have been obese. I've lost all the (over)weight three times. It was at its worst in 2018 right before I finished highschool. I developed heart palpitations and had to see doctors because of severe hip pain; they thought I had osteoporosis, luckily I didn't, but that was a wake up call for me. I made myself go inpatient in 2019, miraculously got pregnant after getting out and gained more than double my weight after that. I ate because I was so scared my body couldn't keep up with being pregnant. Then I ate and ate because I was emotionally overwhelmed and had a  baby. Now I'm at my highest weight ever, active, but I keep overeating and I feel stuck in this loop. Whenever I try to lose weight i swing into anorexic habits. I've tried just focusing on being healthy and active which helps with depression but I can not stop emotional eating when I'm anxious. And i am anxious 90% of the time. \n\nI hate my body so much and am having a hard time existing. I'm seeing 3 therapists, but I am scared of talking about food issues as it holds a lot of shame. We have scratched the surface and I hope to find the courage to talk about it. For now I hope I can maybe catch some words on here from people who might get it. \nOften I feel too gross to even leave the house, which used to be my downfall. Now, having a kid, that is not a thought I am allowing myself to indulge in. As soon as she sleeps it bursts out though. My relationship is definitely taking a physical blow because of it and I'm scared of what will happen when my child picks up on it. I just don't know how to stop this disorder.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/y7cx1z/obese_after_anorexia/",
  "score": 47,
  "num_comments": 43,
  "comments": [
    {
      "id": "isv1kyf",
      "author": "drag0n_princess",
      "body": "Yes each time I relapsed, I gained a significant amount of weight because I couldn’t stop bingeing - more weight than the time before. I’ve learned that anorexia and restricting are not sustainable as your body will crave food and nutrients. It’s definitely a difficult and shitty cycle to be stuck in so please don’t be afraid about reaching out for help; especially since you have 3 therapists. If it helps, try to find one that specializes in eating disorders and they can help you work through the emotional side of your food issues. My inbox is open if you need to talk ❤️",
      "created_utc": 1666131488.0,
      "score": 25,
      "context": []
    },
    {
      "id": "isvjnxh",
      "author": "Careful_Interaction2",
      "body": "I would definitely add a registered dietitian in the mix. Maybe explaining the food science behind binging can help you understand it a little more & can help you finally kick that habit into the curb!",
      "created_utc": 1666139536.0,
      "score": 15,
      "context": []
    },
    {
      "id": "isvia9u",
      "author": "tomatopotatotomato",
      "body": "I’m recovered from anorexia and my pregnancy was very triggering. I had twins so I got pretty big. Now I’m having a hard time accepting my breasts and changed stomach. You’re not alone. Self love is a forever journey. Give yourself time. Focus on how you feel not on numbers. It’s good that you’re in therapy and please know that shame is an unhelpful emotion you don’t have to listen to. In fact your shame is your greatest teacher bc it gives you clues about what hurts and where it came from. When you hear inner shame ask yourself where you first heard it. Then go back and hug that little child that sad you. ❤️",
      "created_utc": 1666138909.0,
      "score": 10,
      "context": []
    },
    {
      "id": "isvojz3",
      "author": "tssclay",
      "body": "I’m in almost the exact situation except I didn’t get pregnant. I just switched to binging basically and now whenever I try to go easy on the food or eat healthier I find myself completely restricting",
      "created_utc": 1666141704.0,
      "score": 7,
      "context": []
    },
    {
      "id": "isw0arm",
      "author": "theunfairness",
      "body": "Winner winner chicken dinner. I’ve been 97lbs and 197lbs in the last five years. Right now I want my restriction monster back so badly. I’m on the couch painfully over-full from supper.",
      "created_utc": 1666146989.0,
      "score": 6,
      "context": []
    },
    {
      "id": "isvihmy",
      "author": "loserybehavior",
      "body": "i know you said you are seeing therapists right now, but i think it would be super helpful for you to add a dietitian with eating disorder experience to your team. 💕",
      "created_utc": 1666139001.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iswzt0c",
      "author": "JackyG8991",
      "body": "Oh my god. Your post is like as if I wrote it. I’ve been struggling with BED and Bulimia/Atypical Anorexia. I realized nobody cares or can do anything since I’m not extremely underweight, I can openly admit to abusing my body.\n\nI lost all my weight 2 years ago and now I gained it all back. I’m living a fucking nightmare. I just want to be thin, why is food so toxic to me? \n\nMy weight fluctuates so much because I’m either starving myself or binging. I cant control it anymore.",
      "created_utc": 1666171660.0,
      "score": 5,
      "context": []
    },
    {
      "id": "isvrmcf",
      "author": "One-Unit-1775",
      "body": "Broooooo literally I was about to post something like this. I don't want to starve myself and I am doing so good with my thoughts but....I'm overweight and I can't cope with it.",
      "created_utc": 1666143070.0,
      "score": 3,
      "context": []
    },
    {
      "id": "isvrusl",
      "author": "One-Unit-1775",
      "body": "I just feel like if be happy if I lost weight. But I look at pictures of years ago and I literally had a great body and all I could see was fat.",
      "created_utc": 1666143178.0,
      "score": 3,
      "context": []
    },
    {
      "id": "isxq92f",
      "author": "PrincessFantaGyros",
      "body": "I am obese after recovering from anorexia and orthorexia. I have a very similar story, cptsd, and a mom that is still to this day chronically dieting.\n\nI've been in recovery for a while now, but last year I was told I had to lose weight in order to get surgery for my lipedema, which is very painful. That really messed with my head, but after seeing many doctors, I decided to go on ozempic. I have since lost 45 pounds, only a few pounds to go until I can do the surgery!\n\nMore importantly, ozempic has really helped me to take some of the stress out of eating. Dealing with bad insulin resistance, eating was often a matter of urgency for me. Ozempic really helped with that. I am eating fully intuitively now, and still losing weight.\n\nHowever, if ozempic had triggered my anorexia, I would definitely have prioritized recovery over the surgery.\n\nMy recommendation is finding a support group. A lot of things that were very shameful for me became ok when I was able to talk to people with similar thoughts. Interestingly, we all share the same basic thoughts in my eating disorder support group, no matter if we have anorexia, orthorexia, bulemia or binge eating disorder.",
      "created_utc": 1666187734.0,
      "score": 3,
      "context": []
    },
    {
      "id": "isw6dxu",
      "author": "okamiokamii",
      "body": "Same happened to me and then I stopped taking a certain med cold turkey and gained even more weight. It sucks but I'm seeing a dietitian now which I strongly recommend. I think a dietitian could help you a lot with losing the extra weight in a healthy way.  I also second the person who recommended a therapist who specializes in eds, I need to do that too but my current one is not well known so it's kinda hard. When I have some extra money I found a book about the ED I have that I'm hoping will help since I can't seem to find a Dr that knows about it and will treat an adult.  You could search Kindle or Libby (library app) and see if there are any self help books.",
      "created_utc": 1666149980.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iswezkp",
      "author": "rebuilt11",
      "body": "Same. Been doing this for years now… definitely get where you’re coming from. ❤️",
      "created_utc": 1666154897.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iswl514",
      "author": "None",
      "body": "\nI’m not obese or overweight, but I’ve gained a lot of weight in the past year—a lot more than I would have liked. I actually spent the first 2.5 years after my anorexia recovery perfectly fine and happy. I was still incredibly skinny, but at a healthier weight due to consistent exercise and diet. But then I went to college and gained 20 lbs…I became super depressed about it and stopped attending classes because I couldn’t leave my house. I spent a couple months just laying in my room and ordering food to binge on and kept gaining weight. My mental state got so bad that I had to quit only half a semester in. Even worse, I had paid a full years tuition and couldn’t get the money back. I was dead broke since I kept spending money on food and had to move back in with my dad. It was a very humiliating and disappointing situation. I thought that living with my dad again would help me get back on track physically and mentally but nothing changed. Now, I’ve moved across the country away from everyone I know to live in isolation. I work at a very remote area that provides free housing. When I’m not working, I shut myself away in my room all day, and I’ve become borderline agoraphobic. Everytime i need to drive into town to purchase supplies, I experience extreme anxiety and nervousness in public. Sometimes I bail on an errand run because I can’t bring myself to go outside.\n\nI am very sorry about your situation… we just need to keep fighting and remember what’s important to us. What matters is that we keep picking ourselves back up everytime we fall. This is a lifetime struggle.",
      "created_utc": 1666159068.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iswn2c0",
      "author": "None",
      "body": "I was obese both before and after anorexia, thanks to bulimia and other disordered eating behaviors 😭",
      "created_utc": 1666160536.0,
      "score": 2,
      "context": []
    },
    {
      "id": "isxpjef",
      "author": "bellemountain",
      "body": "Shame can only survive in the dark. Tell your therapists! I believe in you. I don’t know you but I believe in you, because you’re a human being and deserving of it",
      "created_utc": 1666187415.0,
      "score": 2,
      "context": []
    },
    {
      "id": "isyjdmy",
      "author": "thereaintshitcaptain",
      "body": "I was about to post something similar lol. I literally quit therapy out of embarrassment and now that I'm overweight I am torn between this being my opportunity to get better mentally or just going down the same path as before. \n\nI don't like leaving the house anymore. I know your pain.",
      "created_utc": 1666199512.0,
      "score": 2,
      "context": []
    },
    {
      "id": "isyjnnx",
      "author": "bubblywaffo",
      "body": "this is me right here.\nwas obese before anorexia and then obese after recovery. \n\nI have literally the slowest metabolism because I am in early menopause (from cancer). \n\nlegitimately work out 3 times a week. \neat healthily now. \nI beat BED. \n\nand I can't lose my weight. \nand I am not obese because of the archaic BMi system.  also obese st risk for diabetes, heart issues, etc. \n\nLike it really sucks. \n\nYou aren't alone.\n♡",
      "created_utc": 1666199622.0,
      "score": 2,
      "context": []
    },
    {
      "id": "it738s0",
      "author": "None",
      "body": "Yes, I've been both extremes. Bulimia led to anorexia. I stayed ana for years and controlled my eating. I was underweight. I still have trouble saying that because my body frame is so big to begin with (Scandinavian), that my numbers didn't match up to others' numbers when they're underweight. I could never be 120lbs, for example. \n\nThen I made a promise I would recover. Starvation mode makes it easy not to eat. Once I eat, I trigger hunger. I became obese in my 20s. Lost it all again (140lbs or so) several years ago.",
      "created_utc": 1666355461.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iswdpmt",
      "author": "dibedab",
      "body": "Thank you alot! I second all of this. \n\nWe have one ED specialized therapist in town and when I saw her back before I went into my worst anorexic phase yet, she told me I was too heavy to be experiencing an ED. Like gurl. You're supposed to be an expert. It broke me down completely.\nMy current therapists do have ED experience though and are trauma informed. I feel like I'm in good hands, but I can't bring myself to talk about it.",
      "created_utc": 1666154103.0,
      "score": 4,
      "context": [
        {
          "id": "isv1kyf",
          "author": "drag0n_princess",
          "body": "Yes each time I relapsed, I gained a significant amount of weight because I couldn’t stop bingeing - more weight than the time before. I’ve learned that anorexia and restricting are not sustainable as your body will crave food and nutrients. It’s definitely a difficult and shitty cycle to be stuck in so please don’t be afraid about reaching out for help; especially since you have 3 therapists. If it helps, try to find one that specializes in eating disorders and they can help you work through the emotional side of your food issues. My inbox is open if you need to talk ❤️",
          "created_utc": 1666131488.0
        }
      ]
    },
    {
      "id": "isw00wz",
      "author": "theunfairness",
      "body": "My sister is a registered dietician. She is waaaay up in public healthcare and policy management. Our mother taught me my eating disorder—and she taught my sister, too. My disorder manifests as cyclical restriction and bingeing; my sister’s disordered behaviour manifests as monitoring *literally everybody else’s* eating habits. \n\nNutrition education isn’t magic. The answer lies in coming to terms with the gap between your emotions and your reality, no matter how disparate those two poles.",
      "created_utc": 1666146860.0,
      "score": 10,
      "context": [
        {
          "id": "isvjnxh",
          "author": "Careful_Interaction2",
          "body": "I would definitely add a registered dietitian in the mix. Maybe explaining the food science behind binging can help you understand it a little more & can help you finally kick that habit into the curb!",
          "created_utc": 1666139536.0
        }
      ]
    },
    {
      "id": "iswdcs9",
      "author": "dibedab",
      "body": "Thank you for the kind words. I feel so alone with the pregnancy changes, even though I know I'm not. The mentally healthiest women struggle with it. \n\n>Give yourself time. Focus on how you feel not on numbers.\n\nThat's what I'm trying to do, but it's so hard. I've always pushed myself with self hate and a strong inner critic. We are working on shutting that down in therapy. \n\nAnd we are actually talking about Shame in my next session! I'm very excited for that, an it might make the ED topic easier to unload.\n\nThank you for your input and all the best to you and your family!",
      "created_utc": 1666153888.0,
      "score": 2,
      "context": [
        {
          "id": "isvia9u",
          "author": "tomatopotatotomato",
          "body": "I’m recovered from anorexia and my pregnancy was very triggering. I had twins so I got pretty big. Now I’m having a hard time accepting my breasts and changed stomach. You’re not alone. Self love is a forever journey. Give yourself time. Focus on how you feel not on numbers. It’s good that you’re in therapy and please know that shame is an unhelpful emotion you don’t have to listen to. In fact your shame is your greatest teacher bc it gives you clues about what hurts and where it came from. When you hear inner shame ask yourself where you first heard it. Then go back and hug that little child that sad you. ❤️",
          "created_utc": 1666138909.0
        }
      ]
    },
    {
      "id": "iswcguy",
      "author": "dibedab",
      "body": "I'm sorry we're in the same boat and I'm rooting for you.",
      "created_utc": 1666153358.0,
      "score": 2,
      "context": [
        {
          "id": "isvojz3",
          "author": "tssclay",
          "body": "I’m in almost the exact situation except I didn’t get pregnant. I just switched to binging basically and now whenever I try to go easy on the food or eat healthier I find myself completely restricting",
          "created_utc": 1666141704.0
        }
      ]
    },
    {
      "id": "iswczan",
      "author": "dibedab",
      "body": "My weight has been very similar. \n\n>Right now I want my restriction monster back so badly. \n\nI feel you on this man. At least sometimes. My 2018 health scare was very hard though lol. Sitting in a room full of old women who can't walk properly, watching a doctor's informational AD on osteoporosis before going in to get tested was a pretty strong experience. \nSo, I don't want that monster back, but I wouldn't mind some of that \"self control\" people used to compliment me on so often.",
      "created_utc": 1666153664.0,
      "score": 2,
      "context": [
        {
          "id": "isw0arm",
          "author": "theunfairness",
          "body": "Winner winner chicken dinner. I’ve been 97lbs and 197lbs in the last five years. Right now I want my restriction monster back so badly. I’m on the couch painfully over-full from supper.",
          "created_utc": 1666146989.0
        }
      ]
    },
    {
      "id": "iswd1k8",
      "author": "dibedab",
      "body": "I'll be looking into it, thank you for the comment!",
      "created_utc": 1666153702.0,
      "score": 2,
      "context": [
        {
          "id": "isvihmy",
          "author": "loserybehavior",
          "body": "i know you said you are seeing therapists right now, but i think it would be super helpful for you to add a dietitian with eating disorder experience to your team. 💕",
          "created_utc": 1666139001.0
        }
      ]
    },
    {
      "id": "jeep6vg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1680271057.0,
      "score": 2,
      "context": [
        {
          "id": "iswzt0c",
          "author": "JackyG8991",
          "body": "Oh my god. Your post is like as if I wrote it. I’ve been struggling with BED and Bulimia/Atypical Anorexia. I realized nobody cares or can do anything since I’m not extremely underweight, I can openly admit to abusing my body.\n\nI lost all my weight 2 years ago and now I gained it all back. I’m living a fucking nightmare. I just want to be thin, why is food so toxic to me? \n\nMy weight fluctuates so much because I’m either starving myself or binging. I cant control it anymore.",
          "created_utc": 1666171660.0
        }
      ]
    },
    {
      "id": "iswc9d2",
      "author": "dibedab",
      "body": "Thank you for sharing. \n\n>I don't want to starve myself and I am doing so good with my thoughts but\n\nI second this and it makes me feel like such a failure sometimes. Like, I get how dangerous starving myself is and I 100% don't want to roll back into that loop. But being overweight has its very own dangers and idk how to get out without turning to the other extreme. \n\nI wish you all the best man, I'm happy to know I'm not alone with this.",
      "created_utc": 1666153240.0,
      "score": 3,
      "context": [
        {
          "id": "isvrmcf",
          "author": "One-Unit-1775",
          "body": "Broooooo literally I was about to post something like this. I don't want to starve myself and I am doing so good with my thoughts but....I'm overweight and I can't cope with it.",
          "created_utc": 1666143070.0
        }
      ]
    },
    {
      "id": "iswcdly",
      "author": "dibedab",
      "body": "Yep :') I guess at least we know weight loss won't magically fix self hate.",
      "created_utc": 1666153307.0,
      "score": 2,
      "context": [
        {
          "id": "isvrusl",
          "author": "One-Unit-1775",
          "body": "I just feel like if be happy if I lost weight. But I look at pictures of years ago and I literally had a great body and all I could see was fat.",
          "created_utc": 1666143178.0
        }
      ]
    },
    {
      "id": "isyih5i",
      "author": "dibedab",
      "body": "You sound like you're on a very great path! \n\nI know I should talk to a doctor and get an assessment, but oh man doctors are scary and i have so many excuses. I don't have a lipedema (wishing you the best for that and I hope you'll get surgery soon) but I already have heart issues and the female side of my family is prone to heart attacks. It's scary, and making an appointment is on my list. \n\nWe only have a local support group for people who are related to someone who has an ED. This post is now my first try at maybe getting some sense of not-being-alone online! And it's working.",
      "created_utc": 1666199159.0,
      "score": 1,
      "context": [
        {
          "id": "isxq92f",
          "author": "PrincessFantaGyros",
          "body": "I am obese after recovering from anorexia and orthorexia. I have a very similar story, cptsd, and a mom that is still to this day chronically dieting.\n\nI've been in recovery for a while now, but last year I was told I had to lose weight in order to get surgery for my lipedema, which is very painful. That really messed with my head, but after seeing many doctors, I decided to go on ozempic. I have since lost 45 pounds, only a few pounds to go until I can do the surgery!\n\nMore importantly, ozempic has really helped me to take some of the stress out of eating. Dealing with bad insulin resistance, eating was often a matter of urgency for me. Ozempic really helped with that. I am eating fully intuitively now, and still losing weight.\n\nHowever, if ozempic had triggered my anorexia, I would definitely have prioritized recovery over the surgery.\n\nMy recommendation is finding a support group. A lot of things that were very shameful for me became ok when I was able to talk to people with similar thoughts. Interestingly, we all share the same basic thoughts in my eating disorder support group, no matter if we have anorexia, orthorexia, bulemia or binge eating disorder.",
          "created_utc": 1666187734.0
        }
      ]
    },
    {
      "id": "iswbur0",
      "author": "dibedab",
      "body": "Thank you for the comment, this is all so helpful. \n\nI am very happy with my current therapists and two of them have ED experience; I'm the one who doesn't know how to talk about it lol. I am so ashamed of the whole ordeal, and in my next therapy session we are talking about Shame and it's function, so that might be a door for me to use to break the topic in. \n\nMy in-patient therapist gave me one of her books on anorexia and emotions which helped a lot! It taught me that I use my anorexia to basically ignore all my other issues; if my mind is occupied with ED I don't have time to acknowledge my trauma and emotions. Now I overeat out of the same reasons though :')  \n\nI wish you all the best for this, and thank you for sharing.",
      "created_utc": 1666153007.0,
      "score": 2,
      "context": [
        {
          "id": "isw6dxu",
          "author": "okamiokamii",
          "body": "Same happened to me and then I stopped taking a certain med cold turkey and gained even more weight. It sucks but I'm seeing a dietitian now which I strongly recommend. I think a dietitian could help you a lot with losing the extra weight in a healthy way.  I also second the person who recommended a therapist who specializes in eds, I need to do that too but my current one is not well known so it's kinda hard. When I have some extra money I found a book about the ED I have that I'm hoping will help since I can't seem to find a Dr that knows about it and will treat an adult.  You could search Kindle or Libby (library app) and see if there are any self help books.",
          "created_utc": 1666149980.0
        }
      ]
    },
    {
      "id": "iswm7oo",
      "author": "dibedab",
      "body": "I'm very sorry about your situation as well. I'm reading a lot of strong choices out of your text, you can be very proud of yourself. You've managed to be at a healthy weight, which is already one step ahead of where you were before. \n\nWhile it's relieving to see other people also struggle with self hate to this extent, it pains me to hear. \n\n> Everytime i need to drive into town to purchase supplies, I experience extreme anxiety and nervousness in public. Sometimes I bail on an errand run because I can’t bring myself to go outside.\n\nBack when I was not with child this was very much me. I had so many panic attacks in Public restrooms and went home while dissociating. It's no fun. \n\nI struggled with agoraphobia since mid childhood, it's so tough man. It's like anorexia is to addictions. You can't avoid food; you can't avoid people. \n\nI don't have the time to say everything I want right now, but I'm very proud of you for staying proactive in your life. I hope you find what you need to regain confidence.",
      "created_utc": 1666159879.0,
      "score": 2,
      "context": [
        {
          "id": "iswl514",
          "author": "None",
          "body": "\nI’m not obese or overweight, but I’ve gained a lot of weight in the past year—a lot more than I would have liked. I actually spent the first 2.5 years after my anorexia recovery perfectly fine and happy. I was still incredibly skinny, but at a healthier weight due to consistent exercise and diet. But then I went to college and gained 20 lbs…I became super depressed about it and stopped attending classes because I couldn’t leave my house. I spent a couple months just laying in my room and ordering food to binge on and kept gaining weight. My mental state got so bad that I had to quit only half a semester in. Even worse, I had paid a full years tuition and couldn’t get the money back. I was dead broke since I kept spending money on food and had to move back in with my dad. It was a very humiliating and disappointing situation. I thought that living with my dad again would help me get back on track physically and mentally but nothing changed. Now, I’ve moved across the country away from everyone I know to live in isolation. I work at a very remote area that provides free housing. When I’m not working, I shut myself away in my room all day, and I’ve become borderline agoraphobic. Everytime i need to drive into town to purchase supplies, I experience extreme anxiety and nervousness in public. Sometimes I bail on an errand run because I can’t bring myself to go outside.\n\nI am very sorry about your situation… we just need to keep fighting and remember what’s important to us. What matters is that we keep picking ourselves back up everytime we fall. This is a lifetime struggle.",
          "created_utc": 1666159068.0
        }
      ]
    },
    {
      "id": "isyhk2p",
      "author": "dibedab",
      "body": "Thank you 💕",
      "created_utc": 1666198800.0,
      "score": 1,
      "context": [
        {
          "id": "isxpjef",
          "author": "bellemountain",
          "body": "Shame can only survive in the dark. Tell your therapists! I believe in you. I don’t know you but I believe in you, because you’re a human being and deserving of it",
          "created_utc": 1666187415.0
        }
      ]
    },
    {
      "id": "isyjnrg",
      "author": "dibedab",
      "body": ">I am torn between this being my opportunity to get better mentally or just going down the same path as before. \n\n\nYUP. Bigtime. Having a child depend on me is making the choice rather easy, but the actual execution of getting better mentally is,,, lacking. \n\nI'm sorry man, glad I'm not alone but also saddened.",
      "created_utc": 1666199623.0,
      "score": 2,
      "context": [
        {
          "id": "isyjdmy",
          "author": "thereaintshitcaptain",
          "body": "I was about to post something similar lol. I literally quit therapy out of embarrassment and now that I'm overweight I am torn between this being my opportunity to get better mentally or just going down the same path as before. \n\nI don't like leaving the house anymore. I know your pain.",
          "created_utc": 1666199512.0
        }
      ]
    },
    {
      "id": "isxisyf",
      "author": "suicidalpenguin99",
      "body": "... she said you were too heavy to have an ed? Does she even know what an ed is? Ffs",
      "created_utc": 1666184236.0,
      "score": 5,
      "context": [
        {
          "id": "isv1kyf",
          "author": "drag0n_princess",
          "body": "Yes each time I relapsed, I gained a significant amount of weight because I couldn’t stop bingeing - more weight than the time before. I’ve learned that anorexia and restricting are not sustainable as your body will crave food and nutrients. It’s definitely a difficult and shitty cycle to be stuck in so please don’t be afraid about reaching out for help; especially since you have 3 therapists. If it helps, try to find one that specializes in eating disorders and they can help you work through the emotional side of your food issues. My inbox is open if you need to talk ❤️",
          "created_utc": 1666131488.0
        },
        {
          "id": "iswdpmt",
          "author": "dibedab",
          "body": "Thank you alot! I second all of this. \n\nWe have one ED specialized therapist in town and when I saw her back before I went into my worst anorexic phase yet, she told me I was too heavy to be experiencing an ED. Like gurl. You're supposed to be an expert. It broke me down completely.\nMy current therapists do have ED experience though and are trauma informed. I feel like I'm in good hands, but I can't bring myself to talk about it.",
          "created_utc": 1666154103.0
        }
      ]
    },
    {
      "id": "isw08it",
      "author": "Careful_Interaction2",
      "body": "To me, what helped me in my recovery was the nutrition education. Separating the emotion to the science helped me realized what I was doing to my body was detrimental, it will absolutely not be for everyone, but the power of an RD goes a long way for a lot of people, especially if they specialize in ED",
      "created_utc": 1666146960.0,
      "score": 7,
      "context": [
        {
          "id": "isvjnxh",
          "author": "Careful_Interaction2",
          "body": "I would definitely add a registered dietitian in the mix. Maybe explaining the food science behind binging can help you understand it a little more & can help you finally kick that habit into the curb!",
          "created_utc": 1666139536.0
        },
        {
          "id": "isw00wz",
          "author": "theunfairness",
          "body": "My sister is a registered dietician. She is waaaay up in public healthcare and policy management. Our mother taught me my eating disorder—and she taught my sister, too. My disorder manifests as cyclical restriction and bingeing; my sister’s disordered behaviour manifests as monitoring *literally everybody else’s* eating habits. \n\nNutrition education isn’t magic. The answer lies in coming to terms with the gap between your emotions and your reality, no matter how disparate those two poles.",
          "created_utc": 1666146860.0
        }
      ]
    },
    {
      "id": "isxc7uc",
      "author": "tomatopotatotomato",
      "body": "It’s been really hard for me not to relapse which took me by surprise. I’m actually tracking all my calories to make sure I don’t undereat because I really don’t want to damage my kidneys. I’m walking every day and when my app tells me to have a snack I’m sure to follow it. It can be very jarring to have something so personal (our bodies) seemingly hijacked by hormones and changes outside our consent. I was handling it mentally okay during pregnancy cause I focused on my babies getting here safe but once they were out, I noticed how unkind I was to myself.  Best of luck on your recovery ❤️❤️❤️",
      "created_utc": 1666180695.0,
      "score": 2,
      "context": [
        {
          "id": "isvia9u",
          "author": "tomatopotatotomato",
          "body": "I’m recovered from anorexia and my pregnancy was very triggering. I had twins so I got pretty big. Now I’m having a hard time accepting my breasts and changed stomach. You’re not alone. Self love is a forever journey. Give yourself time. Focus on how you feel not on numbers. It’s good that you’re in therapy and please know that shame is an unhelpful emotion you don’t have to listen to. In fact your shame is your greatest teacher bc it gives you clues about what hurts and where it came from. When you hear inner shame ask yourself where you first heard it. Then go back and hug that little child that sad you. ❤️",
          "created_utc": 1666138909.0
        },
        {
          "id": "iswdcs9",
          "author": "dibedab",
          "body": "Thank you for the kind words. I feel so alone with the pregnancy changes, even though I know I'm not. The mentally healthiest women struggle with it. \n\n>Give yourself time. Focus on how you feel not on numbers.\n\nThat's what I'm trying to do, but it's so hard. I've always pushed myself with self hate and a strong inner critic. We are working on shutting that down in therapy. \n\nAnd we are actually talking about Shame in my next session! I'm very excited for that, an it might make the ED topic easier to unload.\n\nThank you for your input and all the best to you and your family!",
          "created_utc": 1666153888.0
        }
      ]
    },
    {
      "id": "iswikwy",
      "author": "theunfairness",
      "body": "YES. The compliments were some of the best-worst fuel. The day I weighed 99lbs was the first time my mother said I was beautiful. Look at Baby, all grown up (said with soooo much sarcasm)\n\nI know what you mean about the health consequences. I had palpitations and persistent tachycardia; my kidneys were on the outs; my hair was falling out. I was also riding some rapid-cycling barely-controlled bipolar. Inital “against my wishes” recovery included three months of inpatient psych lockdown (18 days of one-to-one suicide watch) and IOP for almost 7 months. Those were the days when “”””recovery”””” was the monster and restriction was the only thing keeping me sane. Though… I did have a therapist tell me that 20 years of restriction + “crisis anorexia” had left me with holes in my brain. That certainly wasn’t a good day.",
      "created_utc": 1666157244.0,
      "score": 2,
      "context": [
        {
          "id": "isw0arm",
          "author": "theunfairness",
          "body": "Winner winner chicken dinner. I’ve been 97lbs and 197lbs in the last five years. Right now I want my restriction monster back so badly. I’m on the couch painfully over-full from supper.",
          "created_utc": 1666146989.0
        },
        {
          "id": "iswczan",
          "author": "dibedab",
          "body": "My weight has been very similar. \n\n>Right now I want my restriction monster back so badly. \n\nI feel you on this man. At least sometimes. My 2018 health scare was very hard though lol. Sitting in a room full of old women who can't walk properly, watching a doctor's informational AD on osteoporosis before going in to get tested was a pretty strong experience. \nSo, I don't want that monster back, but I wouldn't mind some of that \"self control\" people used to compliment me on so often.",
          "created_utc": 1666153664.0
        }
      ]
    },
    {
      "id": "jeg9tkw",
      "author": "JackyG8991",
      "body": "Thank you 💜",
      "created_utc": 1680293481.0,
      "score": 1,
      "context": [
        {
          "id": "iswzt0c",
          "author": "JackyG8991",
          "body": "Oh my god. Your post is like as if I wrote it. I’ve been struggling with BED and Bulimia/Atypical Anorexia. I realized nobody cares or can do anything since I’m not extremely underweight, I can openly admit to abusing my body.\n\nI lost all my weight 2 years ago and now I gained it all back. I’m living a fucking nightmare. I just want to be thin, why is food so toxic to me? \n\nMy weight fluctuates so much because I’m either starving myself or binging. I cant control it anymore.",
          "created_utc": 1666171660.0
        },
        {
          "id": "jeep6vg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1680271057.0
        }
      ]
    },
    {
      "id": "isyv052",
      "author": "PrincessFantaGyros",
      "body": "I'm sure there must be many people with EDs around you. Maybe you can create a group? I don't know where you are, but here there are also online support groups you can join.\n\nOne thing I want to tell you: not eating will kill you much faster than eating. So it's always preferable to eat too much than to eat too little.\n\nIn my case, eating \"too much\" only happens when I restrict. And I gained the weight because my metabolism was super low due to the years of starving myself. I had to re-feed in order to get back on track.\n\nAnd if it's available to you, try medication, while making sure you have the support you need in case it triggers you. It doesn't have to be hard, even if society wants to punish us for gaining the weight.\n\nFinally, let me share my most shameful thought with you. Maybe it will help you speak about yours.\n\nI used to wish for a serious illness to make me really skinny all the time and got jealous at people with cancer because they lost all that weight. I knew it was wrong but the thoughts would not stop.",
      "created_utc": 1666204039.0,
      "score": 1,
      "context": [
        {
          "id": "isxq92f",
          "author": "PrincessFantaGyros",
          "body": "I am obese after recovering from anorexia and orthorexia. I have a very similar story, cptsd, and a mom that is still to this day chronically dieting.\n\nI've been in recovery for a while now, but last year I was told I had to lose weight in order to get surgery for my lipedema, which is very painful. That really messed with my head, but after seeing many doctors, I decided to go on ozempic. I have since lost 45 pounds, only a few pounds to go until I can do the surgery!\n\nMore importantly, ozempic has really helped me to take some of the stress out of eating. Dealing with bad insulin resistance, eating was often a matter of urgency for me. Ozempic really helped with that. I am eating fully intuitively now, and still losing weight.\n\nHowever, if ozempic had triggered my anorexia, I would definitely have prioritized recovery over the surgery.\n\nMy recommendation is finding a support group. A lot of things that were very shameful for me became ok when I was able to talk to people with similar thoughts. Interestingly, we all share the same basic thoughts in my eating disorder support group, no matter if we have anorexia, orthorexia, bulemia or binge eating disorder.",
          "created_utc": 1666187734.0
        },
        {
          "id": "isyih5i",
          "author": "dibedab",
          "body": "You sound like you're on a very great path! \n\nI know I should talk to a doctor and get an assessment, but oh man doctors are scary and i have so many excuses. I don't have a lipedema (wishing you the best for that and I hope you'll get surgery soon) but I already have heart issues and the female side of my family is prone to heart attacks. It's scary, and making an appointment is on my list. \n\nWe only have a local support group for people who are related to someone who has an ED. This post is now my first try at maybe getting some sense of not-being-alone online! And it's working.",
          "created_utc": 1666199159.0
        }
      ]
    },
    {
      "id": "isw0ufo",
      "author": "theunfairness",
      "body": "You’re right. Counselling from an ED-specialized RD is a very different set of skills and learning atmosphere. I’m very glad to hear that it helped you. \n\nI don’t mean to be a Negative Nelly. The only thing I’m trying to say is that it’s possible to have that education in your toolbox and still get stuck in the ED quagmire.",
      "created_utc": 1666147247.0,
      "score": 7,
      "context": [
        {
          "id": "isvjnxh",
          "author": "Careful_Interaction2",
          "body": "I would definitely add a registered dietitian in the mix. Maybe explaining the food science behind binging can help you understand it a little more & can help you finally kick that habit into the curb!",
          "created_utc": 1666139536.0
        },
        {
          "id": "isw00wz",
          "author": "theunfairness",
          "body": "My sister is a registered dietician. She is waaaay up in public healthcare and policy management. Our mother taught me my eating disorder—and she taught my sister, too. My disorder manifests as cyclical restriction and bingeing; my sister’s disordered behaviour manifests as monitoring *literally everybody else’s* eating habits. \n\nNutrition education isn’t magic. The answer lies in coming to terms with the gap between your emotions and your reality, no matter how disparate those two poles.",
          "created_utc": 1666146860.0
        },
        {
          "id": "isw08it",
          "author": "Careful_Interaction2",
          "body": "To me, what helped me in my recovery was the nutrition education. Separating the emotion to the science helped me realized what I was doing to my body was detrimental, it will absolutely not be for everyone, but the power of an RD goes a long way for a lot of people, especially if they specialize in ED",
          "created_utc": 1666146960.0
        }
      ]
    },
    {
      "id": "iswb546",
      "author": "dibedab",
      "body": "I'm definitely looking into it, though I don't know if my insurance would cover it. I've tried before and would have had to pay, which I can't afford. But now I have a diagnosis for anorexia and bulimia, so it might work out. \nI was actually very much in the direction of orthorexia back in 2018; thought I knew it all, that (and shame) is why I never met with the RD back then. But now I know that I have absolutely no idea what healthy eating looks like. My whole birth family is obese and my partner is a chronic undereater (by appetite, no ED). A RD would probably be very beneficial.",
      "created_utc": 1666152588.0,
      "score": 2,
      "context": [
        {
          "id": "isvjnxh",
          "author": "Careful_Interaction2",
          "body": "I would definitely add a registered dietitian in the mix. Maybe explaining the food science behind binging can help you understand it a little more & can help you finally kick that habit into the curb!",
          "created_utc": 1666139536.0
        },
        {
          "id": "isw00wz",
          "author": "theunfairness",
          "body": "My sister is a registered dietician. She is waaaay up in public healthcare and policy management. Our mother taught me my eating disorder—and she taught my sister, too. My disorder manifests as cyclical restriction and bingeing; my sister’s disordered behaviour manifests as monitoring *literally everybody else’s* eating habits. \n\nNutrition education isn’t magic. The answer lies in coming to terms with the gap between your emotions and your reality, no matter how disparate those two poles.",
          "created_utc": 1666146860.0
        },
        {
          "id": "isw08it",
          "author": "Careful_Interaction2",
          "body": "To me, what helped me in my recovery was the nutrition education. Separating the emotion to the science helped me realized what I was doing to my body was detrimental, it will absolutely not be for everyone, but the power of an RD goes a long way for a lot of people, especially if they specialize in ED",
          "created_utc": 1666146960.0
        }
      ]
    },
    {
      "id": "isyhca5",
      "author": "dibedab",
      "body": "That sounds like a very good road to be on. Thank you for your kind words! I kind of only know how to be unkind to myself so that's the first thing I oughta work on i suppose 😶",
      "created_utc": 1666198716.0,
      "score": 1,
      "context": [
        {
          "id": "isvia9u",
          "author": "tomatopotatotomato",
          "body": "I’m recovered from anorexia and my pregnancy was very triggering. I had twins so I got pretty big. Now I’m having a hard time accepting my breasts and changed stomach. You’re not alone. Self love is a forever journey. Give yourself time. Focus on how you feel not on numbers. It’s good that you’re in therapy and please know that shame is an unhelpful emotion you don’t have to listen to. In fact your shame is your greatest teacher bc it gives you clues about what hurts and where it came from. When you hear inner shame ask yourself where you first heard it. Then go back and hug that little child that sad you. ❤️",
          "created_utc": 1666138909.0
        },
        {
          "id": "iswdcs9",
          "author": "dibedab",
          "body": "Thank you for the kind words. I feel so alone with the pregnancy changes, even though I know I'm not. The mentally healthiest women struggle with it. \n\n>Give yourself time. Focus on how you feel not on numbers.\n\nThat's what I'm trying to do, but it's so hard. I've always pushed myself with self hate and a strong inner critic. We are working on shutting that down in therapy. \n\nAnd we are actually talking about Shame in my next session! I'm very excited for that, an it might make the ED topic easier to unload.\n\nThank you for your input and all the best to you and your family!",
          "created_utc": 1666153888.0
        },
        {
          "id": "isxc7uc",
          "author": "tomatopotatotomato",
          "body": "It’s been really hard for me not to relapse which took me by surprise. I’m actually tracking all my calories to make sure I don’t undereat because I really don’t want to damage my kidneys. I’m walking every day and when my app tells me to have a snack I’m sure to follow it. It can be very jarring to have something so personal (our bodies) seemingly hijacked by hormones and changes outside our consent. I was handling it mentally okay during pregnancy cause I focused on my babies getting here safe but once they were out, I noticed how unkind I was to myself.  Best of luck on your recovery ❤️❤️❤️",
          "created_utc": 1666180695.0
        }
      ]
    },
    {
      "id": "iswk5r2",
      "author": "dibedab",
      "body": "Oh man, I'm so sorry and I relate so much. My family was the same, as were my friends. Same symptoms, but I'm happy I did go inpatient on my own accounts. I've spent years of my childhood in psych wards and saw many anorexic kids die. Idek how to describe it, but I'm happy you got help and are still around.  My last in-patient stay was very much as Bipolar as you describe as well; i asked my therapist about what to do because i wanted *both*. Skinny legend life (death?) and recovery. She had the courtesy of telling me to recover or die basically. It was a very on point assessment. \n\n>Though… I did have a therapist tell me that 20 years of restriction + “crisis anorexia” had left me with holes in my brain.\n\nI feel like years of being a therapist has left some holes in their empathy. Dang man.",
      "created_utc": 1666158352.0,
      "score": 2,
      "context": [
        {
          "id": "isw0arm",
          "author": "theunfairness",
          "body": "Winner winner chicken dinner. I’ve been 97lbs and 197lbs in the last five years. Right now I want my restriction monster back so badly. I’m on the couch painfully over-full from supper.",
          "created_utc": 1666146989.0
        },
        {
          "id": "iswczan",
          "author": "dibedab",
          "body": "My weight has been very similar. \n\n>Right now I want my restriction monster back so badly. \n\nI feel you on this man. At least sometimes. My 2018 health scare was very hard though lol. Sitting in a room full of old women who can't walk properly, watching a doctor's informational AD on osteoporosis before going in to get tested was a pretty strong experience. \nSo, I don't want that monster back, but I wouldn't mind some of that \"self control\" people used to compliment me on so often.",
          "created_utc": 1666153664.0
        },
        {
          "id": "iswikwy",
          "author": "theunfairness",
          "body": "YES. The compliments were some of the best-worst fuel. The day I weighed 99lbs was the first time my mother said I was beautiful. Look at Baby, all grown up (said with soooo much sarcasm)\n\nI know what you mean about the health consequences. I had palpitations and persistent tachycardia; my kidneys were on the outs; my hair was falling out. I was also riding some rapid-cycling barely-controlled bipolar. Inital “against my wishes” recovery included three months of inpatient psych lockdown (18 days of one-to-one suicide watch) and IOP for almost 7 months. Those were the days when “”””recovery”””” was the monster and restriction was the only thing keeping me sane. Though… I did have a therapist tell me that 20 years of restriction + “crisis anorexia” had left me with holes in my brain. That certainly wasn’t a good day.",
          "created_utc": 1666157244.0
        }
      ]
    },
    {
      "id": "isw9mi0",
      "author": "dibedab",
      "body": "Before I was truly aware of my ED, I was actually planning to become a dietitian because nutrition was my strongest \"interest\" :')",
      "created_utc": 1666151712.0,
      "score": 3,
      "context": [
        {
          "id": "isvjnxh",
          "author": "Careful_Interaction2",
          "body": "I would definitely add a registered dietitian in the mix. Maybe explaining the food science behind binging can help you understand it a little more & can help you finally kick that habit into the curb!",
          "created_utc": 1666139536.0
        },
        {
          "id": "isw00wz",
          "author": "theunfairness",
          "body": "My sister is a registered dietician. She is waaaay up in public healthcare and policy management. Our mother taught me my eating disorder—and she taught my sister, too. My disorder manifests as cyclical restriction and bingeing; my sister’s disordered behaviour manifests as monitoring *literally everybody else’s* eating habits. \n\nNutrition education isn’t magic. The answer lies in coming to terms with the gap between your emotions and your reality, no matter how disparate those two poles.",
          "created_utc": 1666146860.0
        },
        {
          "id": "isw08it",
          "author": "Careful_Interaction2",
          "body": "To me, what helped me in my recovery was the nutrition education. Separating the emotion to the science helped me realized what I was doing to my body was detrimental, it will absolutely not be for everyone, but the power of an RD goes a long way for a lot of people, especially if they specialize in ED",
          "created_utc": 1666146960.0
        },
        {
          "id": "isw0ufo",
          "author": "theunfairness",
          "body": "You’re right. Counselling from an ED-specialized RD is a very different set of skills and learning atmosphere. I’m very glad to hear that it helped you. \n\nI don’t mean to be a Negative Nelly. The only thing I’m trying to say is that it’s possible to have that education in your toolbox and still get stuck in the ED quagmire.",
          "created_utc": 1666147247.0
        }
      ]
    },
    {
      "id": "isxm2wh",
      "author": "Careful_Interaction2",
      "body": "For me my insurance covered it when I went to see my PCP & he diagnosed me with bulimia. He gave me a referral & it got me covered for about 18 visits a year which wasn’t bad. Check to see how you can see a specialist in your network.",
      "created_utc": 1666185816.0,
      "score": 2,
      "context": [
        {
          "id": "isvjnxh",
          "author": "Careful_Interaction2",
          "body": "I would definitely add a registered dietitian in the mix. Maybe explaining the food science behind binging can help you understand it a little more & can help you finally kick that habit into the curb!",
          "created_utc": 1666139536.0
        },
        {
          "id": "isw00wz",
          "author": "theunfairness",
          "body": "My sister is a registered dietician. She is waaaay up in public healthcare and policy management. Our mother taught me my eating disorder—and she taught my sister, too. My disorder manifests as cyclical restriction and bingeing; my sister’s disordered behaviour manifests as monitoring *literally everybody else’s* eating habits. \n\nNutrition education isn’t magic. The answer lies in coming to terms with the gap between your emotions and your reality, no matter how disparate those two poles.",
          "created_utc": 1666146860.0
        },
        {
          "id": "isw08it",
          "author": "Careful_Interaction2",
          "body": "To me, what helped me in my recovery was the nutrition education. Separating the emotion to the science helped me realized what I was doing to my body was detrimental, it will absolutely not be for everyone, but the power of an RD goes a long way for a lot of people, especially if they specialize in ED",
          "created_utc": 1666146960.0
        },
        {
          "id": "iswb546",
          "author": "dibedab",
          "body": "I'm definitely looking into it, though I don't know if my insurance would cover it. I've tried before and would have had to pay, which I can't afford. But now I have a diagnosis for anorexia and bulimia, so it might work out. \nI was actually very much in the direction of orthorexia back in 2018; thought I knew it all, that (and shame) is why I never met with the RD back then. But now I know that I have absolutely no idea what healthy eating looks like. My whole birth family is obese and my partner is a chronic undereater (by appetite, no ED). A RD would probably be very beneficial.",
          "created_utc": 1666152588.0
        }
      ]
    }
  ]
}