{
  "id": "ycad70",
  "subreddit": "EatingDisorders",
  "author": "Chemical_Car_1217",
  "created_utc": 1666615684.0,
  "title": "is it harmful to call my gf with anorexia pretty?",
  "selftext": "Me and my gf have been going out for two months now and she doesn't know that I know about her ED. I have been trying to educate myself a lot on eating disorders so I can do whatever I can do help her from the outside, but I recently have been reading up that I shouldn't make comments about her appearance and now i'm scared that I have done damage to her because I call her pretty, perfect beautiful etc, daily. I don't know if its evoking her habits or making it worse but now i'm worried that I'm contributing, can someone who is struggling with anorexia please let me know if I am doing harm by calling her pretty? even though my compliments aren’t at all directed towards her body, rather her face and personality im scared she will take it as me commenting on her weight, which isn’t what i’m doing when i compliment her.\n\nUPDATE: its been over a year now and i couldn't be happier and more in love, we are perfect, no exaggeration. we have been working through our shit together and I can tell her relationship with food has improved so much and she seems to be so much more confident in herself, i could not be more proud of my girl, she is fucking incredible and i'm so grateful to be hers <3 my girlfriend is fucking amazing what did i do to deserve someone with a heart and soul so beautiful, not to mention every atom that makes her, she deserves the world and i would do anything to give that to her.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ycad70/is_it_harmful_to_call_my_gf_with_anorexia_pretty/",
  "score": 95,
  "num_comments": 27,
  "comments": [
    {
      "id": "itm4h1z",
      "author": "batata1001",
      "body": "I used to have anorexia, people used to comment that i got really skinny and a bit skeleton. I took it as a compliment because i reached my goal. \nCalling your gf pretty is a kind thing but it really depends on how you say it at least in my opinion. Try to flatter her with the outfit she wears, her makeup, her kindness/ precious soul. You can get creative with compliments..\nBut again, as someone who knew \"skinny\" isnt supposed to be a compliment i still took it.\nSo this is my opinion",
      "created_utc": 1666632923.0,
      "score": 66,
      "context": []
    },
    {
      "id": "itmk14e",
      "author": "One-Unit-1775",
      "body": "This is so considerate of you. \nCompliments about non physical things are always nice like her problem solving, honestly or other traits \n\nMy ex made comments like I need to use better lighting,  not to ever flex and I should get better abs. Obviously those are not helpful. \n\nI love that my bf now gives me compliments about be attracted to me",
      "created_utc": 1666638897.0,
      "score": 44,
      "context": []
    },
    {
      "id": "itme5u1",
      "author": "meIine",
      "body": "maybe try complimenting specific features. “i love your pretty smile, eyes, hair” etc. you have to separate your compliments from her ED, or else you could trigger her or even enable her.",
      "created_utc": 1666636654.0,
      "score": 62,
      "context": []
    },
    {
      "id": "itm97oo",
      "author": "kwink8",
      "body": "Once you get to a point where she feels comfortable talking w you about her ED you should totally ask her what kind of compliments she likes! She might love hearing that she’s pretty, but hearing that she’s hot could be triggering, or any other combination of words. Also, it always feels good to be complimented on non-appearance things, like my humor or my creativity, so until you’re able to talk with her about it maybe stick to non-appearance compliments!",
      "created_utc": 1666634750.0,
      "score": 12,
      "context": []
    },
    {
      "id": "itmeihw",
      "author": "NatalieALx",
      "body": "i think pretty is a tricky one because when i was deep in my anorexia i used to equate pretty and skinny eg if i was skinnier i’d be prettier, still do to an extent. so i agree with the suggestions above about using compliments that focus more on other things like ‘i like your style’, ‘i like spending time with you’ ‘you have a good sense of humour’ and so on might be better at this time.",
      "created_utc": 1666636788.0,
      "score": 10,
      "context": []
    },
    {
      "id": "itounft",
      "author": "sydneyghibli",
      "body": "Jesus Christ, you deserve the partner of the year, first off. \nSecondly, as many others are saying, target your compliments on things like her personality, her ambitions, things that do not center around her looks more or less.\n\nWhen you do compliment her looks use words like beautiful, stunning, breath taking, etc.",
      "created_utc": 1666676762.0,
      "score": 8,
      "context": []
    },
    {
      "id": "itn2rdx",
      "author": "GrittyGuacamole",
      "body": "I agree with everyone else. Complement her about things other than her physical body and thinness",
      "created_utc": 1666646130.0,
      "score": 7,
      "context": []
    },
    {
      "id": "itnla82",
      "author": "objectimpermanenceyo",
      "body": "Share your thoughts on things that cannot be perceived with the human eye: the immense qualities she has in terms of her heart, soul, spirit, and infinite being 💛",
      "created_utc": 1666654209.0,
      "score": 5,
      "context": []
    },
    {
      "id": "itnwpjc",
      "author": "None",
      "body": "From my own experience, yes it can be harmful, after loosing so much weight, telling me i look beautiful now will only make me believe i looked ugly before and drive me into Loosing more weight, at the same time i keep seeking Validation and compliments from My SO, so complimenting her on something that isn't changed with weight changes, like eye color or hair etc",
      "created_utc": 1666659286.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ito7zdc",
      "author": "None",
      "body": "No. Call her pretty! Just don’t attribute her prettiness *to* the size of her body.",
      "created_utc": 1666664155.0,
      "score": 3,
      "context": []
    },
    {
      "id": "itocxee",
      "author": "Dazzling-Okra-3346",
      "body": "First I need to say you are one hell of a person to care so much and it’s so refreshing and heartwarming to see.\n\nIn my opinion, telling her she is pretty is not a bad thing but follow up with something not related to her looks. Maybe like “i love when you’re happy and smiling, someone with a beautiful soul like yours should always smile”\n\nI agree with all the other comments but basically don’t simply comment on her body… in fact avoid it, even if she gets better, don’t comment on her body. \n\nHere are some examples:\n\nI love your hair today, it frames your face beautifully\nYou have such pretty eyes\nI love the outfit you have on, the colors really compliment you\nSeeing you smile really brightens my day\nYou have such a beautiful soul and nothing will change that\n\nI know those can sound corny, but do avoid commenting on her body. If you do though, tell her that she is beautiful not because of her body but because of who she is, and that she will always be beautiful, no matter what. \n\nIf she seeks validation from you for her body and asks things like “am i fat” ask why she thinks that. Be as supportive as you can. \n\nIm sorry if this answer wasn’t the best. I only had one significant other truly help me with my ED. He was the one that made me aware of my body dysmorphia by asking me “why do you buy clothes that are too big for you?” I remember being almost dumbfounded… and i realized i bought clothes too big because i saw myself as that. He helped me through lifting weights and eating a healthy diet of protein and veggies.  I’m not saying do that, I’m just relating my experience.",
      "created_utc": 1666666448.0,
      "score": 3,
      "context": []
    },
    {
      "id": "itogi87",
      "author": "Winter_Shine_5846",
      "body": "As someone w an ED past, getting comments on my appearance would validate what I would be doing. My best advice is to compliment on character traits (smart, kind, funny). When calling her beautiful, make sure to touch on all the non-physical aspects you love about her\n\nP.S this is so considerate of you- I hope this helps",
      "created_utc": 1666668175.0,
      "score": 3,
      "context": []
    },
    {
      "id": "itonh4m",
      "author": "being-weird",
      "body": "Hmm. This is tricky because if you stop complimenting her appearance without explanation then she might feel like she's doing something wrong. Like that she needs to lose more weight so you'll consider her attractive again.",
      "created_utc": 1666671999.0,
      "score": 3,
      "context": []
    },
    {
      "id": "itpdl73",
      "author": "lecleisen",
      "body": "It’s nice you’re trying to help. EDs are very complicated. She might be taking as a kind comment, or it might be triggering her. Tbh, I wouldn’t stop calling her pretty. Just be conscious of when and how you say it (don’t point out her parts of her body, otherwise you’d be kind of enabling it).",
      "created_utc": 1666692674.0,
      "score": 3,
      "context": []
    },
    {
      "id": "itpyt7p",
      "author": "sydneyghibli",
      "body": "Another thought would be to compliment her when she might be feeling most vulnerable too. Maybe when she’s eating? So she begins to connect love with food again.",
      "created_utc": 1666705034.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iu2rncy",
      "author": "None",
      "body": "I think your heart is in the right place and unfortunately you can't ultimately control how she feels or doesn't. She had an eating disorder before you and bless you for being so considerate. More men are needed like you in the world!\nI don't think it's bad to call her pretty but make sure to compliment her qualities and characteristics too! Like you are so smart about this subject, or I love that you are artistic, creative, caring. Etc... or I love your passion for ___. Also if she ever eats in front of you tell her she looks beautiful too!",
      "created_utc": 1666926140.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ito1msl",
      "author": "bitchontheinternet94",
      "body": "Coming from someone who has an ED. I always point out to him that the day in the kitchen when he called me pretty I was only 104. I know it's bitchy of me to kinda ruin his comment and use it against him but I can't help it and wonder why  he randomly called me pretty on one of my good skinny days",
      "created_utc": 1666661360.0,
      "score": 1,
      "context": []
    },
    {
      "id": "itp307t",
      "author": "Chemical_Car_1217",
      "body": "thank you so much for all the advice and thanks for sharing your perspective, its really eye opening, everyone under my comment has been so amazing helping me know what to do and I really appreciate  and will remember this! <3 Thank you so so much!",
      "created_utc": 1666683521.0,
      "score": 11,
      "context": [
        {
          "id": "itm4h1z",
          "author": "batata1001",
          "body": "I used to have anorexia, people used to comment that i got really skinny and a bit skeleton. I took it as a compliment because i reached my goal. \nCalling your gf pretty is a kind thing but it really depends on how you say it at least in my opinion. Try to flatter her with the outfit she wears, her makeup, her kindness/ precious soul. You can get creative with compliments..\nBut again, as someone who knew \"skinny\" isnt supposed to be a compliment i still took it.\nSo this is my opinion",
          "created_utc": 1666632923.0
        }
      ]
    },
    {
      "id": "itn7tsv",
      "author": "None",
      "body": "As someone with these issues I second this ^^",
      "created_utc": 1666648194.0,
      "score": 17,
      "context": [
        {
          "id": "itme5u1",
          "author": "meIine",
          "body": "maybe try complimenting specific features. “i love your pretty smile, eyes, hair” etc. you have to separate your compliments from her ED, or else you could trigger her or even enable her.",
          "created_utc": 1666636654.0
        }
      ]
    },
    {
      "id": "itpq9zh",
      "author": "Ari3n3tt3",
      "body": "This is the way OP",
      "created_utc": 1666700908.0,
      "score": 2,
      "context": [
        {
          "id": "itme5u1",
          "author": "meIine",
          "body": "maybe try complimenting specific features. “i love your pretty smile, eyes, hair” etc. you have to separate your compliments from her ED, or else you could trigger her or even enable her.",
          "created_utc": 1666636654.0
        }
      ]
    },
    {
      "id": "itpe0u9",
      "author": "Chemical_Car_1217",
      "body": "Thanks so much for your advice and you are so sweet, I just wanna make sure i'm doing as best as I can to support her :) thanks for the suggestions I really appreciate it so much!",
      "created_utc": 1666693024.0,
      "score": 2,
      "context": [
        {
          "id": "itounft",
          "author": "sydneyghibli",
          "body": "Jesus Christ, you deserve the partner of the year, first off. \nSecondly, as many others are saying, target your compliments on things like her personality, her ambitions, things that do not center around her looks more or less.\n\nWhen you do compliment her looks use words like beautiful, stunning, breath taking, etc.",
          "created_utc": 1666676762.0
        }
      ]
    },
    {
      "id": "ito891f",
      "author": "Chemical_Car_1217",
      "body": "thanks so much, my complements were never centred around or towards her physical body but rather her face and personality i will be more specific now!!",
      "created_utc": 1666664278.0,
      "score": 2,
      "context": [
        {
          "id": "itn2rdx",
          "author": "GrittyGuacamole",
          "body": "I agree with everyone else. Complement her about things other than her physical body and thinness",
          "created_utc": 1666646130.0
        }
      ]
    },
    {
      "id": "ito636z",
      "author": "Chemical_Car_1217",
      "body": "thank you so much, i am gonna be more specific on my compliments now so she knows that her weight isn’t why i think she is beautiful, all my compliments have always been centred around her face and personality but i’m scared she will take it as me commenting on her weight",
      "created_utc": 1666663294.0,
      "score": 2,
      "context": [
        {
          "id": "itnwpjc",
          "author": "None",
          "body": "From my own experience, yes it can be harmful, after loosing so much weight, telling me i look beautiful now will only make me believe i looked ugly before and drive me into Loosing more weight, at the same time i keep seeking Validation and compliments from My SO, so complimenting her on something that isn't changed with weight changes, like eye color or hair etc",
          "created_utc": 1666659286.0
        }
      ]
    },
    {
      "id": "itp2sez",
      "author": "Chemical_Car_1217",
      "body": "oh my gosh thank you so much, seriously everyone under this comment has been so helpful and I feel so relieved and happy that I know what to do now, i've honestly been super stressed about this recently and im so glad that I know what to do and how to adequately show my appreciation and love for her without triggering something. you all are so amazing thank you thank you thank you!!!",
      "created_utc": 1666683337.0,
      "score": 3,
      "context": [
        {
          "id": "itocxee",
          "author": "Dazzling-Okra-3346",
          "body": "First I need to say you are one hell of a person to care so much and it’s so refreshing and heartwarming to see.\n\nIn my opinion, telling her she is pretty is not a bad thing but follow up with something not related to her looks. Maybe like “i love when you’re happy and smiling, someone with a beautiful soul like yours should always smile”\n\nI agree with all the other comments but basically don’t simply comment on her body… in fact avoid it, even if she gets better, don’t comment on her body. \n\nHere are some examples:\n\nI love your hair today, it frames your face beautifully\nYou have such pretty eyes\nI love the outfit you have on, the colors really compliment you\nSeeing you smile really brightens my day\nYou have such a beautiful soul and nothing will change that\n\nI know those can sound corny, but do avoid commenting on her body. If you do though, tell her that she is beautiful not because of her body but because of who she is, and that she will always be beautiful, no matter what. \n\nIf she seeks validation from you for her body and asks things like “am i fat” ask why she thinks that. Be as supportive as you can. \n\nIm sorry if this answer wasn’t the best. I only had one significant other truly help me with my ED. He was the one that made me aware of my body dysmorphia by asking me “why do you buy clothes that are too big for you?” I remember being almost dumbfounded… and i realized i bought clothes too big because i saw myself as that. He helped me through lifting weights and eating a healthy diet of protein and veggies.  I’m not saying do that, I’m just relating my experience.",
          "created_utc": 1666666448.0
        }
      ]
    },
    {
      "id": "itpdsca",
      "author": "Chemical_Car_1217",
      "body": "of course, I always make it a point to never introduce her body as a staple of a compliment because the last thing I want to do is trigger her, obviously I have no concept of what she is thinking  but  based on her reactions and responses it doesn't seem to be harmful, but you never know so I just want to be extra careful and make sure she knows that i'm complimenting who she is. Thanks so much for the advice! <3 <3",
      "created_utc": 1666692836.0,
      "score": 2,
      "context": [
        {
          "id": "itpdl73",
          "author": "lecleisen",
          "body": "It’s nice you’re trying to help. EDs are very complicated. She might be taking as a kind comment, or it might be triggering her. Tbh, I wouldn’t stop calling her pretty. Just be conscious of when and how you say it (don’t point out her parts of her body, otherwise you’d be kind of enabling it).",
          "created_utc": 1666692674.0
        }
      ]
    },
    {
      "id": "iu4m14b",
      "author": "Chemical_Car_1217",
      "body": "oh i'm a women haha, but still thank you so much and I will make note of this :) <3",
      "created_utc": 1666968433.0,
      "score": 1,
      "context": [
        {
          "id": "iu2rncy",
          "author": "None",
          "body": "I think your heart is in the right place and unfortunately you can't ultimately control how she feels or doesn't. She had an eating disorder before you and bless you for being so considerate. More men are needed like you in the world!\nI don't think it's bad to call her pretty but make sure to compliment her qualities and characteristics too! Like you are so smart about this subject, or I love that you are artistic, creative, caring. Etc... or I love your passion for ___. Also if she ever eats in front of you tell her she looks beautiful too!",
          "created_utc": 1666926140.0
        }
      ]
    },
    {
      "id": "itt6or9",
      "author": "dizzyk1tty",
      "body": "Not wrong",
      "created_utc": 1666753208.0,
      "score": 2,
      "context": [
        {
          "id": "itme5u1",
          "author": "meIine",
          "body": "maybe try complimenting specific features. “i love your pretty smile, eyes, hair” etc. you have to separate your compliments from her ED, or else you could trigger her or even enable her.",
          "created_utc": 1666636654.0
        },
        {
          "id": "itpq9zh",
          "author": "Ari3n3tt3",
          "body": "This is the way OP",
          "created_utc": 1666700908.0
        }
      ]
    }
  ]
}