{
  "id": "yfc1il",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1666926287.0,
  "title": "Why is bulimia harmful? Been struggling lately and need some reminders about how dangerous/ bad it is.",
  "selftext": "Struggling with a lot of purging lately and feeling defeated. Need some reminders about how this disease is bad.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/yfc1il/why_is_bulimia_harmful_been_struggling_lately_and/",
  "score": 64,
  "num_comments": 51,
  "comments": [
    {
      "id": "iu2xo58",
      "author": "amberxfinley",
      "body": "It's not fun when you start vomiting blood. The injuries you cause your esophagus now, may not show until years later. It's not worth the damage to your teeth or the obsession of needing to dispose of your food in this way. Life sucks wether you're fat or skinny. You're worth more than a number on a scale.",
      "created_utc": 1666929296.0,
      "score": 66,
      "context": []
    },
    {
      "id": "iu2u08j",
      "author": "disapointits",
      "body": "Hey lovely lady. It destroys your teeth. Weight changes all the time, you can NEVER get your teeth back. And if you feel like nothing is uglier then being fat then imagine how you would feel if you had to have all your teeth removed because of the damage. Ily. You’re beautiful. Just digest the food, sit through the discomfort and ease it the best way you can. Distract yourself until you can’t feel the food in your stomach anymore. Sorry you’re going through it❤️",
      "created_utc": 1666927335.0,
      "score": 49,
      "context": []
    },
    {
      "id": "iu2z6rf",
      "author": "cinnamondaisies",
      "body": "Along with restriction it really messed up my general gut health. I can’t digest things properly, which results in bloating and stomach cramps and has made both trying to eat normally AND trying to restrict difficult and painful emotionally and physically. \nI still get tachycardia (really fast heartbeat) after a year of being nearly purge free. \n\nI have mixed feelings about saying this but…a lot of the time purging leads to weight gain anyhow. Plus you’re messing up your body in ways you mightn’t see for months to come. \n\nEven at my worst in terms of disordered thinking I always regretted not getting intervention for my bulimia sooner, it completely derailed my life in a way that my prior anorexia hadn’t",
      "created_utc": 1666930166.0,
      "score": 22,
      "context": []
    },
    {
      "id": "iu3m78k",
      "author": "Tabby_Road",
      "body": "I nearly had a seizure once. Had just finished vomiting and my head just started shaking uncontrollably\n\nMy teeth are fucked. \n\nMy gut health is a mess\n\nI lost my period and it hasn't come back yet. Could be BC related but it's been 10 months\n\nMatabolism is a mess.",
      "created_utc": 1666947774.0,
      "score": 11,
      "context": []
    },
    {
      "id": "iu2u1ay",
      "author": "janejohnson1989",
      "body": "Destroys your teeth and esophagus, look up Barrett’s esophagus.",
      "created_utc": 1666927350.0,
      "score": 11,
      "context": []
    },
    {
      "id": "iu31ylp",
      "author": "emimagique",
      "body": "I hope I'm not being too harsh here but it can throw your electrolyte balance off and literally kill you. I hope you will be able to get better. I really recommend the book overcoming binge eating!",
      "created_utc": 1666931861.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iu3eq5f",
      "author": "GRILLEDemmy-CHEEESE",
      "body": "It’s never fun when you vomit up blood and mess up your internal organs",
      "created_utc": 1666941267.0,
      "score": 7,
      "context": []
    },
    {
      "id": "iu3lm30",
      "author": "Pandatoke",
      "body": "My teeth are destroyed \n\nMy relationship with food is changed\n\nI lost my period at my worst.",
      "created_utc": 1666947248.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iu3n05z",
      "author": "catsandsets",
      "body": "Years later my esophagus is still fucked. Every time I'm ill with stomach issues, the pain is unbearable. It's not worth it. Also it swells your face, it doesn't look good. None of it is worth it.",
      "created_utc": 1666948488.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iu575gb",
      "author": "Spaghettiliebe",
      "body": "I lost all sense of taste after even just a couple of weeks… so I was super excited to eat something without the fear of gaining weight, right? Wrong! You have a craving, it tasted like ass, you feel the guilt of eating and then purge just to feel completely exhausted afterwards and to have the craving again not to long after and then you eat again and at one point you just cant purge properly anymore cause your stomach just hurts so bad and also you lack all energy which just results in weight gain anyways … it is honestly one of the most unrewarding ed-cycles i have ever been in",
      "created_utc": 1666976896.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iu3pelm",
      "author": "CupboardOfPandas",
      "body": "My teeth are destroyed and I developed heart issues from lack of salt/minerals/I don't remember. Dieing of an heart attack bent over a toilet isn't that tempting.\n\nAlso sooner rather than later you are going to wreck your digestive system completely, and might die from that as well.\n\nIf that's not enough you are just going further and further down a spiral which will make suicide very tempting.",
      "created_utc": 1666950513.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu3wbl2",
      "author": "redbradbury",
      "body": "Puking up your chewed food is disgusting. There’s no other way to say it.",
      "created_utc": 1666955683.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu3zfkx",
      "author": "dairyperson",
      "body": "It really messed with your gag reflex and I don't think it matters about how bad it is if you believe it something thats helping you but if you're reaching out to remind yourself how bad it is that means deep down you don't really want to be like that and you think you deserve the help and you do deserve the help. Thank you for asking for help. You are not the exception to recovery",
      "created_utc": 1666957632.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu46i2v",
      "author": "losingleighann",
      "body": "This is something I found out because it happened to me ! I developed TMJ. My jaw is permanently out of place. Sometimes opening it conversation level makes it pop, fully opening my mouth makes it pop. It locks my jaw up and sometimes I can’t open it enough to even brush my teeth. There is no cure for TMJ and even trying to just get your jaw realigned to some degree at the dentist is over 2 grand",
      "created_utc": 1666961519.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu48frp",
      "author": "None",
      "body": "I’m bulimic and my throat has been hurting for months since my relapse. My father in law is dying a gnarly death due to esophageal cancer and i read that bulimics are 6 times more likely to get this. It’s pretty awful what he’s going through (he wasn’t bulimic but suffered from untreated chronic reflux -stomach acids ruined his esophagus and he had to get it removed. He’s only 50 and he’s been in treatment and given only a year to live) he can’t eat. Anytime he eats he involuntarily vomits. He’s almost choked to death twice in his sleep in the last month. He’s skinny as a rake and won’t live much longer. His kids are in their 20s and are suffering just as much, emotionally. I just keep thinking, am I gonna end up like this too if I don’t stop? Are my kids gonna be young having to experience me dying a painful death? Still can’t seem to stop no matter how hard I try. But maybe if I keep telling myself and keep trying. Good luck to you, you’re not alone. Try to stick with a meal plan and work with your therapist (if you don’t have a team I urge you to get into therapy. It’s a long way to the top but it can help, feeling supported). You’re not alone ❤️",
      "created_utc": 1666962469.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu4hv1w",
      "author": "Glorificus42",
      "body": "Jacked up my teeth & permanent Russell's Sign scarring on knuckles, even after quitting.\n\nIf you absolutely must engage in taste it twice behaviour, don't brush your teeth right after, as it rubs stomach acid into the enamel.\n\nInvest in weapons grade fluoride & enamel repair toothpaste to give your teeth a better chance of surviving.",
      "created_utc": 1666966698.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu4rh4z",
      "author": "mandy_miss",
      "body": "In addition to what people here said, I have very sensitive acid reflux now. And OTC meds don’t do squat. It’s been ~7 years since I’ve regularly purged, so It’s not going to resolve.",
      "created_utc": 1666970648.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu50dhd",
      "author": "bear_sees_the_car",
      "body": "Literally decays your teeth. Do you want to be toothless or have to use old lady jaws in a cup?\n\nThere is no way to fix teeth after a certain stage, even if you have a ton of money.",
      "created_utc": 1666974216.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu5qmz9",
      "author": "One-Unit-1775",
      "body": "Imagine how much dental work you will need done when you need new teeth? I just saw a picture in class- look up photos of teeth.....and what it does......your oral health is soooo important.",
      "created_utc": 1666984767.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu5teys",
      "author": "stoneykate",
      "body": "It took me many years for my stomach to digest food normally. Gastroparesis and constipation were the main issues. And the amount of cavities I have from the stomach acid (I always took really good care of my teeth). You can only do so much harm reduction for your oral health, it is still going to cause lasting damage. And dental work sucks…expensive, painful and stressful. \nIt also really messes up your electrolytes. Out of nowhere, heart issues can come up because of it.",
      "created_utc": 1666985909.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu69uns",
      "author": "sjkyr400",
      "body": "It messes with your heat rhythm because it causes electrolyte imbalance. It ravages the enamel off your teeth too. I’m 3 years in recovery and had it off and on for over 20. No joke. Please get help. It takes a lot, but complete recovery is possible.",
      "created_utc": 1666992846.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu6cjgk",
      "author": "Dizzy-cat13",
      "body": "I’ve suffered with this for 10 years and I’m a shell of the person I once was. My teeth have fallen out, my voice is permanently hoarse, I’ve lost all bowel function and my heart beats out of my chest sometimes I’m sure I’m going to die. It’s such a cruel destructive illness I’m so sorry you have to experience it, i know it’s hard but I hope you can stay strong my love. 💚",
      "created_utc": 1666994034.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu6dak0",
      "author": "SignificantAd9951",
      "body": "When I started recovery, I had to take meds to suppress my reflex because my body started rejecting food. My teeth is rotten and I had to undergo 2 root canals which costs quite a lot of money in my country. The worst is that my intestine is torn from constant purging so I cant do heavy exercise nor eat properly. Bulimia is the worst.",
      "created_utc": 1666994370.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu70ths",
      "author": "roseybuds88",
      "body": "I’m 25 and my dental health is so far gone . I’ve already being going to a dentist for awhile and it’s just so painful and expensive and my teeth are so weak  and sensitive:( so much money and pain and my teeth are still beyond sensitive .",
      "created_utc": 1667005673.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu791nh",
      "author": "MxLittleLuna",
      "body": "My ex girlfriend was bulimic. She has GI issues and ended up having some of her teeth fall out. You deserve a healthy, good life. You deserve to enjoy food and not feel shame and guilt. I know it’s so hard but we’re here for you. 💓",
      "created_utc": 1667009739.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu9yl8p",
      "author": "cinnamoslut",
      "body": "My cousin struggled with bulimia as a teenager. She had been recovered for a couple years in her mid-20s, when she died randomly in her sleep. I heard from my parents that it was because her heart was so damaged from the years of bulimia.",
      "created_utc": 1667068305.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iug1jmq",
      "author": "uhhhyeahh_",
      "body": "After years od being bulimic I developed acid reflux, I can't eat many foods because of the discomfort they cause me, I have constant heartburn, my doctor said I might develop ulcers in the future, I've been bulimic for years, my weight never dropped severely and when it did a bit it caused me to loose all my muscles and made me feel even weaker, I've dealt with chest pains, near fainting, lack of energy, I ignored all of it but when I started vomiting blood it really was no fun, I also nearly choked on my vomit while purging in a state of over exhaustion and feeling my heart get really weak, white noise in my ears being seconds from fainting choking on my own vomit, realllyyy not worth it",
      "created_utc": 1667178950.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iu3jkck",
      "author": "Ok_Coffee1701",
      "body": "Oh brother.",
      "created_utc": 1666945450.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iu3o7mu",
      "author": "burnerphonepost",
      "body": "Spent over $2000 on teeth. Still have work to do. Always get colds and they immediately go to my chest. Broke something in my sinuses from too much purging. Throwing up blood, and the constant force causes bloody nose. Scare on my fingers from biting. Constant very bad pimples around my mouth. Terrible relationship with food.",
      "created_utc": 1666949524.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iu41qm8",
      "author": "whatsupjupiter",
      "body": "When you throw up you’re throwing up stomach acid which can burn your throat out.",
      "created_utc": 1666958979.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iu45q0a",
      "author": "Awhoknew",
      "body": "I’m sorry you’re struggling but really proud of you for making this post! Purging is incredibly dangerous as many have pointed out. I’m not sure if this has been explicitly said yet but your heart can stop from purging because of the extreme stress that’s put on the body from using that behavior. It also messes with your potassium, magnesium, and other important blood levels that regulate your heart and can also cause it to stop when the levels are too low from purging. There are so many other costs of purging as others have pointed out. Please, please try to hear us. EDs have the highest mortality rate next to opioid addiction, and while we often don’t think it’ll happen to us, we have no way of knowing or doing anything once it’s too late. I apologize if this is too morbid but I’ve lost too many people to EDs (including someone quite young less than 2 weeks ago) and even though I don’t know you, it would break my heart if the world lost you to one too. Sending you love and resiliency, OP! You deserve recovery 💜",
      "created_utc": 1666961125.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iu5638b",
      "author": "klaqua",
      "body": "My Cousin died from it after years of struggling with it. Her Organs shut down and it was a horrible way to go that left her parents and her kids with questions and doubt nobody should have to face for a loved one.",
      "created_utc": 1666976478.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iu6oho5",
      "author": "None",
      "body": "When you purge and binge the pressure in your stomach flattens out the veins and inhibits circulation around the stomach. This can cause it to rupture the next time you have a particularly bad episode. The septic shock from all the stomach contents entering the abdominal cavity would kill you within seconds. That is what happened to this girl.\n\nhttps://www.reddit.com/r/eyeblech/comments/qtkood/19_yo_dies_from_gastric_rupture_due_to_bulimic/?utm_medium=android_app&utm_source=share\n\nI personally used to purge by forcing the food out of my stomach rather than an upchuck reflex so I was particularly afraid of this sort of thing. I'm also a male in my 30s so it can happen to anyone. I haven't had issues with this for a few years.",
      "created_utc": 1666999651.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iu6pt4r",
      "author": "None",
      "body": "The gut problems you'll have later makes life tougher because pain and reflux are things that become way more drastic that you can't do things with concentration. Also constipation.\n\nBeing someone with an eating disorder is hard and while you do that it's frustrating to feel that way.",
      "created_utc": 1667000301.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iu6ydk4",
      "author": "bashalash",
      "body": "Eating disorders have the highest morbidity rate of any mental illness. I am 8 years recovered, and barely in my 30s. The damage to your organs is real. I genuinely believe i will have a heart attack, and kind of soon.. I fear I will miss out on children, marriage, and having a home... because eating disorders kill people and damage your body LONG TERM. Psychologically, the damage persists. Love yourself. It's okay to slip up. But be honest with yourself. Scare yourself into quitting. You got it.",
      "created_utc": 1667004484.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iu78rfx",
      "author": "Anaxiety1762",
      "body": "It can destroy your stomach digestion, your throat can burn from the stomach acid, hair loss, and rotting teething",
      "created_utc": 1667009598.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iu7djaf",
      "author": "emmabella614",
      "body": "Dental work is expensive, purging and malnutrition fuck up your teeth\n\nI’m dealing with this now and it sucks and is so expensivene\n\nSave your future coin",
      "created_utc": 1667012040.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ium1bj3",
      "author": "cutiernjenn",
      "body": "Because you are throwing up hydrochloric acid...duh",
      "created_utc": 1667301617.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuvth5a",
      "author": "None",
      "body": "Expensive.\nExhausting.\nDon't have time to develop skills or hobbies.\n\nI think I did something to my vocal chords because I'm told I sound like a smoker.\n\nFucked up the iron in my body. Only had 20% I was supposed to last time it was checked.\n\nI had acid reflux for the first 18 months of slowing down not even stopping. Had to take antacids before bed because my body had produced it in anticipation of the binge.",
      "created_utc": 1667476814.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iwtjosy",
      "author": "Redskysflame",
      "body": "Hydrochloric acid is corrosive to lining of esophagus. \n\nOh ya and it can take the enamel clean off your teeth. \n\nAs a RN at a private Eating Disorder hospital for the past 6 years \nI have met women in their 20s and 30s with full set dentures top and bottom \n\nThen there’s the electrical impulses that beat your heart, at any time you could have a MI (heart attack) bc your Potassium is dangerously out of range \n\nSht I hate how I lecture on and on.  \n\nTL;dr \nBulimia - it’s god damn dangerous",
      "created_utc": 1668751546.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iwtjzog",
      "author": "Redskysflame",
      "body": "NEDA. (800) 931-2237",
      "created_utc": 1668751760.0,
      "score": 1,
      "context": []
    },
    {
      "id": "izsucg0",
      "author": "Trippyhippie0978",
      "body": "Hypokalemia is not it amd causes your muscles to cramp eventually your heart gives out and you die give it up jow before its too late i beg currently goung through treatments and taking sandok so i have enouvh Potassium in me and it is not a vibe i cant lie",
      "created_utc": 1670776087.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iu3e2gy",
      "author": "Aggravating_Lead_616",
      "body": "This happened to me once and it wasn’t even that much and I noped out so fast. I know I probably could have died that day or if I continued. That was like a year ago and I am now 60 pounds heavier and now obese but that is because I’m s stubborn and refuse help AND I’m extremely picky so my diet consists of chicken nuggets, sprite, and burgers 🙂 sometimes I regret it sometimes I don’t. But I’m so happy I never ruined my teeth because that is my worst insecurity already as is. I was also scared because of that girl who died because her stomach ruptured and she died alone slumped over a toilet covered in vomit. That’s not how I want to go… that scared me so much lol.",
      "created_utc": 1666940712.0,
      "score": 11,
      "context": [
        {
          "id": "iu2xo58",
          "author": "amberxfinley",
          "body": "It's not fun when you start vomiting blood. The injuries you cause your esophagus now, may not show until years later. It's not worth the damage to your teeth or the obsession of needing to dispose of your food in this way. Life sucks wether you're fat or skinny. You're worth more than a number on a scale.",
          "created_utc": 1666929296.0
        }
      ]
    },
    {
      "id": "iu78se3",
      "author": "MxLittleLuna",
      "body": "(Hugs) Thank you for sharing and supporting. You are brave.",
      "created_utc": 1667009611.0,
      "score": 3,
      "context": [
        {
          "id": "iu2xo58",
          "author": "amberxfinley",
          "body": "It's not fun when you start vomiting blood. The injuries you cause your esophagus now, may not show until years later. It's not worth the damage to your teeth or the obsession of needing to dispose of your food in this way. Life sucks wether you're fat or skinny. You're worth more than a number on a scale.",
          "created_utc": 1666929296.0
        }
      ]
    },
    {
      "id": "iu3dfvi",
      "author": "None",
      "body": "1. This was very very well said. You worded that so great and so true.\n\n2. Your username is great lmao",
      "created_utc": 1666940190.0,
      "score": 15,
      "context": [
        {
          "id": "iu2u08j",
          "author": "disapointits",
          "body": "Hey lovely lady. It destroys your teeth. Weight changes all the time, you can NEVER get your teeth back. And if you feel like nothing is uglier then being fat then imagine how you would feel if you had to have all your teeth removed because of the damage. Ily. You’re beautiful. Just digest the food, sit through the discomfort and ease it the best way you can. Distract yourself until you can’t feel the food in your stomach anymore. Sorry you’re going through it❤️",
          "created_utc": 1666927335.0
        }
      ]
    },
    {
      "id": "iu3nytd",
      "author": "delilahrey",
      "body": "Does having your damaged teeth removed make you ugly?",
      "created_utc": 1666949315.0,
      "score": 0,
      "context": [
        {
          "id": "iu2u08j",
          "author": "disapointits",
          "body": "Hey lovely lady. It destroys your teeth. Weight changes all the time, you can NEVER get your teeth back. And if you feel like nothing is uglier then being fat then imagine how you would feel if you had to have all your teeth removed because of the damage. Ily. You’re beautiful. Just digest the food, sit through the discomfort and ease it the best way you can. Distract yourself until you can’t feel the food in your stomach anymore. Sorry you’re going through it❤️",
          "created_utc": 1666927335.0
        }
      ]
    },
    {
      "id": "iu6s35b",
      "author": "salmonellatyphirium",
      "body": "How old was she? Curious cuz also struggling",
      "created_utc": 1667001422.0,
      "score": 1,
      "context": [
        {
          "id": "iu5638b",
          "author": "klaqua",
          "body": "My Cousin died from it after years of struggling with it. Her Organs shut down and it was a horrible way to go that left her parents and her kids with questions and doubt nobody should have to face for a loved one.",
          "created_utc": 1666976478.0
        }
      ]
    },
    {
      "id": "iu49gb0",
      "author": "amberxfinley",
      "body": "I was 14 when this happened to me. I'm 33 now. The obsession I carried went way far beyond I'd ever imagine. It didn't stop for me though. Since then, I've turned to orthorexia, anorexia and just completely destroyed my body, mind and health. You don't want to be my age with little ones looking up to you with those distortions. It's a horrible mind frame I wouldn't wish on my enemy. I'm happy you chose to not continue with this lifestyle. Chicken nuggets, sprite and burgers are incredible and should be enjoyed without the fear of it harming your body. Weight can change a lot faster than those mindsets. I hope OP reads these and sees the love from strangers whose been in their shoes. It's nice to know you're not alone in a world that feels so lonely at times ❤️",
      "created_utc": 1666962951.0,
      "score": 7,
      "context": [
        {
          "id": "iu2xo58",
          "author": "amberxfinley",
          "body": "It's not fun when you start vomiting blood. The injuries you cause your esophagus now, may not show until years later. It's not worth the damage to your teeth or the obsession of needing to dispose of your food in this way. Life sucks wether you're fat or skinny. You're worth more than a number on a scale.",
          "created_utc": 1666929296.0
        },
        {
          "id": "iu3e2gy",
          "author": "Aggravating_Lead_616",
          "body": "This happened to me once and it wasn’t even that much and I noped out so fast. I know I probably could have died that day or if I continued. That was like a year ago and I am now 60 pounds heavier and now obese but that is because I’m s stubborn and refuse help AND I’m extremely picky so my diet consists of chicken nuggets, sprite, and burgers 🙂 sometimes I regret it sometimes I don’t. But I’m so happy I never ruined my teeth because that is my worst insecurity already as is. I was also scared because of that girl who died because her stomach ruptured and she died alone slumped over a toilet covered in vomit. That’s not how I want to go… that scared me so much lol.",
          "created_utc": 1666940712.0
        }
      ]
    },
    {
      "id": "iu79soc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1667010115.0,
      "score": 1,
      "context": [
        {
          "id": "iu2u08j",
          "author": "disapointits",
          "body": "Hey lovely lady. It destroys your teeth. Weight changes all the time, you can NEVER get your teeth back. And if you feel like nothing is uglier then being fat then imagine how you would feel if you had to have all your teeth removed because of the damage. Ily. You’re beautiful. Just digest the food, sit through the discomfort and ease it the best way you can. Distract yourself until you can’t feel the food in your stomach anymore. Sorry you’re going through it❤️",
          "created_utc": 1666927335.0
        },
        {
          "id": "iu3nytd",
          "author": "delilahrey",
          "body": "Does having your damaged teeth removed make you ugly?",
          "created_utc": 1666949315.0
        }
      ]
    },
    {
      "id": "iu7svyg",
      "author": "klaqua",
      "body": "She was mid 30.\n\nThis was about 3 years before she died [https://freeimage.host/i/boww4j](https://freeimage.host/i/boww4j)",
      "created_utc": 1667021687.0,
      "score": 1,
      "context": [
        {
          "id": "iu5638b",
          "author": "klaqua",
          "body": "My Cousin died from it after years of struggling with it. Her Organs shut down and it was a horrible way to go that left her parents and her kids with questions and doubt nobody should have to face for a loved one.",
          "created_utc": 1666976478.0
        },
        {
          "id": "iu6s35b",
          "author": "salmonellatyphirium",
          "body": "How old was she? Curious cuz also struggling",
          "created_utc": 1667001422.0
        }
      ]
    },
    {
      "id": "iug4kdw",
      "author": "Aggravating_Lead_616",
      "body": "I know, I thought about how I would be restricting in a god damn nursing home because of those damn calories, but it’s so hard cause maybe my mom would love me if I was skinny. She wasn’t as mean to me when I was skinny… I mean j don’t really have an eating disorder and wouldn’t fit a criteria for any because I stopped “fasting” and stopped purging. Sometimes I want to start again because of other reasons. I don’t want to make this too triggering lol. It just sucks. Im only almost 16 and have to deal with my mom still after that because she tries to help but goes about it wrong I guess idk",
      "created_utc": 1667180358.0,
      "score": 2,
      "context": [
        {
          "id": "iu2xo58",
          "author": "amberxfinley",
          "body": "It's not fun when you start vomiting blood. The injuries you cause your esophagus now, may not show until years later. It's not worth the damage to your teeth or the obsession of needing to dispose of your food in this way. Life sucks wether you're fat or skinny. You're worth more than a number on a scale.",
          "created_utc": 1666929296.0
        },
        {
          "id": "iu3e2gy",
          "author": "Aggravating_Lead_616",
          "body": "This happened to me once and it wasn’t even that much and I noped out so fast. I know I probably could have died that day or if I continued. That was like a year ago and I am now 60 pounds heavier and now obese but that is because I’m s stubborn and refuse help AND I’m extremely picky so my diet consists of chicken nuggets, sprite, and burgers 🙂 sometimes I regret it sometimes I don’t. But I’m so happy I never ruined my teeth because that is my worst insecurity already as is. I was also scared because of that girl who died because her stomach ruptured and she died alone slumped over a toilet covered in vomit. That’s not how I want to go… that scared me so much lol.",
          "created_utc": 1666940712.0
        },
        {
          "id": "iu49gb0",
          "author": "amberxfinley",
          "body": "I was 14 when this happened to me. I'm 33 now. The obsession I carried went way far beyond I'd ever imagine. It didn't stop for me though. Since then, I've turned to orthorexia, anorexia and just completely destroyed my body, mind and health. You don't want to be my age with little ones looking up to you with those distortions. It's a horrible mind frame I wouldn't wish on my enemy. I'm happy you chose to not continue with this lifestyle. Chicken nuggets, sprite and burgers are incredible and should be enjoyed without the fear of it harming your body. Weight can change a lot faster than those mindsets. I hope OP reads these and sees the love from strangers whose been in their shoes. It's nice to know you're not alone in a world that feels so lonely at times ❤️",
          "created_utc": 1666962951.0
        }
      ]
    },
    {
      "id": "iu82x0g",
      "author": "delilahrey",
      "body": "Yes, I have experienced it. 15 years of bulimia will do that.",
      "created_utc": 1667030210.0,
      "score": 1,
      "context": [
        {
          "id": "iu2u08j",
          "author": "disapointits",
          "body": "Hey lovely lady. It destroys your teeth. Weight changes all the time, you can NEVER get your teeth back. And if you feel like nothing is uglier then being fat then imagine how you would feel if you had to have all your teeth removed because of the damage. Ily. You’re beautiful. Just digest the food, sit through the discomfort and ease it the best way you can. Distract yourself until you can’t feel the food in your stomach anymore. Sorry you’re going through it❤️",
          "created_utc": 1666927335.0
        },
        {
          "id": "iu3nytd",
          "author": "delilahrey",
          "body": "Does having your damaged teeth removed make you ugly?",
          "created_utc": 1666949315.0
        },
        {
          "id": "iu79soc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667010115.0
        }
      ]
    }
  ]
}