{
  "id": "yjikdq",
  "subreddit": "EatingDisorders",
  "author": "Hotbroth",
  "created_utc": 1667330882.0,
  "title": "Was “going vegan” a stepping stone into your eating disorder?",
  "selftext": "Someone told me recently that “most people with eating disorders start off by going vegan” and I’m curious what y’all think.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/yjikdq/was_going_vegan_a_stepping_stone_into_your_eating/",
  "score": 86,
  "num_comments": 67,
  "comments": [
    {
      "id": "iuos1i4",
      "author": "JustabitLii",
      "body": "My stepping stone was intermittent fasting.",
      "created_utc": 1667342631.0,
      "score": 68,
      "context": []
    },
    {
      "id": "iuoq9dv",
      "author": "LloydSatan",
      "body": "Honestly the reason I became vegan 10 yrs ago was so I could restrict in the open and ppl couldn’t accuse me of having an ED or pressure me into eating when I didn’t want to. It was an easy excuse to say no 2 eating. Saying that - 10 yrs later - being vegan actually really helped me heal and have a better grasp on my ED and has helped me live a healthier lifestyle - like I can restrict but in a healthy way vs being in a toxic cycle. It is interesting starting this way tho bcuz caring about animals and environmental impacts of not being vegan became more important and a part of the reason I’m vegan later into my journey of veganism. Lol sorry I’m rambling.",
      "created_utc": 1667341880.0,
      "score": 31,
      "context": []
    },
    {
      "id": "iupei59",
      "author": "Queenfanforever",
      "body": "I am a vegan but it actually helped me in healing",
      "created_utc": 1667352242.0,
      "score": 23,
      "context": []
    },
    {
      "id": "iuqpzhi",
      "author": "moonie52",
      "body": "i want to remind everyone under this post that veganism is NOT a diet, it’s a lifestyle and a moral philosophy. you should use the term plant-based since restricting has nothing to do with the vegan view on food.",
      "created_utc": 1667383680.0,
      "score": 17,
      "context": []
    },
    {
      "id": "iuojzgc",
      "author": "maybsnot",
      "body": "I don’t necessarily think it’s that veganism is a stepping stone to disordered eating but rather people who are already prone to disordered eating can find it easier to latch onto more extreme diets and use veganism as an excuse to cut out large food groups, without the social ramifications. On one hand it might just be that someone with disordered eating can latch onto food rules easier and may find peace in protocols like veganism. On the other, following a specific diet is also less alarming - “oh it’s not that I’m not eating it’s just that there’s not a good vegan option right now”",
      "created_utc": 1667339336.0,
      "score": 41,
      "context": []
    },
    {
      "id": "iuofl6u",
      "author": "koekerond",
      "body": "Not a vegan but becoming a vegetarian was a stepping stone in my eating disorder. It was so easy and there were more and more items of food that I erased from my diet.",
      "created_utc": 1667337589.0,
      "score": 46,
      "context": []
    },
    {
      "id": "iupq190",
      "author": "None",
      "body": "Going vegan actually helped me tremendously!",
      "created_utc": 1667357353.0,
      "score": 11,
      "context": []
    },
    {
      "id": "iuog994",
      "author": "wild3k4t",
      "body": "No veganism is helping my recovery. Less food guilt, less health anxiety and more volume.",
      "created_utc": 1667337852.0,
      "score": 41,
      "context": []
    },
    {
      "id": "iuoxqlj",
      "author": "Purple_lotuss15",
      "body": "I didn’t start out my ED as a vegan but it does make my ED a lot easier to do.",
      "created_utc": 1667345064.0,
      "score": 10,
      "context": []
    },
    {
      "id": "iuomxvk",
      "author": "The-Furby-King",
      "body": "I don’t think everyone who is vegan has an eating disorder, or is on their way to a full blown eating disorder. However, for me, it was (well I went vegetarian, but you get the point.) It was a way for me to restrict food in a way that was seen as socially acceptable. It’s not that way for everyone who does go vegetarian, and I do want to reiterate that, but for me it was. I’m working on it though",
      "created_utc": 1667340508.0,
      "score": 12,
      "context": []
    },
    {
      "id": "iuqun44",
      "author": "emimagique",
      "body": "No, I had an ED when I ate meat, I had one when I was Vege and I had one when I was vegan",
      "created_utc": 1667387138.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iupysvu",
      "author": "ColomarOlivia",
      "body": "Nah, the opposite. Going keto + intermittent fasting did it for me. I’m not blaming the diet nor the fasting, I know competent health professionals who prescribe those and people who do great on them. I always suffered from mental health issues, body dysmorphic disorder, I started the diet/IF on my own so that was just the cherry on top for me",
      "created_utc": 1667361925.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iuq2ch3",
      "author": "None",
      "body": "I've always had an unhealthy relationship with food, going vegan later in life didn't affect it one way or the other. I just stopped obsessing over calories and started obsessing over nutrients.",
      "created_utc": 1667364073.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iurgcyu",
      "author": "None",
      "body": "going vegan significantly helped my ED. at first it was hard bc i didn't know how to cook or what to eat but after i got the groove of it i started eating more and fueling my body with nutrient rich foods rather than my binge foods. i still have days where i almost binge but i don't feel bad about it because what i am eating isn't nearly as dense as it was before. my mental state is so much better just bc of the foods i eat. i tricked myself to believe all the foods i'm consuming are good for me, which they are, but i couldn't do that not vegan",
      "created_utc": 1667398488.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iuru6fu",
      "author": "7fakesarah",
      "body": "I feel like healing means being vegan… idk, somehow lots of people that had ed in the past, ended up being vegan",
      "created_utc": 1667404111.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iusu2vb",
      "author": "None",
      "body": "Going vegetarian was in high school. I did it for animal rights but I think it quickly turned into cutting out more things. Easy to save on calories when you eliminate entire food groups lol. I don't eat a ton of meat now but it's not off the table so to speak.",
      "created_utc": 1667417839.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iv05xlu",
      "author": "No_Yogurtcloset_9993",
      "body": "I was already vegetarian and always had in plan to be vegan, but yes I became vegan at the beginning of my ed to restrict, and no I didn't developped an ed bc of veganism or vegetarism. We are complexe and different people with complexe and different disorders, I don't think it's possible to predict if this person will develop an ed for sure bc of this or that. But I agree that being vegetarian and vegan is common bc it helps with restrictions, but I don't think we can tell that it's THE cause, though it can be one of the causes.",
      "created_utc": 1667552120.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iupp2tj",
      "author": "Ok-Cake4121",
      "body": "It was in the way that veganism was presented for me. My professor told us if we cared about the environment we would do this, as in we were not Real Activists or Real People, that if we did not commit our entire lives to the things that we believed in than we were all frauds. Statements like these fed into my predisposition toward perfectionism, guilt and already disordered eating. Nevermind that the vegan diet doesn’t quite support people with different dietary needs (or allergies! i’m allergic to a lot of raw vegetables and fruit. which can pose *a problem.)* If it was presented as a “way” to help but not the end all be all, I think that would have changed my experience with it.\n\nFor me- Veganism was a step toward having fear and guilt surrounding food. I’d gone to college with impossible goals, guess I came away with them too.",
      "created_utc": 1667356904.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iuoer0c",
      "author": "fireflashthirteen",
      "body": "They are sort of right from what I've read. A lot of people do, for sure, but this doesn't mean we can infer that it was something about veganism that caused their eating disorder.   \n\n\nI think saying \"most\" seems misleading to me. There is a high correlation but I don't think we should infer causation. Certainly though I think people should be more cautious about going vegan than they currently are, a lot of people who step out into that diet don't know what they're doing from a nutritional standpoint.",
      "created_utc": 1667337260.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iup65yz",
      "author": "None",
      "body": "I was trying to be pescatarian at first",
      "created_utc": 1667348643.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuptgz8",
      "author": "ChakaKohn2",
      "body": "Going vegan sounds tempting for someone whose eating disorder is about restrictions. I started vegetarian and found that all of the carbs were making me gain weight so I stopped. I could see going vegan and just eating vegetables, but as a binger, that wouldn’t last.\n\nI know many overweight vegans, BTW. Palm oil, sugar, and wheat are all vegan.",
      "created_utc": 1667359031.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuq78xq",
      "author": "tssclay",
      "body": "I went vegan for like two weeks as an excuse so my parents wouldn’t suspect I was restricting. Then i realized I mostly eat stuff with dairy and lots of meat and I love milk so I just hid my restriction better",
      "created_utc": 1667367490.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuqajhb",
      "author": "nekousagi88",
      "body": "It helped me restrict what I eat, which was both a good and bad thing. Good because I would binge on unhealthy foods, but bad because it gave me a reason to just cut out things that I’d actually classify as healthy.\n\nBut now that I’ve been vegan for a long time, it’s actually a battle to not binge on unhealthy vegan foods. There are vegan versions of everything these days.",
      "created_utc": 1667370114.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuqlwqt",
      "author": "ChemicalInspection90",
      "body": "i became a vegetarian once and lost like 20 pounds it was bad",
      "created_utc": 1667380203.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuqm1h4",
      "author": "None",
      "body": "I was vegan for a few years about 12 years ago and had no ED issues with it because I was in a relatively good place emotionally. I started keto during the pandemic and that triggered my restrictive tendencies. About a year into that I went vegan keto and started down the ED/restriction path in earnest. I was anorexic as a teen and bulimic as a young adult, recovered for 30 years but falling back into at 56. I divorced at 50 from an ex who didn’t care how I looked, but pressure to be thinner (although I am am a size 8) from the men I’ve dated since age 51 has gotten under my skin. I’m always restricting these days.",
      "created_utc": 1667380323.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuqnmem",
      "author": "NatalieALx",
      "body": "yes i went vegetarian to increase my restriction and like avoid foods. it also served as another excuse not to eat ‘oh i’m vegetarian there’s no options for me’ ‘there’s nothing i like it’s all meat’ and so on. i also gave up dairy for the most part. at this point in my recovery i’m not a huge fan of meat and i never returned to consuming dairy but i don’t think i could go fully vegetarian or vegan at this point even if i wanted to because it would make me spiral. i was always very rule driven within my anorexia. i think some people use veganism as a tool to recover and so it can be helpful eg nourishing their body with plants or using it initially to discover what foods they find ‘safe’ i guess following a healthy vegan diet has got to be better than full restriction even if some food groups are still off limits. i think for others it’s a way to recover but not completely relinquish restriction. a lot of it to me perhaps depends on mindset. off the back of my eating disorder i also now have crippling stomach issues and that is triggered by a lot of fruits/vegetables so veganism wouldn’t work for me now regardless.",
      "created_utc": 1667381723.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuqoyfz",
      "author": "shavedembrace",
      "body": "Pescatarian, vegetarian, vegan, intermittent fasting… all just ways to restrict and torture myself",
      "created_utc": 1667382844.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuqqr01",
      "author": "therealdildoexpert",
      "body": "Yep! All the way. I taught myself guilt associated with food, and it secretly spiraled from there.",
      "created_utc": 1667384284.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuqy6xl",
      "author": "rynniepinnie",
      "body": "Yup, me 🙃 I’m not longer vegan but now my “thing” is fasting 🙃🙃🙃",
      "created_utc": 1667389442.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iur3fkp",
      "author": "None",
      "body": "When I was like 12 I tried a billion different diets, which included being vegan and vegetarian at some point very briefly. I was really underweight at the time due to my autoimmune disease so it didn’t last long, but i do think it was sort of a stepping stone to when i actually started to starve myself when i was 16",
      "created_utc": 1667392417.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iur6nze",
      "author": "Vicious-Lemon",
      "body": "It depends on the person, I think this used to happen in the 2000s more if you’re becoming vegan to restrict food intake probably, for example saying you can’t eat eggs or milk would likely cut out nearly all processed or baked foods, because bread usually has eggs, and desserts usually have milk or eggs. \n\nHowever I would say by and large people would likely start off skipping meals or calorie counting before cutting out a lean food group like meat. I would assume people are more likely to restrict carbs- than protein. \n\nLet’s remember it’s about the intention of the diet that makes it an ED or not, not the actual diet, you can be Keto, vegan, paleo, plant based, IF, low carb, or eat anything and not have an ED.   \n\nWhat makes an ED is an intention and feeling of control around food, not the actual food. So assuming anyone can have an ED because they are on xyz diet is unfair to the person. If you or a loved one is struggling with an ED please seek help.",
      "created_utc": 1667394068.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iury78f",
      "author": "None",
      "body": "I was already 4 years into ED. but it made it worse lol.",
      "created_utc": 1667405684.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iup00sg",
      "author": "alycat8",
      "body": "Both my sibling and I are recovered/recovering from eating disorders, and at various points in our recoveries ended up going vego or vegan. We both eventually figured out it was another form of restriction to keep the illusion of control of the eating disorder.",
      "created_utc": 1667346027.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iuow63y",
      "author": "Cissychedgehog",
      "body": "Seems to me that some people use Veganism as a way to \"recover\" without actually having to let go of the control they need over food. Not \"all in\" recovery.",
      "created_utc": 1667344403.0,
      "score": -1,
      "context": []
    },
    {
      "id": "iuowtts",
      "author": "wicked_em",
      "body": "Also not vegan, but usually when I go vegetarian that’s a big indicator that my restricting is back in full swing or the my ED is starting up in a more severe way again. I don’t like a lot of the “beyond meat” and other meat substitutes so I don’t end up eating much at all.\nEdit: not going to lie, I’ve been very tempted lately to start that up again because I’ve put on some of the weight I lost (in a healthy way) and now I’m back on antidepressants and one symptom is weight gain and the fear of gaining more weight is stronger than ever",
      "created_utc": 1667344684.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iupi4lp",
      "author": "Thisihaveknown",
      "body": "I think following any diet that involves limiting types or amounts of food can trigger eating disorders.",
      "created_utc": 1667353802.0,
      "score": -2,
      "context": []
    },
    {
      "id": "iup64ct",
      "author": "hcpenner",
      "body": "I think that statement is an exaggeration of something that is partially true. Based on the people I met in treatment, 2/12 of us were or had been vegan, although several more were vegetarian. I was the only one (as far as I know) who was vegan before I fell into my ed, the other person went vegan during theirs. In any given group of people with eds, there are probably more vegans than in a random sample of the general population, but I don't think that the majority of people with eds are vegan or that most vegans have eds. I also don't think that most people with eds \"start off\" by going vegan, because there's a whole phenomenon of people going vegan in recovery (often as a way to reduce food guilt and avoid weight gain, both of which are disordered and not recovery focused). \n\nIn my case, even though some professionals have tried to convince me otherwise, going vegan was not part of me developing my ed. I went fully vegan when I moved out of my parents' home and went to uni, and then I developed my ed the summer after my first year at uni, so there was a whole 8-9 months where I was vegan but not at all disordered. I had also previously been pescatarian and then vegetarian for most of my life (since I was 7). I am still vegan now a full year into recovery, weight restored and all!\n\nI think it is a red flag when people suddenly go vegan, especially if they do any of the highly-restrictive versions of veganism that go beyond protecting the environment or saving animals, eg. raw veganism. Unless you absolutely have to have a diet that restrictive due to a medical condition, there is no reason to make veganism even more restrictive than it already is. Also, suddenly going from a \"normal\" diet to a strict vegan overnight is bound to set you up for difficulties figuring out what to eat which could lead to an ed. If anyone is looking into becoming vegan, I would say to not do it until you are stable in your recovery, and I would advise that you start with something less restrictive like pescatarianism and gradually work towards veganism if you can do it without old ed habits coming back.\n\nSorry for the very long post, I hope this all makes sense!",
      "created_utc": 1667348623.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iupc0zw",
      "author": "spookyookykittycat",
      "body": "For me it was the beginning of my “weight loss journey” as I was 275 and became obsessed with working out and watching the scale drop so I just consumed less to weigh less. Unfortunately I didn’t have willpower to be vegan/vegetarian so i just said no to all food lol",
      "created_utc": 1667351153.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iups1kc",
      "author": "toeconsumer9000",
      "body": "not for me because it physically wasn’t possible but for some people i knkw yeah, i went vegetarian when my family would in the summer but i think my mum caught on cuz she made me eat more",
      "created_utc": 1667358317.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iuq8cjf",
      "author": "oldpaintunderthenew",
      "body": "No. Never been vegan though I was vegetarian for years, now I'm flexitarian I guess? I always hated red meat anyway, I will have chicken or venison (which is red meat but does not repulse me) a few odd times a year. I think it was important for me to eat meat wyhile getting out of the worst stages of an ED but it's not something I feel I am missing out on if I don't eat it for months. Out of all the weird food rules I'd had, being vegetarian was by far the mildest... \nBut I don't want to discount anybody's experience, if you feel like it takes tons of restriction and mental space to avoid animal products, I think it's helpful to start eating them.",
      "created_utc": 1667368332.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iurejx6",
      "author": "Puzzleheaded-Show839",
      "body": "Honestly I had mine from preteen age, but really stopped having any issues with food around 21. Then I decided to try keto… it’s been nothing but a downhill crapshoot since.",
      "created_utc": 1667397702.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iurg0tq",
      "author": "None",
      "body": "I would say yes IB my university years (I had an ED before that) but it has since made it kinda worse",
      "created_utc": 1667398343.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iurjukt",
      "author": "bestjamieever89",
      "body": "Hardcore keto started it, going vegan made it worse",
      "created_utc": 1667399958.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iurnrpq",
      "author": "CaregiverPlus4644",
      "body": "My stepping stone was keto",
      "created_utc": 1667401562.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iup0z0j",
      "author": "KawaiiBotanist79",
      "body": "Not initially, but it helped me relapse. If I can restrict meat, then I will restrict other foods while I'm at it.",
      "created_utc": 1667346437.0,
      "score": -1,
      "context": []
    },
    {
      "id": "iup3sk1",
      "author": "IisSithis",
      "body": "Other way around for me. I originally went vegetarian when I was 12, partially due to food sensory issues but mostly for easier calorie restriction. Then I went vegan at 16 to restrict further",
      "created_utc": 1667347640.0,
      "score": -1,
      "context": []
    },
    {
      "id": "ius54ef",
      "author": "None",
      "body": "Not at all. I was vegan at the healthiest time of my life. I ate one hamburger then it all went out the door and boom gained 20 pounds.",
      "created_utc": 1667408328.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iusbu0l",
      "author": "The_Bastard_Henry",
      "body": "I've known a whole lot of people with EDs who used going \"vegan\" to try to mask just how much they're still restricting. It was a pretty common tactic some of the other girls talked about when I was in the hospital.",
      "created_utc": 1667410925.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iush1a1",
      "author": "Appropriate_Grab9606",
      "body": "for me it was just a way to fool myself and everyone around into thinking that i'm healing. i had this 'veganism stage' right after acquiring health issues and realising that i've developed an eating disorder, so that's probably not precisely what you wanted to hear but i feel like many of those fighting their EDs choose going vegan 'cause it allows them to control food consumption while pretending that everything's fine and they've overcome the problem. the only thing is that they haven't, really. a brand new  box or something but what's inside the box stays the same.",
      "created_utc": 1667412878.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iusm4pt",
      "author": "drugsandjowcahol",
      "body": "I became vegan so I could restrict more without people saying anything. Don’t think I could have recovered properly had I not given up the veganism, but I say that as someone who never had moral reasons for eating vegan.",
      "created_utc": 1667414812.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iusnl0p",
      "author": "peachaleach",
      "body": "I don't think that statement is accurate. There are definitely *some* people that go vegan as a sort of stepping stone but not *most* people with eating disorders.",
      "created_utc": 1667415353.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuso7mc",
      "author": "AbundantiaTheWitch",
      "body": "If you’re wondering about veganism and EDs you should watch thequeerkiwi made a video about it I found it interesting",
      "created_utc": 1667415589.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuspidc",
      "author": "jellyfishfresh",
      "body": "Once it was going vegan, once it was intermittent fasting. Now pretty much any kind of dieting does it :/\nI should add that it's not as if veganism gave me an ed, but it was a tool I used to explain why I wouldn't eat anything. I'm happily vegetarian now. Intermittent fasting definitely triggered another bout of ed though. I'm unsure if it would have happened if I hadn't had a history of ed, but honestly the IF culture is insane.",
      "created_utc": 1667416089.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iusts8a",
      "author": "introvertsoup",
      "body": "Well, a few years ago I decided to stop eating meat and was struggling with EDs, and I admit that I was fine with removing more food. But a few months later I realized it was not logical to stop eating meat but not fish. So I told my parents I wanted to stop eating fish, but they didn't really want me to do it bc of iron deficiency. \nTime went by, my health's better and I'm now vegan but it still worries my family whereas I am able to separate EDs and veganism. I'm eating in a way that matches my values.\nBut I remember watching videos on YouTube of young girls telling their EDs story and often ended up vegan on their way to recovery... Which let me perplexed. \nThe most important is, separate values and illness. Go vegan for the good reasons",
      "created_utc": 1667417727.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ivf1pmz",
      "author": "lithium273",
      "body": "at first, yes. a friend of mine managed to lose a lot of weight so naturally i wanted that too.\nnow, almost 3 years later i’m in recovery and try to be as much vegan as it is possible for myself…\nnot sure if it’s still part of my ED or not, but i just can’t go back to drinking dairy and eating meat",
      "created_utc": 1667831605.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iwpnyjq",
      "author": "mentallynotsowell",
      "body": "it was the keto diet for me",
      "created_utc": 1668688317.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuq4q4z",
      "author": "blackcoffeeuwu",
      "body": "mine too!!",
      "created_utc": 1667365666.0,
      "score": 5,
      "context": [
        {
          "id": "iuos1i4",
          "author": "JustabitLii",
          "body": "My stepping stone was intermittent fasting.",
          "created_utc": 1667342631.0
        }
      ]
    },
    {
      "id": "iv7ttpq",
      "author": "casey_carpincho_1312",
      "body": "Same here!",
      "created_utc": 1667691721.0,
      "score": 1,
      "context": [
        {
          "id": "iuos1i4",
          "author": "JustabitLii",
          "body": "My stepping stone was intermittent fasting.",
          "created_utc": 1667342631.0
        }
      ]
    },
    {
      "id": "iyezibj",
      "author": "LGtoeChewer",
      "body": "Pretty interesting, def not rambling",
      "created_utc": 1669846144.0,
      "score": 2,
      "context": [
        {
          "id": "iuoq9dv",
          "author": "LloydSatan",
          "body": "Honestly the reason I became vegan 10 yrs ago was so I could restrict in the open and ppl couldn’t accuse me of having an ED or pressure me into eating when I didn’t want to. It was an easy excuse to say no 2 eating. Saying that - 10 yrs later - being vegan actually really helped me heal and have a better grasp on my ED and has helped me live a healthier lifestyle - like I can restrict but in a healthy way vs being in a toxic cycle. It is interesting starting this way tho bcuz caring about animals and environmental impacts of not being vegan became more important and a part of the reason I’m vegan later into my journey of veganism. Lol sorry I’m rambling.",
          "created_utc": 1667341880.0
        }
      ]
    },
    {
      "id": "iursa9l",
      "author": "tryinghard2live",
      "body": "I wish this got more up votes,  I'm with you.",
      "created_utc": 1667403361.0,
      "score": 5,
      "context": [
        {
          "id": "iupei59",
          "author": "Queenfanforever",
          "body": "I am a vegan but it actually helped me in healing",
          "created_utc": 1667352242.0
        }
      ]
    },
    {
      "id": "ius6wpl",
      "author": "sadia_y",
      "body": "This!! It was calorie counting that set me on the path of an ED, but then I became vegan when my ED was at its worse just to easily get away with not eating.",
      "created_utc": 1667409019.0,
      "score": 5,
      "context": [
        {
          "id": "iuojzgc",
          "author": "maybsnot",
          "body": "I don’t necessarily think it’s that veganism is a stepping stone to disordered eating but rather people who are already prone to disordered eating can find it easier to latch onto more extreme diets and use veganism as an excuse to cut out large food groups, without the social ramifications. On one hand it might just be that someone with disordered eating can latch onto food rules easier and may find peace in protocols like veganism. On the other, following a specific diet is also less alarming - “oh it’s not that I’m not eating it’s just that there’s not a good vegan option right now”",
          "created_utc": 1667339336.0
        }
      ]
    },
    {
      "id": "iuofs7q",
      "author": "fireflashthirteen",
      "body": "This resonates with my experience of moving toward a paleo diet; in retrospect, it was all about what I could remove from my diet.",
      "created_utc": 1667337665.0,
      "score": 7,
      "context": [
        {
          "id": "iuofl6u",
          "author": "koekerond",
          "body": "Not a vegan but becoming a vegetarian was a stepping stone in my eating disorder. It was so easy and there were more and more items of food that I erased from my diet.",
          "created_utc": 1667337589.0
        }
      ]
    },
    {
      "id": "iup4mmo",
      "author": "kimmy23-",
      "body": "i was the same. i wanted to go vegan for the environment and to boycott factory farming. it ended up helping my ED a lot and i’ve been in recovery for awhile now. (vegan for 4+ years). but everyone is different.",
      "created_utc": 1667347992.0,
      "score": 19,
      "context": [
        {
          "id": "iuog994",
          "author": "wild3k4t",
          "body": "No veganism is helping my recovery. Less food guilt, less health anxiety and more volume.",
          "created_utc": 1667337852.0
        }
      ]
    },
    {
      "id": "iuohe89",
      "author": "MonsterPenguin92",
      "body": "I was the same in my recovery",
      "created_utc": 1667338305.0,
      "score": 11,
      "context": [
        {
          "id": "iuog994",
          "author": "wild3k4t",
          "body": "No veganism is helping my recovery. Less food guilt, less health anxiety and more volume.",
          "created_utc": 1667337852.0
        }
      ]
    },
    {
      "id": "iupek6g",
      "author": "Queenfanforever",
      "body": "Me too",
      "created_utc": 1667352266.0,
      "score": 6,
      "context": [
        {
          "id": "iuog994",
          "author": "wild3k4t",
          "body": "No veganism is helping my recovery. Less food guilt, less health anxiety and more volume.",
          "created_utc": 1667337852.0
        }
      ]
    },
    {
      "id": "iupcbd5",
      "author": "rianna1998",
      "body": "agreed",
      "created_utc": 1667351279.0,
      "score": 2,
      "context": [
        {
          "id": "iuoxqlj",
          "author": "Purple_lotuss15",
          "body": "I didn’t start out my ED as a vegan but it does make my ED a lot easier to do.",
          "created_utc": 1667345064.0
        }
      ]
    },
    {
      "id": "iuoflts",
      "author": "fireflashthirteen",
      "body": "It also depends on what they mean by start off. If they mean, \"veganism started them off\" then no, I would disagree with their claim, there isn't enough evidence for that. If they mean \"lots of people who have eating disorders also tried to follow a vegan diet first\", then I might agree.\n\nIt's possible that the disordered eating impulses occur first, and veganism is the most available and thus the first system that people get attracted to. If veganism wasn't so popular, perhaps it would be another diet instead.",
      "created_utc": 1667337595.0,
      "score": 1,
      "context": [
        {
          "id": "iuoer0c",
          "author": "fireflashthirteen",
          "body": "They are sort of right from what I've read. A lot of people do, for sure, but this doesn't mean we can infer that it was something about veganism that caused their eating disorder.   \n\n\nI think saying \"most\" seems misleading to me. There is a high correlation but I don't think we should infer causation. Certainly though I think people should be more cautious about going vegan than they currently are, a lot of people who step out into that diet don't know what they're doing from a nutritional standpoint.",
          "created_utc": 1667337260.0
        }
      ]
    }
  ]
}