{
  "id": "zcmh8h",
  "subreddit": "EatingDisorders",
  "author": "Edithpigeon",
  "created_utc": 1670189691.0,
  "title": "I'm tempted to ignore a medical problem because it's making me lose weight",
  "selftext": "For several weeks, I have been frequently nauseous and have no appetite for most of the day. The only thing I found to help was to smoke a bit of weed, which made me think it was partially anxiety-related. But I can't be high all day, so I basically stopped eating during the day and only eat dinner. Not eating after a certain point makes me dizzy and I've fallen down a few times from standing up too quickly. I have also become super susceptible to motion sickness, even from elevators. I switched to a vegan diet a few months ago for ethical reasons, which might have something to do with this, in addition to anxiety. But I am worried something else could also be going on.\n\nLast week, I decided I would make an appointment to see a doctor. But then yesterday, one of my best friends told me that I looked good because I'd lost weight. Now I'm scared to gain it back because I know she'll notice. This friend is older and like a big sister to me and I value her opinion. She also has ED history, and is significantly underweight now. She restricts to stay at what she feels is a \"safe\" weight, and it's sometimes hard to listen to her describe her strategies and encourage me to try them. For example, staving off hunger after a workout by eating an apple.\n\nI am at a healthy/athletic weight now, but I have a long history of anorexia/extreme restriction, and used to be dangerously thin (didn't have a period for years, developed stomach ulcers, overall unhealthy). It's always difficult not to compare myself to how thin I've been in the past, especially when weight loss is encouraged by someone I love. So much so that I am considering leaving these symptoms untreated. I know that I would never stand to let someone I love do this, but obviously it's different when it's myself. I guess I need to hear some objective, sensical opinions.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/zcmh8h/im_tempted_to_ignore_a_medical_problem_because/",
  "score": 47,
  "num_comments": 20,
  "comments": [
    {
      "id": "iyyicms",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1670209682.0,
      "score": 48,
      "context": []
    },
    {
      "id": "iyye3x1",
      "author": "notsure22222",
      "body": "girl u could be dying. go see the doctor!!",
      "created_utc": 1670207598.0,
      "score": 22,
      "context": []
    },
    {
      "id": "iyyq5ch",
      "author": "SieBanhus",
      "body": "Oh hey welcome to the club. I have IBD and choose to continue shitting my brains out rather than getting treatment because it keeps me thin. It’s also destroyed my health permanently and will probably kill me one way or another if the ED or my own self-hatred doesn’t get my first. \n\nAnyway - my suggestion is to do what I did initially, which is to go get diagnosed so you know what’s wrong, and then decide what you want to do. Obviously you *should* treat it appropriately and get better and whatnot, but assuming you’re an adult you can make your own treatment decisions. But once you know what’s wrong and what the potential short- and long-term effects might be, you can make a more informed decision. \n\nGood luck, I hope you get this all sorted out!",
      "created_utc": 1670213613.0,
      "score": 9,
      "context": []
    },
    {
      "id": "iyymyuj",
      "author": "Zelda_is_my_homegirl",
      "body": "I understand how hard it can be to feel like you’re going to be judged by a friend. \n\nI’ve had a friend with ED history compliment me when I was at my lowest and as people with EDs we know that others with EDs are prone to notice due to the constant comparing that happens. Well I recovered and I gained quite a bit of weight. I mentioned to her that I was having a hard time with the weight and she said “I just see you. My best friend.” \n\nIf your friend knows you have ED history and has an ED herself, then she knows encouraging you to not listen to hunger signals and to try and lose weight is harmful. If she’s knowingly inflicting harm, I might ask myself whether it’s healthy to spend time with that person. \n\nYou definitely should see a doctor so you can be well. If you are athletic, I assume you’d like to continue doing sports. \nWhen we don’t eat enough, our body will breakdown muscle. The heart is a muscle, and one you might like to keep in good health so you can keep doing the things you enjoy.",
      "created_utc": 1670211995.0,
      "score": 6,
      "context": []
    },
    {
      "id": "iyxg6nb",
      "author": "batata1001",
      "body": "I understand your position, i was anorexic two years ago to the point i could barely breath, every single task was extreme for me, and yet i was working out and starving. At some point maybe a year later, i told myself you only live once  and i shouldnt avoid things that i like, so from then I gained weight slowly and started to lift weights, which lead to eating more. After a while i stopped the training bc of work and was reatricting my diet. I got sick of it and decided to go to a dietitian, she understood what i struggle with, comfort me and made a menue for me that actually fits me. And worked out again until i had a breaking point and stopped taking care of myself. I was eating enough, sometimes even binged, the thing is i couldnt go back to starvation, it felt impossible to me.\nNow im physically healthy, mentally i still want to go back to my worse time just bc i was skinny enough to please people. Now i have energy, i laugh, i do stuff, i can breath without making it an exercise of the day. I dont workout now since i struggle with depression really badly so i take small steps. \nMy goal was to be healthy and lose a bit of weight until i lost control and just wanted to be the skinniest in my family so they will praise me, which they did.\nGo to a doctor, its easy to get influenced by people and their word, you have consiouns about it which is a great start. Do what you need to do to be healthy, you don't want to end up with organ failure and a feeding tube. Your body is your tample, dont destroy it, take care of it and love it, the process isnt easy but there is a way out. About your friend, as you mentioned she also have ed, so id recommend you to not listen to everything she has to say especially when it comes to body, diet etc...",
      "created_utc": 1670192465.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iyyq6su",
      "author": "_punkbtch",
      "body": "switching your diet to vegan can make things really hard on your body; i had similar symptoms at first, especially before i learned how to eat balanced in my diet. you should do a metabolic panel with your doctor, you might be missing something big in your nutrition. apart from not getting enough calories.",
      "created_utc": 1670213633.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iyyqa3x",
      "author": "_punkbtch",
      "body": "also, you are allowed to put up boundaries. tell people not to comment on your weight. if she loves you, she will respect that.",
      "created_utc": 1670213682.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iyzwhnm",
      "author": "larashapes",
      "body": "Bruh as a vegan are you taking iron supplements and b12? You admit you are using thc, are skipping meals, you have a hx of eating disorders, and you’re experiencing nausea, dizziness, and orthostatic hypotension. You’re probably anemic, dehydrated, and god knows if there is some other insidious underlying illness that’s going to continue to get worse. I know you value your friends opinion, but in regard to health she is a very bad influence, and at this rate you could honestly just pass out and crack your head open; and/or continue to fall deeper into the eating disorder hole. Your health is so important, your mental health too. Please please please please go to the doctor immediately and then go to therapy, you absolutely genuinely need help.",
      "created_utc": 1670245496.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iz1wv8b",
      "author": "kimblebobstinkypantz",
      "body": "Check out CHS… could be why you are nauseous.",
      "created_utc": 1670275627.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jevs7oe",
      "author": "taarotqueen",
      "body": "Hey, I’m going through something very similar right now. I’m still in denial about having an ED because it’s mostly due to being too anxious, over stimulated, or hyper focused to eat and anything non liquid makes me gag. But…I can’t lie, I’ve lost about 30 pounds and want to lose more and know this can be my “excuse”. I met up with a really good friend the other day to walk (again, something I genuinely do because I enjoy it not to burn calories) who I hadn’t seen in about a year and she went on about “tiny” I’d gotten. It made me really happy because I feel like I look the same unless I see an old picture. \n\nI feel like if this were to get worse it’ll still take people a while to notice something’s up, because I’m only 5ft so I just look more proportionate now. \n\nI’m vegan for ethical reasons as well (2 years for me, and I’ve had this issue a couple years ago when I was still omni so I don’t think it has anything to do with my diet) which also can make it harder to detect because people just assume if you’re not eating in public it’s because there’s nothing to eat or you could say people say rude things about your food so you prefer to only eat at home or something. \n\nThe last couple days I’ve only gotten down a couple Luna bars and pea protein shakes, and some Brussels sprouts from work, and just had a little of Whole Foods vegan mac. I was really dizzy today but I’ve just been so anxious lately. I don’t know why. \n\nDid you ever figure out if it’s a physical medical problem I should look into or just anxiety and adrenaline?",
      "created_utc": 1680583871.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iz1eocs",
      "author": "crying2emoji5",
      "body": "Yeah she sounds like she really really needs help to break the diet culture spell she’s under (and, you know, treat her mental illness)",
      "created_utc": 1670268620.0,
      "score": 4,
      "context": [
        {
          "id": "iyyicms",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1670209682.0
        }
      ]
    },
    {
      "id": "iz22tgg",
      "author": "Edithpigeon",
      "body": "<33",
      "created_utc": 1670278034.0,
      "score": 2,
      "context": [
        {
          "id": "iyyq5ch",
          "author": "SieBanhus",
          "body": "Oh hey welcome to the club. I have IBD and choose to continue shitting my brains out rather than getting treatment because it keeps me thin. It’s also destroyed my health permanently and will probably kill me one way or another if the ED or my own self-hatred doesn’t get my first. \n\nAnyway - my suggestion is to do what I did initially, which is to go get diagnosed so you know what’s wrong, and then decide what you want to do. Obviously you *should* treat it appropriately and get better and whatnot, but assuming you’re an adult you can make your own treatment decisions. But once you know what’s wrong and what the potential short- and long-term effects might be, you can make a more informed decision. \n\nGood luck, I hope you get this all sorted out!",
          "created_utc": 1670213613.0
        }
      ]
    },
    {
      "id": "iz22uqv",
      "author": "Edithpigeon",
      "body": "<33",
      "created_utc": 1670278048.0,
      "score": 1,
      "context": [
        {
          "id": "iyymyuj",
          "author": "Zelda_is_my_homegirl",
          "body": "I understand how hard it can be to feel like you’re going to be judged by a friend. \n\nI’ve had a friend with ED history compliment me when I was at my lowest and as people with EDs we know that others with EDs are prone to notice due to the constant comparing that happens. Well I recovered and I gained quite a bit of weight. I mentioned to her that I was having a hard time with the weight and she said “I just see you. My best friend.” \n\nIf your friend knows you have ED history and has an ED herself, then she knows encouraging you to not listen to hunger signals and to try and lose weight is harmful. If she’s knowingly inflicting harm, I might ask myself whether it’s healthy to spend time with that person. \n\nYou definitely should see a doctor so you can be well. If you are athletic, I assume you’d like to continue doing sports. \nWhen we don’t eat enough, our body will breakdown muscle. The heart is a muscle, and one you might like to keep in good health so you can keep doing the things you enjoy.",
          "created_utc": 1670211995.0
        }
      ]
    },
    {
      "id": "iyxheza",
      "author": "Edithpigeon",
      "body": "Thank you <33 sending you support for dealing with your depression. I struggle with that too, and know how awful it is.",
      "created_utc": 1670192981.0,
      "score": 1,
      "context": [
        {
          "id": "iyxg6nb",
          "author": "batata1001",
          "body": "I understand your position, i was anorexic two years ago to the point i could barely breath, every single task was extreme for me, and yet i was working out and starving. At some point maybe a year later, i told myself you only live once  and i shouldnt avoid things that i like, so from then I gained weight slowly and started to lift weights, which lead to eating more. After a while i stopped the training bc of work and was reatricting my diet. I got sick of it and decided to go to a dietitian, she understood what i struggle with, comfort me and made a menue for me that actually fits me. And worked out again until i had a breaking point and stopped taking care of myself. I was eating enough, sometimes even binged, the thing is i couldnt go back to starvation, it felt impossible to me.\nNow im physically healthy, mentally i still want to go back to my worse time just bc i was skinny enough to please people. Now i have energy, i laugh, i do stuff, i can breath without making it an exercise of the day. I dont workout now since i struggle with depression really badly so i take small steps. \nMy goal was to be healthy and lose a bit of weight until i lost control and just wanted to be the skinniest in my family so they will praise me, which they did.\nGo to a doctor, its easy to get influenced by people and their word, you have consiouns about it which is a great start. Do what you need to do to be healthy, you don't want to end up with organ failure and a feeding tube. Your body is your tample, dont destroy it, take care of it and love it, the process isnt easy but there is a way out. About your friend, as you mentioned she also have ed, so id recommend you to not listen to everything she has to say especially when it comes to body, diet etc...",
          "created_utc": 1670192465.0
        }
      ]
    },
    {
      "id": "iz239jq",
      "author": "Edithpigeon",
      "body": "Yeah I take supplements, and I donated blood a few weeks ago so I know I'm not anemic. I am in therapy and generally am in a much healthier mindset than this... I think the physical toll of feeling like shit every day and dealing with a lot of other stress is just too much to handle, and the weight loss comment came when I was most vulnerable. Thank you for the encouragement, I know I need to sort this out.",
      "created_utc": 1670278219.0,
      "score": 2,
      "context": [
        {
          "id": "iyzwhnm",
          "author": "larashapes",
          "body": "Bruh as a vegan are you taking iron supplements and b12? You admit you are using thc, are skipping meals, you have a hx of eating disorders, and you’re experiencing nausea, dizziness, and orthostatic hypotension. You’re probably anemic, dehydrated, and god knows if there is some other insidious underlying illness that’s going to continue to get worse. I know you value your friends opinion, but in regard to health she is a very bad influence, and at this rate you could honestly just pass out and crack your head open; and/or continue to fall deeper into the eating disorder hole. Your health is so important, your mental health too. Please please please please go to the doctor immediately and then go to therapy, you absolutely genuinely need help.",
          "created_utc": 1670245496.0
        }
      ]
    },
    {
      "id": "iz22htk",
      "author": "Edithpigeon",
      "body": "Cannabinoid Hyperemesis Syndrome? The nausea isn't so bad that I'm vomiting, and I also smoke a very small amount of weed. Like one small bowl lasts me two weeks-- I just take a tiny hit to take the edge off my anxiety.",
      "created_utc": 1670277901.0,
      "score": 1,
      "context": [
        {
          "id": "iz1wv8b",
          "author": "kimblebobstinkypantz",
          "body": "Check out CHS… could be why you are nauseous.",
          "created_utc": 1670275627.0
        }
      ]
    },
    {
      "id": "iz22s9k",
      "author": "Edithpigeon",
      "body": "Yeah. I do still consider her a good friend because she is definitely well intentioned. ED mentality can make you do/say insensitive and harmful things.",
      "created_utc": 1670278020.0,
      "score": 2,
      "context": [
        {
          "id": "iyyicms",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1670209682.0
        },
        {
          "id": "iz1eocs",
          "author": "crying2emoji5",
          "body": "Yeah she sounds like she really really needs help to break the diet culture spell she’s under (and, you know, treat her mental illness)",
          "created_utc": 1670268620.0
        }
      ]
    },
    {
      "id": "iyxhhhu",
      "author": "batata1001",
      "body": "Goodluck take a good care of yourself",
      "created_utc": 1670193011.0,
      "score": 2,
      "context": [
        {
          "id": "iyxg6nb",
          "author": "batata1001",
          "body": "I understand your position, i was anorexic two years ago to the point i could barely breath, every single task was extreme for me, and yet i was working out and starving. At some point maybe a year later, i told myself you only live once  and i shouldnt avoid things that i like, so from then I gained weight slowly and started to lift weights, which lead to eating more. After a while i stopped the training bc of work and was reatricting my diet. I got sick of it and decided to go to a dietitian, she understood what i struggle with, comfort me and made a menue for me that actually fits me. And worked out again until i had a breaking point and stopped taking care of myself. I was eating enough, sometimes even binged, the thing is i couldnt go back to starvation, it felt impossible to me.\nNow im physically healthy, mentally i still want to go back to my worse time just bc i was skinny enough to please people. Now i have energy, i laugh, i do stuff, i can breath without making it an exercise of the day. I dont workout now since i struggle with depression really badly so i take small steps. \nMy goal was to be healthy and lose a bit of weight until i lost control and just wanted to be the skinniest in my family so they will praise me, which they did.\nGo to a doctor, its easy to get influenced by people and their word, you have consiouns about it which is a great start. Do what you need to do to be healthy, you don't want to end up with organ failure and a feeding tube. Your body is your tample, dont destroy it, take care of it and love it, the process isnt easy but there is a way out. About your friend, as you mentioned she also have ed, so id recommend you to not listen to everything she has to say especially when it comes to body, diet etc...",
          "created_utc": 1670192465.0
        },
        {
          "id": "iyxheza",
          "author": "Edithpigeon",
          "body": "Thank you <33 sending you support for dealing with your depression. I struggle with that too, and know how awful it is.",
          "created_utc": 1670192981.0
        }
      ]
    },
    {
      "id": "iz3p1fo",
      "author": "larashapes",
      "body": "You can do this!!!! Just one step at a time, and don’t be afraid to reach out for help❤️ drink lots of water!",
      "created_utc": 1670305911.0,
      "score": 1,
      "context": [
        {
          "id": "iyzwhnm",
          "author": "larashapes",
          "body": "Bruh as a vegan are you taking iron supplements and b12? You admit you are using thc, are skipping meals, you have a hx of eating disorders, and you’re experiencing nausea, dizziness, and orthostatic hypotension. You’re probably anemic, dehydrated, and god knows if there is some other insidious underlying illness that’s going to continue to get worse. I know you value your friends opinion, but in regard to health she is a very bad influence, and at this rate you could honestly just pass out and crack your head open; and/or continue to fall deeper into the eating disorder hole. Your health is so important, your mental health too. Please please please please go to the doctor immediately and then go to therapy, you absolutely genuinely need help.",
          "created_utc": 1670245496.0
        },
        {
          "id": "iz239jq",
          "author": "Edithpigeon",
          "body": "Yeah I take supplements, and I donated blood a few weeks ago so I know I'm not anemic. I am in therapy and generally am in a much healthier mindset than this... I think the physical toll of feeling like shit every day and dealing with a lot of other stress is just too much to handle, and the weight loss comment came when I was most vulnerable. Thank you for the encouragement, I know I need to sort this out.",
          "created_utc": 1670278219.0
        }
      ]
    },
    {
      "id": "iz4e9gv",
      "author": "kimblebobstinkypantz",
      "body": "Ok, that’s good that you can rule that out. I just thought of chs because that is what my husband has and it started out with mild nausea and he found smoking made it better.\n\nI hope you figure things out and make your health a priority. You deserve to feel well.",
      "created_utc": 1670327184.0,
      "score": 1,
      "context": [
        {
          "id": "iz1wv8b",
          "author": "kimblebobstinkypantz",
          "body": "Check out CHS… could be why you are nauseous.",
          "created_utc": 1670275627.0
        },
        {
          "id": "iz22htk",
          "author": "Edithpigeon",
          "body": "Cannabinoid Hyperemesis Syndrome? The nausea isn't so bad that I'm vomiting, and I also smoke a very small amount of weed. Like one small bowl lasts me two weeks-- I just take a tiny hit to take the edge off my anxiety.",
          "created_utc": 1670277901.0
        }
      ]
    },
    {
      "id": "iz4eg4j",
      "author": "kimblebobstinkypantz",
      "body": "Also, get your blood tested by your doctor. I bet you have low iron.",
      "created_utc": 1670327320.0,
      "score": 1,
      "context": [
        {
          "id": "iz1wv8b",
          "author": "kimblebobstinkypantz",
          "body": "Check out CHS… could be why you are nauseous.",
          "created_utc": 1670275627.0
        },
        {
          "id": "iz22htk",
          "author": "Edithpigeon",
          "body": "Cannabinoid Hyperemesis Syndrome? The nausea isn't so bad that I'm vomiting, and I also smoke a very small amount of weed. Like one small bowl lasts me two weeks-- I just take a tiny hit to take the edge off my anxiety.",
          "created_utc": 1670277901.0
        },
        {
          "id": "iz4e9gv",
          "author": "kimblebobstinkypantz",
          "body": "Ok, that’s good that you can rule that out. I just thought of chs because that is what my husband has and it started out with mild nausea and he found smoking made it better.\n\nI hope you figure things out and make your health a priority. You deserve to feel well.",
          "created_utc": 1670327184.0
        }
      ]
    }
  ]
}