{
  "id": "zfl8ln",
  "subreddit": "EatingDisorders",
  "author": "Mindless-Counter-694",
  "created_utc": 1670464109.0,
  "title": "Intermittent fasting/OMAD: how are these things that different from eating disorders/disorders eating.",
  "selftext": "I started out my Anorexia thinking I was just being healthy and I was on these groups/forums and people encouraged me. A lot of my restriction was only eating one meal a day and people who do these types of diets do really similar things. They also often body check and stuff. I know the psychology isn’t exactly the same and I’m not trying to upset anyone, but I’m trying to understand how exactly these things are different. And like people on the groups talk about how good they feel, but I know I always feel really crappy when I don’t eat for a day.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/zfl8ln/intermittent_fastingomad_how_are_these_things/",
  "score": 40,
  "num_comments": 19,
  "comments": [
    {
      "id": "izcxhz2",
      "author": "CatsAndSloths_13",
      "body": "I've always considered them EDlite. Same with my body building girlfriends. I swear they're more disordered than a 90s super model. They're socially acceptable EDs though 🙄",
      "created_utc": 1670473677.0,
      "score": 31,
      "context": []
    },
    {
      "id": "ize8ere",
      "author": "sassNsofia",
      "body": "I think almost all diets are ED remixed with a bow on it honestly.",
      "created_utc": 1670507211.0,
      "score": 25,
      "context": []
    },
    {
      "id": "izdjvqh",
      "author": "lt3scape",
      "body": "Dieting is socially acceptable. Its praised because of societal norms that are praised in the media. \n\nIt's only when you go 'too far' and it is clearly anorexia (I.e. skeleta, can see every bone etc.) That it stops being \"pretty or beautiful\" to the media. \n\nWhen you stop eating and you seem to evaporate and you weren't already thin or fitting into a more \"acceptable \" body shape your praised. \n\nHow can that not be desired? \n\nTo be liked and complimented? \nThe media fuels eating disorders \nAnd \"diets\" are just a glamorised gateway into one. \nAs is fitness and people who are gym obsessed (who count calories to the gram and restrict types oc foods because its \"bad\" for the body or for the gains etc.) \n\nDieting and working out obsessively is normalised now. \n\n\nAnd most medical services only treat the issue of either weight gain or loss depending on the type of ED. \nThey don't actually treat the disordered thinking or mindset around food thus resulting in relapses and minimal \"complete\" recovery. \n\nIt sucks.",
      "created_utc": 1670489428.0,
      "score": 17,
      "context": []
    },
    {
      "id": "izdbbip",
      "author": "None",
      "body": "It’s more the orthorexia side of eating disorders; they eat but are super picky about when, what, and how much.",
      "created_utc": 1670482411.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ized6d3",
      "author": "significantpause",
      "body": "I've used 'oh I'm intermittent fasting!' to dodge questions about skipping meals and it's laughable how some people suddenly think it's great when you say that.  I get away with it bc I have weight to lose rn, if I was smaller I imagine it wouldn't work,  but still.  It's ridiculous.  I can't imagine it's leaving people with healthy food habits.",
      "created_utc": 1670509485.0,
      "score": 12,
      "context": []
    },
    {
      "id": "izemt30",
      "author": "peaches7789",
      "body": "“Intermittent fasting” is literally how my eating disorder started, and it was how I managed to hide it from people for so long.",
      "created_utc": 1670513606.0,
      "score": 12,
      "context": []
    },
    {
      "id": "izd4cgb",
      "author": "None",
      "body": "They’re just eating disorders people are okay with. Neurotypicals can do some mental gymnastics that my tism just can’t. Eating is important even if I think so or not.",
      "created_utc": 1670477619.0,
      "score": 20,
      "context": []
    },
    {
      "id": "izetp4l",
      "author": "schoschja",
      "body": "amusing history glorious joke station slim spectacular alive head engine\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1670516393.0,
      "score": 8,
      "context": []
    },
    {
      "id": "izexovy",
      "author": "Simplicityobsessed",
      "body": "It’s a combination of the mental health fueling eating habits & being able to stop that define dieting. \n\nIf you can complete a diet and stop once you reach a goal? That’s considered “normal”. If you can’t accept your set weight or stop dieting once you reach your goal? Akin to an addictions, you just keep going because it’s never enough. That’s a disorder. \n\nLike others have mentioned it’s heavily societally bound - as many diagnoses are. I think it’s on a spectrum, with healthy mindful eating on one end, and a full blown eating disorder on the other. Dieting would be in the middle. \n\nIMHO the dsm has been far behind on making needed changes to diagnose eating disorders, so you aren’t the only person to have this question. It’s been dad to see “detoxing”, “clean eating” and fasting become such big trends with so little awareness of EDs to counteract such. \n\nThere’s also a large conversation to be had about the combination of exposure and genetics with EDs but that’s another long rant. I can gladly expand if we’re getting into that convo though. :)",
      "created_utc": 1670517962.0,
      "score": 4,
      "context": []
    },
    {
      "id": "izf3vk2",
      "author": "tomatopotatotomato",
      "body": "I have a coworker who’s always doing fasting or keto or some fad. She 100% has an Ed. I used to have one and I know how to spot it. These fads are usually ways of normalizing it. \n\nMy other friend used raw veganism to mask her disorder. Of course someone can follow such diets and not have a problem but it’s convenient excuse not to eat for many people.\n\nI’ve been recovered twenty years but started tracking for post partum weight loss. I decided to stop in order to not spiral back into it. Good work staying self aware.",
      "created_utc": 1670520336.0,
      "score": 5,
      "context": []
    },
    {
      "id": "izfodgn",
      "author": "None",
      "body": "Disordered behavior is distinguished by rigidity, inflexibility, and extreme distress around not achieving behavioral goals.  I would draw a line between someone who does OMAD when at home bc it works for them and they're not particularly hungry most of the day, leaving space for vacations and special occasions and social events, and someone who is obsessively forcing themselves to go hungry and distressed until a certain point in the day, unable to make exceptions like vacations and holidays, and experiencing more distress if they do fail at the goal.  But the first group of people is probably very rare.",
      "created_utc": 1670528311.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ize3bgs",
      "author": "in_the_sheyd",
      "body": "As a diabetic I see this every day in spaces for diabetic folk. People are all kinds of messed up and symptomatic but everyone and their dog is encouraging them to continue restricting because a number on a chart says they need to lose weight. Doctors are not immune from having a warped relationship with food and weight.",
      "created_utc": 1670504433.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ize31zf",
      "author": "Alyss_in_wonderland6",
      "body": "Its the psychological aspect.  Anorexia comes with a lot of suffering and goes way to far in many case. In Omad/fasting when done properly you have enough vitamin/energy you are not suffering, etc",
      "created_utc": 1670504278.0,
      "score": 7,
      "context": []
    },
    {
      "id": "izglw7d",
      "author": "Typical_Alfalfa_3684",
      "body": "honestly, i was the same way. a lot of the things overlapped when done wrong, as there are a lot of unhealthy habits that get built, that can then turn into ed's.",
      "created_utc": 1670541770.0,
      "score": 2,
      "context": []
    },
    {
      "id": "izg1vmg",
      "author": "None",
      "body": "well people are still eating a healthy amount of calories for the most part they just have a scheduled eating time so the digestive system has time to digest and has an idea of when foods coming to prepare the digestion",
      "created_utc": 1670533539.0,
      "score": 1,
      "context": []
    },
    {
      "id": "izexxta",
      "author": "Simplicityobsessed",
      "body": "Omg- I once saw in my college paper an article about a girl who “beat anorexia” by being a body builder. \n\nI’m an active gym-goer and having talked to body builders, the dieting to achieve that is so extreme! I don’t know how people don’t see it. \n\nThey’re just societally accepted while anorexia or orthorexia is considered too extreme? Ugh.",
      "created_utc": 1670518059.0,
      "score": 12,
      "context": [
        {
          "id": "izcxhz2",
          "author": "CatsAndSloths_13",
          "body": "I've always considered them EDlite. Same with my body building girlfriends. I swear they're more disordered than a 90s super model. They're socially acceptable EDs though 🙄",
          "created_utc": 1670473677.0
        }
      ]
    },
    {
      "id": "izft9yb",
      "author": "the_grays_of_ink",
      "body": "Agreed. If it’s not specifically to feel better or for health reasons, I get weird vibes.",
      "created_utc": 1670530203.0,
      "score": 3,
      "context": [
        {
          "id": "ize8ere",
          "author": "sassNsofia",
          "body": "I think almost all diets are ED remixed with a bow on it honestly.",
          "created_utc": 1670507211.0
        }
      ]
    },
    {
      "id": "j0nknvr",
      "author": "real-dreamer",
      "body": "> orthorexia\n\nMay I ask what this word is? I'm unfamiliar with it. When I search for it online I get roblox search results.",
      "created_utc": 1671324797.0,
      "score": 2,
      "context": [
        {
          "id": "izdbbip",
          "author": "None",
          "body": "It’s more the orthorexia side of eating disorders; they eat but are super picky about when, what, and how much.",
          "created_utc": 1670482411.0
        }
      ]
    },
    {
      "id": "j1xlufy",
      "author": "None",
      "body": "It’s a form of disordered eating centered around being really restrictive about what kinds of food are deemed “safe” rather than focusing on quantity. A lot of times this focuses on things like “clean eating” where someone starts wanting to maybe eat healthier and then keeps cutting foods out of their diet completely and feels very uncomfortable about eating things outside of what they consider the ideal",
      "created_utc": 1672198698.0,
      "score": 1,
      "context": [
        {
          "id": "izdbbip",
          "author": "None",
          "body": "It’s more the orthorexia side of eating disorders; they eat but are super picky about when, what, and how much.",
          "created_utc": 1670482411.0
        },
        {
          "id": "j0nknvr",
          "author": "real-dreamer",
          "body": "> orthorexia\n\nMay I ask what this word is? I'm unfamiliar with it. When I search for it online I get roblox search results.",
          "created_utc": 1671324797.0
        }
      ]
    }
  ]
}