{
  "id": "zwag22",
  "subreddit": "EatingDisorders",
  "author": "jjwill889",
  "created_utc": 1672128335.0,
  "title": "Is it normal for guys to have eating disorders",
  "selftext": "I've been off and on bulimic for 5-6 years and I feel isolated because I never hear about men with eating disorders.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/zwag22/is_it_normal_for_guys_to_have_eating_disorders/",
  "score": 68,
  "num_comments": 27,
  "comments": [
    {
      "id": "j1ts96k",
      "author": "ANONYM-CAT-09",
      "body": "EDs don’t discriminate between age, size, height, or weight. It’s a mental disorder. Your struggles are valid no matter what category you fall into. Take care❤️",
      "created_utc": 1672133213.0,
      "score": 56,
      "context": []
    },
    {
      "id": "j1ttggi",
      "author": "Faith_over_fear826",
      "body": "There are so many men out there with eating disorders that just aren’t reported. ANYONE can have an eating disorder. When I went to residential for my eating disorder, I met a few amazing men, they inspired me just as much as the women in there. I am still close with one of them and watching his recovery during residential was so awesome. He felt the same way that you are feeling, he invalidated his disorder for so long because of his gender. He has his struggles here and there, but he doesn’t regret getting help for a second. \n\nAsk for help OP, there are SO many people out there waiting with open arms",
      "created_utc": 1672134255.0,
      "score": 19,
      "context": []
    },
    {
      "id": "j1tvayh",
      "author": "None",
      "body": "yep i am a guy and i used to suffer with ED when i was a teenager. now i suffer from BED but now i am in control.",
      "created_utc": 1672135844.0,
      "score": 15,
      "context": []
    },
    {
      "id": "j1tsgre",
      "author": "floweradio",
      "body": "Yes, absolutely. I've met many guys who are in denial about having an eating disorder (most commonly orthorexia) because it doesn't present itself the same as it does in girls. You have my full support and I hope you're able to recover eventually and thrive.",
      "created_utc": 1672133397.0,
      "score": 12,
      "context": []
    },
    {
      "id": "j1tuiuc",
      "author": "ineedhelplma0",
      "body": "yeah. it’s not as normalized in media and stuff but yeah guys can definitely have eating disorders.",
      "created_utc": 1672135174.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j1tuk2v",
      "author": "Pdiddypanda",
      "body": "Yeah I'm male and was bulimic for like 4 years in my teens. I remember getting taught about anorexia in school, but it was always taught as a female disorder.\n\nWhich is nonsense because there's a hell of a lot of guys with eating disorders out there. Just there's less of a support system for them to be open about it, so there's less publicity. So male rating disorders aren't talked about, and men suffer as a result.\n\nSo I completely empathise with the feeling of isolation. Speaking up on reddit is a brave first step though! \n\nHave you told anyone or sought out help elsewhere? A friend or family member, or failing that an eating disorder charity, or therapy? Therapy helped me massively, especially as I was too anxious to tell anyone about my eating disorder at the time.\n\nGood luck and take care!",
      "created_utc": 1672135205.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j1uf3me",
      "author": "Icy-Block8105",
      "body": "Cishet male here in recovery 💪 youre never alone",
      "created_utc": 1672149748.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j1viqef",
      "author": "fleakie",
      "body": "Statistically? No. Realistically? Absolutely, yes. I reckon the statistics are fucked because men are less likely to come forward about their disordered relationship with food. It's a very taboo subject and it shouldn't be. Toxic masculinity is rampant, unfortunately.",
      "created_utc": 1672166451.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j1vt882",
      "author": "lungsofdoom",
      "body": "Many of us men simply hide our issues/disorders or even give up on life which is why you wont see many men openly showing their struggle.\n\nBut at least on internet you can be open about everything.",
      "created_utc": 1672170645.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j1ua759",
      "author": "None",
      "body": "I’m a guy and dealing with disorderly eating issues at an older age so ya it’s not just girls.",
      "created_utc": 1672147007.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j1u0p0a",
      "author": "WoolyCrafter",
      "body": "Not sure where you are, but a very prominent British politician made it public how he suffered with bulimia. He wanted other men to know they're not alone.\n\n https://www.theguardian.com/society/2008/apr/21/health.johnprescott",
      "created_utc": 1672140335.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j1uw1gm",
      "author": "Alternative-East-444",
      "body": "There is really great video on male body dismorphia by Healthygamergg. Worth watching. Kinda made me realise that had ED.",
      "created_utc": 1672157437.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j1v09za",
      "author": "RavenBoyyy",
      "body": "It's not normal for anyone to have an eating disorder as it is a disorder however guys can and do have eating disorders. I'm a man with an eating disorder (recovered from a restrict/purge disorder and now struggle with an overeating disorder). You're not alone in this",
      "created_utc": 1672159201.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j1vcga7",
      "author": "Intonated",
      "body": "I'm a guy (39), I lived with bulimia and anorexia for about 17 years. I had a lot of health problems and hospitalizations along the way, and I'm now physically disabled because of it. I went to residential treatment two years ago and worked really hard, I've kept the weight on and I'm doing well in recovery. When I first started seeking help back in 2006, there were only a few treatment centers in the USA that would even accept men, but that has changed a lot. I've been very open with people about my eating disorder experiences, people either don't know what to say, or they're supportive, but nobody has given me a hard time just because I'm a guy.",
      "created_utc": 1672163997.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j1vhg3d",
      "author": "None",
      "body": "I've been anorexic since I was 8 - we get them too, mate",
      "created_utc": 1672165945.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j1vj5ka",
      "author": "hellishworld",
      "body": "I’m a guy, I’m anorexic, just wanted to say it so you know you aren’t alone",
      "created_utc": 1672166617.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j1vp2tp",
      "author": "CbackNstomach",
      "body": "I don't like the word normal.  If normal is considered in the context of wearing socks to bed. If 51% of people wore socks to bed that would be normal. So I don't think it's normal for anyone to have an eating disorder.  That's why they have treatment programs.\n\nI spent two years as inpatient. One of the twats there said that I wasn't much of a man because I was so skinny.",
      "created_utc": 1672168974.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j1w15u6",
      "author": "Erosong",
      "body": "You are not alone. Us men tend to fall through the cracks as it were obtaining eating disorder treatment. Please reach out to a local or close by treatment center and consider completing an assessment with them. Doesn’t hurt to check.",
      "created_utc": 1672173839.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j1w2emh",
      "author": "dextroty",
      "body": "Trans guy here, you’re not alone at all. You got this",
      "created_utc": 1672174338.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j1wqcn2",
      "author": "WoodsofNYC",
      "body": "Yes. Please google the National Eating Disorder Association Men. There’s an article I hope is useful. The site has contact info for NEDA. They should have resources to recommend in your area. \nWhen I was in treatment the men were the bravest part of the group. I understand that it is isolating, but there’s a community out there to help you.",
      "created_utc": 1672184237.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j1wrrg9",
      "author": "None",
      "body": "one of my close friends has one",
      "created_utc": 1672184857.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j1ucj6p",
      "author": "jackiieingle",
      "body": "I am transmaculine and I have bulimia. I was hospitalized for it and I was one of 2 guys there out of like 12 patients. I feel your isolation",
      "created_utc": 1672148363.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j1x5r9o",
      "author": "fabs1171",
      "body": "Yes, very normal but very under reported. Recognising that you have an eating disorder is a great first step. This internet stranger is proud of you",
      "created_utc": 1672191131.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j1xn787",
      "author": "WilliamLovesCatz",
      "body": "Been struggling since I was 7… I’m almost 21 now. So yeah it’s pretty common especially for gay men.",
      "created_utc": 1672199369.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j1xps4g",
      "author": "None",
      "body": "Absolutely. It's just unfortunately considered a women's disease, but that's mostly because it's more acceptable for a woman to have \"body image issues\" (which, as we all know, is not all there is to eating disorders). \n\nThis is a no-judgment space. Feel free to share and ask questions. We are all here to support you through/towards recovery, whatever that looks like for you. EDs don't discriminate, they affect people of all genders, races, orientations, ages, and so on.",
      "created_utc": 1672200678.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j1y0eeb",
      "author": "Aggravating_Lead_616",
      "body": "MENS MENTAL HELATH MATTERS IDGAF AND IF YOU MEET A GIRL WHO BELITTLES IT, RUUUUUN BITCH RUUUUUUUNNNNNN (or anyone else, I don’t judge lol)",
      "created_utc": 1672206651.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j1xtzva",
      "author": "None",
      "body": "Well put!",
      "created_utc": 1672202898.0,
      "score": 5,
      "context": [
        {
          "id": "j1ts96k",
          "author": "ANONYM-CAT-09",
          "body": "EDs don’t discriminate between age, size, height, or weight. It’s a mental disorder. Your struggles are valid no matter what category you fall into. Take care❤️",
          "created_utc": 1672133213.0
        }
      ]
    }
  ]
}