{"type": "comment", "timestamp": 1616890592.0, "datetime": "2021-03-28T00:16:32", "subreddit": "fuckeatingdisorders", "id": "gsj0mso", "text": "My parents suspected my ED for a while since I hid it from them. One day, since things weren't getting better, they gave me the choice of \"just eat\" or professional help. So I chose to talk to my pediatrician and tell her about my ED. Now I see my doctor every few weeks for weigh ins, see a dietitian weekly, and am starting to see a therapist weekly. I'm grateful that my experience went fairly well!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618007069.0, "datetime": "2021-04-09T22:24:29", "subreddit": "fuckeatingdisorders", "id": "gtzdllx", "text": "This is sort of happening to me also. i used to bake and cook all the time since I wouldn't eat food with unknown calories. Now that I'm working on not counting calories, I don't really want to cook anymore. It kinda sucks though since I used to really like cooking and baking as a hobby, and for not ED related reasons, but now I have basically no hobbies.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618864915.0, "datetime": "2021-04-19T20:41:55", "subreddit": "fuckeatingdisorders", "id": "gv4iqdk", "text": "I feel like that too! Pre eating disorder I had body image issues that focused on my face. I knew I couldn't change my face, but my body was something I could control and I wanted to make it \"perfect\" to make up for having an ugly face. But now my body image issues have evolved and now it's more about my body than my face, lol. My ED started because I wanted to be thin and change my body. But now isn't really about controlling my weight so I can be skinny, but I use it as a coping mechanism and to feel in control. I still have body image issues but not ED related, I guess? Idk if this makes any sense lmao", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621197327.0, "datetime": "2021-05-16T20:35:27", "subreddit": "fuckeatingdisorders", "id": "gyd4qnt", "text": "Omg finally a post on this! Idk if I'm asexual or i'm jsust malnourished haha. I've never had any sexual or romantic feelings before my ED, but then again I developed an ED at age 13 lol so who knows", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1622938017.0, "datetime": "2021-06-06T00:06:57", "subreddit": "AnorexiaNervosa", "id": "nt8zrq", "text": "", "title": "lol saw this on r/memes and thought it belonged here", "context": null}
{"type": "comment", "timestamp": 1622951230.0, "datetime": "2021-06-06T03:47:10", "subreddit": "AnorexiaNervosa", "id": "h0rcrli", "text": "not to preach recovery or anything but as someone in recovery I do poop everyday now! Feels a lot better than tiny rabbit turds twice weekly lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624668203.0, "datetime": "2021-06-26T00:43:23", "subreddit": "AnorexiaNervosa", "id": "h3236ok", "text": "I'm not anorexic, diagnosed with osfed, but it's so triggering!! The minimal education on EDs is so flawed. They literally described bulimia as the disorder where people throw up their food, as if there's no other form of purging. I wish they would have a more in depth unit on EDs where they cover each disorder and accurately. But I'm hoping at least in AP psychology there would be better coverage", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624717380.0, "datetime": "2021-06-26T14:23:00", "subreddit": "AnorexiaNervosa", "id": "h33xa7t", "text": "The diagnosis for disorders like atypical anorexia or bulimia, orthorexia, etc.. I think but don't take my word for that", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1627487602.0, "datetime": "2021-07-28T15:53:22", "subreddit": "EatingDisorders", "id": "h6ud3xx", "text": "I'm also on a meal plan, but not as strict though. I think meal plans can be important at the beginning of recovery to restore normal eating patterns and physical health. But Im not supposed to measure anything, it's just estimating portion sizes (eg, half a plate grains, 1/4 plate protein, 1/4 plate veg). But I agree that having to track food so closely isn't helpful. Maybe consider the meal plan as a minimum? So like for the fats when cooking, just make sure you have at least one, and having more is okay. Good luck in recovery!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1627937874.0, "datetime": "2021-08-02T20:57:54", "subreddit": "bulimia", "id": "h7h28x1", "text": "I have OSFED not BN, but unfortunately the OSFED/EDNOS is not very active so I'm in a lot of different ED subs. And I don't vomit purge. But yeah I don't get why people romanticize EDs. Exercising until I almost collapse after binging is absolute shit", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1627938288.0, "datetime": "2021-08-02T21:04:48", "subreddit": "bulimia", "id": "h7h36mk", "text": "Kind of late but I have OSFED. I basically have all the symptoms and my ED keeps shape shifting. I've been through many restricting, binge phases, overexercise, and clean eating phases which leaves my health absolutely fucked and my weight still normal. If I 'recover' from one behavior it's onto the next. I know all the EDs suck but I just wish I didn't keep switching symptoms so I could actually recover for good.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628287070.0, "datetime": "2021-08-06T21:57:50", "subreddit": "bulimia", "id": "h7zjliy", "text": "I physically cannot purge! Which is probably a good thing tbh. I binge/restrict/over exercise instead. I'm diagnosed with OSFED not BN", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1635107710.0, "datetime": "2021-10-24T20:35:10", "subreddit": "bulimia", "id": "hhwm8ha", "text": "Im 16 (F) have been binging/purging/restricting since I was 13. I've struggled with body image, self harm, skin picking,  and anxiety since I was much younger, and childhood trauma to top it all off. First started having symptoms of depression when I was 11. I kept it a secret until I told my pediatrician in Feb 2020 and got diagnosed and got meds; she has helped me soo much! Now I'm 6 months into recovery, not recovered, but at least doing better. I definetly do not regret reaching out for help, even though it was very difficult. It sucks, but at least I have professional help and Reddit! I see a therapist, pediatrician, psychiatrist, and dietitan. And went to an IOP program for 2.5 months. Still consider myself to have an ED. I like art (watercolor), my doggo, and reading :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636821812.0, "datetime": "2021-11-13T16:43:32", "subreddit": "bulimia", "id": "hkh1h87", "text": "Not plus sized but late fall/early winter is the WORST I can't stand holiday food and b/p-ing and having to eat out while traveling", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640474158.0, "datetime": "2021-12-25T23:15:58", "subreddit": "bulimia", "id": "hpyr7w3", "text": "Haha the \"eating\" like I don't get rid of what I ate right after 🤡", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640474260.0, "datetime": "2021-12-25T23:17:40", "subreddit": "bulimia", "id": "hpyrezu", "text": "No I'm c/s-ing left and right bc holiday food is so triggering. and we're traveling and my mom wants to eat out so much despite knowing I have an ED so cannot cope with restaurant food bc scary so I've been having the Urge to Purge™️. Can't relapse if you never recovered ✌️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640474391.0, "datetime": "2021-12-25T23:19:51", "subreddit": "bulimia", "id": "hpyro5t", "text": "Same eating makes me cry and  self harm 💀", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640474412.0, "datetime": "2021-12-25T23:20:12", "subreddit": "bulimia", "id": "hpyrpkv", "text": "Same lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640474444.0, "datetime": "2021-12-25T23:20:44", "subreddit": "bulimia", "id": "hpyrrx4", "text": "You too <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640474658.0, "datetime": "2021-12-25T23:24:18", "subreddit": "bulimia", "id": "hpys6xm", "text": "Same all the holiday food freaks me out and my parents knows I have an ED but my relatives don't so it's awkward trying to hide this mess and not ruin the trip", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645202134.0, "datetime": "2022-02-18T16:35:34", "subreddit": "fuckeatingdisorders", "id": "hxgpde7", "text": "Same I was kinda dreading it but at the same time it was such a relief to get it for the first time!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669563621.0, "datetime": "2022-11-27T15:40:21", "subreddit": "AnorexiaNervosa", "id": "ixz9fos", "text": "Excessive censorship is a huge thing on that sub. You can't say shit without a certain mod removing your post. Anything slightly controversial and the mods are like no 🛑🖕", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679609957.0, "datetime": "2023-03-23T22:19:17", "subreddit": "fuckeatingdisorders", "id": "jdey5su", "text": "Yes this is so helpful I feel invalid bc I \"high restrict\" and I feel like my ed is basically just a diet gone wrong because essentially I eat the same amount as a normal dieter.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679610130.0, "datetime": "2023-03-23T22:22:10", "subreddit": "fuckeatingdisorders", "id": "jdeyl1z", "text": "Ya honestly it feels kinda nuts like I am a short sedentary female and can maintain a low normal weight on 2000 cal even though calculators say my maintenence is around 1700", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1694010573.0, "datetime": "2023-09-06T14:29:33", "subreddit": "AnorexiaNervosa", "id": "jzdu0x7", "text": "We can get very sneaky as to hide ed behaviors and weight loss. Also the weight loss wasn't always consistent. I'd get underweight then gain some back to the low end of normal during a binge phase. This is often the case for those with AN b/p who might not lose as consistently as someone with AN-R and therefore not hit as low of a bmi", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700833472.0, "datetime": "2023-11-24T13:44:32", "subreddit": "AnorexiaNervosa", "id": "kakbfku", "text": "Feel you I did eat but then I had to restrict before so I wouldn't have to worry about \"getting fat\" but *still* i just sat there doing mental math worrying about if I ate too much and how many cals and if it will make me gain... I hate Thanksgiving lol (but at the same time I fucking love the food because I am a glutton) considering being \"out of town\" next year 🙃", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1715443986.0, "datetime": "2024-05-11T16:13:06", "subreddit": "AnorexiaNervosa", "id": "l3l9u8t", "text": "One of my sisters is like this. Always been super tiny naturally and eats whatever she wants. But I only stay at a weight that low via restriction", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716685251.0, "datetime": "2024-05-26T01:00:51", "subreddit": "EatingDisorders", "id": "l5op2wj", "text": "I’ve had anorexia for over 5 years and have been through several treatments (outpatient, iop, php, inpatient) and have not gotten better. Even when I was weight restored I was still mentally very unwell. I wish I could just recover and never have another disordered thought again but I feel like it will always be with me to some extent. Maybe some people who were sick at a very young age or for a short period of time can recover and go back to “normal” but I can’t see a way out of it at this point personally. Eventually I want to be recovered, or at least at a point where my ED no longer controls me and I can live a normal life.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720580575.0, "datetime": "2024-07-10T03:02:55", "subreddit": "AnorexiaNervosa", "id": "lcgf5tg", "text": "Not to joke about something serious but no wonder I’m so fucking stupid 💀", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721706677.0, "datetime": "2024-07-23T03:51:17", "subreddit": "AnorexiaNervosa", "id": "lehqui4", "text": "18 but my AN started when I was 13 and I was a binge eater as a child. Really hoping to not bring any sort of ED into my 20’s", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722180587.0, "datetime": "2024-07-28T15:29:47", "subreddit": "AnorexiaNervosa", "id": "lfcjyyg", "text": "I have AN and high cholesterol too, although only my HDL and total cholesterol is high and my HDL:LDL ratio is good. Idk why but I’ve heard it’s common in those of us with AN", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1725592831.0, "datetime": "2024-09-06T03:20:31", "subreddit": "AnorexiaNervosa", "id": "1fa5equ", "text": "I’m glad my academic counselor respected my privacy and didn’t disclose anything but I’m kinda pissed that my mom is telling the school about my ED behind my back and without my consent :/ I’m afraid she’s going to get me kicked out of school for being a liability or whatever. I know she cares but she has 0 respect for my privacy or autonomy as an adult. ", "title": "My mom told my university about my ED and idk how to feel 😭", "context": null}
{"type": "comment", "timestamp": 1725594242.0, "datetime": "2024-09-06T03:44:02", "subreddit": "AnorexiaNervosa", "id": "llqqvfr", "text": "In another email she sent specifically to student health she told them that I have AN. Even if she did not disclose my ED specifically I didn’t want her disclosing any mental health information", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725594849.0, "datetime": "2024-09-06T03:54:09", "subreddit": "AnorexiaNervosa", "id": "llqs9ji", "text": "That’s what I’m worried about. I want to tell my mom to fuck off but I can’t because she and my dad pay my tuition. I know she’s trying to “help” but for the past several years every time she’s tried to help she makes everything worse", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725604109.0, "datetime": "2024-09-06T06:28:29", "subreddit": "AnorexiaNervosa", "id": "llr9ikm", "text": "That is a huge relief! I’m getting outpatient treatment outside of my university and I want to keep the two separate", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725604168.0, "datetime": "2024-09-06T06:29:28", "subreddit": "AnorexiaNervosa", "id": "llr9lun", "text": "Yeah she’s kinda a control freak. Ik she just wants to help but all her attempts at forcing me to recover as a teenager really backfired", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725631873.0, "datetime": "2024-09-06T14:11:13", "subreddit": "AnorexiaNervosa", "id": "llspz0o", "text": "Yeah I’m glad my school has resources for EDs but if I wanted to tell them I wish I could have done it on my own terms, not have my mom tell them", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725667429.0, "datetime": "2024-09-07T00:03:49", "subreddit": "AnorexiaNervosa", "id": "llvp7pn", "text": "I previously got treatment through student health so they know about my ED already but never gave me any trouble, probably bc I wasn’t UW at the time. Hope they don’t give me any trouble this time, esp because I’ll be seeing a dr there that specializes in EDs", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725736584.0, "datetime": "2024-09-07T19:16:24", "subreddit": "AnorexiaNervosa", "id": "llzyhjp", "text": "I go to a large public school in CA", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728423161.0, "datetime": "2024-10-08T21:32:41", "subreddit": "AnorexiaNervosa", "id": "lr04g2p", "text": "One time my mom called it “the beast” and I was ready to do something evil 😶", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732553028.0, "datetime": "2024-11-25T16:43:48", "subreddit": "AnorexiaNervosa", "id": "lyxg19d", "text": "I really took pooping for granted 😭 several years of eating disorders really fucked my digestive system and I can hardly shit even with my extensive laxative routine 💀 I fear I may have given myself IBS or smth", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732995976.0, "datetime": "2024-11-30T19:46:16", "subreddit": "AnorexiaNervosa", "id": "lzrc50e", "text": "Yeah idk why some people (my mom) think it’s ok to say things like “you have no meat on your bones” but are so anti fat shaming (ofc it’s not ok to fat shame either) she knows that body shaming , triggers my Ed, but doesn’t realize that skinny shaming is just as triggering and unhelpful", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745435878.0, "datetime": "2025-04-23T19:17:58", "subreddit": "EatingDisorders", "id": "monrr3t", "text": "I am in training to become a hospice volunteer. I would not advise trying to reason with her or “talk sense into her” but try to keep her calm and minimize her distress, even if that does entail reassuring her AN. It’s not ideal but nothing about this situation is", "parent_id": null, "link_id": null, "context": null}
