{"type": "comment", "timestamp": 1595697173.0, "datetime": "2020-07-25T17:12:53", "subreddit": "ARFID", "id": "fz7n6rk", "text": "***NEVER*** let her near your food again. ***EVER***. Cook everything yourself, eat away from her, if you can, keep your ingredients in a locked cupboard in your room.\n\nThen tell her that if you ever catch her doing anything like that again, you're upending it on her bed. The next time and every time after that, it's over her head, regardless of how hot it might be. Then treat her like she's dead for a couple of weeks. If she speaks, ignore her, if practical, leave any room she enters and block your door so she can't get in.\n\nI usually try to be measured in my responses, but this one is *unforgivable*.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1595708661.0, "datetime": "2020-07-25T20:24:21", "subreddit": "ARFID", "id": "fz8cj35", "text": "First Line of the OP.\n\n>my mom knows about my ED, she knows how picky i am, she knows i won’t eat something if anything is remotely “bad” or if there are secret ingredients in there\n\nThird line of the OP.\n\n>she told me today that she used expired milk to make it to “prove” to me that it’s all in my head\n\nTalkings been done. Mother doesn't care or respect the kid, and didn't want to behave like and adult, because putting expired milk in someones food isn't adult - it's so disrespectful that I can barely put it into words, so my honest feeling that I won't apologise for - FUCK HER! She's made her bed, now she lies in it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1595709104.0, "datetime": "2020-07-25T20:31:44", "subreddit": "ARFID", "id": "fz8dsry", "text": ">But sometimes you just have to take the high road\n\nDo you know how many times I've been told to take the high road in my life? Do you know how many times it's actually solved anything? On a Venn diagram, it's two circles with zero intersection.\n\nAll taking the high road means is that you act like it never happened, and if you act like it never happened, then it comes across as \"it was OK, not a big issue\".\n\nYou take the high road on minor disagreements like getting into a row over decorating or going or spending too much on a hobby. Not on someone putting expired milk into the safe food of someone with ARFID, then smugly announcing it to them. OP literally said they've now lost an entire *category* of safe foods.\n\nIf you've got ARFID or live with someone who has, you know the impact that losing a safe food can have.\n\n>That seems a bit over the top and dramatic over an easily fixable situation. Just move on and take the steps to ensure your food is prepared the way you like it. No need to snub your Mom.\n\nWhat planet do you live on?\n\nEasily fixable? Unless you've got a time machine in your back yard, it's happened, it's not happening. The mother has violated trust, damaged her childs already limited diet and actually thinks they did the right thing.\n\nSnubbing her is the *absolute bare minimum* she deserves - it shows her that her actions have consequences. Honestly, I wouldn't blame OP if they moved out and went no contact permanently.\n\nAnd it's not a case of \"make sure the food is prepared the way you like it\". The mother *knows* how to prepare it. She just doesn't give a shit and decided to violate trust to prove that a mental illness is all in the head. No shit. That's why its called a MENTAL ILLNESS.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596157967.0, "datetime": "2020-07-31T01:12:47", "subreddit": "ARFID", "id": "fztc13k", "text": "In a heartbeat. I've been pretty vocal on that in my life. Eating is a hassle and 95% of my meals don't provide pleasure, just nutrition. If I could save the time I spend eating each day I'd gain back so much time.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596158179.0, "datetime": "2020-07-31T01:16:19", "subreddit": "ARFID", "id": "fztcggq", "text": "Not really the same thing though - huel is what, half a litre of drink per \"meal\"? A tablet is a little thing you take with a swig of drink. Even if I had to take a few tablets, I'd to it. Those drink things actually seem less appealing to me than my current diet, which take some real work to achieve.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596811984.0, "datetime": "2020-08-07T14:53:04", "subreddit": "ARFID", "id": "g0oohvj", "text": "\"Oh idk, im not picky\"\n\n\"It's great for you that you're not picky. But I asked \"what are they providing?\" not \"are you picky with food?\" and your answer doesn't address my question. So again - *what food are they providing, because I also have to be sure I can eat it?*\"\n\nAs my tone may make clear, I lost patience with dumb answers like that about 10 years ago.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596824428.0, "datetime": "2020-08-07T18:20:28", "subreddit": "ARFID", "id": "g0pg1g8", "text": "Then the answer is “they didn’t say” or “I didn’t think to ask”, not “I’m not picky”.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597062755.0, "datetime": "2020-08-10T12:32:35", "subreddit": "ARFID", "id": "g0zkewj", "text": "Honestly, this is one of the reasons I watch so many cooking shows like Masterchef. I may not eat it, but I know my reductions from my foams.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597093946.0, "datetime": "2020-08-10T21:12:26", "subreddit": "ARFID", "id": "g118wgi", "text": "In my house, if I know it, everyone knows it - watching stuff like masterchef, bake off, etc is a household event.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597365243.0, "datetime": "2020-08-14T00:34:03", "subreddit": "ARFID", "id": "g1e1xyv", "text": "Honestly, if the adult route doesn’t work, then i see two paths. The one I would probably take is the hot headed one - give them an ultimatum - the next time they try something like that, you will fucking humiliate them, no matter who is there. \n\nMy mum does it sometimes with me (no malice, she just says something without thinking). Last time I got so annoyed because she wouldn’t drop it with the waitress at the table that I brought up literally everything she’d ever mentioned not liking - fish, sweet corn, Oreo cookies on the desserts. Just kept reaming it off and asking if she wanted them added to her meal.\n\nThe cooler approach would be to point out that if she does that in public without thinking, it might end up giving her a reputation. Like that old story of the woman who went full Karen in a Starbucks on the way to an interview, held up the whole place.\n\nWhen she got to the interview, her interviewer had been in the line behind her, and her behaviour had given a bad impression of her to the interviewer. The interviewer just went “after what I saw this morning, I don’t think we’ll waste the time”.\n\nSo if your sister doesn’t learn to keep her trap shut and reel her behaviour in, she could end up doing real damage to her prospects in life.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1598210400.0, "datetime": "2020-08-23T19:20:00", "subreddit": "ARFID", "id": "g2m536s", "text": "They're in their 50's, so the 1960's... the age of lead paint, corporal punishment in schools, the draft, and segregation. Good thing all those are still around.\n\nI get where you're coming from. I've got a few conditions, some diagnosed, some undiagnosed like ARFID. *Every* time I've told my mother, her response has been \"stop looking for things wrong with you\" or \"stop looking for labels and get on with life\". Some of them, like chronic pain are things I've dealt with for almost my whole life, but I'm just looking for something else wrong - when what I'm actually looking for is some solution of way to manage it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1598217987.0, "datetime": "2020-08-23T21:26:27", "subreddit": "ARFID", "id": "g2mk64f", "text": "I tried the cutting out of sugar thing years ago. Turns out I gave a different root, mines born of my body being overstimulated with pain by migraines. After two decades and an average of 3 migraines every 5 days, my brain started interpreting non pain signals as pain, then eventually, no signal as pain.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1598570528.0, "datetime": "2020-08-27T23:22:08", "subreddit": "ARFID", "id": "g32t6ly", "text": "Now quite the same, but a similar quirk. \n\nWhenever I have a packet of biscuits, I have a weird thing about the last biscuit. I can never say why, but I almost never eat it. Its a similar kind of revulsion that I'd get for milk that's gone bad, doesn't matter if I opened the packet an hour ago or a week ago, same result.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1599530856.0, "datetime": "2020-09-08T02:07:36", "subreddit": "ARFID", "id": "g4ehrqz", "text": "The image misses the one that gets me - I’m the only one going “without this, without that, cut that too” (one chain restaurant does chicken I actually eat but a couple of years ago they stopped selling it as a menu item - now it’s only in a chicken burger with cheese, bacon, bbq sauce on it, etc. So I have to order the burger and then sit there going “just the chicken... yes I mean no cheese, yes no bacon...”. Which isn’t humiliating at all when every other person in your 20 person family ordered totally stock menu items).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600110740.0, "datetime": "2020-09-14T19:12:20", "subreddit": "ARFID", "id": "g59pl65", "text": "I don't know if it's an ARFID thing, but yes. To the point that at uni, you know how everyone has their \"weird thing they can do that no one else can\"?\n\nMine was eating a handful of salt like they'd eat sweets.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600116800.0, "datetime": "2020-09-14T20:53:20", "subreddit": "ARFID", "id": "g5a8mfb", "text": "I tried soy sauce (just the tiniest drop that got on the back of my hand).\n\nI licked it and went “that’s saltier than salt!”. I always thought it would have an umami flavour.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600804770.0, "datetime": "2020-09-22T19:59:30", "subreddit": "ARFID", "id": "g68x5wl", "text": "Fresh Strawberries, good with:\n\nCream & Sugar\n\nDipped in White or Milk Chocolate. \n\nNot good with: Anything else.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600804856.0, "datetime": "2020-09-22T20:00:56", "subreddit": "ARFID", "id": "g68xca8", "text": "I ask a similar question, but about orange chocolate. So many times I see something on Bake Off and it looks great and they go \"it's orange chocolate\" and I want to set it on fire.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600805346.0, "datetime": "2020-09-22T20:09:06", "subreddit": "ARFID", "id": "g68yc3t", "text": "Weirdly I don't like them with other berries. \n\nNow honeydew melon and summer fruits... that's something good, though it's gone a bit out of fashion around here. Used to be a starter in most places but nowhere does it now.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1601719290.0, "datetime": "2020-10-03T10:01:30", "subreddit": "ARFID", "id": "g7i1zz8", "text": "I don’t get the explaining menus thing. Are they that complicated?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1603561761.0, "datetime": "2020-10-24T17:49:21", "subreddit": "ARFID", "id": "g9xl4ri", "text": "The labels thing rings really true for me. Any time I have *anything*, even something as simple as tendonitis, I'm \"looking for labels\".\n\nTBH, I've reached the point where I don't take it anymore. My mum, I just tell her that if she's not going to support me, she's going to shut the hell up until she will. And with people who take the piss despite knowing better, I just start picking at every little quirk of theirs until it annoys them. When they start moaning, I just go \"oh, so it's OK for you to make fun of my ED, but if I take the piss out of you for a BBQ base or not having ice in a soft drink, I've gone too far?\".\n\nAnd in a few cases, it just turns to me going \"oh, shut the fuck up\" when they start. (If they get that far, they're people I suffer being around, not friends, not even acquaintances).\n\nI really wasn't kidding when I said my tolerance for that kind of bullshit was zero these days.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1603990427.0, "datetime": "2020-10-29T16:53:47", "subreddit": "ARFID", "id": "gai9maa", "text": "Honestly, I think you'll struggle to find someone with ARFID (or any ED come to that) who *hasn't* been mocked.\n\nOver the years I've had jokey \"oh, he's a chocolatarian\" type stuff, right up to \"oh grow up you fucking child\" and even coworkers slapping down things like tins of sweetcorn (not a meal or anything, literally a tin of nothing but sweetcorn) and going \"eat that\".\n\nSo you're definitely not alone. But unfortunately change is slow on both sides. It takes a long time for us to expand our diets, and a long time for society to stop being asses about something (think about how long people have been saying \"don't use the R-Word, it's ableist\" and then think about how often and easily people use it online).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1604003347.0, "datetime": "2020-10-29T20:29:07", "subreddit": "ARFID", "id": "gaj3xno", "text": "Yeah. It never makes sense. \n\nThese days I usually go \"well do you eat Surströmming?\" (Surströmming is fermented herring - literally just enough salt not to rot). When they invariably say no (because I've never met anyone who isn't Dutch that likes it), I just throw their own argument like \"it's just food\" back at them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1604038292.0, "datetime": "2020-10-30T06:11:32", "subreddit": "ARFID", "id": "gakr9s2", "text": "3 things on 1 plate?\n\nDENIED!!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605009684.0, "datetime": "2020-11-10T12:01:24", "subreddit": "ARFID", "id": "gbtiule", "text": "I *really* hope you complained to the head of the clinic or licencing board or whatever about that \"specialist\".", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605010422.0, "datetime": "2020-11-10T12:13:42", "subreddit": "ARFID", "id": "gbtjnyr", "text": "Remember one thing - Reddit isn't the real world. Hell, most of the time, when you're browsing Reddit, it isn't even representative of itself, because the dynamic of each subreddit can be so different to any other sub.\n\nGenerally, the more specialist the subreddit, the less chance there is of running into an asshole (probably because in a sub with 30k members, 10% actively posting, consistent asshole behaviour is more likely to stand out than it is in a 1.5m member sub with 10% posting).\n\nSo if you goto ARFID, FairyTail (an anime), StormlightArchive, etc, you'll get a lot more tolerance than you will in AskReddit or News (and that goes tenfold for StormlightArchive and the other Brandon Sanderson subs - the closest I've seen to asshole behaviour there in literal years of browsing StormlightArchive, Cosmere, Mistborn, are things like disagreements over the interpretation of in-universe abilities, and those never go beyond disagreement).\n\nThen there's the simple anonymity factor. I'd place good money that virtually none of these jackasses would be willing to say any of it to your face. But behind the anonymity of a free username they can dump whenever they want, they'll say anything they feel like.\n\nIn real life, I've only met two or three people who weren't understanding about it, and they were tangental enough to my life that I didn't even notice an effect from cutting them out.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605054196.0, "datetime": "2020-11-11T00:23:16", "subreddit": "ARFID", "id": "gbvw3x8", "text": "I mean, this kind of proves my point about different parts of Reddit reacting differently.\n\nI’ve literally had a hundred times the dismissive to hostile comments on Reddit compared to real life.\n\nYour experience is the opposite.\n\nSo basically, it’s the take away that there’s always assholes, there’s always good people. It’s just which ones you find.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607206032.0, "datetime": "2020-12-05T22:07:12", "subreddit": "ARFID", "id": "geqqah3", "text": "Been saying it for years. People give me weird looks but if I could take a tablet and know that I had everything I needed to keep going, deal. Like rip your arm off deal.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607310149.0, "datetime": "2020-12-07T03:02:29", "subreddit": "ARFID", "id": "gewlms2", "text": "I've found the only way to really deal with it is head-on. People who are oblivious enough not to get that it might be a touchy subject aren't going to pick up subtle hints, so I've taken to just straight-up calling them out on it that it's an issue I'm self conscious about and that I can't control, so I'd appreciate it if they stopped drawing attention to it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607695139.0, "datetime": "2020-12-11T13:58:59", "subreddit": "ARFID", "id": "gfe3xyh", "text": "Man, that’s a heady blend that I would almost have considered mutually exclusive.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607697782.0, "datetime": "2020-12-11T14:43:02", "subreddit": "ARFID", "id": "gfe8igo", "text": "God, and I can’t even put the wrong brand chocolate biscuit in my mouth.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1608432212.0, "datetime": "2020-12-20T02:43:32", "subreddit": "ARFID", "id": "ggfn38k", "text": "Insanely so. I will only eat a certain brand of pasta, biscuits, soup, bread. Pretty much the only thing I’m not is milk.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611764494.0, "datetime": "2021-01-27T16:21:34", "subreddit": "ARFID", "id": "gkyqilb", "text": "The one I love is when they go “you can’t taste the garlic” and my response is “most of taste is smell so how could I smell it from halfway across the house but somehow not taste it?”", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615309947.0, "datetime": "2021-03-09T17:12:27", "subreddit": "ARFID", "id": "gqcl3gx", "text": "I'll eat an apple no problem. Strawberries I just cut off the top with the stem. The rest... blegh.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616887521.0, "datetime": "2021-03-27T23:25:21", "subreddit": "ARFID", "id": "gsiv17w", "text": "It’s one reason I learned to eat the tinned spaghetti that is my primary safe food without even biting down. In, swallow, let my stomach do the work.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618674648.0, "datetime": "2021-04-17T15:50:48", "subreddit": "ARFID", "id": "guv6435", "text": "BURN IT WITH FIRE! Then collect the ashes, mix them into a paste, let the paste dry, then BURN THAT WITH FIRE!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621246699.0, "datetime": "2021-05-17T10:18:19", "subreddit": "ARFID", "id": "gyfgbda", "text": "Fancy... plain?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623239561.0, "datetime": "2021-06-09T11:52:41", "subreddit": "ARFID", "id": "h154oal", "text": "It’s more common than a lot of people think. \n\nI mean, my diet is bread, pizza, burger, pasta, cereal, pancakes, burgers, fried chicken, chips (as in fries, but I like the proper thick cut ones). And untold amounts of chocolate.\n\nWhen I was young, I walked everywhere, burned massive calories, so even with an awful diet, I was borderline underweight.\n\nNow I drive and work in an office. I’ve shifted from underweight to overweight in the course of the last couple of years. To the point I just got a compact treadmill to try losing weight (walking locally is… sketchy. Lots of dumb kids, bad quality surface, lots of steep hills, etc).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623284741.0, "datetime": "2021-06-10T00:25:41", "subreddit": "ARFID", "id": "h180bl0", "text": "Nope, far from alone. The problem is that society is conditioned to treat EDs like they’re all about weight loss. If you’re severely underweight, you’re a medical case and normal people sympathise. But overweight is that you’re lazy or greedy, there’s no way it can be an illness.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625165084.0, "datetime": "2021-07-01T18:44:44", "subreddit": "ARFID", "id": "h3posa1", "text": "Yep. At 2-3 years I ate everything. Got Adenoid hypertrophy, couldn't breathe and chew at the same time, and went off everything that needed chewing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626887393.0, "datetime": "2021-07-21T17:09:53", "subreddit": "ARFID", "id": "h60vsqe", "text": "Me either. Not a hope in hell.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1627865411.0, "datetime": "2021-08-02T00:50:11", "subreddit": "ARFID", "id": "h7djh9u", "text": "I’m lucky in that the fruit I actually like the taste of (apples, grapes, melon) are the ones I can stand the texture of. Couldn’t eat an orange because of the texture, couldn’t eat a pear because of the taste, but those three are good.\n\nIn fact, I used to love grapes so much that I became the only person I know who got told to cut down my grape intake and up my salt and caffeine intake by a consultant cardiologist, because as a teen I had pretty low blood pressure and grapes decrease blood pressure slightly. But when you’re eating a bunch of grapes a day or more, slight becomes significant. I’d nearly pass out just standing up out of a chair. So cut down that and add more stuff that bumps blood pressure.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1634396186.0, "datetime": "2021-10-16T14:56:26", "subreddit": "ARFID", "id": "hgv6uae", "text": "No, but I’m an autist, so I’m hugely anti-double standards.\n\nIf she can burn my stuff, I’ll burn hers.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636143365.0, "datetime": "2021-11-05T20:16:05", "subreddit": "ARFID", "id": "hjgld42", "text": "Think of it this way - you've told them about ARFID, and they haven't taken the time to look it up. That tells you about how committed they are to your treatment.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643375758.0, "datetime": "2022-01-28T13:15:58", "subreddit": "ARFID", "id": "huktwt6", "text": "I probably have 3 meals a day on maybe 5-10 days a year. \n\nMost days I manage 2, but forgetting to eat is well within my wheelhouse.\n\nIf I do forget to eat and it's not practical or I'm not hungry, I usually have a few biscuits and a glass of milk to keep my blood sugar in line.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648741391.0, "datetime": "2022-03-31T15:43:11", "subreddit": "ARFID", "id": "i2uz2a3", "text": "TBH, I'm kinda past the embarrassing thing. When I was your age, I had it really bad.\n\nBut now I'm like \"people do *way* more embarrassing shit than having a narrow diet and treat it like it's normal\", so I just don't feel the embarrassment anymore. When people ask, I just say I don't like it. If they push, I just go \"so do you like \\[insert unpleasant thing here - often anchovies\\]?\" (adding a few \"well what about...?\" if they do like it). When I hit one they don't, I ask the same pushy question at them that they asked me. If they keep pushing, I literally just turn around and walk away.\n\nIt helps that my friend circle has a lot of mental health and physical disability issues in it (ASD, ARFID, OCD, depression, suicidal ideation, GAD, self harm, Cerebral Palsy, epilepsy, ADHD, etc among many others that I'm probably forgetting - not by design, we just kinda ended up friends and over time opened up to each other. Turns out we literally all have something, so we all understand working around these things. \n\nLike for a friends birthday, a meal was organised a Wagamama (Japanese based food). My friends knew that there was going to be a 0% chance of me eating any real food, but it was the birthday guy's choice. They just said \"if you want to come and not eat, just have a drink and be social, that's cool, if you don't want to come, don't worry. If you come and want to try something, say and one of us will order it and if you don't like, it's our food and it won't seem odd if you don't eat it\".", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658660373.0, "datetime": "2022-07-24T10:59:33", "subreddit": "ARFID", "id": "ihfnrtc", "text": "No one’s tried the fake out on me in years.\n\nNot after the time that my “friend” spiked my OJ with a double vodka when I wasn’t allowed to drink because of the meds I was on (even worse - he was a trainee pharmacist. Shockingly he never qualified).\n \nTurned out he and a couple of other “friends” (or as I now think of them “people I was stockholmed by thanks to school”) had cooked it up together. They’d held the drink until my lift arrived so I had to down it. \n\nDidn’t actually affect me (probably because it was one drink and I went to sleep as soon as I got home) but that didn’t stop me taking revenge.\n\nLeft it a few weeks until they’d basically forgotten about it. Then when the instigator threw a house party, I spiked all their drinks with a mild dose of laxative. Not enough to be a health risk, just enough to make them uncomfortable for a while.\n\nOne act of revenge showed them not to fuck with me again. And no one ever has.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1664453939.0, "datetime": "2022-09-29T12:18:59", "subreddit": "ARFID", "id": "iqcwhaj", "text": "That's basically a map of my life. ARFID, tension headaches, stress headaches and chronic migraine.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1674556670.0, "datetime": "2023-01-24T10:37:50", "subreddit": "ARFID", "id": "j5o09co", "text": "Honestly, I’d be making a complaint.\n\nThey’re a doctor and they’re talking like a childish bully instead of taking you seriously and doing research into a legitimate condition. Sure, it might not kill us to not have an ARFID diagnosis, but the question is how many other people is he dismissing similarly who might have something more immediately serious?\n\nThere was a case here in the U.K. very recently where doctors kept dismissing a guys ear ache as nothing. Turned out it was something very serious, he developed abscesses in the brain and died.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700876596.0, "datetime": "2023-11-25T01:43:16", "subreddit": "ARFID", "id": "kan4bv9", "text": "Talk to your sisters quietly. \n\nPoint out to them that they know your eating habits and that your BIL taking shots about this woman made you feel like he’s going to be talking about you like that behind your back.\n\nThey may not have considered it because your eating is normal to them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700895217.0, "datetime": "2023-11-25T06:53:37", "subreddit": "ARFID", "id": "kao389j", "text": "That’s why I suggest talking quietly. Make a big thing of it and make threats like that, you automatically become the bad guy. Talk quietly and things are likely to be better:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1711277751.0, "datetime": "2024-03-24T10:55:51", "subreddit": "ARFID", "id": "kwbnlcz", "text": "Call up the clinic/practice/whatever and complain. That’s totally unacceptable for a professional.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718963033.0, "datetime": "2024-06-21T09:43:53", "subreddit": "ARFID", "id": "l9lcr5c", "text": "slice of Dairylea cheese wrapped around a finger of kitkat.\n\nNo idea why it works, but for me, it does.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724066310.0, "datetime": "2024-08-19T11:18:30", "subreddit": "ARFID", "id": "liuv2dw", "text": "Where I’d eat none of it.\n\nI love spaghetti, but it has to be strings. The texture of hoops just doesn’t work for me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727082704.0, "datetime": "2024-09-23T09:11:44", "subreddit": "ARFID", "id": "lohz0rz", "text": "My friends aren’t quite this bad. They don’t put me on the spot, but there is always the “find somewhere that’s AXW3555 friendly” that makes me feel awkward.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727575976.0, "datetime": "2024-09-29T02:12:56", "subreddit": "ARFID", "id": "lpflsdy", "text": "Honestly, you’re in the region where it’s outright abuse and you could seriously consider calling the police or social services to get out of there.\n\nDon’t devalue yourself. You’re a person. He says he’s helping you but *he is abusing you*. You may not want to bother your mother, but if she’s a good parent, she’ll see it as more of a problem if you don’t call her.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728298609.0, "datetime": "2024-10-07T10:56:49", "subreddit": "ARFID", "id": "lqrbl0v", "text": "And that it’s not a simple either/or. \n\nLike, from my reading over the years, I’ve seen 3 archetypical types that 95% of people will fall into - fear, lack of interest, and sensory.\n\nI’m all 3 of those. I don’t really care about eating. Give me a pill and I’d be good. Hell, give me 20 pills, still better. \n\nBut I’m also sensory - if something seems off about a food, I’ll struggle to get it within a foot of my mouth because of the fear element.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728461971.0, "datetime": "2024-10-09T08:19:31", "subreddit": "ARFID", "id": "lr294y4", "text": "Totally standard for me.\n\nI don’t like cooking my safe foods if people are watching (according to my mother, when I make a pizza it’s half cooked. It’s not but the cheese doesn’t start to brown).\n\nWhich is great when your father is a feeder who thinks about food too much and has no hobby. I’d say 19 times in 20 when I cook something and he’s home, he’ll appear “to make a cup of coffee” or “to check the washing machine” or something similar.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731601300.0, "datetime": "2024-11-14T16:21:40", "subreddit": "ARFID", "id": "lx3ut0m", "text": "It’s a pretty standard combination. I don’t like it, but I’ve seen it many times. In the fillet of fish, it’s standard.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732578714.0, "datetime": "2024-11-25T23:51:54", "subreddit": "ARFID", "id": "lyzpkej", "text": "Agreed, straight to HR. Do not pass go, do not collect £200.\n\nThats the kind of thing HR are literally there for. They’re there to protect the company, sure, but this is the kind of thing they want to protect the company from.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732609155.0, "datetime": "2024-11-26T08:19:15", "subreddit": "ARFID", "id": "lz1o0do", "text": "Monopoly is heavily localised. British uses pounds. Old French versions used francs, now they use euros. Star Wars I think used credits, etc.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734435781.0, "datetime": "2024-12-17T11:43:01", "subreddit": "ARFID", "id": "m2hbaag", "text": "I don’t like a lot of food smells, but few badly enough to stop me eating (my main issue is texture).\n\nBut I do get beaten to hell with my migraines when I hit the wrong smell.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736343038.0, "datetime": "2025-01-08T13:30:38", "subreddit": "ARFID", "id": "m61nmba", "text": "I cannot praise you enough for this. It’s fantastic that you’re working with him and making things he likes in a way he can handle. I’m in my 30’s and it’s still a struggle for me if even something as simple as a French fry touches a burger. \n\nI’d never considered bento boxes for it. It’s utter genius, and I may have to try getting some. \n\nSeriously, keep on doing what you’re doing, he’s so lucky to have you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739177541.0, "datetime": "2025-02-10T08:52:21", "subreddit": "ARFID", "id": "mbzl5kt", "text": "I’ll say 3. I’m not counting fish because it’s too general a category. I’ll tomato, chicken, and beef (but only in the forms of pasta sauce/pizza sauce, southern fried chicken, and beef burgers).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747213645.0, "datetime": "2025-05-14T09:07:25", "subreddit": "ARFID", "id": "ms8nmxv", "text": "There’s sometimes an element of texture.\n\nIt’s when they go “you’d never know it was there” - they’re either wrong (ie it screws the dish by not including) or it’s pointless to add.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747510811.0, "datetime": "2025-05-17T19:40:11", "subreddit": "ARFID", "id": "msubs8a", "text": "Welcome to the world of poor education and a demand that everyone be \"normal\".\n\nThat said, I will say that despite this being posted in a food sub, the assholes got downvoted to hell. Which is rare for a food sub.", "parent_id": null, "link_id": null, "context": null}
