{"type": "comment", "timestamp": 1638944576.0, "datetime": "2021-12-08T06:22:56", "subreddit": "bulimia", "id": "hnotsp1", "text": "hey, no matter if it's two days or two years, this is an accomplishment!!! you absolutely deserve to feel proud and like you're doing good things, because you are! I'm proud of you. sending best wishes 🖤", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1642836454.0, "datetime": "2022-01-22T07:27:34", "subreddit": "fuckeatingdisorders", "id": "s9x14o", "text": "i feel so ridiculous lmao. yes, i mean straight brown sugar. by the spoonfuls, out the containers, cups of it, as if it's soup. this has been going on for months now. sometimes my binges include more than just brown sugar, but the point is that its always involved and and always consumed straight. im low income so since I cant buy sweets I do this I guess.\n\nanyone else do this by chance? just curious to know if anyone else has similar experiences or explanations for similar behavior", "title": "i cant stop binging on brown sugar", "context": null}
{"type": "comment", "timestamp": 1642838431.0, "datetime": "2022-01-22T08:00:31", "subreddit": "fuckeatingdisorders", "id": "htpvg08", "text": "i agree it's the superior sweet ingredient by far, so cool I'm not alone!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642840684.0, "datetime": "2022-01-22T08:38:04", "subreddit": "fuckeatingdisorders", "id": "htpypd0", "text": "thank u for reassuring me that im not a fool 🖤 be careful tho it's so addicting!! also watch ur blood sugar sometimes I've binged too hard on it and it got pretty high lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642859541.0, "datetime": "2022-01-22T13:52:21", "subreddit": "fuckeatingdisorders", "id": "htqqrrn", "text": "while I knew that brown sugar has molasses (which is why I love the taste too), I had no idea it was high in minerals!! makes much more sense now, and doesn't make me feel so strange. thanks so much!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642859725.0, "datetime": "2022-01-22T13:55:25", "subreddit": "fuckeatingdisorders", "id": "htqr4ml", "text": "wow I feel so much less alone and silly now from these comments 🤧🖤 I also have occasionally consumed just sugar as well! but I definitely gravitate more towards brown sugar, I love the stronger taste. so much so I've begun using dark brown sugar over light in binges, and also adding brown sugar instead of white to my coffee lol 🤣", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642859836.0, "datetime": "2022-01-22T13:57:16", "subreddit": "fuckeatingdisorders", "id": "htqrcjc", "text": "yeah that'd make sense, since simple sugars are 'quick' / 'easy' energy and my brown sugar binges always happen at night, never during the day. often post-midnight multiple days a week", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642860359.0, "datetime": "2022-01-22T14:05:59", "subreddit": "fuckeatingdisorders", "id": "htqscze", "text": "oh my gosh please enable me LMAO I don't even care at this point tbh 🤣🤣🤣\n\nI've somehow never heard of the muscovado sugar but I will for SURE try it as soon as I have expendable funds!!! that sounds so so so delicious, plus I have already moved into eating dark brown over light brown more often anyway. also I adore milk tea so that would also be lovely to try. \n\nand I've actually made very similar things to the brown sugar brittle you've described when I've had energy! I think brown sugar + butter is literally toffee, right? which makes lots of sense bc I love toffee lol.also I live in Louisiana and pralines are made similarly with brown sugar but add flour, butter, & nuts 🖤\n\nidk if you've tried the brown sugar Truvia blend, but I find it to be very delicious too and it pairs PERFECT with coffee!! imo it has a slight coffee taste to it on its own even", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642873909.0, "datetime": "2022-01-22T17:51:49", "subreddit": "fuckeatingdisorders", "id": "htroerg", "text": "omfg i'm so honored to have a comment from you on one of my posts!!! 🥰 i see you in many threads i'm in and i greatly appreciate all the helpful info, insight, and inspiration you provide to so many in the ed subs. random but, just wanted to let you know you've made a positive difference!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642874167.0, "datetime": "2022-01-22T17:56:07", "subreddit": "fuckeatingdisorders", "id": "htrp2cb", "text": "thank you so much for sharing!! that suggestion sounds so good, do you use any butter/oil on the tortilla as well or do you just plop it on top and heat it for a while?? I've put brown sugar on buttered toast, as well as mixed some in with cornbread and milk and cinnamon", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642874476.0, "datetime": "2022-01-22T18:01:16", "subreddit": "fuckeatingdisorders", "id": "htrpv81", "text": "thank you so much for sharing and offering reassurance 🖤 i'm currently not super stressed about this phase of binging, but it can affect my blood sugar bad sometimes, and it sucks when i run out lol. it's cool to know it should pass regardless. it's also interesting to note that my previous \"strange\" phase-binge food was barbecue sauce...yes again, often just straight. and it was all ones with a brown sugar base lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642874848.0, "datetime": "2022-01-22T18:07:28", "subreddit": "fuckeatingdisorders", "id": "htrqutu", "text": "thanks so much for sharing, that makes absolute sense!! and your comment has made me realize this deffo is from me specifically being low carb lately too. but YES the texture it's just so 😋 not to mention my fave part is...idk if you'll know what i'm referring to but sometimes when too much moisture gets into a container of brown sugar, it makes these darker more dense rocks of the sugar that taste SO GOOD and the texture is so nice lmao", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642875050.0, "datetime": "2022-01-22T18:10:50", "subreddit": "fuckeatingdisorders", "id": "htrrdlp", "text": "my roommate just got some tortillas the other day and i think i may steal one to treat myself and try this!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642875274.0, "datetime": "2022-01-22T18:14:34", "subreddit": "fuckeatingdisorders", "id": "htrrygp", "text": "wait....are we?? 🤓 lmao i got a new roomie not long ago and dont know much about her soooo it's not impossible but what a wild way to get to know each other if so 😅", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642875401.0, "datetime": "2022-01-22T18:16:41", "subreddit": "fuckeatingdisorders", "id": "htrsa26", "text": "i'd like to name us the ***Brown Sugar Binge Babes***\n\nwe can make a band...or a therapy group lmfao", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642877619.0, "datetime": "2022-01-22T18:53:39", "subreddit": "fuckeatingdisorders", "id": "htrxzug", "text": "omfg I so hope they exist", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642877783.0, "datetime": "2022-01-22T18:56:23", "subreddit": "fuckeatingdisorders", "id": "htryeyl", "text": "i could honestly binge some ice cream myself rn lmao. i am somewhat restricting sugar, yes. but I feel like I've been restricting carbs and protein more. been having lots of fiber", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642877844.0, "datetime": "2022-01-22T18:57:24", "subreddit": "fuckeatingdisorders", "id": "htrykm0", "text": "mannn i want them 😩 hopefully one day", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642878079.0, "datetime": "2022-01-22T19:01:19", "subreddit": "fuckeatingdisorders", "id": "htrz6ce", "text": "oh okay bless 🤣 phew I'm relieved tbh. but im glad so many others do this and I'm not alone!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642878597.0, "datetime": "2022-01-22T19:09:57", "subreddit": "fuckeatingdisorders", "id": "hts0hys", "text": "ive but brown sugar in my oatmeal, on toast, and even in my cornbread & milk before too!! its all so good, and I think I'll for sure have to try melting some and using it as a dip, never thought of that! esp with cinnamon would be so good 🤤 main reason I haven't been adding it to anything for the past few months is bc I'm low income and don't have much to put it in anymore, also v depressed. it's cheaper and easier to just eat it straight lmao\n\ni unfortunately don't have much access to healthcare atm due to my circumstances but I will for sure keep in mind the magnesium deficiency if I ever see a doctor or scrounge up money to buy food/vitamins", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642880099.0, "datetime": "2022-01-22T19:34:59", "subreddit": "fuckeatingdisorders", "id": "hts4aad", "text": "in my opinion is so SO DELICIOUS. i also bake quite often it's a hobby of mine, so that's why I keep so much sugar in stock generally too. do you like things like granola, caramel, toffee, chai, cider, etc? if so then I'm pretty confident you'd love brown sugar taste. also, many cinnamon sugar desserts use brown sugar !", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642882038.0, "datetime": "2022-01-22T20:07:18", "subreddit": "fuckeatingdisorders", "id": "hts927z", "text": "i have indeed had peanut butter blossoms (we called them peanut butter kisses where I'm from) and I LOVE them as well!!! I love pb cookies generally but the addition of the brown sugar as you said just takes them over the top and makes them so decadent and perfect 🤤🤤🤤 I think the molasses in brown sugar brings out the nutty-ness of the peanuts\n\nalso have you ever made choco chip cookies with extra brown sugar??? the basic recipes call for it obviously but I've often added a higher measurement of brown sugar or totally cut out the white sugar from a choco chip recipe and it made them sooooo good and extra gooey. brown sugar melts different than white so it makes for a less fluffy more dense cookie. if you like choco chip i recommend it for sure\n\nand yes, there's a lot of cuisines that use brown sugar more as a spice to marinate meats and veggies!! I mean, just look at Gulf South barbecue sauces which are often heavy in brown sugar (prior to this food phase I used to binge Sweet Baby Ray's lmao)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642882095.0, "datetime": "2022-01-22T20:08:15", "subreddit": "fuckeatingdisorders", "id": "hts978y", "text": "will keep it in mind!! I've also somewhat did it with pancake and maple syrup, which is somewhat like honey. but it didnt quite hit like brown sugar lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642882160.0, "datetime": "2022-01-22T20:09:20", "subreddit": "fuckeatingdisorders", "id": "hts9czt", "text": "the taste and the CRONCH are underrated indeed!! I recommend but also say be careful bc it feels addicting lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642886679.0, "datetime": "2022-01-22T21:24:39", "subreddit": "fuckeatingdisorders", "id": "htskf6b", "text": "cheese is a b i g one for me when I want something savory instead!! I tend to really crave dairy-based savory things like cheese, sour cream, cream-based dips", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642886730.0, "datetime": "2022-01-22T21:25:30", "subreddit": "fuckeatingdisorders", "id": "htskjfk", "text": "before brown sugar became a regular thing for me, maple and pancake syrup was another weird binge food for me too!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642899005.0, "datetime": "2022-01-23T00:50:05", "subreddit": "fuckeatingdisorders", "id": "htteops", "text": "I may try to do that. I've been having lots of greens and a decent amount if fats lately so it very well maybe be carbs I'm lacking", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642899188.0, "datetime": "2022-01-23T00:53:08", "subreddit": "fuckeatingdisorders", "id": "httf407", "text": "that is true, I didn't think of it that way! and honestly now that I do think about it, I feel like a reason my brain likes it so much is because it's literally one ingredient lmao, unlike other sweets. like it gives me a weird feeling of comfort because its in its \"purest\" form and I know exactly what it is. I wouldn't've realized that had you not made that apology so thank you!! I appreciate you 🖤💫", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642899280.0, "datetime": "2022-01-23T00:54:40", "subreddit": "fuckeatingdisorders", "id": "httfbnc", "text": "omfg I have some pecans too, how did everyone know this thread ended up being culinary GENIUSES lmao!!! thank all of y'all so much for sharing and helping me feel less like an anomaly 🖤🤧", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642904346.0, "datetime": "2022-01-23T02:19:06", "subreddit": "fuckeatingdisorders", "id": "httr1an", "text": "I know that no one above will get a notification about me saying this but--\n\nfrom several helpful users' advice im having some potatoes for supper tonight to try to have a few carbs!! again im not worried about my brown sugar binges -that- bad but I'm about to run out of brown sugar and can't buy more for a bit so 😬 tryna calm the cravings somehow", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642904436.0, "datetime": "2022-01-23T02:20:36", "subreddit": "fuckeatingdisorders", "id": "httr8s3", "text": "welcome to the band darling!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642904461.0, "datetime": "2022-01-23T02:21:01", "subreddit": "fuckeatingdisorders", "id": "httraui", "text": "ooooo yes brown sugar and cinnamon apples!! 🤤", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642904496.0, "datetime": "2022-01-23T02:21:36", "subreddit": "fuckeatingdisorders", "id": "httrdoz", "text": "thank u for sharing 🖤", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642904568.0, "datetime": "2022-01-23T02:22:48", "subreddit": "fuckeatingdisorders", "id": "httrjjk", "text": "you're so very kind, thank you darling!!! 🖤🤧💫 I love oatmeal and oats in general, esp granola! I've had it in there in the past. I also LOVE homamde cinnamon toast too!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642918092.0, "datetime": "2022-01-23T06:08:12", "subreddit": "fuckeatingdisorders", "id": "htukkh8", "text": "i am a 24-year-old and i'm doing it XD", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642918163.0, "datetime": "2022-01-23T06:09:23", "subreddit": "fuckeatingdisorders", "id": "htukpkg", "text": "omfg the condensed milk + graham crackers....i think i'm gonna have to try that because i LOVE graham crackers with an intense passion. plus the creaminess from the milk...damn i can imagine", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642922626.0, "datetime": "2022-01-23T07:23:46", "subreddit": "fuckeatingdisorders", "id": "hturq5a", "text": "I'm not a fan of coconut much, especially shaved but otherwise this sounds pretty delicious indeed!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643064786.0, "datetime": "2022-01-24T22:53:06", "subreddit": "fuckeatingdisorders", "id": "hu2zmch", "text": "so very proud of you!!! i deffo big relate to the \"free restriction\" mentality whenever a sudden setback in eating plans occurs, and it is SO HARD to overcome those thoughts without guilt. but you DID IT and it's no small feat!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647499052.0, "datetime": "2022-03-17T06:37:32", "subreddit": "fuckeatingdisorders", "id": "i0zmczi", "text": "was literally coming in this thread just to mention her in case she hasn't been ! 🖤", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657128082.0, "datetime": "2022-07-06T17:21:22", "subreddit": "fuckeatingdisorders", "id": "if3jzn3", "text": "yes, my ED is literally founded upon the idea that eating as little as possible will grant me two things I want:\n\n1. more money to save\n2. brings me closer to death, which once dead i will not have to worry about money (among other things)\n\nmy financial anxiety is a driving factor and always has been. i also deeply struggle with other ppl buying me food, because I feel extremely guilt that they will end up with not enough money for themselves for needs or wants. I grew up in a low SES rural household, and me and my parents are both still low SES separately. \n\ndumpster diving has helped me a lot, but in the summer heat it's near impossible.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732157158.0, "datetime": "2024-11-21T02:45:58", "subreddit": "fuckeatingdisorders", "id": "ly6v8m8", "text": "I am now fully recovered and in a place of food freedom, but I am sending much love and light your way my darling 🌟🫶🏻🖤 please stay safe!!!", "parent_id": null, "link_id": null, "context": null}
