{"type": "comment", "timestamp": 1665420560.0, "datetime": "2022-10-10T16:49:20", "subreddit": "bulimia", "id": "irs3x81", "text": "Congratulations!!  Every single time you do the opposite of your screaming mean ED voice, you are in Recovery and getting stronger!  Day by day, moment by moment...bite by bite.  You are not alone on this Journey.   Others are doing it too, most silently struggling.  Keep going Warrior!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665701590.0, "datetime": "2022-10-13T22:53:10", "subreddit": "EatingDisorders", "id": "is7uxf2", "text": "Whoo hooo!!!   Wonderful!  Be stronger than the mean ED voices!  Way to go!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665930060.0, "datetime": "2022-10-16T14:21:00", "subreddit": "bulimia", "id": "isjmwma", "text": "There is Hope!  I'm 50 and my 2nd try at Recovery.   This time it seems to be sticking. But took Surrender and Acceptance. Societal expectations/definitions of Beauty can kill.  35 years with ED.  Recovery is incredibly hard, but Freedom is so Sweet!  And honestly. When I look around in the real world with my new body?   I fit right in.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1666750858.0, "datetime": "2022-10-26T02:20:58", "subreddit": "bulimia", "id": "itt1zia", "text": "That's great!!!!!  30 days and a thousand nights as they say.  It's hard work. But each day counts towards quieting the mean ED voice and hopefully retraining your brain.  Keep going Warrior!!  You are not alone in this Journey.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1667518682.0, "datetime": "2022-11-03T23:38:02", "subreddit": "bulimia", "id": "iuykb2y", "text": "Oh my gosh, how WONDERFUL!!  this is such a hopeful post!   I am 2nd time in Recovery,  and yes it's a frickin struggle, but this time I think it's going to stick.   I feel stronger and more at Peace this time.   I hope I too, can celebrate 1 year of Recovery in 2023.  Congratulations to you!!  You are a light at the end of the tunnel.  :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670099978.0, "datetime": "2022-12-03T20:39:38", "subreddit": "bulimia", "id": "iysi6c1", "text": "Congratulations!!!  Every win deserves a big hug.  It's so hard, but all those wins add up, and then look,  you are well onto your way into Recovery!!!   This is wonderful.  Good for you!  And remember,  slips are normal,  and slips are NOT relapses.   You are training your body and mind a different way to be. :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671069749.0, "datetime": "2022-12-15T02:02:29", "subreddit": "bulimia", "id": "j09q65g", "text": "Yay!  Excellent!!  Every win should be celebrated..this is a big deal!   Fight back...you have all the power to reclaim your Life!  Hard work...but mental freedom is priceless!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671213783.0, "datetime": "2022-12-16T18:03:03", "subreddit": "bulimia", "id": "j0him9k", "text": "One of the first things I had to do in Recovery was get used to, and \"forgiving\" myself for being full; feeling full. I started with higher quantities of non-trigger foods, sat with the fullness,  telling myself \" it's ok.. what's inside is totally healthy..your body needs these nutrients...the feeling will pass and in 40 min you will not be feeling this at all...hang on\".  This repeated mindful practice totally helped me until I could tolerate again.   Recovery is all about \"slow and easy\"... building yourself back and re-wiring your nueral pathways so you are no longer in terror.   Mental Peace is PRICELESS.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1675631065.0, "datetime": "2023-02-05T21:04:25", "subreddit": "bulimia", "id": "j7csn8b", "text": "Oh my gosh, this is beyond awesome!!  You are in Recovery,  trying to re-wire your brain, change your coping behaviors and getting stronger for Recovery's challenges!!!  This is exciting!  Forgive yourself all along the way.  Slow and steady is the best!!  They say \"21 days to make a habit\" so you are in the sweet spot for real change. I did it too!  Remember,  there is no such thing as Perfection,  even in Recovery.   If you slip...it's a slip, NOT a relapse!! There are several steps in Recovery,  so be gentle with yourself.  Celebrate each and every win!!!  You are a wonderful human, learning a different way to be.  Keep fighting for you!!  You are not alone in this Recovery Journey.   It can be done.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1676435580.0, "datetime": "2023-02-15T04:33:00", "subreddit": "bulimia", "id": "j8lil1k", "text": "I wouldn't say that's funny.  ED'S kill.  At the very least they are lifelong traps", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1677379524.0, "datetime": "2023-02-26T02:45:24", "subreddit": "bulimia", "id": "ja1d3lj", "text": "All that.  It controls you and takes over the reins of your life.   It's so sad to see a disease have such power.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1678683014.0, "datetime": "2023-03-13T04:50:14", "subreddit": "bulimia", "id": "jc0r6dx", "text": "THIS!!  This is why I finally chose Recovery for the 2nd time.  March 2022.  I had been at that magical low weight, and was still miserable.   So miserable,  but now also had full blown ED and bad labs. Hair falling out, skin drooping.  Ugly.  I made a list of why I was feeling so shitty, and saw my problems could NOT be fixed by my ED.  So I said \"well hell, if I feel this bad now, I might as well be healthy and recovered,  and feel bad.\"  LOL!  That's how I chose Recovery again,  and am still holding steady.  There are difficulties and emotional pain on both sides of either ED or Recovery.   But at least one is \"normal\" and healthy.  Now I gotta figure out how to fix ME: low self-esteem, Shame, past trauma, mistakes,  dissapointments, etc.   Life is hard, but it is HARDER with an ED, just like any addiction.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679184715.0, "datetime": "2023-03-19T00:11:55", "subreddit": "bulimia", "id": "jcrhb1h", "text": "Fantastic!!!   They say it takes 21 days to make a habit. So this is wonderful!!   But always remember to forgive yourself.   You are learning a new way to be\n  It's hard work!   A slip is NOT a relapse.  I am on this Recovery Journey too.   We gain a little more self respect each time we do the correct/right behaviors.  Keep going!  You are not alone.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679191319.0, "datetime": "2023-03-19T02:01:59", "subreddit": "bulimia", "id": "jcrvei0", "text": "Exactly!  The point is to keep trying,  not collapsing in defeat to the full ED influence.   To keep fighting is to gain some measure of self-respect.   I'm 51...still fighting.   What a glorious day when I no longer have to fight so hard, but normal behaviors are 2nd nature.  High hopes.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679237997.0, "datetime": "2023-03-19T14:59:57", "subreddit": "bulimia", "id": "jctulys", "text": "35 years.  But I didn't try Recovery til 2019.   Even at my \"magic number \" weight/size I discovered I was still miserable...so I figured I might as well be recovered/healthy and miserable.   Lol.  After a certain age, it doesn't matter how thin you are...you are still not going to look 25.  It became ridiculous to me.  I'm in menopause for Pete's sakes!  Just want to be normal...have mental peace.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679260462.0, "datetime": "2023-03-19T21:14:22", "subreddit": "bulimia", "id": "jcvdxc2", "text": "Yes, two girls.  But they are grown and gone.  How exciting to be at the beginning tho!  Kids are great until they are 13/14.  Lol.   Maybe this can be a motivation?  Your body will be the home for your baby for 9 months.   You need to get it ready: nutrients, iron, folic acid etc.  You could certainly start taking prenatal vitamins.   I know it's hard.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679260925.0, "datetime": "2023-03-19T21:22:05", "subreddit": "bulimia", "id": "jcvf1f7", "text": "Yes!  But it's also a good motivator to think that you wouldn't want to pass this on to your children.   Kids learn from us..they pick up on things..hear comments that you may make about food, weight, your body.  Just an idea.   It's very easy to slip back to the ED, because that's what we know, but to keep fighting and trying to make it less of the centerpiece of our lives is vital.   I think like any addiction we have to be diligent; wary for signs of slipping.   Good luck!  How wonderful to have these things ahead of you!  Hope..optimism..new chapters just waiting to be unveiled.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679271463.0, "datetime": "2023-03-20T00:17:43", "subreddit": "bulimia", "id": "jcw26jh", "text": "We do!!  We got this!  *hugs*", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679435005.0, "datetime": "2023-03-21T21:43:25", "subreddit": "bulimia", "id": "jd50ebd", "text": "Hey!  Every baby step counts!!  Yes it DOES!  so many millions of choices we get to make...but it starts somewhere.  *hugs*", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684085807.0, "datetime": "2023-05-14T17:36:47", "subreddit": "bulimia", "id": "jk51qgc", "text": "It's 100% natural.   Your body wants nutrients to survive.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684893485.0, "datetime": "2023-05-24T01:58:05", "subreddit": "bulimia", "id": "jldfqfc", "text": "It's weird but true.  Only the beginning was enjoyed.  Most of the Binge used to be horrible.   Then I would have guilt/shame.  Nice reminder why I want to stay in Recovery.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1687144272.0, "datetime": "2023-06-19T03:11:12", "subreddit": "bulimia", "id": "jonu497", "text": "That's how it starts...baby steps.  Slowly,  on purpose repeated actions.   It's hard work to re-train the brain, then deal with the changes that come with that.  Hard work...so always forgive yourself.  You can do this!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1687183222.0, "datetime": "2023-06-19T14:00:22", "subreddit": "bulimia", "id": "jopdp0j", "text": "Good luck honey.   It's hard as hell but it can be done.  Every win counts and remember to always forgive yourself.   :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1690253951.0, "datetime": "2023-07-25T02:59:11", "subreddit": "bulimia", "id": "jtc5528", "text": "Fantastic!!!   Keep going!  You are doing the hard work.  You are re-training your brain.   And always remember to forgive yourself.   If you have a slip, it's just a slip, NOT a relapse!   You now have experience under your belt so you will never be \"starting over\".  I'm in Recovery too... we got this!  We are the living proof that body Diversity exists too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1691882230.0, "datetime": "2023-08-12T23:17:10", "subreddit": "bulimia", "id": "jvxo7rm", "text": "Congratulations!  Don't be so hard on yourself!!  There is no perfection,  even in Recovery.   You are not starting over each time,  you are starting from EXPERIENCE.   You learn your triggers,  you figure out a different way to cope with what Life throws at you.  It's hard work, and it's not fast.  slow and steady...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1699049726.0, "datetime": "2023-11-03T22:15:26", "subreddit": "bulimia", "id": "k7pnxuh", "text": "I suffered for 35 years until I attempted Recovery.  One relapse, now I'm in Recovery for 2nd year.  There's no magic pill... we have to actively, On purpose seek Recovery and do the hard things: eat the food, digest the food, sit with the uncomfortable,  buy bigger clothes if needed, get rid of all clothes that don't fit the new recovered body,  stop weighing...all the hard things.   Then slowly the hard things become the new normal.  And then the blessed mental Peace arrives, and food and body are no longer center stage.   Life is.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1699109440.0, "datetime": "2023-11-04T14:50:40", "subreddit": "bulimia", "id": "k7slsmf", "text": "I started with only eating safe foods and digesting.  Then I increased the qtys to getting full and sitting with the panic/distress of that.  Then I added in \"medium\" scary foods.  This was not a fast process, and of course I gained weight and had to process that.   I immediately got rid of clothes that only fit my thinner self (I started as being quite underweight).   The bloat...the digestional issues!  It was very hard.  Mentally and physically.   I had a relapse after a year, because I was majorly triggered by the scale.   I eventually went up 3 sizes.   It was probably very helpful that it wasn't overnight,  as I had to keep getting used to a new body at each stage.  But I celebrated every win!!  Eating out without looking at the menu first,  eating out (and not being in a panic) with friends.  Grocery shopping for food to EAT, not food to binge on.  Every \"win\" counts!   Lastly...only at most recent... I added in trigger/binge foods.   At first I couldn't handle it, but now I can.   One step at a time.  Always forgive yourself!  We are relearning a new way to be..to cope..to live in our own skin.  I may never love my body tbh...I am bigger with hips, thighs, belly, boobs, but I LOVE not having food/body/weight panic.  The mental Peace keeps me staying in Recovery.  And my husband is relieved of living with someone totally in fear every single day,  with what that Damn scale reports.  Now I can just Live.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1703306306.0, "datetime": "2023-12-23T04:38:26", "subreddit": "bulimia", "id": "kek88si", "text": "Exactly", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1704648314.0, "datetime": "2024-01-07T17:25:14", "subreddit": "bulimia", "id": "kgr6jqb", "text": "Your body is trying to survive.   That simple.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1705255806.0, "datetime": "2024-01-14T18:10:06", "subreddit": "bulimia", "id": "khuf8lc", "text": "Fabulous!  This is how it's done!  Slow and steady,  baby steps.  I recovered after 35 years and it was hard work! DAILY hard work, until my healthy behaviors felt like the normal ones, and ED behaviors felt like the wrong, shameful actions.\n\nI still don't love my new recovered body shape or weight. But I LOVE the mental freedom...the mental Peace.  I don't freak out about meeting people for dinner, don't get furious that every social event seems to involve food,  no terror at the Holidays...\n\nTip: stop weighing yourself on the scale,  or at least put farther and farther amounts of time in between weighing,  until you can stop.  Tbh, after a while,  the number on there is no longer \"rewarding\".  Once you settle into your body's choice of weight, It doesn't move one way or the other dramatically anyway.  No reward or punishment there in the scale anymore. \n\nTip: Immediately get rid of ALL clothing in your closet that doesn't fit your changing, recovering body.   I went up 3 sizes during Recovery.   NOTHING in your closet or dresser should taunt you, be cruel to you... insist on ED behaviors just so you can fit into them.   I learned to shop at Second Hand Stores and Costco... but this is important here...keep NOTHING that no longer fits your changing body.\n\nIn a world screaming Diversity for race, gender, religion , it's about time there is BODY DIVERSITY. \n\nKeep going.  Always forgive yourself.   And always remember:  a slip is NOT a relapse.   It's hard work relearning how to choose food, eat food, sit in the uncomfortable and then digest food.  Relearn how to cope without ED behaviors...Relearn how to comfort yourself when facing Life's stressors (or other people's comments!)\n\nKeep going.  You are doing it.  You are not alone on the Recovery Journey.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1706758973.0, "datetime": "2024-02-01T03:42:53", "subreddit": "AnorexiaNervosa", "id": "kody86y", "text": "Yay!  Absolutely right you are!  I'm in 2nd year of Recovery and not going back either.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710167129.0, "datetime": "2024-03-11T14:25:29", "subreddit": "bulimia", "id": "kudci51", "text": "Totally agree.  I recovered from alcohol abuse and a 35 year long ED.   Recovery from ED was FAR harder as I had to face my demons multiple times a day!!  Also I didn't get any rewarding chips or congrats as I was weight restoring. No congratulatory cards.  In fact.... this society so values being thin,  not giving a shit how the individual gets there.  I had many people happy I was no longer drinking.    Recovery from ED is a hard process,  very personal.   And thank God I'm free today.   I celebrate every one of my \"wins\", even if I'm the only one that knows.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710249236.0, "datetime": "2024-03-12T13:13:56", "subreddit": "AnorexiaNervosa", "id": "kuilkee", "text": "I stay very concentrated on Why I love my Recovery so much.  I leave notes for myself,  relish my slow enjoyment of a cookie, take a minute to relish how I don't freak out before we go to a restaurant.   So many freedoms.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710940688.0, "datetime": "2024-03-20T13:18:08", "subreddit": "bulimia", "id": "kvq82wm", "text": "I hear you, and you are in great pain now.  But you are deep into your addiction.   YOU, as a person, are NOT your addiction.   That being said, no one is going to save you either.  Outside providers (therapists,  dieticians,  etc) are only just tools to help you recover.   You have to want Recovery MORE that wanting what the ED behaviors are giving you.  All of it... whether it's your body shape, clothing sizes, sense of pride or \"specialness\"...whatever your addiction is giving you.\n\nYou have to get so sick of it you would rather surrender to Recovery,  accept what those changes will do to you physically and mentally/emotionally.  Then at that point you fight like hell.  It's not easy or quick; there's no magic pill.  You have to choose the food, eat the food,  sit in the uncomfortable,  digest the food.  Deal with what that feels like physically and mentally.    You may start out screaming and sweating.  Addictions don't want to let go.   But your slow and steady repeat WILL start to pay off.  You will see the eating and digesting as the normal things until you no longer see the ED behaviors as even being an option. \n\nYou will gain weight.  You will be changing your clothing sizes, and getting rid of ANY clothes that only fit your body with a ED behavior.    You will ditch the scale.   There's nothing but cruel judgment there.  Not needed in Recovery or at all in fact!!\n\nGet ready to fight.  Freedom isn't Free.  But only YOU can do it.  Only you can be the one to choose correct behaviors over ED ones.\n\nI recovered after 35 years into a menopausal body.   The ED addiction WILL take over your life if you let it. It's time to think about if you want to fight now or later, dealing with older skin that doesn't react like you want it to, or other physical problems,  just because you are simply older.   \n\nThe body always wins in the end.  It's called aging and death.   Don't spend your life in misery. You don't need to be, or conform, or prove yourself to anyone.   Diversity includes all body shapes too!!  Go fight for your freedom.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1711030630.0, "datetime": "2024-03-21T14:17:10", "subreddit": "bulimia", "id": "kvw3qc6", "text": "I recovered from alcohol abuse and ED.   The Recovery from the ED was far harder. The booze...just don't buy it, be around it, have that first drink.   The frickin food?   Oh here is your demon 3X plus a day...but just moderate with no behaviors.   I hear you...it was truly day by day work to get free.  Day by day committed until the screaming urges died down. That's why I now guard my Recovery like a fragile child.  (Stfu ozempic ads!!  You are hurting some of us!)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1711116701.0, "datetime": "2024-03-22T14:11:41", "subreddit": "bulimia", "id": "kw1qior", "text": "It's because it's a vicious addiction.    I remember this specifically with my eating disorder and with booze when I was abusing that too.   It's not just the food itself.   It's the ritual,  the reasons WHY.  At one point when trying to control my poor sick mind, I wouldn't even binge;  I would just purge nothing at all. \n\nThis is a crippling addiction.   Please consider outside help.  It is not quick or easy. I wish I could tell you the opposite,  but it took me 2 years to Recover from 3 decades long ED.    It's a slow and steady process. \n\nThere are a few ways to recover,  so if one approach doesn't work, change gears and try again.   Even if you don't feel you are recovering \"fast enough \" or \"correctly\", the pure fight against it will bring back your self-respect because you are trying to fight this Beast.    In the last year of my Recovery I was doing it  alone without a team and that was fine because I had the information; the tools.   At the beginning attempts I tried an ED treatment clinic (didn't work at all for my personality)  but then after 2 more dieticians and 2 more therapists...I found a \"team\" that worked with where I was, not just going off some pre-determined chart.   I then moved away from that state to one with poor mental health coverage, so I had to do it alone.    By then I wanted to relapse bad...but I had already had a taste of freedom,  and I found out I wanted freedom MORE than what the ED gave me!!  This was a vital point in my Recovery. Once you taste freedom,  you know there is a different way to live.\n\nHuge tips for me for that successful push:  ditch the cruel scale, or at least put further and further amts of time between weighing until you can ditch the effing scale.    And also while recovering,  get rid of ANY and all clothing that only fits a body using ED behaviors.   And how I started was eating \"safe foods\" and not allowing Purging to be an option...no matter what!   Then increasing safe foods qtys...sitting in the uncomfortable...digest.   repeat.   Then add in moderate scary foods.. sit in the uncomfortable,  digest,  repeat.    Trigger or binge foods came only at the end.   You can only handle so much at a time.  You gotta eat the food. You have to let your body do what it wants to.  Simple but hard...but factual. You have to surrender to the process.  Scream, sweat, Journal...whatever you need to do, move furniture....but eat the food, sit with it, digest the food. \n\nRemember to always forgive yourself.   A slip is NOT a relapse.   You are relearning a new way to eat, digest, you may get intestinal upset in the beginning...you may have to relearn how to carry a different body on your frame, and how this feels physically and emotionally.    This is not a short or quick process .  One step at a time.\n\nRecovery IS possible.    This can be done.  You may never love your new body, but the freedom is PRICELESS.   Come over to Recovery.   We can eat and digest cookies over here...chocolate without guilt, visiting a restaurant without looking at the menu first, and join our people when socializing; being fully there.  \n\nYou could start today.   But it's baby steps and you have to be 100% honest with yourself.   You know what triggers you, you know when you are slipping or cheating.    This is your personal fight.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1713832653.0, "datetime": "2024-04-23T00:37:33", "subreddit": "EatingDisorders", "id": "l0tiqn4", "text": "Fantastic!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1713832718.0, "datetime": "2024-04-23T00:38:38", "subreddit": "EatingDisorders", "id": "l0tiwpq", "text": "Excellent post.  I totally agree", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1713832736.0, "datetime": "2024-04-23T00:38:56", "subreddit": "EatingDisorders", "id": "l0tiybo", "text": "Exactly", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1714176087.0, "datetime": "2024-04-27T00:01:27", "subreddit": "bulimia", "id": "l1fit2g", "text": "Fantastic!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1715290566.0, "datetime": "2024-05-09T21:36:06", "subreddit": "bulimia", "id": "l3cd6n3", "text": "Maybe this very difficult day is your Recovery beginning?!!   Wouldn't that be wonderful?   It would certainly change how you view this day looking back.\n\nThink of today and tomorrow as \"breaking the cycle\" of your ED.  Chipping away at it has to start somewhere...  maybe it's today!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1715392082.0, "datetime": "2024-05-11T01:48:02", "subreddit": "bulimia", "id": "l3iop2o", "text": "Always forgive yourself.   There's no perfect way to Recover.   So of it comes in bits and spurts, that's totally normal.   Just keep trying,  and celebrate every win..even those only you see.  ;)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716344599.0, "datetime": "2024-05-22T02:23:19", "subreddit": "AnorexiaNervosa", "id": "l543w0k", "text": "I would get another provider.  It's really about what's good for your Recovery.   Do what makes it easier to heal.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716900474.0, "datetime": "2024-05-28T12:47:54", "subreddit": "bulimia", "id": "l60n881", "text": "Every single win counts!!  Even the small ones...even the ones that no one else sees.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718719544.0, "datetime": "2024-06-18T14:05:44", "subreddit": "bulimia", "id": "l95mjr7", "text": "\"Happy\" by Pink", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720644695.0, "datetime": "2024-07-10T20:51:35", "subreddit": "bulimia", "id": "lcklajs", "text": "What is NOT attractive is being underweight as an aging woman.  I was still covering up my body at my LWG.  It was a real moment discovery.   We try to out run, out wit and out maneuver bodies we wish were different. \n\nThe body always wins.  It's called aging and death.  At some point the physical things we get from ANA Crumble to dust as we age.  I recovered into Menopause.   Recovery is possible,  and it's not easy but the freedom and quiet mind is do beautiful.   \n\nI gave up 3 decades to various EDs.  And I was never totally satisfied with what I saw in the mirror.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721939141.0, "datetime": "2024-07-25T20:25:41", "subreddit": "bulimia", "id": "lexfhv7", "text": "Well that was just plain rude of them.  Nosy bodies.  Your illness aside, you are a paying customer.   It sounds like they actually weren't concerned about you at all...more into shaming you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721939462.0, "datetime": "2024-07-25T20:31:02", "subreddit": "bulimia", "id": "lexgio0", "text": "Ok... he needs to become your EX-husband.  And I don't say that lightly.   My 2nd husband was not supportive at all....told me he would leave me if I got fat.  I had a 35 year long ED, but he just cared about how my body looked (actually how HE looked next to my body).   \n\nMy current husband was/is so incredibly supportive.   I chose to believe his reassurances, and was able to finally recover.   It was HARD, took me 2 years with one 3 month relapse in there, but my current husband was true to his word:  he loved me all the way through that hellish cycle and still does, with me in my recovered body.\n\nI'm sorry you have a partner who sounds like he cares more about finances than your health.  I hope you can find the strength to stand up for yourself in whatever way you can.   Then maybe you can also consider Recovery.   But Recovery has to be for YOU. 100%.  That's how it will stick.\n\nGood luck.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721998198.0, "datetime": "2024-07-26T12:49:58", "subreddit": "bulimia", "id": "lf0y72f", "text": "Congratulations on your Recovery process.  It starts with small repeated correct actions.   Keep going!  Freedom awaits!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721998312.0, "datetime": "2024-07-26T12:51:52", "subreddit": "bulimia", "id": "lf0yhg3", "text": "In so glad I was able to recover,  just as me and my husband were retiring.  Not only because of no steady money coming in, but because he is now home all day!!!   It would have been horrible.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726079795.0, "datetime": "2024-09-11T18:36:35", "subreddit": "bulimia", "id": "lmn8h7c", "text": "EXACTLY", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728679905.0, "datetime": "2024-10-11T20:51:45", "subreddit": "bulimia", "id": "lrgyblv", "text": "Beautiful post!  Keep going...you can Recover,  baby step by baby step.  Always forgive yourself.   You are doing the best you can.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729394572.0, "datetime": "2024-10-20T03:22:52", "subreddit": "bulimia", "id": "lssff5c", "text": "Doctors certainly don't know everything.  They receive virtually no training about eating disorders.  I was way UW, hair falling out and went to seek help, and my GP said \"oh, you don't look that bad \".   I had ED for 35 years.  I think I know more about my disorder than any Dr I have come across.   \n\nI recovered into Menopause.   It was not easy or fast.  It took repeated on-purpose actions AGAINST the screaming ED voices.  Slow and steady.   It started out very painful and panicky, but over time with very specific changed behaviors and reactions,  it started to hurt less and less. Repeat every day, every meal. Every snack.    Step by step.\n\nNo one wants to hear it, but Recovery takes surrender and then slowly acceptance.  It takes letting the body gain and weigh what it wants to.  I don't exactly love my Recovered body now, but I LOVE my calm quiet mind.   I can have a dessert without major internal anxiety or judgment...and I know I won't change my weight either way.  My number casually floats 3-5 lbs either way, with NO attempt on my part to change it.   And there-in is the Peace....whether I eat the dessert or choose not to, it doesn't matter to my weight or size.   It's a beautiful FREEDOM in letting go.\n\nBut it all starts with baby steps, celebrating EVERY small win, getting rid of all clothes that only fit you with ED behaviors..and weaning yourself from the taunting scale.\n\nRecovery is totally Worth it.  Mental freedom is PRICELESS.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729400831.0, "datetime": "2024-10-20T05:07:11", "subreddit": "bulimia", "id": "lssssmm", "text": "Awesome for your Recovery!   I'm in my 2nd year Recovered.   I'm never going back to that Hell.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729400891.0, "datetime": "2024-10-20T05:08:11", "subreddit": "bulimia", "id": "lssswno", "text": "Excellent Post!!  Good for you! So nice to read something so positive.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729400917.0, "datetime": "2024-10-20T05:08:37", "subreddit": "bulimia", "id": "lsssygt", "text": "Excellent Post!!  Good for you! So nice to read something so positive. I recovered too.  It's so wonderful to be free.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731710972.0, "datetime": "2024-11-15T22:49:32", "subreddit": "bulimia", "id": "lxcecqi", "text": "Congratulations!!  And body grief and acceptance of it is the last expected experience in Recovery.   Always forgive yourself.   You have done the hard work to achieve your wonderful Recovery.   Way to go!!", "parent_id": null, "link_id": null, "context": null}
