{"type": "post", "timestamp": 1595719820.0, "datetime": "2020-07-25T23:30:20", "subreddit": "fuckeatingdisorders", "id": "hxwip1", "text": "Do you ever get triggered by recovery youtubers? And I don't mean \"recovery\" youtubers, I mean actual recovery youtubers.\n\nFor some reason I find myself to be always so triggered by Megsy Recovery. She always said to never restrict yet she rigidly followed a meal plan - how can you not restrict AND follow a meal plan? Do you just magically feel full with average portions? - and sometimes even stated out loud that she'd gladly eat her breakfast all over again. (But she didn't, for some reason) She also somehow managed to never binge. Plus she recovered in this perfectly sized beautiful body that I'd never ever in one million years possibly get if I truly stopped restricting. Basically she looks like the poster child of recovery and I cannot relate.\n\nAnd she's not the only one - I see so many youtubers that \"stop restricting\" and \"recover\" while following a meal plan and being apparently satisfied with that approach, and staying lean and fit at the same time. And here I am with my messy extreme hunger, my over the top binges and my bloatedness and weight gain, feeling even more lonely than before.", "title": "Triggering recovery youtubers", "context": null}
{"type": "comment", "timestamp": 1595751972.0, "datetime": "2020-07-26T08:26:12", "subreddit": "fuckeatingdisorders", "id": "fza9bxm", "text": ">it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example).\n\nI agree with many parts of your post, but not on this one. I like Tabitha Farrar for this very reason: because she never stops to tell us that full recovery and a life without ED ARE possible. The idea of always having some problems with food for the rest of my life is so discouraging that if it was true I don't think I'd bother trying to recover in the first place. You're right in saying that recovery is incredibly hard and long and messy, and that's why I want to believe there's an actual endpoint rather than just \"being better but still having thoughts\".", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1595754499.0, "datetime": "2020-07-26T09:08:19", "subreddit": "fuckeatingdisorders", "id": "fzabqsv", "text": "I know. When I think about it, it's incredibly stupid of me to go on about picking random youtube videos apart and ranting about how imperfect they are...why would I even care about how much Megsy eats...but there you go, EDs are crazy. In the end, deep down, I think many of us watch these youtubers to basically get permission to eat, and not getting it gives more power to the ED itself.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1595754633.0, "datetime": "2020-07-26T09:10:33", "subreddit": "fuckeatingdisorders", "id": "fzabvc2", "text": "I have the same feelings about Tabitha Farrar. My ED absolutely hates her.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1595754837.0, "datetime": "2020-07-26T09:13:57", "subreddit": "fuckeatingdisorders", "id": "fzac2am", "text": "To be fair, I really don't want to hate on her - she seems a lovely person and if this is the path that worked for her, then I can only be happy. It just sometimes seems that her words don't fully align with what she shows in the videos, but I don't know her and the details of her recovery so maybe I shouldn't judge.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1595771306.0, "datetime": "2020-07-26T13:48:26", "subreddit": "fuckeatingdisorders", "id": "fzau0ie", "text": "May I suggest you Tabitha Farrar as well? She's basically what I was pre-ED (in terms of food) and what I'd like to go back to. Also, she's on the older side, which is quite refreshing in a community which is a bit centered on young, somewhat bubbly and \"\"\"\"immature\"\"\"\" girl (I don't mean it in a negative way - just to mean they might not be relatable for different demographics).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1595777796.0, "datetime": "2020-07-26T15:36:36", "subreddit": "fuckeatingdisorders", "id": "fzb51c8", "text": ">Effortless skinniness is a lie perpetuated to you to keep you forever unhappy. Skinny people work hard to stay skinny.\n\nWell...to be honest, before my ED I was skinny (just not AS skinny as with an ED) and I didn't really put any effort into it. I just happened to have a daily intake that was aligned with that. It was only with my ED that I found out (and started caring about) what a calorie was.\n\nI also didn't exercise, at least not formally, except for the odd hike.\n\nI agree with the idea that truly recovered people don't just think and talk about food the whole time.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1596967884.0, "datetime": "2020-08-09T10:11:24", "subreddit": "fuckeatingdisorders", "id": "i6h13f", "text": "And you can trick anyone else into thinking that it's really just because without a meal plan you \"wouldn't know\" how much to eat and \"you wouldn't remember\" to eat enough. But deep down you know that's not true. What you really, truly, genuinely mean to say is that without a meal plan you wouldn't know how to eat enough **and still not eat too much**.\n\nIt's really really easy to eat enough. And it's also really really easy to eat more if you're in doubt you haven't eaten enough and you're ready to eat more. You don't need any meal plan for that. If you don't do that it's because your ED makes you choose not to. It's not because you don't know how.\n\nIf you're unsure whether you've eaten enough or not, you could just eat more. The only thing stopping you from doing just that is your ED.\n\nThe only exception might be patients with extremely severe anorexia who are so underweight that their whole brain is literally unable to think clearly. But if you're out of any immediate danger, you **know** how much is enough, but a meal plan makes you feel safe that you won't go \"over\", or you won't gain weight \"too fast\".", "title": "In most cases, the only reason why we have a meal plan is because we are scared of eating too much.", "context": null}
{"type": "comment", "timestamp": 1596987690.0, "datetime": "2020-08-09T15:41:30", "subreddit": "fuckeatingdisorders", "id": "g0weyfp", "text": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596987795.0, "datetime": "2020-08-09T15:43:15", "subreddit": "fuckeatingdisorders", "id": "g0wf5o4", "text": ">I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food.\n\nIn other words, again: I don't know how not to eat \"too much\", with \"too much\" being \"the amount that leads me to a weight I don't like\".\n\nDo not think I'm being condescending. I know your fear all too well. I share that fear. But you have to be honest with yourself and recognize that it's not so much a \"but I **truly** need to watch my eating!\", because that's what literally everyone with an ED said ever.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596988054.0, "datetime": "2020-08-09T15:47:34", "subreddit": "fuckeatingdisorders", "id": "g0wfnuo", "text": ">But bingeing is a risk when in recovery from a restrictive ed.\n\nAnd what are the negative consequences of this \"risk\"? Besides purging, which is also a choice and a conscious action that can be avoided (although no one wants to hear that - btw I also purge). \n\n>It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”\n\nTherapy is not a basic biological function.\n\nHonestly I believe that one problem with us ED patients is that we don't like to hear that some things actually ARE under our control and we HAVE the ability to change them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596988765.0, "datetime": "2020-08-09T15:59:25", "subreddit": "fuckeatingdisorders", "id": "g0wgy3g", "text": "> I fully understand those are different things. \n\nAnd how are they different? When I give in to my extreme hunger I feel every single symptom attributed to a binge (feeling out of control, eating very quickly, eating out of feelings instead of real hunger, eating in secret, feeling shameful...my ED thrives on those beliefs) Also, why would a meal plan reduce the risk of starting binging compared to no meal plan? If you're treating the mental component, which can very well happen with or without a meal plan, then the meal plan becomes redundant in the first place, right?\n\n>meaning BOTH not too much\n\nWhat does it mean too much?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596989051.0, "datetime": "2020-08-09T16:04:11", "subreddit": "fuckeatingdisorders", "id": "g0whgov", "text": ">you need a balance of fat, protein, and carbs to nourish your body.\n\nPeople with EDs are possibly the most knowledgeable people about nutrition that I've ever known. I've rarely met someone who genuinely wasn't able to put together a balanced meal in terms of nutrients.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596989420.0, "datetime": "2020-08-09T16:10:20", "subreddit": "fuckeatingdisorders", "id": "g0wi4fh", "text": "> they put thought into action.\n\nAnd that's the whole problem, isn't it? \n\nThis is literally what I wrote in the whole post. We all know what to do, we just choose not to do it. If you are committed to do it (regardless of how much you actually want to), then you can do it with or without a meal plan. If not, then the ED will easily use the meal plan itself to its advantage as mine has done multiple times over at this point.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596989669.0, "datetime": "2020-08-09T16:14:29", "subreddit": "fuckeatingdisorders", "id": "g0wikli", "text": ">as the person bingeing will push themselves to continue eating past the point of physical fullness.\n\nLiterally every single person responding to extreme hunger has done that. \n\nNo, really. Eating past physical fullness is **extremely** common in extreme hunger. I would go as far as saying that extreme hunger cannot exist without eating past physical fullness at least once. Actually, scrape that, it's also common without extreme hunger due to physiological mechanisms. Physical fullness in general is a highly unreliable metric in recovery.\n\nThe funny thing is, every single word you wrote in this last reply is what my ED says to me on a daily basis, as in, \"you're only binging that's not extreme hunger because you eat past physical fullness and you're only mentally fucked\". Luckily enough I do not let triggers influence me too much these days because otherwise I'd be already out running my legs off and crying, lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596989869.0, "datetime": "2020-08-09T16:17:49", "subreddit": "fuckeatingdisorders", "id": "g0wixwc", "text": "Because, as I wrote in the opening post, eating too little is actually a *choice* that we make.\n\nA choice that feels **incredibly necessary**, but a choice nonetheless.\n\nLiterally no one, no one but our ED is stopping us from eating more if we're in doubt that we haven't eaten enough.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596990241.0, "datetime": "2020-08-09T16:24:01", "subreddit": "fuckeatingdisorders", "id": "g0wjmrk", "text": "I also get triggered so much by people telling me that eating past physical fullness is wrong, because that's what my ED also says. But I continued talking with you because I respect you, I know you mean well and I was interested in your point of view. I wish you well in your future recovery. :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596990296.0, "datetime": "2020-08-09T16:24:56", "subreddit": "fuckeatingdisorders", "id": "g0wjqly", "text": "Never did I ever said your ED was a choice. Mine also wasn't. But every day I choose to eat too little, and no one but myself is stopping me from eating more. That's the harsh and sad truth.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596992264.0, "datetime": "2020-08-09T16:57:44", "subreddit": "fuckeatingdisorders", "id": "g0wnfsz", "text": "Absolutely. If a meal plan helps you spiraling down even more then it's better than nothing. I think it's great that you know the true reason why you're following a meal plan and I'm sure this will help you go further in your recovery. :)\n\n(EDIT major mistake)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597004390.0, "datetime": "2020-08-09T20:19:50", "subreddit": "fuckeatingdisorders", "id": "g0xaujd", "text": "Lol I just realized that mistakenly wrote \"helps you spiraling down\" instead of \"keeps you from spiraling down\" and that completely changed my message. Now it sounds like I was being absolutely nasty. Oh my God I'm so sorry, I hope you still managed to get what I was trying to put across :D", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597016384.0, "datetime": "2020-08-09T23:39:44", "subreddit": "fuckeatingdisorders", "id": "g0xx24s", "text": "To be clear, I'm not here to tell you that you're doing recovery wrong, and in any case you should definitely keep listening to your guts and your treatment team rather than a random stranger on reddit like me.\n\nI just have personally found that a meal plan only serves to fuel my ED and that I cannot ever hope to truly recover by obsessing over healthy portions, wholesome foods, right caloric amounts, not swinging the other way and all that jazz. It's all good for the average person, but I'm not there at the moment. Additionally, I've learned that I need to be honest with myself and realize why I'm doing certain actions that I'd dress up as legitimate concerns for my health. In any case, I'm not against any approach; if you think that a meal plan is the best solution for you instead, then I can only say do it! Ultimately, the only right way to recover is the one that works - you do you and I hope that whichever road you choose it will lead you to a healthy, happy and fulfilling life free from any ED crap. :)", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1597058691.0, "datetime": "2020-08-10T11:24:51", "subreddit": "fuckeatingdisorders", "id": "i7316m", "text": "Don't get me wrong, it's great that we are kind to each other, listen to each other's fears and worries and try to be compassionate and understanding. A caring, supportive environment is always the best to achieve full and sustainable recovery.\n\nHowever, I also do feel that...I don't know, us with EDs don't really like to be told certain things - we know those to be true, but we hate hearing them nonetheless. \n\nSo here's some ideas that I have that usually get me into heated arguments with other people in recovery:\n\n1. **it is a choice to engage in any kind of behaviour**. You can say all you want that \"I can't help but restricting\", \"I can't stop purging\", \"it's beyond my control\" etc., but the harsh reality is that you DO have a choice. You DO choose to engage in those behaviours. You CAN choose not to. You didn't choose to have an ED, but you do choose everyday to keep having one. There is no one, no one but yourself that forces you to keep restricting, purging, exercising or whichever other behaviour characterizes your ED. \nAnd so many people interpret this as \"it's your fault/you just have to do it\", whereas this is absolutely not the case. What I am actually trying to put across is that you DO have the control to change your actions. And this feels incredibly empowering. Knowing that, you also know what to do next - which doesn't mean you have to do it alone; you may very well have to ask for help. But it's still up to you. \n\n2. **your triggers are your problem**. Yes, society is shit. Yes, people are often assholes. Maybe they try to be nice, and they fail. Maybe they don't understand how you feel. Maybe no one does. But as an adult living in the real world you cannot expect anyone to accommodate your issues. You probably also say a lot of stupid stuff that might hurt someone else and you don't know anything about it. That's life. Recovery is also learning to be confident enough that you don't have to be bothered by any random comment you read or run back to your ED everytime you feel uncomfortable. \n\n3. **you have to quit all the excuses**. You can trick your therapist, your dietitian, your parents, your friends, strangers on the internet and everyone else into believing all you want them to believe. That you \"forgot\" to eat, or you \"just want to walk to manage anxiety\", or that you \"are doing everything you can\". But in the end, the only person that loses is you. Real life doesn't care about any shenanigans and if you're not fully honest with yourself and the others you will just be wasting time that no one will give you back, while the rest of the world goes on without really caring about you.\n\nThat's it, thank you for coming to my shitty ted talk.", "title": "Sometimes I feel we need more 'tough talk' in recovery.", "context": null}
{"type": "comment", "timestamp": 1597064227.0, "datetime": "2020-08-10T12:57:07", "subreddit": "fuckeatingdisorders", "id": "g0zmhcf", "text": "To be completely honest, sometimes I think this passive language is even counterproductive. I am not a poor sweet honey child who can't stand hard stuff and needs to be pampered. I am an adult. I don't need to be sheltered by the horrors of the world. I have the resources to deal.\n\nBut again, that's really just me. And I understand that some people are very very fragile and may need something different to avoid collapsing. There's also there's a fine line between \"tough talk\" and \"needlessly being a prick\".", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597065872.0, "datetime": "2020-08-10T13:24:32", "subreddit": "fuckeatingdisorders", "id": "g0zox66", "text": "As Tabitha Farrar once said in her videos, you can't control your brain bringing up the thought, but you can choose not to believe the thought and not to dwell on it. In other words, you cannot help feeling shit after eating if that's the reaction your brain has practiced over the years, but you can choose how to respond to that feeling. Just as for the first few times flying you may not be able to help but having an instinctive moment of dread when your plane takes off, but you also know that you don't really *believe* in that dread.\n\nWhen I say \"you choose to keep having one\", I mean that the choices you make are conductive to you keeping having an ED. Of course you can't just stop having an ED overnight (oh, I wish...).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597078347.0, "datetime": "2020-08-10T16:52:27", "subreddit": "fuckeatingdisorders", "id": "g10ch5w", "text": ">You made a very blanket statement in your initial post, though. You said \"in most cases\" people in recovery shouldn't be on a meal plan because they are scared of overeating.\n\nAnd I stand by that statement.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597079931.0, "datetime": "2020-08-10T17:18:51", "subreddit": "fuckeatingdisorders", "id": "g10fr2n", "text": "Accepting that you have the power to stop is absolutely not disliking yourself - quite the opposite. It's the first step towards taking back the control of your life. And I believe that it will feel even more of an achievement when you've realized that you CAN do it. You will like yourself even more for that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597080212.0, "datetime": "2020-08-10T17:23:32", "subreddit": "fuckeatingdisorders", "id": "g10gc8h", "text": "To be honest, I believe that being honest and blunt IS being supportive, simply because I believe it's the only way that can lead people to recover.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597080769.0, "datetime": "2020-08-10T17:32:49", "subreddit": "fuckeatingdisorders", "id": "g10hi45", "text": "I'm speculating here because I know nothing about you really, but maybe it's a different type of harsh voice. To use a metaphor, I imagine that the harsh voice of an evil boss constantly treating you like crap and making your life miserable is different from the harsh but loving voice of your mom telling you that you need to GTFO and find a new job ASAP. Isn't it? :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597081068.0, "datetime": "2020-08-10T17:37:48", "subreddit": "fuckeatingdisorders", "id": "g10i4lh", "text": "Qualifications are irrelevant in this case. I'm not dismissing the potential benefit of a meal plan. What I'm discussing is the reason why most patients choose it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597081452.0, "datetime": "2020-08-10T17:44:12", "subreddit": "fuckeatingdisorders", "id": "g10ixgn", "text": ">You're telling people with eating disorders that they shouldn't follow a meal plan.\n\nI'm telling people that they are probably not being honest in why they follow a meal plan. They can absolutely do whatever they like. I also follow a meal plan myself.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597082990.0, "datetime": "2020-08-10T18:09:50", "subreddit": "fuckeatingdisorders", "id": "g10m5b9", "text": "Thank you for sharing your experience and for rephrasing, probably in a better and more articulate way, what I was trying to express. :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597101384.0, "datetime": "2020-08-10T23:16:24", "subreddit": "fuckeatingdisorders", "id": "g11nqsr", "text": "I don't want my post to be interpreted as \"man up\". I'm very against this kind of gender stereotypes :) and I know how lonely and shameful it feels to be a guy with an ED. But the point is not to harden up and stop whining, the point is just realizing that you have all you need to change this situation, and that taking responsibility doesn't mean playing a blame game - it doesn't mean wallowing in self-pity because you were too much of a dumb shit to change. It means knowing that however shitty, unfair and miserable it might feel, it is your problem and only you can get out of it. It means accepting that no one is forcing you to engage in behaviours and you can actually take steps to stop. Part of this awareness can also mean being humble enough to recognize that you're not accountable, or that you need help, or that you do not feel like taking those steps just yet (and maybe do not even want to). \n\nIt's not my intention to break anyone down and calling people out for fun. What I want to do is to convey the message that no matter how helpless and desperate you feel at the moment, no matter how out of control it seems, it's not out of your control. You have a choice. You have a way out. And you can choose to follow that way out.\n\nFor me personally, once I realized that, it was like a gate had opened - a new world of possibilities. But of course it was also bittersweet, because it meant that the next steps were up to *me* and *me only* and I could no longer convince myself that I had no other alternative and that I couldn't do anything about it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597102255.0, "datetime": "2020-08-10T23:30:55", "subreddit": "fuckeatingdisorders", "id": "g11pdd3", "text": ">But the only way to keep moving forward is to forgive myself. I acknowledge that I fucked up but I also remind myself that it doesn’t make me weak, or a bad person, or incapable, or worthless.\n\nExactly. Recognizing you are responsible for your own actions doesn't mean beating yourself up when you take the \"wrong\" ones (\"wrong\" may not be the best word choice here but bear with me). It simply means saying \"okay, I fucked up and it sucks - but I can move on from here and next time I'll do better\". Everyone fucks up all the time. That's how we learn.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597143472.0, "datetime": "2020-08-11T10:57:52", "subreddit": "fuckeatingdisorders", "id": "g139dja", "text": "Thank you for contributing as well. You raised really insightful points. :)", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1597489560.0, "datetime": "2020-08-15T11:06:00", "subreddit": "fuckeatingdisorders", "id": "ia5ghp", "text": "I'm sitting here after my lunch feeling so sad and depressed because I religiously followed my meal plan and I want more but I can't because my meal plan should satisfy me and I'm at a normal weight. Lunch was a 'normal' portion and felt so small and miserable at the same time.\n\nI know that if I start eating more right now, I would end up eating thousands of calories. And then I can already hear those voices telling me I'm an emotional eater, I've swung the other way and I'm just binging mindlessly to numb my emotions and I use recovery as an excuse to stuff my face so I have to restrict forever.\n\nEvery day is like this. My whole life is like this.\n\nI will never make it. I will never get through it.", "title": "I'm crying because I'm hungry but I cannot eat what I want. Like every day of my life.", "context": null}
{"type": "comment", "timestamp": 1597498687.0, "datetime": "2020-08-15T13:38:07", "subreddit": "fuckeatingdisorders", "id": "g1l7qaa", "text": "Sometimes I regret having read recovery material and sought therapy at all.\n\nAfter my initial phase of severe restriction and malnutrition, I was so underweight and so hungry and messed up that I just couldn't help but eat. While looking for help I came across a post on extreme hunger (I believe it was Tabitha Farrar) and I just ate. I didn't give it any second thoughts. I gained a lot of weight in a short time but I didn't care. I was happy and finally felt free.\n\nThen I approached a healthy weight, got scared, went to a dietitian and a therapist, read a lot about the 'healthy' way to recover and the emotional aspects of EDs and so on...and here I am.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597512839.0, "datetime": "2020-08-15T17:33:59", "subreddit": "fuckeatingdisorders", "id": "g1mfid1", "text": ">I think it’s super important to follow medical guidance in treatment.\n\nThat's what I've been doing for the past few years. Yet here I am...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597513110.0, "datetime": "2020-08-15T17:38:30", "subreddit": "fuckeatingdisorders", "id": "g1mgg0d", "text": "It's been years and I've honestly stopped believing it's gonna get any better, at least not with this approach. I don't think that after years there's gonna be somehow a magic switch.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597518122.0, "datetime": "2020-08-15T19:02:02", "subreddit": "fuckeatingdisorders", "id": "g1mvpub", "text": "Never did I ever imagine someone would recognize my name!! Love you too <3\n\n(And yes, I am very much in recovery. Or, better said, \"\"\"\"\"\"\"\"in recovery\"\"\"\"\"\"\" aka pretending to be in recovery)", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1598784110.0, "datetime": "2020-08-30T10:41:50", "subreddit": "fuckeatingdisorders", "id": "ijasxb", "text": "And that \"focusing on food is a way to cope with the fact that I feel out of control in my life\".\n\nNo it's not.\n\nThe only reason why I feel out of control in my life is because I have a fucking ED that doesn't allow me to focus on what truly matters because I can't stop thinking about food. \n\nAnd the only reason why I feel \"in control\" when I restrict is because I am afraid of gaining weight and I am afraid of giving in to my extreme hunger, therefore my brain rewards me for that - guess what, I have an ED, therefore I feel \"in control\" when I engage in ED behaviours. Who'd have thought.\n\nThe only reason why I feel anxious around mealtimes is because I am afraid of eating too much and gaining weight.\n\nThe only reason why I feel \"out of control\" when I binge is because I don't want to gain weight and binges are conductive to that. My brain uses feelings of fear, guilt and self-loathing to motivate me not to binge anymore.\n\nPeople who are afraid of spiders feel \"in control\" when they stay away from spiders and their brain rewards them for staying the fuck away from spiders. No shit Sherlock.\n\nMy life wasn't perfect before the ED and it won't be perfect after it (if there's ever gonna be an \"after\"). But I felt so much more \"in control\" when I could engage in normal adult activities. I felt so much more \"in control\" when I didn't care about food or calories and didn't feel the need to compulsively restrict my food in order to stay under an arbitrary caloric amount, like that was the single most important task in my entire existence. \n\nI don't feel \"in control\" now. I feel trapped, possessed, consumed.", "title": "So tired of being told that my ED is about \"control\"", "context": null}
{"type": "comment", "timestamp": 1598832613.0, "datetime": "2020-08-31T00:10:13", "subreddit": "fuckeatingdisorders", "id": "g3eyvll", "text": "Honestly, just don't go there. There is nothing of value that you might need in that sub. You know it's gonna be harmful for you. You know it's only your ED that wants you to go there. Your ED loves that sub.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1599569646.0, "datetime": "2020-09-08T12:54:06", "subreddit": "fuckeatingdisorders", "id": "iot0gs", "text": "So, yesterday I had a binge. A really, r e a l l y massive one. This alone already feels like the biggest most catastrophic event ever happened in the entire history of the universe. The fact that I'm at a healthy weight makes it even worse, if possible. My ED is yelling at me that this is just the beginning and I'm en route to becoming infinitely obese and the world will just end. It's literally throwing its most powerful weapons at me all at once and it's INCREDIBLY convincing. I cannot stress enough how desperate, scared and hopeless I'm feeling right now.\n\nThat said.\n\nI slept better last night. It had been several nights of bad sleep but last night I slept well and never woke up - also because I didn't drink my usual [insert excessively high number of] cups of caffeine-free tea and diet sodas, therefore I didn't have to pee all the time.\n\nI'm wearing short sleeves today. I'm not cold.\n\nI'm *somewhat* less hungry than yesterday. My mind is *slightly* less consumed with pictures of mountains of peanut butter to gorge on.\n\nTime goes by faster! I found myself staring less compulsively at the clock waiting for the next meal to come.\n\nMy mind feels freer. I just spent a couple hours straight working on a project without realizing I wasn't thinking about food.\n\nI'm less fidgety. I'm just sitting on my chair like that.\n\nI don't know what this is supposed to mean. Probably nothing. And it's not like I don't plan to go immediately back to restricting. The fear of weight gain is just too overwhelming. But anyways. Maybe it will be helpful to someone.", "title": "The benefits of a binge (?)", "context": null}
{"type": "comment", "timestamp": 1599571376.0, "datetime": "2020-09-08T13:22:56", "subreddit": "fuckeatingdisorders", "id": "g4fsy36", "text": "I know what you mean, it's just that I already maintain a healthy weight by eating an adequate (according to the dietitian) amount of calories on a daily basis, therefore I'm very very resistant to upping calories. I guess my body is just broken.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600691090.0, "datetime": "2020-09-21T12:24:50", "subreddit": "fuckeatingdisorders", "id": "g63ef4u", "text": "I am exactly like your \"before\", except I'm no longer underweight, therefore I don't feel justified to gain :(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1602415335.0, "datetime": "2020-10-11T11:22:15", "subreddit": "fuckeatingdisorders", "id": "g8gz0qw", "text": ">I’m a 135 lbs. woman and my daily calorie intake, according to calorie calculators, should be 1800-2000 kcal. When I was in quasi-recovery, I stuck to these numbers religiously and I continued to lose weight.\n\nI'm an adult male and I'm currently maintaining a healthy weight on that amount. Still very hungry :(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1603058765.0, "datetime": "2020-10-18T22:06:05", "subreddit": "fuckeatingdisorders", "id": "g99kb5w", "text": "I can't manage to go \"all in\" because I'm already at my pre-ED weight (a \"healthy\" weight) and I can no longer \"afford\" to gain 25 lbs as you did...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1603059021.0, "datetime": "2020-10-18T22:10:21", "subreddit": "fuckeatingdisorders", "id": "g99krt9", "text": "If I try to practice intuitive eating I end up binging messily...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1604223716.0, "datetime": "2020-11-01T09:41:56", "subreddit": "fuckeatingdisorders", "id": "gas13z5", "text": "It's not even true by the way - the actual % of people going from restrictive EDs to uncontrolled long term BED is very low. Most of the time people just tend to recover into the weight they had before their ED, whatever that may be.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1604577333.0, "datetime": "2020-11-05T11:55:33", "subreddit": "fuckeatingdisorders", "id": "johios", "text": "Basically eating normal meals for me means that I have to restrict more for the rest of the day. So I always have the temptation to default back to OMAD because at least it's a huge meal.\n\nDoes anyone else have the same problem?", "title": "I hate eating \"normal\" meals because that means I won't have one bigger meal later on in the day.", "context": null}
{"type": "comment", "timestamp": 1604620855.0, "datetime": "2020-11-06T00:00:55", "subreddit": "fuckeatingdisorders", "id": "gbacd67", "text": "Yes, because if I try to stop counting calories I end up raiding the whole pantry.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1604620891.0, "datetime": "2020-11-06T00:01:31", "subreddit": "fuckeatingdisorders", "id": "gbacgea", "text": "My problem is the stopping when I'm full part...my stomach and my brain don't know such a sensation anymore :(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605303521.0, "datetime": "2020-11-13T21:38:41", "subreddit": "fuckeatingdisorders", "id": "gc6z8mj", "text": "What if you don't exercise or work out though :/", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605345770.0, "datetime": "2020-11-14T09:22:50", "subreddit": "fuckeatingdisorders", "id": "gc8nero", "text": "I'm eating much more than that and I'm still hungry :(", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1606411694.0, "datetime": "2020-11-26T17:28:14", "subreddit": "fuckeatingdisorders", "id": "k1jdup", "text": "I don't wanna deal with this shit for the rest of my life.\n\nI don't wanna \"manage\".\n\nI don't wanna have lingering thoughts that I get somewhat better at ignoring.\n\nI don't wanna be functional but low-key struggle inside at the same time.\n\nI don't wanna \"focus on a healthy diet\" or \"count calories but the healthy way\" or \"manage my weight\".\n\nI don't wanna \"have something like an addiction\" that flares up in times of stress.\n\nI don't wanna \"get better\".\n\nI just don't wanna have an ED.\n\nHow the fuck is \"you can never fully recover\" supposed to be motivating? It's the single most depressing thing ever. Why would I even bother trying to recover in the first place if that was true? Why would I wanna live a life like that?", "title": "Whenever I hear someone saying that you can never fully recover from an ED, I just wanna kill myself.", "context": null}
{"type": "comment", "timestamp": 1606415594.0, "datetime": "2020-11-26T18:33:14", "subreddit": "fuckeatingdisorders", "id": "gdoqzlt", "text": ">That’s how I think that my eating disorder will be. I may be recovered, but the thoughts are still there. There can be weeks that I go without even thinking about it. But the thoughts pop up from time to time. \n\nThat's what I was talking about in the post. If that's the best I can hope for I might as well just kill myself already. I don't see the point. I don't even care about trying.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606561929.0, "datetime": "2020-11-28T11:12:09", "subreddit": "fuckeatingdisorders", "id": "gduwuwd", "text": "Unpopular opinion:\n\nI am fully aware that this kind of posts comes from a good place and they're genuinely meant to be helpful. Yet I still find them somewhat problematic. I honestly believe that most of us with an ED do know that 1200 is bullshit, unless we are deep into that super-restrictive honeymoon phase where we can't fathom eating an extra slice of apple, and we have enough experience with TDEE calculators to have a rough idea of what we actually need to maintain our weight. Everyone has its own idea of what is restriction and what is \"needed\" or \"allowed\" and it might be problematic to use a single figure (like say 1200) as a blanket benchmark, because it tends to reinforce the idea that everyone with an ED eats less than 1200 a day - and therefore if you eat more than that you don't have an ED, because you know how ED logic works! In my case for example I eat way more than that on a daily basis, yet I am still restricting very much and I still have an ED, I promise. So I'm not sure what am I supposed to do with this info other than use it as yet another proof that I'm eating way too much.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606738472.0, "datetime": "2020-11-30T12:14:32", "subreddit": "fuckeatingdisorders", "id": "ge541a1", "text": "I'm happy for you :)\n\nbut the problem is also \"when\" it subsides... :(", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1607433754.0, "datetime": "2020-12-08T13:22:34", "subreddit": "fuckeatingdisorders", "id": "k942cb", "text": "Like, seriously? 1800 or 2000 calories a day? That's supposed to be a lot of food? That's supposed to be plenty and satisfying?", "title": "Whenever I read the number of calories I'm supposed to eat for the rest of my life I just get depressed.", "context": null}
{"type": "comment", "timestamp": 1607439511.0, "datetime": "2020-12-08T14:58:31", "subreddit": "fuckeatingdisorders", "id": "gf23awf", "text": "The saddest thing is, I used to be like that not long ago, before my ED started. I didn't count calories (didn't even know what a calorie was lol) but if I had to give a ballpark figure I would say I'd hardly hit 2,000 on a daily basis, at least after I had stopped growing. But that was absolutely enough for me at the time - I would never feel deprived neither physically nor mentally. I would actually have smaller meals than some of my restriction meals today. And the thought of 6,000 cal would just make me sick; I mean, I guess I could picture myself eating a whole cake or something and have a laugh, but then I didn't actually *want* it, and if I did try I would just feel terrible and bloated.\n\nSkip to now, and 2,000 just seems so low and I want to eat infinite calories :'(\n\nAnd fuck I even used to have SNACKS! Like actual proper snacks! And they did fit into my day nicely! Who the fuck has room for that now??", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607440043.0, "datetime": "2020-12-08T15:07:23", "subreddit": "fuckeatingdisorders", "id": "gf24b24", "text": "The amount of food I can put down in a single setting without even feeling satisfied, when I allow myself to do so, is honestly quite embarrassing. I've been called by my friends \"the hungriest person ever\" lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607516350.0, "datetime": "2020-12-09T12:19:10", "subreddit": "fuckeatingdisorders", "id": "gf5st2z", "text": "My ED loves balance and moderation (to the point that I am scared of eating a meal that has no fats, proteins or fibers for example) , and my only bad food is calories. I can eat just about everything as long as it fits within that caloric amount, but I'm not even gonna touch a single zucchini if it goes over the limit.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607534450.0, "datetime": "2020-12-09T17:20:50", "subreddit": "fuckeatingdisorders", "id": "gf6pce4", "text": "But I did try to stop calorie counting, is just that every time I try I eat WAYY more than 2,000. I can't \"intuitively eat\" 2,000 calories unless I purposefully restrict, it's just too little.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607556792.0, "datetime": "2020-12-09T23:33:12", "subreddit": "fuckeatingdisorders", "id": "gf80c0q", "text": "So you're telling me that I'll have to restrict and track for another 1-2 years before I start feeling like I'm not restrictive and I can stop tracking without ending up binging? Sounds horrible since I've already been following a meal plan for years :(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607779245.0, "datetime": "2020-12-12T13:20:45", "subreddit": "fuckeatingdisorders", "id": "gfitlke", "text": "I don't like her as a person and don't care about her as a youtuber, but I guess some people took her as an example because she was a fit and fairly high-profile youtuber who just started eating to satiety without any restriction, which is what many people in recovery want to do (me included lol). \n\nIf anything I have a problem with Gwyneth Olwyn, but seems like she's no longer mentioned lately, which is good.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607789864.0, "datetime": "2020-12-12T16:17:44", "subreddit": "fuckeatingdisorders", "id": "gfjmhcb", "text": "IIRC she used to make up the same \"lies\" before, masking her cheat days and her intermittent fasting or whatever as her true natural way of eating. But I never really followed her so I don't know.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1608895054.0, "datetime": "2020-12-25T11:17:34", "subreddit": "fuckeatingdisorders", "id": "kjxh72", "text": "I definitely ate wayyyyy over my \"limit\". And when I say way over I don't just mean that I had a couple cookies. I mean actually WAY over. And yes my ED is screaming at me. But whatever. Once you actually commit to not listening to it, it's surprisingly easy to just carry on eating.\n\nI don't know what's gonna happen in the next few days. I'm very likely gonna freak out no later than next week over the infinite weight gain that just happened and all the bloat and the protruding belly and I'll feel horrible as ever. But you know what? Food has actually made me much more relaxed than when I restrict - it's like my body is saying \"oh thank God, there's some fucking food finally\".\n\nYesterday was a nice day with my family and loads of delicious foods and today is gonna be the same.\n\n*sorry for the typo in the title, it's \"I ate a lot yesterday\"", "title": "I eat a lot yesterday at Christmas eve. I'm ALSO gonna eat a lot today at Christmas.", "context": null}
{"type": "post", "timestamp": 1609085185.0, "datetime": "2020-12-27T16:06:25", "subreddit": "fuckeatingdisorders", "id": "kl6273", "text": "I can see all the excuses playing in my head.\n\nYou ate a lot, you don't need anymore food.\n\nYou need to restrict because there's gonna be NYE soon and you need to prepare because you might eat even more.\n\nYou've already gained weight over the holidays, it's not like you're underweight anyway, you can just stop here.\n\nYou need to lose the water weight.\n\nYou can't just binge for life.\n\nEveryone eats a bit less after the holidays, why wouldn't you?\n\nAnd once again I'm not doing anything to stop this. Once again I'm allowing myself to be conquered and subdued. It's a self repeating cycle I can't manage to get myself out of. I feel utterly powerless even though I know I'm not.", "title": "Christmas is over, and my ED brain is already defaulting back to restriction and old rituals.", "context": null}
{"type": "post", "timestamp": 1609590976.0, "datetime": "2021-01-02T12:36:16", "subreddit": "fuckeatingdisorders", "id": "kowtm3", "text": "Yes it feels even worse than binging.\n\nI'm not really afraid of feeling full (I mean I am, but that's not the point). I'm more afraid of NOT feeling full after a meal, which always happens when I eat normal meals. At least if I skip a meal or massively undereat I can tell myself that it's obvious if I don't feel full. But if I eat a normal meal and then I still not feel full/satisfied (which, again, happens pretty much all the time), then what's left? It just means I'm fucked and there's something wrong with me.\n\n(and adding protein/fibre/water, eating mindfully or something like that doesn't help either - I've eaten more protein than you humans can imagine lol)", "title": "Eating \"normal meals\" feels worse than anything else, and few people seem to be able to understand this.", "context": null}
{"type": "comment", "timestamp": 1609592394.0, "datetime": "2021-01-02T12:59:54", "subreddit": "fuckeatingdisorders", "id": "ghtnfr7", "text": "Or on the other hand it makes you want to restrict even more, because if you have to restrict anyway then what's the point in having a meal plan? I might as well just do it on my own terms.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610452171.0, "datetime": "2021-01-12T11:49:31", "subreddit": "fuckeatingdisorders", "id": "gizpbtb", "text": "That's one of the reasons I dislike the \"body positivity\" movement. I see all these people who are \"recovered\" or \"in recovery\" whose profiles are basically just countless body pics. I respect that if that's what helps them, but I personally believe that recovery should be about shifting your focus away from food and body issues entirely. \n\nThis honestly holds true for the \"fat acceptance\" movement as well - again, it's absolutely great that you feel confident in whatever appearance or body size you have and you can live your recovery however you want but I don't know, equating yourself with your body or your looks just strikes me as a little bit problematic and a little bit too similar to what so many people with EDs do.\n\nAnd yeah, you don't need to be \"beautiful\" to have a good life. I am quite ugly honestly. I know that, everyone knows that, and it's okay. I can get by without being told or convincing myself that I'm attractive.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1612608686.0, "datetime": "2021-02-06T10:51:26", "subreddit": "fuckeatingdisorders", "id": "gm7yn5v", "text": "I know. That's why I have such a hard time following meal plans. Normal meals never fill me up and at least if I skip meals altogether I know for sure that I haven't eaten enough, whereas if I have a normal meal and I'm still hungry I'm only left thinking that I'm fucked up. It's even more frustrating when people jump in telling you that it's because you haven't eaten enough fats/proteins/whatever, when you know that's not true.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613602750.0, "datetime": "2021-02-17T22:59:10", "subreddit": "fuckeatingdisorders", "id": "gntk2e7", "text": "If I have to be truuuuly honest...\n\nI once made a post on another subreddit where I wrote that BED as a term/diagnosis/self-diagnosis gets thrown around a bit too much, according to the view of me. Most often people who come from restrictive backgrounds and say they \"got BED\" actually have still some sort of restriction going on, either actual straight up restriction - like, fasting/purging or eating overly healthy for days after a binge - or mental restriction (feeling extreme guilt and shame around food, etc.). So in those cases I would actually say they have bulimia or ednos, but who am I to judge.\n\nI do believe that actually transitioning from restriction to BED is a very rare occurrence that honestly shouldn't be a real concern for most of us. I mean, our body DOES have self-regulating mechanisms that DO work if we listen to them, and it just makes no sense that we just keep binging endlessly if we didn't use to do it before our restrictive ED kicked in.\n\nNow, I am also one that feels I \"got BED\" after eating an extra slice of turkey and I will DEFINITELY be the rare exception who will just binge into oblivion, but that's because I'm a fucked up hypocrite. And yes, the posts you're referring to are indeed extremely scary and demotivating because they feel like a validation of all my darkest ED fears. Even if I were indeed at risk of BED what's the point of raising the fear?", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1613663244.0, "datetime": "2021-02-18T15:47:24", "subreddit": "fuckeatingdisorders", "id": "lmpo7q", "text": "I'm sorry.\n\nI know it's hugely unpopular, and I know some of you do it. But honestly, I don't believe it. I think it's just one of the many excuses we put together. I believe that in the vast majority of cases we *know* what's the bare minimum. We *do* have an idea. We're just scared of accidentally eating more than that, so we count calories to actually make sure we don't eat too much. \n\nNow, there are certain people, especially those who are very young and very deep into AN, who genuinely might have impaired cognitive capabilities and might truly not be able to recognize what's a \"sufficient\" amount of food. But usually those are looked after by professionals, so let's just say I'm not referring to them. I think that really most adults do have an idea of what a portion size is and don't need to count calories for that.\n\nLet's say you have doubts that you haven't eaten enough. What's stopping you from just going and eating more? Maybe you don't feel ready to do so, don't feel brave enough to do so, which is totally okay and absolutely normal, but it's a different issue.\n\nOr let's say that you have no guidance and just feel scared and overwhelmed and don't even know where to start. Say you struggle with binging and purging and just want to be stable for a while. You can try and visually guess what a minimum amount of food is by looking around. Look at what others are putting on their plates during meals. Look at fast food portions. Think about what you'd feed another person with. Imagine you have a child to take care of and that child comes home after school and you have to make lunch for him. Or imagine you have a friend over for dinner. Would you count calories in that case? Or maybe you would just estimate? I'm sure it's in your ability to do so.\n\nAlright my little rant is over :)\n\nEDIT: apparently some people felt upset and invalidated by my comments. That absolutely wasn't my intention - I believe what I wrote is true in most cases, but I do respect everyone's personal experiences.", "title": "I don't believe in the \"I count calories to make sure I'm eating enough\"", "context": null}
{"type": "comment", "timestamp": 1613664274.0, "datetime": "2021-02-18T16:04:34", "subreddit": "fuckeatingdisorders", "id": "gnwbqff", "text": "Genuinely curious and really not meaning to be pushy or judgemental - if you had to prepare food for others, how would you go on about it? Would you feel able to, say, use visual cues to estimate without counting calories, or use some non-caloric information as reference?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614031056.0, "datetime": "2021-02-22T21:57:36", "subreddit": "fuckeatingdisorders", "id": "goe0wt2", "text": "I know this comes from a good place, and I'm sorry that you're going through this. But honestly, what's the point of posting this in a thread that has a clear aim in another direction? Everyone of us is already scared to death of developing BED.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614031166.0, "datetime": "2021-02-22T21:59:26", "subreddit": "fuckeatingdisorders", "id": "goe15hr", "text": "I remember your posts lol. I'm so happy that you are where you are now. I hope you realize how far you've gone and how much you've accomplished!\n\nNow a bit of a selfish question: did you stabilize at a healthy weight? Selfish because I'm just looking for some reassurement, haha. But you don't need to answer if you don't feel like it.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1619616483.0, "datetime": "2021-04-28T13:28:03", "subreddit": "fuckeatingdisorders", "id": "n0espi", "text": "It's not the same thing!\n\nI so often see people in recovery saying that they stopped restricting, or that they don't restrict, and encouraging others to do the same...yet when they show what they actually eat it's just a very normal meal plan with normal or even small-ish portions.\n\nI mean...I don't wanna invalidate or gatekeep them, I'm sure they believe what they say, but is it possible that for every single person in recovery out there \"stop restricting\" magically means \"eating in a very balanced way according to a perfectly crafted meal plan that just allows you to maintain your weight and maybe slowly gain a bit over time\"? Meanwhile I'm here binging my ass off everytime I try to \"stop restricting\".\n\nAnd I'm not just talking about people who are \"in recovery\" but actually not. I'm also referring to youtubers/instagrammers/whatever who do seem to be genuinely in recovery. And actually even dietitian themselves now that I think about it.\n\nMaybe it's just me. Maybe I'm misinterpreting everything. But it's just that for me personally I can't imagine how \"stopping restricting\" and \"eating normal meals\" can go together. \"Normal meals\" feel restrictive and these people make me feel even crazier. I saw someone the other day telling something along the lines of oh, I used to obsess so much about this food but since I stopped restricting it I no longer think about it. Girl you eat like two mouthfuls of it once a day, please tell me your secret and how you managed to stop obsessing over it with those measly amounts!", "title": "Why is it that often \"stop restricting\" is interpreted as \"don't eat less than your meal plan\"?", "context": null}
{"type": "comment", "timestamp": 1619630402.0, "datetime": "2021-04-28T17:20:02", "subreddit": "fuckeatingdisorders", "id": "gw70ds1", "text": "I'd just like to point out though that what you say might be true, but at the same time being terrified of something doesn't make it any less of a reality.\n\nI never had BED and I'm also terrified of eating \"whatever and whenever\" (I mean, pretty much any ED sufferer is), but I also know that that's what \"stopping restricting\" would mean for me, at least in the short term.\n\nObviously everyone should do recovery as they feel most comfortable, I don't think the two things necessarily contradict each other. Actually I think a common therapy approach is to let people gradually ease restrictions starting with the smaller ones.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619630594.0, "datetime": "2021-04-28T17:23:14", "subreddit": "fuckeatingdisorders", "id": "gw70ux0", "text": "While I do get your point, my personal experience pre-ED was that I had a very moderate, balanced diet but I didn't really \"restrict\". To me restriction is voluntary, whereas pre-ED I just happened to eat like a normal person without really \"applying\" moderation if that makes sense. Right now though anything close to \"normal\" would be restriction for me. But again that's really just my experience fwiw...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619685243.0, "datetime": "2021-04-29T08:34:03", "subreddit": "fuckeatingdisorders", "id": "gw9wjp7", "text": "> Eating \"whatever whenever\" can cause or be binge eating.\n\nWell, speaking of things that scare people away from recocery...this definitely does.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621003620.0, "datetime": "2021-05-14T14:47:00", "subreddit": "fuckeatingdisorders", "id": "gy3sxsh", "text": "Counterpoint as food for thought (pun intended).\n\nI fully embrace the idea of eating without restriction (*truly* without restriction) to recover, whatever way you wanna call it, \"all in\" being one of them. And I also agree with the concepts of accepting yourself at any weight etc.\n\nSo just to make that clear beforehand and let you know that we're mostly on the same page recovery wise.\n\nBut the problem is, this method of recovery has been \"taken over\" by certain people and rhetorics. Very common concerns in the style of \"will I gain weight forever? Will I just binge myself to oblivion? Will I ever stop eating?\" get dismissed somewhat snidely as disordered thoughts of a poor soul in denial, or worse downright silenced with comments like weight is not correlated to health which are frankly bullshit and make me just as angry as people trying to scare me off purging because \"you only purge half the calories\" or the whole ridiculous starvation mode pseudoscience. Not to mention the \"fatphobia!!\" mantra.\n\nSo you inevitably have loads of people that are already in a very shaky, unstable and anxiety-ridden place who get irrationally angry towards it, because they just can't make sense of it and feel they're being treated passively-aggressively as dumb children if they try to raise some concerns and issues.\n\nSo yeah. This recovery method is valid, and can work, but those who are scared about it need to be treated as adults and their fears need to be addressed constructively. There's toxicity from both sides and we need to be aware of it if we want people to actually recover.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621004086.0, "datetime": "2021-05-14T14:54:46", "subreddit": "fuckeatingdisorders", "id": "gy3u0x4", "text": ">your body craves what you give it, so to speak. \n\nIf that was true I'd only ever crave carrots and zucchini, lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621004914.0, "datetime": "2021-05-14T15:08:34", "subreddit": "fuckeatingdisorders", "id": "gy3vyxj", "text": "Well, there's also science that proves once you satisfy a craving you'll no longer obsess over it, and it has definitely been true for me in the past. Whenever I tried to satisfy my cravings for something with something else that I deemed as the \"true\" or \"right\" craving I always ended up binging on the original craving. But that's just my personal experience :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621005796.0, "datetime": "2021-05-14T15:23:16", "subreddit": "fuckeatingdisorders", "id": "gy3y1nu", "text": ">I mean yeah short term but if you avoid a food long enough Theoretically you’ll stop craving it because you kill of the bacteria that crave it.\n\nI wish lol. Stopping obsessing about foods I've cut out of my diet since I developed an ED would be such a dream. I even started obsessing about foods I never ate before my ED in the first place.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621013666.0, "datetime": "2021-05-14T17:34:26", "subreddit": "fuckeatingdisorders", "id": "gy4ggic", "text": ">I mean, it is fatphobic.\n\nThat's the point - it's not. Not necessarily. Or at least, not in the sense of \"phobia against fat *people*\". Many of us in recovery do not give a shit about fat people honestly - I mean that in a positive sense. You can be afraid of getting fat without having a negative opinion of fat people.\n\nWhen I was at my lowest weight people would comment and say things. Would they be ok if they were at that weight? No. Were they against thin people? Obviously not.\n\n>We know fat people can be healthy. \n\nWe know that everyone under any circumstance *can* be healthy. I was \"healthy\" at my thinnest. I know plenty of smokers who are healthy. You can, or cannot, be anything.\n\nAdditionally, not everything is about diet culture - obviously diet culture is a thing, and a huge thing in EDs, but it can also be irrelevant. For me personally, I had to google what it was at first because not only I had never come across the term, but I never really experienced it in my life. Bringing diet culture into the discussion can be problematic sometimes because it could end up trivializing a person's complex history and upbringing to a one-line issue. \n\n>Also, I’m 100% not trying to come at you at all. I tend to come off really aggressive through text so if i did I apologize.\n\nSame for me - what I try to do is to stimulate a debate, I'd never want to be mean, nasty or rude against someone :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621014228.0, "datetime": "2021-05-14T17:43:48", "subreddit": "fuckeatingdisorders", "id": "gy4hr8n", "text": ">You cannot have a positive view of fat people and not want to get fat. \n\nThat's really untrue. Most people in real life really (and luckily) have nothing against fat people while not wanting to become fat themselves. Just like people don't want to smoke but they don't have anything against smokers.\n\nThat was true for pre-ED me btw - I didn't *want* to become fat but at the same time fat people were never really on my radar. I had/have some in my own family as well. \n\n>Diet culture specifically stems from fatphobia and racism—especially towards black people.\n\nDiet culture is rife in places with no black people at all, or even with an ethnically homogeneous society. I think you're oversimplifying the issue, or maybe you're applying an American-centered bias.\n\n>Idk what you mean by “everyone can be healthy.” Is that an insinuation that fat people can be healthy but doesn’t mean they are?\n\nNo, it means that fat people can be healthy just like overly thin people can be healthy, smokers can be healthy, binge-drinkers can be healthy. The point is never the individual, the point is the average, and there's no black-or-white definition of what \"healthy\" even means anyway.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621017432.0, "datetime": "2021-05-14T18:37:12", "subreddit": "fuckeatingdisorders", "id": "gy4p5z1", "text": "Would you want to be a smoker?\n\nWould you want to be 20 inches shorter?\n\nWould you want to have brown (or blue, or green eyes) eyes? Or black or blonde hair? \n\nWould you want to have freckles? I wouldn't. \n\nWould you want to be of another gender? I wouldn't.\n\nAnd so on.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621017534.0, "datetime": "2021-05-14T18:38:54", "subreddit": "fuckeatingdisorders", "id": "gy4peoe", "text": ">No, I’m not over simplifying it at all. That is literally it’s roots.\n\nThe place in the world with the worst diet culture is probably Japan, where the problem is and always was wayy more out of control than in the US. So no, it's not its roots really.\n\nIn other countries with different beauty standards (e.g. Central America) diet culture is even sometimes *directed towards white people*.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621330346.0, "datetime": "2021-05-18T09:32:26", "subreddit": "fuckeatingdisorders", "id": "gyjt46l", "text": "When I first started recovery, I even had to google some of these concepts because they were so alien to my reality lol. \n\nOver time, it has become widely known and public that fat people can also have EDs - and this awareness in itself is a good thing of course, but their minority has now become dominant in the recovery discourse, and the recovery strategies that are meant to help them have now started to trample any other idea that might be helpful to someone else. For the same reason I've even had someone telling me that \"EDs are rooted in racism\" (?).\n\nDon't get me wrong: I DO believe fatphobia is a thing, I DO praise fat people with EDs for being able to recover and accept their bodies, I DO sympathize with whatever struggle they might face, I DO believe that eating without restriction is the only true key to recover and I am the first one to call out those who bullshit their way into restriction by telling \"I jUsT wAnNa bE HeAlThY!\".\n\nBut. I also believe that the whole challenge your inner fatphobia, your ED is rooted in fatphobia etc., is also primarily directed towards fat people themselves and it is meant to help THEM deal with THEIR struggle. And while I do believe that certain parts of this discourse can be helpful for everyone, I also believe that if you just blanket apply the same rhetoric to every possible ED on the planet it just becomes yet another fad trend like the whole 90s media frenzy about fashion catwalks causing teens to starve into anorexia, or those outdated ideas about EDs being caused by young females having mommy issues. It just trivializes both sides of the debate and ultimately doesn't really help anyone - and yes, it also leads to extremes such as the pseudoscience claims you listed.\n\nBy the way, as I said to someone else before, all of this is extremely American centered. Some of these concepts don't really make that much sense to non-US cultures.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621331025.0, "datetime": "2021-05-18T09:43:45", "subreddit": "fuckeatingdisorders", "id": "gyjtut5", "text": "I've always found that denying that weight can cause health issues *in the context of an illness that can literally cause people to get too thin and die* is pretty ironic. If I was deeply into my worst restrictive phase, I could easily just say: well since correlation is not causation and my weight is not correlated to my health, what's the problem if I just stay very underweight? \n\nBut even now, when I'm met with this kind of idea, I always reply that smokers can also be healthy, and I've yet to meet someone that can give a meaningful explanation why the two things are different.\n\nI guess the point in recovery is not and cannot be to just deny that obesity, or any other kind of weight extreme, can cause negative health outcomes. The point is to ask yourself: what does healthy mean for *me*? How can *I* achieve true, solid and long-lasting physical and mental health? And for some people, for whatever reason, that might entail having a higher weight than others, because other alternatives may be worse for them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628761706.0, "datetime": "2021-08-12T09:48:26", "subreddit": "fuckeatingdisorders", "id": "h8mx101", "text": "I actually had a similar experience early on in my recovery.\n\nI had been restricting heavily for a while, lost a lot of weight, was very underweight and had no idea what was happening to me. I was cold, weak, numb, obsessed with food. I was no longer myself. One day I got so fed up (pun intended) that I just decided to do what felt obvious to me: eat. Eat until I felt truly satisfied and at least until I reached my pre-ED weight.\n\nAnd so I did. I enjoyed it. I didn't really care. It was awesome - I got to eat all the food! Got to get rid of my stupid looping thoughts about eating! And leave this scary beast behind for good! \n\nThen, as I approached my pre-ED weight, I started to get scared that I'd never stop eating. And I turned to the internet for comfort. So I found the recovery community...and weirdly enough, it gave me so many fears and rules and obsessive thoughts that I regret even finding out about it. It taught me how I \"should\" feel as a recovering anorexic, what I \"should\" be scared of, how to recover \"the right way\" and what I should expect in recovery and it simply triggered me into relapse. And I've been struggling since then.\n\nI still feel that I missed my golden chance at full recovery, and that if I had been sick 20 years ago when reddit/youtube/forums etc. weren't a thing yet, today I'd be fully recovered. I'm so f*cking mad about it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1752268521.0, "datetime": "2025-07-11T21:15:21", "subreddit": "bulimia", "id": "n2md973", "text": "Time for an unethical life pro tip!\n\nThe other day I took my anxiety and sleep medications. Then I binged right afterwards (it wasn't planned). Then I went to bed without purging. I know I didn't purge because I don't remember purging and because I woke up all bloated and with the taste of the food still in my mouth. But somehow it wasn't a problem. I vaguely remember eating the food and then just going to sleep and not caring. It was so weird. I may or may not be recommending this to people.", "parent_id": null, "link_id": null, "context": null}
