{"type": "comment", "timestamp": 1605739352.0, "datetime": "2020-11-18T22:42:32", "subreddit": "AnorexiaNervosa", "id": "gcro005", "text": "Yes! I feel like I have to “live up” to my ED when I’m with ppl that know abt it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619630335.0, "datetime": "2021-04-28T17:18:55", "subreddit": "fuckeatingdisorders", "id": "gw707wv", "text": "Yes exactly!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620951804.0, "datetime": "2021-05-14T00:23:24", "subreddit": "fuckeatingdisorders", "id": "gy1kvw1", "text": "Yeah absolutely! I know it’s worked for a lot of ppl! It just rubs me the wrong way when ppl act like it’s the ONE AND ONLY way and that everything else is “quasi recovery” or whatever. There’s no one way to recover, because everyone’s experience in their ED is unique.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620953930.0, "datetime": "2021-05-14T00:58:50", "subreddit": "fuckeatingdisorders", "id": "gy1oxql", "text": "Yes I think the need for structure speaks to many! Personally I’m on the autism spectrum so that works really well for me - I need clearer rules and guidelines lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621006152.0, "datetime": "2021-05-14T15:29:12", "subreddit": "fuckeatingdisorders", "id": "gy3yvkk", "text": "Yeah absolutely, there’s still so much to learn about the ecosystem of our bodies! I just think it’s really interesting and cool the different things that effect our cravings and thoughts. It’s like, there’s this whole universe inside us.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621006223.0, "datetime": "2021-05-14T15:30:23", "subreddit": "fuckeatingdisorders", "id": "gy3z1pn", "text": "Damn that sucks bro. There’s definitely a lot of potential in these kinds of studies", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1622058300.0, "datetime": "2021-05-26T19:45:00", "subreddit": "bulimia", "id": "gzjwz9d", "text": "I’m sorry that happened :(\n\nBut that’s a good way to look at it - no matter how fucked up your life is at least you’re not taking it out on others like they are.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1622940303.0, "datetime": "2021-06-06T00:45:03", "subreddit": "bulimia", "id": "h0qukch", "text": "Right?! I joked to my roommate once that I could eat one of those giant 10 lb gummy bears. They thought I was exaggerating. Like no. I’ve eaten multiple grocery store cakes in a sitting. I could ABSOLUTELY eat that giant gummy bear. \n\nIt would suck to purge tho.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623108063.0, "datetime": "2021-06-07T23:21:03", "subreddit": "AnorexiaNervosa", "id": "h0ywa6x", "text": "God it’s so fucking exhausting. Especially changing the schedule- I’ve gotten into a REALLY bad habit of logging my entire intake 2/3 weeks in advance on Loseit.... which is OBVIOUSLY unrealistic and unsustainable, because the grocery store might be out of veggie sausages on Tuesday but that’s What Is Logged for Wednesday so now what do I do? Or god forbid I’m asked to work late - what am I supposed to say, no I can’t my Loseit App says I must eat a potato tonight??? Like @myself what the FUCK", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623196741.0, "datetime": "2021-06-08T23:59:01", "subreddit": "AnorexiaNervosa", "id": "h13bzvh", "text": "Seriously. I have autism, I’m very logical and generally fit into that stupid emotionless autistic stereotype lol. But when it comes to food? I’m Absolutely bonkers fucking yonkers . ED says I can’t make this shrimp recipe I want to try on Wednesday because the recipe uses a bit of lemon, and I’m making a *different* recipe using lemon on Tuesday and I can’t have too many ~similar flavors~ in a week. Despite the fact that  tuesdays recipe is lemon basil, and the shrimp recipe I want to try is spicy, it just uses a bit of lemon to enhance the shrimp, so they’re not really similar? And I’m not allowed to make rice Wednesday either because I’m having rice on Thursday - despite the fact that I often meal prep, and therefor *often* eat a meal with rice three or four days in a row, but I can’t make it fresh two nights running? For reasons. And God Forbid I don’t weigh out my bowl of strawberries to the gram - but if I eat a handful of grapes from the display while grocery shopping it’s fine, don’t need to count them. Oh, and I can’t waste x calories on a tablespoon of low cal soy sauce, BUT I can drink a x calorie Gatorade Zero and don’t even need to log it!! Make it make sense!!!!\n\n(Reposted without numbers)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1627580885.0, "datetime": "2021-07-29T17:48:05", "subreddit": "AnorexiaNervosa", "id": "h6zcv0f", "text": "This is why I’m not getting vaccinated lmao", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1627581255.0, "datetime": "2021-07-29T17:54:15", "subreddit": "AnorexiaNervosa", "id": "h6zdrrh", "text": "I just worry I’ll feel too sick after to get my daily steps and if I can’t get my steps I won’t be able to eat... and I’m greedy and want to eat lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1634520281.0, "datetime": "2021-10-18T01:24:41", "subreddit": "EatingDisorders", "id": "hh21qjl", "text": "Yes!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637954416.0, "datetime": "2021-11-26T19:20:16", "subreddit": "fuckeatingdisorders", "id": "hm6q7q1", "text": "She irks me SO much omg", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638400868.0, "datetime": "2021-12-01T23:21:08", "subreddit": "fuckeatingdisorders", "id": "hmv0caj", "text": "Tbh I think it’s impossible to be fully recovered and still maintain an image related in any way to ED, even if it’s the “positive” side or recovery focused. \n\nTrue recovery is moving the fuck on.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640567530.0, "datetime": "2021-12-27T01:12:10", "subreddit": "fuckeatingdisorders", "id": "hq3apjk", "text": "Holy shit congrats!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647643120.0, "datetime": "2022-03-18T22:38:40", "subreddit": "fuckeatingdisorders", "id": "i17oke1", "text": "Same omg. Maybe I’m just a volume eater at heart but a sandwich would never be enough for me! You’re not crazy at all. \n\nMy roommates eat tiny portions like that but if I pay attention they also snack a lot so it evens out! Nobody non disordered could survive off those dumb insta meals, and those of us who are disordered eating that shit are barely surviving and certainly not thriving.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647643351.0, "datetime": "2022-03-18T22:42:31", "subreddit": "fuckeatingdisorders", "id": "i17p2r6", "text": "Adding on to say specifically in regards to the insta “food freedom” influencers posting that shit: they know sandwiches and stuff are common fear foods, so they take it and make it as low calorie/safe as they can; that way they can say they’re “challenging fears” and “eating what they want” but in a very safe, controlled way.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648485703.0, "datetime": "2022-03-28T16:41:43", "subreddit": "fuckeatingdisorders", "id": "i2gflw1", "text": "Personally that is part of the appeal for me. I struggle with food addiction/obsession and part of that is wanting to make the experience of eating last, and that’s easier the more food you’ve got. Obviously I know that’s not necessarily healthy though and I hope one day I can get to a point where I can just eat and move on.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650025961.0, "datetime": "2022-04-15T12:32:41", "subreddit": "fuckeatingdisorders", "id": "i4tovz6", "text": "Absolutely. For me the idea of full recovery means no food obsession or forming ANY part of your identity around food, weight, or fitness. So any WIEIAD, FDOE, fitness or food related instagramer is not recovered.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650026414.0, "datetime": "2022-04-15T12:40:14", "subreddit": "fuckeatingdisorders", "id": "i4tppxs", "text": "Yeah it’s really annoying. Tbf eating “healthy” (sugar free mainly but no other restrictions and eating ENOUGH) is how I recovered from bulimia so I can’t judge that bit, but the food obsession and body obsession is… not recovery. Taking pics of your food is NOT recovery and posting about how you’re omg so ~free time to eat 10 grapes and an almond bc that’s what My BoDy CrAvEs is just annoying. I feel like a lot of them know EXACTLY what they’re doing but I really think a lot THINK that this is what recovery is and that’s sad. There’s so much more to life than documenting your oatmeal on Instagram.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650055114.0, "datetime": "2022-04-15T20:38:34", "subreddit": "fuckeatingdisorders", "id": "i4vktbs", "text": "Bro I’d so buy that can someone do it???", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650069415.0, "datetime": "2022-04-16T00:36:55", "subreddit": "fuckeatingdisorders", "id": "i4wfech", "text": "I used to hate dark chocolate as a kid but as I got older it really started being delicious", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651934369.0, "datetime": "2022-05-07T14:39:29", "subreddit": "fuckeatingdisorders", "id": "i7ok0ej", "text": "I love the mirror tip! I’ve found it so much more helpful to face and work through triggers like that head on.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651934436.0, "datetime": "2022-05-07T14:40:36", "subreddit": "fuckeatingdisorders", "id": "i7ok5la", "text": "Meeeeee", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651961933.0, "datetime": "2022-05-07T22:18:53", "subreddit": "fuckeatingdisorders", "id": "i7q905i", "text": "Yeah! It’s like…. So much of my ED is tied to not wanting to be perceived by others INCLUDING myself, that avoiding my body and the reality that I DO have a body and AM visible to others is just feeding into my disorder in a way. Trying to hide my body from myself, or deny that my body is changing just reinforces that a body is a bad thing, something to be hidden, a negative side effect rather than a reality of existence. \n\nI’m super into body neutrality lol mainly bc I have very extensive self harm scars and I got sick and tired of the whole “battle scars/scars are beautiful bc they show Struggle/tiger stripes mentality. Bc my body isn’t beautiful and I can’t lie to myself or change my perception of beauty, I find it so much more meaningful to separate beauty from worth altogether - I don’t have to like my body to treat it well. Things don’t need to be pretty or meaningful to have worth.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651962899.0, "datetime": "2022-05-07T22:34:59", "subreddit": "fuckeatingdisorders", "id": "i7qb18s", "text": "Yes! I’m sure it’s helpful for some people and I definitely don’t want to dismiss that, but it’s definitely not for me. Yeah, I definitely think the focus should be on coming to terms with and accepting your body instead of hiding from it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651966883.0, "datetime": "2022-05-07T23:41:23", "subreddit": "fuckeatingdisorders", "id": "i7qj14k", "text": "Literally all I crave is fruit and meat it’s ridiculous. I swear if I went all in I’d be out here eating nothing but bags of grapes and rotisserie chickens (I have a deep deep desire to eat a rotisserie chicken lmao). It makes sense to me - my body is craving the protein and fat in meat, especially seeing as I’m craving fatty steak, chicken with skin, ect, and the natural sugars in fruit (I struggle w hypoglycemia). Also broccoli. Idk why but I could eat bags and bags of steamed broccoli I think it’s the texture? Lol. I’m autistic and have always been a sensory seeker from food; there’s just Something about the texture of steamed broccoli? Lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651967374.0, "datetime": "2022-05-07T23:49:34", "subreddit": "fuckeatingdisorders", "id": "i7qjzt0", "text": "Nah man I get u. I’m the same. Especially craving high protein food lol. It makes sense. Your body does need a lot protein to repair damages so that’s probably why, and for me personally I crave fatty protein like steak as well, which makes sense bc the body also needs fats to repair. \n\nAs for fiber, yeah it’s rough. I truly love, crave and enjoy fruits and veg (AND SWEET POTATOES OMG they were my recovery OBSESSION) but obviously I can’t eat plates and plates of broccoli and be comfortable lol. 50g fiber is generally what I get a day without trying or thinking about it, and is actually a pretty healthy amount (IMO the DRV of 25 is way too low) but in one sitting? And in ED recovery? Might be a biiiiit hard on ya. \n\nSo I think while it makes sense that you’re craving foods with a high nutritional content that you also enjoy, maybe also practicing a liiiitle gentle nutrition in paying attention to how your body FEELS after that amount of fiber/protein snd maybe adjusting a bit. \n\nLol this is partly why I’m hesitant to go all in bc I know I’d be out here eating pounds of fruit, broccoli, and steak/meat and I already have GI issues 😂", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651968536.0, "datetime": "2022-05-08T00:08:56", "subreddit": "fuckeatingdisorders", "id": "i7qm7x1", "text": "That makes sense! I know I’m craving high calorie meat and fruit for the fat/sugar lol. It’s actually almost reassuring? How much it makes sense. Like my body knows what it’s doing (which it does). I’ve never had a real craving for any fake diet/fake sugar containing food, come to think of it! Which makes perfect sense. Why would my body want that?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651968801.0, "datetime": "2022-05-08T00:13:21", "subreddit": "fuckeatingdisorders", "id": "i7qmpx2", "text": "I wouldn’t beat yourself up over it or cast judgment at yourself for “not learning”. Just… notice it. Mark it in the back of your mind. At some point you might be better able to regulate.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652053121.0, "datetime": "2022-05-08T23:38:41", "subreddit": "fuckeatingdisorders", "id": "i7uvo2f", "text": "YES. Absolutely this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652814495.0, "datetime": "2022-05-17T19:08:15", "subreddit": "fuckeatingdisorders", "id": "i8zcbvg", "text": "Hey I just read a book called “Not Otherwise Specified” about a Black girl in recovery from an ED! It’s on Apple Books. Fantastic read.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652814539.0, "datetime": "2022-05-17T19:08:59", "subreddit": "fuckeatingdisorders", "id": "i8zcfoj", "text": "I have this! Especially when I’m restricting badly. It’s awful.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652815129.0, "datetime": "2022-05-17T19:18:49", "subreddit": "fuckeatingdisorders", "id": "i8zdvft", "text": "I have automatic neuropathy. I had it mildly pre ED due to hyper mobility and it got so much worse during my ED.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652985646.0, "datetime": "2022-05-19T18:40:46", "subreddit": "fuckeatingdisorders", "id": "i98gdve", "text": "Wow, that really resonated with me!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653432031.0, "datetime": "2022-05-24T22:40:31", "subreddit": "fuckeatingdisorders", "id": "i9v4x7u", "text": "I’m in all these points holy shit\n\nThis is definitely not talked about enough lol. My obsession with food being absolutely perfect, as seasoned as possible, as high volume as possible, feeling insatiable, etc…. \n\nAnyone else microwave their meals every 10 minutes so they stay hot and “perfect”?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653436035.0, "datetime": "2022-05-24T23:47:15", "subreddit": "fuckeatingdisorders", "id": "i9vdhjv", "text": "Maybe? My sense of taste has definitely been affected.\n\nI think for me I need every meal/bite to be absolutely perfect or it’s “wasted” and I personally prefer hot food to be very hot and cold food to be very cold. Lol for example I don’t really like room temp fruit, it must be cold or I get squirmy inside.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653476079.0, "datetime": "2022-05-25T10:54:39", "subreddit": "fuckeatingdisorders", "id": "i9x50z6", "text": "Yeah for me the general PREFERENCE of food to be hot/cold is 100% an autism/sensory thing - eating room temp food is a Bad Sensory Experience but the obsession around meals being perfect at all times and therefore needing to microwave shit 100 times is 100% ED/starvation mindset", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654638316.0, "datetime": "2022-06-07T21:45:16", "subreddit": "fuckeatingdisorders", "id": "ibjcb5r", "text": "Yuuuuup", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654638389.0, "datetime": "2022-06-07T21:46:29", "subreddit": "fuckeatingdisorders", "id": "ibjcgiw", "text": "Hypoglycemia, tooth decay, tinnitus/ hearing loss, nerve damage and worsening of pre existing GI issues are the worst for me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655076661.0, "datetime": "2022-06-12T23:31:01", "subreddit": "fuckeatingdisorders", "id": "ic56rkw", "text": "I’m crying lmao", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655076701.0, "datetime": "2022-06-12T23:31:41", "subreddit": "fuckeatingdisorders", "id": "ic56ud8", "text": "YES.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655076775.0, "datetime": "2022-06-12T23:32:55", "subreddit": "fuckeatingdisorders", "id": "ic56zdw", "text": "Yes! Beauty of meaningless and subjective. No, everyone is NOT beautiful but who tf cares? Beauty isn’t necessary to exist or be worthy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655077100.0, "datetime": "2022-06-12T23:38:20", "subreddit": "fuckeatingdisorders", "id": "ic57lpr", "text": "Absolutely. Recovery and Post-ED life is different for everyone and having those stepping stones can be really important. Learning about how food can heal and promote growth and strength can be very important, and appropriate exercise can promote body respect and self compassion.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1655553593.0, "datetime": "2022-06-18T11:59:53", "subreddit": "fuckeatingdisorders", "id": "vf4qu6", "text": "At 7 am. While still in the grocery store. Idk what came over me, I tried one and couldn’t stop. I just stood there shoving grapes in my face. It’s like some demon sugar craving goblin is in my brain. \n\nNow I’m walking home and I’m spiraling. I’m scared my blood sugar is gonna crash after that. I’m annoyed because I wanted to eat some apricot later as my daily fruit but now I feel like I can’t and I’ve wasted my daily fruit on something high calories I didn’t even enjoy bc I ate them so fast. I almost want to skip breakfast bc a whole bag of grapes is a lot… do I really need breakfast?? I’m scared I’ll be bloated later. Idk I woke up in a good mood and now I’m spiraling and so mad at myself for ruining my day.", "title": "Ate an entire bag of grapes", "context": null}
{"type": "comment", "timestamp": 1655556109.0, "datetime": "2022-06-18T12:41:49", "subreddit": "fuckeatingdisorders", "id": "ictrppo", "text": "Thank you for this. It does sound stupid. And I know my blood sugar is less likely to crash if I DO eat breakfast and keep eating normally. It’s just so tempting to try and compensate.\n\nI’m just mad bc I love fruit but I can’t control myself around it. And I have a lot of GI issues so it’s like… not ideal, bc now there’s the added worry beyond the calories and sugar, that I’m gonna bloat (I bloat BAD with trigger foods… like pregnant bad, which can ruin a days plans bc im so uncomfortable not even counting the mental discomfort/body hate) or be constipated or sick. \n\nI just want a normal relationship w food bro lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655556542.0, "datetime": "2022-06-18T12:49:02", "subreddit": "fuckeatingdisorders", "id": "ictsenj", "text": "Thank you! I’ve been dealing with severe bloating from ibs c and pelvic floor dysfunction for a year or too now…. Sometimes I’m just freaking tired of looking pregnant 24/7; literally every anorexics worst nightmare lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655566055.0, "datetime": "2022-06-18T15:27:35", "subreddit": "fuckeatingdisorders", "id": "icua6b0", "text": "I ate breakfast so that’s a start lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655566124.0, "datetime": "2022-06-18T15:28:44", "subreddit": "fuckeatingdisorders", "id": "icuabbm", "text": "I’ve been a lot better w that actually! Letting myself eat fruit more than once. Fruit is bomb. I’m not a huge banana fan bc texture but I’m so excited for stone fruit season!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655571263.0, "datetime": "2022-06-18T16:54:23", "subreddit": "fuckeatingdisorders", "id": "icul4ls", "text": "I know. Tomorrow will be better and today I’ll just try and eat my normal meals and pretend it didn’t happen.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655578950.0, "datetime": "2022-06-18T19:02:30", "subreddit": "fuckeatingdisorders", "id": "icv17ia", "text": "YESSSSS", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655583241.0, "datetime": "2022-06-18T20:14:01", "subreddit": "fuckeatingdisorders", "id": "icv9z3v", "text": "Honestly I’m scared My stomach would burst… I’ve binged on massive amounts of fruit in the past; like 2 bags of grapes and a bag of cherries in one go; it’s like my kryptonite! \n\nI’m working on allowing myself to snack on fruit outside meals more, in more normal portions and not just cramming it in my face like a wild animal. I’m actually about to go slice up some apricot and berries!.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655583264.0, "datetime": "2022-06-18T20:14:24", "subreddit": "fuckeatingdisorders", "id": "icva0w6", "text": ". Meant to respond to thread sorry", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655583303.0, "datetime": "2022-06-18T20:15:03", "subreddit": "fuckeatingdisorders", "id": "icva3rj", "text": "Next time I’m in the store, instead of secretly bingeing on grapes, I’m going to BUY and eat a piece of fruit normally like a normal person on my way home, which I usually would be scared to do… but obviously I’m craving fruit bc shopping makes me hungry, especially since the store is like an hour from my house. So that’s my next challenge lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655584829.0, "datetime": "2022-06-18T20:40:29", "subreddit": "fuckeatingdisorders", "id": "icvdcfy", "text": "Yeah, I know lol fruits the only thing I’m having issues with luckily. I know eventually just letting myself eat it until I get the desire out of my system will probably be inevitable and will probably work, it’s just a scary idea - although I am genuinely curious how much I’d eat! \n\nProbably actually buying a bag of grapes, sitting down, and eating it at a reasonable pace would be a good start. But it can’t be good for me and that’s what stops me from doing it - the sugar, the fructose (bloating), the inevitable diarrhea… lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655588996.0, "datetime": "2022-06-18T21:49:56", "subreddit": "fuckeatingdisorders", "id": "icvlywb", "text": "Unfortunately Bloating like I do is not a part of life. It’s a part of a medical condition and is so severe that at times I can’t breathe or stand upright when it’s so bad. It makes this whole recovery thing really really hard, unfortunately. \n\nIt’s crazy how fruit is vilified…. It’s fruit!! Logically I know that, lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655589074.0, "datetime": "2022-06-18T21:51:14", "subreddit": "fuckeatingdisorders", "id": "icvm4ms", "text": "Thank you ❤️ I’m trying to remember my body is healing. I ate all my meals today and it sucks but the only way out is through. I really appreciate everyone’s responses ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655647765.0, "datetime": "2022-06-19T14:09:25", "subreddit": "fuckeatingdisorders", "id": "icy1unu", "text": "1. Actually having a personality\n\n2. developing interests and hobbies that lead to satisfaction and fulfillment and fun\n\n3.. Being able to be present and kind in my interactions with others\n\n4. Being a good rat owner \n\n5.. The fact that this world is ridiculous and beautiful and weird and the physical form I take is so, so insignificant compared to the magnitude of existence", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655648226.0, "datetime": "2022-06-19T14:17:06", "subreddit": "fuckeatingdisorders", "id": "icy2q9g", "text": "Lmaooooo", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655680512.0, "datetime": "2022-06-19T23:15:12", "subreddit": "fuckeatingdisorders", "id": "iczyp26", "text": "Number 5 is a HUGE one!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656008059.0, "datetime": "2022-06-23T18:14:19", "subreddit": "fuckeatingdisorders", "id": "idgkofa", "text": "It do be true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656024429.0, "datetime": "2022-06-23T22:47:09", "subreddit": "fuckeatingdisorders", "id": "idhnkul", "text": "IMO it’s not just about calories; in my experience eating 3k calories of high nutrient food especially w protein snd fat satisfies the insatiable hunger more than 5k calories of lower nutrient food. I think because my body is screaming for nutrition to heal damages. High calorie alone has never quelled my hunger lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656024543.0, "datetime": "2022-06-23T22:49:03", "subreddit": "fuckeatingdisorders", "id": "idhntts", "text": "Exactly! Eating is always always better than not eating and there’s nothing wrong with eating whatever tf you want. Personally I don’t experience EH as bad when I focus on nutrient rich foods lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656027621.0, "datetime": "2022-06-23T23:40:21", "subreddit": "fuckeatingdisorders", "id": "idhudvu", "text": "I’m certainly not perfect especially when it comes to challenging fear foods ect I definitely have a lot of work to do, and that’s why I’m here. But I’ve been though this before and I definitely notice that the first time I had EH as a teen, eating simply high calorie never ever satisfied me but now  as an adult going through EH I have noticed that the foods I eat make a HUGE difference in my EH. (I’m learning I can’t trick my body w volume and vegetables, I’m learning how important fat is to satisfaction and how awful I feel if I eat only carbs) \n\nmy mental hunger is reducing every day that I eat enough - I certainly don’t restrict, I’m even moving away from counting calories-, and I’m going for very long periods being able to focus on other things and have conversations and experiences again! The mental hunger is definitely there still, and probably will be until I’m weight restored, but it’s a background buzz rather than a foreground scream now. Sure, there are times I’m still obsessed w food and spiral, but I know now it’s because I haven’t eaten enough yet that day or I’ve prioritized volume over nutrition, which I’m working on.\n\nI am also speaking from the experience and knowledge of my treatment team and family members who fully recovered from anorexia.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656106602.0, "datetime": "2022-06-24T21:36:42", "subreddit": "fuckeatingdisorders", "id": "idm2h6g", "text": "I can relate so much to this. I have a very poor sense of spatial perception in general and especially when it comes to taking up space and how my body feels in space. This is very common in autism which, incidentally, is also commonly comorbid in anorexia.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656106638.0, "datetime": "2022-06-24T21:37:18", "subreddit": "fuckeatingdisorders", "id": "idm2k74", "text": "Probably yes", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656420024.0, "datetime": "2022-06-28T12:40:24", "subreddit": "fuckeatingdisorders", "id": "ie1qlco", "text": "Good lord, I am so so sorry you have to deal with that. Holding your baby while saying she made you fat? That’s absolutely not ok or normal even for a seriel dieter…. That’s ED territory. That said that’s absolutely no excuse for her saying those things. There’s nothing wrong with a fucking donut. I would have said something like, “I’m really sorry your self worth is tied to the consumption a donut. However, mine is not and I’d rather you kept it to yourself” - if anything it might’ve surprised her! But I understand not being comfortable saying those things. I’m glad you have a supportive boyfriend at least. Hang on to that and places like this that will support you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656681632.0, "datetime": "2022-07-01T13:20:32", "subreddit": "fuckeatingdisorders", "id": "ieg5ye9", "text": "Like goddamn we all can have opinions but keep it to yourself ffs \n\nSomeone else’s recovery is their own business and is between them and their treatment team.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656780951.0, "datetime": "2022-07-02T16:55:51", "subreddit": "fuckeatingdisorders", "id": "ielgmon", "text": "Oats never make me full no matter how much I eat lol\n\nBut I’d usually use 2 packs back when I’d eat them. With water bc that’s genuinely how I thought you were supposed to make them and I hate any and all milk. \n\nBut I loved the cinnamon maple Quaker Oats w blueberries and peanut butter!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656781266.0, "datetime": "2022-07-02T17:01:06", "subreddit": "fuckeatingdisorders", "id": "ielhcsy", "text": "Same, I didn’t realize it was even a thing to make it w milk until I was in treatment lol. I just thought water was default and I can’t imagine it any other way lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657129421.0, "datetime": "2022-07-06T17:43:41", "subreddit": "fuckeatingdisorders", "id": "if3nco0", "text": "Scarcity mindset", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657372143.0, "datetime": "2022-07-09T13:09:03", "subreddit": "fuckeatingdisorders", "id": "ifgxg1m", "text": "I’m eating potatoes as we speak ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657473447.0, "datetime": "2022-07-10T17:17:27", "subreddit": "fuckeatingdisorders", "id": "ifm8kw3", "text": "See I don’t like the texture mashed but I LOVE them roasted lol\n\nYeah I don’t feel great on a carb heavy diet either but I’ve found proper portions of potatoes, fruit and brown rice don’t mess w me like processed carbs and gluten do. I mainly eat creamer potatoes (google them they are AWESOME) and sweet potatoes. I fucking love them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657501490.0, "datetime": "2022-07-11T01:04:50", "subreddit": "fuckeatingdisorders", "id": "ifnzfhf", "text": "Ooh I can relate so much to this. I hate not having stuff to do between meals because I’m so fucking food obsessed it’s like I’m living meal to meal. Part of recovery for me has been trying to find meaning and distraction and things to do outside of food and it’s fucking hard. I’m making progress tho! I had three days off this week and I think I filled them pretty well.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657975599.0, "datetime": "2022-07-16T12:46:39", "subreddit": "fuckeatingdisorders", "id": "ige0dnp", "text": "Lmao", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658077685.0, "datetime": "2022-07-17T17:08:05", "subreddit": "fuckeatingdisorders", "id": "igjd055", "text": "So from what I’ve read it takes a while for hair health to “catch up”", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659653065.0, "datetime": "2022-08-04T22:44:25", "subreddit": "fuckeatingdisorders", "id": "iiz9v5i", "text": "That’s definitely why. I also restricted fat heavily and now my biggest craving is fatty meat and meat fat. (And nuts lol) Like I literally ate the strip of fat my mom cut off her pork.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659824208.0, "datetime": "2022-08-06T22:16:48", "subreddit": "fuckeatingdisorders", "id": "ij8m809", "text": "Well that’s a great way to show you she’s an AWFUL therapist!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1661090064.0, "datetime": "2022-08-21T13:54:24", "subreddit": "fuckeatingdisorders", "id": "il6xvuz", "text": "Ugh I love breakfast for dinner", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1661697675.0, "datetime": "2022-08-28T14:41:15", "subreddit": "fuckeatingdisorders", "id": "im4saag", "text": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1662311558.0, "datetime": "2022-09-04T17:12:38", "subreddit": "fuckeatingdisorders", "id": "in2sfo8", "text": "💜Bagel pizza 💜", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1672240068.0, "datetime": "2022-12-28T15:07:48", "subreddit": "fuckeatingdisorders", "id": "j1zcpb2", "text": "🍳Egg🍳", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1676070984.0, "datetime": "2023-02-10T23:16:24", "subreddit": "fuckeatingdisorders", "id": "j81lm2k", "text": "Me too", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1676071055.0, "datetime": "2023-02-10T23:17:35", "subreddit": "fuckeatingdisorders", "id": "j81ls0w", "text": "Same here :(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683310242.0, "datetime": "2023-05-05T18:10:42", "subreddit": "fuckeatingdisorders", "id": "jizqnrj", "text": "Yes", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684617585.0, "datetime": "2023-05-20T21:19:45", "subreddit": "AnorexiaNervosa", "id": "jky9smu", "text": "Crossing my legs, sitting on my legs, leg bouncing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717780075.0, "datetime": "2024-06-07T17:07:55", "subreddit": "AnorexiaNervosa", "id": "l7jzluf", "text": "Yuuuuup breaking the pack a day habit was ROUGH but not did my bank account thank me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717780093.0, "datetime": "2024-06-07T17:08:13", "subreddit": "AnorexiaNervosa", "id": "l7jznpb", "text": "Omg are u me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718205862.0, "datetime": "2024-06-12T15:24:22", "subreddit": "AnorexiaNervosa", "id": "l8a5p33", "text": "I started logging the calories from it. Seeing that x (although very low per piece) add up definitely motivated me.\n\nAlso my tmj was so bad that the pain was awful. That was a huge factor for me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721346426.0, "datetime": "2024-07-18T23:47:06", "subreddit": "bulimia", "id": "lduno8v", "text": "To be fair it depends on the person. I could absolutely purge that fast at one point in my life.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721514067.0, "datetime": "2024-07-20T22:21:07", "subreddit": "AnorexiaNervosa", "id": "le57hd1", "text": "This makes me so happy 🩷 nothing is better than living a full life. Best of luck to you, my friend.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723233666.0, "datetime": "2024-08-09T20:01:06", "subreddit": "fuckeatingdisorders", "id": "lhbvjfv", "text": "Just out of curiosity, why the comment on a two year old post?\n\nBulimia is not generally known for its “dignity”. Bulimia is messy and disgusting and you feel feral and ugly and awful. I wouldn’t wish it on anyone. I still remember this day. I remember purging behind the store after writing this post. It WAS gross. Luckily I’m not in this place anymore.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746916463.0, "datetime": "2025-05-10T22:34:23", "subreddit": "AnorexiaNervosa", "id": "mrnrkdn", "text": "it's normal for some people. IMO there's a subgroup of anorexics who are triggered into an almost euphoric state by starvation. brain chemistry.", "parent_id": null, "link_id": null, "context": null}
