{"type": "comment", "timestamp": 1640740313.0, "datetime": "2021-12-29T01:11:53", "subreddit": "ARFID", "id": "hqcoabj", "text": "Same, I dip mine in bbq sauce lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640804258.0, "datetime": "2021-12-29T18:57:38", "subreddit": "ARFID", "id": "hqfz2f7", "text": "Not a fan of mayo but on a day when I'm more open to try something new I'll give it a go! I have seen that mix before, my friends rave about it lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640819697.0, "datetime": "2021-12-29T23:14:57", "subreddit": "ARFID", "id": "hqh2ipd", "text": "It may just be bcuz bbq sauce is one of only like 3 sauces I'll eat so it works for me lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640831989.0, "datetime": "2021-12-30T02:39:49", "subreddit": "ARFID", "id": "hqhuv89", "text": "haha what are yours? if ur comfortable sharing.\nmine are bbq sauce, 1000 island and honey mustard lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641749259.0, "datetime": "2022-01-09T17:27:39", "subreddit": "ARFID", "id": "hrxrg2q", "text": "Thats ok! Ah that's what Kewpie mayo is?! I thought it was a type of mayo lmao. I have an Asian market nearby, i might have to check that out", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1691994473.0, "datetime": "2023-08-14T06:27:53", "subreddit": "ARFID", "id": "jw3v89w", "text": "the fact there are still things in this pic i will not eat is hilarious lmfao", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1691994678.0, "datetime": "2023-08-14T06:31:18", "subreddit": "ARFID", "id": "jw3vicp", "text": "im this way as well. \ni finally tried indian food in my early 30s...i will only eat that exact dish and from the same 2 restaurants since i kno they can make a slight modification for me (no garlic on the naan). i havent worked up enough courage to try anything else tho", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1691995415.0, "datetime": "2023-08-14T06:43:35", "subreddit": "ARFID", "id": "jw3whf3", "text": "im a vegetarian so veggie korma with plain rice and cheese naan (no garlic) \n\nmy best friend loves butter chicken and raves about it, maybe worth a try if ur ever up for it.\n\ni also went to an indian place that gave samples so that was very helpful bcuz i was super unfamiliar with all of the names of the dishes.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1693302297.0, "datetime": "2023-08-29T09:44:57", "subreddit": "ARFID", "id": "jy7j3lg", "text": "Just commenting based on the title question but it's something i truly cannot do. i have issues surrounding mouth/germs/oral hygeine and just cant bring myself to try it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1694883251.0, "datetime": "2023-09-16T16:54:11", "subreddit": "ARFID", "id": "k0uxd83", "text": "as a kid i looked forward to the future bcuz i thought there'd be \n\nfloating cars\njetpacks\nand a meal in a pill \n\nor at least the gum from Charlie and the Chocolate Factory.\n\nI'm in my mid 30s now and am slightly disappointed", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1698077365.0, "datetime": "2023-10-23T16:09:25", "subreddit": "ARFID", "id": "k64dhso", "text": "I have done this and still had issues. \n\nThe whole point is if its not listed as being in the meal via the menu, how would one know?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1698079475.0, "datetime": "2023-10-23T16:44:35", "subreddit": "ARFID", "id": "k64jcx7", "text": "This is an unnecessary reach. All that was stated is it's annoying when regular ingredients are not listed on the menu. \n\nCommon sense would say anyone who has dealt with food allergies (esp common foods) would think to mentioned it at the start of an order. That doesn't mean accidents haven't happened...regardless, that wasn't even the point of this post.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1699882119.0, "datetime": "2023-11-13T13:28:39", "subreddit": "ARFID", "id": "k92bjhx", "text": "the blueberry ones are 🔥🔥", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700529516.0, "datetime": "2023-11-21T01:18:36", "subreddit": "ARFID", "id": "ka3hqlx", "text": "im so thankful im doing Thanksgiving for 1 at my house lol. only my desired foods...now i just gotta hope i dont randomly not want to eat after all of the cooking I end up doing lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1712441772.0, "datetime": "2024-04-06T22:16:12", "subreddit": "ARFID", "id": "kydvoyu", "text": "its disordered eating but not an eating disorder i think because there's less known about ARFID vs eating disorders it's easy to just lump it in the same category. ARFID is nuanced in it's own way which is why it should be categorized better.\n\nalso i wish it was better conveyed that it's not just picky eating...there's a stark difference.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717831824.0, "datetime": "2024-06-08T07:30:24", "subreddit": "ARFID", "id": "l7naqtc", "text": "id die if i didnt have bbq sauce or hot sauce...that's actually what gets me to eat somethin lol\n\ni hate ranch and ketchup tho so i get it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1719128452.0, "datetime": "2024-06-23T07:40:52", "subreddit": "ARFID", "id": "l9vi97s", "text": "same and i dont like the feeling of food in my stomach lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1719164089.0, "datetime": "2024-06-23T17:34:49", "subreddit": "ARFID", "id": "l9xi1of", "text": "id much rather photosynthesize instead of consuming meals lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1719164257.0, "datetime": "2024-06-23T17:37:37", "subreddit": "ARFID", "id": "l9xiie6", "text": "yes! same here. my therapist doesnt \"treat\" arfid but she was interested in just better understanding my issue with food and i explained this to her and she\n(and my primary doc) were just like \"i don't relate to it directly but i actually get what u mean!\" both of them aided in confirming my diagnoses so it's was really refreshing instead of them just going with something else thats more common.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1719184230.0, "datetime": "2024-06-23T23:10:30", "subreddit": "ARFID", "id": "l9z10ui", "text": "Yea funny enough i discovered arfid then researched it and brought it up to both my therapist and primary doc. my therapist immediately was in agreement and my primary ran it by some of her colleagues to see how to better help me (i was severly underweight at the time) then came back with the same conclusion.\n\ni looked into IOP for ARFID for myself and it seems to be mostly geared to those that have the type where they're fearful of new foods, almost like exposure therapy it seemed which i could see being helpful for those with that type. For me i just hate food, I'll try anything but i just dont want more of it lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1719197116.0, "datetime": "2024-06-24T02:45:16", "subreddit": "ARFID", "id": "l9zuywc", "text": "oh no thats sounds so scary! i so get that, i have stomach issues (nothing compared to what u have gone through) so sometimes it's just not wanting to eat so my stomach doesnt have any reason to flip out. Ugh eating is really the biggest chore lol i often go without a real meal for a few days and just eat light snacks. \n\nI'll be ready for that pill the minute its available 😂", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723067546.0, "datetime": "2024-08-07T21:52:26", "subreddit": "ARFID", "id": "lh0dxrh", "text": "my arfid is just food avoidance in general, i dont enjoy eating and often would rather just not eat.\n\nthe worst aspect of that tbh is living in a society where every gathering is surrounded by meals/eating. I have a slow month this month so naturally everyone wants to hang/catch up and it's always including food. I love catchin up with friends but it being over a meal 9 times out of 10 is just so off-putting 😂 but it's a cultural thing so i just roll with it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723746000.0, "datetime": "2024-08-15T18:20:00", "subreddit": "ARFID", "id": "lia1vho", "text": "i had ARFID in the early 90s and used to pass out in elementary school and am now hypoglycemic (plus other goodies) so it definitely can be life threatening especially for those with the subtype of just not wanting to eat in general/don't have hunger sensations. also people absolutely have these issues in other countries and long before now they just werent diagnosed. \n\nthey tried that whole trope with autism and adhd.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724356514.0, "datetime": "2024-08-22T19:55:14", "subreddit": "ARFID", "id": "ljfkbs6", "text": "if it can transfer in the fridge it'll definitely transfer in the oven.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724370267.0, "datetime": "2024-08-22T23:44:27", "subreddit": "ARFID", "id": "ljgp8xb", "text": "i used to hate it when i lived with other people...the fridge itself stinks unless u clean it often/air it out so food smells make it 10x worse to me lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725349662.0, "datetime": "2024-09-03T07:47:42", "subreddit": "ARFID", "id": "ll9um2d", "text": "funny thing is I've most likely tried it...and thats how i know 😂", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725483710.0, "datetime": "2024-09-04T21:01:50", "subreddit": "ARFID", "id": "llj0wyq", "text": "thats exactly what i hate lmao\n\nthats me with green bean casserole, idc that ur aunt makes it \"the best\", its gross and doesnt even look like it should be eaten.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726546733.0, "datetime": "2024-09-17T04:18:53", "subreddit": "ARFID", "id": "lniurwe", "text": "Self checkout because i hate small talk", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727416056.0, "datetime": "2024-09-27T05:47:36", "subreddit": "ARFID", "id": "lp5723g", "text": "Splitting the check in my group just means we're all paying separately for whatever we ordered UNLESS 1 of us agrees to just pay & have people venmo/cashapp etc. \n\nI eat extremely small portions so my friends typically wont let me pay beyond my drinks but I always pay my share even if it just goes to the tip.\n\nim sorry this happened Op, ur friends should definitely be alot more considerate.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728049006.0, "datetime": "2024-10-04T13:36:46", "subreddit": "ARFID", "id": "lqar9gy", "text": "People not affected by the condition typically aren't aware of the nuances of it.\n\nUnless u have ARFID u probably aren't just naturally aware of there being subtypes of it...just like people having subtypes of ADHD/Autism etc. so people that don't \"look\" exactly how they envision a person with a condition to look get shit for it. \n\nIt sucks but happens too often to be surprising atp.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728049498.0, "datetime": "2024-10-04T13:44:58", "subreddit": "ARFID", "id": "lqasm34", "text": "ARFID isnt *just* those fears. U can have ARFID and not have a fear of choking or new foods (that's a subtype but not a requirement)\n\nFor example I am medically diagnosed with ARFID, I have no concerns of choking on food, I simply do not want to eat anything. I hate eating so when I do I eat very small portions. I have tried a very large variety of food but i don't enjoy eating them enough to constitute calling them \"safe\" foods nor desire to eat more of it. That's with pretty much everything. \n\nAnorexia *nervosa* is the fear of weight gain btw.\n\nAnorexia on it's own is just the medical term for not having an appetite, this can be caused by a ton of things and is treated differently than anorexia nervosa.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729012379.0, "datetime": "2024-10-15T17:12:59", "subreddit": "ARFID", "id": "ls2f2bk", "text": "i have ARFID and have been in the corporate \"world\" for over a decade...at most i get that \"ur so disciplined/healthy\". I don't get into it and participate when i can or bring my own food. I typically don't enjoy fast food in general anyway so it's easy for me to just say \"it's too heavy for my stomach\". We're honestly so busy in our office nobody has the time.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729012731.0, "datetime": "2024-10-15T17:18:51", "subreddit": "ARFID", "id": "ls2g6n1", "text": "100% this. im known as either the one who doesnt eat, barely eats or eats very healthy. depending on the day all are accurate lol but nobody makes a *big* deal over it. When our Chief visits I purposely will snack on whatever he brings to be a participant but even he will ask if anyone has dietary needs to try and accommodate.  \n\nmy colleagues who know me well will just joke with me about my portions (they're very small) and comment how they wish they could eat as little as i do. Never anything rude, inappropriate or even uncomfortable.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730576680.0, "datetime": "2024-11-02T19:44:40", "subreddit": "ARFID", "id": "lv2ewwv", "text": "I get it honestly, my arfid is overall disinterest of food (among other issues) so the majority of what i eat are things that i dont like but just eat so i can say that i actually ate that day. There are times where the idea of eating anything does make me nauseated so i understand both sides.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731223388.0, "datetime": "2024-11-10T07:23:08", "subreddit": "ARFID", "id": "lwdoeq2", "text": "Right now its miso soup and rice either from the Asian market or 1 specific restaurant, veggie korma & cheese naan also from a specific restaurant, mexican rice & frijoles, and a no-name brand of homemade Cuban hot sauce I've been puttin on everythin I've been up for eating lately.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731223458.0, "datetime": "2024-11-10T07:24:18", "subreddit": "ARFID", "id": "lwdoior", "text": "fellow somewhat adventurous vegetarian ARFID-er as well!...nice to know theres more of us (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731260468.0, "datetime": "2024-11-10T17:41:08", "subreddit": "ARFID", "id": "lwfx4z3", "text": "Heyy! My ARFID is just general dislike of foods so I'm liable to try it with no problem but either eat insanely small amounts of it or just never eat it again even if i liked it lol. Makes no sense but here I am lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731452487.0, "datetime": "2024-11-12T23:01:27", "subreddit": "ARFID", "id": "lwtsjrw", "text": "This is actually mainly why i have ARFID lol i restrict my eating bcuz all food (except for bakeries) smells like straight ass to me. I love coffee but if i go into a coffee shop for more than a few minutes I'll throw up, I'll live off cheese but if i smell it i wont touch it for months. I can make my fav dish but need to air the house out during/after cooking or i wont be able to eat. its annoying but i havent figured out a way around it besides just trying to tune it out when it's not super overpowering.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734809360.0, "datetime": "2024-12-21T19:29:20", "subreddit": "ARFID", "id": "m36g3xz", "text": "I'll take this anyday over those god awful (ridiculously huge) popcorn tins or chocolate advent calendars.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736007182.0, "datetime": "2025-01-04T16:13:02", "subreddit": "ARFID", "id": "m5dcdw5", "text": "Oooh i have ARFID*plus* lol\n\nPrimarily Restrictive with Avoidant features...no fearful traits that I can recall.\n\nI just hate food and was convinced after Y2K i would have a meal-in-a-pill type options 😂\n\nETA: i realized i do have a fear-based trait surrounding g.i discomfort (IBS gang!) with some foods so I'm actually a triple-threat.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736007378.0, "datetime": "2025-01-04T16:16:18", "subreddit": "ARFID", "id": "m5dczrl", "text": "for me currently this is tortilla chips until they randomly gross me out in 2-3 business days and then I'm back to eating just handfuls of trail mix", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736011665.0, "datetime": "2025-01-04T17:27:45", "subreddit": "ARFID", "id": "m5dqltr", "text": "Its rough...my usuals are no longer desirable lol\n\nfor me its been a specific brand of trail mix, string cheese and tortilla chips.\n\ni love cooking/baking but have little to no desire to eat anything i make.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737360930.0, "datetime": "2025-01-20T08:15:30", "subreddit": "ARFID", "id": "m84pzla", "text": "It was beyond foul", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737699853.0, "datetime": "2025-01-24T06:24:13", "subreddit": "ARFID", "id": "m8vbfo7", "text": "*sighs* in late 30s", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738234674.0, "datetime": "2025-01-30T10:57:54", "subreddit": "ARFID", "id": "m9zod4q", "text": "mine would be starve or feel that there's food in my stomach lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738234838.0, "datetime": "2025-01-30T11:00:38", "subreddit": "ARFID", "id": "m9zonew", "text": "too relatable, I was passing out in elementary school for not eating and was very underweight. Was a super anxious toddler/kid so i had to sit separately in school occasionally to try and eat. It was rough lol now in my mid 30s I'm still very underweight and having eating challenges but just working through it as I can.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739468095.0, "datetime": "2025-02-13T17:34:55", "subreddit": "ARFID", "id": "mcl09e5", "text": "My brothers deployed a lot and just hearing their stories was enough. im just not cut out for ship food/MREs", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739576815.0, "datetime": "2025-02-14T23:46:55", "subreddit": "ARFID", "id": "mctilna", "text": "yes i had heard autism or adhd was part of the criteria but it was ages ago and i have adhd so i never inquired further.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740079705.0, "datetime": "2025-02-20T19:28:25", "subreddit": "ARFID", "id": "mdutgrs", "text": "I do this but i rinse the fork lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740623084.0, "datetime": "2025-02-27T02:24:44", "subreddit": "ARFID", "id": "mf03lee", "text": "Honestly I just say \"I have very complicated eating habits, let me save u the headache & I'll handle my meals but thank you!\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1741548928.0, "datetime": "2025-03-09T19:35:28", "subreddit": "ARFID", "id": "mgwhau5", "text": "ive only been able to start enjoying Pringles because they have a lightly salted version of the regular flavor...i dare not venture any further lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749368150.0, "datetime": "2025-06-08T07:35:50", "subreddit": "ARFID", "id": "mwmdx5n", "text": "I think for me because I have a common food allergy I'm used to having to say something about my food but it *does* get tiring. I don't eat out often for other reasons but when i do i just try to order the least complicated thing that I'm willing to eat.", "parent_id": null, "link_id": null, "context": null}
