{"type": "comment", "timestamp": 1608389389.0, "datetime": "2020-12-19T14:49:49", "subreddit": "bulimia", "id": "ggd2rhx", "text": "That’s so wonderful! Congratulations! I didn’t have the same strength as you and every time I tried I failed and I ended up having to be refed in the hospital for two weeks. You’re so strong for doing this on your own! Your skin and eyes are good indicators of your health so I’m betting that your blood work will show more even, healthy levels of electrolytes. Good for you!!!! Great work!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609887456.0, "datetime": "2021-01-05T22:57:36", "subreddit": "ARFID", "id": "gi8jkoq", "text": "Wow I can’t wait to see this! I envy your courage.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614735961.0, "datetime": "2021-03-03T01:46:01", "subreddit": "ARFID", "id": "gphi0mi", "text": "Ohhhh I know what you mean. Literally said this multiple times today.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615399334.0, "datetime": "2021-03-10T18:02:14", "subreddit": "ARFID", "id": "gqh1elx", "text": "Kids menu for the win!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615401131.0, "datetime": "2021-03-10T18:32:11", "subreddit": "ARFID", "id": "gqh62x8", "text": "Honestly, as long as a restaurant doesn’t have an age limit on the kids menu (some places say 12 and under only) I don’t mind ordering from the kids menu. I know exactly what I’m going to get and I eat small portions anyway (I’m in my 30s but I’m 4’11” so I don’t require much). Who cares if the waiter thinks I’m just being cheap or whatever. I eat what I eat and if I want a grilled cheese and fries that’s what I want.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615402412.0, "datetime": "2021-03-10T18:53:32", "subreddit": "ARFID", "id": "gqh9a6a", "text": "My husband orders for me too!!! I grew up refusing most foods as a kid, so I’m clueless about food as an adult. My husband is careful when cooking for me and when we are out (pre-covid) I have him find something on the menu I can tolerate. Thank goodness for husbands like ours!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1677865697.0, "datetime": "2023-03-03T17:48:17", "subreddit": "ARFID", "id": "jas50en", "text": "Congrats!!!!! Huge accomplishment!!💜💜", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1680468974.0, "datetime": "2023-04-02T20:56:14", "subreddit": "ARFID", "id": "jepf0ta", "text": "Absolutely!!!! I dream of this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1682887039.0, "datetime": "2023-04-30T20:37:19", "subreddit": "ARFID", "id": "jiclkdd", "text": "There is a place called Discovery that has an ARFID program. I think they have a few campuses on the east coast.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1696969991.0, "datetime": "2023-10-10T20:33:11", "subreddit": "ARFID", "id": "k4bpclw", "text": "Omg this was so me as a kid. I would only eat cheerio brand. The store brand was shaped *slightly* differently (flatter edges like a car tire, as opposed to completely round) and I wouldn’t eat them. Back in the 90s no one knew what ARFID was (it’s still hard to come by a doctor who’s heard of it) so I was criticized and told there’s no way I could tell the difference. I COULD TELL!!!\n\nThank you for being so accommodating to your ARFID child 🙏🙏", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1699966588.0, "datetime": "2023-11-14T12:56:28", "subreddit": "ARFID", "id": "k97fecg", "text": "lol my husband cooks for me and I think it’s one of the manliest things in the world. This guy is such a tool.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1704407366.0, "datetime": "2024-01-04T22:29:26", "subreddit": "ARFID", "id": "kgcgdob", "text": "Yep that’s why I drink Boost. Just chug and get it over with.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1706135129.0, "datetime": "2024-01-24T22:25:29", "subreddit": "ARFID", "id": "kjextog", "text": "I see where you’re coming from, but this is a support sub for anyone who is struggling with ARFID, be it themselves or their children. It’s not a well-known disorder and has only recently been updated to include adults in the diagnosis. We have no right to gatekeep this illness. We are here to support each other but also people who are afraid of what’s happening with their child. It’s not fair to exclude anyone just because you feel as though parents coming here for questions and support are somehow making you feel infantilized. We as adults with ARFID know that it’s more common in children than adults, so we are technically the minority here. And as adults we are (or should be) mature enough to comprehend that these people need support. That said, you are more than welcome to create a new subreddit solely for adults with ARFID to weed out anyone who is under a certain age. \n\nPersonally, hearing stories from parents about their children gives me so much hope for these kids because when I was little there was no internet, the doctors told my parents to just give me vitamins and let me eat whatever I wouldn’t refuse to eat, and that was the end of it. I absolutely love seeing how much time and effort these parents are putting into their kids’ physical and mental health and providing guidance for them as an adult who has struggled with this disorder my whole life.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1706139978.0, "datetime": "2024-01-24T23:46:18", "subreddit": "ARFID", "id": "kjfbflv", "text": "Who is conflating anything though? The only difference is age.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1706191281.0, "datetime": "2024-01-25T14:01:21", "subreddit": "ARFID", "id": "kji4q6i", "text": "In your words, to a parent in this sub, “See? I came here to share my adult experience and you immediately made it about your kid.”", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1715806115.0, "datetime": "2024-05-15T20:48:35", "subreddit": "ARFID", "id": "l47nox3", "text": "I don’t drink alcohol anymore but I used to. I also used to look much younger than I am, so it wasn’t until I hit around 30 that I stopped getting carded. The look on waiters’ faces when I would order an apple martini with my chicken nuggets or grilled cheese from the kids menu was always priceless.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722367025.0, "datetime": "2024-07-30T19:17:05", "subreddit": "ARFID", "id": "lfp2ved", "text": "Same I did a double take because I could have sworn I just read this five minutes ago.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723039778.0, "datetime": "2024-08-07T14:09:38", "subreddit": "ARFID", "id": "lgxw6u6", "text": "When people say “nah it’s not that spicy” when my mouth is ON FIRE!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723812113.0, "datetime": "2024-08-16T12:41:53", "subreddit": "ARFID", "id": "liebb4m", "text": "That’s a really unhealthy assignment. Counting calories should not be taught in school as a healthy practice, because it’s not and everyone has different caloric needs. The most they should be doing is telling kids to eat their fruits and veggies and not drink more soda than water. One thing that I liked (or found educational) was a visual aid that showed how much sugar was in a can of soda, with several tablespoons of sugar inside a ziplock bag. That’s as far as they went though, otherwise they just said “eat healthy, drink water, and exercise” which is a responsible way to go about teaching kids about nutrition. \n\nI’m really sorry you had to go through something so uncomfortable and triggering. That sounds like it would be really hard for any of us in this sub, as well as all the other students struggling with EDs.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723812188.0, "datetime": "2024-08-16T12:43:08", "subreddit": "ARFID", "id": "liebhw5", "text": "I’m hoping this was a while ago and this is no longer part of the curriculum. Hopefully. 🤞", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723843964.0, "datetime": "2024-08-16T21:32:44", "subreddit": "ARFID", "id": "lih0mae", "text": "Ugh I am so sorry. The 2000 calorie a day thing is so not for most people. Personally I’m 4’11” and when I was in inpatient for “anorexia” (ARFID but this was 2007 and ARFID wasn’t a thing people knew about yet) they had us on strict calorie diets and the dietitian actually told me that she had never seen someone maintain their weight at such a low calorie count. I have a very slow metabolism so I gain weight really quickly (although with ARFID it’s not easy) and she actually had to restructure my entire scheduled meal plan to accommodate my slow metabolism.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723844685.0, "datetime": "2024-08-16T21:44:45", "subreddit": "ARFID", "id": "lih2own", "text": "Terrible. I’m so sorry. I would have made everything up just so I didn’t have to embarrass myself and be shamed by my teachers.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723848094.0, "datetime": "2024-08-16T22:41:34", "subreddit": "ARFID", "id": "lihc06g", "text": "Understanding that different foods have a different amount of calories and how our body uses those calories is important. Telling kids that everyone needs the same amount of calories and that there is a right way and a wrong way to be healthy is the wrong way to go about it. \n\nIs it good to tell kids that fruits and vegetables tend to have fewer calories and that things like bread, pasta, and candy have more calories and less nutrition? Yes. Is it healthy for them to focus solely on the number of calories they’re eating as opposed to the overall balance of vitamins and protein they’re getting in their diet? Absolutely not.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724859155.0, "datetime": "2024-08-28T15:32:35", "subreddit": "ARFID", "id": "lkctfj5", "text": "You and I should share a meal sometime. I like the pointy ones, so you can have all my squishy ones.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725024703.0, "datetime": "2024-08-30T13:31:43", "subreddit": "ARFID", "id": "lko431p", "text": "I’m a super taster too! It’s so frustrating that everything tastes so much. That’s the only way I can explain it, that food “tastes a lot.”", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725258642.0, "datetime": "2024-09-02T06:30:42", "subreddit": "ARFID", "id": "ll3y5sc", "text": "“Snap out of it” seriously? r/thanksimcured", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725299705.0, "datetime": "2024-09-02T17:55:05", "subreddit": "ARFID", "id": "ll6hbez", "text": "Not quite sure why they think one has to do with another. I’m married, coming up on 13 years together, and my husband is nothing but supportive. He will cook something plain for me and then add his own spices or whatever to his portion. He’s the opposite of me. He loves spices, spicy food, onions, all the stuff most of us can’t handle, and it doesn’t bother him at all. He loves me and doesn’t judge me at all. \n\nThe people judging and calling us childish are the ones with the issue. Most of us know to mind our own business.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725916663.0, "datetime": "2024-09-09T21:17:43", "subreddit": "ARFID", "id": "lmc89aj", "text": "I’ll take your brown croutons and you can have my light ones! I don’t mind the brown ones, but I love me some crunchy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727173396.0, "datetime": "2024-09-24T10:23:16", "subreddit": "ARFID", "id": "loo2qe8", "text": "The first time I had Covid and 100% lost my sense of taste and smell, I could tell what I was drinking from the texture alone. Whoever thinks liquids don’t have texture is sorely mistaken.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727173472.0, "datetime": "2024-09-24T10:24:32", "subreddit": "ARFID", "id": "loo2uwj", "text": "Have you ever had Nestle brand bottled water? The worst!!!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727173629.0, "datetime": "2024-09-24T10:27:09", "subreddit": "ARFID", "id": "loo344c", "text": "Mouth feel is actually a legitimate term used by chefs! My friend used to work as some type of food taster, not quite sure what the nature of her job was, but mouthfeel was actually part of the qualifiers for foods.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727174159.0, "datetime": "2024-09-24T10:35:59", "subreddit": "ARFID", "id": "loo4017", "text": "This looks so good! I’m a big mac and cheese fan but I’m on a diet now and can’t have it. I am so proud of you for trying something new!! Also good call on the butter. With mac and cheese I think the slimier the better!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727174294.0, "datetime": "2024-09-24T10:38:14", "subreddit": "ARFID", "id": "loo486p", "text": "My family has always poked fun at me for always ordering the same foods. Wherever we go I always have the same thing every time we go there. They’re very supportive though and if we go somewhere new they look at the menu for me and find something they think fits my “algorithm” as they call it. I’m so lucky they are so understanding. My husband helps me with menus too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727205220.0, "datetime": "2024-09-24T19:13:40", "subreddit": "ARFID", "id": "loqk4fr", "text": "Totally! And they leave my mouth feeling differently for a while after I drink them too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727560773.0, "datetime": "2024-09-28T21:59:33", "subreddit": "ARFID", "id": "lpejkho", "text": "Dog food? What is your “friend’s” problem? Dog food is for dogs and this is abhorrent behavior from another person. \n\nWhy are you not allowed back at home? You’re a minor and your parents/guardians have a legal obligation to house you until you’re 18. \n\nWhere are your friend’s parents and are they allowing you to be served dog food? I am so sorry this whole situation is happening. This is so awful.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727562895.0, "datetime": "2024-09-28T22:34:55", "subreddit": "ARFID", "id": "lpep4e3", "text": "This is a terrible situation for you to be in. Do you have any other family in the area you can stay with until your mom gets home? Aunts uncles cousins anyone? Family friends? \n\nDoes your mom know this person is trying to feed you dog food?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728468730.0, "datetime": "2024-10-09T10:12:10", "subreddit": "ARFID", "id": "lr2ihx0", "text": "I’ll only try new food with my family or my husband. My family is very respectful of my ARFID and even helps me order stuff at restaurants that they know will fit my “algorithm” as they call it. My husband cooks for me and knows my safe foods and never pushes me to try anything unless he’s 100% positive it fits into my algorithm. Even my sister in law (who I really don’t like, and who doesn’t really like me either) understands my palate and respects it because she would rather I eat something than not offer something I can eat. \n\n“Just try it” is absolutely off limits. If I say no, it’s because my body is saying no. If I look at it or even smell it and my body says “that is not food” I will under no circumstances eat it. \n\nAlso does anybody else hate “it’s not *that* spicy”? I can’t even have black pepper without my mouth practically catching fire. Any amount of spicy is too spicy. Even bell peppers are spicy to me and I know logically they’re not spicy but my brain doesn’t agree and I’m not about to force myself to eat them. And don’t get me started on raw onions and why they shouldn’t exist.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728536104.0, "datetime": "2024-10-10T04:55:04", "subreddit": "ARFID", "id": "lr7hy0y", "text": "I see your Lay’s barbecue chips and raise you Cool Ranch Doritos.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732577340.0, "datetime": "2024-11-25T23:29:00", "subreddit": "ARFID", "id": "lyzlp78", "text": "This is absolutely the right response. It’s nobody’s business what we eat for lunch, but thanks for making me self conscious and paranoid that everyone thinks I’m a child.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733846540.0, "datetime": "2024-12-10T16:02:20", "subreddit": "ARFID", "id": "m1diimm", "text": "I hope you get better soon! And I hope when you’re better you are able to eat normally again. This is no fun!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735834676.0, "datetime": "2025-01-02T16:17:56", "subreddit": "ARFID", "id": "m50zg9q", "text": "Hard pass on the pepperoni.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737939421.0, "datetime": "2025-01-27T00:57:01", "subreddit": "ARFID", "id": "m9dcmyf", "text": "Yay! I had a similar reaction to a dragonfruit which is almost just a white kiwi but a little softer so you can eat it with a spoon out of the skin.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737986009.0, "datetime": "2025-01-27T13:53:29", "subreddit": "ARFID", "id": "m9g9e2t", "text": "My husband knows what I like and what I don’t. So he can usually guess what new foods I would like and 9/10 times I actually end up liking it. Which is how I ended up trying the dragon fruit. I never would have tried it if he didn’t think I would like it. He orders for me in restaurants I’ve never been to before because I don’t speak “menu.”", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738012220.0, "datetime": "2025-01-27T21:10:20", "subreddit": "ARFID", "id": "m9is28m", "text": "There was a post about this recently in another sub (not an ed sub, I think it was a random thoughts sub). Something like “why isn’t there kibble for people? I’d love to eat the same thing every day” and I felt so seen!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738012386.0, "datetime": "2025-01-27T21:13:06", "subreddit": "ARFID", "id": "m9isnsm", "text": "But dog kibble has all the nutrients they need.. all of it. Dogs can literally survive and be completely healthy eating nothing but their dry food and water every single day. Cereal has *some* nutrients, but you have to add the milk and would definitely have to take additional supplements for it to be close to balanced. Plus it’s really high in sugar (or at least high in carbs) so it doesn’t really translate well into kibble.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738014789.0, "datetime": "2025-01-27T21:53:09", "subreddit": "ARFID", "id": "m9j1ayd", "text": "Yep I’m with you. It would be really cool if they made a human version of kibble for those of us who don’t want to deal with flavor or variety. We just wanna get through life without having to think about “what we want to eat.” Just imagine life without anyone asking what we are “hungry for.” So much mental energy spent alone on that question!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739573755.0, "datetime": "2025-02-14T22:55:55", "subreddit": "ARFID", "id": "mct9r1u", "text": "I’m not autistic and I’m diagnosed ARFID. Your psychiatrist is absolutely wrong. There is a lot of overlap with autism and ARFID but you can absolutely have ARFID without autism.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739658273.0, "datetime": "2025-02-15T22:24:33", "subreddit": "ARFID", "id": "mcz4v5w", "text": "My husband is on the autism spectrum and there’s nothing he won’t eat! I call him my human garbage disposal (in a loving way!) because he will eat anything I don’t like. If we are out and there’s something on my plate I won’t eat, I’ll just put it on his plate and he gobbles it up. He tries new food all the time “for fun” which to me is one of the weirdest things a person can do. But everyone is different!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743002287.0, "datetime": "2025-03-26T15:18:07", "subreddit": "ARFID", "id": "mjugvep", "text": "Ooooo if you’ve found a new safe food I’m so excited for you!!!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743597713.0, "datetime": "2025-04-02T12:41:53", "subreddit": "ARFID", "id": "ml0j3c5", "text": "Honestly, whatever helps. Fed is best and if you can’t get yourself to eat what’s offered to you, it’s fine to just eat dry cheerios out of the box or whatever floats your boat.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744070195.0, "datetime": "2025-04-07T23:56:35", "subreddit": "ARFID", "id": "mly9cvq", "text": "Literally anything spicy. Food shouldn’t physically hurt to eat.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745257650.0, "datetime": "2025-04-21T17:47:30", "subreddit": "ARFID", "id": "moah4dd", "text": "I’m so sorry you’re being dismissed due to your gender. ARFID does not discriminate. But people do, and when they do it makes people feel like they don’t deserve the help they need. I’m really sorry. Keep looking.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749565422.0, "datetime": "2025-06-10T14:23:42", "subreddit": "ARFID", "id": "mx0sc5z", "text": "Oh we’re gay now too? Who uses that word like that after second grade anymore?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1750189018.0, "datetime": "2025-06-17T19:36:58", "subreddit": "ARFID", "id": "mybj2dl", "text": "I’m pushing 40 and still eat off the kids menu.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1752218838.0, "datetime": "2025-07-11T07:27:18", "subreddit": "ARFID", "id": "n2idj3t", "text": "I’m close to nyc and there is definitely something I can eat within a block or two in any given direction. If you were in a rural area where you’d have to drive for half an hour to get to another restaurant I would kind of understand why she would feel like there wasn’t another option for her (although it’s still not ok that she isn’t even willing to accommodate YOUR health needs the way you have been accommodating hers) but most restaurants these days have their menus online and she can find a restaurant that serves something she could eat. But in the city? No. \n\nYou’ve been very kind by prioritizing her needs but your needs are important too. Fast food is VERY high in sodium so this isn’t just you getting tired of going to the same places all the time. This is literally something your doctors have told you is mandatory for your health condition.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1752219322.0, "datetime": "2025-07-11T07:35:22", "subreddit": "ARFID", "id": "n2iedx5", "text": "It sounds like she’s so used to people caving in and going wherever she wants that she’s not used to hearing “no.” Let her know that you understand it might be frustrating for her, but it’s frustrating for you too because your diet is also limited, just like hers but in a different way. It seems like this has been going on for quite some time and she is so used to getting her way that the idea that anyone would take away that routine is upsetting. You are both adults (I’m assuming) so she needs to act like one. I understand she is ND but a lot of us with ARFID are (it’s common with people who have sensory issues, so it’s no surprise when we have food issues too) so the responses you’re getting here are all from people who do truly understand where she’s coming from and we are all STILL on your side here. Let that sink in.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1752219784.0, "datetime": "2025-07-11T07:43:04", "subreddit": "ARFID", "id": "n2if77g", "text": "From the comments it sounds like their friend is not understanding though and is getting upset whenever OP asks to go somewhere else. She becomes irritated and irate when she doesn’t get to go to one of her preferred fast food places, which isn’t at all fair to OP. A vast majority of us are understanding that *we* have the problem, but it’s incredibly rude to insist that we only eat at fast food places, in nyc no less where there is somewhere we can all find something to eat within a block or two.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1752786013.0, "datetime": "2025-07-17T21:00:13", "subreddit": "ARFID", "id": "n3pa1bb", "text": "“I have stomach issues” is really good for making sure there are no follow up questions. No one wants to know.", "parent_id": null, "link_id": null, "context": null}
