{"type": "comment", "timestamp": 1610977185.0, "datetime": "2021-01-18T13:39:45", "subreddit": "EatingDisorders", "id": "gjpvrpn", "text": "I think the common thought (and probably the right one) is to not focus on weight loss during this stage of your recovery. And I agree, because I'm doing the same thing and it is a constant struggle.\n\nThat being said, this is what worked for me (for about a month before relapsing since the new year): eating *really* healthy meals and working out. That helped disrupt the b/p cycle because I didn't feel as much guilt after eating. Working out helped because burning all that energy made my body desperate enough for energy that I was GOING to eat. It's easy to starve yourself of nutrients if you then just lay in bed all day; it's harder if you're maintaining a somewhat active lifestyle.\n\nMy meals were usually a meat, a cooked vegetable, and some sort of huge salad with cheese, craisins, whatever crispy toppings i like, and a homemade dressing (so i could control the amount of salt, fat, and sugar). I tried to minimize saturated fats and sugar, but not shy away from them if needed (like, i don't need butter on broccoli, but I didn't want to hold myself back from adding a bit of honey, cheese, or EVOO to something if i know I'll really enjoy it). As my workout intensity increased I noticed I was getting lots of headaches and tried integrating more carbs, which definitely helped; for me that meant a plain, baked sweet potato or sometimes brown rice. I snacked on fruits and had greek yogurt with granola, dark chocolate, and craisins for when i was caving something sweet. Or a cup of hot chocolate. Or cookies and milk if I felt like living dangerously  :) \n\nFor exercise I literally just jogged in place in my apartment. Sometimes while watching TV. Sometimes listening to the Hamilton soundtrack. Sometimes fast, sometimes just walking. Not necessarily hitting a number of steps, but trying to beat my lowest number over the previous seven days. AND I didn't weigh myself. Weight loss was based on how my clothes fit and comparing my overall fitness (i.e. only being able to jog for like 20 seconds vs 10 minutes)\n\nFor me, this was the healthiest I'd been since the pandemic causing ALL my ED behaviors to flair up in the worst way, and I'm trying to fall back into it. I liked being able to enjoy food and enjoy my body without fighting the urge to punish it every time I ate something. \n\nGood luck with all the things!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611932985.0, "datetime": "2021-01-29T15:09:45", "subreddit": "bulimia", "id": "gl8sfx0", "text": "Something that I have learned and have to remind myself: b&p over the course of a year was worst for my body than being obese since I was a child. Medical confirmation and I could *feel* that I was not doing well. \n\nFor me, what works best (and i got about 6 weeks in with no issues before relapsing due to the holidays) is eating a lot of super healthy food and doing some amount of exercise. I think i initially gained a few pounds, because my body wasn't used to digesting, but then starting losing much more effectively than i was pre-recovery. \n\nMost of my dinners were a giant salads, lean protein, and some cooked vegetable, only limiting refined sugars and saturated fat, but not particularly strictly. I started integrating carbs (sweet potatoes, whole grains) once my workouts got more intense, and I could feel that I needed more energy. But generally, I find that working out (and by working out i mean i jog in front of the TV and sometimes do squats) and eating healthy foods helped eliminate the guilt trigger and \"purge\" response and also kept me from gaining while recovering.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1612487229.0, "datetime": "2021-02-05T01:07:09", "subreddit": "bulimia", "id": "gm27igw", "text": "I started losing weight like twice as fast once I stopped b/p. Turns out your body likes it when you take care of it. Who’d have thunk it 💀", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613008382.0, "datetime": "2021-02-11T01:53:02", "subreddit": "bulimia", "id": "gmw1u2q", "text": "The sobriety app I’m using to track my recovery shows me how much money I’ve saved over the past *checks app* 12 days, 6 hours, 21 minutes, and 33 seconds. The amount I’m saving is a reeeeally good incentive to keep myself b/p free.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613017702.0, "datetime": "2021-02-11T04:28:22", "subreddit": "bulimia", "id": "gmwjl2o", "text": "I Am Sober. I think someone in this sub recommended it when they hit 76 days actually? I pledge every morning, review at night, get little inspirational quotes (mostly stupid but I screenshot the good ones), and there’s a forum if you want to share struggles or victories. \n\nAnd sometimes when I’m having a bad day I’ll just sit and look at the counter go up instead of ordering a pizza.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614438335.0, "datetime": "2021-02-27T15:05:35", "subreddit": "bulimia", "id": "gp0lhig", "text": "Good luck! I know it’s hard, but it does get easier as you go on (I’m on day 29!). Thinking of you and sending you all the support I can!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614727816.0, "datetime": "2021-03-02T23:30:16", "subreddit": "bulimia", "id": "gph269e", "text": "Go to the dentist if you can, it will alleviate a lot of stress. I went last Thursday after b/p several times a day for most of 2020. I was convinced that my teeth had been eroded to nubs, were completely transparent, and every small amount of sensitivity was surely the sign of some damage I’d done.\nBut yeah, saw the dentist, told her about my ED history, and left with a clean bill of health and strict instructions to floss. Everyone in the office also said I had great teeth which helped alleviate a lot of paranoia that everyone who saw me was heckling over my see-through teeth.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614730555.0, "datetime": "2021-03-03T00:15:55", "subreddit": "EatingDisorders", "id": "gph7imv", "text": "Maybe just start out with gradually increasing your moment in light ways while focusing on making your body healthier and stronger instead of weight loss? I like to go of leisurely walks and upping my steps a little bit each day and focus on the benefit of my legs and lungs being stronger.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614809031.0, "datetime": "2021-03-03T22:03:51", "subreddit": "bulimia", "id": "gpl24zf", "text": "My recovery app tracks how much I’m saving by not indulging... suddenly it makes sense why I was so broke all of last year. Literally half or more of my money after bills was spent of food I wasn’t even keeping down 😭", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614814879.0, "datetime": "2021-03-03T23:41:19", "subreddit": "bulimia", "id": "gplecbs", "text": "I Am Sober. I’ve seen people in ED subs who love and and some that don’t. I like the sobriety counter and keeping track of savings, but don’t love the community feature. It’s worth checking out.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615076986.0, "datetime": "2021-03-07T00:29:46", "subreddit": "bulimia", "id": "gq1qkxi", "text": "Yay!! Congrats on day one and best of luck going forward.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616846270.0, "datetime": "2021-03-27T11:57:50", "subreddit": "bulimia", "id": "gsflvn5", "text": "I’ve been realizing that too! For me the big one has been pasta. I can just enjoy the a regular portion, and that can fill me up, taste amazing, and not throw me into a b/p tailspin", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617735743.0, "datetime": "2021-04-06T19:02:23", "subreddit": "bulimia", "id": "gtloelm", "text": "For my first few weeks of recovery I didn’t count chew&spit behaviors. My goal was to stop puking and I needed that leeway without feeling like a failure.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619464977.0, "datetime": "2021-04-26T19:22:57", "subreddit": "bulimia", "id": "gvyr0gq", "text": "When I think back to the evolution of my ED, I frequently laugh/cry at college me buying double the meals to “save for later” and then eating it like an hour later 😕", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620003400.0, "datetime": "2021-05-03T00:56:40", "subreddit": "bulimia", "id": "gwqawvq", "text": "I’m 27, female, and have developed bulimia last year (woohoo covid) after years of various disordered behaviors. I’ve been in recovery for 93 days. \nI’m a sock designer and like baking cookies (this feels like a get to know you exercise, so those are my fun facts).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620126467.0, "datetime": "2021-05-04T11:07:47", "subreddit": "bulimia", "id": "gww5sxv", "text": "Reddit keeps giving me fasting and diet sub recommendations because I’m in anti-diet and ED subs. \nAs much as the Internet Gods are tracking us, you think they’d be able to pick up nuance a little bit better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620317732.0, "datetime": "2021-05-06T16:15:32", "subreddit": "bulimia", "id": "gx5yovh", "text": "Hey congratulations!! \nI looove potatoes, especially fries, but also grew to hate them in the thick of my b/p period. Then in recovery it became a fear food for me too. I’ve been integrating them more and more and really enjoying them again", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625876706.0, "datetime": "2021-07-10T00:25:06", "subreddit": "bulimia", "id": "h4nfxld", "text": "My dentist was one of the first people I told as well. She didn’t tell me the risks (I’m an adult in recovery who came to her specifically because of my ED and mentioned it on my forms, so she probably assumed I was aware), but did reiterate the things I can do to minimize damage and the sensitivity due to acid erosion. That was great and helped me to feel understood and not shamed. Like I was in a safe space.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626372001.0, "datetime": "2021-07-15T18:00:01", "subreddit": "bulimia", "id": "h5avbag", "text": "It is the funniest thing in the world that I just got out of a meeting, put my head down and thought “god, I hate my job” and then immediately saw this notification 😭😂😂\n\nEdit: for what it’s worth, the actual sock part is fun. Is the company that’s miserable, so you’re not wrong.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1627432544.0, "datetime": "2021-07-28T00:35:44", "subreddit": "bulimia", "id": "h6rul5s", "text": "My boyfriend knows. We’re long distance and he was unaware during my bad bout last year bit now I’m in recovery so I’m more willing to be open about it. He’s pretty good- gentle reminders to eat and take care of myself, but doesn’t mother. Sometimes I have to explain to him that certain things aren’t okay but he gets it pretty quickly (for instance, he texted his friends about how much I ate for lunch this weekend and I had to explain to him that allowing myself to eat a large meal without bingeing or triggering a purge is actually a huge win and not a punchline) and usually addresses his behavior.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628103928.0, "datetime": "2021-08-04T19:05:28", "subreddit": "bulimia", "id": "h7pn81s", "text": "Congratulations!!!!! That is so awesome. \nIm just over six months and a year seems so far away- I needed to hear this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630280420.0, "datetime": "2021-08-29T23:40:20", "subreddit": "EatingDisorders", "id": "hav60up", "text": "ED Brain loves it. Recovery Brain hates it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636297528.0, "datetime": "2021-11-07T15:05:28", "subreddit": "bulimia", "id": "hjoi8f5", "text": "It means that for 281 days I have been actively and successfully refraining from the binge/purge cycle.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642985196.0, "datetime": "2022-01-24T00:46:36", "subreddit": "EatingDisorders", "id": "htye4y9", "text": "I go from fine to starving with very little in between. And I think my digestive system is fucked because I now get awful random bouts of gas at night that feel like I’m being stabbed in the torso. \nEDs definitely take a toll on the body.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643072696.0, "datetime": "2022-01-25T01:04:56", "subreddit": "fuckeatingdisorders", "id": "hu3bjmr", "text": "I’m proud of you and hoped you enjoyed your pizza! \n\nToday I had bananas foster with ice cream. And neither binged nor worried that I shouldn’t be eating it. It was delicious.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643241743.0, "datetime": "2022-01-27T00:02:23", "subreddit": "EatingDisorders", "id": "hudap9n", "text": "I find that eating more often, alternating light and heavier meals is the best way for me to make sure I’m eating enough during the day. Or lots of small portions just sort of scattered throughout the day. Also helps keep fear foods at bay because it’s hard to be afraid of anything if I’m only eating a bit at a time anyways.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643633313.0, "datetime": "2022-01-31T12:48:33", "subreddit": "fuckeatingdisorders", "id": "huzjnv1", "text": "I didn’t even know there were tiktok, ig, and yt recovery personalities. It makes my skin crawl to think about it. Recovery and EDs are such a tenuous thing that just seems like asking for trouble for viewers and content creators.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644328829.0, "datetime": "2022-02-08T14:00:29", "subreddit": "fuckeatingdisorders", "id": "hw2yt36", "text": "I do struggle a lot with it as a concept- recovery is so fragile and personal and an ongoing process, presenting yourself as “fixed” enough to be an influencer seems… ill thought out, at best. I do follow a lot of body positive, intuitive eating, and anti diet people. It’s not ED specific but for me, I think that’s best.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644332535.0, "datetime": "2022-02-08T15:02:15", "subreddit": "fuckeatingdisorders", "id": "hw37abz", "text": "Recovery is a process, and hopefully this realization will help you confront some of the lingering anxiety you have around certain foods! I've been in recovery for a year and still have to rethink certain disordered behaviors I didn't realize I was doing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644542639.0, "datetime": "2022-02-11T01:23:59", "subreddit": "bulimia", "id": "hwg2qfk", "text": "My year was the 29th of January! Congrats 🎉🎉", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645967459.0, "datetime": "2022-02-27T13:10:59", "subreddit": "fuckeatingdisorders", "id": "hyn1z3c", "text": "My breath would smell like puke under my mask. No matter how well I brushed or flossed or rinsed, I’d be out running errands, gagging on the smell of my own breath. \n\n\nMy apartment smelled like puke. Like that was a smell I had to actively cover up. So gross. \n\n\nI’d get dizzy and lightheaded all the time. Forget to drink water before going out? Im toast because I probably hadn’t eaten really in too long so my body is running on bad vibes and puke breath. The number of times I broke into a cold sweat in the grocery store or had to pull over while driving is ridiculous.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645967626.0, "datetime": "2022-02-27T13:13:46", "subreddit": "fuckeatingdisorders", "id": "hyn291g", "text": "I’ve been struggling with boredom outside of work lately and sort of confused as to why- I’m realizing that I spent a lot of my free time engaging in ED behaviors. And a lot of my early recovery obsessing over not engaging in ED behaviors. Now is the first time in years I’ve been able to have free time without thinking about eating/not eating. \n\nI’ve got to relearn what my hobbies are lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645969478.0, "datetime": "2022-02-27T13:44:38", "subreddit": "fuckeatingdisorders", "id": "hyn5i8o", "text": "I think it’s good hobbies and outside interests no matter where you are in your ED. I did a 1000 piece puzzle in 2020 when Bulimia and a pandemic teamed up to make my life a living hell, and honesty just having a way to pass the time that wasn’t about my body and didn’t really require a lot of focus (I loved to read but didn’t have the mental capacity for it at the time) was great. \n\nBest of luck and take care of yourself.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1646837027.0, "datetime": "2022-03-09T14:43:47", "subreddit": "fuckeatingdisorders", "id": "hzz68ey", "text": "Yay congrats!!!! Pushing through the anxiety is so annoying, but it gets easier! Enjoy your life!!! \n\n&#x200B;\n\n(which I needed to hear- I'm going on a weekend trip and already anxious over the food situation.. but its a vacation. I deserve it. And i deserve every yummy thing I get!)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647049289.0, "datetime": "2022-03-12T01:41:29", "subreddit": "fuckeatingdisorders", "id": "i0bgfc7", "text": "Especially in THIS sub, it seems pretty clearly anti-ED? \n\n\nAlso I want to be sympathetic, but mostly I hate those posts for how triggering they can be to others.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650632397.0, "datetime": "2022-04-22T12:59:57", "subreddit": "fuckeatingdisorders", "id": "i5qs5zo", "text": "Just bought a new pair of jeans. They fit great and I can eat in them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651238710.0, "datetime": "2022-04-29T13:25:10", "subreddit": "fuckeatingdisorders", "id": "i6nw06a", "text": "I’m super alert usually (went through a weird exhausted period, but that was allergies lol) and my body is more stable. Like my blood sugar doesn’t cause me to get shaky in the middle of running errands or driving. That’s cool. And safer. \n\nI’m also at a point in my recovery where sometimes it’s possible to choose not to gaf. Like my recovery brain is stronger than my ED brain, and sometimes I can silence the ED entirely. On vacation with my boyfriend and trying out new restaurants? I can just opt to not care. I’ll probably care later. I’ll probably freak out and weigh myself when I get home. But I’ll enjoy the dang vacation. And even after I get home and freak, still be able to move on and not react dangerously.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652371511.0, "datetime": "2022-05-12T16:05:11", "subreddit": "fuckeatingdisorders", "id": "i8c0mqc", "text": "A part of me thinks that the choruses of “the weight will redistribute and the extreme hunger will pass” is panicked people attempting to calm even more panicked people. \n\nLike yes, eventually you may get over the all the ugly parts of ED and recovery. But maybe it’ll be hard forever. Maybe you’ll eat more than you’re used too. Maybe you naturally have more of a belly. It’s all okay!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652812788.0, "datetime": "2022-05-17T18:39:48", "subreddit": "fuckeatingdisorders", "id": "i8z8508", "text": "Thank you for posting this 💚💚 \n\nBest of luck to you and your recovery!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652823025.0, "datetime": "2022-05-17T21:30:25", "subreddit": "bulimia", "id": "i8zwul8", "text": "I’m so happy to see that- congratulations!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653686625.0, "datetime": "2022-05-27T21:23:45", "subreddit": "fuckeatingdisorders", "id": "ia8pdpn", "text": "Thank you! I’ll still watch, but I may… idk call my mom during that bit. Distract myself baking.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653927762.0, "datetime": "2022-05-30T16:22:42", "subreddit": "fuckeatingdisorders", "id": "iak5gcd", "text": "I experienced good things with those too- honestly the only ON jeans I’ve had success with. I wish they’d do a boyfriend cut with the same premise, I’d eat that up.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653969586.0, "datetime": "2022-05-31T03:59:46", "subreddit": "bulimia", "id": "iami7d7", "text": "I Am Sober \n\nFor what it’s worth- I personally love the time and money tracker, but find the community section to be triggering as hell, so proceed with caution and aware of what does and doesn’t work for you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655281869.0, "datetime": "2022-06-15T08:31:09", "subreddit": "fuckeatingdisorders", "id": "icfl5am", "text": "I like that sub, but it absolutely a mixed bag. I’m very liberal with the block function. There are also an irritating number of people who go in their thinking Bulimia is a neat new dieting trick they should try and I have no issues railing on them for it. Okay, they’re stupid and that’s one thing, but they’re triggering other people in a sensitive headspace and that is not. \n\nBut yeah, definitely leave spaces that do you more harm than good (edanonymous and the meme sub are both no-gos for me).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656447887.0, "datetime": "2022-06-28T20:24:47", "subreddit": "bulimia", "id": "ie3m3cy", "text": "My very well intentioned, but sometimes very stupid partner's advice for my incapacitating stomach cramps and bloating (which was definitely caused by the damage bulimia did to my GI system) was to take a laxative. Had to explain to him that as a recovering bulimic, laxatives are the one line i haven't crossed and probably don't ever suggest that again lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657062582.0, "datetime": "2022-07-05T23:09:42", "subreddit": "bulimia", "id": "if07ncm", "text": "Oh, I didn’t realize this was something I needed to see; I’m coming up on a year and a half and the urge to relapse has been hitting hard. But seeing someone else hit those milestones really helps. \n\nI’m so, so proud of you. And wish you all the happiness and health you can stand.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657131322.0, "datetime": "2022-07-06T18:15:22", "subreddit": "bulimia", "id": "if3s1hr", "text": "Thank you- and your post really did help. I feel a lot better than I have been, and you had a lot to do with that. So thanks a ton!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659724185.0, "datetime": "2022-08-05T18:29:45", "subreddit": "fuckeatingdisorders", "id": "ij34pgr", "text": "Same. I feel sad for them. I wish them better things in the future. When they're young, my heart fucking weeps for them. \n\nBut the vitriol, eagerness to trigger themselves and others, rampant fatphobia- it's the worst. And at the end of the day, I care more about my own recovery than trying to positively engage with internet strangers who don't want help anyways. So blocked, with abandon.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659958995.0, "datetime": "2022-08-08T11:43:15", "subreddit": "EatingDisorders", "id": "ijfh26f", "text": "Same, I think. Covid quarantine made it hard to eat. Then I starting eating dinner “with” my partner by sharing pics of our plates then eating at the same time, then I’d watch food documentaries. It’s hard to demonize eating when watching something celebrating food.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1660828886.0, "datetime": "2022-08-18T13:21:26", "subreddit": "fuckeatingdisorders", "id": "iksj98e", "text": "Uuugh literally anyone eating a dessert “I don’t even need this…” \n\nYou bought/got it, are going to eat it, is why bother complaining about it?? Just enjoy your cake.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665587883.0, "datetime": "2022-10-12T15:18:03", "subreddit": "bulimia", "id": "is13rgj", "text": "Ngl not wanting to have to tell my dentist I relapsed is like… 20% of my recovery motivation. They’re so proud of me and I crave validation 😭", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1675186269.0, "datetime": "2023-01-31T17:31:09", "subreddit": "EatingDisorders", "id": "j6nua7u", "text": "Big ass puzzles. Art. Audio books or reading (watching something makes me snack-ish, reading something makes me want tea). Leisurely walks. Hot showers. Naps.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717457809.0, "datetime": "2024-06-03T23:36:49", "subreddit": "EatingDisorders", "id": "l6zlmaa", "text": "Caesar salad. Scrambled eggs. Hummus.", "parent_id": null, "link_id": null, "context": null}
