{"type": "comment", "timestamp": 1646789506.0, "datetime": "2022-03-09T01:31:46", "subreddit": "AnorexiaNervosa", "id": "hzwzw2u", "text": "Fantastic! I am super proud of you! That's a great meal right there, noodles are shrugged off as lazy food but they taste great and are satisfying. Much love to you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647573704.0, "datetime": "2022-03-18T03:21:44", "subreddit": "fuckeatingdisorders", "id": "i13y107", "text": "The insults though they were appearance-themed were not about our appearance at all, they did the equivalent of visit a random insult generator online and said whatever it showed. They're assholes for the sake of being assholes, and more often than not it's not even over personal beef but they felt like being an asshole to anyone in their path, that just so happened to be us, and their insults are generic bullshit they pulled from the shallow archives of their shallow minds of hostile things to say. Treat it like fake news, because it is. We took the bait because we didn't know any better at the time, but now we do, especially if you are/have been skinny and their rhetoric never changed, that's hard evidence right there. Don't let yourself get sick and wither away in attempt to halt their crusade because from firsthand experience it does not change, they don't stop, because it was never about your appearance let alone anything rational or based in reality in the first place. Losing weight to gain respect is like studying astronomy in order to learn how to ride a bicycle. It's not even relevant so of course it's not going to work, I learnt the hard way that compensating this way does jack shit. It's gotta be approached directly or by cutting them off completely if they are completely unreasonable and won't stop being a dick.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647874034.0, "datetime": "2022-03-21T14:47:14", "subreddit": "fuckeatingdisorders", "id": "i1japcz", "text": "Two week crew! We got this", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650713809.0, "datetime": "2022-04-23T11:36:49", "subreddit": "EatingDisorders", "id": "i5v7m19", "text": "Binge eating disorder or food addiction", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651623579.0, "datetime": "2022-05-04T00:19:39", "subreddit": "AnorexiaNervosa", "id": "i789ml2", "text": "I LOVE food, I just can't bring myself to eat most foods. I would love nothing more than to eat a donut or a vanilla slice rn, but I just can't for no good reason and I resent with every fiber of my being that I've forbidden such a simple pleasure for myself.\n\nAnd yes, we don't have to look like a holodomor victim to be utterly consumed by this horrible condition. I sure as shit don't look anywhere near it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651624075.0, "datetime": "2022-05-04T00:27:55", "subreddit": "AnorexiaNervosa", "id": "i78aps0", "text": "Yup! One can be morbidly obese and have even more severe malnutrition than someone who is very underweight. For example if someone eats fries and fries only, they would have vitamin+mineral deficiencies up the wazoo and a blood test result would be akin to a screaming alarm.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651624465.0, "datetime": "2022-05-04T00:34:25", "subreddit": "AnorexiaNervosa", "id": "i78bkd2", "text": "Personally it isn't at all, but rather trying to manage how I am perceived by others in terms of raising the baseline degree of respect and courtesy I'm offered by others, not as a stupid vanity aspiration, but as wanting to be treated as a human like everyone else. Basically I fell for the 'thin privilege' myth and learnt the hard way that it is merely a lie, a sociopolitical deception for malicious purposes - divide and conquer, and bringing the masses into obedience of thought and perception. It's a foul ploy which ruined my life.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651667634.0, "datetime": "2022-05-04T12:33:54", "subreddit": "AnorexiaNervosa", "id": "i7a92pm", "text": "Real talk right here", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654043774.0, "datetime": "2022-06-01T00:36:14", "subreddit": "fuckeatingdisorders", "id": "iaq95tf", "text": "The most distressing effect is the exponential cognitive decline. I can't even fucking think, even stupid mundane things like politics are way beyond my capacity atm. On bad days I struggle with choosing pyjamas, and videogames are *way* out of the question as even simple ones like minecraft are too intensive for me. It's not just our physical health which takes a heavy hit, but our minds too. It's a full systemic shutdown. This is the true reality of anorexia.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654044071.0, "datetime": "2022-06-01T00:41:11", "subreddit": "fuckeatingdisorders", "id": "iaq9ro5", "text": "It sure is. All I'm really able to do at this point is lay in bed and listen to music, nothing more. Nobody should ever have to endure this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654044255.0, "datetime": "2022-06-01T00:44:15", "subreddit": "fuckeatingdisorders", "id": "iaqa5s4", "text": "Right back at you. So much love to you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654082476.0, "datetime": "2022-06-01T11:21:16", "subreddit": "fuckeatingdisorders", "id": "iarvcck", "text": "Thank you for the suggestion. My mother helps me. She's very gentle with suggestions for things for me to eat and never forces me beyond my capacity, so long as I eat and within reason, like I can't get away with having weet bix and water for dinner because it's insufficient, but I can have an omelette and/or vegetables and that is okay because it's something substantial and I'm also okay with that. I do get very overwhelmed because I have very few safe foods, but I'm challenging myself almost every day to expand my horizons.\n\nAn afterthought is I hope my original comment may lead people into recovery, this isn't an exaggeration or fearmongering, but the actual reality of this shitty condition when you're stuck in the deep end, and a true hell to endure once you decline to this point which is frankly inevitable. Deterioration of your health is the unavoidable outcome, but you don't have to, you just have to choose recovery. The sooner the better.\n\nMuch love to you!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659996343.0, "datetime": "2022-08-08T22:05:43", "subreddit": "AnorexiaNervosa", "id": "iji03f8", "text": "Dysgeusia/hypogeusia/ageusia. It's such a cruel cycle to know that recovering from malnutrition (particularly zinc deficiency, that's notoriously the primary culprit of this particular problem) will get rid of this constant horrible and very potent bitter-metallic taste in my mouth and inability to taste food, yet finding it utterly futile to attempt to do so because I can't taste food anyway so consuming anything feels like 'unnecessary excess' and wasteful so I don't eat anything proper or nice because I can't taste it anyway. It keeps me stuck on the hamster wheel for sure.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659996445.0, "datetime": "2022-08-08T22:07:25", "subreddit": "AnorexiaNervosa", "id": "iji0cjt", "text": "My hot water bottle is my best friend", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659996512.0, "datetime": "2022-08-08T22:08:32", "subreddit": "AnorexiaNervosa", "id": "iji0ihu", "text": "And how horrible they smell!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659996581.0, "datetime": "2022-08-08T22:09:41", "subreddit": "AnorexiaNervosa", "id": "iji0on8", "text": "You can sleep?????", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659996611.0, "datetime": "2022-08-08T22:10:11", "subreddit": "AnorexiaNervosa", "id": "iji0re7", "text": "This this and more this", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671267794.0, "datetime": "2022-12-17T09:03:14", "subreddit": "fuckeatingdisorders", "id": "j0kg458", "text": "I hated my sick body, I was very deeply ashamed and embarrassed by looking like a freakin halloween decoration - no exaggeration- so I'd always wear the baggiest shit to cover myself, which was frankly clothes meant for kids single digits in age, as that's all that didn't fall straight off me. I hated the stares, the gasps, the comments. That was until I could no longer walk let alone leave the house, and I deteriorated to the point of being bedbound and actively dying. Only by genuine divine miracle did I survive. I'm still trying to gain back my basic bodily functions, but it's a process to come back from the brink of death and I need to be more patient and forgiving with myself.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1680569993.0, "datetime": "2023-04-04T00:59:53", "subreddit": "EatingDisorders", "id": "jev0p2v", "text": "Prior to regaining normal hunger sensation, the cues my body sent that I was hungry was in the form of weakness, tremor, sore throat, brain fog, blurred vision, and the one I tapped into and relied on most to tell me I was hungry which preceded the above was an internal vibrating feeling, like my body was producing this deep humming sensation like a booming subwoofer at a consistent frequency. When I started to feel this, I knew it was time to eat as I knew it would take time to heal and have normal hunger sensations like a classic grumbling shuddering stomach. Maybe you experience these hunger signs too. It's too easy to dismiss and chalk it off to feeling crappy, we got very used to and adept at doing that, but it's important to tap back into it in order to help yourself recover. Your body is working *with* you for your greatest good, not against you. Your body is your teammate, your most loyal companion, and your cheerleader, not your rival. Friend, not foe. Much love to you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1682764226.0, "datetime": "2023-04-29T10:30:26", "subreddit": "EatingDisorders", "id": "ji62sax", "text": "I had the opposite experience. I was stared and pointed at frequently, some people gasped. How was someone so emaciated not dead? I was visual horror, a shocking sight, I disturbed people, and I was absolutely utterly mortified and embarrassed by this and what I had done to my body. Not even clothes 5 sizes too large could conceal the blatantly obvious. I brought every ounce of that shame and humiliation upon myself.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1695256314.0, "datetime": "2023-09-21T00:31:54", "subreddit": "AnorexiaNervosa", "id": "k1hxj2x", "text": "Make friends with your fellow in~~mates~~patients! You'll be surprised at how rich and beautiful the friendships you can create with other people in hospital can be. I've met some absolutely incredible people in hospitals, and they're some of my best treasured memories. You can take this crappy situation and transmute it into something wonderful. Try and make each moment into the best you possibly can. Ask yourself what is the best and most fun thing you can do right now that may bring you joy? Even if it's something simple like coloring in or doing a puzzle, having a little chat with someone there, whatever. All the best and all my love to you, you're going to be a-ok I promise. Without knowing you I still know/intuit you are more than strong enough to get through this. It can even be a good experience, just seek to have fun in each moment to the best of your ability, be social, make connections, rest and relax, you've got this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700435760.0, "datetime": "2023-11-19T23:16:00", "subreddit": "fuckeatingdisorders", "id": "k9y7qfz", "text": "Absolute bullseye, this is the jackpot epiphany I hope each and every individual pursuing recovering may also attain.\n\nAll my love to you beautiful person! I'm grabbing my imaginary pom poms to cheer you on all the way!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1705606589.0, "datetime": "2024-01-18T19:36:29", "subreddit": "AnorexiaNervosa", "id": "kih9lq3", "text": "Based", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1706749331.0, "datetime": "2024-02-01T01:02:11", "subreddit": "AnorexiaNervosa", "id": "koda0as", "text": "Yes absolutely 100%!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1709941743.0, "datetime": "2024-03-08T23:49:03", "subreddit": "EatingDisorders", "id": "ktzts5t", "text": "The realisation hit me suddenly like a truck when I was looking at the labels on different brands of baked beans to have for dinner. I was diagnosed about a year later when I became bedbound. I only saw a doctor because I was stuck between a rock and a hard place with ageusia so I had many reasons for not wanting to eat because it was not only offputting due to anorexia shit, but I saw no point in it as food was nothing more than chewable air, and something to neutralise the acidic burning pain of hunger. I didn't want to feel like death anymore. Dying a slow death due to starvation is torturous, I didn't like it, I wanted to feel better therefore I had to *get* better. Find out what was causing my ageusia, treat it, then focus on recovering. It was severe zinc deficiency (depletion) that caused it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710625634.0, "datetime": "2024-03-16T21:47:14", "subreddit": "AnorexiaNervosa", "id": "kv72f0k", "text": "I also learnt the hard way that it doesn't change jack diddly about anything other than destroy your health. When I feel the ✨dark urge✨ to lose weight, I remember this and it snaps me right out of it. All you're really losing is yourself, your life, and some buzzy atoms.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1711236223.0, "datetime": "2024-03-23T23:23:43", "subreddit": "AnorexiaNervosa", "id": "kw9l80w", "text": "Welcome home ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1713862601.0, "datetime": "2024-04-23T08:56:41", "subreddit": "AnorexiaNervosa", "id": "l0v3hkx", "text": "291,746,989\n\nNot worth it imo.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717538048.0, "datetime": "2024-06-04T21:54:08", "subreddit": "AnorexiaNervosa", "id": "l74opqn", "text": "Not at all. Anything looks to be a lot when its constituent parts are listed independently. \n\nThink about what goes into an elaborate soup, you may have a list of a dozen ingredients or more which on paper as a recipe may seem daunting like you'd need to buy out half the store just to make it, yet when you've got the actual finished product in front of you, it's like... is that it? It's *just soup*. \n\nI advise contextualising the elements in the form of a finished dish. Oatmeal fulfils these guidelines as it has starch = oats, protein and fat = milk, fruit = flavoring or side.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717552385.0, "datetime": "2024-06-05T01:53:05", "subreddit": "AnorexiaNervosa", "id": "l75oyoi", "text": "Thank you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717559140.0, "datetime": "2024-06-05T03:45:40", "subreddit": "AnorexiaNervosa", "id": "l763y3z", "text": "You're welcome! I was overwhelmed by it too in the early days of my recovery too until I had this epiphany and recontexualised it. Zooming out to see the full picture, to see a meal for what it really is - a singular thing comprised of a few elements.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720573085.0, "datetime": "2024-07-10T00:58:05", "subreddit": "AnorexiaNervosa", "id": "lcfw7dg", "text": "You gotta eat enough fat. Fat is to the brain what protein is to muscles, it's literally made of fat and requires fat to build and grow and function at all. If you don't want your brain to literally dip out of existence, you gotta smash those fats. You can't build a lego tower without lego, but this lego is rapidly biodegradable. You really gotta keep on top of replenishment, keep it structurally sound, and if you ever wanna strengthen your brain at all rather than be stuck where you are cognitively and intellectually, you gotta give it more and more so it can compose itself to a greater capacity.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720648790.0, "datetime": "2024-07-10T21:59:50", "subreddit": "AnorexiaNervosa", "id": "lcky490", "text": "Oh you're welcome! I'm so happy to have helped you to feel more at peace ❤️ much much love to you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720730352.0, "datetime": "2024-07-11T20:39:12", "subreddit": "ARFID", "id": "lcqcwrq", "text": "Same! I tried it a couple years ago and WHY DID NO ONE EVER TELL ME IT TASTES LIKE VANILLA they're amazing! They smell so bad but taste so good! I like them very ripe, almost entirely brown, because they're super sweet and creamy like custard 🤤🤤🤤", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726701636.0, "datetime": "2024-09-18T23:20:36", "subreddit": "fuckeatingdisorders", "id": "lntcam4", "text": "This is the way", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730924947.0, "datetime": "2024-11-06T20:29:07", "subreddit": "fuckeatingdisorders", "id": "lvrzd6r", "text": "Real, it doesn't do shit besides make you feel like shit. Absolutely nothing about your life will change let alone improve for depriving yourself of food, rather the opposite, your health turns to shit and you suffer, all for nothing. Nothing was ever going to come of derailing yourself, you've set a booby trap against yourself and you've walked right into it. What did you benefit of it? You're just crippled on the ground in pain and have to nurse yourself better from the injury of your own trap, against yourself. Mission accomplished? What tf was that even for? What was the purpose of setting up an elaborate sabotage plot that you'd inevitably be hurt by, and only you? Why?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731973553.0, "datetime": "2024-11-18T23:45:53", "subreddit": "fuckeatingdisorders", "id": "lxublke", "text": "Your body loves you unconditionally. It forgives you, and is excited to be able to work harmoniously with you again. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734312898.0, "datetime": "2024-12-16T01:34:58", "subreddit": "ARFID", "id": "m29grk3", "text": "SAME HERE", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734326689.0, "datetime": "2024-12-16T05:24:49", "subreddit": "fuckeatingdisorders", "id": "m2adv9k", "text": "Yes you can, unconditionally ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737147337.0, "datetime": "2025-01-17T20:55:37", "subreddit": "ARFID", "id": "m7oynnv", "text": "Exactly. If they still refuse to serve you, then leave. Don't give them your dollar if they do not want it.", "parent_id": null, "link_id": null, "context": null}
