{"type": "comment", "timestamp": 1729270344.0, "datetime": "2024-10-18T16:52:24", "subreddit": "ARFID", "id": "lsjwo3o", "text": "I have been thinking about this often especially as a child because of course my parents tried to make me eat by guilt tripping me with it.\nI think I would just end up dead.\nWhen I put food I can't eat in my mouth I vomit, people would hate me even more for \"wasting food\". So in the end I would end up malnourished even if people literally forced me to eat.\nI don't know obviously if extreme hunger would make my body stop gagging but it might not... imagine that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729521187.0, "datetime": "2024-10-21T14:33:07", "subreddit": "ARFID", "id": "lt0emnb", "text": "I have learned to recognise flavours and textures without trying foods and I do say no thanks and I try to keep as straight as possible face but guess what they still usually get offended. \"How could you know if you don't try\" over and over again. People's ego is so fragile.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730524979.0, "datetime": "2024-11-02T05:22:59", "subreddit": "ARFID", "id": "luz6z4w", "text": "When I was a child and tried to explain to my parents why I was not eating I said \"it makes me vomit\" and they, thinking I was using it as a figurative insult, said \"you don't say that, you say you don't like it\".  \nI had no idea that was their thought process, all my life I thought everyone was having the same experience as me but they had such will power that they ate it anyway and looked like nothing was happening because vomiting was a taboo you could never talk about like poop.   \nIt's only recently I found out none of that was true 🙄", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731524045.0, "datetime": "2024-11-13T18:54:05", "subreddit": "ARFID", "id": "lwyktag", "text": "Sound like this person got broken up with a picky eater and decided to blame their troubles with food instead of understanding whatever went wrong. \nI don't know that, it's just what such ferocity over something so meaningless makes me think of.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731566282.0, "datetime": "2024-11-14T06:38:02", "subreddit": "ARFID", "id": "lx1tsfg", "text": "Yeah, I had to block some subreddits because that was all they were talking about 🙄 non stop complaining about something that does not affect them in the slightest.  \nWhen I was young my parents were almost (almost) understanding but damn every freaking server at every restaurant had to pick up a fight with me, a kid, for asking for accommodations which was most of the time just no onions please (i would select the one dish that had one safe food but onions were/are in everything). Complains and even yelling sometimes over not wanting to cook meat more. Oof. Did they even get paid enough for that? Like what do you even care?  \nThis does not happen anymore and I don't know if it's because people are better or because I'm an adult and so I'm more intimidating? Or maybe they get really paid less lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731912879.0, "datetime": "2024-11-18T06:54:39", "subreddit": "ARFID", "id": "lxpzfgn", "text": "Sadly it's an integral part of ableism to act as if the illness / disability / disorder is a choice 🙄 these words all imply you or even an anorexic person is doing this on purpose. Which no one is.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732295611.0, "datetime": "2024-11-22T17:13:31", "subreddit": "ARFID", "id": "lyfy7pi", "text": "Please tell me that's chocolate milk in the fancy wine glas", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732518359.0, "datetime": "2024-11-25T07:05:59", "subreddit": "ARFID", "id": "lyvek2z", "text": "I had to block the picky eaters sub because half was just people complaining someone else is a picky eater and then not listening to anyone who wasn't bashing picky eaters.    \n         \nBefore finding out that arfid existed I felt so so much shame about it. Now that I know I tell everyone. At the first signs of aholery I repeat \"it's a DISORDER, do you think I want to struggle?\". But that is just the way that I am, I enjoy making them feel bad when they have been aholes first.   \nMy whole life I was told that I was a horrible person because my family thought I was pretending to gag to offend their food.    \nYeah I also blocked the am I the ahole sub.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732611969.0, "datetime": "2024-11-26T09:06:09", "subreddit": "ARFID", "id": "lz1s61d", "text": "People are really offended by the things that least effect them 🤦🏻‍♀️    \n    \nEdit: I had no idea kid cuisine was a brand I thought they had even named the concept trying to create some sort of slur 😭", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732748110.0, "datetime": "2024-11-27T22:55:10", "subreddit": "ARFID", "id": "lzbiubr", "text": "You are really doing a monumental job! I really appreciate this app. I sent it to my nutritionist who also has other arfid patients. I hope that's ok!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733041168.0, "datetime": "2024-12-01T08:19:28", "subreddit": "ARFID", "id": "lzued9h", "text": "Yeah but that's the thing that gets me. Even when someone mentions it the op and others still double down because they are there to be told that they are not the ahole. :( it's not ignorance anymore.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734416048.0, "datetime": "2024-12-17T06:14:08", "subreddit": "ARFID", "id": "m2ggk8o", "text": "If someone is eating oranges near me while I eat everything tastes disgusting 😭", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734521394.0, "datetime": "2024-12-18T11:29:54", "subreddit": "ARFID", "id": "m2n6hzu", "text": "Yes agrumes have such a strong smell, I can barely tollerate it in a normal setting but while eating it's absolutely torture", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737635140.0, "datetime": "2025-01-23T12:25:40", "subreddit": "ARFID", "id": "m8pnx7v", "text": "So glad to be here. I honestly don't understand how anyone who is ok with a nazi salute could even desire being here in a support group for people with an eating disorder as the nazis were pretty famously against any kind of disability or like... just not being the perfect super human...   \nWe are all out of the \"perfect human\" mold here. I beg anyone to reconsider their affiliation. Please, they dropped their mask kind of early. Please see through it, don't believe the delusions and excuses, I beg you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738822818.0, "datetime": "2025-02-06T06:20:18", "subreddit": "ARFID", "id": "mb91xjl", "text": "Yes, so angry. Because I worked on it people often don't think about me as someone with arfid and I hear stuff like \"but how can a person think that's good? How can one be eating only that?\" Dude it's not about it being good, it's about it not making me gag 😑   \nIt's not a real choice that we make.   \nWe just don't have options.   \nIt's as if everything else is rotten.   \n    \nYesterday I was watching a video about art and this woman in it started doing comparisons with fast food over and over and I couldn't even listen to her anymore even tho I was interested in the beginning. I can't even remember what the comparison was about. But obviously the fast food was negative.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739729226.0, "datetime": "2025-02-16T18:07:06", "subreddit": "ARFID", "id": "md3xkh2", "text": "I have the same issue even with the ones I have trained myself to tolerate and maybe it's due to executive dysfunction or something? But I just dread having to wash, cut and prepare food 😑 \nMy solution was frozen veggies. They also come already chopped and they last longer.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739999899.0, "datetime": "2025-02-19T21:18:19", "subreddit": "ARFID", "id": "mdorcg8", "text": "Yes, if I suddenly focus too much on the texture of food while I chew it all starts getting disgusting ):", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740298790.0, "datetime": "2025-02-23T08:19:50", "subreddit": "ARFID", "id": "meb7q2d", "text": "I'm really sorry they did this to you. People really don't understand how serious this is. 😑   \nIt's not fun to possibly have your entire day ruined if not getting a new fear for the amusement of others.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740995690.0, "datetime": "2025-03-03T09:54:50", "subreddit": "ARFID", "id": "mfra5x9", "text": "What's insulting to the poor is the attitude \"baggers can't be choosers\".    \nOn top of the fact that people who are poor and have arfid do exist, people should also have the right to not eat something just because they are starving and the fact that people think it means you are not actually hungry is really perverse.   \n    \nThis attitude is so creepy.    \n     \nIt's all just an excuse to pretend that poverty is a personal failure instead of a situation that one finds themselves in because of society.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1741168797.0, "datetime": "2025-03-05T09:59:57", "subreddit": "ARFID", "id": "mg4g0o1", "text": "Funny how they think this comment will make you eat. Do you think the starving kids will be happy to know I gorged myself to the point of feeling sick instead of just sharing with them?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1741772430.0, "datetime": "2025-03-12T09:40:30", "subreddit": "ARFID", "id": "mhcwu18", "text": "It has happened way more often (lately) that the waiter comes and I'm like \"sorry I didn't find anything that I could eat on the menu, I eat this king of thing\" and THEY were the ones who told me they had something off the menu that could be in the category of stuff I eat.    \n     \nThey did it to be kind to me and I deeply appreciate it while disassociating the entire time waiting for this mystery food that they were preparing. Not knowing what it was really messed me up because it feels even more shameful if it turned out I couldn't eat it after they had done something so nice to me.    \n    \nAnd this happened twice total vs the zero times I asked for something off the menu. I usually just accept my destiny and leave if I can, eat only bread if I can't.    \n     \nI notice that on the internet being mad at things is cyclical, there will be lots of talk about one topic until everyone gets bored and they change. sometimes it's us. Some other time the big bad is aroace people (fucken wild). Some times is vegans. Notice how it's always people who *don't* do something that to others is a \"guilty pleasure\".    \n       \nMost of the times is whatever teen girls are doing at the moment but that's just misogyny.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1741816193.0, "datetime": "2025-03-12T21:49:53", "subreddit": "ARFID", "id": "mhgkpno", "text": "Oh man, your grandma would love Sweden. Having straight up a tall glass of milk with lunch or dinner is very common. I saw some colleagues have it in the office with their lunch so I wonder if she would get less complaints there when asking at a restaurant given that it's more normal there.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1741816611.0, "datetime": "2025-03-12T21:56:51", "subreddit": "ARFID", "id": "mhgm537", "text": "Yeah, me too. I have only become overweight i the past 10 years and I'm not sure if it's because I just aged or because I have put effort into expanding my diet and so I ate way more than before.   \nBack in my teen years I had not many safe foods and they were all carb and fat heavy, I was a very normal weight for my height but still very much not skinny.   \nNow I'm 10kg more than that and honestly if it wasn't so annoying to find clothes that fit I wouldn't even mind.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1741899721.0, "datetime": "2025-03-13T21:02:01", "subreddit": "ARFID", "id": "mhmuwui", "text": "If gluten feels this hard then how about dairy?   \nIf you try taking that out how many foods would you miss?   \n   \nAnyway I don't know if you had tests done that confirm you are gluten or lactose intolerant but I was just told by my nutritionist that this thing of the \"inflammatory foods\" is a theory not a proven fact.    \nLike that thing of the solanacea vegetables giving you inflammation also a theory.   \n     \nIt's my personal belief that a majority of human adults are inevitably lactose intolerant and that we are all just in denial but hey that too is a theory.    \n    \nIdk, I feel like even doctors give us this sense of urgency for certain things but don't even take the time to explain that it was not proven yet... so if it makes you freak out too much to give up these things maybe only try it for a limited time just to see what happens.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742626198.0, "datetime": "2025-03-22T06:49:58", "subreddit": "ARFID", "id": "mj3ydue", "text": "I think it's because people really don't understand how arfid works and they are also mostly unwilling to understand.    \n    \nFor us it's not really a matter of will I like it but will it make me gag or vomit.    \n      \nAfter working of expanding my diet I finally had the feeling of \"not liking\" something and it's completely different.     \n     \nI remember as a small child my dad asked me \"why do you not want to eat it\" and I, given that I was so young said \"it makes me vomit\" and meant it literally.     \nHim being an adult thought I was using figurative language (🤦🏻‍♀️) and told me \"you can't say that, you have to say you don't like it\" and so I started saying I didn't like it because I thought everyone also felt the same as me, that they vomit when they \"don't like it\" but are so strong willed that they ate it anyway.     \nBut they don't, they never feel sick in the first place.      \n       \nI believe it all comes from the words we all use to mean something different.    \nAnd with these words non arfid people refuse to understand the difference.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742710806.0, "datetime": "2025-03-23T06:20:06", "subreddit": "ARFID", "id": "mj9s8cz", "text": "Yes that's totally my experience as well, people don't want to know and they hate to hear the word vomit so they think you are rude even tho they put you into the position of having to explain yourself by not taking your no in the first place.    \nI also had to learn to compliment the food first and then say vague things like \"it doesn't agree with me\" \"I would have bad reaction\"    \nThey can respect our \"restraint\" (some times) but not take no for an answer.   \n      \nThe only times I managed to explain this successfully was if it was in private and way before any food was even made and it took like an hour of talking and them not understanding for a while. But not being in public or already infront of the food I suppose makes them feel like they are not on the spot or something.     \n       \nIt's ridiculous that we have to dance on the egg shells of peoples egos like this, they don't like to be on the spot but it's totally fine to put us on the spot after we say no.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742857965.0, "datetime": "2025-03-24T23:12:45", "subreddit": "ARFID", "id": "mjkckdv", "text": "Oh no I hate when that happens 😭 so sorry this happened to you, I hope you can try again at some point", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743065840.0, "datetime": "2025-03-27T08:57:20", "subreddit": "ARFID", "id": "mjzcd75", "text": "I think this feeling should be in the diagnostic criteria.    \nLike \"do you call your mom if you find a new food you can eat just to tell her that it happened?\"   \nOther people don't do that", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745255449.0, "datetime": "2025-04-21T17:10:49", "subreddit": "ARFID", "id": "moa9fkm", "text": "What in the world 🤦🏻‍♀️ I'm so sorry you had to deal with this absurdity", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746358808.0, "datetime": "2025-05-04T11:40:08", "subreddit": "ARFID", "id": "mqirltg", "text": "Idk if you mean noodles as in asian noodles or pasta in general (I heard it used that way) but you got the entire italy backing you up on this one lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746436929.0, "datetime": "2025-05-05T09:22:09", "subreddit": "ARFID", "id": "mqog9y2", "text": "Yes, I hate that attitude so so much.    \nPeople really villanise anything that gives them any minor inconvenience.    \nLike they act as if we are ruining their day when this kind of thing happens when in reality nothing is happening to them and we are the ones who stay hungry.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746461077.0, "datetime": "2025-05-05T16:04:37", "subreddit": "ARFID", "id": "mqq70hl", "text": "I definitely feel this way. It would be so much better not having to worry about all this damn nutrition. I also have the same problem that chewing is just too much.    \nAs a kid I used to fantasise about elven bread because one bite could keep a grown man fed for a day what a dream", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746463123.0, "datetime": "2025-05-05T16:38:43", "subreddit": "ARFID", "id": "mqqdwgz", "text": "Legolas sold it so well", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746471973.0, "datetime": "2025-05-05T19:06:13", "subreddit": "ARFID", "id": "mqr8h4j", "text": "Oh man the exhaustion is the worst!!   \nI'm sorry that you hate yourself for this, it's not your fault you are in this situation.    \nYou deserve care and kindness even if not especially from yourself.    \nTho I'm glad you keep your health under check with tests!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747740792.0, "datetime": "2025-05-20T11:33:12", "subreddit": "ARFID", "id": "mta1l28", "text": "People tend to assume anything that they don't personally experience is a choice on the part of the other person.     \nAnd often they think of it as if there was a malicious intent behind it.     \n      \nWhen people are less belligerent I ask them if there is a food they really really dislike, why and how it makes them feel.    \nIf they describe that it makes them puke I tell them \"that's exactly how I feel but for this many foods instead of one\"     \nThey are usually horrified and kind of understand.     \n      \nMy psychologist explained that it's not uncommon to have an arfid like response to any given food but obviously it's only considered a disorder in the moment that it's on so many foods that it impacts your health.     \nAlmost everyone has that one food that triggers the gag response. That's why it's a common sentence to say \"it makes me want to vom\" even for things that mildly inconvenience us.     \n      \nTho for people like your mother-in-law this may not work because she thinks forcing someone is a good idea...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1748366325.0, "datetime": "2025-05-27T17:18:45", "subreddit": "ARFID", "id": "mujrhsn", "text": "You are so right, it's not fair at all. I do not know why or how we are like this and why we struggle with something literally needed to live but I hope you can find it in you to not completely give up eating.   \nTake a break, eat your safe foods and if you can just rely on vitamins supplements for a bit until you feel ready again. You already did great by trying it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1748539627.0, "datetime": "2025-05-29T17:27:07", "subreddit": "ARFID", "id": "mux34hi", "text": "I'm not sure if I qualify as obese, all I know is I am 13 kilograms heavier than that number of hight to weight ratio that is obviously generic and its not like a set in stone rule.   \nI used to be thinner before but not only I have hypothyroidism now which makes it easy to gain weight but I'm also 40 and not 18 anymore so I feel like it's just... normal that I'm heavier. I do struggle with body image but I'm just trying really hard to not think about it too much and accept that this is what my body looks like now.    \nI think it's fairly common to be overweight with arfid as much as it is being underweight.   \nI think one thing we have all in common is that it's just really hard to change out weight because we have a hard time changing our eating habits.    \nIt's all about the kinds of food we are stuck with. When they are more high kalory it's easy to be overweight.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1748546848.0, "datetime": "2025-05-29T19:27:28", "subreddit": "ARFID", "id": "muxsonn", "text": "For me the worse consequences was becoming afraid to make any choice. Not just food related.    \nBecause my body only wants to eat \"bad foods\" I started believing I was unable to make good choices in any context.   \n    \nAs a kid I started believing I was evil because \"good children eat vegetables\" and I was unable to (back then I didn't know what arfid was and thought I was the only person like this)    \nBecause I also had undiagnosed adhd my family told me I did not care about them because I kept forgetting things and it all cemented into my head that I was just genetically evil or something.   \nI think the worst of all was the mental health stuff that came along due to no one understanding what was going on with me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1748594536.0, "datetime": "2025-05-30T08:42:16", "subreddit": "ARFID", "id": "mv19ipr", "text": "Thank you, I'm working on it, trying to see them as neutral and just trying to be ok with just things going wrong some times 🥲   \nI hope you too can feel whole and not broken anymore", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749046109.0, "datetime": "2025-06-04T14:08:29", "subreddit": "ARFID", "id": "mvyd07p", "text": "Not the precious, precious prayers!! All wasted 🤦🏻‍♀️ nooo what will god say?! Look, they are on the floor and god does not believe in the 5 second rule!!    \n     \nBut jokes aside I feel like we do have something in common with addicts and it's the fact that people believe isolating us and treating us worse will cure us...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1753124223.0, "datetime": "2025-07-21T18:57:03", "subreddit": "ARFID", "id": "n4e2r0e", "text": "As usual they are just trying to implying that ours is a choice.    \nIt's the classic \"if you were actually starving you would eat anything\" or when they try to prove someone is not actually poor because they don't accept a specific food or other kind of \"aid\" 🤦🏻‍♀️      \n          \nBack in the day they used to say this about allergies. As if a poor person should get sick or hurt themselves because otherwise it's not real poverty if you don't accept to eat dirt or something, if you don't accept all kinds of humiliation it means you are not actually in need.    \n    \nIt's like ableism and classism had a baby.", "parent_id": null, "link_id": null, "context": null}
