{"type": "comment", "timestamp": 1713563820.0, "datetime": "2024-04-19T21:57:00", "subreddit": "EatingDisorders", "id": "l0d1gep", "text": "I 1000% agree with this philosophy! My anorexia will always be a part of my story, but I someday will no longer need it anymore.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1714258636.0, "datetime": "2024-04-27T22:57:16", "subreddit": "EatingDisorders", "id": "l1kds3w", "text": "That is so darling that your baby thought of you. Sending hugs!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1714325723.0, "datetime": "2024-04-28T17:35:23", "subreddit": "EatingDisorders", "id": "l1o2es5", "text": "I developed anorexia at 13. I started purging at 15, without any binging behavior. I sort of recovered at 16, during the pandemic, and relapsed into anorexia in 2021 at 18. Now, I just turned 21 and I have ARFID related to the GI issues related to my anorexia. I’ve grown up with an eating disorder and I’ve been flipping between bouts of all out disorder and glimpses of recovery for so long. I hope someday I’ll be able to look back and say I made it, I recovered, but I know that’s not super realistic.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1720508636.0, "datetime": "2024-07-09T07:03:56", "subreddit": "AnorexiaNervosa", "id": "1dyw258", "text": "This makes me so mad and so sad. I’ve lost so much of my life to Anorexia, and now I have to worry about losing my brain?!?!?! It’s just not fair. I’m really feeling the complications lately. Though, im still at the point where my brain works better when I’m not eating but it’s scary to think about the possible damage. \n\nThis is not meant to scare or shame anyone, I just wish I knew this went I still had the agency to fix it. My avocation is very cerebral so this really hits home. Anyway, hope this is food for thought for someone else too!", "title": "Anorexia causes grey matter loss in the brain", "context": null}
{"type": "comment", "timestamp": 1720540791.0, "datetime": "2024-07-09T15:59:51", "subreddit": "AnorexiaNervosa", "id": "lcd9kr3", "text": "I’m a newly diagnosed SEED patient. It’s good to know some restoration is possible, though it’s still scary to think about. \nThank you kindly for sharing!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720557600.0, "datetime": "2024-07-09T20:40:00", "subreddit": "AnorexiaNervosa", "id": "lceq4r3", "text": "This particular study is of uw participants. But eating disorder complications do not discriminate based on weight. Restriction is restriction, no matter how you slice it. I highly recommend [this article](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6590352/). I’ve been underweight, overweight, and everything in between, but it seems to most correlate with the length of illness!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720576980.0, "datetime": "2024-07-10T02:03:00", "subreddit": "AnorexiaNervosa", "id": "lcg6aip", "text": "That sounds so hard! Hoping that pushed you towards recovery, if that’s something you want ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1736819012.0, "datetime": "2025-01-14T01:43:32", "subreddit": "AnorexiaNervosa", "id": "1i0utta", "text": "It was honestly so hard and overwhelming. But I did it! Now I just have to actually eat the food. ", "title": "I went grocery shopping for the first time post residential treatment!", "context": null}
{"type": "comment", "timestamp": 1736834461.0, "datetime": "2025-01-14T06:01:01", "subreddit": "AnorexiaNervosa", "id": "m722obc", "text": "Hi! I love grocery shopping when the food isn’t for me. It just feels so strange and overwhelming when the food is for me because I actually have to (or should) eat the food. \n\nThere’s just so much to look at, the cost, the cals, the macros, the micros, the ingredients, and hell… whether I actually like the food. Being in treatment gave me a break from that, but being away from it made it harder.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736834505.0, "datetime": "2025-01-14T06:01:45", "subreddit": "AnorexiaNervosa", "id": "m722ran", "text": "They are protein shakes! They are awesome and there’s a chai one too :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736908192.0, "datetime": "2025-01-15T02:29:52", "subreddit": "AnorexiaNervosa", "id": "m77i5b4", "text": "I’m not :) meat just isn’t a big part of my diet.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739035541.0, "datetime": "2025-02-08T17:25:41", "subreddit": "AnorexiaNervosa", "id": "mbotufk", "text": "This is a disgusting comparison. For all people, and I mean all, fed is best. What if that’s the only food he has eaten all day? What if that is the only food he can afford? What if it’s a healthier choice than something worse? \n\nI have had AN and been underweight, normal weight, and overweight. My body needed the food regardless. \n\nI get it. I think about what other people are eating too, but it’s not my place to make assumptions like that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739035746.0, "datetime": "2025-02-08T17:29:06", "subreddit": "AnorexiaNervosa", "id": "mboujp6", "text": "Nope. That’s not how it works for everyone. People can be anorexic at any weight, and still not lose weight. There’s a lot of doctors and clinicians that would disagree with you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742689685.0, "datetime": "2025-03-23T00:28:05", "subreddit": "AnorexiaNervosa", "id": "mj8gekp", "text": "This seriously hits. What is even the point if you don’t feel like you care anymore?!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742746293.0, "datetime": "2025-03-23T16:11:33", "subreddit": "AnorexiaNervosa", "id": "mjbv5y5", "text": "Tbt I just scroll here now. It can be triggering sometimes, but it’s so much less toxic!!", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1742794968.0, "datetime": "2025-03-24T05:42:48", "subreddit": "AnorexiaNervosa", "id": "1jijrn3", "text": "People with high functioning anorexia are high achievers— active members of their community, with careers, families, and relationships— even though they actively engage in their eating disorder.\n\nI definitely resonate with this, and wanted to discuss this with y’all. A lot of people I’ve met in treatment talk about the opposite experience, falling apart and being completely non functional. But, I still feel like I’m doing so well. \n\nI know part of it is that I’ve learned to live with the negatives (ie health complications), but I still live a full life with Anorexia. \n\nSo… what do you think of this label? Do you fit into this category? Do you think it is a harmful idea? ", "title": "Do you consider yourself to have high functioning anorexia?", "context": null}
{"type": "comment", "timestamp": 1742824753.0, "datetime": "2025-03-24T13:59:13", "subreddit": "AnorexiaNervosa", "id": "mjh8uqg", "text": "Definitely. It’s so confusing!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742855780.0, "datetime": "2025-03-24T22:36:20", "subreddit": "AnorexiaNervosa", "id": "mjk5lo3", "text": "I know this. I’ve been on the brink of dying a few times. But, I just feel like I forget, which is the nature of the disorder. I don’t know how I’ve stayed alive for 8 years of this though.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744580815.0, "datetime": "2025-04-13T21:46:55", "subreddit": "AnorexiaNervosa", "id": "mmyq47u", "text": "And nope. You have no idea what other people eat. Fat people can and do have atypical anorexia, bulimia, OSFED, etc. \n\nPerceived restriction does not equal willpower.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744589158.0, "datetime": "2025-04-14T00:05:58", "subreddit": "AnorexiaNervosa", "id": "mmzdgcp", "text": "This is an incredibly nuanced issue that cannot be broken down to “fat people only eat junk food, are lazy, and undisciplined”. \n\nFat people are above all things, human. They are unique and special and just as valuable as thin people. There are many systemic factors that lead to being overweight or obese— poverty, food deserts, and an increase in other health conditions. \n\nI highly recommend looking into to fat ED activists like Sharon Maxwell to work on humanizing people who are different from you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744589291.0, "datetime": "2025-04-14T00:08:11", "subreddit": "AnorexiaNervosa", "id": "mmzdsxs", "text": "Very well said!!", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1744922113.0, "datetime": "2025-04-17T20:35:13", "subreddit": "AnorexiaNervosa", "id": "1k1n0jh", "text": "", "title": "So… the cure is an ED?!", "context": null}
{"type": "comment", "timestamp": 1744930710.0, "datetime": "2025-04-17T22:58:30", "subreddit": "AnorexiaNervosa", "id": "mno3uzt", "text": "Hot take, but only 6-8% of people with EDs are underweight, and a portion of the 92% are overweight or obese. \nThis advice (particularly the fasting, exercise, and clean eating portion) could be harmful to many groups of people.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744944294.0, "datetime": "2025-04-18T02:44:54", "subreddit": "AnorexiaNervosa", "id": "mnp4qk5", "text": "I hear you. But there is a lot of overlap between these 2 categories, and assuming that just because people fall into one category doesn’t mean they fall into another is not going to help. \n\nOverweight people often participate in health promoting habits too, not just those in thin bodies. Also, obesity does not unequivocally equal negative health outcomes. I highly recommend the work of Sharon Maxwell and Bri Campos on this.\n\nI say this all as a person with AN, who has published research on EDs. So yes, I hear what you are saying. But this infographic ain’t it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745016016.0, "datetime": "2025-04-18T22:40:16", "subreddit": "AnorexiaNervosa", "id": "mnu5gq5", "text": "Thats a lot of questions and assumptions. Research is a part of my job as a grad student focusing on the intersection between k-12 schooling and eating disorders. There is so much nuance to this topic and I highly recommend looking at more diverse research material outside of your already held beliefs. \n\nI am not saying I have all the answers, but any kind of cherry picked data doesn’t help.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745689336.0, "datetime": "2025-04-26T17:42:16", "subreddit": "EatingDisorders", "id": "mp6h9z3", "text": "If it’s not the right fit, then it’s not the right fit. Do not let her free fall into outpatient care though, line up a new program for a transfer.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745723610.0, "datetime": "2025-04-27T03:13:30", "subreddit": "EatingDisorders", "id": "mp97nhb", "text": "It’s expensive, but probably one of the best books I’ve read on EDs!!", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1746243669.0, "datetime": "2025-05-03T03:41:09", "subreddit": "AnorexiaNervosa", "id": "1kdjrhj", "text": "I’m not talking “people with AN still eat” or “harm reduction is complicated”, I mean your unhinged takes lol", "title": "What’s your eating disorder hot take?", "context": null}
{"type": "comment", "timestamp": 1746248785.0, "datetime": "2025-05-03T05:06:25", "subreddit": "AnorexiaNervosa", "id": "mqbp6u6", "text": "This isn’t unhinged, it’s just icky. You can suffer with an ED at any weight, and advocating for someone to have this cruel disorder is not okay, even if you aren’t serious :/", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746248916.0, "datetime": "2025-05-03T05:08:36", "subreddit": "AnorexiaNervosa", "id": "mqbpfp7", "text": "Yes yes yes", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746281930.0, "datetime": "2025-05-03T14:18:50", "subreddit": "AnorexiaNervosa", "id": "mqdhucm", "text": "The current research does not agree with you on this one— the HAES book and Sick Enough address this in a really understandable way. Highly recommended looking into them!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746283376.0, "datetime": "2025-05-03T14:42:56", "subreddit": "AnorexiaNervosa", "id": "mqdmamp", "text": "If everyone ate exactly the same thing, and even exercised the same, their bodies wouldn’t look the same. There are so many factors at play. \n\nI say this all as someone who 100% believed what you are saying a while back, so I get where you are coming from :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746318630.0, "datetime": "2025-05-04T00:30:30", "subreddit": "AnorexiaNervosa", "id": "mqgkhks", "text": "FBT has the potential to destroy the relationship you have with your family. CBT, DBT, and ACT definitely have their pros for recovery in that regard.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746318890.0, "datetime": "2025-05-04T00:34:50", "subreddit": "AnorexiaNervosa", "id": "mqgl5c2", "text": "I’m unfortunately finding this to be true for myself. I’ve done treatment so many times, and I’ve got a SEED label, so it’s caused my goal to shift from full recovery to harm reduction. \n\nI now get the whole treatment burn out thing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746318954.0, "datetime": "2025-05-04T00:35:54", "subreddit": "AnorexiaNervosa", "id": "mqglbgq", "text": "I feel like I need you to elaborate this one…", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746330525.0, "datetime": "2025-05-04T03:48:45", "subreddit": "AnorexiaNervosa", "id": "mqhdo5i", "text": "My purpose of when I cook for myself is to cook food with the lowest number of cals. My purpose of when I cook for other people is to make food that actually tastes good.\n\nI think it’s all about intent ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746330917.0, "datetime": "2025-05-04T03:55:17", "subreddit": "AnorexiaNervosa", "id": "mqhej5f", "text": "But what is healthy in that context? \n\nMental health, physical health, and social health all matter\n\nOr do you just mean you meet the white, thin, female ideal of health?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746375330.0, "datetime": "2025-05-04T16:15:30", "subreddit": "AnorexiaNervosa", "id": "mqk20ce", "text": "I don’t know about this one… is it possible to fully recover? Would it be okay for a recovered alcoholic to have a drink? \n\nI feel like most clinicians and recovered people would disagree with this one. On the other hand, I would love to go on a diet again, but I’m not recovered lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746411118.0, "datetime": "2025-05-05T02:11:58", "subreddit": "AnorexiaNervosa", "id": "mqn30kl", "text": "Yes!!\nBeing a teen with an ED is so different from being an adult with an ED. It definitely was a hit to my identity. I went from a helpless child with AN to an adult blamed for not recovering.\n\nI do have to say, my res experiences as an adult were for less damaging than my ones as a kid. I loved having a little more autonomy!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746573708.0, "datetime": "2025-05-06T23:21:48", "subreddit": "AnorexiaNervosa", "id": "mqz38dy", "text": "Ain’t that the truth!!", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1747599906.0, "datetime": "2025-05-18T20:25:06", "subreddit": "AnorexiaNervosa", "id": "1kptj3x", "text": "", "title": "Atypical 👏 Anorexia 👏 Is👏 Real 👏 Anorexia 👏", "context": null}
{"type": "comment", "timestamp": 1747605998.0, "datetime": "2025-05-18T22:06:38", "subreddit": "AnorexiaNervosa", "id": "mt0xhzx", "text": "I wish I didn’t have an ED at all too. \n\nBUT I have experienced both Atypical AN and AN during different points of my life, and the care I received and the stigma I experienced was markedly different depending on my diagnosis.\n\nAtypical AN is treated at a lower rate, and is often seen as less serious, despite being virtually the same set of symptoms.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747620149.0, "datetime": "2025-05-19T02:02:29", "subreddit": "AnorexiaNervosa", "id": "mt1zymm", "text": "Sign me up lol… maybe in 5 DSMs or so that will happen haha", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1749011537.0, "datetime": "2025-06-04T04:32:17", "subreddit": "AnorexiaNervosa", "id": "1l2wnqv", "text": "I was cleaning out a classroom and found these two books. I’m sure some of these are still used today too. Scary stuff! ", "title": "90s kids books", "context": null}
{"type": "comment", "timestamp": 1749045800.0, "datetime": "2025-06-04T14:03:20", "subreddit": "AnorexiaNervosa", "id": "mvybzra", "text": "Children should not be exposed to the idea of dieting, weighing yourself, placing value on that weight, or good and bad foods— which are all in this book.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749091662.0, "datetime": "2025-06-05T02:47:42", "subreddit": "AnorexiaNervosa", "id": "mw2ieq9", "text": "This might be a hot take, but as someone who has published research on nutrition education, I don’t think this should be taught in k-12. No child needs to know how to track their weight, count cals, or moralize food. \n\nI do think preventative anti ED lessons need to be taught— IE all foods fit, ads don’t take away, HAES, and the importance of all macro and micro nutrients. \n\nYou would be shocked how many kids are being taught to restrict in a disordered way, as early as elementary school.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749189221.0, "datetime": "2025-06-06T05:53:41", "subreddit": "AnorexiaNervosa", "id": "mw9r7rv", "text": "To start, I strongly believe in theory that suggests an ED continuum, with a spectrum that ranges from severe restriction to severe binging (obesity), and I think all EDs need to be treated similarly— restoring balanced nourishment and joyful movement. Restriction does not fix anything, in children or adults. Nor does shame, judgment, or weighing kids.\n\nI do think the lessons I mentioned before a good place to start (add don’t take away, all foods fit, and the importance of micros and macros), and these lessons are inexplicably important no matter\na child’s shape or weight. If you are interested, some of my research on this topic is called “Implications of California State Standards in Relation to Disordered Eating for School Aged Children” if you would like to hear more.", "parent_id": null, "link_id": null, "context": null}
