{"type": "comment", "timestamp": 1596024742.0, "datetime": "2020-07-29T12:12:22", "subreddit": "fuckeatingdisorders", "id": "fzm3z9d", "text": "You are so worthy of recovery.  This is a sign that you should go and take full advantage of the help.  I'm happy for you.  You got this!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607302317.0, "datetime": "2020-12-07T00:51:57", "subreddit": "EatingDisorders", "id": "gew7mg0", "text": "Oh I can relate to much of this.  Sending you love and support.  What a tough road it is.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613048567.0, "datetime": "2021-02-11T13:02:47", "subreddit": "EatingDisorders", "id": "gmxlwla", "text": "Perhaps getting a small \"dorm sized\" fridge for your safe foods could be an option?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616026366.0, "datetime": "2021-03-18T00:12:46", "subreddit": "AnorexiaNervosa", "id": "grar3c2", "text": "Recover and then you will feel so empowered", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620479621.0, "datetime": "2021-05-08T13:13:41", "subreddit": "bulimia", "id": "gxduelp", "text": "I'm 53 and I can say honestly that it's only in the past 2 years I've finally feel almost recovered from my ED.  There was so much grief from childhood  and adult trauma(s)  I hadn't processed despite years in therapy.  I kept getting injured (thanks to overexercising) and the self hatred was at an all time high.  A bad sports injury forced me to rest (along with COVID lockdown) and that's when the shit got real.  I couldn't run or starve or purge the pain away.  I finally broke and that's when the healing began.  So I truly believe it's never too late to heal.  Life on the other side of bulimia may be so amazing for you, but you'll never know if you aren't here anymore.   The depression started to lift with the right medication and with proper fueling of my body. You are so worth a happy life free of bingeing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620777353.0, "datetime": "2021-05-11T23:55:53", "subreddit": "bulimia", "id": "gxslifo", "text": "Please get some help.  Your ED isn't your friend and it is slowly going to drag your health way down.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621429603.0, "datetime": "2021-05-19T13:06:43", "subreddit": "EatingDisorders", "id": "gyox8rn", "text": "I can relate albeit my ED past is dealing with anorexia, and exercise bulimia.  I am also 53.  I started down the road at 14, lost a ton of weight after sexual abuse by a neighbor, got some therapy (not good stuff though as this was back in the early 80's ), and put enough back on to look \"healthy\" and then when stresses would hit my life (abusive ex husband, death of a parent, etc) , I'd lose weight again and start the shame and self hatred spiral.  I don't think I ever really uncovered the pain, grief and trauma that led to my ED in the first place, UNTIL the pandemic. The gym shut down, I got injured, I gained a few pounds, I got a bone density scan (osteoporosis) and had to sit in the rubble of the pain destruction I'd never deal with.    The self loathing and hatred I still felt towards this body of mine was still there.  Just buried away.  Now I'm really trying to work through it, I'm 53 and this (as you know) has occupied my way of thinking for so long that it's become part of the lens that I view the world through.   Loving ourselves is so damn hard, no matter the size.  I just wanted you to know that you are not alone.  I'm not overweight but I still hate myself.  Working on it though and each time I cry I think \"well another layer of this grief is releasing\" and it seems like that is a good thing.  I'm sending you support on your journey.  I bet you're beautiful.  :-)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621466588.0, "datetime": "2021-05-19T23:23:08", "subreddit": "EatingDisorders", "id": "gyrbn8x", "text": "If I could go back and have a chat with my 14 year old self, I would give her a huge hug, tell her she was perfect just as she was and that one day she'd learn to love herself.  I'd also tell her to get some help sooner rather than later so she wouldn't be still dealing with an ED and the resulting health issues.  Of course my 14 year old self may have not listened to my 53 year old self.  But I do wish I had received help when I was a lot younger.  But there wasn't as much information and help available way back then.   Take care of yourself.  Be brave.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621468298.0, "datetime": "2021-05-19T23:51:38", "subreddit": "EatingDisorders", "id": "gyrezdr", "text": ":-).  You have a great life ahead of you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621513765.0, "datetime": "2021-05-20T12:29:25", "subreddit": "EatingDisorders", "id": "gytcbb6", "text": "Believe me you are awesome as well and wiser than you probably realize.  DM me anytime.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621686096.0, "datetime": "2021-05-22T12:21:36", "subreddit": "AnorexiaNervosa", "id": "gz1rms8", "text": "Way to go!  So proud of you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1622640632.0, "datetime": "2021-06-02T13:30:32", "subreddit": "bulimia", "id": "h0b7uov", "text": "I'm sure you aren't the only one.  I'm 53 and still struggling with ED thoughts and behaviors. Hang in there.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1622725548.0, "datetime": "2021-06-03T13:05:48", "subreddit": "EatingDisorders", "id": "h0fnth7", "text": "It sounds like orthorexia", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623245669.0, "datetime": "2021-06-09T13:34:29", "subreddit": "bulimia", "id": "h15g11b", "text": "She sounds ill informed, uneducated about ED, and toxic.  Also this seems to me to be about HER issues not compassion for yours.    \n\n\nI'm sorry. Please reach out for help and resources.  You are not alone and I think you are brave for saying something.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624625098.0, "datetime": "2021-06-25T12:44:58", "subreddit": "fuckeatingdisorders", "id": "h2zmpzo", "text": "You got this. Remember your ED wants you to be scared and relapse.  Not your wiser self,  You deserve recovery and an amazing life.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625947026.0, "datetime": "2021-07-10T19:57:06", "subreddit": "bulimia", "id": "h4qgjoo", "text": "Have you managed to still have SOME bm's?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625947078.0, "datetime": "2021-07-10T19:57:58", "subreddit": "bulimia", "id": "h4qgn13", "text": "I just quit cold turkey after using them off and on for many years.  I know it will be hard and I'm not sure if I did permanent damage but I'm just going to allow my body to heal.  And there will be bloating and yucky feelings for maybe a very long time.  This is the final hurdle for me in truly being recovered.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626005629.0, "datetime": "2021-07-11T12:13:49", "subreddit": "bulimia", "id": "h4sutvh", "text": "The truth is I married a very abusive man who loved anal sex and insisted I be \"cleaned out\" before the act.  So I got on them again, teas and enemas.  I'm well rid of him now (THANK GOD) but still rely on laxatives to help me poop.  Thing is they stop working after awhile.  I'm on day 3 of nothing and I'm bloated and swollen and gassy but I'm determimed to kick this habit once and for all.  I'm weight restored and otherwise very happy in my life and this is my final hurdle.  I have faith in my body and I'm determined to work through the discomfort.  I do have a colo-rectal Dr. appt coming up but in 6 weeks time. My current thought is this; if after 7 days no BM I'll do one enema.  Then go another 7 days, etc.   My family and bf and close friends know and are so supportive. But it's a leap of faith TBH.   My dirty little secret is no secret anymore.  We all deserve a good and happy life.  I've put my body through so much already.  I owe it this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626005958.0, "datetime": "2021-07-11T12:19:18", "subreddit": "bulimia", "id": "h4sv91t", "text": "Oh and a friend who works in a nursing home recommended a product made of prunes, raisins, etc to take every day. She said it's one amazing things for older people that have extreme constipation and have used laxatives.  Worth a try as it's all natural.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626440657.0, "datetime": "2021-07-16T13:04:17", "subreddit": "bulimia", "id": "h5e5ihl", "text": "Good news!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626782922.0, "datetime": "2021-07-20T12:08:42", "subreddit": "EatingDisorders", "id": "h5v6svv", "text": "I'm so sorry about your leg.  Perhaps you can shift the way you view food.   The body needs and burns quite a bit of calories in healing.  The healthy food you give it is the medicine (in food) that you need to heal that leg.  Try focusing on it with that approach.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1627086030.0, "datetime": "2021-07-24T00:20:30", "subreddit": "bulimia", "id": "h6b8zsf", "text": "It absolutely IS something.  Good job.  Celebrate everything.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628164705.0, "datetime": "2021-08-05T11:58:25", "subreddit": "bulimia", "id": "h7sn16f", "text": "Relapse is unfortunately common so please don't be disappointed in yourself.  You just need to get some more help under your belt.  Recovery like most difficult things isn't a one and done. YOU are worth it.  It's hard for parents and other loved ones to really understand the struggles of eating disorders.  They honestly can't.  You are a human being, there is no \"normal\".  So many are struggling with disorders of one sort or another.  So try not to label yourself.  A great life awaits you.  I promise.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628164954.0, "datetime": "2021-08-05T12:02:34", "subreddit": "fuckeatingdisorders", "id": "h7snfuc", "text": "Correct.  I never got much positive feedback when I told people I'd been abusing laxatives.  \"Eww gross\" was the general response.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628253488.0, "datetime": "2021-08-06T12:38:08", "subreddit": "EatingDisorders", "id": "h7xfeoe", "text": "If even one person can gain something from your post, you will have done a great service.  I have lived a parallel experience to you.  I suffered for over 30 years and was in quasi recovery for a long time.  Finally pushed through the final barriers.  It was difficult to say the least. Your post is so encouraging which is what we all need (needed) to face the difficulties of recovery.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628254495.0, "datetime": "2021-08-06T12:54:55", "subreddit": "AnorexiaNervosa", "id": "h7xh9r5", "text": "I care.  Every life is precious and everyone is worthy of recovery.  You can't let others define your worth in this world.  Dig deep down inside yourself, write down things you like about yourself. There is something you can think of I know it.  Reach out to those that have an understanding of what you are going through.  Even if it's people you don't know like on this thread.  The point of living is defined by you, not anything outside of your life,  You have gifts to give.  There is no one ever in the history of humans that will be YOU.  Think about that.  Your uniqueness is needed here.  Truly. You matter a ton.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628370110.0, "datetime": "2021-08-07T21:01:50", "subreddit": "AnorexiaNervosa", "id": "h83ialh", "text": "Recovery will be possibly the hardest thing you ever do in your life, but it will be your super power to draw on when life throws you curveballs in the future.  Recovery takes guts and grit and determination but if I can do it, so can you.  Just know that you will be uncomfortable at times, but that's completely normal.  The ED voice is hard to silence but it truly doesn't have your best interest at heart.  Go for it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628423708.0, "datetime": "2021-08-08T11:55:08", "subreddit": "bulimia", "id": "h85sj9b", "text": "Excellent.  May this give you confidence going forward!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628681048.0, "datetime": "2021-08-11T11:24:08", "subreddit": "fuckeatingdisorders", "id": "h8iswgp", "text": "I avoid anything that can switch my mood so quickly. Ditched the scales and have no desire to weigh myself obsessively again.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1629286184.0, "datetime": "2021-08-18T11:29:44", "subreddit": "bulimia", "id": "h9ec02t", "text": "I heard a woman once on a podcast saying she finally realized how f'd up she was in her ED thinking when she liked the way she looked while undergiong chemotherapy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630495329.0, "datetime": "2021-09-01T11:22:09", "subreddit": "fuckeatingdisorders", "id": "hb6a4lr", "text": "Good for you!  Remember the scone isn't bad or good and neither are you for eating it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630538727.0, "datetime": "2021-09-01T23:25:27", "subreddit": "fuckeatingdisorders", "id": "hb8zswu", "text": "Well done.  You should be very proud of yourself.  Write this \"win\" down in a journal or something so you can remember that You Can Do This!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630583962.0, "datetime": "2021-09-02T11:59:22", "subreddit": "fuckeatingdisorders", "id": "hbb07c8", "text": "It's natural to be anxious.  But we realize that we can be afraid and still enjoy the food and then understand that we are still alive and standing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630595419.0, "datetime": "2021-09-02T15:10:19", "subreddit": "fuckeatingdisorders", "id": "hbbowsi", "text": "I totally get where you’re coming from. I’m 54 and my eating disorder started at 14 and I had it for roughly 35 years. Now I’m recovered, something I thought I could never do. I know it’s a complex issue. Eating disorders are never about one thing and they’re really not about food. But recovery is possible. Even if only one percent of you wants to recover.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630613734.0, "datetime": "2021-09-02T20:15:34", "subreddit": "fuckeatingdisorders", "id": "hbcysbd", "text": "That's the attitude.  Our ED's are usually in response to pain from trauma.  Hang in there and remember no one really WANTS to recover.  You can though.  There is help out there so please reach out and remember reaching out doesn't mean you have to do anything about your ED.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630627352.0, "datetime": "2021-09-03T00:02:32", "subreddit": "bulimia", "id": "hbdsyn0", "text": "Awesome.  The urges DO pass.  But it's hard to resist them. You should be so proud of yourself.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630761101.0, "datetime": "2021-09-04T13:11:41", "subreddit": "bulimia", "id": "hbkchc8", "text": "One of the things I did in recovery was journal.  About everything. How i felt before a binge and after etc.  It didn't stop the behavior but it did help me identify the feelings that may have triggered the episodes.\n\nMy therapist had me do an exercise called  \"The worst day with my ED\".  I wrote about a day that I felt was one of my worst.  For some reason it helped to write it down and then share it with my therapist.   I felt such shame but as I read it aloud I also felt this overwhelming compassion towards myself.  If a friend or someone had shared this kind of entry with me I would have felt that compassion to them so why not also apply it to myself.  \n\nHang in there.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1631274308.0, "datetime": "2021-09-10T11:45:08", "subreddit": "AnorexiaNervosa", "id": "hcatvgp", "text": "What is SICK ENOUGH?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1631274888.0, "datetime": "2021-09-10T11:54:48", "subreddit": "AnorexiaNervosa", "id": "hcauu0i", "text": "You don't have to hit rock bottom to get well.  Even if you are dubious about the idea of recovery.  The problem with anorexia is it can be fatal.  You are needed in this world.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1631795780.0, "datetime": "2021-09-16T12:36:20", "subreddit": "bulimia", "id": "hd2kwf8", "text": "This is a big success!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1632313747.0, "datetime": "2021-09-22T12:29:07", "subreddit": "EatingDisorders", "id": "hdu4fcv", "text": "I got rid of my scale years ago and whenever I go to my doctor I request to NOT be weighed. They know I have a history of an ED so it's never been a problem.  Even if they didn't you still can request not to be weighed.  If they have to weigh me (this never has happened) I turn the other way.  Getting rid of the scale for me was hard but one of the best things I did.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1632442523.0, "datetime": "2021-09-24T00:15:23", "subreddit": "AnorexiaNervosa", "id": "he13zri", "text": "This is huge! Way to go.  :-) You are making the right steps and you will get better.  Just keep plugging away at recovery and make sure to get all the support and care you can. You deserve it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1633567528.0, "datetime": "2021-10-07T00:45:28", "subreddit": "bulimia", "id": "hfo8lva", "text": "Good for you!  Absolutely true.  You can do it which means it's possible for others to as well.  You are an example to those people!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1633567912.0, "datetime": "2021-10-07T00:51:52", "subreddit": "bulimia", "id": "hfo9f6y", "text": "If you keep trying to recover you will eventually recover. I truly believe this,", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1633909789.0, "datetime": "2021-10-10T23:49:49", "subreddit": "bulimia", "id": "hg615lp", "text": "Awesome!  Way.To.Go!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1634736333.0, "datetime": "2021-10-20T13:25:33", "subreddit": "EatingDisorders", "id": "hhcxanq", "text": "You can't recover from an ED without addressing your relationship to food.  That's the difficult truth. But you CAN recover. And it's worth it and most people are terrified of giving it up and are ambivalent to getting help. What you are feeling is normal.  I hope you can find the help you need and deserve.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1635161778.0, "datetime": "2021-10-25T11:36:18", "subreddit": "bulimia", "id": "hhz2syr", "text": "Yay!  A win is a win.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636029408.0, "datetime": "2021-11-04T12:36:48", "subreddit": "AnorexiaNervosa", "id": "hj9w69w", "text": "Oh I am so sorry. Anorexia can be a deadly disease, it isn't some diet gone wrong like many think.  I'm sending you heaps of love and support.  I really suggest that you find some support for yourself.  And I will keep you and your mom in my thoughts.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1682683549.0, "datetime": "2023-04-28T12:05:49", "subreddit": "fuckeatingdisorders", "id": "ji1kzme", "text": "After I recovered I realized that our bodies truly are the least interesting thing about us.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1682767097.0, "datetime": "2023-04-29T11:18:17", "subreddit": "EatingDisorders", "id": "ji66dkg", "text": "Please get any and all books by Carolyn Costin on this subject.  I'd start with \"Your Dieting Daughter\". then \"The 8 keys to recovery from and Eating Disorder\" book. She has a workbook that goes along with it.  I would try to get your daughter into some sort of counseling as well. The sooner you can nip this in the bud the better.  It's not uncommon for young girls to start dieting earlier and earlier.  Also I'd look at your own eating habits and thoughts about your own body. It's amazing what kids pick up on.  Feel free to send me a message if you'd like.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683369560.0, "datetime": "2023-05-06T10:39:20", "subreddit": "EatingDisorders", "id": "jj2o08d", "text": "I think the most important thing we can do is to take our own ED's seriously.  If we wait to get \"too thin\" or for others to notice we are suffering then we deny ourselves good health NOW.  Recovery once and for all has to be done for US whatever others think is irrelevant.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684580904.0, "datetime": "2023-05-20T11:08:24", "subreddit": "EatingDisorders", "id": "jkw1s9j", "text": "Arm yourself with some information.  \"Your Dieting Daughter\" is a book I highly recommend.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684608017.0, "datetime": "2023-05-20T18:40:17", "subreddit": "EatingDisorders", "id": "jkxnyj6", "text": "I have some other ideas too if you want to direct message me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684926649.0, "datetime": "2023-05-24T11:10:49", "subreddit": "EatingDisorders", "id": "jletf1p", "text": "The world and children would be much better off if more mothers (parents) cared about your child the way you do.  Take care, get some help for yourself too and by all means keep reaching out for support.  We are here for you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1699186639.0, "datetime": "2023-11-05T12:17:19", "subreddit": "AnorexiaNervosa", "id": "k7x1abm", "text": "When my hair started falling out I was sort of happy b/c I thought I'd then weigh less.  \n\nJust typing this now makes my want to cry.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1699186786.0, "datetime": "2023-11-05T12:19:46", "subreddit": "AnorexiaNervosa", "id": "k7x1jc7", "text": "I did too.  Ugh.  :-(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1699965443.0, "datetime": "2023-11-14T12:37:23", "subreddit": "bulimia", "id": "k97d7ib", "text": "I once ate 6 frozen lemon souffle cakes (with ladyfingers) that my mother had made ahead of time to give at Easter time.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743937210.0, "datetime": "2025-04-06T11:00:10", "subreddit": "bulimia", "id": "mlok6va", "text": "You are afraid of everyone leaving you, but you are going to leave everyone you love, that loves you, the people you haven't met yet, the experiences you've yet to have if you don't reach out and get help. So are so worth it.", "parent_id": null, "link_id": null, "context": null}
