{"type": "comment", "timestamp": 1645984263.0, "datetime": "2022-02-27T17:51:03", "subreddit": "fuckeatingdisorders", "id": "hyo47c3", "text": "freezing cold\n\nalways thinking about my weight\n\npanic for not being able to weigh myself\n\ncarrying my scale with me everywhere, including vacation\n\nbeing hospitalized\n\nwatching my mom cry over my disorder\n\ncausing stress and worry to everyone around me\n\npeople always trying to get me to eat\n\nhow lonely it is, people who don't have eating disorders can't understand how all consuming the illness is\n\nthe physical symptoms\n\nhow tiring it is\n\nhonestly will never understand how some people think they \"want\" an eating disorder", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648132411.0, "datetime": "2022-03-24T14:33:31", "subreddit": "fuckeatingdisorders", "id": "i1xo3dn", "text": "thank you! so true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649719980.0, "datetime": "2022-04-11T23:33:00", "subreddit": "fuckeatingdisorders", "id": "i4cxnhp", "text": "what if you are suddenly losing weight without trying and you have had anorexia for many years, and remained at a low weight for years and never actually recovered from it? does this mean recovery is no longer a possibility for someone like me. I feel like harm reduction is my only option at this point. feel like I ruined myself and I can't be one of the people who recovers and gets healthy", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649722590.0, "datetime": "2022-04-12T00:16:30", "subreddit": "fuckeatingdisorders", "id": "i4d3gkk", "text": "I was told I had the option of palliative care but it really scared me. I am hoping somehow  to still turn this around with harm reduction and try to at least feel better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649874158.0, "datetime": "2022-04-13T18:22:38", "subreddit": "fuckeatingdisorders", "id": "i4lipoh", "text": "I love breakfast too. Oatmeal is my favorite thing. also love yogurt with granola", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1649878068.0, "datetime": "2022-04-13T19:27:48", "subreddit": "fuckeatingdisorders", "id": "u2y7zp", "text": "the scariest thing about having an eating disorder is the time you lose, obsessing over what you eat, what you look like, what you weigh, all the behaviors that you know are harmful, yet you can't stop them. I look back at the years when my disorder was much worse, and I realize I will never get that time back. it was lost to the disorder. anorexia was more important than anything to me. I was dying at one point and literally couldn't stop the behaviors. I was reading old food diaries I had written and feeling so embarrassed. it's a miracle I did not die. can't believe I did that to myself. I guess I am angry at myself. how could I care so little about myself? anorexia ruined so much, even though at the time, I couldn't see it. the scale was so important to me. wish I had never found that stupid scale. eating disorders hurt every part of you. they destroy you, inside and out. I want to not have an eating disorder. the scariest thing about having an eating disorder is how hard it is to get out of it once you have an eating disorder. I keep trying. every day", "title": "the scariest thing about having an eating disorder", "context": null}
{"type": "comment", "timestamp": 1649879648.0, "datetime": "2022-04-13T19:54:08", "subreddit": "fuckeatingdisorders", "id": "i4lwnlq", "text": "thank you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649888278.0, "datetime": "2022-04-13T22:17:58", "subreddit": "fuckeatingdisorders", "id": "i4mi272", "text": "thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649888318.0, "datetime": "2022-04-13T22:18:38", "subreddit": "fuckeatingdisorders", "id": "i4mi5rs", "text": "thank you:)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649889870.0, "datetime": "2022-04-13T22:44:30", "subreddit": "fuckeatingdisorders", "id": "i4mlsnp", "text": "you described what it is like perfectly", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649892428.0, "datetime": "2022-04-13T23:27:08", "subreddit": "fuckeatingdisorders", "id": "i4mrmlp", "text": "so true. thank you for your kind comment", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649900832.0, "datetime": "2022-04-14T01:47:12", "subreddit": "fuckeatingdisorders", "id": "i4nat70", "text": "I know that feeling well. I hope you start feeling better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649951903.0, "datetime": "2022-04-14T15:58:23", "subreddit": "fuckeatingdisorders", "id": "i4pqvu8", "text": "I am so sorry about your friend. I had a friend that passed away too. I know how that must hurt. I agree. I am trying to be kinder to myself", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650032270.0, "datetime": "2022-04-15T14:17:50", "subreddit": "fuckeatingdisorders", "id": "i4u1rfe", "text": "thank you. completely agree, eating disorders are terrible. I hope you keep fighting the disorder too", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1651160856.0, "datetime": "2022-04-28T15:47:36", "subreddit": "AnorexiaNervosa", "id": "udy2b6", "text": "I have severe enduring anorexia. and my doctor told me I may have the beginning stages of organ failure from untreated anorexia nervosa. she said organ failure is very likely to happen. I was told by several therapists, my nutritionist and my doctor that I would probably die. my parents are in denial. they say I am not going to die, but I truly feel so weak this is a possibility now. I cannot go back to treatment. I am losing weight without trying. my body is having trouble absorbing calories and nutrients from food. treatment wouldn't fix me at this point. this is scary and I am obviously upset and angry I didn't treat my eating disorder sooner. I do not want to be losing weight. I hate that I am so sick and underweight, but my body is now damaged. Anorexia nervosa is not a weight loss method. it is not a diet that you start. it is a debilitating mental illness that consumes the lives of the people who have it. people who have anorexia do not want to be suffering like this. we do not want to be in pain like this. it's not a choice. I would give anything to be healthy and happy and have my life back the way it was before. When I see someone saying they wish they had anorexia, I honestly want to cry. And I have cried a lot lately.", "title": "Got told I was going to die", "context": null}
{"type": "comment", "timestamp": 1651161962.0, "datetime": "2022-04-28T16:06:02", "subreddit": "AnorexiaNervosa", "id": "i6jr8o9", "text": "Not everyone will recover from anorexia, and sometimes harm reduction and focusing on quality of life is really the best thing for them. You can't force people to get better. that has to come from within them. they have to put in the effort. a hospital can only do so much. making people eat more when they are resistant to it ultimately is going to fail. in a perfect world, everyone would successfully recover from anorexia. but the sad reality is anorexia nervosa has an incredibly high mortality rate, and high rates of relapse and chronic anorexia, even if you end up going to treatment many times. you have to recover for yourself. but people who cannot fully recover are not at fault. anorexia is so hard to overcome. it is so much more than just choosing to eat more. it runs so much deeper than that", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651164666.0, "datetime": "2022-04-28T16:51:06", "subreddit": "AnorexiaNervosa", "id": "i6jxx3n", "text": "I have read about TPN and I am a bit afraid of trying it. I have read there can be complications. I really don't want to have to rely on liquids to get my nutrients. I wish my body would just start absorbing the calories from food. I will discuss TPN with my doctor but I'm honestly scared of TPN right now:(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651165485.0, "datetime": "2022-04-28T17:04:45", "subreddit": "AnorexiaNervosa", "id": "i6jzyi6", "text": "I know. thank you for the suggestion. I'm just having a hard time overcoming my fear. I don't want to die either. I truly don't. this whole thing is scary", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651169238.0, "datetime": "2022-04-28T18:07:18", "subreddit": "AnorexiaNervosa", "id": "i6k9cof", "text": "I just keep hoping things will turn around and my digestive system will just get better on it's own, but you are probably right about tpn. I hope I get better too. I really want to be healthy again and live a long time. I am just scared now. trying to remain hopeful. thank you for your kind comment. it really means a lot", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651170486.0, "datetime": "2022-04-28T18:28:06", "subreddit": "AnorexiaNervosa", "id": "i6kcg6l", "text": "thank you:)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651173647.0, "datetime": "2022-04-28T19:20:47", "subreddit": "AnorexiaNervosa", "id": "i6kkau7", "text": "thank you. your words mean a lot. I hope everything gets better for me too", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651176528.0, "datetime": "2022-04-28T20:08:48", "subreddit": "AnorexiaNervosa", "id": "i6krrkk", "text": "severe and enduring anorexia means you have had anorexia for three to ten years, even longer than this for some people. it also means you have had previous treatment attempts that were not successful. meaning you never actually reached full recovery or weight restoration, and you are treatment resistant, meaning you decline offers to go to eating disorder inpatient or residential treatment. this was a big problem of mine because I did not do well in past treatment facilities. it is a lot harder than people realize and it doesn't necessarily cure the eating disorder", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651181976.0, "datetime": "2022-04-28T21:39:36", "subreddit": "AnorexiaNervosa", "id": "i6l5dqr", "text": "Hope you are doing ok", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651183755.0, "datetime": "2022-04-28T22:09:15", "subreddit": "AnorexiaNervosa", "id": "i6l9i06", "text": "Thank you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651183899.0, "datetime": "2022-04-28T22:11:39", "subreddit": "AnorexiaNervosa", "id": "i6l9tov", "text": "I'm afraid, but I will try", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651191465.0, "datetime": "2022-04-29T00:17:45", "subreddit": "AnorexiaNervosa", "id": "i6lq496", "text": "I'm still too afraid. I have read reviews about that place. and I would rather just be at home. at least here, I can be comfortable", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651193139.0, "datetime": "2022-04-29T00:45:39", "subreddit": "AnorexiaNervosa", "id": "i6lttqn", "text": "Ok, thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651193898.0, "datetime": "2022-04-29T00:58:18", "subreddit": "AnorexiaNervosa", "id": "i6lvibr", "text": "thank you for the advice. I am just scared, of getting help and of dying,", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651202426.0, "datetime": "2022-04-29T03:20:26", "subreddit": "AnorexiaNervosa", "id": "i6memh5", "text": "Exactly. many people with anorexia simply cannot fully recover, and putting pressure on them to do so is never helpful and can be exhausting for them. sometimes you have to meet people halfway. people just expect full recovery of everyone because it seems like the perfect way to deal with anorexia. but it just doesn't help everyone. being realistic about what the other person can accomplish and not forcing change on them is more helpful than expecting them to just not be anorexic anymore.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651203731.0, "datetime": "2022-04-29T03:42:11", "subreddit": "AnorexiaNervosa", "id": "i6mh5rb", "text": "thank you. this is helpful advice. reading some info about TPN now", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651242584.0, "datetime": "2022-04-29T14:29:44", "subreddit": "AnorexiaNervosa", "id": "i6o4toh", "text": "I am sort of afraid of TPN. I didn't say I was completely against using TPN. please understand I do not want to die. I am listening to and reading everyone's comments under this post and thinking about what to do next. please understand how scary and overwhelming it is to be in this situation. I am not declining help. I made this post to reach out for advice, not ignore it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651242985.0, "datetime": "2022-04-29T14:36:25", "subreddit": "AnorexiaNervosa", "id": "i6o5ryl", "text": "thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651243457.0, "datetime": "2022-04-29T14:44:17", "subreddit": "AnorexiaNervosa", "id": "i6o6wxa", "text": "Thank you. this is very helpful to read, and made me feel less alone. I had a feeling there would be still be internal damage even if I do try to get professional help. I am scared. I wish I wasn't. I will try to seek help. I don't want to die", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651249433.0, "datetime": "2022-04-29T16:23:53", "subreddit": "AnorexiaNervosa", "id": "i6ollfl", "text": "Is it the kind of thing where if I went there and then changed my mind, I would be unable to leave? that is what happened to me during my last inpatient hospitalizations. even though I signed myself in voluntarily and I am adult, I was still unable to leave inpatient and forced to stay because of how medically unstable I was and how low my weight was. I have autism, and a big fear of change and unfamiliar places overwhelm me. the hospitals I went to were not even considerate of my autism", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651327350.0, "datetime": "2022-04-30T14:02:30", "subreddit": "AnorexiaNervosa", "id": "i6sh7zt", "text": "thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651603576.0, "datetime": "2022-05-03T18:46:16", "subreddit": "AnorexiaNervosa", "id": "i76zesa", "text": "the thing about anorexics only eating healthy food is so true. anorexic people don't just eat health food all the time. they can love sugar. literally when I was at my lowest weight and about to die of malnutrition, I was eating sugar and candy and carbs, just not a lot of it. I hate the stereotype that people think anorexic people hate food. it's not true. anorexic people like food, but they have a hard time eating enough of it. If you deny yourself food, you start to become obsessed with it. you will constantly think about when your next meal is, what you will eat. if you starve yourself, it ironically makes you more obsessed with getting whatever foods you can eat. and at the same time, you are afraid of it. anorexia is miserable. it's so serious and I think people who think it is some kind of diet or that it involves willpower are ignorant. anorexia is torture, for the person with it, and the people who love the person", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651604138.0, "datetime": "2022-05-03T18:55:38", "subreddit": "AnorexiaNervosa", "id": "i770pkx", "text": "the thing about anorexics only eating healthy food is a popular stereotype. anorexic people don't just eat health food all the time. they can love sugar. When I was severely malnourished,  I was eating sugar and candy and carbs, just not a lot of it. I hate the stereotype that people think anorexic people hate food. it's not true. anorexic people like food, but they have a hard time eating enough of it. If you deny yourself food, you start to become obsessed with it. you will constantly think about when your next meal is, what you will eat. if you starve yourself, it ironically makes you more obsessed with getting whatever foods you can eat. and at the same time, you are afraid of it. anorexia is miserable. it's so serious and I think people who think it is some kind of diet or that it involves willpower are ignorant. anorexia is torture, for the person with it, and the people who love the person", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651612478.0, "datetime": "2022-05-03T21:14:38", "subreddit": "AnorexiaNervosa", "id": "i77kybh", "text": "Another stereotype I hate is that people think all anorexic people think they are fat or have a fear of being fat. no. lots of people with anorexia are aware they are thin. they are just obsessed with being thinner or underweight. for these people, it has nothing to do with a distorted body image or a fear of being fat. it's more a control issue or simply being obsessed with being thin. also, being malnourished can make you not think as clearly, so even though other people tell you that your weight is too low, it is hard for you to understand the real danger. because of the brain changes caused by being underweight/malnourished", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651673755.0, "datetime": "2022-05-04T14:15:55", "subreddit": "AnorexiaNervosa", "id": "i7am8pi", "text": "me too. I eat cookies and chips as will!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651678070.0, "datetime": "2022-05-04T15:27:50", "subreddit": "AnorexiaNervosa", "id": "i7awy08", "text": "Yes. this is so true. this was the same for me as well. I wish more people understood this. it was never about thinking I was fat. I was just terrified of gaining", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1652747946.0, "datetime": "2022-05-17T00:39:06", "subreddit": "fuckeatingdisorders", "id": "uradc9", "text": "My doctor and nutritionist both said with anorexia nervosa, your blood work doesn't necessarily show all the damage. you can have normal blood work with anorexia and still be suffering from severe complications. they said this can happen with anorexia. it doesn't always show up in your blood work, and the results don't always stay the same. I went to an unhelpful gyneocologist today who said that isn't true, that if you damaged your organs or something it would show up in your bloodwork. she said organ failure would show up in blood work, but organ damage wouldn't.  I do not think normal blood work necessarily means everything is okay when you are anorexic. my labs are always normal even though I am severely malnourished and underweight. my doctor said I could still die from this illness. normal labs don't mean you are always  fine.", "title": "Blood tests", "context": null}
{"type": "comment", "timestamp": 1652749386.0, "datetime": "2022-05-17T01:03:06", "subreddit": "fuckeatingdisorders", "id": "i8w4g80", "text": "very true. my doctor said I am still at risk of organ failure, even with normal labs. things like labs and vitals don't show all the damage. and the results can vary. normal labs don't mean all is well when you have an eating disorder", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652749722.0, "datetime": "2022-05-17T01:08:42", "subreddit": "fuckeatingdisorders", "id": "i8w54dy", "text": "that's so sad. with how serious eating disorders are, it seems like medical professionals would treat them like a matter of life and death. because that's what eating disorders are", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652749897.0, "datetime": "2022-05-17T01:11:37", "subreddit": "fuckeatingdisorders", "id": "i8w5gzi", "text": "That's terrible. I am sorry the ER doctor said that to you:( people need to treat eating disorders more seriously, try to understand they are not something to be brushed off because lab work appears \"normal.\"...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652755512.0, "datetime": "2022-05-17T02:45:12", "subreddit": "fuckeatingdisorders", "id": "i8wgkwy", "text": "true. it varies", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652798365.0, "datetime": "2022-05-17T14:39:25", "subreddit": "fuckeatingdisorders", "id": "i8y8txk", "text": "So true.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652798435.0, "datetime": "2022-05-17T14:40:35", "subreddit": "fuckeatingdisorders", "id": "i8y8zyk", "text": "this is the truth. blood and vitals are not the whole picture. thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652798585.0, "datetime": "2022-05-17T14:43:05", "subreddit": "fuckeatingdisorders", "id": "i8y9cty", "text": "Thank you. so true. doctors have to have an idea of what to look for", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652798615.0, "datetime": "2022-05-17T14:43:35", "subreddit": "fuckeatingdisorders", "id": "i8y9fd2", "text": "I am sorry you have a phobia of needles:( that must be difficult", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652798629.0, "datetime": "2022-05-17T14:43:49", "subreddit": "fuckeatingdisorders", "id": "i8y9ghy", "text": "absolutely agree", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1652803664.0, "datetime": "2022-05-17T16:07:44", "subreddit": "fuckeatingdisorders", "id": "urptx2", "text": "We all know the typical side effects of anorexia nervosa. Osteoporosis, heart problems, digestive issues. But there are other complications that are often not discussed or not talked about. These complications are common, but are often not talked about enough. years ago, I didn't even know things like this could happen. Frequent, painful urination is one huge complication of anorexia nervosa. this is the worst complication of anorexia I have ever experienced. It is truly miserable. and I have been to several doctors and they cannot fix it. and it is so painful. anorexia nervosa can cause bladder issues, and nerve damage. There is something called autonomic neuropathy which causes damage to your nervous system, your digestive system and your bladder. Apparently anorexia can lead to this condition for some. anorexia can cause damage to your kidneys and other vital organs. Your immune system becomes weaker when you are anorexic, which means you may get sick more often, and you may not be able to fight off infections and common sicknesses that otherwise healthy people could. for example, I became sick with a common cold once, and it made me so incredibly ill. it was the worst feeling ever. I felt so sick and weak. and I was so relieved when I finally got better from the cold, even though it took forever for my body to feel better. My friend who was anorexic for years, got sick with pneumonia and she died from complications. the anorexia was a contributing factor in her not being able to get better from pneumonia. and she had actually tried to get better throughout her life so many times. she was in treatment for her eating disorder several times. and it makes me sad to think that she got sick and her body couldn't fight it. anorexia nervosa is really serious. and the complications listed here are things you don't want to happen.", "title": "scary side effects from anorexia that don't get talked about much", "context": null}
{"type": "comment", "timestamp": 1652807021.0, "datetime": "2022-05-17T17:03:41", "subreddit": "fuckeatingdisorders", "id": "i8ytvfd", "text": "Thank you. that is interesting. I have never heard of Autophonia but it sounds like something anorexia would cause.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652807706.0, "datetime": "2022-05-17T17:15:06", "subreddit": "fuckeatingdisorders", "id": "i8yvjx8", "text": "Thank you. So true. sometimes it is hard to see the damage you are causing to yourself. lots of times you think you are okay, and you are not:(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652809892.0, "datetime": "2022-05-17T17:51:32", "subreddit": "fuckeatingdisorders", "id": "i8z11rh", "text": "I know the feeling. frequent urination is awful. I wish it would go away for me, but so far, nothing makes it better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652815211.0, "datetime": "2022-05-17T19:20:11", "subreddit": "fuckeatingdisorders", "id": "i8ze2xk", "text": "I am sorry you have to deal with it. it is a scary thing to have to go through", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652817967.0, "datetime": "2022-05-17T20:06:07", "subreddit": "fuckeatingdisorders", "id": "i8zks07", "text": "I am sorry you have to deal with that:( it's so scary. I hope you start feeling better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652819013.0, "datetime": "2022-05-17T20:23:33", "subreddit": "fuckeatingdisorders", "id": "i8znaoz", "text": "That sounds so difficult. I am sorry you have to deal with all of that. I wish that no one suffered from eating disorders, they do so many awful things to your health, and it is so isolating when no one around you understands the pain you are in", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652830898.0, "datetime": "2022-05-17T23:41:38", "subreddit": "fuckeatingdisorders", "id": "i90dzc4", "text": "I am sorry. It's such an awful thing to deal with. I think it is hard for a lot of people to talk about. you are not alone in your struggle", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652835295.0, "datetime": "2022-05-18T00:54:55", "subreddit": "fuckeatingdisorders", "id": "i90n6jt", "text": "thank you for the book recommendation", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652840654.0, "datetime": "2022-05-18T02:24:14", "subreddit": "fuckeatingdisorders", "id": "i90yk93", "text": "that happens to me too. it is so upsetting and exhausting", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652840950.0, "datetime": "2022-05-18T02:29:10", "subreddit": "fuckeatingdisorders", "id": "i90z5tx", "text": "Have you tried a urologist? I am going to see one to see if they can help me. every time I do a urine test, my doctor thinks the pain is from a uti, and it's not. pretty sure it's from nerve or organ damage. I am really hoping the urologist can give me some hopeful advice. even if doctors are dismissing you, I would highly recommend you keep trying. keep seeing doctors and get different opinions. don't let anyone make you feel like your pain is invalid or your problem isn't serious. I know it can be so frustrating. I really hope you find some answers", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652841333.0, "datetime": "2022-05-18T02:35:33", "subreddit": "fuckeatingdisorders", "id": "i90zy6e", "text": "Of course. I hope I find some answers for my pain.  Thank you so much, and I hope you find ways to feel better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653342024.0, "datetime": "2022-05-23T21:40:24", "subreddit": "AnorexiaNervosa", "id": "i9qexpl", "text": "I think eating disorders are something that the sufferer falls into by accident. and that they are trying to numb painful emotions. and that's about it. eating disorders are about mental pain.  I do not necessarily think people who begin to suffer from eating disorders think there is anything forbidden or mysterious about trying to starve themselves to death. even in the beginning. you have to be deeply unhappy in order to do this to yourself. no happy, well adjusted person would develop anorexia. there is no beauty in an eating disorder.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653411748.0, "datetime": "2022-05-24T17:02:28", "subreddit": "fuckeatingdisorders", "id": "i9tt706", "text": "So about the 6 percent of ed sufferers who happen to be underweight and naturally skinny, meaning they will not actually ever be overweight, can we still make posts about being underweight? you talk a lot about fatphobia and people with eating disorders in larger bodies not getting enough support. I get that, it's not right. this doesn't mean that severely underweight people with eating disorders have it any easier or that they shouldn't be allowed to talk about their problems from being severely underweight. Just because being an underweight person with an eating disorder is \"less common,\" doesn't mean their problems are not serious or not relatable. I am an underweight person with anorexia. I can only talk about my experience with being underweight, I shouldn't have to censor myself so that I don't hurt the feelings of people who happen to weigh more than I do. it's not about fatphobia, some people are just naturally skinny, and underweight. and we have feelings just like people with eating disorders in larger bodies.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653414630.0, "datetime": "2022-05-24T17:50:30", "subreddit": "fuckeatingdisorders", "id": "i9u0706", "text": "no problem, thank you for explaining. it is indeed harmful to tell members in larger bodies to eat less and that they should lose weight, and that they must have binge eating disorder. I bet that feels very uncomfortable. but it's also hurtful to underweight people to be insulted for being underweight and be told they just need to \"eat more.\"(believe me, it happens)....and being underweight doesn't necessarily mean you automatically get treatment and an easy recovery. first of all, you have to want to recover. being underweight doesn't just cause everyone around you to always treat you kindly and with concern, that's another stereotype that glamourizes being underweight.  It's not a contest about who suffers more, based on how much the person weighs. skinny people suffer. people in larger bodies also suffer. our experiences may not be as typical as the normal weight/ overweight person with the eating disorder. doesn't mean our experiences are less valid. again, it's great to advocate for people with eating disorders in larger bodies because they don't get enough support. but underweight people deserve support as well", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653415488.0, "datetime": "2022-05-24T18:04:48", "subreddit": "fuckeatingdisorders", "id": "i9u2acb", "text": "that's true. it benefits everyone to have these conversations. again, I am not trying to argue. just stating my opinion, and I don't disagree with yours", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653579222.0, "datetime": "2022-05-26T15:33:42", "subreddit": "AnorexiaNervosa", "id": "ia2rh12", "text": "aw, I love this. thank you for sharing. hope you had a wonderful birthday. you deserve yummy food", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1654015829.0, "datetime": "2022-05-31T16:50:29", "subreddit": "fuckeatingdisorders", "id": "v1unv9", "text": "Having an eating disorder isn't just a small problem. It's a very serious illness. there are different types of eating disorders that affect people at different weights. But no matter what type of eating disorder you have, it ultimately will not do anything positive for you in the long run\n\nAn eating disorder will not:\n\nmake you happy\n\nmake you more confident\n\nmake you healthier\n\nmake you feel proud of yourself\n\nmake you love yourself\n\nmake you feel special\n\nmake you feel beautiful\n\nAn eating disorder will:\n\ncause mental and emotional suffering\n\ncause you to lose your confidence\n\nmake you unhealthier\n\nmake you afraid\n\nmake you unhappy\n\nmake other people worry\n\nmake you feel ashamed\n\nmake you sick\n\nruin your life\n\nThere are no positives to suffering from an eating disorder. at all. even if you lose weight, you will not feel happy", "title": "There is nothing positive about having an eating disorder", "context": null}
{"type": "comment", "timestamp": 1654018166.0, "datetime": "2022-05-31T17:29:26", "subreddit": "fuckeatingdisorders", "id": "iaop9k5", "text": "thank you. so true!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654019483.0, "datetime": "2022-05-31T17:51:23", "subreddit": "fuckeatingdisorders", "id": "iaosewa", "text": "you are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654022610.0, "datetime": "2022-05-31T18:43:30", "subreddit": "fuckeatingdisorders", "id": "iaozugg", "text": "restricting doesn't really make you more confident though. it's an illusion. it's a false sense of confidence and a false sense of security that you feel when you are restricting. you may feel good at first, but that wears off very quickly, and then when you restrict, you feel pain and misery. and yet it's so hard to stop. that's why eating disorders have such high relapse rates and poor recovery rates", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654024961.0, "datetime": "2022-05-31T19:22:41", "subreddit": "fuckeatingdisorders", "id": "iap44u3", "text": "So true. I was happier with my body when I wasn't underweight. now that I am underweight, all I feel is sadness. an eating disorder really is just about self hatred", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654025465.0, "datetime": "2022-05-31T19:31:05", "subreddit": "fuckeatingdisorders", "id": "iap52ng", "text": "thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654025801.0, "datetime": "2022-05-31T19:36:41", "subreddit": "fuckeatingdisorders", "id": "iap5tdn", "text": "that's a great point and very true. you think you are in control and doing something right. when actually all you are really doing is making yourself unhealthier and even more unhappy. but when you first have an eating disorder, you don't realize this. somehow it feels \"right\" at the beginning, but then you realize how wrong you were when you get deep into the illness", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654027581.0, "datetime": "2022-05-31T20:06:21", "subreddit": "fuckeatingdisorders", "id": "iap9xjw", "text": "that's a good point. it hurts people who love you as well", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654028945.0, "datetime": "2022-05-31T20:29:05", "subreddit": "fuckeatingdisorders", "id": "iapd4ro", "text": "thank you for your comment. eating disorders can develop for a variety of different reasons for people. I am so glad you find this post helpful", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654031072.0, "datetime": "2022-05-31T21:04:32", "subreddit": "fuckeatingdisorders", "id": "iapi14f", "text": "because people who don't have the genetic predisposition to develop an eating disorder are able to diet, lose weight and not cross over into dangerous territory, which is an eating disorder. they are able to maintain a balance and not go too far. people who do have the genetic predisposition for an eating disorder don't set out to have an eating disorder. it unfortunately just happens to them. I wouldn't say that anyone \"flirts\" with an eating disorder. it's not really something you can try. when you develop one, it's not something you can just abandon easily once you start to hate it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654031804.0, "datetime": "2022-05-31T21:16:44", "subreddit": "fuckeatingdisorders", "id": "iapjoos", "text": "I am sorry:( eating disorders can make you feel unhappy, even if you reach your goal of losing weight. I think that's why a lot of people who don't have eating disorders misunderstand them", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654035578.0, "datetime": "2022-05-31T22:19:38", "subreddit": "fuckeatingdisorders", "id": "iaps1dp", "text": "glad it helps you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654040607.0, "datetime": "2022-05-31T23:43:27", "subreddit": "fuckeatingdisorders", "id": "iaq2o5j", "text": "Thank you for your kind comment. I am always happy to hear that my posts are helpful to others. Sharing thoughts about things like eating disorders does take courage, but I think once you realize that other people feel the same way, it makes it easier to talk about it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654043879.0, "datetime": "2022-06-01T00:37:59", "subreddit": "fuckeatingdisorders", "id": "iaq9dfn", "text": "so painfully true. anorexia nervosa is such a terrible, draining, and destructive illness", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654044199.0, "datetime": "2022-06-01T00:43:19", "subreddit": "fuckeatingdisorders", "id": "iaqa1jq", "text": "I am so sorry. I can relate. most days I have to spend laying in bed because I am simply too tired. music is a comfort though, for sure. it makes me feel not alone. I hope things get better for you. no one should go through this. it's the most awful illness I have ever experienced", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654048423.0, "datetime": "2022-06-01T01:53:43", "subreddit": "fuckeatingdisorders", "id": "iaqj07c", "text": "this is so true, and it happens to many people, sadly", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654099003.0, "datetime": "2022-06-01T15:56:43", "subreddit": "fuckeatingdisorders", "id": "iassgs6", "text": "I didn't think about this, thank you for your comment. it is really sad that people go through that and I can understand how the eating disorder can then serve as a coping mechanism.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654192369.0, "datetime": "2022-06-02T17:52:49", "subreddit": "AnorexiaNervosa", "id": "iaxrsll", "text": "the consequences of anorexia for people who do not recover are either horrible, painful medical complications that you live with for the rest of your life or death. no one lives with anorexia untreated and just feels fine. it destroys you painfully and horribly in one way or the other, no one escapes these consequences. you die or you recover. I am at the point where I am worried this will eventually kill me. but I tried to recover and I couldn't and now I feel too weak to try. it's a sad reality of eating disorders. recovery may feel like torture for some people, but living with anorexia for years and slowly dying from it is also pure torture.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1654227080.0, "datetime": "2022-06-03T03:31:20", "subreddit": "fuckeatingdisorders", "id": "v3qcic", "text": " not everyone is going to recover from anorexia nervosa, and harm reduction is completely valid and is helpful for people who can't fully recover. and people who cannot fully recover deserve support, they do not deserve to be shamed because they can't recover the right or correct way. underweight people should also be allowed to discuss their feelings. not everyone is going to fully restore their weight and not everyone can gain weight so easily. my organs are damaged from long term anorexia, and I literally have a hard time gaining weight now. I can't just go to treatment and fix my illness at this point. people who have severe enduring anorexia have to be given a different approach to treatment. people who do not recover deserve to feel listened to. it's not as easy as other people think it is", "title": "people not in recovery should be allowed to talk about their disorder", "context": null}
{"type": "comment", "timestamp": 1654228076.0, "datetime": "2022-06-03T03:47:56", "subreddit": "fuckeatingdisorders", "id": "iazxczz", "text": "that was my post that got downvoted:( I felt so bad about being downvoted I deleted it. almost left this sub entirely because I felt so humiliated and unheard. also cried after the response I got to the post. that sure felt great.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654228552.0, "datetime": "2022-06-03T03:55:52", "subreddit": "fuckeatingdisorders", "id": "iazy7w8", "text": "thank you so much. I appreciate your kind words", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654230061.0, "datetime": "2022-06-03T04:21:01", "subreddit": "fuckeatingdisorders", "id": "ib00s8o", "text": "I think that when people post about severe and enduring anorexia, harm reduction, and being underweight, it makes people on this sub more uncomfortable or more easily offended? because it's not recovering in a typical way, and I have noticed that this sub is very pro recovery so my posts probably stand out because of the things I post about. I hope that my posts are able to relate to people here, but a lot of times I feel like I stick out in a bad way when I make posts here. maybe it bothers others, I don't know.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654243630.0, "datetime": "2022-06-03T08:07:10", "subreddit": "fuckeatingdisorders", "id": "ib0ijwx", "text": "I have looked through that sub, yes. thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654244139.0, "datetime": "2022-06-03T08:15:39", "subreddit": "fuckeatingdisorders", "id": "ib0j385", "text": "thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654263505.0, "datetime": "2022-06-03T13:38:25", "subreddit": "fuckeatingdisorders", "id": "ib1acxf", "text": "I am really sorry that you have experienced this as well. I don't intentionally try to trigger other people either. but on the internet, it's easy to misunderstand someone else's view point, even if that person posted with the best intentions", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654263765.0, "datetime": "2022-06-03T13:42:45", "subreddit": "fuckeatingdisorders", "id": "ib1awbk", "text": "Thank you. that's true. Not everyone is going to recover.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654263875.0, "datetime": "2022-06-03T13:44:35", "subreddit": "fuckeatingdisorders", "id": "ib1b4lv", "text": "true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654263895.0, "datetime": "2022-06-03T13:44:55", "subreddit": "fuckeatingdisorders", "id": "ib1b64h", "text": "thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654264065.0, "datetime": "2022-06-03T13:47:45", "subreddit": "fuckeatingdisorders", "id": "ib1bj4s", "text": "thank you so much. harm reduction is valid and people who are not recovering or not fully recovered should be allowed to share their thoughts and feelings on what it is like.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654264133.0, "datetime": "2022-06-03T13:48:53", "subreddit": "fuckeatingdisorders", "id": "ib1boeh", "text": "I understand. I really hope you keep trying to feel better. your feelings are valid and your disorder deserves to be taken seriously", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654264196.0, "datetime": "2022-06-03T13:49:56", "subreddit": "fuckeatingdisorders", "id": "ib1bt63", "text": "I think it is allowed here, people just have to be careful how they word their posts here. because other people can take it the wrong way", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654264485.0, "datetime": "2022-06-03T13:54:45", "subreddit": "fuckeatingdisorders", "id": "ib1cext", "text": "thank you. this is true.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654264788.0, "datetime": "2022-06-03T13:59:48", "subreddit": "fuckeatingdisorders", "id": "ib1d271", "text": "that's the feeling I get when someone misinterprets one of my posts.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654265295.0, "datetime": "2022-06-03T14:08:15", "subreddit": "fuckeatingdisorders", "id": "ib1e5b4", "text": "So true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654453026.0, "datetime": "2022-06-05T18:17:06", "subreddit": "fuckeatingdisorders", "id": "iba04qf", "text": "you are welcome. I feel like these things don't get talked about enough when it comes to anorexia. I know how that feels. I have also caused irreversible damage to my body, now I live with painful symptoms I can't fix.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654462366.0, "datetime": "2022-06-05T20:52:46", "subreddit": "AnorexiaNervosa", "id": "ibajkdk", "text": "people at any age can develop an eating disorder. I have had anorexia for 16 years. it started when I was an adult, not a teenager. it's not just something that happens to teenagers. there are a lot of people who have had anorexia nervosa for many years. it can also develop at any age. do not feel bad for being older and still struggling.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654559773.0, "datetime": "2022-06-06T23:56:13", "subreddit": "AnorexiaNervosa", "id": "ibffx1v", "text": "your life has so much value and meaning, no matter how old you are. you didn't waste your life. you are here and continuing to fight. I think people who are older and still fighting their illness are strong people.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654614517.0, "datetime": "2022-06-07T15:08:37", "subreddit": "AnorexiaNervosa", "id": "ibhtwub", "text": "No need to apologize. your comment made me feel bad for you and I was trying to be supportive in my comment. there is no shame in not being recovered yet. I am not recovered yet either. and I can relate to the struggle of having an eating disorder for a long time and feeling like you can't get better", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1654620866.0, "datetime": "2022-06-07T16:54:26", "subreddit": "fuckeatingdisorders", "id": "v7181h", "text": "Osteoporosis, fractures\n\nweakened immune system, difficulty fighting off infections and other illnesses\n\nHeart problems, heart attack, heart disease\n\nMuscle wasting\n\nKidney problems/ kidney failure\n\nMultiple organ failure\n\nhypoglycemia \n\ndepression\n\ngeneral weak feeling/feeling faint\n\ninability to stay warm/feeling cold often\n\ndamage to teeth\n\nchanges to the brain due to starvation\n\ndeath. anorexia nervosa has the highest mortality rate of any mental illness", "title": "medical complications of anorexia nervosa", "context": null}
{"type": "comment", "timestamp": 1654626215.0, "datetime": "2022-06-07T18:23:35", "subreddit": "fuckeatingdisorders", "id": "ibilav2", "text": "glad it helps you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654627298.0, "datetime": "2022-06-07T18:41:38", "subreddit": "fuckeatingdisorders", "id": "ibinu9f", "text": "you are welcome. people need to be more aware of these complications and how serious eating disorders can be", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654627995.0, "datetime": "2022-06-07T18:53:15", "subreddit": "fuckeatingdisorders", "id": "ibipg5r", "text": "yes, these are great ones to add to this list. thank you. there are so many medical complications that can occur", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654628647.0, "datetime": "2022-06-07T19:04:07", "subreddit": "fuckeatingdisorders", "id": "ibiqy7b", "text": "because when you are sick at first, you don't realize how much damage you are causing your body. until it finally hits you and you realize how much you have actually damaged yourself. that's the worst feeling, for me. realizing I could have done something about this a long time ago. I chose not to do anything, now I am paying the price for it:(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654628769.0, "datetime": "2022-06-07T19:06:09", "subreddit": "fuckeatingdisorders", "id": "ibir8bd", "text": "yes, zoning out is awful. feeling numb most days feels awful. not being able to feel happiness, real happiness", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654630055.0, "datetime": "2022-06-07T19:27:35", "subreddit": "fuckeatingdisorders", "id": "ibiu7s4", "text": "thank you, forgot to mention this one", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654637427.0, "datetime": "2022-06-07T21:30:27", "subreddit": "fuckeatingdisorders", "id": "ibjaihr", "text": "you are sick, the moment you develop disordered thoughts. there's no \"not really sick\" when you have an eating disorder. also, developing these complications is terrible. there's no taking it back when they happen to you. often these complications are permanent, forever, can't be reversed. it's awful. no one should want these complications", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654637724.0, "datetime": "2022-06-07T21:35:24", "subreddit": "fuckeatingdisorders", "id": "ibjb41v", "text": "yes, anorexia often causes hands and feet to turn purple because of lack of blood flow", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654637895.0, "datetime": "2022-06-07T21:38:15", "subreddit": "fuckeatingdisorders", "id": "ibjbghj", "text": "I'm sorry it won't go away for you. it's a common thing that happens with anorexia. I am sure a lot of people experience it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654639410.0, "datetime": "2022-06-07T22:03:30", "subreddit": "fuckeatingdisorders", "id": "ibjejbd", "text": "people can recover, and that's great. but some people don't recover, wait too long to treat their eating disorder and still suffer permanent medical complications. it's sad but it happens. you can't always reverse what happens to the body when you have anorexia.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654647755.0, "datetime": "2022-06-08T00:22:35", "subreddit": "fuckeatingdisorders", "id": "ibjv1rk", "text": "true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654648537.0, "datetime": "2022-06-08T00:35:37", "subreddit": "fuckeatingdisorders", "id": "ibjwli9", "text": "true. it does take an emotional and mental toll and the suicide rate is high in people with eating disorders", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654650859.0, "datetime": "2022-06-08T01:14:19", "subreddit": "fuckeatingdisorders", "id": "ibk14cw", "text": "thanks, these are good ones to add to this list", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654651363.0, "datetime": "2022-06-08T01:22:43", "subreddit": "fuckeatingdisorders", "id": "ibk23df", "text": "aw, thank you. I don't ever like to mention things like weights, numbers, or things to encourage comparison.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654651404.0, "datetime": "2022-06-08T01:23:24", "subreddit": "fuckeatingdisorders", "id": "ibk266z", "text": "oh yes, these are all so true.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654659073.0, "datetime": "2022-06-08T03:31:13", "subreddit": "fuckeatingdisorders", "id": "ibkgs21", "text": "yes, gastroparesis is a side effect, and it is so awful. I think I may have this", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654660787.0, "datetime": "2022-06-08T03:59:47", "subreddit": "fuckeatingdisorders", "id": "ibkjmk3", "text": "so true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654700370.0, "datetime": "2022-06-08T14:59:30", "subreddit": "fuckeatingdisorders", "id": "ibm6cg0", "text": "thanks, these are all true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655893970.0, "datetime": "2022-06-22T10:32:50", "subreddit": "AnorexiaNervosa", "id": "idaexk1", "text": "So true. a person's body can only take so much. it's truly scary when you start to feel the effects of anorexia. it's really sad. I wish I wasn't anorexic. I wake up every day hoping that I can just snap out of this. it's more difficult than people realize", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656770723.0, "datetime": "2022-07-02T14:05:23", "subreddit": "fuckeatingdisorders", "id": "iektuxb", "text": "that sounds awful. I also have trouble gaining weight after years of having anorexia, along with frequent urination. not sure why this is happening but it is very scary to deal with", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1678928118.0, "datetime": "2023-03-16T00:55:18", "subreddit": "fuckeatingdisorders", "id": "jcdf3od", "text": "No, you don't have to be underweight for these things to happen. They happen to people of any weight", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1678932128.0, "datetime": "2023-03-16T02:02:08", "subreddit": "fuckeatingdisorders", "id": "jcdo80z", "text": "Well everyone is different. Some people will get these health complications and some won't. Depends on the person's health and how severe their eating disorder is. Yeah, since starving yourself is unhealthy, it can lead to these things for some people. And yes, nutrient deficiencies can cause them too", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722279383.0, "datetime": "2024-07-29T18:56:23", "subreddit": "fuckeatingdisorders", "id": "lfj42p7", "text": "Thank you for sharing your experience in recovery. I am happy you are getting better. I still don't feel great. I am trying to take it one day at a time. I know getting better is hard work and my health may not be like it once was. I also have to deal with painful medical complications from this. I hope things get better for me. I'm struggling today and reading this comment helped me a lot. Thank you. Eating disorders are scary illnesses and the reality needs to be talked about more", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1722365377.0, "datetime": "2024-07-30T18:49:37", "subreddit": "AnorexiaNervosa", "id": "1eg1at9", "text": "I have severe and enduring anorexia. I've suffered from it for 18 years. I never fully recovered. I tried inpatient treatment twice, but it didn't help me. I have autism as well, and the inpatient programs I went to did not take this into consideration at the time. I am experiencing severe medical complications from prolonged malnutrition, like an inability to digest nutrients properly from the food I eat. This is resulting in unintentional weight loss and stomach pain. I also have bladder issues and painful, frequent urination. Due to the embarrassment of the symptoms, I don't want to go to the hospital. These symptoms have been going on for three years and have not resolved. I am on palliative care for my eating disorder. My doctor has told me I could die if I don't turn things around and explained my body can't process the nutrients from food properly because of how long I have starved myself. She said it will take time for me to feel better and that I will have to push myself to eat more, despite the pain I am in. And that's very difficult. Because on days when I am in pain, it's hard to motivate myself to eat more. My parents had a hard time accepting the severity of my illness, and wouldn't take it seriously, until the nurse from palliative care explained it to them. They are very supportive, but I think it makes them sad to talk with me about this. They will take me to my doctors appointments, but don't want to listen to me when I explain to them how bad my pain is. My doctor is trying to get me set up with an online eating disorder program that works with people who have autism and anorexia. I just want the painful medical complications to go away. I try to eat more, but it doesn't make me feel better. My weight won't go up. I can't go through a day without feel pain and exhaustion. I don't want to get worse, but I feel I've been sick for so long, that I may not be able to completely reverse these medical complications. I know this is serious, but I have a fear of change. This fear of change makes me afraid of trying new things, new treatments. Talking to new doctors gives me anxiety. But I know if I do nothing, I will continue to decline. Can anyone relate? Anorexia is such a serious illness. Anyone who is struggling, I advise you to seek help as soon as you become ill. I was very stubborn and refused to listen to the doctors years ago, who told me I needed to treat this right away. I stayed sick for years, and now my behaviors are deeply entrenched and hard to break. Due to being autistic, I also have sensory sensitivities, rigid thinking, and issues with my hunger cues, which are things not typically addressed in anorexia treatment. I think being autistic makes my behaviors more engrained. I don't think recovering is impossible for me, but it is more difficult for me at this point. And that is why I need a treatment program tailored to fit my specific needs. Anorexia is a heartbreaking disorder. No one deserves to suffer with it. I do have a therapist and nutritionist and I hope the online program can offer me some advice about what to do. ", "title": "End stage anorexia", "context": null}
{"type": "comment", "timestamp": 1722367803.0, "datetime": "2024-07-30T19:30:03", "subreddit": "AnorexiaNervosa", "id": "lfp5b5i", "text": "Thank you for the helpful advice. I will talk with my doctor about this. Yes, I have a fear and discomfort around change, but also fear around continuing to decline. I hope I can start to feel better. I won't let the embarrassment from the symptoms stop me from reaching out for support. Doing nothing is keeping me stuck and I really want to feel better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722369308.0, "datetime": "2024-07-30T19:55:08", "subreddit": "AnorexiaNervosa", "id": "lfpa2sk", "text": "Thank you for the support and I am sorry you are struggling too. This helped me feel better about it. I hope my treatment team can offer me some helpful advice.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722371176.0, "datetime": "2024-07-30T20:26:16", "subreddit": "AnorexiaNervosa", "id": "lfpg28c", "text": "Thank you for the words of encouragement.  I've never had enteral feeding or a feeding tube. This was helpful to read. I am glad I am not alone in my struggles. I  do want to feel better and be happier. I think having treatment tailored to fit my needs will really help me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722372306.0, "datetime": "2024-07-30T20:45:06", "subreddit": "AnorexiaNervosa", "id": "lfpjor1", "text": "I think it's equip health.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722372816.0, "datetime": "2024-07-30T20:53:36", "subreddit": "AnorexiaNervosa", "id": "lfplbnb", "text": "Thank you. I will try to remain hopeful and positive. I don't want to get worse. And I want to improve my quality of life and find relief from the painful symptoms I am experiencing. I am glad I am not alone in this", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722375103.0, "datetime": "2024-07-30T21:31:43", "subreddit": "AnorexiaNervosa", "id": "lfpsb71", "text": "Thank you. I'm really afraid to go to the hospital, any type of hospital setting where I would be away from home. I was so uncomfortable the last two times I was hospitalized. I could hardly focus on getting better because I was so anxious. And the programs didn't take into consideration that I have autism and that I will respond differently to anorexia treatment. I think I have trauma from my last inpatient experiences. But I know all programs are different and I know they do work for some people. I would feel more comfortable staying at home and doing outpatient care.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722375427.0, "datetime": "2024-07-30T21:37:07", "subreddit": "AnorexiaNervosa", "id": "lfpta0b", "text": "Thank you for the advice. I've never been to a residential program. I will try to be more optimistic about treatment. I think I get set in my ways, and any change is very scary to me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722375749.0, "datetime": "2024-07-30T21:42:29", "subreddit": "AnorexiaNervosa", "id": "lfpu91f", "text": "That's true. All programs are different", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722375841.0, "datetime": "2024-07-30T21:44:01", "subreddit": "AnorexiaNervosa", "id": "lfpuiyt", "text": "Thank you for the advice", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722377188.0, "datetime": "2024-07-30T22:06:28", "subreddit": "AnorexiaNervosa", "id": "lfpyivn", "text": "Thank you. Well said. It is nice to know that I am not alone in my fears and distress and that others with anorexia understand. Anorexia is about control and getting treatment takes away some of that control. Of course that is scary to a person with an eating disorder. Thank you for the words of encouragement. I hope the online program helps me. And I will continue to remain hopeful that things can improve for me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722378903.0, "datetime": "2024-07-30T22:35:03", "subreddit": "AnorexiaNervosa", "id": "lfq3fif", "text": "I'm sorry you are going through this as well. It's very hard to live like this. It's a physical, mental and emotional pain people without anorexia will never understand. I hope things improve, for both of us. My friend died of anorexia. Anorexia is a scary illness. I am trying to be positive and fight this, even though it's very hard sometimes. I hope you start feeling better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722383346.0, "datetime": "2024-07-30T23:49:06", "subreddit": "AnorexiaNervosa", "id": "lfqfmz5", "text": "I'm glad my post is helping others not feel alone. And I'm sorry for what you are going through. You are not alone. I also don't feel like getting completely better is a possibility for me at this point. But I do hope to manage some of these painful symptoms I experience. Palliative care/hospice care around anorexia should be discussed more than it is.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722428983.0, "datetime": "2024-07-31T12:29:43", "subreddit": "AnorexiaNervosa", "id": "lfsx9r0", "text": "Thank you for the support and advice", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722429021.0, "datetime": "2024-07-31T12:30:21", "subreddit": "AnorexiaNervosa", "id": "lfsxcxx", "text": "Thank you for the helpful advice. I will keep trying", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722429579.0, "datetime": "2024-07-31T12:39:39", "subreddit": "AnorexiaNervosa", "id": "lfsyo6c", "text": "That's very sad. I want to live a long time and will try to fight this", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722429739.0, "datetime": "2024-07-31T12:42:19", "subreddit": "AnorexiaNervosa", "id": "lfsz23k", "text": "Thank you for the advice. This was helpful. I will keep trying to get better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722430068.0, "datetime": "2024-07-31T12:47:48", "subreddit": "AnorexiaNervosa", "id": "lfszuw9", "text": "I will remember this. Thank you for the words of encouragement", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722433125.0, "datetime": "2024-07-31T13:38:45", "subreddit": "AnorexiaNervosa", "id": "lft7ofm", "text": "No, i have not tried that", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722436525.0, "datetime": "2024-07-31T14:35:25", "subreddit": "AnorexiaNervosa", "id": "lfthf7z", "text": "I am glad others can relate. Having autism and anorexia is so challenging. I am glad you are past the worst of it. I hope I can get past this too. It is a hard battle to fight. It's every minute of every day. And I wish there were more treatment options available for those with anorexia and autism. Thank you for the support.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722444902.0, "datetime": "2024-07-31T16:55:02", "subreddit": "AnorexiaNervosa", "id": "lfu7hoc", "text": "I have not talked to my doctor about it, but I have talked to the nurse from palliative care about it. I am a little worried about side effects from a feeding tube, if I were to get one. I will mention it to my doctor and see what she says. I have a big fear around trying different things. But I know I need to try something different at this point, because eating regular food doesn't appear to be helping me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722446750.0, "datetime": "2024-07-31T17:25:50", "subreddit": "AnorexiaNervosa", "id": "lfuddxr", "text": "I am sorry you are going through pain too. I can relate to what you wrote.  I hope we can both start feeling better. I get so tired also. It's miserable. But I am trying to be positive and push through the pain. I really want to feel better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722538861.0, "datetime": "2024-08-01T19:01:01", "subreddit": "AnorexiaNervosa", "id": "lg0qx0z", "text": "Thank you. So true. I hope I find a treatment that works for both my autism and anorexia. Glad others can relate", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722539025.0, "datetime": "2024-08-01T19:03:45", "subreddit": "AnorexiaNervosa", "id": "lg0rf94", "text": "Thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722711928.0, "datetime": "2024-08-03T19:05:28", "subreddit": "AnorexiaNervosa", "id": "lgca27n", "text": "Thank you for the support. I appreciate it. I do want to live a long time and feel better. It's such an awful disorder. I will keep trying. Some days, it's very difficult. I'm not sure what my root cause is, but I know it's hard to stop the eating disorder behaviors completely. I want to turn this around and feel healthier and stronger. I am glad you are getting well. I hope I can get well too.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1723496525.0, "datetime": "2024-08-12T21:02:05", "subreddit": "AnorexiaNervosa", "id": "1eqp90b", "text": "As someone who has suffered from anorexia for 18 years and has what is called severe and enduring anorexia, I would like to offer my perspective on chronic anorexia and the way it progresses. When I see people who have only been ill for a short time say they wish they were sicker so they feel valid, it makes me sad. When I see people say they want to get worse so someone will care, it makes me sad. So if you have not been ill for years, if your eating disorder has only gone on for a couple of months, a year, two years, if you think no one will take you seriously or care until you lose more weight or become sicker, I am here to tell you that you are not alone. Your pain is real. Your illness is real and you have nothing to prove to anyone. When you find yourself wishing you were worse, or thinking you are not as bad as someone else with anorexia, imagine this. You start wanting to lose weight, for whatever reason. Maybe you are sad. Maybe someone was mean to you. Maybe you went through trauma. Maybe someone made fun of your weight. Maybe you just started restricting your food intake, and you can't really think of a reason why. Whatever the trigger, something clicks in your brain. And the eating disorder is now the most important thing on your mind. You find yourself obsessing over your body, your weight. You lose weight. But you are never happy. So you keep going. The number on the scale will become the most important thing to you. People around you start to notice there is a problem and you aren't acting like yourself. But you ignore their concerns. You start to become emaciated. Your bones become weak. Your heart beats fast. You find yourself thinking about food and worrying about what you will eat. All you can think of is that you want to lose weight. But you don't realize at this point you have a serious problem that is deadly and requires treatment. Anorexia has become your entire world. It offers you predictability and control, in a world where you feel out of control.  But deep down, you know what you are doing isn't healthy. But you believe you aren't that bad yet. You keep going. Losing more weight. You hide your body in layers of clothes, but people keep asking you about your weight loss. You want to be left alone, to continue what you are doing. But people who care can't stop worrying. And they want to help you. Your doctor tells you that you need treatment and that anorexia nervosa has a high death rate. You don't believe you can die yet. But a part of you fears this. Eventually, you get hospitalized and threatened with a feeding tube. You look around at other ed patients. They are all hurting in their own ways. Some people are recovering. Some people are struggling with eating. You wonder why you can't be like the people who are getting better. When you hear doctors telling you to treat this as soon as possible, to listen to the advice they are giving you, you ignore it. Because you want things back the way they were. You want to starve yourself, to lose weight, to see the perfect number on the scale. But eating disorders lie. And no number is a perfect number and no matter how much weight you lose, you will never find the happiness you want. Because an illness like anorexia does not give you happiness. It takes it away. You are not a chronic sufferer yet. You don't stop and consider the consequences yet. Or what will happen to your health in the future. You are so sick that you are in the hospital with people trying to get you to eat more. But it still has not dawned on you how ill you are. Some people with anorexia will never go to the hospital for their eating disorder. But their pain is just as valid.  And they are just as sick as people in the hospital. Some people with anorexia will never have a feeding tube. But they are suffering just like all the rest. Eating disorders affect everyone differently. And eating disorders don't care what you weigh when they cause permanent complications. People die of eating disorders and you often don't realize you are at that critical point, until damage has been done. Years later, you have what is called severe and enduring anorexia, chronic anorexia. You find you are suffering awful and painful medical complications. You are older, and getting better seems difficult. Your behaviors are more entrenched.  You are on palliative care for your eating disorder. Even though you know you are hurting yourself, you find a comfort in your illness. And that is the tricky part. Because to get better, you have to put up with being uncomfortable. You finally feel sick enough, but what did it get you? Your body is declining and your health is worse. You could die. Because all an eating disorder wants is to cause the person suffering and no one deserves to suffer. So if you find yourself feeling not sick enough, I am telling you that when you are in physical pain, a chronic sufferer, you will wish you had listened to people sooner when they told you to treat this earlier. We all all valid. We all deserve support and understanding. We all hurt. And we all deserve to heal, not suffer", "title": "Things to consider when you feel \"not sick enough.\"", "context": null}
{"type": "comment", "timestamp": 1723506885.0, "datetime": "2024-08-12T23:54:45", "subreddit": "AnorexiaNervosa", "id": "lhtx65z", "text": "Thank you. I am glad this post was helpful to you. I hope it helps others too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723508569.0, "datetime": "2024-08-13T00:22:49", "subreddit": "AnorexiaNervosa", "id": "lhu1qd8", "text": "You are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723511793.0, "datetime": "2024-08-13T01:16:33", "subreddit": "AnorexiaNervosa", "id": "lhuae4p", "text": "You are welcome. I am sorry for what you are going through. You are valid and you aren't alone in your struggles.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723515823.0, "datetime": "2024-08-13T02:23:43", "subreddit": "AnorexiaNervosa", "id": "lhukz4n", "text": "Thank you. It's nice to know I am not alone. SEED is hard to deal with, but I am trying to remain positive.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723517291.0, "datetime": "2024-08-13T02:48:11", "subreddit": "AnorexiaNervosa", "id": "lhuonyv", "text": "You are welcome. You are valid and you deserve support and understanding", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723518836.0, "datetime": "2024-08-13T03:13:56", "subreddit": "AnorexiaNervosa", "id": "lhuscrr", "text": "I am sorry to hear this. Your pain is valid and your health matters. You don't have to get worse to be worthy of help and support. You deserve help at any stage in your illness. I regret not getting help sooner. I hope you start feeling better. I know getting help is scary, but so is suffering health consequences", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723544744.0, "datetime": "2024-08-13T10:25:44", "subreddit": "AnorexiaNervosa", "id": "lhvzzrj", "text": "Thanks", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723576425.0, "datetime": "2024-08-13T19:13:45", "subreddit": "AnorexiaNervosa", "id": "lhygcfb", "text": "I'm sorry you are struggling right now. You are valid. Your pain matters. You deserve help and support", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725110207.0, "datetime": "2024-08-31T13:16:47", "subreddit": "AnorexiaNervosa", "id": "lktterp", "text": "Thank you:)", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1726066426.0, "datetime": "2024-09-11T14:53:46", "subreddit": "AnorexiaNervosa", "id": "1fec3xc", "text": "Thinking about these awful moments during my eating disorder helps to motivate me to do better, to not get worse. An eating disorder does not just affect the person who has the illness. It will affect everyone around you that cares about you. Even if you think they aren't paying attention, usually, if someone loves you and cares about you, no matter how hard you try to hide it, they are going to eventually notice you not eating/losing weight and say something to you. \n\n1, One of the saddest moments I can remember is when it was around my birthday and I was severely ill and had lost a lot of weight. And my mom asked me to weigh myself in front of her and then she broke down in tears when she saw how low the number was. So for the rest of the day, all I could think about was her reaction and how much my illness was hurting her. I had a difficult time enjoying my birthday because her reaction upset me and I just felt terrible for making her worry. \n\n2. When I was staying with my grandparents, I would go out jogging, every day, on this big hill. I was really sick then. My grandfather told me that every day, he wished it would rain, so that I wouldn't be able to jog and lose more weight. He started crying and told me he didn't want anything to happen to me. This reminded me that even when you think your family isn't paying attention or doesn't notice your behaviors around food and weight, they are noticing. I've never forgotten the look on my grandfather's face when he told me that. \n\n3. On a vacation to the beach with my cousin's family, I dressed in layers, oversized hoodies and jeans, during the entire trip, even when it was hot out. I had such a distorted view of my body that I didn't realize how sick I looked then. And I didn't want others to ask questions about my weight loss, so I tried to hide it. But everyone noticed my weight loss and behaviors. I took my bathroom scale on the trip. And would spend lots of time in the bathroom checking my weight on the trip. My uncle noticed I had a difficult time eating and he started asking me what he could do to help. He was very understanding and made me feel not alone. But the trip was hard to enjoy because I cared more about what the scale said at the time, instead of focusing on having fun at the beach\n\n4. Being told in inpatient treatment that I was at risk of dying at the time and that I needed to take this seriously and work on the eating disorder now. I was younger and just wasn't thinking about the future back then. It's not my fault I have an eating disorder, but it's something I think about often. I was seriously ill at the time and just kept saying to everyone that it wasn't that bad and I could handle it. I refused to listen to the people in inpatient at the time, and quickly relapsed and refused residential treatment as soon as I got out of inpatient. Then, I stayed sick for years. And never worked on getting better. I'm now realizing what a mistake that was, because now I have severe medical complications and my illness is chronic. I'm trying to get better, but it's not easy. My doctor told me to not be too hard on myself, as I didn't choose to be sick. \n\n5. Meeting a good friend in inpatient treatment, who was also anorexic. Becoming close friends with her for years, writing her letters and calling her on the phone. And then finding out later that she died from complications of her eating disorder. She was one of my closest friends and very kind. And I've never forgotten her. \n\n6. When I wasn't answering my phone one day, my dad drove to my apartment and knocked on the door, worried. I didn't realize he was worried. He said he had been trying to contact me for hours and I wasn't answering my phone. Something was wrong with my phone that day and his calls weren't showing up in  my phone. My dad, who rarely cries, broke down in tears, saying he thought I had died from my eating disorder and that's why I wasn't answering the phone. I felt so bad and tried to reassure my dad I was fine. But seeing my family cry is something that stays with me. Even if I argue with my parents sometimes about my disorder, they are always here for me. They don't always understand my eating disorder behaviors, but I know they love me a lot and would be sad if anything happened to me\n\n  \n7. When I fainted in front of my dad and he caught me in his arms and my mom ran over to me, panicking. That was really scary and I am glad my parents were there to make sure I was okay\n\n8. Being so obsessed with my scale that I had to have it with me at all times and cared more about what it said, than anything else. I've since gotten rid of my scale and my doctor said that's a great thing. But I do remember, for years, the scale was one of the most important things in my life\n\nEating disorders are not fun, or cute or enjoyable. They are painful, isolating and scary. Painful not only to the person, but everyone around them. ", "title": "Saddest/scariest moments during my anorexia", "context": null}
{"type": "comment", "timestamp": 1726095427.0, "datetime": "2024-09-11T22:57:07", "subreddit": "AnorexiaNervosa", "id": "lmoji9s", "text": "You are welcome. Remembering these moments helps me to stay motivated to get better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726098354.0, "datetime": "2024-09-11T23:45:54", "subreddit": "AnorexiaNervosa", "id": "lmor9jx", "text": "You are welcome. Yes, I used to be so attached to my scale but I am glad I am not like that anymore", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726115292.0, "datetime": "2024-09-12T04:28:12", "subreddit": "AnorexiaNervosa", "id": "lmpw34w", "text": "You are welcome. I'm glad this post was helpful to you and I hope it helps others. Eating disorders are so painful. I hope everyone that struggles with one finds the support they need and deserve", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726116314.0, "datetime": "2024-09-12T04:45:14", "subreddit": "AnorexiaNervosa", "id": "lmpy042", "text": "So true. It really does affect people around you. Thank you for the support and kind words", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726131674.0, "datetime": "2024-09-12T09:01:14", "subreddit": "AnorexiaNervosa", "id": "lmqlir4", "text": "Thank you. That means a lot", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726145734.0, "datetime": "2024-09-12T12:55:34", "subreddit": "AnorexiaNervosa", "id": "lmrbl1g", "text": "Thank you. Your pain is valid and I'm sorry you feel like your family doesn't care. So true. It's not our fault we have this illness. And recovery is difficult but not impossible", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726182071.0, "datetime": "2024-09-12T23:01:11", "subreddit": "AnorexiaNervosa", "id": "lmudcg4", "text": "I'm sorry you went through that. Eating disorders are terrible illnesses", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726182721.0, "datetime": "2024-09-12T23:12:01", "subreddit": "AnorexiaNervosa", "id": "lmuf29q", "text": "Thank you. That's kind of you to say. I'm glad my post helps people with eating disorders to not feel alone.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1726252402.0, "datetime": "2024-09-13T18:33:22", "subreddit": "AnorexiaNervosa", "id": "1fg1y9u", "text": "If you are struggling today, this is a reminder that your struggles are valid\n\nYou are valid\n\nIf you've never been hospitalized for your eating disorder\n\nIf you have been hospitalized for your eating disorder\n\nYou are valid\n\nIf you've never had a feeding tube\n\nIf you have had a feeding tube\n\nYou are valid\n\nIf you aren't experiencing severe complications from anorexia\n\nIf you are experiencing severe complications from anorexia\n\nYou are valid\n\nIf you don't have a therapist\n\nIf you do have a therapist\n\nYou are valid\n\nIf you eat mostly junk food\n\nIf you eat mostly healthy food\n\nOr if you eat a combination of both\n\nYou are valid if you have atypical anorexia nervosa\n\nYou are valid if your family has a hard time understanding your illness and doesn't really ask you about it\n\nIf your family is incredibly supportive of your struggles, and takes you to any appointments you need\n\nYou are valid if you've only been sick for a few months or a year\n\nYou are valid if you've suffered for many years and are a chronic sufferer\n\nYou are valid if you gain weight during recovery\n\nYou are valid if you lose weight through your illness\n\nYou are valid if you have other disabilities or disorders, alongside your anorexia nervosa\n\nYou are valid, even if you reach out to someone, and they dismiss how you are feeling\n\nYou are valid if inpatient treatment wasn't very helpful for you\n\nYou are valid if you've had successful inpatient treatments\n\nNo one's experience with anorexia nervosa is going to look exactly like someone else's. We are all suffering. We all have unique situations and experiences. Your thought process with this illness will be different. Your behaviors and how you respond to treatment and therapy will be different. Just because your illness looks different from another person's doesn't mean you aren't valid and you aren't suffering. We all are not supposed to have the same experiences. Because everyone is different.\n\nIf you are hurting enough to restrict your food intake, if you are sad, and if you start obsessing over your weight , you are hurting, and you don't have to prove you are hurting", "title": "Your eating disorder is valid", "context": null}
{"type": "comment", "timestamp": 1726263823.0, "datetime": "2024-09-13T21:43:43", "subreddit": "AnorexiaNervosa", "id": "lmztmlc", "text": "You are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726263862.0, "datetime": "2024-09-13T21:44:22", "subreddit": "AnorexiaNervosa", "id": "lmztqjv", "text": "I'm sorry you are going through this. Your struggles are valid and I am glad this post is helpful to you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726264529.0, "datetime": "2024-09-13T21:55:29", "subreddit": "AnorexiaNervosa", "id": "lmzvlqt", "text": "You are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726264994.0, "datetime": "2024-09-13T22:03:14", "subreddit": "AnorexiaNervosa", "id": "lmzww1v", "text": "You are welcome. I am glad it is helpful", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726270792.0, "datetime": "2024-09-13T23:39:52", "subreddit": "AnorexiaNervosa", "id": "ln0c3da", "text": "Thank you for sharing. Your struggles are valid", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726272988.0, "datetime": "2024-09-14T00:16:28", "subreddit": "AnorexiaNervosa", "id": "ln0hneo", "text": "You are welcome. Glad I could help", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726273416.0, "datetime": "2024-09-14T00:23:36", "subreddit": "AnorexiaNervosa", "id": "ln0iq3s", "text": "You are welcome. You are valid and your struggles are important. I'm glad this post is helpful to you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726275724.0, "datetime": "2024-09-14T01:02:04", "subreddit": "AnorexiaNervosa", "id": "ln0ogpo", "text": "Thanks", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726279061.0, "datetime": "2024-09-14T01:57:41", "subreddit": "AnorexiaNervosa", "id": "ln0wd89", "text": "Yes, you are still valid. Your pain is real and I am sorry you are going through this. Everyone deals with their illness in different ways. You deserve to love yourself and be at peace with your body", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726284219.0, "datetime": "2024-09-14T03:23:39", "subreddit": "AnorexiaNervosa", "id": "ln17tmo", "text": "You are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726316921.0, "datetime": "2024-09-14T12:28:41", "subreddit": "AnorexiaNervosa", "id": "ln2okex", "text": "You are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726344401.0, "datetime": "2024-09-14T20:06:41", "subreddit": "AnorexiaNervosa", "id": "ln4xxqv", "text": "Yes, it's sad when you realize how much the eating disorder consumes your thoughts. I can relate. It took me a while to break my addiction to weighing myself. But it's possible to not focus so much on the number and that's an improvement for me. I hope you get to a point where you can feel better about it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726430109.0, "datetime": "2024-09-15T19:55:09", "subreddit": "AnorexiaNervosa", "id": "lnatwbj", "text": "I am glad this post is helping you to feel understood. Your pain is valid. Your struggles are important and you deserve to be listened to", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727109620.0, "datetime": "2024-09-23T16:40:20", "subreddit": "AnorexiaNervosa", "id": "lojrolz", "text": "Anorexic people don't just eat healthy food all the time. Anorexic people can be seriously ill and still eat junk food and sweets. Not everyone with anorexia compulsively exercises. You won't behave the exact same way as another person with this disorder. I know plenty of anorexic people that like eating things like chocolate and ice cream. They are still anorexic and their struggles are still valid. You don't have to have a list of fear foods to be valid", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1727181830.0, "datetime": "2024-09-24T12:43:50", "subreddit": "AnorexiaNervosa", "id": "1fobk86", "text": "There are a lot of misconceptions about anorexia. One thing I wish other people would try to understand is that a person who suffers from anorexia is in pain, whether that is physical, mental or emotional. They did not wake up one day and choose to starve themselves. And they are not doing it to look a certain way or because of vanity. It is not about vanity. It's about being in pain and feeling bad about yourself and you don't know how to cope with it, other than to restrict your food intake and lose weight. Even if you reach a very low weight, you still feel unhappy with yourself. So I wish people who have never suffered from this illness would try to be more compassionate to those who have it. It is not an easy disorder to cure and the person going through the illness needs support and understanding, not harsh judgements and criticism. ", "title": "What is something about anorexia you wish others would try to understand?", "context": null}
{"type": "comment", "timestamp": 1727182722.0, "datetime": "2024-09-24T12:58:42", "subreddit": "AnorexiaNervosa", "id": "loomezh", "text": "So true. I wish more people would understand this as well", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727183297.0, "datetime": "2024-09-24T13:08:17", "subreddit": "AnorexiaNervosa", "id": "loonwm4", "text": "Well said", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727183933.0, "datetime": "2024-09-24T13:18:53", "subreddit": "AnorexiaNervosa", "id": "loopldf", "text": "Yes, I don't like when people say a person is anorexic because they want attention. It's so offensive", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727184125.0, "datetime": "2024-09-24T13:22:05", "subreddit": "AnorexiaNervosa", "id": "looq3ue", "text": "Yep", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727184778.0, "datetime": "2024-09-24T13:32:58", "subreddit": "AnorexiaNervosa", "id": "loorvy4", "text": "Exactly. I hate the \"eat a burger\" or \"eat a sandwich\" comments that people make.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727184930.0, "datetime": "2024-09-24T13:35:30", "subreddit": "AnorexiaNervosa", "id": "loosb09", "text": "This is a great one. I am autistic. Lots of anorexic people have autism and I wish eating disorder programs would offer more accommodations for those of us with anorexia and autism. The eating disorder programs I went to were not designed for those with autism. They didn't understand my sensory sensitivities or my anxiety about change and need for a routine. Luckily, I have a treatment team now that understands how the anorexia and autism affect each other and they don't shame me for my struggles.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727185027.0, "datetime": "2024-09-24T13:37:07", "subreddit": "AnorexiaNervosa", "id": "looskcu", "text": "So true. It doesn't cure the illness and it can actually make the person with anorexia feel worse about themselves", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727185160.0, "datetime": "2024-09-24T13:39:20", "subreddit": "AnorexiaNervosa", "id": "loosxm6", "text": "Thank you. It took a while to find the right people to help me. For a while, I was without support but I didn't give up and now I am happy that I have found the right people to help me. I hope you have support as well", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727185199.0, "datetime": "2024-09-24T13:39:59", "subreddit": "AnorexiaNervosa", "id": "loot1lp", "text": "So true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727185474.0, "datetime": "2024-09-24T13:44:34", "subreddit": "AnorexiaNervosa", "id": "loottdk", "text": "You are welcome. I am glad you have support and I am glad you found this post helpful", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727185970.0, "datetime": "2024-09-24T13:52:50", "subreddit": "AnorexiaNervosa", "id": "loov8a7", "text": "Thank you for sharing. I am sorry you had to go through all that and I am glad you are in recovery. Your struggles are valid. People can be seriously ill even when they are not severely underweight. I wish people would understand this. Eating disorders affect every person differently. And people can and do recover. But not everyone can find the support they need, and that's sad. I wish everyone that suffered from this had the help they need and deserve. No one should go through something like this on their own", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727186048.0, "datetime": "2024-09-24T13:54:08", "subreddit": "AnorexiaNervosa", "id": "loovghl", "text": "Well said. It is so important to have people in your life that validate your struggles and stand by you, through the darkest moments. It's an awful illness and no one should go through it alone", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727187454.0, "datetime": "2024-09-24T14:17:34", "subreddit": "AnorexiaNervosa", "id": "loozjp6", "text": "Yes, exactly. It's a mental illness and just because a person appears to be doing better on the outside does not mean they aren't still suffering, internally", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727188603.0, "datetime": "2024-09-24T14:36:43", "subreddit": "AnorexiaNervosa", "id": "lop30fh", "text": "Yes, the brain fog is so difficult to deal with", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727188743.0, "datetime": "2024-09-24T14:39:03", "subreddit": "AnorexiaNervosa", "id": "lop3g1w", "text": "Yes, not everyone is going to look obviously sick on the outside, but that does not mean they are not still suffering physically, mentally and emotionally. You can't always tell who suffers from an eating disorder. It won't always look obvious, but that doesn't mean the person isn't severely ill. I wish more people would realize this. Anorexia isn't a look.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727191696.0, "datetime": "2024-09-24T15:28:16", "subreddit": "AnorexiaNervosa", "id": "lopcooj", "text": "Exactly. Anorexic people still eat", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727193345.0, "datetime": "2024-09-24T15:55:45", "subreddit": "AnorexiaNervosa", "id": "lophz8l", "text": "Exactly. We don't want to be sick and we didn't choose to be sick.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727194485.0, "datetime": "2024-09-24T16:14:45", "subreddit": "AnorexiaNervosa", "id": "loplm14", "text": "Well said. I am sorry you are struggling. Your struggles are valid and I hope you start feeling better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727196427.0, "datetime": "2024-09-24T16:47:07", "subreddit": "AnorexiaNervosa", "id": "loprsew", "text": "Well said", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727197341.0, "datetime": "2024-09-24T17:02:21", "subreddit": "AnorexiaNervosa", "id": "lopuqx7", "text": "Yes, that's the truth", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727199043.0, "datetime": "2024-09-24T17:30:43", "subreddit": "AnorexiaNervosa", "id": "loq08oq", "text": "Yes, exactly. We still eat and we don't just eat salad.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727200309.0, "datetime": "2024-09-24T17:51:49", "subreddit": "AnorexiaNervosa", "id": "loq4dhr", "text": "So true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727204375.0, "datetime": "2024-09-24T18:59:35", "subreddit": "AnorexiaNervosa", "id": "loqhfu7", "text": "Well said. This is all true. Thank you for sharing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727205671.0, "datetime": "2024-09-24T19:21:11", "subreddit": "AnorexiaNervosa", "id": "loqlk1s", "text": "So true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727208755.0, "datetime": "2024-09-24T20:12:35", "subreddit": "AnorexiaNervosa", "id": "loqvhlp", "text": "So true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727210063.0, "datetime": "2024-09-24T20:34:23", "subreddit": "AnorexiaNervosa", "id": "loqznr1", "text": "Very true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727210653.0, "datetime": "2024-09-24T20:44:13", "subreddit": "AnorexiaNervosa", "id": "lor1jix", "text": "Exactly. Everyone with anorexia is different. And some people are aware that they are thin", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727214970.0, "datetime": "2024-09-24T21:56:10", "subreddit": "AnorexiaNervosa", "id": "loreoia", "text": "Well said. This is exactly what having an eating disorder feels like", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727223290.0, "datetime": "2024-09-25T00:14:50", "subreddit": "AnorexiaNervosa", "id": "los1muk", "text": "So true. No one chooses this illness", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727225027.0, "datetime": "2024-09-25T00:43:47", "subreddit": "AnorexiaNervosa", "id": "los6blo", "text": "Yes, control is a big reason why people have eating disorders", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727228431.0, "datetime": "2024-09-25T01:40:31", "subreddit": "AnorexiaNervosa", "id": "losf8o5", "text": "Yes, it causes so many complications", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727228556.0, "datetime": "2024-09-25T01:42:36", "subreddit": "AnorexiaNervosa", "id": "losfkb7", "text": "I'm sorry you have complications. I do too", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727228684.0, "datetime": "2024-09-25T01:44:44", "subreddit": "AnorexiaNervosa", "id": "losfwsl", "text": "Yes, it's so difficult to deal with. I hope you start feeling better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727232466.0, "datetime": "2024-09-25T02:47:46", "subreddit": "AnorexiaNervosa", "id": "lospjun", "text": "Well said", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727237391.0, "datetime": "2024-09-25T04:09:51", "subreddit": "AnorexiaNervosa", "id": "lot0htt", "text": "Thank you for sharing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727250045.0, "datetime": "2024-09-25T07:40:45", "subreddit": "AnorexiaNervosa", "id": "lotlqr2", "text": "I am sorry you are going through this", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727261394.0, "datetime": "2024-09-25T10:49:54", "subreddit": "AnorexiaNervosa", "id": "lou2o77", "text": "Thank you for sharing your experience. I am sorry you struggle with this", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727268927.0, "datetime": "2024-09-25T12:55:27", "subreddit": "AnorexiaNervosa", "id": "louj84l", "text": "Thank you. It's a complex illness", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727269064.0, "datetime": "2024-09-25T12:57:44", "subreddit": "AnorexiaNervosa", "id": "loujkzy", "text": "You are welcome. I am glad you found it helpful", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727282701.0, "datetime": "2024-09-25T16:45:01", "subreddit": "AnorexiaNervosa", "id": "lovovpm", "text": "Exactly, even when you are very aware of the consequences, you can have a difficult time stopping the behaviors. If anorexia had an off switch, people would be able to just stop being anorexic. But it doesn't work that way. I wish more people understood this", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727282997.0, "datetime": "2024-09-25T16:49:57", "subreddit": "AnorexiaNervosa", "id": "lovpu8d", "text": "Exactly. No one can truly know how it feels to be anorexic, unless they have been through it, themselves", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727285958.0, "datetime": "2024-09-25T17:39:18", "subreddit": "AnorexiaNervosa", "id": "lovzgmd", "text": "Well said", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727298763.0, "datetime": "2024-09-25T21:12:43", "subreddit": "AnorexiaNervosa", "id": "lox4tre", "text": "Thank you for sharing. Your struggles are valid and I am sorry you are going through this. Eating disorders affect everyone differently", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727314613.0, "datetime": "2024-09-26T01:36:53", "subreddit": "AnorexiaNervosa", "id": "loycqxw", "text": "Well said", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727875692.0, "datetime": "2024-10-02T13:28:12", "subreddit": "AnorexiaNervosa", "id": "lpz1adv", "text": "Yes, I do have insomnia. I am sorry you struggle as well", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1728486717.0, "datetime": "2024-10-09T15:11:57", "subreddit": "AnorexiaNervosa", "id": "1fztqju", "text": "When your bloodwork comes back normal, it doesn't mean everything is fine and that you aren't sick\n\nYou can't always tell who has an eating disorder, by looking at them. People with atypical anorexia aren't underweight. They are still sick and can experience medical complications. Yes, there are severely underweight anorexic people, who look visibly sick on the outside. There are also people who don't look ill on the outside, but this doesn't mean they aren't suffering. The mental pain you go through with this disorder can't be seen. Both anorexic and atypical anorexic people are suffering. \n\nRecovering can take years. Some people won't make a full recovery. Relapses after treatment are very common\n\nThere are a wide range of medical issues that anorexia can cause. Heart and bone problems are common. Other complications that don't get talked about enough are things like bladder issues, digestive issues, stomach problems, nerve damage. There are a lot more. What happens to each person varies. You won't experience the exact same health issues that another person is experiencing, even if both people are dealing with anorexia\n\nEating more food doesn't automatically mean you are cured. Anorexic people still eat.\n\nSaying \"just eat\" is counterproductive and doesn't make the person get over the illness. Saying \"I'm sorry you are struggling with eating\" is more helpful, than demanding the person eat more. This is a serious mental illness and you can't shame or scold a person out of it. \n\nThere is no \"sick enough.\" If you are experiencing mental and emotional pain, have low self esteem, and start restricting and losing weight to an unhealthy degree, that's the moment you are sick. You have nothing to prove to anyone. If you feel bad about yourself in any way, that's the moment your feelings are valid. You don't have to get worse, so more people will care. Someone cares. \n\nAnorexia isn't about trying to look a certain way or about vanity. It is an all consuming, deadly mental disorder. One with the highest mortality rate of any mental illness. People who have this illness are suffering. They aren't choosing to starve themselves. They have an illness. An illness that takes therapy, support from family and treatment to overcome. Even when you go through treatment for this illness, you can find it very difficult and you can relapse. \n\nNot all treatments for anorexia are helpful. Not all anorexic people want to be treated with inpatient treatment. Some people have chronic anorexia and complex situations. Some people have other disorders or disabilities, alongside anorexia, and typical anorexia treatments won't be helpful for them. This is why you should have treatment tailored to fit your needs. And a treatment team that listens, but doesn't pressure you or try to put you in a box. You won't have the exact needs as another anorexic person. If you have other disorders or disabilities that complicate your efforts at recovering, then your treatment team should make adjustments for you. No one should be given up on or made to go through this alone. Even if you have suffered for years and have a hard time thinking about what your life would be like without this disorder, you deserve support and understanding\n\nIf you are younger and just found out you have anorexia, I hope you have support around you\n\nIf you are older and have dealt with this disorder for years and are considered chronic, I hope you have support around you\n\nYou are not a burden. You are not a failure. You are not too difficult\n\nWe all deserve to be at peace with ourselves. \n\n\n\n", "title": "Things I wish more people knew about anorexia", "context": null}
{"type": "comment", "timestamp": 1728490912.0, "datetime": "2024-10-09T16:21:52", "subreddit": "AnorexiaNervosa", "id": "lr41fdf", "text": "You are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728496508.0, "datetime": "2024-10-09T17:55:08", "subreddit": "AnorexiaNervosa", "id": "lr4j17s", "text": "Well said. Being treated against your will is so distressing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728514282.0, "datetime": "2024-10-09T22:51:22", "subreddit": "AnorexiaNervosa", "id": "lr60xkk", "text": "So true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728521727.0, "datetime": "2024-10-10T00:55:27", "subreddit": "AnorexiaNervosa", "id": "lr6kshl", "text": "Well said", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728561600.0, "datetime": "2024-10-10T12:00:00", "subreddit": "AnorexiaNervosa", "id": "lr8m7fn", "text": "Thank you for sharing. These are very true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728561634.0, "datetime": "2024-10-10T12:00:34", "subreddit": "AnorexiaNervosa", "id": "lr8m9zw", "text": "You are welcome. I am glad this post was helpful to you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728616735.0, "datetime": "2024-10-11T03:18:55", "subreddit": "AnorexiaNervosa", "id": "lrcxwy4", "text": "You are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728678438.0, "datetime": "2024-10-11T20:27:18", "subreddit": "AnorexiaNervosa", "id": "lrgtyum", "text": "All valid points. Thank you for sharing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728693605.0, "datetime": "2024-10-12T00:40:05", "subreddit": "AnorexiaNervosa", "id": "lrhxsam", "text": "Thank you for sharing", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1729692875.0, "datetime": "2024-10-23T14:14:35", "subreddit": "AnorexiaNervosa", "id": "1gablcz", "text": "Anorexia nervosa is a difficult disorder to live with\n\nIt's not easy for others to understand\n\nThere are a lot of misconceptions about it. It's not an illness that can be cured by demanding the person eat more\n\nJust because the person eats more food, doesn't mean the illness in their mind is cured or has gone away\n\nMany people have chronic anorexia and have a hard time fully recovering\n\nAnorexic people still eat\n\nWe don't always eat health food or salads\n\nWe can eat junk food and sweets. We can like the taste of ice cream and chocolate\n\nAnorexia is a mental illness. It's not about the types of food you eat.\n\nAtypical anorexia is a serious disorder. But because people with atypical anorexia are not severely underweight, they don't always get the help they need or the support they need\n\nThere are many severely ill people who do not look severely ill\n\nThere are very underweight anorexic people. The ones who when you first glance at them, you know they have an illness.\n\nBut not everyone is going to look severely emaciated.\n\nSome people with anorexia have never had a feeding tube or stayed in an inpatient facility\n\nYou can still die from anorexia. At any weight, because it causes damage to your body\n\nEven if you stay in an inpatient facility, even if it gets so bad to where you need to use a feeding tube, even if you lose so much weight that you are constantly freezing, and even if people start worrying over you and asking you to eat more\n\nIt will never be enough\n\nThe ed will never be satisfied\n\nAs soon as you reach the number you have in your head, you will change your mind\n\nAnd go even lower\n\nBut no matter how low the number goes, you are never going to be truly happy\n\nAt my worst, I hid my body in oversized sweaters. I would use a heavy blanket or stand near a heater, in summertime, because I couldn't stay warm\n\nI'm not happy about being underweight. I didn't reach a low weight and go \"This has made me feel better.\"\n\nIt didn't make me feel better\n\nBefore anorexia, I was a naturally skinny person. A naturally healthy weight. I had a body that I never felt bad about. I liked myself. I had no problem with the way I looked before anorexia. I would wake up in the morning and fix my hair and put on a nice outfit and go on with my day\n\nI struggled with social anxiety and depression before I was anorexic. People in school were mean to me. I was bullied for being quiet and had a hard time making friends in school\n\nNever once thought about losing weight while growing up though. Not as a child. Not as a teenager. It just wasn't something I focused on.\n\nAll that changed, when I stood on the scale one day. Got intensely focused on the number and decided I wanted it to be lower\n\nIt made me into a different person. But I didn't choose my disorder. No one chooses anorexia. It just happens. My reason was because I was feeling anxious and controlling my weight/food intake relieved some of the anxiety and depression I felt. But only temporarily\n\nI found that losing more weight actually made me more depressed. It made me more obsessive. It made me stop focusing on certain things\n\nAll my time, energy and thoughts were devoted to checking the scale. Seeing the number\n\nYet no matter how low it went, I still felt sad\n\nEven when I almost died from anorexia, I didn't feel happy. Even when I almost got a feeding tube, I didn't feel sick enough. Even when my mom would cry when she would notice how much weight I was losing\n\nEven when I got multiple warnings from doctors that anorexia is serious and I needed treatment, I just wouldn't listen\n\nWe all go through different experiences with this disorder. We all have our reasons for falling into it. We don't choose it. And we aren't happy about it\n\nSome people make a fully recovery. Some do not\n\nSome people will look visibly sick. Even if you look visibly sick, you won't feel good about yourself. The number takes up a lot of your time. Is it the right number?\n\nWhat is the right or correct number? The truth is there is no right or correct or perfect number\n\nI am more than a number. Even when my eating disorder is shouting at me to restrict, lose more weight, to hurt myself more\n\nYou are more than a number and you deserve more than being consumed with thoughts about food, your body and your weight\n\nI wish people who have never suffered from this illness would feel more empathy for those who struggle. If someone with anorexia is having a difficult time completing their meal in inpatient treatment, scolding them or shaming them isn't going to help them\n\nCompassion is what people with anorexia need. Even if you don't understand everything about the disorder, it always helps to be compassionate. We often have a hard time showing ourselves the love and compassion we deserve. And when others around us treat us like our illness is a choice, or like we can simply get over it if we just eat more, it really doesn't help.\n\nAnorexia doesn't have an off switch. You can't just turn it off if you get tired of it\n\nThat's why learning and being understanding about this illness, and being patient with the person suffering, is so important", "title": "I wish people who do not have anorexia would be more sympathetic to those who suffer from it", "context": null}
{"type": "comment", "timestamp": 1729710764.0, "datetime": "2024-10-23T19:12:44", "subreddit": "AnorexiaNervosa", "id": "lte12k0", "text": "Yes, it's a complex illness and not easy to treat.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729715640.0, "datetime": "2024-10-23T20:34:00", "subreddit": "AnorexiaNervosa", "id": "ltehbnd", "text": "Well said", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729726430.0, "datetime": "2024-10-23T23:33:50", "subreddit": "AnorexiaNervosa", "id": "ltfe9qr", "text": "Thank you. I am glad you like the post", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729740233.0, "datetime": "2024-10-24T03:23:53", "subreddit": "AnorexiaNervosa", "id": "ltgg0t8", "text": "So true. People say \"Just eat\" and think it's that simple or that easy to be solved.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1731509309.0, "datetime": "2024-11-13T14:48:29", "subreddit": "AnorexiaNervosa", "id": "1gqej0s", "text": "Anorexia nervosa is not a diet. It's not a weight loss method. It's a devastating mental illness. It is not about being superficial, or trying to look a certain way. It's about being in extreme mental and emotional pain, feeling uncomfortable and not knowing how to cope with those feelings. It's not something you choose to do. Everyone develops the illness for different reasons. Everyone struggles in different ways. At first, you start off wanting to lose a few pounds. You get locked into the habit of constantly checking your weight. You see the number on the scale go down, and yet, you are never satisfied. For some reason, when you reach one number, you set the goal lower. And you keep losing weight. And that is why it is unhelpful to shame or scold a person with an eating disorder and demand they eat more. It is not that easy. And because it's a mental illness, it takes lots of support and treatment to overcome it. Even with treatment, many people with anorexia wind up relapsing. It is often a very isolating disorder. I think a person has to be very unhappy in order to continue to starve themselves. But no one chooses this disorder. It can cause severe medical complications. And it has one of the highest mortality rates of any mental illness. Even though I now experience painful and severe complications from my disorder, I find it very difficult to fully recover. Everyone has their own definition of what recovery looks like. Some people find inpatient treatment helpful and some people recover quickly. And some people are chronic sufferers and will struggle with this disorder for years. There is one thing we all have in common. Everyone with this disorder is hurting, mentally, emotionally, physically. No number will ever be good enough. No number is perfect. Reaching a certain number won't suddenly make you a happier person. Whatever was driving you to starve yourself at the beginning, will not suddenly go away, because you become sicker. For me, focusing so much on losing weight just made me more obsessive. I miss the days where I woke up and didn't think about or worry about my weight or the number on the scale. But those days seem so far away now, like a distant memory. I was happier before I was anorexic. I became more depressed, with the more weight I lost. Yet, I still can't let go of my disorder, even though it's caused me awful medical issues and pain. Whatever the person's reasons are for starving themselves, they aren't choosing it. And I wish people who have never experienced anorexia for themselves, wouldn't be so quick to judge those who suffer from it. What people with anorexia need is compassion and understanding. The illness already makes the person feel alone. Shaming them for something they didn't choose to develop is never the answer. This illness isn't your fault", "title": "The reality of anorexia nervosa", "context": null}
{"type": "comment", "timestamp": 1731509639.0, "datetime": "2024-11-13T14:53:59", "subreddit": "AnorexiaNervosa", "id": "lwxa616", "text": "Thanks", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731510888.0, "datetime": "2024-11-13T15:14:48", "subreddit": "AnorexiaNervosa", "id": "lwxdwcf", "text": "Thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731516933.0, "datetime": "2024-11-13T16:55:33", "subreddit": "AnorexiaNervosa", "id": "lwxx97h", "text": "Well said. It's not easy to stop and it's such a complex and painful disorder. No one chooses it. It really is such a painful thing to suffer from and a lot of people wonder why the person doesn't just simply get over it. But it's not easy at all to get better from anorexia. It's so much more than just wanting to lose weight. I think it's about being terribly unhappy and you just don't know any other way to cope with those feelings", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731517952.0, "datetime": "2024-11-13T17:12:32", "subreddit": "AnorexiaNervosa", "id": "lwy0log", "text": "Yes, that is true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731552951.0, "datetime": "2024-11-14T02:55:51", "subreddit": "AnorexiaNervosa", "id": "lx10iyn", "text": "I'm sorry you are in pain. Eating disorders are difficult disorders to have", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1741740715.0, "datetime": "2025-03-12T00:51:55", "subreddit": "AnorexiaNervosa", "id": "mhb2ozp", "text": "Thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1741985343.0, "datetime": "2025-03-14T20:49:03", "subreddit": "AnorexiaNervosa", "id": "mht9ek7", "text": "Thank you. I appreciate the support", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1743629827.0, "datetime": "2025-04-02T21:37:07", "subreddit": "AnorexiaNervosa", "id": "1jq0lqf", "text": "When I first became sick, I denied there was a problem. I pushed away help. I became very secretive. When people tried to get me to eat more or asked me about my weight, I said I was fine and nothing was wrong. This line of thinking quickly changes as soon as you start to feel the affects of this disorder. It starts off with wanting to lose weight. Everyone has a reason that the illness starts. Then you start obsessing over it. So it no longer becomes something that you can just stop. Soon the number is all you think about. You start feeling cold, feeling weak, and become afraid of gaining weight. And in the back of your mind, you know it's unhealthy. But you have a hard time time stopping the behavior. When I ended up in the hospital for anorexia, I pushed away the help. I didn't think I needed to be there. So I just would not listen to people when they were telling me this is serious and to treat it early. I was stubborn and deep in my disorder. This was when I had only been anorexic for two years. So it wasn't chronic at that point. I was younger and just not considering the future and the consequences of not treating this. While in the hospital, I was very anxious and afraid. It was probably one of the most difficult times in my life.  What made it easier was the other people there who were also dealing with eating disorders. It made me feel not alone. I went through two hospitalizations for anorexia. They told me I had osteoporosis. They wanted me to go to residential treatment. I just did not listen. And after I got out of the hospital, I went right back to losing weight. This is where my behaviors started to become more entrenched. I tried outpatient therapy a few times. However, I never stuck to outpatient treatment. And my disorder became more severe. Years later, I have severe and enduring anorexia. I have never reached a point in my illness where I managed to fully recover. And I feel a sense of sadness and regret that I did not listen to my treatment team years ago. However, it is not my fault I developed this disorder. Now I suffer from very severe medical complications as a result of prolonged malnutrition. I was unaware these complications could happen as a result of starvation. My body can no longer absorb the nutrients properly from the food I eat. This means I lose weight without trying and have a difficult time gaining weight. When I attempt to eat more, I get stomach pain and digestive issues, and feel hunger after eating. And it makes gaining weight difficult. I also have painful and frequent urination, which I have been unable to successfully treat.  The pain has made me more stressed and anxious. And when I get stressed and anxious, I have a hard time motivating myself to stick to treatment. So I am essentially staying at home a lot, in severe pain from these symptoms. It makes me feel like I can't go out and do things, and that will affect a person's mental health. And the pain never stops. Along with these complications, I feel tired and have become more depressed. My treatment team includes a therapist, a doctor and a nutritionist. However, I am very rigid in my thinking and have autism, along with the anorexia nervosa. I have sensory issues around eating and difficulty adjusting to new routines. This is likely why inpatient treatment was so difficult for me. When someone on my treatment team recommends I try something to make myself feel better, I do not always follow through with what they are asking me to do. I do not like change and have fear around it. But a part of me knows that in order to get better from something like anorexia, you have to accept certain changes. I know there are treatment programs out there for those with severe and enduring anorexia and autism. This is an awful disorder. It not only causes pain to the person who is going through it, but to everyone who cares about them. My parents are very supportive and help me with things, but even after I have struggled with this for a long time, they do not always understand my eating disorder and why it is so hard for me to recover from it. Everyone who has this disorder deserves support and understanding. It is not your fault that you have this illness. If I could go back in time, I would have treated this sooner, before it became worse. But I know I can't change the past. I don't want to be in constant pain and I want to feel better. While anorexia is a difficult illness to have, there are people who care and want to help you get through it", "title": "The consequences of untreated anorexia nervosa", "context": null}
{"type": "comment", "timestamp": 1743650954.0, "datetime": "2025-04-03T03:29:14", "subreddit": "AnorexiaNervosa", "id": "ml55s6h", "text": "You are welcome. Thank you for the kind words. It's important to remain positive, even when things are difficult", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743694632.0, "datetime": "2025-04-03T15:37:12", "subreddit": "AnorexiaNervosa", "id": "ml7sv9m", "text": "Thank you for the advice", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743794400.0, "datetime": "2025-04-04T19:20:00", "subreddit": "AnorexiaNervosa", "id": "mlfae3k", "text": "Thank you for sharing and I am sorry for what you are going through. It's a tough disorder to have. It really causes so much pain to the person going through it. I wish I had listened when people told me to treat this early, but I didn't. However, I am trying to remain positive, even if I suffer medical complications from this illness. Although some days, it's really difficult because pain will affect your mental health. But I try remain optimistic that I can feel better and push through it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743977847.0, "datetime": "2025-04-06T22:17:27", "subreddit": "AnorexiaNervosa", "id": "mlrr50p", "text": "Thank you. I appreciate the kind words. I'm glad this post has helped you fight this disorder. It's not an easy illness to go through. It means a lot that my story has helped you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744246521.0, "datetime": "2025-04-10T00:55:21", "subreddit": "AnorexiaNervosa", "id": "mmb87pl", "text": "Yes, once I got to my lowest weight, nobody could convince me to eat more or gain above the number I decided I wanted to weigh. Looking back, I now see I was at a weight that could have been fatal, but at the time, I could not see that", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1744402027.0, "datetime": "2025-04-11T20:07:07", "subreddit": "AnorexiaNervosa", "id": "1jwz93n", "text": "This disorder can cause so many medical complications. It can cause osteoporosis and bone loss. It can cause heart problems. And it can cause digestive issues and organ damage. I just did not realize that starving myself for years would cause such complex health issues. Because of chronic and untreated anorexia nervosa, my medical complications are hard to treat and really painful. Very early on in my disorder, it caused health issues. But because I was younger and went to treatment early, they were able to be reversed. But I never fully recovered after my inpatient treatments, meaning I did not do what they wanted me to do. I did not fully restore weight, I did not attend residential or outpatient treatment, and I did not continue to get treatment after leaving inpatient. Years later, I have severe and enduring anorexia. And it's affected my health in a lot of ways. One thing I didn't realize this illness could cause was that it can affect the way your body processes and absorbs nutrients from the food you eat. My doctor told me because I have starved myself for years, this has made it harder for me to eat and gain weight. When my body was healthier, I was able to eat and put on weight if I wanted. Now when I eat, it hurts my stomach, I get digestive issues, experience hunger after eating and notice that it's hard to get my weight up. The weight loss I experience now isn't intentional. Anorexia can cause GI issues but I wasn't aware it could be this bad. I get different answers from people. I've been told this is what happens when the illness is progressing towards end stage and the body can't handle food the way it used to. This illness is also affecting my bladder, something I never thought about when I was younger. I experience very painful and frequent urination, which is affecting my quality of life and basically keeps me staying at home a lot. It's the worst pain I've ever felt. Because of the pain I experience because of these symptoms, it's made me more depressed. I'm on palliative care for my anorexia. I am also being treated with outpatient treatment, but because my medical issues are so severe, I have not been able to find any relief from them. But if I could go back in time, I would have listened when people were telling me that this is a serious disorder and when left untreated, it can cause severe complications. I don't want to get worse. And I hope I can find a way to start feeling better. I may have to live with side effects from long term anorexia. I also have discomfort with the idea of being treated in a hospital type setting. I feel embarrassed about my symptoms and also struggle with the need for a routine, due to being autistic. And so whenever someone suggests that inpatient may be helpful, I remember how traumatizing my last treatments were and simply don't want to go through that again. I see a doctor, therapist and nutritionist, but I've been told my symptoms are too severe and they simply won't improve with just outpatient. But the idea of inpatient makes me so anxious. I wish there were more treatment options for complex health issues. And more options, in general, for those who are both autistic and anorexic. While no treatment is perfect, I face extra challenges because my brain responds differently to therapy and treatment, because of autism. Things like group therapy, new environments and new routines give me a lot of anxiety, and that's likely why I was never able to adjust to inpatient treatment. I've never been to residential but I think I would have a difficult time with it.", "title": "Medical complications I didn't think could happen because of anorexia", "context": null}
{"type": "comment", "timestamp": 1744404496.0, "datetime": "2025-04-11T20:48:16", "subreddit": "AnorexiaNervosa", "id": "mmmlfwh", "text": "You are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744405879.0, "datetime": "2025-04-11T21:11:19", "subreddit": "AnorexiaNervosa", "id": "mmmpt5q", "text": "Thank you for sharing. This is an awful disorder and it can cause so many medical issues.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744406721.0, "datetime": "2025-04-11T21:25:21", "subreddit": "AnorexiaNervosa", "id": "mmmsdta", "text": "Exactly. You never think it will happen to you, until it does", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744406878.0, "datetime": "2025-04-11T21:27:58", "subreddit": "AnorexiaNervosa", "id": "mmmsuzk", "text": "Thank you. I am sorry you have health complications too. These things need to be talked about more, for sure", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744407162.0, "datetime": "2025-04-11T21:32:42", "subreddit": "AnorexiaNervosa", "id": "mmmtpzw", "text": "Thank you for sharing and I am sorry you are experiencing this", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744408716.0, "datetime": "2025-04-11T21:58:36", "subreddit": "AnorexiaNervosa", "id": "mmmydf4", "text": "Thank you for sharing what you've gone through. This disorder causes so many health issues. Yes, this disorder will make everything in life so much more difficult. I dislike how it gets romanticized too. There's nothing glamorous about it. It slowly takes away so much away from the person going through it. I have a pretty good support system around me which keeps me from feeling alone. But it's really an all consuming disorder. I wish I could go back in time and talk to my younger self. I'm trying to stay positive, but some days, it's not easy. I hope we can both start to feel better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744409409.0, "datetime": "2025-04-11T22:10:09", "subreddit": "AnorexiaNervosa", "id": "mmn0e9u", "text": "Thank you. I appreciate the support", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744409806.0, "datetime": "2025-04-11T22:16:46", "subreddit": "AnorexiaNervosa", "id": "mmn1jhd", "text": "You are welcome. I'm sorry you are having a difficult time also.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744411081.0, "datetime": "2025-04-11T22:38:01", "subreddit": "AnorexiaNervosa", "id": "mmn54gv", "text": "Thank you for sharing what you are dealing with and I hope you start feeling better. Yes, anorexia will so many things worse", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744411160.0, "datetime": "2025-04-11T22:39:20", "subreddit": "AnorexiaNervosa", "id": "mmn5c88", "text": "Thank you for sharing what you are experiencing and I hope you start feeling better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744411638.0, "datetime": "2025-04-11T22:47:18", "subreddit": "AnorexiaNervosa", "id": "mmn6nz3", "text": "Yes, this is a deadly disorder and hard to treat. Thank you for sharing your experience. Inpatient was difficult for me too. I wish there was an easy fix for it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744412060.0, "datetime": "2025-04-11T22:54:20", "subreddit": "AnorexiaNervosa", "id": "mmn7v50", "text": "Thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744412922.0, "datetime": "2025-04-11T23:08:42", "subreddit": "AnorexiaNervosa", "id": "mmnaayg", "text": "Yes, this is an awful disorder. I'm sorry for all that you have gone through. I hope people see my post and reach out for help.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744413577.0, "datetime": "2025-04-11T23:19:37", "subreddit": "AnorexiaNervosa", "id": "mmnc4qu", "text": "Thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744414113.0, "datetime": "2025-04-11T23:28:33", "subreddit": "AnorexiaNervosa", "id": "mmndluk", "text": "Well said", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744416717.0, "datetime": "2025-04-12T00:11:57", "subreddit": "AnorexiaNervosa", "id": "mmnkpvj", "text": "Thank you. Well said. Inpatient can be so stressful for people with anorexia and autism. I'm sorry you have bladder issues and chronic pain too. It's so difficult to deal with.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744418240.0, "datetime": "2025-04-12T00:37:20", "subreddit": "AnorexiaNervosa", "id": "mmnopy6", "text": "I understand. I have sensory issues and certain textures and tastes bother me, but no one in inpatient took the time to understand this. I felt like I was being punished or like I was just overreacting.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744418839.0, "datetime": "2025-04-12T00:47:19", "subreddit": "AnorexiaNervosa", "id": "mmnqa86", "text": "Thank you for sharing. Eating disorders take away so much and give nothing in return. I regret not getting help sooner.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744419609.0, "datetime": "2025-04-12T01:00:09", "subreddit": "AnorexiaNervosa", "id": "mmnsb4e", "text": "Thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744471794.0, "datetime": "2025-04-12T15:29:54", "subreddit": "AnorexiaNervosa", "id": "mmqvvvm", "text": "Thank you for the info", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744471824.0, "datetime": "2025-04-12T15:30:24", "subreddit": "AnorexiaNervosa", "id": "mmqvz96", "text": "Yes, it's awful. I am glad my post is helping others", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744472830.0, "datetime": "2025-04-12T15:47:10", "subreddit": "AnorexiaNervosa", "id": "mmqz78j", "text": "I actually feel cold all the time, even in warm weather. I wish I could give you some advice, but I've never experienced feeling too hot. I would suggest you ask a medical professional", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744473041.0, "datetime": "2025-04-12T15:50:41", "subreddit": "AnorexiaNervosa", "id": "mmqzvmh", "text": "Thank you for sharing and I am sorry you are going through this. Yes, I am afraid some of my medical issues can't be fixed, so I am right there with you. My inpatients never helped me either. I know it helps some people, but i always found inpatient so stressful and that they did very little in addressing why I have so much anxiety around eating. I think recovering from anorexia takes more than inpatient treatment. I think it takes an entire treatment team that you have when you are back home. But inpatient can work for medical stability", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744473911.0, "datetime": "2025-04-12T16:05:11", "subreddit": "AnorexiaNervosa", "id": "mmr2opl", "text": "I've never heard of it before either. Perhaps you can do more research on it. Try to find a doctor that specializes in anorexia and has knowledge about this disorder.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744475195.0, "datetime": "2025-04-12T16:26:35", "subreddit": "AnorexiaNervosa", "id": "mmr6rjq", "text": "I am sorry to hear this. I wish I could give you some advice, but I don't have any. But I understand how frustrating that can be", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744475350.0, "datetime": "2025-04-12T16:29:10", "subreddit": "AnorexiaNervosa", "id": "mmr791r", "text": "I wish I had an answer for you, but I've never done any research on this symptom. But if it keeps bothering you, then keep reaching out to doctors or a therapist.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744475482.0, "datetime": "2025-04-12T16:31:22", "subreddit": "AnorexiaNervosa", "id": "mmr7o3g", "text": "Thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744475545.0, "datetime": "2025-04-12T16:32:25", "subreddit": "AnorexiaNervosa", "id": "mmr7vae", "text": "Thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1744495625.0, "datetime": "2025-04-12T22:07:05", "subreddit": "AnorexiaNervosa", "id": "1jxspd7", "text": "Your goal weight will never be enough and you will want to set it lower. You will never be satisfied. No number you reach will bring you happiness\n\nYou never stop thinking about what you are going to eat that day or your weight. You can't switch off the disorder once you get tired of it. \n\nSooner or later, people in your life will notice a change in your health and behavior and say something to you or express concern, even encouraging you to get treatment.\n\nIt's not glamorous. The side effects are awful. One of the worst side effects of anorexia I have now is the fact that it's messed up my bladder so badly that I experience painful and frequent urination. The pain is constant and so far, I have not been able to find treatment for this symptom. This symptom keeps me staying at home. It's also worsened my depression and anxiety. But I had no idea anorexia could cause bladder issues. I would encourage people to read more about anorexia and bladder issues, because when I was younger, I didn't know about this side effect. Malnutrition will affect your body in ways you don't always think about, until it happens to you\n\nAnorexia has the highest mortality rate of any mental illness. Whether you have had the disorder for a few years or 18 years, it's deadly and requires treatment\n\nYou don't have to be hospitalized to be suffering greatly. There are people who have severe anorexia who aren't in a hospital. It's just not something that everyone finds helpful. At the time of my last hospitalizations, which were years ago, I had a few medical issues but they weren't painful. And as soon as I began the refeeding process, they went away. But my obsession with losing weight did not and only grew worse. Not every person with anorexia wants to be hospitalized. Even though my medical complications are worse now than before, the idea of going back to inpatient causes me a great deal of anxiety. \n\nYou don't have to have a feeding tube to be considered sick enough. I've never had one and the idea of having one scares me. If you are starving yourself and worrying constantly over what you can and cannot eat, you are sick. You don't have to prove anything to anyone. If you are suffering, you are suffering. You don't have to get to a certain weight or wind up with a feeding tube to be considered ill. Everyone with this illness experiences it differently and hurts in their own ways. \n\nEven if you go through inpatient treatment and years of therapy, you may still find yourself struggling with disordered thoughts and behaviors. While some people will make a full recovery from this, other people will become chronic and find it hard to let go of the illness completely\n\nRecovery can take years, and relapse after getting treatment is common. This is not an easy disorder to cure. \n\nEating more food doesn't just make the illness go away. \n\nPeople who suffer from this disorder aren't being vain and it's not just about being skinny or wanting to look a certain way. It's a devastating mental illness that affects everything in the person's life and everyone who cares about that person. It's not a weight loss method or a diet. It is a dangerous disorder which requires support from a team of people who know how to treat it\n\nIt is common for a person suffering from anorexia to be in denial at the beginning of their disorder. But eventually, the person recognizes they have a problem. But asking a person with anorexia to \"just eat\" is not helpful and won't cure them. \n\n", "title": "The harsh truth about being anorexic", "context": null}
{"type": "comment", "timestamp": 1744498850.0, "datetime": "2025-04-12T23:00:50", "subreddit": "AnorexiaNervosa", "id": "mmt5x9k", "text": "You are welcome. Thank you for the kind words", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744500114.0, "datetime": "2025-04-12T23:21:54", "subreddit": "AnorexiaNervosa", "id": "mmt9cdq", "text": "Thank you for sharing. It's such a difficult thing to deal with and hard to treat", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744506965.0, "datetime": "2025-04-13T01:16:05", "subreddit": "AnorexiaNervosa", "id": "mmtqx3u", "text": "You are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744513245.0, "datetime": "2025-04-13T03:00:45", "subreddit": "AnorexiaNervosa", "id": "mmu6c0l", "text": "Thank you for sharing. Anorexia is a painful illness. I'm sorry you deal with complications too", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744516591.0, "datetime": "2025-04-13T03:56:31", "subreddit": "AnorexiaNervosa", "id": "mmudy13", "text": "Thank you. Yes, anorexia can cause painful bladder issues. I had no idea anorexia could cause damage to the bladder. It's an awful symptom and I am sorry you are experiencing it too", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744549592.0, "datetime": "2025-04-13T13:06:32", "subreddit": "AnorexiaNervosa", "id": "mmw1eah", "text": "Thank you for sharing. I appreciate the support", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744549706.0, "datetime": "2025-04-13T13:08:26", "subreddit": "AnorexiaNervosa", "id": "mmw1okd", "text": "Thank you for the info", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744554088.0, "datetime": "2025-04-13T14:21:28", "subreddit": "AnorexiaNervosa", "id": "mmwdx5r", "text": "My care team thinks it's the effects of long term malnutrition", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744572123.0, "datetime": "2025-04-13T19:22:03", "subreddit": "AnorexiaNervosa", "id": "mmxzfhv", "text": "Thank you. So true. It's a very damaging illness and I am sorry for what you have gone through as well.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744582736.0, "datetime": "2025-04-13T22:18:56", "subreddit": "AnorexiaNervosa", "id": "mmyvqmg", "text": "Yes, it's very difficult to deal with", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1744588939.0, "datetime": "2025-04-14T00:02:19", "subreddit": "AnorexiaNervosa", "id": "1jylppe", "text": "There are a lot of misconceptions about anorexia. Here are the ones that stand out to me the most\n\n1. That inpatient treatment will help everyone or cure the disorder. Inpatient helps some people, but ends up traumatizing others or simply doesn't help with the anorexia. I still have awful memories of my inpatient experiences.\n2. That all people have to do to get better is eat more. Anorexia is a serious disorder that a person doesn't choose. And they can't simply turn off the thoughts and behaviors. It requires treatment and support to improve\n3. That anorexic people only eat healthy foods. You can be anorexic and eat sweets and carbs. People don't just eat salad all the time\n4. There are a lot of medical complications that can occur. Most people hear about how the illness affects your heart and bones. But these aren't the only health issues that can happen. Anorexia can also cause nerve damage, bladder incontinence and urgency, and damage your digestive system, affecting the person's ability to absorb nutrients from the food you eat.\n5. Treatment resistance is really common. And most people who are sick often don't just get treatment because you ask them to. It's common to be unsure if you want help or anxious when the topic of treatment is discussed\n6. Recovery doesn't instantly occur because you reach a certain weight or because you become medically stable. Even after treatment, a person can still be struggling with anorexic thoughts and behaviors. And people can relapse. For some, recovery can take years\n7. When you have severe and enduring anorexia, the behaviors are more entrenched and the person didn't choose to be sick for a long time. At this point, the person needs specialized treatment. But not all anorexia treatments are set up to handle complex and long lasting anorexia. Treatment needs to be tailored to fit the person's needs. While not every person will be able to let go of the illness completely, you still deserve support and understanding\n8. That anorexia only happens to younger people. Anorexia affects older people too\n9. Anorexia is not about just weight loss. It's about feeling bad about yourself and not knowing how to cope those feelings. There is no weight loss or number that will bring happiness. A person with anorexia often has depression or anxiety, and these feelings won't just disappear because you lose more weight\n10. There is no sick enough. If you are obsessing over your weight and food intake, you are sick. Everyone experiences the disorder differently. Everyone has different health complications and different reactions to treatment. Just because another person has different symptoms or health issues from you doesn't mean they are suffering more. Every person with anorexia is suffering in their own way.", "title": "Misconceptions about anorexia nervosa", "context": null}
{"type": "comment", "timestamp": 1744589439.0, "datetime": "2025-04-14T00:10:39", "subreddit": "AnorexiaNervosa", "id": "mmze6yy", "text": "Thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744589737.0, "datetime": "2025-04-14T00:15:37", "subreddit": "AnorexiaNervosa", "id": "mmzeyyl", "text": "Thank you. Yes, there are so many misconceptions", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744593457.0, "datetime": "2025-04-14T01:17:37", "subreddit": "AnorexiaNervosa", "id": "mmzonpg", "text": "Very true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744635982.0, "datetime": "2025-04-14T13:06:22", "subreddit": "AnorexiaNervosa", "id": "mn206bz", "text": "Thanks for sharing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744640545.0, "datetime": "2025-04-14T14:22:25", "subreddit": "AnorexiaNervosa", "id": "mn2dhgk", "text": "Thank you for sharing. Yes, this is a very addictive disorder and I hope everyone struggling with it has some type of support around them", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744649817.0, "datetime": "2025-04-14T16:56:57", "subreddit": "AnorexiaNervosa", "id": "mn37zzz", "text": "You are welcome and thank you for sharing. Whatever you decide, I hope it goes well for you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744650448.0, "datetime": "2025-04-14T17:07:28", "subreddit": "AnorexiaNervosa", "id": "mn3a4r2", "text": "Thank you for the kind words. I've explained my fears around inpatient to my care team and they are very understanding. I am currently looking into an online outpatient program so I don't have to go inpatient. I have a lot of anxiety around hospital type settings and am trying to do the least restrictive setting possible. But my medical issues are severe so it's a complex situation. I also wish there were more places set up for autistic people. My therapist and nutritionist understand how my autism can complicate the eating disorder. My doctor isn't specialized in eating disorders, so she can only check labs and give me basic advice on how to handle my illness. It's hard accessing specialized care where I live. Some days are more difficult than others, but I am trying to remain positive", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744675781.0, "datetime": "2025-04-15T00:09:41", "subreddit": "AnorexiaNervosa", "id": "mn5iawv", "text": "Very true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744681565.0, "datetime": "2025-04-15T01:46:05", "subreddit": "AnorexiaNervosa", "id": "mn5ydso", "text": "Well said. Thank you for sharing and I am happy you are doing better now", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744731324.0, "datetime": "2025-04-15T15:35:24", "subreddit": "AnorexiaNervosa", "id": "mn8z7h1", "text": "You are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744856492.0, "datetime": "2025-04-17T02:21:32", "subreddit": "AnorexiaNervosa", "id": "mnioj0u", "text": "This is a good one. Thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744862725.0, "datetime": "2025-04-17T04:05:25", "subreddit": "AnorexiaNervosa", "id": "mnj3thi", "text": "I am glad this post is helpful. I think you should keep trying with the outpatient treatment, and if you feel it isn't helping, then reach out to your care team. You deserve to feel better. I can understand how an illness like anorexia wants to convince you that you aren't sick enough, but you deserve support. And you aren't alone in feeling the way you feel. I also have times where I feel like I can't stick to treatment. But I am still going to all my appointments. It's a tough illness to fight. I wish I could provide more helpful advice, but I just want to say your feelings are valid", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744904427.0, "datetime": "2025-04-17T15:40:27", "subreddit": "AnorexiaNervosa", "id": "mnlofmn", "text": "I am glad I could help", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744981988.0, "datetime": "2025-04-18T13:13:08", "subreddit": "AnorexiaNervosa", "id": "mnr5axx", "text": "Thanks for sharing", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1745331986.0, "datetime": "2025-04-22T14:26:26", "subreddit": "AnorexiaNervosa", "id": "1k57n49", "text": "It makes me sad to see some people with anorexia say they need to lose more weight or become sicker, so that it feels worth it to get better. Or so more people will show concern for them. As someone who has had anorexia for 19 years and has never fully recovered from it, here is what I learned from putting off help, from avoiding treatment and essentially staying sick for so long\n\nWhen the anorexic voice is shouting at you that you need to lose more weight so you feel valid, that thought pattern is an indication of just how sick you already are. Healthy people don't wish they were sicker. So if you ever think to yourself \"I feel like I need to lose just a little more weight and then people will take me seriously,\" that is when you have a problem. And your problem is serious\n\nThe thing is, you could become emaciated and be admitted to a hospital. You won't feel like recovering, even then. The malnourishment will affect your thinking. You may not actually feel ill. But doctors are telling you otherwise. You may still believe that you need to become even worse. You are chasing after a feeling of validation. But even at your sickest, you will never feel it.\n\nI felt the same way, at the time of my inpatient treatments for anorexia. I was severely ill. But certainly didn't see it. When my treatment team told me they thought I was at risk of dying and they would not allow me to leave the hospital, I did not believe them and refused to listen.\n\nEach time I asked to leave the inpatient centers I was at, I was told no. They told me they were worried I would die if I left the hospital. Sounds like that would make a person snap out of what they are doing, doesn't it? But not with anorexia. That's why this disorder is so scary. Each day, different plates of food were placed in front of me. While nurses sat beside me so I couldn't get rid of the food. I struggled to get through each meal. But I knew if I did not eat the food, I would get a feeding tube. So day after day, I had to sit through breakfast, lunch, dinner and several snacks, consuming every morsel. While my eating disorder brain shouted at me to get home and lose the weight\n\nThey didn't want me to burn off the calories I was eating. So they wanted us all to sit down and not stand as much, after we finished eating. If you had to go off and get blood tests down stairs or talk to one of your therapists, some people were so sick, they moved them around in a wheelchair. I was the only anorexic person who wouldn't get in the wheelchair to go downstairs. I didn't feel like I needed it. My body temperature was so low when I first got there, they put a warming blanket on me to get my temperature up. I did not feel like I needed a warming blanket. But I had to sit there with it on. They told me my weight was so low, that it was affecting the function of my organs. My response was \"I would just like to go home and lose weight again.\"  When you are ill, you aren't always going to feel like you are ill. And starvation affects your thinking. So I was really not interested in being helped. But I knew the only way out the hospital was to eat the food and do what they said. I did not go to residential or outpatient afterwards because I wanted out of that controlled type of environment. And residential sounded scary to me at the time. I didn't even consider it. I just instantly refused.\n\nSo there was never a point during my inpatient hospitalizations where I thought \"I am really sick and these people are absolutely right. There is a reason they are working on refeeding me and why they want me to go to more treatment after I leave here.\" Those thoughts didn't cross my mind. I was younger and had only been anorexic for two years at that point. Because of my age at the time, my brain likely wasn't fully developed. Malnourishment was affecting my thinking. And while I gained some weight during treatment, I never fully restored my weight. I was at a healthy weight for my age and height before my eating disorder, but I have never returned to that weight. So this caused further problems. After leaving inpatient, I lost every pound I gained. During my second hospitalization, I became even sicker. I weighed even less during the second inpatient admission than the first one. This was the hospital specifically designed for those with anorexia, where I was really scared. This was the hospital where they wanted to give me a feeding tube, because I was refusing food. And you know what? I didn't feel sick enough, validated or like people were trying to look after me and help me. When I heard the words \"You aren't eating so you are getting a feeding tube,\" I got so scared and, after that, I agreed to start eating. They are basically trying to keep you from dying. There were people of all ages in the hospital. Some were recovering and some were really sick. Even when you are really sick, you are never going to feel valid. I did not view treatment as people trying to save me at the time. I viewed treatment as people trying to take away my control. I was angry at my parents for driving me to both inpatient centers and leaving me there. I wanted to go back home with them whenever they came to visit. I felt like my choices were taken from me. All the weight I gained was lost. I didn't learn anything from being in the hospital. I only had negative feelings towards the places I went to and never wanted to go back\n\nFast forward to now. It is years after my inpatient hospitalizations. I am still very sick and have severe and enduring anorexia. For years, I remained malnourished and at a low weight. I tried a few therapists and attempts at outpatient treatment. Nothing that stuck with me and got me to change my thinking. No further inpatient treatments. For a long time, my body kept going. The first medical complication I ended up with was osteoporosis. I was younger during my inpatient stays, so because I was renourished right away, my body was more resilient and healed from the damage. I put more strain and stress on my body by continuing to starve it. Now my anorexia is affecting my organs. Some of my medical complications are possibly permanent. I did not know starvation could damage the bladder and cause things like frequent urination. But it can happen, even when you do not think it can happen to you. By not treating my disorder, and never coming to terms with how ill I truly was at the time of my inpatient stays, my disorder just grew more severe. The ed thoughts louder, the behaviors more engrained. I am on palliative care for my anorexia. My parents are still helping me but I know that it makes them sad I have not managed to fully recover from my disorder. I am trying to remain positive. I am glad I am still here. I want to work on getting better, even if it is going to be difficult\n\nThere was a girl in inpatient who became a very good friend of mine. She was a few years older than me. She was severely ill, like me. We enjoyed each other's company during our hospital stays. She had been through repeated inpatient stays. She was so ill, but could not see it. She was emaciated, but asked me if she looked fat during my last week there. Hearing her say that made me sad. But it's really what she thought, no matter how many people in treatment tried to tell her, otherwise. Anorexic people often have a distorted view of themselves. You can be really thin, and think you need to be thinner. You could be thin and actually see yourself as overweight. She stayed in touch with me for a few years after I got out of the hospital. She never fully recovered. I am sure that she never reached a point where she truly felt sick enough. She starved herself for so long, that her body simply couldn't handle it anymore. She passed away five years after I met her. During those five years, I stayed in touch with her by calling her on the phone and sending her letters. Her death really affected me. But I did not reach out for help for my anorexia after she died. I got worse\n\nSo if there is anything to take away from this post, it is this. Your eating disorder has one single purpose. And that is to make you unhappy. Your reasons for developing this illness will be different from another person's. Every person deserves to feel like they are not alone. And like things can get better for them. I do not think recovery is impossible for me, but it is more difficult because I have been sick for so long. I have to work really hard to change certain behaviors. Some days, this feels impossible. No matter how low your weight goes, whether you have had a feeding tube or have never had a feeding tube, no matter how many medical complications you end up getting, and no matter how many inpatient stays you have gone through, you will never feel valid. You will never feel sick enough. Your illness will convince you that you aren't that bad and things could be worse. Becoming sicker just makes you sicker. I wish I had not put off getting help. I wish I had not waited until I developed medical complications to get help. Now I am in physical pain and older, with an eating disorder. Now, I have to fight even harder than before. Because now, my body isn't as healthy as it once was. You don't think an eating disorder will become chronic, certainly not when you are younger and it just started. If you end up becoming chronic, it is not your fault and you deserve to feel supported. There is hope for everyone to improve. Although this disorder does have a high death rate. People did everything possible to help my friend that died but she was just too ill. I still think about her often. So if you are struggling and not feeling valid, I want to remind you that you are valid. Whether you have suffered for a year or 20 years. And you deserve better", "title": "What I learned from not recovering early", "context": null}
{"type": "comment", "timestamp": 1745334637.0, "datetime": "2025-04-22T15:10:37", "subreddit": "AnorexiaNervosa", "id": "mofy25d", "text": "Thank you. That's kind of you to say. I have been writing ever since I was a child. I find it helpful to write about my experience. Writing helps to make me feel better. And I hope my posts help anyone who is struggling as well", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745337737.0, "datetime": "2025-04-22T16:02:17", "subreddit": "AnorexiaNervosa", "id": "mog8rnb", "text": "You are welcome. I am sorry you are struggling as well. Yes, it is so true. The longer you wait to get help, the harder it will be. Anorexia is a cruel disorder. The thoughts can be all consuming and hard to fight against.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745410520.0, "datetime": "2025-04-23T12:15:20", "subreddit": "AnorexiaNervosa", "id": "molgk0f", "text": "Well said", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745845571.0, "datetime": "2025-04-28T13:06:11", "subreddit": "AnorexiaNervosa", "id": "mph69r3", "text": "You are welcome. Yes, I think that could help. Eating disorders are similar to addiction", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745957990.0, "datetime": "2025-04-29T20:19:50", "subreddit": "AnorexiaNervosa", "id": "mppz911", "text": "You are welcome. Your struggles are valid", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1746465510.0, "datetime": "2025-05-05T17:18:30", "subreddit": "AnorexiaNervosa", "id": "1kfh7yj", "text": "I generally wonder how people who are at a healthy weight, are able to eat healthy and eat enough food, without starving themselves, without obsessively checking the scale, without constantly thinking about what they eat and how it's prepared. How healthy people who aren't anorexic can just try a new food because it sounds good. How they go about their day, without constantly worrying about the number on the scale\n\nI know the obvious answer is they aren't anorexic. Some people who are not anorexic have disordered eating or they go on diets, but it never turns into anorexia. But I am mostly talking about people who are able to maintain a naturally healthy weight, while not starving themselves. They do not overeat or undereat, and they do not suffer health complications because of it\n\nThat used to be me, before this illness came into my life. I have been naturally thin, my entire life. Before my illness, I could eat what I wanted, without having to strictly monitor my food intake or constantly check my weight. My weight was just at a healthy weight. I never went above or below the number. Then one day, I decided to step on a scale and for some reason, couldn't stop losing weight\n\nSo now I am very underweight. And I miss how I was before. I miss not worrying about food or weight gain. But now that I am underweight, I am a lot more anxious than I ever was at my previously healthy weight. At my healthy weight, my mom always told me how pretty I was. But ever since I have been sick with anorexia, my mom always asks me what I am eating and is always worrying about me. She no longer calls me pretty. She sees how my illness changed me. No one in my family suffers from anorexia so it is a very isolating thing to go through. Also, I find returning to my previously healthy weight, the weight I once felt confident at, to be very anxiety provoking. Even when people tell me I wouldn't be overweight if I ate more and that gaining weight would improve my health and quality of life. I know I wouldn't be overweight if I ate more. But the idea of the number increasing is what bothers me. I know I would still be naturally thin. It's in my genetics. But the idea of the number going above where I want it to be is what I have anxiety about. \n\nThis disorder can change your thinking and how you view yourself. It is why anorexic people often do not stop losing weight, even when others approach them and tell them they are becoming too thin. I lost my freedom when I stood on the scale. ", "title": "How do people without anorexia not worry about their weight", "context": null}
{"type": "comment", "timestamp": 1746465841.0, "datetime": "2025-05-05T17:24:01", "subreddit": "AnorexiaNervosa", "id": "mqqnca2", "text": "Thank you for sharing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746466909.0, "datetime": "2025-05-05T17:41:49", "subreddit": "AnorexiaNervosa", "id": "mqqr42z", "text": "You described it perfectly. That's what it feels like. It really warps your perception of yourself", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746467600.0, "datetime": "2025-05-05T17:53:20", "subreddit": "AnorexiaNervosa", "id": "mqqtjra", "text": "Thank you for sharing. Well said", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746468580.0, "datetime": "2025-05-05T18:09:40", "subreddit": "AnorexiaNervosa", "id": "mqqwy9f", "text": "You are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746474528.0, "datetime": "2025-05-05T19:48:48", "subreddit": "AnorexiaNervosa", "id": "mqrh1ck", "text": "Well said. Other people aren't attached to their weight as people with anorexia are.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746474651.0, "datetime": "2025-05-05T19:50:51", "subreddit": "AnorexiaNervosa", "id": "mqrhgj6", "text": "I think a lot of healthy people who aren't anorexic actually do care about what they look like, but they do not fixate on their weight in the way that a person with anorexia does", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746478996.0, "datetime": "2025-05-05T21:03:16", "subreddit": "AnorexiaNervosa", "id": "mqrwdi4", "text": "That's true", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746479934.0, "datetime": "2025-05-05T21:18:54", "subreddit": "AnorexiaNervosa", "id": "mqrzgzh", "text": "Thank you for sharing your perspective on this issue", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746479976.0, "datetime": "2025-05-05T21:19:36", "subreddit": "AnorexiaNervosa", "id": "mqrzlus", "text": "Exactly", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746480069.0, "datetime": "2025-05-05T21:21:09", "subreddit": "AnorexiaNervosa", "id": "mqrzwnd", "text": "Same for me. People without anorexia may have a hard time understanding why anorexic people do what they do. And people with anorexia will have a hard time understanding why healthy people do what they do.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746482878.0, "datetime": "2025-05-05T22:07:58", "subreddit": "AnorexiaNervosa", "id": "mqs8rbp", "text": "Yes. Saying \"Just eat\" won't cure a person with anorexia, and if it was that simple, so many wouldn't be struggling", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746486211.0, "datetime": "2025-05-05T23:03:31", "subreddit": "AnorexiaNervosa", "id": "mqsinrf", "text": "Yes, it's such a painful disorder. It really changes how you view yourself and everyone around you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746486603.0, "datetime": "2025-05-05T23:10:03", "subreddit": "AnorexiaNervosa", "id": "mqsjthf", "text": "I hope I can get back to that place too one day. It was so freeing to wake up and not care about my weight or worry about what I was eating.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746491853.0, "datetime": "2025-05-06T00:37:33", "subreddit": "AnorexiaNervosa", "id": "mqszcib", "text": "I am glad you are doing better. Thank you for sharing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746496423.0, "datetime": "2025-05-06T01:53:43", "subreddit": "AnorexiaNervosa", "id": "mqtcmf9", "text": "Thank you for the advice", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746568395.0, "datetime": "2025-05-06T21:53:15", "subreddit": "AnorexiaNervosa", "id": "mqymvpd", "text": "Same", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1746830977.0, "datetime": "2025-05-09T22:49:37", "subreddit": "AnorexiaNervosa", "id": "1kivm1y", "text": "I had a very good friend who suffered from severe anorexia. I met her when I was hospitalized for my eating disorder. I related to her in lots of ways. She was an interesting person. I like art. She also liked art. I liked to write. And she liked to draw and paint. So we could have discussions about that. I could joke around with her, because she didn't take herself too seriously. We talked about a lot of different things, not just our eating disorders. I feel like she understood me and if I happened to be struggling with something, I could talk to her about it. And she could talk to me about something she was struggling with. \n\nBut one thing I remember about her is that she was very entrenched in her disorder. She was very sick. And she had actually been through more anorexia treatments that I had received at the time. She had struggled with her anorexia a lot longer than me. I could already tell that her disorder was really difficult for her to overcome. She had problems accurately seeing how she really looked. She believed, at a very malnourished weight, that she was fat. Some anorexic people have body image distortions where they truly cannot see how they look on the outside. And I think this was an issue she had, and it was really difficult for her to overcome it\n\nWhile I enjoyed our conversations and she was a very kind person, she also needed reassurance that she was not overweight. She believed that she was. Even though she looked emaciated to me and to others. And when I arrived at the hospital, she had been there much longer. She had also tried previous treatment centers before the one I met her in. And I guess she needed more monitoring or she kept relapsing\n\nI was watching tv in the day room at the hospital and she came up to me and the words she said made me feel very sad for her. She said to me \"Do you think I look fat?\" And I felt really bad. She trusted me enough to confide in me that she was struggling. A lot of people sometimes keep their feelings to themselves when they are struggling but she liked talking to me. I liked talking to her. I wanted to reassure her. I said she looked fine. But I do not think she believed me\n\nThe problem with this disorder is that it is a mental illness. Everyone around you sees you one way and you can see yourself as another way. My struggle with anorexia makes me attached to wanting to weigh a specific number and being afraid of the number increasing. I do not view myself as overweight. I see that I am thin. I am terrified of the thought of weight gain, not of the thought of becoming fat. But my friend believed that she looked fat, no matter how thin she actually was. And I think that she continued to struggle with low self esteem even after she left the hospital\n\nI stayed in touch with her for years after I got out of the hospital. I wrote letters to her. I called her on the phone. She was a very unique and intelligent person. She also struggled with a lot of pain. I never found out the exact reasons why she developed her disorder. But I remember her personality and how she was always very kind to everyone around her, no matter how much she was struggling inside. \n\nShe died of of complications of anorexia. She died at a younger age. She never fully recovered from it. But she did try to get better. I think about her a lot. I miss our conversations. Being in inpatient was a very lonely and frightening time for me and talking to her made me feel less alone. This is a tragic disorder. It harms your health. It can change how you view yourself. It is nice to talk to others who are struggling with this. I've never forgotten her. I want to work on getting better from my disorder. And I wish that she could have overcome this.", "title": "A conversation with my friend, who was anorexic, that I have never forgotten", "context": null}
{"type": "comment", "timestamp": 1746833666.0, "datetime": "2025-05-09T23:34:26", "subreddit": "AnorexiaNervosa", "id": "mri6q2n", "text": "Thank you for the kind words. I think about my friend a lot. I hope I can get better. My friend tried really hard to get better. Thank you again, for the words of support. Though getting better from anorexia is not easy, I am trying", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746836281.0, "datetime": "2025-05-10T00:18:01", "subreddit": "AnorexiaNervosa", "id": "mriduc6", "text": "Thank you. That means a lot. She was a special person. Getting better is not easy, but I am trying to remain optimistic", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746836696.0, "datetime": "2025-05-10T00:24:56", "subreddit": "AnorexiaNervosa", "id": "mrieye4", "text": "Thanks. It does feel impossible sometimes. Being optimistic and keeping a positive attitude helps", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746841073.0, "datetime": "2025-05-10T01:37:53", "subreddit": "AnorexiaNervosa", "id": "mriq9w0", "text": "Thank you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746844931.0, "datetime": "2025-05-10T02:42:11", "subreddit": "AnorexiaNervosa", "id": "mrj05gi", "text": "Thank you for the kind comment. Yes, it is so difficult to lose someone to this disorder. It is a very cruel disorder and so painful for the person who is experiencing it. Yes, recovery is scary, difficult at times, but with time, I hope I can improve.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746983991.0, "datetime": "2025-05-11T17:19:51", "subreddit": "AnorexiaNervosa", "id": "mrs1b6m", "text": "Thank you for sharing. I am glad you are doing better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747085468.0, "datetime": "2025-05-12T21:31:08", "subreddit": "AnorexiaNervosa", "id": "mrzg0o4", "text": "Thank you. I appreciate the kind words", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747112457.0, "datetime": "2025-05-13T05:00:57", "subreddit": "AnorexiaNervosa", "id": "ms1if4b", "text": "Thank you for the kind words and I am sorry for your loss as well. I am trying to get better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1750770583.0, "datetime": "2025-06-24T13:09:43", "subreddit": "AnorexiaNervosa", "id": "mzi8yh6", "text": "Thank you for the advice and support", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1750770691.0, "datetime": "2025-06-24T13:11:31", "subreddit": "AnorexiaNervosa", "id": "mzi9a25", "text": "Thank you for the advice", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1751820113.0, "datetime": "2025-07-06T16:41:53", "subreddit": "AnorexiaNervosa", "id": "1lt5pvj", "text": "You think you have things under control at first. You start restricting your food intake and losing weight. You reach a number you have in your head. But you don't stop at that number, because this is a serious mental illness. And there is no off switch. You will never feel sick enough, underweight enough. You can start to look visibly ill, and you may think at that point, you are going to turn things around. Pursue recovery, because you've finally proved at this point you are sick. But you won't. In fact, resistance to treatment and finding comfort in this disorder, being in denial of how ill you are, is very common. I remember being hospitalized, severely ill, with failing health and people afraid I would die. I didn't have good insight back then. I thought everyone worried about me and trying to make me eat was wrong. That's what this disorder does to you. You can be in a hospital, emaciated, about to get a feeding tube because you are refusing to eat, and you still won't see it. I didn't see it at that time. My only focus at that point in time was my weight and what the scale was saying. Instead of thinking about the fact that people in the hospital were trying to get me healthier, all I thought about was my weight. I was younger, so I wasn't focused on the future consequences. And there are consequences to staying sick, remaining in a malnourished body. There are side effects to starving yourself. It is different for everyone. Maybe you start to notice you get cold easier and can no longer stay warm. Maybe you start losing energy and your bones start to weaken. Maybe you find it's hard to sleep at night. Your mind starts only focusing on what you eat, what you weigh. All other concerns drift into the background. Hopefully, you have people around you that try to get you to understand that what you are doing is deadly and that you need help. Maybe you will recover early, and find a way out of this disorder, before it becomes chronic. Maybe you accept to go to treatment and be refed. You accept help, knowing help means weight gain and letting go of the ed behaviors. Some people do very well in treatment and they never go on to be chronic. But for others, they don't respond the same to hospitalization. They stay sick for years, medical complications become worse. And full recovery seems impossible at times. But if you go through treatment, and it doesn't work, maybe it was not you that resisted the treatment. Maybe the treatment given was done poorly and people didn't tailor things to fit your needs. Everyone is different. Everyone reacts differently to treatment. Some fight the process. Some go along with it. It's not easy for anyone. And at any point in your disorder, whether you have been sick for two years and twenty years, you can suffer medical complications. You do not have to feel sick, to be sick. If you had asked me at the time of my inpatient hospitalizations if I felt sick and like I needed to be there, I would have said no. I was in denial. I didn't feel any pain or discomfort at the time, even though I was near death. No matter how many times people repeated to me they were afraid I was going to die, my illness had taken over and malnourishment was clouding my thinking. And I couldn't agree to what they said. I eventually agreed to eat, but only under pressure, because I felt I had no other choice. And when you go through treatment, and you aren't willing to see you have a problem, then you are going to have a difficult time getting better. When I was younger, I was unaware of all the terrible consequences. I had no idea there were so many side effects. Many they will not tell you about and you often do not consider things, until one day, they hit you and then you can't stop thinking about the damage done to your body. Damage from anorexia can be silent. It can occur for many years. Because this illness is an addiction, you may think because you do not feel bad, physically, that you can keep going. But your body can only take so much. I wish I could reverse time, and go back to the moments people were telling me to treat this early. I pushed away help after my hospitalizations, believing I could go home, retreat into the safety and comfort of my disorder, which was actually anything but safe. For years, my disorder grew more and more severe. And I avoided further hospitalization, for the fear it would be another repeated cycle. Then, my body began to show signs of damage. I have a hard time controlling my bladder, and get frequent and painful urination. This symptom basically keeps me staying at home all the time. And I have found no way to reverse it. It's not just frequency but constant pain. And this will erode your self esteem quickly. I wish I was warned about anorexia and bladder issues. But I had no idea. And that is the most devastating thing about this disorder. It silently takes away your comfort, your peace of mind, and steals little bits of your health in the most cruel ways. My digestive system is damaged from all the stress. Years of remaining at a low weight, never fully restoring my weight to a healthy level, has caused organ damage. I used to be able to eat and gain weight. But now, my body doesn't respond to food the same way, and I lose weight, unintentionally. It's not just weight loss, but chronic pain, stomach issues, and a general weak feeling. I was unaware that palliative care for anorexia existed. But I find myself on palliative care. I was unaware my disorder would become deeply entrenched. I was unaware these medical issues would have such a huge impact on my quality of life. Once a disorder becomes chronic, it is not impossible to get better. But you need support and understanding. With this disorder, it consumes your thoughts. You do not know why, but that number you see on the scale means so much. Yet, you long for a life free from this disorder and you try to be positive. But with anorexia, also comes depression. You do not see things in the same way that a healthy person without anorexia sees things. People say \"go to treatment\" and maybe things will get better. But a lot of people with anorexia fear change, fear changing what they are doing, even when a part of them understands the harm this disorder is causing them. Even if you wind up with very painful medical complications, even when people are waring you that you can die, even when you are a chronic sufferer, on palliative care, and feeling unsure about recovery, you will never feel sick enough. You will try to convince yourself that you can keep going like this. But that is just the disorder lying to you. Anorexia isn't fun. Anorexia isn't peaceful. Anorexia doesn't give you a break when you get tired of it. I try to be hopeful I can get better. What that may look like, I cannot predict. But I do miss the days when I did not have an eating disorder in my life. It's not glamorous or fun to suffer. If you do not feel sick or worthy enough to get help, that is already a sign of how much you deserve support. Not only support, but understanding. Whether you are in recovery, younger with an ed, older with an ed, or chronic, everyone deserves respect and compassion. Because this illness is not your fault", "title": "You won't stop once you reach a certain weight", "context": null}
{"type": "comment", "timestamp": 1751822301.0, "datetime": "2025-07-06T17:18:21", "subreddit": "AnorexiaNervosa", "id": "n1nykhv", "text": "Thank you for sharing and I am sorry you are struggling as well. Exactly. This is such a cruel disorder. It comes with so many medical complications. Yes, the painful urination is one of the worst symptoms. Chronic pain will affect your mental health too. Therapy is helpful. I hope anyone struggling with this disorder has some type of support", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751823312.0, "datetime": "2025-07-06T17:35:12", "subreddit": "AnorexiaNervosa", "id": "n1o1y4b", "text": "Yes, anorexia is a very scary illness. I am sorry for what you went through", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751847117.0, "datetime": "2025-07-07T00:11:57", "subreddit": "AnorexiaNervosa", "id": "n1q3lsu", "text": "You are welcome", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751847175.0, "datetime": "2025-07-07T00:12:55", "subreddit": "AnorexiaNervosa", "id": "n1q3rie", "text": "Exactly. It's never enough", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751853272.0, "datetime": "2025-07-07T01:54:32", "subreddit": "AnorexiaNervosa", "id": "n1qkbv5", "text": "You are welcome. I am glad this post is helpful", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751897349.0, "datetime": "2025-07-07T14:09:09", "subreddit": "AnorexiaNervosa", "id": "n1t64q9", "text": "Thanks", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1752021937.0, "datetime": "2025-07-09T00:45:37", "subreddit": "AnorexiaNervosa", "id": "n239aml", "text": "You are welcome. I am glad this post is helpful to you", "parent_id": null, "link_id": null, "context": null}
