{"type": "post", "timestamp": 1650301130.0, "datetime": "2022-04-18T16:58:50", "subreddit": "ARFID", "id": "u6hw3b", "text": "Mods - no self promotion here. I just have some time and would like to help if I can. Will verify if needed, just reach out.\n\nI’m a Registered Dietitian who helps people work through a number of eating disorders. I have had a particularly heavy caseload of those struggling with ARFID due to our success with treatment. I recently saw this subreddit pop up on a google search and figured I’d offer tips/advice for those who need it.\n\nARFID is a very common eating disorder that can be treated effectively and efficiently with a strategic and sound approach. I know how difficult it can be to work through - what questions do you have for me?\n\nEdit: Need to take a break for now, I'll try getting to the rest when I can. :)", "title": "ED Dietitian specializing in ARFID - Ask me anything!", "context": null}
{"type": "comment", "timestamp": 1650304597.0, "datetime": "2022-04-18T17:56:37", "subreddit": "ARFID", "id": "i58ia3l", "text": "ARFID has just a few different etiologies. Most people who struggle with ARFID have some sort of sensory sensitivity. Why this occurs can be important for an individual’s curiosity, but doesn’t seem to be particularly important for recovery. \n\nI believe it helps a lot to be “strategic” around the approach, and that’s where someone like a dietitian (who has experience in ARFID) can help a lot. \n\nHowever, the work boils down to the avoidant behavior being the limiting factor to progress. We work through two phases typically 1. Food trials which start at very low intensity such as bringing back foods that were “dropped” (used to eat), or even just changing the presentation of a food (such as sandwiches that are typically cut in half, try uncut). These increase in difficulty until the person feels comfortable working with heavily feared foods. Phase 2. Is incorporation. Taking the foods that were less aversive and working them into the diet frequently. Food being unappealing or having low appetite is often a complicating factor, but improves as a persons nutritional status improves and as consistency in eating improves. Our body is very rhythmic, so hunger cues will self regulation to our behaviors. If eating sporadically, hunger cues typically fade or we just don’t get the same impact from them. Sometimes phone reminders can be nice to just remind the person to eat -something- and keep their body consistent.\n\nAlmost everyone I’ve worked with makes really fast progress in the world of eating disorders. 20-30 sessions can yield enough progress to fix many nutritional deficiencies and reduce anxiety around eating so that the client can continue the work outside of guidance. Many people make huge improvement in just one month of consistent effort, and this month benchmark is often a good indicator for future progress in recovery.  6-8 months is the typical amount of time I’d work with someone, but it can vary a lot depending on many different factors", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650305587.0, "datetime": "2022-04-18T18:13:07", "subreddit": "ARFID", "id": "i58kro3", "text": "Chewable calcium citrate is a good alternative and well absorbed - better than many calcium carbonate pills. The problem with bone density is that we stop building stores for this in our early 20s, and the job then becomes maintaining that density through healthy behaviors. \n\nFor appetite - it can often improve with consistency due to your hunger hormones becoming more regular. If someone has been consistently eating and sees no improvement we would often look at ways to reduce for most meals. Some will seek treatment and be told to eat challenging meals frequently, but this will backfire often. Look at the meal experience as a whole - are you in a comfortable environment? Meals that you eat should be preferred unless you’re specifically working on 1 or 2 foods to incorporate during that meal. Are there other things in life that might be worked on to help with the baseline anxiety and/or depression? Connection to others, sense of meaning, etc - these can be topics discussed with a therapist and often do come up as significant behaviors for eating so the RD might touch upon these. If you’re undernourished, getting nourished is the primary goal because malnourishment will breed anxiety and often will lead to poor appetite. If that’s the case, often you’d want to distract yourself at meals as opposed to being mindful. Television, phone, music, etc. These can be helpful in the pursuit of nutritional restoration. \n\nOften those who struggle with ARFID lack intake of omega-3 fatty acids which can really exacerbate poor mood and anxiety. It’s smart to start getting more of these if general mood is a concern.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650309371.0, "datetime": "2022-04-18T19:16:11", "subreddit": "ARFID", "id": "i58u66r", "text": "First, I always try to explain that anxiety is inherently functional. It’s somewhat normal that our brain’s neurological pathways have associated aspects of fear and anxiety with food. \n\nOur brains are actively learning every single time we eat. As someone with a passion in the subject, I’m still amazed by the degree to which people of all ages subconsciously learn during eating. \n\nOf course the problem is that we don’t have a filter on that learning. Food aversions are created just as easily as preferred foods. Food situations, especially the social situations you mentioned, can be as fulfilling as they can be detrimental.\n\nThe specifics of what will help you will be individual, but the process is ultimately consistent for everyone. You need to create more positive food-centric social situations. That strategy of how this is done is really the key, but someone who is introspective could do this on their own. Start as small as you need to, these challenges should be challenging without seeming impossible. If eating in front of ANYONE produces anxiety - have a tea party with your dog or cat. Seriously. If you can tolerate a few close friends or family, practice that. \n\nYou want a surmountable challenge, you do not want to be practicing at some grand feast. The problem typically is that people start with challenges far too hard and/or avoid challenges all together. The work is meant to induce this anxiety, and you need to work through it, but it needs to be an appropriately tailored challenge so that you can almost guarantee success.\n\nFurthermore, practicing in controlling our inward focus (are they watching me? What do I look like? Are they judging the foods I’m eating?) with meditation is totally invaluable. Meditation is the skill of consciousness, NOT an activity that is done to reduce stress. Practice observing without judgement. I like the app Waking up by Sam Harris for this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650310169.0, "datetime": "2022-04-18T19:29:29", "subreddit": "ARFID", "id": "i58w3oh", "text": "Lack of sensory exposure to different foods at early age can bring about ARFID like restriction, I suspect it to be causal but there’s likely genetic predispositions as well.\n\nTo be very clear, ARFIDs defining characteristics contradict the characteristics of Anorexia. If Anorexia is suspected then you’ll have more success exploring that avenue. I’ve worked with clients who have Anorexia who do have sensory based aversions, and wouldn’t be surprised to see ARFID like behaviors grow into Anorexia like behaviors. The etiologies are very different though, so approach to treatment is different. \n\nIf there’s concern about body image it’s more Anorexic. Fear regarding treatment is usually Anorexia as well because to someone struggling with ARFID the idea of treatment usually promotes a feeling of relief rather than anxiety. \n\nA child with Anorexia should be forced to go into treatment. It’s too much of a slippery slope to allow those behaviors to continue. It’s sad…quite frankly there have been epidemic-like increases in Anorexia over the last 2 years.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650310677.0, "datetime": "2022-04-18T19:37:57", "subreddit": "ARFID", "id": "i58xby8", "text": "That’s a good question. Aside from reaching out to someone for guidance, just doing some self reflection on what you’d be looking for in regards to improvement. What are your goals? What do you lose from your avoidant nature with food? This type of exercise is not to wallow in self pity, but to be matter of fact about your current situation. Life shouldn’t be manipulated around food, food should fit into someone’s life comfortably and ideally should enhance most situations. \n\nRunning through a list of foods and getting a gauge on which ones you commonly eat, which ones you’ve never tried, which ones you are apprehensive of, and which you are interested in can give you and/or a provider a great idea of opportunities for improvement", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650311164.0, "datetime": "2022-04-18T19:46:04", "subreddit": "ARFID", "id": "i58ym3b", "text": "It can be hit or miss. You definitely need a dietitian who is familiar with ARFID. That’s not always easy. I have ED clinics reaching out to me for support with ARFID, and these are people who are supposed to be qualified. \n\nTherapy is always recommended, but reasons why you might have current ARFID like behaviors are somewhat irrelevant for progress in treatment. Of course, discussing where some of these things originated from can be helpful for healing in general.\n\nHow did you conquer the fear of roller coasters? My guess is that you exposed yourself slowly, but strategically. The same for ARFID! I typically assist people with being mindful during specific food trials. One common question I ask is “how would you describe this food, as if I had NO idea what it was?” It’s not an easy task to do this, and requires really paying attention and fixating on the sensations without judgement. Of course, we would work in general diet patterns as well because this is often an aspect of the overall problem as well", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650311711.0, "datetime": "2022-04-18T19:55:11", "subreddit": "ARFID", "id": "i58zzod", "text": "Maybe…\n\nOff that description it seems like she eats a fairly diverse set of foods. It can be difficult for parents to discern because kids naturally are working through a lot of the processes involved with acquiring tastes for foods. I’d say if severe anxiety is present, and is a limiting factor to eating in certain situations then it could definitely be ARFID. \n\nIt almost sounds like the control aspect she displays around food could be more of the “problem” rather than something sensory or rooted in fear. Of course, take that with a grain of salt because these issues are often complicated and dynamic", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650312598.0, "datetime": "2022-04-18T20:09:58", "subreddit": "ARFID", "id": "i59267a", "text": "Definitely a good question. \n\nI guess it comes down to why is the person engaging (or limited to) such a restricted diet? Someone who chooses to be vegan or vegetarian is typically making a cultural or spiritual choice that supersedes other potential desires or needs. This is fine, but people are often dishonest about their intentions and when it comes to self-care, you have to be honest with yourself.\n\nRestrictive diets get repetitive, and often lead to food fatigue. Food fatigue is a real experience, and usually leads to weight loss and nutritional deficiency. Someone might be fine eating the same foods on repeat for a few years…but a few decades? It’s worth considering if that’s acceptable for the person.\n\n\nThere’s also the fact that food is such a big part of our lives, and we cannot change human nature. So if someone is feeling that they can’t go to events without some emergency food plan, or food decisions are active and consistent thoughts I would reckon there is a problem.  When food is not enjoyable, a very deep psychological issue can develop as abstinence from the sources of natural pleasures has been studied deeply. We do need to engage with these pleasures and have moderation around them. \n\n\nJust be honest with yourself. No one can be honest for you. They can offer suggestions and guidance, and an honest decision should take all information into account. I always tell people, check your certainty because if you are CERTAIN about something you’re likely ill-prepared or not as informed as you should be.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650312744.0, "datetime": "2022-04-18T20:12:24", "subreddit": "ARFID", "id": "i592j4k", "text": "Luckily telehealth is a thing now. This is something that my business has be utilizing heavily, and offers invaluable flexibility and convenience for the patient. This work doesn’t require you to be in person!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650313553.0, "datetime": "2022-04-18T20:25:53", "subreddit": "ARFID", "id": "i594j9x", "text": "The age old question of trying to find a therapist! Unfortunately given the rise of anxiety and depression over the last few years, the task is quite difficult. I’d recommend looking on a site like healthprofs or psychology today and filter searches to those who take your insurance. You’ll probably need to sign up on a waitlist but it’s better than nothing. Don’t be afraid to look for those doing telehealth, it’s a great option and this expands the search to anyone who is licensed in that state.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650313716.0, "datetime": "2022-04-18T20:28:36", "subreddit": "ARFID", "id": "i594xia", "text": "I’d definitely have her receive an evaluation from a dietitian or therapist who works in ED treatment.  Eating disorders are slippery slopes…behaviors can evolve rapidly and can get increasingly difficult to treat", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650315846.0, "datetime": "2022-04-18T21:04:06", "subreddit": "ARFID", "id": "i59a7hu", "text": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650316544.0, "datetime": "2022-04-18T21:15:44", "subreddit": "ARFID", "id": "i59buft", "text": "Ah, yes it does seem that autism and ARFID are two peas in a pod. \n\nThere are some really interesting dynamics with autism, nutrition, and ARFID. All of which are relatively new fields to study, so we probably won't have concrete research for many decades. I'm under the impression that ARFID is often caused (at least in part) by lack of sensory exposure to foods at a young age. Why would this be the case? Well...a few different reasons. You simply might not have had exposure, and parents never made an effort for whatever reason. You might have had a traumatic food event (like choking) which never really was worked through and this can cause self regulating avoidance behaviors which cause limited sensory exposure. Or you might just have a predisposition, such as the 'super taster' gene which makes foods a little more intense and this can cause avoidance.\n\nWhat's interesting is that autism is showing connections to our gut microbiome. So an underdeveloped gut microbiome is connected to Autism, but that's really the extent of what science knows so far. Poor gut microbiome is usually a result of limited exposure to bacteria, but especially bacteria in the food we eat. So it becomes an interesting question of what comes first? Is it that Autism being more connected with restricted food intake = poor microbiota? Or is it the microbiome leading, which is impacted by a more hygienically fixated society? I don't know the answers to these questions, but these are the questions that are limiting further developments in the field.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650316987.0, "datetime": "2022-04-18T21:23:07", "subreddit": "ARFID", "id": "i59cr5o", "text": "Very kind of you to take the time to learn more! \n\n&#x200B;\n\nI think the best thing you can do is understand that ARFID is, at the core, restriction driven by an anxiety response which is typically out of the control of the person working through it. Rationale, logical decision making, and even physical functioning are somewhat thrown out the window during a period of high anxiety. It's not that these people are choosing this, or just dislike certain foods. It's a lot more than that, and loved ones not understanding this is a common frustration shared by those with ARFID. \n\n&#x200B;\n\nHow you approach definitely depends on where he's at in recovery. I've had clients whose BF/GF are super helpful in assisting with new foods and challenging them. But I've also had clients who just aren't ready for that. The best you can do is communicate, and support him wherever he's at. As long as you come from a place of wanting to understand, I don't think you should worry about discussing food and eating. Of course, not everyone is ready to 'get better' and that can be difficult for a significant other to accept as well.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650332452.0, "datetime": "2022-04-19T01:40:52", "subreddit": "ARFID", "id": "i5abrya", "text": "Weight bias is real and is something I’m careful of. Ultimately I’m concerned and advocate for the patient based on the behaviors they present to me with. Very little is actually known about weight and eating disorders, and some healthcare professionals act very matter of fact about their opinions.\n\nHealthcare needs to work on disregarding current weight centric care, and focus on treating the problems. And this is true whether or not weight has an impact on health - studies have shown the weight focus doesn’t help.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650332570.0, "datetime": "2022-04-19T01:42:50", "subreddit": "ARFID", "id": "i5ac1zj", "text": "Has to recover? I wouldn’t say HAS to, but they should work on this in my opinion. Ultimately we are free to do whatever we would like…when we are 18 at least.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650338157.0, "datetime": "2022-04-19T03:15:57", "subreddit": "ARFID", "id": "i5aomv9", "text": "It's pretty common to struggle with weight gain and ARFID actually. It's strange that even within ARFID treatment you don't see a lot of acceptance regarding this fact. Look for an outpatient dietitian!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650343534.0, "datetime": "2022-04-19T04:45:34", "subreddit": "ARFID", "id": "i5ayz40", "text": "Good question. There's two ways people often go about life with an ED, in my opinion. \n\n1. They manage the situation and deal with it. There's distress and it's uncomfortable, but it's almost 'accepted' as \"I get this is a big obstacle in my life... but this is just me\".  \n2. They are actively working on treatment and recovery.\n\nMany people flip flop in between these two as well. The dilemma is that in treatment for ARFID the client is required to work through significant anxiety and discomfort. It doesn't feel good. There's very little reward for completing the task, and when compared to the avoidance techniques developed to cope with the issue (distraction for example) it's hard to consistently feel like you're in the place to challenge these behaviors. Doubled down by the fact that you need food to live, so there's this dichotomy muddying the water as well.   \n\n\nThe brain needs this persistence though. With ARFID the brain really needs to understand food and the sensations that come with it. I always remove the 'self' from the explanation because it's not a fault of the person that this has happened, as our behaviors are dictated significantly by experiences and observations. But it's the client's goal to start noticing the sensations that come with the experience of eating, which is technically mindfulness. The forces the brain to adapt. Eating consistently is a fairly good recommendation as well because our hunger hormones (and a lot of our biology) is rhythmic. \n\n&#x200B;\n\nSo, yes - you would feel better not being mindful. And in many cases, this is a good route to get someone nourished. But it's not actually working on the issue as much as it is avoidance behavior as interpreted by the brain. The brain learns that distracting is the solution, as opposed to adapting to the sensations the come with food. A good approach would utilize distraction at most meals to start, and then gradually bring in a small amount of hyper mindful eating. A snack a day or a snack a week even is helpful.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650343766.0, "datetime": "2022-04-19T04:49:26", "subreddit": "ARFID", "id": "i5azdnz", "text": "ARFID doesn't typically present with body image issues, so I usually treat that situation differently. This doesn't mean you were misdiagnosed at all, I'm just suggesting how I deal with that. At the end of the day, the semantics of what the diagnosis is doesn't really matter much for improving, in the beginning. Most people struggling with any disordered eating will benefit from ED specific treatment.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650344191.0, "datetime": "2022-04-19T04:56:31", "subreddit": "ARFID", "id": "i5b036i", "text": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650344409.0, "datetime": "2022-04-19T05:00:09", "subreddit": "ARFID", "id": "i5b0frg", "text": "Hm, I guess this is a difficult question for me as I don't actually believe sugar addiction is real. I think the act of eating certain foods could be appealing and rewarding enough to mimic how an addiction presents, but I don't think sugar specifically plays a role in that. I know there are many people who would disagree with this though.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650344961.0, "datetime": "2022-04-19T05:09:21", "subreddit": "ARFID", "id": "i5b1chc", "text": "Why would you be afraid of this? I said one can decide on what they want, if they are 18 :)\n\nMany struggling with ARFID are actually very hopeful at the idea of treatment. It's a defining characteristic of this disorder.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650345263.0, "datetime": "2022-04-19T05:14:23", "subreddit": "ARFID", "id": "i5b1tqf", "text": "Yeah, disagree with the starving method haha. \n\nThe work IS super stressful. Sometimes people will have to take a medical leave. The best way to manage the stress is to start ridiculously small. Food chaining is a fairly advanced strategy. Some people have to start with just being in the same room as a feared food. And as one person mentioned, distraction can be used to help navigate the 'getting enough nutrition' part of eating.  Set small small goals that you know you'll achieve, and don't push very fast. The point is that you should be feeling success with each challenge, despite the hopefully mild stress that accompanies that challenge. Starting with an insurmountable challenge will probably lead to failure", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650345374.0, "datetime": "2022-04-19T05:16:14", "subreddit": "ARFID", "id": "i5b1zz4", "text": "Yup. The diagnosis doesn't really matter all that much, and neither does the types of food someone eats. It's usually not fruits/veg/and meats with ARFID but that's not a defining characteristic in my opinion.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650345638.0, "datetime": "2022-04-19T05:20:38", "subreddit": "ARFID", "id": "i5b2f0m", "text": "I'd look for therapists who work with eating disorders and just ask them if they have experience. If you're working with a dietitian who know ARFID well, you probably don't need to find a therapist who knows exactly how ARFID presents. They will still be helpful with their guidance.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650346062.0, "datetime": "2022-04-19T05:27:42", "subreddit": "ARFID", "id": "i5b32kb", "text": "It’s hard to do specific actions with this because it can be hard to gauge exactly how someone may be feeling in a certain situation. The most supportive significant others are very understanding and will advocate for them when it’s difficult to do so. Being supportive in recovery is of course something that will feel like a push pull dynamic. I have clients with significant others who have figured this out well - they push them just enough and accommodate just enough. Of course I don’t really have a solid view of the scenario in which the person struggling doesn’t have a desire to improve. If this is the case then the dynamic is probably mostly accommodating, communication, and a gentle push to seek treatment and improve the stressors/anxieties of daily life", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650346632.0, "datetime": "2022-04-19T05:37:12", "subreddit": "ARFID", "id": "i5b3xk3", "text": "It’s a good point. I think many people over exaggerate how “healthy” you need to eat to be well. That being said, you don’t need to guess if you’re well - get a check up and see! Foods shouldn’t be viewed as subtractive from health. You don’t eat sugary cereal and “lose health”. You would decline in nutritional status by not having enough of certain nutrients and compounds. Always think, “how can I get more fruits and vegetables” as opposed to viewing it as “how can I eat less of X food”", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650376022.0, "datetime": "2022-04-19T13:47:02", "subreddit": "ARFID", "id": "i5cbpwg", "text": "There's also a genetic component too! Many of my clients have the 'supertaster' gene which impacts how taste is perceived, but there are probably many more individual predispositions.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650376265.0, "datetime": "2022-04-19T13:51:05", "subreddit": "ARFID", "id": "i5ccaud", "text": "Young children are really difficult. It's roughly the same process, but without the capacity to understand the work it is very slow. \n\n&#x200B;\n\nThe best thing parents can do is try to create positive food experiences, minimize general stress/anxiety at meals, and continue efforts to help with food exposures at home. Create variety at meals for preferred foods - cut foods differently each time, use different plates and silverware, use different brands of food. Try to make all preferred foods consistently inconsistent.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650377351.0, "datetime": "2022-04-19T14:09:11", "subreddit": "ARFID", "id": "i5cewfr", "text": "Sorry to hear the stress and anxiety this has put on you. Part of the reason why I do the work that I do is that I love helping and seeing people go from that feeling of despair to hope. There's hope for everyone - don't let negative thoughts convince you otherwise.\n\n&#x200B;\n\nI don't know of any other treatments for ARFID. Exposure is really the main way because it forces the brain to adapt. Some people confuse that statement with 'It forces you to deal with it' - not exactly true. The brain and body will eventually decrease the anxiety response, but it does take time and hard work. \n\n&#x200B;\n\nA feeding tube wouldn't be a relief. A relief would be freedom with food, eating when you are hungry, having your health, being able to do to things you want to do, etc. Living off products like that isn't *ideal*. Fruits and vegetables contain small compounds called phytochemicals that cannot be synthesized or extracted from foods. These compounds do a lot - strong anti inflammatory, anti chronic disease, etc. You would miss out on these which can be a problem. Given their elusivity, it would also be an impossible thing to 'prove' that you're not getting enough. Those on tube feedings usually  have a lot of GI symptoms, which can get old. \n\n&#x200B;\n\nARFID is recognized in some treatment centers, and if not they usually have connections to people who do this work. I don't know of any services on cooking classes, but I'm sure there is something! I'd also caution the thinking that some behaviors are 'part of the OCD' and some aren't. We have one brain and mind, and mental health diagnoses are just someone's best guess at what defining criteria you fit in. Other thoughts and behaviors that don't fit within that exact criteria don't mean they are a different problem or won't improve with the work that is done in general therapy/treatment. \n\n&#x200B;\n\nSounds like you definitely should check in with someone - feeling that weak and having those symptoms like you did in college should be addressed ASAP. I know it's hard...you can do this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650377693.0, "datetime": "2022-04-19T14:14:53", "subreddit": "ARFID", "id": "i5cfqf2", "text": "People do live off of tube feedings, which is essentially (and many cases the exact same thing) as certain supplement shakes. \n\n&#x200B;\n\nThe fact is there are real downsides. Lack of real fiber, lack of phytonutrients which prevent chronic diseases and inflammation, and abstinence from important social, cultural, spiritual, pleasurable aspects of food. The last may seem obvious for someone struggling with ARFID, but it's important for us to find peace with food. Accepting a poor food situation is just settling, and will always feel like a drag.\n\n&#x200B;\n\nAlso the obvious fact about foods on repeat, shakes or not, will eventually get fatigued. What happens when shakes make you gag or vomit?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650378006.0, "datetime": "2022-04-19T14:20:06", "subreddit": "ARFID", "id": "i5cgi6w", "text": "I'd say clinicians working specifically with eating disorders should have at least been exposed to ARFID. It's not an exactly 'niche' eating disorder these days. Search specifically for eating disorder focused, not 'I treat everything'. The 'I do it all' mentality of some clinicians is something I'd personally avoid. \n\nMake sure they are ED focused, visit their website if they have one, feel free to email them and ask if they treat ARFID. Healthcare is really strange, and I can't imagine trying to navigate it when not being in healthcare myself. Think of it as if you were buying a car and wanted a dealer who made you feel comfortable. Healthcare is a business in the US, shop around.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650378208.0, "datetime": "2022-04-19T14:23:28", "subreddit": "ARFID", "id": "i5ch0hm", "text": "I most work with adults, believe it or not. I would imagine ED treatment in England is a lot more difficult. It's probably the one and only situation where US is superior in Healthcare. You can find niche providers. \n\nYou could always reach out to telehealth providers in the US and pay privately if finances allow. This work can be done on your own, it's just more difficult and has less accountability. Start with small food exposures, ones that you KNOW you can do. Even if it's simple like just smelling a feared food, or being in the same room with it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650378434.0, "datetime": "2022-04-19T14:27:14", "subreddit": "ARFID", "id": "i5chknr", "text": "The hallmark of an ED is feeling like you'll never be 'normal'. This is untrue, and full recovery is possible and happens all the time. \n\nJust from the comments you've made it sounds more like aligned with anorexia. Someone can have anorexia with ARFID like behaviors, but a defining characteristic of ARFID is lack of concern about body image. This of course is vastly different from other EDs. \n\n&#x200B;\n\nReach out to a dietitian or therapist who works helps people with eating disorders. You don't have to 'accept' the situation, and you shouldn't. You deserve better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650378647.0, "datetime": "2022-04-19T14:30:47", "subreddit": "ARFID", "id": "i5ci45f", "text": "No problem. My RD track was 4 years as it was a program that combined academics and the supervised practice hours. It was pretty difficult, but now you need a masters so it's a bit more involved. \n\nExpanding into the field you want to do is the hard part. We opened our own practice, which is also a lot of work but is very much worth it. Generally for this I'd recommend just focusing on making friends wherever you go. Pick up hobbies that gets you engaged with big social groups, and make it your mission to learn about people. We know a lot of people just by some of the activities we do...it feels like a really strong safety net when you own a business.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650378859.0, "datetime": "2022-04-19T14:34:19", "subreddit": "ARFID", "id": "i5cinhe", "text": "Yup, I have never seen someone struggle with ARFID without anxiety. If that were the case, I'm not sure I'd call it ARFID. \n\nARFID is bit more niche, especially with adults. It's not uncommon though, I think people just generally need to know that what they are struggling with is a very real phenomenon. As a dietitian I believe I just find it a bit more naturally in my work because...well I talk about food a lot. I don't think there is any other profession that would be looking into the specifics about what someone eats, so that's likely the reason why its not seen as much.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650379414.0, "datetime": "2022-04-19T14:43:34", "subreddit": "ARFID", "id": "i5ck2eh", "text": "Meat aversion is really common in ARFID. It's helpful to talk through with someone why you are worrying about foods cooked on the same pan as meat. The process of reframing these thoughts can be super helpful along with strategic exposures", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650380887.0, "datetime": "2022-04-19T15:08:07", "subreddit": "ARFID", "id": "i5cntrh", "text": ">restricting the adrenal gland\n\nThought to be 'turned off' or limited by touch therapy. It's an interesting approach and has some decent evidence behind it. I don't do this though so I can speak much on it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650383580.0, "datetime": "2022-04-19T15:53:00", "subreddit": "ARFID", "id": "i5cuwen", "text": "I can assure you most tube feedings are the same, I have a lot of experience with them! Abbott and Nestle basically own the tube feeding industry and the formulas of the pre-packed drinks and TFs are mostly identical. The company that owns Soylent likely has no actual contracts with insurance companies or healthcare facilities. Doesn't mean someone couldn't use it if they have a PEG, but it's likely not being supported by insurance or their MD. It's a money thing. \n\nLiquid fibers aren't as effective in many cases, some are better than others, and this is also a cost/money issue. \n\nI don't think there's enough information on phytonutrients to make a definitive judgement, it just seems better to assume they are helpful. \n\nSeems like you've done a lot of research and have helped many people though! Kudos :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650393856.0, "datetime": "2022-04-19T18:44:16", "subreddit": "ARFID", "id": "i5dm3g7", "text": "Which claim are you referencing? That there can be a nurture element in the development of ARFID? I'm not blaming parents, a kid might not have had sensory exposure because of a genetic component early on that resulted in heavy resistance to trying particular foods from the start. But there does seem to be a correlation with lack of sensory exposure early on and ARFID. For example, 'Higher rates of feeding problems are seen in children whose mothers suffer from an eating disorder' (DSM-V, American Psychological Association, 2014)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650735544.0, "datetime": "2022-04-23T17:39:04", "subreddit": "EatingDisorders", "id": "i5wgarg", "text": "BED-like eating disorder. Doesn't need to fit the exact criteria, I would probably proceed with treatment in the exact same way with this presentation as I would for a clear case of BED.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651163224.0, "datetime": "2022-04-28T16:27:04", "subreddit": "EatingDisorders", "id": "i6juc3y", "text": "Agree. Temptations to binge are largely biological. It’s not until you actually eat consistently and foods that you ENJOY that you stop binging. \n\nThere are other things to work on, such as coping behaviors, but binging is largely a result of biological urges.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651181270.0, "datetime": "2022-04-28T21:27:50", "subreddit": "EatingDisorders", "id": "i6l3okh", "text": "Well, yeah.  Eating disorders are very difficult to recover from because there are neurological changes that really ground some belief systems - the best someone can do is actively try to throw out information they believe to be true in their mind. I often tell clients to “Check their certainty”. If you’re certain about anything, there’s a pretty high likelihood that you’re wrong. The paradox is real.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656010778.0, "datetime": "2022-06-23T18:59:38", "subreddit": "ARFID", "id": "idgrbkk", "text": "Sorry to hear that - look up dietitians around you (in your state is good enough with telehealth) with experience in eating disorders. HealthProfs is a site where you can search for this :). These types of issues require support from someone, even if they aren’t the most experienced with these specific issues they can be helpful for moving forward.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656012944.0, "datetime": "2022-06-23T19:35:44", "subreddit": "ARFID", "id": "idgwl5q", "text": "Best of luck with your recovery - you are resilient :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656442787.0, "datetime": "2022-06-28T18:59:47", "subreddit": "EatingDisorders", "id": "ie3995e", "text": "It’s not always true that eating more after a period of restriction leads to weight gain. I’ve seen the exact opposite plenty of times. In restriction your body does  make changes to reduce overall energy expenditure and with more consistent food intake it can begin to reverse these changes and in some people it can happen quite rapidly.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658080692.0, "datetime": "2022-07-17T17:58:12", "subreddit": "ARFID", "id": "igjjxe6", "text": "That’s one of the real concerns with ARFID. I explain this to clients who are less than motivated when they start seeing me for treatment. “Sure, you could potentially live and manage on your preferred foods” I tell them. However there are a few major concerns that pop up over time:\n\n1. Health and psychosocial issues are obvious. You CAN get to a place where many common foods are preferred, so why continue with the barriers to human connection as well as health implications. Humans from all cultures present and historical bond with food, it’s very important to engage with this.\n\n2. Dropped foods. Sensory fatigue is a really thing. This is well researched, and with ARFID and the limited food selection you run the risk of become more and more limited as time goes on if you don’t actively work through the anxiety and stress that accompanies eating. What happens if this gets down to one preferred food…or none?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658090720.0, "datetime": "2022-07-17T20:45:20", "subreddit": "ARFID", "id": "igk7c7g", "text": "Sorry about the lifelong struggles - just want to clarify that there is a way to improve with ARFID. It’s long an arduous, but it’s possible. Most with ARFID won’t become a “foodie” but it’s certainly possible to life a relatively normal and healthy lifestyle. Genetics do play a role, such as having sensitive taste genes, but this is only true for a subset of those struggling with ARFID. It’s best compared to other EDs in regards to treatment and length of time to recovery", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658148691.0, "datetime": "2022-07-18T12:51:31", "subreddit": "ARFID", "id": "igmxcwf", "text": "Yes, specifically an eating disorder Dietitian. Ideally one that has experience with ARFID. I’ve seen many people through a very successful recovery from ARFID.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658201681.0, "datetime": "2022-07-19T03:34:41", "subreddit": "ARFID", "id": "igqepfw", "text": "I don’t think it matters much, I’m an RD and do all telehealth. It’s just much easier for everyone and I think that’s a big draw for virtual.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658320216.0, "datetime": "2022-07-20T12:30:16", "subreddit": "ARFID", "id": "igwq067", "text": "Sure thing, please don’t send private health information but I can send you our links and everything for future correspondence :)", "parent_id": null, "link_id": null, "context": null}
