{"type": "comment", "timestamp": 1616518239.0, "datetime": "2021-03-23T16:50:39", "subreddit": "bulimia", "id": "gry3z2r", "text": "\\*Warning long post\\* This is extremely common and I find sugar to be a huge trigger for me too. I have completely stopped eating sugar because I get an immediate ED response to binge. There are some practical things you can do here in order to break this cycle. Structured Eating, Eat balanced Meals and Accept Delay Distract are from the book 'The Bulimia Help Method' by Ali Kerr & Richard Kerr. This book is a great resource and I highly recommend it.\n\n1. **Reach out.** This is one of the most important parts of recovery. If you don't have a therapist, dietician or coach, I highly recommend seeking professional help. You can recover on your own but if you have support it makes the process so much easier and you feel less alone. If professional help isn't an option then lean on someone you trust who you can contact when you are feeling urges or when you are trying to distract yourself. I'm connecting with my Mom at meals so that I don't binge and purge and it's been very helpful.\n2. **Remove the triggers**. If you find you are out of control around sugar, or any other triggering foods, it's ok to acknowledge this and temporarily stop eating/buying them. Keep them out of sight or better yet, don't buy them. If you order from food apps, delete those apps. Put as much friction between you and the behavior as possible. If you tend to drive to the store to buy binge food, put your keys in an obscure location so that you have to think about what you're doing before you act.\n3. **Structured eating**. Three meals and three snacks a day, no more than three hours apart. Retrain your mind and body to expect food often and regularly. This stabilizes blood sugar and reduces instances of binge urges. When you are well nourished, your body and mind don't have to send out signals to binge. If you are worried about weight gain, keep in mind that eating regularly is one of the best things you can do to maintain a healthy weight as it is a massive boost to your metabolism.\n4.  **Eat balanced meals**. Eat regular meals and snacks made up from fats, proteins and        complex carbohydrates. This will help to stabilize erratic blood sugar levels and in turn reducing those binge urges. I find sticking to whole, mostly unprocessed, low sugar, foods reduces my urge to binge. Nobody really wants to binge on strawberries but strawberry ice-cream is easy to binge on. Pick foods that feel safe to you and the least triggering.\n5. **Accept Delay Distract.** We can't control the fact that we get binge urges because of how our brains are wired to do this behavior. We can control how we respond to those urges. Accept the urge and remind yourself that the binge urge cannot control you, it is not dangerous and does not have to be fought.Delay taking any action towards your urge for 10 minutes and allow the urge to rise and fall. Distract yourself for those 10 minutes. Go for a walk, go for a drive, have a bath, talk to a friend, listen to music, immerse yourself in a project, work or play on your computer. Anything to distract you from those urges will help.\n\nI know how helpless and miserable you can feel in a binge/purge cycle. You are not alone and so many people are going through this right now. I hope even a little of this information was helpful and I'm sending lots of love and support your way ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616594194.0, "datetime": "2021-03-24T13:56:34", "subreddit": "bulimia", "id": "gs1r8eh", "text": "Huge success! This is amazing! It's great that you have all this positive evidence now to prove to your ED that you don't need it. Well done you! 💕", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616691095.0, "datetime": "2021-03-25T16:51:35", "subreddit": "bulimia", "id": "gs6uvcx", "text": "I'm so glad this has helped! It sounds like you are ready to take action and steps toward recovery. I do hope you bring it up to your therapist, removing the shame and secrecy around your ED is an important step towards healing. Sometimes it helps to write down what you want to say if you are anxious about it.\n\nA PhD is an amazing accomplishment! You should be so proud. I can see how binging and purging would feel disheartening to you. Even with all the education and knowledge you have, eating disorders are not rational. Binge urges are especially powerful, and it takes a lot of tools and practice to break them. You might be interested in this podcast called \"Binge Breakers.\" It has helped me a lot and it's free.\n\nI'm always happy when I can help someone, even in a small way. Sending a virtual hug back to you! 🤗 ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617115101.0, "datetime": "2021-03-30T14:38:21", "subreddit": "bulimia", "id": "gssz6vk", "text": "I've never had a drug problem but I have definitely experienced the addictive nature of bulimia. I found it especially addictive when I was ritualizing the behavior and going out to buy binge food, which is usually highly palatable, salty, sugary, fatty foods that give you a big dopamine hit. I've heard other people talk about having addictions and Eds and in a lot of cases ED's can be harder to treat because you can't abstain from food. I'm sorry you're struggling and I hope you can get some help and break out of this cycle soon ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617915696.0, "datetime": "2021-04-08T21:01:36", "subreddit": "bulimia", "id": "gtuu2da", "text": "Yes! I just resisted a binge myself! It does feel amazing doesn't it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618585063.0, "datetime": "2021-04-16T14:57:43", "subreddit": "bulimia", "id": "guqbs3f", "text": "I'm so sorry you are feeling this way. I really feel your pain and I want you to know you are not alone. Are you able to seek treatment for your ED? If you are, I urge you to reach out. You do not have to suffer in silence and there are so many ways in which a therapist, coach, or counselor could help you. It is so important to have support because ED's thrive in isolation. Many people with EDs have struggled recently with the pandemic, especially if they were in quarantine or lock down. If you can't afford treatment then even reaching out to a friend or a loved one will help. \n\nBody image is so hard. I'm struggling with mine now as I'm going through recovery and gaining weight. Think of a few things that you can do for yourself that would make you feel even the tiniest bit better. You could buy yourself something cute to wear that feels good to you. If clothes are too triggering then maybe a cute pair of shoes or an accessory. I got really into nails, makeup and jewelry because clothes are problematic. It doesn't have to be related to your appearance either. You could do an activity or project, go somewhere, talk to someone, pet a puppy, anything that you would enjoy. Even the smallest thing can make a difference. Our eating disorders want us to punish ourselves but we do not have to. We can treat ourselves with love and kindness, even if we don't believe that it will work or that we deserve it.\n\nThose people should not have said those things to you. You do not need to drink teas and you are a worthy human being regardless of what people are saying to you. Those thoughts of body hatred are coming from your ED. If a loved one came to you and said that they hated their body, how would you respond? You probably wouldn't say, \"you're right, you should hate your body.\" You would  say something kind and supportive. You can treat yourself with the same kindness, even when the ED is loud and overwhelming. It does not have to run the show, you have the ability to respond to it and advocate for yourself. I'm sending you lots of love and support. \n\nIf you are in the US, the national eating disorders association has a free hotline. \n\n1-800-931-2237 Monday-Thursday from 9:00 a.m.- 9:00 p.m. and Friday from 9:00 a.m. - 5:00 p.m.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620083293.0, "datetime": "2021-05-03T23:08:13", "subreddit": "bulimia", "id": "gwublkz", "text": "I'm 33 f and I have had an eating disorder since I was 15. It started as anorexia and morphed into anorexia/binge purge subtype and then eventually bulimia. I used to get a lot of unwanted attention around my body as a teenager, mostly stares, comments and unwanted touching. I lost weight because I wanted to feel safer in my body but unfortunately it turned into an ED. My bulimia kicked in hard around 2016 when my sister got married and I lost a lot of friends. I turned to bulimia because I felt so alone and I still really hated myself. I started my recovery four years ago, it's been a very slow process for me. I still struggle with thoughts, urges and behaviors and I am not completely free of them. I'm working with a recovery coach and I'm making good progress. I'm here to help others but also to help myself along the way.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620232915.0, "datetime": "2021-05-05T16:41:55", "subreddit": "bulimia", "id": "gx1ma7v", "text": "Thank you! I appreciate the support. My very first steps towards recovery were first telling my Mom. Reaching out and telling someone can really get the ball rolling. I also read books and consumed a lot of recovery content on YouTube. I really wanted to be free of bulimia but I couldn't do it on my own, no matter how many books I read or videos I watched. A YouTuber, who I really admired and related to, happened to also be a recovery coach so I reached out to her. I was lucky enough to get a spot and I have been making much better progress than I did on my own. \n\nTaking any steps, no matter how small, is a good thing. It could be reading books or telling someone or finding a therapist/coach, even coming on this forum. No matter what you decide to do, you will never feel 100% ready to recover. There is no perfect time or level of preparedness. You just have to make the decision and start taking steps.\n\nHere are some of the resources I used/currently use in recovery. \n\nBooks: [The Bulimia Help Method](https://www.amazon.com/Bulimia-Help-Method-Revolutionary-Approach-ebook/dp/B00PB7JI5A) by Ali Kerr and Richard Kerr, [8 Keys to Recovery From an Eating Disorder](https://www.amazon.com/Keys-Recovery-Eating-Disorder-Therapeutic/dp/0393706958) by Carolyn Costin\n\nYouTube: [WhatMiaDidNext](https://www.youtube.com/c/WhatMiaDidNext/featured), [Megsy Recovery](https://www.youtube.com/channel/UCey1WBhNthBx0vDy-pHe9uw), [Binge Breakers](https://www.youtube.com/channel/UC9bGHx5Vr96hjaN5oDZlcFA)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620834428.0, "datetime": "2021-05-12T15:47:08", "subreddit": "bulimia", "id": "gxv660q", "text": "No trouble at all. I'm not personally a recovery coach but I am working with a coach at the moment. I like to come on this forum and try to help others and share some tools/tips that I've learned. I know how difficult recovery can be, especially if you don't have professional help. I can link you to a great video that my coach did about overshoot weight. You can find her video [here](https://www.youtube.com/watch?v=eHhOUivBCMo).\n\nI definitely understand the temptation to go back to your ED and to lose weight. I relapsed last spring after gaining weight and not having the proper tools to help with body image. I went back to restriction which then led me back to bulimia and now I am climbing out of that relapse. Your ED is telling you that your body is the problem but in reality it's your eating disorder that is the problem. A big part of recovery is learning how to talk to yourself and how to accept your body. You don't always have to love it but you can accept it and treat yourself with kindness.\n\nThere is a great tool you can use to help with body image. Imagine a friend or a loved one who is in your position. They are in recovery and now they are struggling with their body image. What would you say to that person? I'm sure it would be something kind, compassionate and supportive right? That is your healthy self. When you are having ED thoughts about your body, try to respond to them in the way you would for another person. Your ED voice doesn't have to dominate your headspace, you have the ability to respond to it and to change the story you are telling yourself. I hope this helps! ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621003272.0, "datetime": "2021-05-14T14:41:12", "subreddit": "bulimia", "id": "gy3s4t1", "text": "I'm so sorry you're struggling, I definitely understand how you feel about food. Bulimia is very all or nothing, you're either restricting or you're binging and purging. I understand how hopeless you can feel and you wonder if you will ever be able to have a better relationship with food. I have a couple of suggestions that may help. \n\nIf you have access to professional help, please seek it out. I say this to everyone in this forum because it is so important. I was in the same spot as you and I felt completely hopeless, now I have a coach and I have made amazing progress in my recovery. Professional help can provide you with the tools you need to combat this illness. You don't have to fight this alone, and it is so much easier when you have guidance.\n\nIf professional help isn't an option, do you have anyone who can sit with you while you eat? I was really struggling with eating normally too and now I have my Mom sit with me at most meals so I don't binge and purge. It can really help to have someone who is aware of your ED and who can sit with you for 60-90 minutes after a meal. If you don't have someone who can sit with you, is there someone you can call or reach out to? Connection is so important in recovery and having people who can support us goes such a long way. Most of us binge and purge in private so if we can reach out to people, it can prevent you from engaging in those behaviors.\n\nIf you don't have someone to reach out to, there is an amazing tool where you dialogue between your ED voice and your healthy voice. Write down the things your ED is telling you and respond to them. Your eating disorder does not have the final say, you can talk back to it and this really impacts your actions. If you start to keep track of the things your ED is saying, you can start to recognize its patterns, thoughts and beliefs and begin to challenge them. Here are a few examples;\n\n**ED Thought**: I'm just going to binge and purge this food anyways, I might as well buy all my binge foods. \n\n**Healthy Self**: I don't have to binge and purge, and my eating disorder cannot predict the future. I am going to buy food with the intention of not binging and purging.\n\n**ED Thought**: Even when I am at a healthy weight I will be miserable, so I might as well be thin and miserable than fat and miserable. \n\n**Healthy Self**: You can't predict how you will feel at a healthy weight because you have never been there long enough. All you know for sure is that you are absolutely miserable and alone when you are sickly thin. This is a known fact, whereas you don't know how you will feel if you gain weight and become healthy.\n\nIf you are buying food at the store and your ED is already telling you that you're going to binge and purge, it will most likely happen. If you talk back to it and reframe your intentions around the food, your actions are more likely to shift. You have a lot more power than you realize and your eating disorder does not get to have the final say. If you are having trouble getting in touch with your healthy voice, imagine what you would say to someone else. \n\nI hope some of this was helpful and I promise you that there is hope. I'm sending lots of support and love your way ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621275052.0, "datetime": "2021-05-17T18:10:52", "subreddit": "bulimia", "id": "gyh1sck", "text": "This is actually how a lot people recover. I think there's a misconception that you have to eliminate behaviors completely in order to recover but that doesn't work for everyone. Some people can go cold turkey, but for a lot of people reducing instances of binging/purging over time and taking small steps will lead to lasting recovery. I went from binging and purging multiple times per day to two times per month. I know that is progress. I say walk slowly, but never backwards.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621282205.0, "datetime": "2021-05-17T20:10:05", "subreddit": "bulimia", "id": "gyhiu0v", "text": "Everyone is so different! It's always important to track your unique progress. Reduction of behaviors over time is my goal as well. I still battle urges to binge/purge but I'm using tools like dialogues and urge surfing to deal with them. Finding new ways to cope takes time and a lot of trial and error. I'm happy to hear that you are taking small steps forward. Recovery is like building a house, you have to lay one brick at a time.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621697334.0, "datetime": "2021-05-22T15:28:54", "subreddit": "bulimia", "id": "gz2atv0", "text": "This sounds like body dysmorphia which is very common in those with eating disorders. You can help yourself if you start reducing body checking behaviors. If you are aware that checking your body after eating triggers your eating disorder then try to avoid doing that. Especially avoid checking your stomach because yes, it will look bigger after you've eaten. It doesn't mean you are disgusting, it just means your stomach has food in it. I used to body check first thing in the morning and that would determine how the rest of my day was going to go. I found that once I stopped doing that, my eating disorder stopped showing up in the morning. \n\nAnother great tool you can use are dialogues between your ED self and your Healthy self. We all have an ED self and it usually is abusive, negative, critical and cruel. We also have a Healthy Self that we are all born with and it usually shows up for other people. Whenever you have an ED thought about your body, write it down and respond to it. It helps to imagine what you would say to a loved one if they were having negative thoughts about their body. For example:\n\nEd Thought: Eating food makes me look disgusting\n\nHealthy Self: You do not look disgusting, nothing has changed about your body just because you have eaten. Your body image cannot be trusted because it is warped. You deserve to eat and to treat yourself with kindness.\n\nThis is a very powerful tool that will help you identify what your eating disorder sounds like and what it's messages and beliefs are. Your eating disorder is going to keep telling you that your body is disgusting so that you will keep relying on it. Every time you challenge your ED, you weaken it. I hope this made sense and I'm sending lots of support your way. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623021534.0, "datetime": "2021-06-06T23:18:54", "subreddit": "bulimia", "id": "h0ukqak", "text": "This is awesome! So happy for you. I would journal about this win so that you have evidence that you are 100% capable of not binging and purging. You are amazing and should feel so proud 💕", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623620221.0, "datetime": "2021-06-13T21:37:01", "subreddit": "bulimia", "id": "h1ny3bo", "text": "This isn't basic in the least, it's actually very profound. We all want to be loved, accepted and admired. There is this projection that being skinny makes you bulletproof and invulnerable to pain. It just isn't true. I think working towards self love is a great goal to have. I'm sure there are so many things about you that you can be proud of. Gratitude goes a long way in helping us realize that we are enough and worthy of love. Excellent realization!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623709643.0, "datetime": "2021-06-14T22:27:23", "subreddit": "bulimia", "id": "h1s7a0m", "text": "I have been there and it is a horrible place. The shame, the self loathing, the pain both mental and physical. I used to not be able to go a day without binging and purging multiple times a day. It's much different for me now and it is possible to recover. Please seek help because you are much more likely to break the cycle with the guidance of a professional. I know it seems impossible and that you will never escape the cycle of bulimia. I promise you, if you are willing to make a change, you will be amazed at what you are capable of. Sending you lots of love and support ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624299793.0, "datetime": "2021-06-21T18:23:13", "subreddit": "bulimia", "id": "h2kbdp6", "text": "I have definitely felt this way before when I was in the grips of my eating disorder. It warps your priorities and your sense of self. You said you want to eat normally and not feel bad, you want to enjoy and have fun in life. Those are YOUR priorities. Your eating disorder is the thing that is scared of gaining weight and who just wants to be skinny. If you are at all interested in recovery, you need to start questioning these eating disorder beliefs. Some examples of questions that you could ask your eating disorder are;\n\nQuestion: What do you think will happen if you gain weight? \n\nAnswer: I will hate my body, I will be uncomfortable, I will be rejected by people, people will judge me.\n\nThe reality is, your eating disorder is doing all of those things. Your eating disorder is judging you, rejecting you, making you hate your body, making you uncomfortable. You need to look at the truth of what your eating disorder is actually giving you. Is it something you really want to hold onto?\n\nQuestion: What could go well if I recovered and potentially gained weight?\n\nAnswer: I could feel better about myself, I could be healthier, I could have more time and energy for things that I enjoy, I could pursue my interests, I could try new things, I could deepen my existing relationships or form new ones, I could learn to accept myself, I could be happier, I could feel free.\n\nJust some things to think about. Not everyone is at a stage where they are ready to look at these deeper issues. You might not be ready and that's ok. I hope you get to a place where you realize you deserve more than the shit your eating disorder makes you put up with. You deserve a happy and full life. Sending lots of love and support. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624406877.0, "datetime": "2021-06-23T00:07:57", "subreddit": "bulimia", "id": "h2pn7tr", "text": "That makes me sad for them and happy for you. Eat that food and enjoy it! You are amazing and you should be super proud! Also, it may be in your best interest to tell them that those comments are triggering. You have the power to establish boundaries with your friends and if they truly are your friends they will respect those boundaries.\n\nPetty side note....how sad and boring is it to brag about not eating? Like don't you have something more interesting to talk about?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624490293.0, "datetime": "2021-06-23T23:18:13", "subreddit": "bulimia", "id": "h2tpn83", "text": "I understand what you mean because bulimia is horrendous and torturous. You think that anything must be better than living with bulimia. Anorexia is it's own hell, there are just slightly different demons to contend with. Wanting to trade in your bulimia for anorexia is a bit like wanting to swap one abusive partner for a different abusive partner. They both suck, they both make you miserable and you feel trapped. \n\nI totally know how it feels to want to recover but you're still holding on so tightly to your ED. Googling ana tips, looking at super thin models and what I eat in a day videos is not helping you. You are making things so much more difficult than you need to. Try broadening your interests outside of what you look like. Start exploring who you are, what you are interested in and your relationships to other people. Those are the things that truly matter in life.\n\nI hope you are able to continue in your recovery and not let this relapse get you down. Keep fighting because you are 100% deserving of a better life. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624901325.0, "datetime": "2021-06-28T17:28:45", "subreddit": "bulimia", "id": "h3cc3qv", "text": "I know how this feels and it's horrible. In these situations you get tunnel vision and all that matters is how you look or how dissatisfied you are with how you look. For those in recovery it is really helpful to limit mirror time. I have my full length mirror covered so that I'm not constantly looking at myself and I am working on not body checking in the mirror. Human beings were not meant to be looking at ourselves as much as we do now. Whether it's in mirrors, pictures, social media or zoom, all of this is way too much time spent looking at ourselves, and criticizing how we look. For your own mental health, be aware of how much time you spend in the mirror or taking photos. Try to limit that time so that you don't end up spiraling.\n\nThere's a great tool to reframe how you feel about your body/appearance. Even if you don't have children or want children, this can still be helpful.\n\nImagine you have a daughter and she is your exact age, she looks identical to you, she is exactly where you are in your life right now. She is struggling with her body image and how she looks. She feels bad about herself, she obsesses, she spirals and cries. What would you say to her? What advice would you give her? How would you comfort her? Would you try and help her see the bigger picture? Would you tell her that she is right and she should feel bad about herself?\n\nThis kind of exercise should help you realize that you are deserving of the same compassion, love and care that you would give to your hypothetical daughter. You are so much more than how you look. You are a complex human being with so many amazing traits and your body is just a vehicle. It helps you live your life and do all the things that you want to do. Focus on all that you do have and what your body allows you to do instead of tearing it down. I promise if you keep trying to change the way you talk to yourself, you will start to see yourself in a whole new light. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625432444.0, "datetime": "2021-07-04T21:00:44", "subreddit": "bulimia", "id": "h429gwy", "text": "Three days binge/purge free is amazing! That is really difficult and you should congratulate yourself. I totally know how you feel. For a long time one of my favorite things to do was buy binge food, binge and watch Netflix, then purge. Then that became the only thing I wanted to do, all day, every day. Those were some of the worst days that eventually lead me to my rock bottom.   \nI know what it feels like to want to escape your life, to feel good even just for a little while. It seems like it's all you have, and that is because you have made it your whole world. What is so bad in your life that you are seeking to numb or escape from? For me it was loneliness, feeling lost or without purpose, feeling left behind and feeling inadequate. I realized what I really wanted wasn't binging and purging. I wanted friends, I wanted to travel and experience things, I wanted a passion, I wanted connection and I wanted to let my creativity grow. When you look beyond the food and the temporary pleasure it gives, what do you really want out of your life? What is binging and purging taking the place of? I promise there is more to life than bulimia. The good news is that you get to decide what takes its place. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625874684.0, "datetime": "2021-07-09T23:51:24", "subreddit": "bulimia", "id": "h4ncwl9", "text": "That is such a great story and you sound like such a kind person. It makes me feel good to know there are dentists out there who are not only seeking to help but also to understand. I have avoided the dentist for years because I was afraid of being judged or shamed. Ideally I would want my dentist to focus on addressing any current issues and how to take care of my teeth in the future. One thing that is helpful to know is after vomiting, teeth should not be brushed for at least an hour to allow the acid conditions created in the mouth to settle down. If the teeth are brushed immediately after vomiting, acid is brushed directly into the tooth surface causing further destruction. It's best to rinse your mouth with water, mouthwash or a water and baking soda solution immediately after vomiting. \n\nYou can't stop someone from purging but you can treat immediate issues and help the person protect their teeth moving forward. Thanks for being so compassionate! ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1629393294.0, "datetime": "2021-08-19T17:14:54", "subreddit": "bulimia", "id": "h9k05n9", "text": "You deserve to eat and it's totally ok! I know you feel anxious right now but just breathe and wait it out. Distract yourself with something, go for a walk, clean, do a project, work, anything to get your mind off of it can be really helpful. You are doing amazing! ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1633544892.0, "datetime": "2021-10-06T18:28:12", "subreddit": "bulimia", "id": "hfmu47s", "text": "I really felt this. I'm so sorry you're struggling. Try to have some self compassion. Forgive yourself because you are doing the best you can. Eating disorders love to use lapses as evidence that we can't recover. Your ED wants to zoom in on the bad stuff, and ignore all of the good. Do not let it convince you that you can't recover. You 100% can recover.\n\nTry to focus on what's been going well. What are some wins that you have experienced lately? Is there an area where you are making progress? Did you use to binge more often? When it seems like recovery is impossible, try to zoom out and look at the whole picture. There is always something that has either gotten better or changed in a positive way. No matter how small it is. Be patient with yourself. Keep going. You can do this. 💜", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1633627989.0, "datetime": "2021-10-07T17:33:09", "subreddit": "bulimia", "id": "hfr43op", "text": "What an incredible accomplishment! I am so happy for you and thank you for sharing. Recovery is a long and winding road. As long as we keep putting one foot in front of the other, we can get to a much better place. Keep up the amazing work! 💗", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1635182853.0, "datetime": "2021-10-25T17:27:33", "subreddit": "bulimia", "id": "hi0bovf", "text": "What an incredible and inspiring story. It takes a really strong person to do what you have done and I hope you know how amazing you are. I'm a longtime ED sufferer too (15+ years.) I've been in recovery for 4 years and I never thought I would be where I am today. I know what it takes to recover and I truly believe we are superheroes. Keep on fighting! 💕", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1635615920.0, "datetime": "2021-10-30T17:45:20", "subreddit": "bulimia", "id": "hio1mdm", "text": "You need to seek medical attention if you are purging blood. Esophageal tears are common in those with bulimia and they can be fatal. \n\nThis is beautifully done artwork capturing a very disturbing moment. I love the colors and the emotions come through loud and clear. Scared, sad, disturbed, trapped, miserable, regretful. \n\nPlease take good care of yourself. 💜", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636141939.0, "datetime": "2021-11-05T19:52:19", "subreddit": "bulimia", "id": "hjghk4t", "text": "Thank you so much for sharing your story. It is wonderful that you have reclaimed your life from such an all consuming illness. You should be so proud of all your efforts and hard work. \n\nI had an eating disorder for over 15 years and it can be incredibly difficult for long time sufferers to recover. I can relate to a lot of your story and you are definitely not the only one who has gone through this. I've been in recovery for 4 years and it's been a journey. Recovery is incredibly difficult but infinitely worth it. I feel like I recovered my true self, the person I was before I ever got sick, the little girl who was always on her own side.\n\nYou mentioned \"cutting down in a healthy way\" which is a bit concerning. When I first went into recovery, after about six months, I had gained weight. The weight gain was torturous to my eating disorder, which was still present in my thoughts even though my behaviors were gone. I went on a diet in order to lose it the weight and I told myself I was doing it in a \"healthy way.\" I ended up relapsing and it took me over a year to climb out of that relapse. I urge you to be careful because this kind of thinking can be a very slippery slope. I'm not saying this will happen to you, I just want you to be aware that your eating disorder can still be active in your thoughts and use the guise of \"getting healthy\" in order to weasel its way back into your life.\n\nYou are amazing, strong and you have your whole life ahead of you. Take good care and keep up the fantastic work. Lots of love! 💗", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636221532.0, "datetime": "2021-11-06T17:58:52", "subreddit": "bulimia", "id": "hjkrwao", "text": "My pleasure! It's always helpful to have others to cheer us on, no matter what stage we are at. Connecting with people who have been there has been so great for my recovery. We are all in this together. \n\nJust to clarify, I'm 4 years in recovery but not 4 years without purging. I'm more like 1 year without purging. Recovery has been quite a journey for me and definitely not linear.\n\nAt the beginning of recovery my digestion was really bad and I would get severe bloating/pain. Luckily that didn't last for more than a few weeks and it drastically improved. I was extremely emotional during recovery and my moods were all over the place. After having numbed myself for so many years, suddenly I was no longer numb and I was feeling everything. This was actually good even though it was difficult. Tolerating difficult emotions is a life skill and I'm forever grateful that I have this ability. \n\nI have a bit of acid reflux but its getting better all the time. I need to make a dental appointment which I've been putting off. I'm not experiencing any tooth pain or issues but I know it's a good idea to get checked out. The body is amazing at healing itself and I've been very lucky that my physical health is good.\n\nI'm glad to know you are aware of the risks around losing weight and that you are being careful. You sound like you're in a really good place and you have a lot of self awareness.  \n\nCheers to us and to recovery! 💜", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636643020.0, "datetime": "2021-11-11T15:03:40", "subreddit": "bulimia", "id": "hk7jamo", "text": "I'm so sorry that this happened and that you are ok. This happened to me about 10 years ago and it was incredibly traumatic. I also had to go to the hospital and get an endoscopy. Most doctors aren't trained in the area of eating disorders and I received very few questions about my ED.\n\nI'm so glad you are ok. We are both very, very lucky. \n\nGet some good rest. Be kind to yourself. Sending you lots of love and support. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638207786.0, "datetime": "2021-11-29T17:43:06", "subreddit": "bulimia", "id": "hmjzkn4", "text": "Congratulations! This is incredibly exciting and I'm wishing you the best of luck on your recovery journey. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638211932.0, "datetime": "2021-11-29T18:52:12", "subreddit": "bulimia", "id": "hmka0qi", "text": "Way to go! Keep up the good work! 💜", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648856387.0, "datetime": "2022-04-01T23:39:47", "subreddit": "bulimia", "id": "i31qh24", "text": "You are not alone. I had many years of severe depression coupled with an eating disorder. I would sometimes go months without showering (not an exaggeration.) That was probably the worst year of my life and I didn't leave the house for nearly an entire year. \n\nA lot the reasoning behind this was 1. Complete lack of motivation and energy to care for myself, 2. Wanting to avoid my body and feeling disgusted with myself and 3. I wanted to punish myself. \n\nI can definitely relate to the perfectionism and the black and white thinking. I often had thoughts like \"If I can't be perfect, why bother trying at all?\" or \"I'm disgusting, useless and a failure, I deserve to live in my own filth.\" or \"I'm already beyond help, I will just make things worse for myself.\" I definitely wanted to avoid people and places and self neglect was one way I could do that.\n\nSome practical tips might be things like, showering with the lights off or low light, limiting the amount of time you spend in the shower or setting a time limit, covering mirrors (my mirrors are all covered) and limiting time spent in front of mirrors in general, having some fun music playing to distract you and buying yourself a really nice smelling shampoo or soap.\n\nI really hope you are able to find a better therapist because this is something you can absolutely overcome. The most important piece of the puzzle is how you talk to yourself and that is something you can work on with a therapist. I had the most horribly abusive voice in my head and with the help of therapy and a recovery coach, I have completely changed how I speak to myself and how I see myself. \n\nI know how hard it is. I'm sending you so much love and support. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648912666.0, "datetime": "2022-04-02T15:17:46", "subreddit": "bulimia", "id": "i346xd5", "text": "I'm so glad I could help and there is absolutely hope. Depression feels horrible and like it will never end but it's actually very treatable. I personally was able to come out of it with the help of medication as well as therapy. \n\nI was also obsessed with the mirror and how I looked. I started covering my mirrors last year to help with my eating disorder recovery. Every encounter with the mirror gave the eating disorder a reason to show up and criticize every part of me. Humans were not meant to look at ourselves as much as we do now with multiple mirrors in every room, social media, Zoom, it's endless! It's amazing how much of a difference not looking at myself all the time has made. It was a really hard habit to break at first but I'm so glad I did. My mind is much happier and freer to focus on things that bring me joy. Give it a try for a week and see if it makes any difference. Best of luck!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652302309.0, "datetime": "2022-05-11T20:51:49", "subreddit": "bulimia", "id": "i88f8so", "text": "I just chipped a tooth and I need to go to the dentist. I'm so terrified to know the damage and I have been avoiding it forever. I know I need to go though in order to take care of my teeth. Thanks for sharing this and I hope you are healing well.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658236737.0, "datetime": "2022-07-19T13:18:57", "subreddit": "bulimia", "id": "igrvzw0", "text": "I'm sending so much love your way and I am so sorry you are going through this. Thank you for sharing your experience even though it is a painful one. There are so many young people on here who have only just started with binging and purging and I hope they see this post. This is a serious illness with very real consequences, not just a \"neat trick for weight loss.\" I'm just sorry you are dealing with this right now and I hope the treatment you receive is able to manage your symptoms and the pain.❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1660260178.0, "datetime": "2022-08-11T23:22:58", "subreddit": "bulimia", "id": "ijxaw54", "text": "I'm sorry you have people in your life who are not supportive. Whoever is telling you to \"grow out of it\" is ignorant about what eating disorders actually are. Some people are lucky enough to have early intervention and recover not long after their eating disorder develops. Statistically, early intervention has a high success rate in terms of making a full recovery. People don't realize that in those instances, it doesn't mean it was just a phase, it just means they caught it early and recovered sooner.\n\nI know people who have fully recovered from their eating disorder so I disagree that you can't fully recover. There are many people who have fully recovered, some people partially recover, and some people don't recover. It's very individual and there is a broad range of where you might fall on the recovery spectrum. \n\nI agree that you need to have self compassion in recovery and that nobody should expect themselves to have a \"perfect\" recovery. Beating yourself up for not being \"recovered\" yet isn't going to help.\n\nYou don't know that you won't fully recover! You are assuming things cannot change but what if they do? Your experience now might not be your experience in a few years. Nobody who makes a full recovery does it overnight. Some people need 10 years to recover but they still do it. For some, it takes time.\n\nDon't lose hope. Recovery is possible.💜", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671120835.0, "datetime": "2022-12-15T16:13:55", "subreddit": "bulimia", "id": "j0c6fkz", "text": "No apologies necessary! Even though it's hard, I am so happy to hear you are in your recovery process. It is completely normal to feel stuck and if you are recovering on your own, the process can seem even more challenging.\n\nI definitely experienced extreme hunger and mine lasted for several months. I'm currently working with a recovery coach who is an incredible resource and knows a lot about recovery and eating disorders. Here is a link to a video of hers where she discusses extreme hunger.\n\n[Dealing with Extreme Hunger in Recovery](https://www.youtube.com/watch?v=zh5PnDS0xsI&t=3s)\n\nI tried \"all in recovery\" but I ended up relapsing after a year and that method did not work for me. When I started working with my coach we used a meal plan which included 3 meals and 2-3 snacks a day, eating every 3 hours. I still follow this structure of eating just to ensure that I am getting enough food and keep my blood sugar levels stable.\n\nRemember there is no \"right way to recover\" there is only what works for you. If you have any more questions feel free to message me. I am more than happy to help. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1705172669.0, "datetime": "2024-01-13T19:04:29", "subreddit": "bulimia", "id": "khpdkge", "text": "Well done! You should be so proud of yourself! Keep up the fantastic work. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1711648233.0, "datetime": "2024-03-28T17:50:33", "subreddit": "bulimia", "id": "kwzjmav", "text": "Thank you for sharing your story. From what I read, you are an incredibly strong person who has worked so hard to get what they want. I want you to know that the knowledge, experience, confidence and progress you have made isn't lost. All of those things are yours forever, not even a relapse can take them away from you. \n\nI had a bad relapse back in 2020 after over a year with no behaviors and have since fully recovered. For me, my body image was the wall I hit that allowed my eating disorder back in. And it turns out that my body image issues were tied to trauma I experienced as a teenager. Sometimes we think we have recovered but there are stones that we haven't unturned or things we haven't fully addressed. Eating disorders can be alarm systems for something inside that hasn't been resolved. If you can think of anything at all that might have triggered this relapse, it could be really helpful in moving forward in your recovery. \n\nIn my experience, letting go of the shame, feelings of failure and reaching out for help was the best way to pull me out of my relapse. If you have access to help, I strongly recommend working with someone who specializes in eating disorders. Sometimes we don't know how deep these things go until we have the guidance of a professional. If you don't have the ability to seek support, return to what was working before. Add in anything that has fallen out of rotation that was helping you in your recovery. What has worked in the past will likely work again.\n\nSending you so much love and support. 💜", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1711734216.0, "datetime": "2024-03-29T17:43:36", "subreddit": "bulimia", "id": "kx519h7", "text": "I totally get it, I had some awful experiences in therapy which made me adverse to the whole thing for a very long time. It's difficult to find someone knowledgable and trustworthy who also understands us. It sounds like you have a plan in place and that is really the main thing. \n\nI know how discouraging a relapse can be especially after you have been doing so well. It's really hard to come to terms with the fact that you have more work to do despite thinking you were done. The most important thing is that you don't give up. The people who do not recover are the ones who, for whatever reason, stop trying. It may take longer than you initially thought but the things that are worthwhile in this life rarely come quickly or easily. You absolutely can get back to where you were and you will probably be even stronger this time around. You got this. 💕", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718926798.0, "datetime": "2024-06-20T23:39:58", "subreddit": "bulimia", "id": "l9jhwr7", "text": "After 15+ years of struggling with an eating disorder, I consider myself to be a \"normal eater.\" I know this isn't a neutral response, but I always err on the side of hope in this sub. Whoever you are, no matter how dark things get, there is always hope. If recovery is possible for me, it is possible for anyone. Sending you lots of love. 💜", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736028822.0, "datetime": "2025-01-04T22:13:42", "subreddit": "bulimia", "id": "m5f8ol3", "text": "I can relate to this, I had anorexia binge/purge subtype and the bulimia became much more dominant before I decided to recover. It's so important to acknowledge the pain and confusion behind this thought process, but let’s gently challenge some of the disordered logic here:\n\n**ED**: \"Anorexia made me feel in control.\"  \n\n**Reality**: Anorexia creates an illusion of control, but it’s the disorder controlling you—not the other way around. The choices, rituals, and restrictions are dictated by the eating disorder, often at the cost of your physical and mental well-being. True control comes from making decisions that align with your health and values, not a disorder's demands.\n\n**ED**: \"Anorexia made me feel clean, and bulimia makes me feel dirty and disgusting.\"  \n\n**Reality**: These are moral judgments that eating disorders impose on behaviors, but eating or even purging doesn't determine your worth or cleanliness. These feelings often stem from shame and guilt, which are perpetuated by the disorder itself. Your inherent worth is not tied to your body or your behaviors.\n\n**ED**: \"I miss my sick body and the strength it gave me to not eat.\"  \n\n**Reality**: That \"sick body\" was not a sign of strength but of suffering. Your body deserves nourishment, care, and compassion. Missing the \"sick body\" is common because the eating disorder distorts your mind to equate thinness with value, but thinness is not synonymous with health, happiness, or worthiness.\n\nAcknowledging these thoughts takes courage, and it’s okay to sit with the confusion and conflicting emotions. These feelings are a reflection of how much the eating disorder has taken over and how deeply it can distort your perspective. But you are more than the disorder’s demands or definitions. There’s a world beyond these thoughts—a world full of possibility, connection, and self-discovery, waiting for you to explore it in your own time and way. Whatever step feels right for you right now, know that you’re not alone. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736188506.0, "datetime": "2025-01-06T18:35:06", "subreddit": "bulimia", "id": "m5qjr4d", "text": "I'm so glad you found it helpful. I remember how deeply I believed these disordered thoughts, and it’s incredibly confusing to live with a mental illness that twists your reality and convinces you of things that aren’t true about yourself or the world. It’s such a brave step to recognize those distortions for what they are, and even just questioning them shows so much strength and self-awareness. Be gentle with yourself as you process all of this—it’s not easy, but every small realization is a step toward clarity and self-compassion. You’re doing an incredible job just by engaging with these thoughts in this way.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736189264.0, "datetime": "2025-01-06T18:47:44", "subreddit": "bulimia", "id": "m5qltxj", "text": "I’m here to provide hope and support to those who are struggling, especially those who don’t have access to treatment, which is unfortunately the reality for many in this sub. I'm recovered so that means I no longer have disordered thoughts or behaviors. Being here doesn’t trigger me.\n\nIt’s important to acknowledge that the desire to recover often exists alongside fear, uncertainty, and resistance—that’s the nature of eating disorders. Comments like this dismiss the possibility of recovery and the effort so many here are putting into their journeys, no matter where they are on the path. Even if someone isn’t ready to fully commit to recovery, being here, reading posts, or seeking connection shows a part of them is searching for something better.\n\nI recognize that this comment may come from a place of hurt or discouragement. However, judging others for where they are in their recovery is not helpful and undermines the hope and support this space is meant to provide.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738025838.0, "datetime": "2025-01-28T00:57:18", "subreddit": "bulimia", "id": "m9k14mm", "text": "Fantastic!! Big congratulations to you and all your hard work!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743807085.0, "datetime": "2025-04-04T22:51:25", "subreddit": "bulimia", "id": "mlgd8rk", "text": "There’s no one-size-fits-all path to recovery — only what works for *you*. I’m genuinely so happy for you and proud that you’ve found something that helped quiet the noise after so many years. That’s no small thing. Thank you for being brave enough to share this, especially knowing how controversial it can be.\n\nI understand why some people might be uncomfortable with this — it’s a complex topic, and the idea of using medication in recovery challenges a lot of deeply held beliefs. But that doesn’t mean it’s irresponsible to talk about. Eating disorders have the highest mortality rate of any mental illness, and for many people, traditional treatment alone isn’t enough. We *have* to be open to conversations about what actually helps people survive — and ultimately, recover.\n\nSemaglutide and similar meds are tools, and for some people, they can be life-changing *when* used responsibly and thoughtfully, like you’ve done. I 100% agree they deserve a place in the conversation because we obviously cannot ignore such a powerful option. You deserve to live a life that isn’t ruled by ED thoughts, and I hope this is just the beginning of so much more peace for you.❤️", "parent_id": null, "link_id": null, "context": null}
