{"type": "comment", "timestamp": 1605233246.0, "datetime": "2020-11-13T02:07:26", "subreddit": "fuckeatingdisorders", "id": "gc41qc5", "text": "I could have written this post. I’m sorry you’re struggling so much, I’m right there with you. This sucks and I’m sick of it too.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1605663352.0, "datetime": "2020-11-18T01:35:52", "subreddit": "fuckeatingdisorders", "id": "jw6ft2", "text": "And these meals actually looked more like meals than my usual. I usually eat 3 meals a day with lots of snacks, but these meals are often very low calorie/restrictive. The other day I posted about still losing weight despite feeling like I eat a lot and I was advised to increase certain calorie dense foods.\n\nSo for the last two days I’ve had *toast* with my usual omelette and fruit for breakfast, and instead of a plate of veggies, fruit, jerky and dip for lunch I made an eggplant wrap with an *actual tortilla* and a cup of frozen mango. I’ve also snacked on some dried fruit and had a chocolate that my grandma sent which I also never would have done. Oh! And I took a bite of the pot pie filling my mother made which I know for a fact was absolutely laden with butter, and in the past I would have vehemently refused to do so (or lied about having done it). \n\nDo I feel good? No, I’ve actually been pretty nauseous all day, probably because my body isn’t that used to “carbs” (I hate referring to wheat products are carbs because hello, fruit and veg are also carbs and carbs aren’t inherently bad etc etc) since I’ve restricted them for quite some time. And of course my ED is telling me that I should feel horribly guilty for eating like this and that I’ll be morbidly obese come morning. But I know this is what I need to do. I am dangerous close to a two digit weight and that isn’t healthy for me. Hoping I can stick with this 🤞🏻", "title": "I’ve eaten two meals today and I’m going in for a third in an hour", "context": null}
{"type": "comment", "timestamp": 1605675585.0, "datetime": "2020-11-18T04:59:45", "subreddit": "fuckeatingdisorders", "id": "gcovaqg", "text": "Update: I ate my third meal!! I was honestly nervous because I was so nauseous, but I had chicken, salad, and roasted veggies and it was really good. And for dessert I had more frozen mango and a half an apple, I’m still feeling a bit of regret for all the eating I did today but I’m hoping it doesn’t get worse 😬", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605682145.0, "datetime": "2020-11-18T06:49:05", "subreddit": "fuckeatingdisorders", "id": "gcp3he1", "text": "Thank you I really appreciate this! It was filling indeed, I really enjoy cooking and I’m trying to let myself let go of some of the restrictive tendencies I have during cooking (mostly with drastically reducing oils). The bread I had was home baked too, it’s nice to enjoy your own creations for once lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605749041.0, "datetime": "2020-11-19T01:24:01", "subreddit": "AnorexiaNervosa", "id": "gcs7e2j", "text": "Oooh yeah, for sure. My mom is always scrutinizing what I eat and constantly makes comments about how “healthy” I am and asks for “diet advice” (thinly veiled; like if I researched a type of diet to follow or whatever). It sucks because if I feel like I want to get better I can’t because I would be “letting her down” by ruining this image of this healthy person in her mind.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606549190.0, "datetime": "2020-11-28T07:39:50", "subreddit": "fuckeatingdisorders", "id": "gduhhtw", "text": "This is oddly reassuring", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606893983.0, "datetime": "2020-12-02T07:26:23", "subreddit": "AnorexiaNervosa", "id": "gecja5r", "text": "I can relate to this to an extent. I don’t *want* her to to develop ED behaviors, but my mom complains all the time about being overweight and wanting to lose. She’s just over the border between OW and NW, so it wouldn’t realistically be too difficult for her to get there. But then I see her eat loads of chips and nuts and cookies and I struggle, just like you, not to comment on it and explain how high calorie some of her eating habits are. It’s tough. It’s the disorder trying to control everything in our lives, at least imo, the people around us included. You aren’t an awful person, but please keep resisting that urge.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1609894980.0, "datetime": "2021-01-06T01:03:00", "subreddit": "fuckeatingdisorders", "id": "krckxa", "text": "... and I still ate breakfast. I hadn’t weighed myself in a a couple of days, extreme hunger has been very bad so I’ve been eating a lot. Suffice to say I’ve gained a couple of pounds. It’s probably just bloating and water (given I haven’t pooped today) but yeah. \n\nI still ate breakfast, still had snacks, still had lunch, and while I’m fighting the urge to restrict today (and have been all day tbh), I know I need to eat dinner. Gonna cook a comforting meal since my stomach feels a little icky. But it’s gonna be ok. I can gain weight. I’m allowed to gain weight. It’s ok.", "title": "Scale said I gained weight today...", "context": null}
{"type": "comment", "timestamp": 1609906647.0, "datetime": "2021-01-06T04:17:27", "subreddit": "fuckeatingdisorders", "id": "gi9o7zy", "text": "You can do it! I’ll be honest today’s been rough and I’ve wanted to restrict all day. It’s tough. I know I need to gain weight, but of course my ED has other plans. I believe in you 💜", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609915462.0, "datetime": "2021-01-06T06:44:22", "subreddit": "fuckeatingdisorders", "id": "gia2ocm", "text": "Thank you, I appreciate you saying this. It’s been weird lately since I waffle between wanting to restrict and feeling almost physically incapable of doing so, and almost *wanting* to gain weight just to get it overwith and feel better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609952411.0, "datetime": "2021-01-06T17:00:11", "subreddit": "fuckeatingdisorders", "id": "gibj5n5", "text": "That’s a grand idea! Unfortunately I live with family and I’m trying to recover on my own, so I can’t really get rid of the scale.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610945102.0, "datetime": "2021-01-18T04:45:02", "subreddit": "fuckeatingdisorders", "id": "gjou8y8", "text": "I keep getting suggested r/femboyfitness which... I’m neither femme nor a boy 😂", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614540838.0, "datetime": "2021-02-28T19:33:58", "subreddit": "AnorexiaNervosa", "id": "gp7o78l", "text": "It’s all got to do with social media and search engine algorithms. The purpose of the code is to show users content that best suits their “interests” by drawing on similar topics and presenting them to you as ads. People with EDs also, often, search for other diet material, BMI calculators, watch diet/exercise related videos, etc. So the algorithm sees that you’re looking at ED content and goes “hey, check out what *other people* who look at this ED content you’re looking at are interested in!” Try to bear in mind that none of this is done by humans, it’s all operated by a machine that has no concept of eating disorders or personal human struggle. \n\nUnfortunately, if you don’t want to see those ads, you have to report them as not interesting or, uh, start looking at content that isn’t ED related at all.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614550713.0, "datetime": "2021-02-28T22:18:33", "subreddit": "AnorexiaNervosa", "id": "gp8hey9", "text": "Oh I’m with you there. It’s a huge issue for numerous reasons, EDs notwithstanding; there’s a great documentary on Netflix about it actually lol. But I understand completely, algorithms are just doing what they do but what they do often triggers or radicalizes others using misinformation. It kinda becomes a blind leading the blind situation, and it’s a hole we’ve dug ourselves into technologically that’s pretty difficult to dig out of.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615779396.0, "datetime": "2021-03-15T03:36:36", "subreddit": "AnorexiaNervosa", "id": "gqz7l78", "text": "My go-to pizza pre-ed relapse was a BBQ Hawaiian: pineapple, red onion, and Canadian bacon with BBQ sauce instead of red sauce god it was absolute 🔥I’m so happy for you!!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616341243.0, "datetime": "2021-03-21T15:40:43", "subreddit": "AnorexiaNervosa", "id": "grpkde5", "text": "I feel fake because I’ve never been able to fast, because I don’t count calories (anymore), and because I eat 3 meals a day with snacks.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621030335.0, "datetime": "2021-05-14T22:12:15", "subreddit": "fuckeatingdisorders", "id": "gy5hhkt", "text": "This is exactly how I was. Albeit I did have some bingey tendencies, my relationship with food was largely healthy and normal. Then I decided I wanted to “trim down” a bit or “tone up”; nearly a year later I’m a wreck who can’t even look at a slice of bread without anxiety.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621663392.0, "datetime": "2021-05-22T06:03:12", "subreddit": "AnorexiaNervosa", "id": "gz133s7", "text": "That’s incredible I am so so happy for you!! You should be so proud of yourself, recovery *is* possible 💕", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623815513.0, "datetime": "2021-06-16T03:51:53", "subreddit": "fuckeatingdisorders", "id": "h1xiidk", "text": "I’ve made… a few posts about this exact thing lmao. It’s just obvious they’ve shifted to orthorexic and aren’t truly recovered and it’s super triggering and aggravating to see them post like they’re “all in” or whatever when they do *clearly* are still deeply disordered.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645379685.0, "datetime": "2022-02-20T17:54:45", "subreddit": "fuckeatingdisorders", "id": "hxq8oog", "text": "Like another commenter said I think it depends on the person. Some people get a lot of validation from being the sickest/most needy in the room. Sometimes it’s a learned behavior; like they grew up not getting much attention unless they made it abundantly clear they were suffering, so they feel a need to be the sickest to deserve love/affection (think of munchausen’s, if you’ve heard of that). I knew a couple people in treatment who would brag about their “laundry list” of mental health diagnoses… it’s interesting and sad to watch.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651209903.0, "datetime": "2022-04-29T05:25:03", "subreddit": "fuckeatingdisorders", "id": "i6mrk6b", "text": "I can actually read again", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652670322.0, "datetime": "2022-05-16T03:05:22", "subreddit": "fuckeatingdisorders", "id": "i8rye0e", "text": "Dude lemon poppyseed sounds like such an interesting and tasty flavor now I wanna try it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652817568.0, "datetime": "2022-05-17T19:59:28", "subreddit": "fuckeatingdisorders", "id": "i8zjt81", "text": "I really like gainwithsurina on Instagram, her approach to recovery is super refreshing and frank and she talks about her relationship w/ food as a POC; highly recommend.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653076657.0, "datetime": "2022-05-20T19:57:37", "subreddit": "fuckeatingdisorders", "id": "i9db5j0", "text": "That shit sucks dude. I’m not sure how far gone your liver is, it sounds like you’ve gotta see your GP still to discuss the results. But if it’s any consolation, my liver enzymes were ass backwards at the peak of my ED as well. I got an abdominal ultrasound to see if there was any cirrhosis (thankfully not), and with proper nutrition and full rest (like no physical activity at all for almost 3 months) my enzymes went back to a normal range. Our bodies are incredibly resilient and if you can commit to recovery and healing your body, there is still hope for your internal organs. My own organ distress was a huge wake up call for me, I hope it is for you and I wish you the best in recovery.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653082254.0, "datetime": "2022-05-20T21:30:54", "subreddit": "fuckeatingdisorders", "id": "i9dnfls", "text": "I completely get that, it’s really tough. I wasn’t having any symptoms of liver distress either, which made it that much harder to believe I was truly “sick enough.” I will say that you get used to feeling shitty physically and kinda go numb to it after a while; now that I’ve been eating a lot better and am at a healthier weight, I can reflect back and see how trash i felt all the time when I was in that place lol. Cold all the time, exhausted, anxious, achy/sore, dizzy and weak. All those symptoms come gradually with restriction so we don’t realize we’re experiencing them until we AREN’T anymore. I promise you that no one here is sabotaging you; you are more than sick enough and deserve to eat. You deserve to eat just by virtue of being alive. All living beings must eat.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653104992.0, "datetime": "2022-05-21T03:49:52", "subreddit": "fuckeatingdisorders", "id": "i9evasp", "text": "Since exercise was a large contributor to my ED, I was severely underweight, and I was on an inpatient unit that forbade physical activity past walking to the dining hall, I had to halt physical activity. It’s recommended that most people with eating disorders stop or seriously limit physical activity for a long period of time (I’m talking like at least a year) to allow their body to recover and their relationship with physical activity to heal. It’s not like you’ll never be physically active again, but in many cases rest is actually the healthier choice than exercise for a person with an ED in early recovery.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654444171.0, "datetime": "2022-06-05T15:49:31", "subreddit": "AnorexiaNervosa", "id": "ib9hapn", "text": "You’re not pathetic. I’m 24, this is a mental illness and mental illness knows no age. When I was in residential treatment the vast majority of patients were actually older than I was. I think we see more teens/young 20s on social media talking about their EDs for a few reasons: they have more free time to do so (usually past the age of 23 you have a full time job), it’s trendier for younger generations, and younger generations have less of a stigma surrounding taking about their illness publicly than older generations (especially Gen X/boomers). It’s not that there are less “older” folks (we aren’t old btw we’re in our mid 20s lol) that are struggling w/ EDs, it’s just that the loudest people tend to be younger than us rn, at least in online forums. \n\nBut you aren’t alone, and you certainly aren’t pathetic.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1655425855.0, "datetime": "2022-06-17T00:30:55", "subreddit": "fuckeatingdisorders", "id": "ve06jp", "text": "So eat the fucking cake. Eat the ice cream. Eat the PB, the cookie, the French fries, the egg, the sandwich, the apple, the chicken breast, the fruit and sorbet smoothie, eat *whatever the hell you want.* We’re all gonna die anyway, and we don’t really know when, so why not actually enjoy your life while you have it? \n\nMy ED is so focused on eating only the healthiest foods. I saw an article recently that said eating fish causes cancer? And ya know what? So fucking what if it does! If I get melanoma at age 50 because I enjoyed sushi every once in a while then so be it, at least I enjoyed so damn good sushi before then. I’m sick of all the conflicting messaging from diet culture; just eat the fucking food you want, enjoy yourself, and trust me, you will have lived a full life no matter how long that life ends up being.\n\n**Edit: Some of y’all are so dedicated to being angry I swear. Yes, I’m well aware that there is more to ED recovery than “jUsT eAT LoL 🤪”. Not the point of this post. This was me trying to work through my own version of radical acceptance and share a thought process that has helped me, personally, with my personal ED recovery. If it doesn’t help you, that’s fine! We’re all individuals on our own journeys, that’s completely normal! It was my hope that if this could help even one person in their recovery, then it would be worth sharing. I’m asking for a little civility here. Not everything is an affront to your experience with your ED. We’re all working towards the same goal here.**", "title": "We’re all gonna die anyway", "context": null}
{"type": "comment", "timestamp": 1655435027.0, "datetime": "2022-06-17T03:03:47", "subreddit": "fuckeatingdisorders", "id": "icnxabb", "text": "Lmao", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655436731.0, "datetime": "2022-06-17T03:32:11", "subreddit": "fuckeatingdisorders", "id": "ico0tl6", "text": "As it was for me. And still is. My hyper fixation on health is a means of trying to maintain control over my body and way of being. I grew up with a lot of health anxiety as well and my eating disorder preyed on those insecurities. Even in the deepest of my ED I didn’t believe the behaviors made me healthy, but I also believed certain things would lead me to become unhealthy/thus out of control of my own body and environment. How your ED, or anyone else’s ED, manifests its need for control and exerts that sense of control is unique. For some of us that’s a hyper fixation on “health” 🙃 I’m well aware that eating disorders are much more complex than diet culture and are not in and of themselves products of it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655438622.0, "datetime": "2022-06-17T04:03:42", "subreddit": "fuckeatingdisorders", "id": "ico4gkh", "text": "Thanks, I’m trying! I hope you’re able to find peace too 😊", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655474912.0, "datetime": "2022-06-17T14:08:32", "subreddit": "fuckeatingdisorders", "id": "icply27", "text": "Exactly my point! This guy gets it/s", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655475030.0, "datetime": "2022-06-17T14:10:30", "subreddit": "fuckeatingdisorders", "id": "icpm7m4", "text": "I know it doesn’t lol, I’m referring to the recent study I read that made me go on this rant. It actually said that people who regularly consumed seafood were 20%(?) more likely to develop melanoma. I’m aware that this is pretty ridiculous though and that skin cancer has a lot of other contributing factors that are likely a lot more influential than eating fish.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655493817.0, "datetime": "2022-06-17T19:23:37", "subreddit": "fuckeatingdisorders", "id": "icqzkr6", "text": "Sorry\n\nEXACTLY my point, this *gal* gets it/s", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655568166.0, "datetime": "2022-06-18T16:02:46", "subreddit": "fuckeatingdisorders", "id": "icuekkn", "text": "Yup, that’s exactly the point I was trying to make I’m so happy you caught on!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655587642.0, "datetime": "2022-06-18T21:27:22", "subreddit": "fuckeatingdisorders", "id": "icvj7zd", "text": "Why recover? Because what’s the point of living a life of suffering? Why not try to make the most of being alive? I understand that taking this perspective isn’t going to be helpful for everyone, or even the majority of people. I wasn’t under the impression that this would resonate with everyone either; it was helpful for me and I figured hey, maybe ONE other person could get something out of this. You find this approach flippant and unhelpful. That’s fair. *I* do not. We’re each individuals with different needs and different treatment approaches/journeys. I’m sorry that it doesn’t resonate with you; that doesn’t make it any less helpful for powerful for me. The same way my experiences aren’t universal, neither are yours. Is that mature and empathetic enough for you?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655607729.0, "datetime": "2022-06-19T03:02:09", "subreddit": "fuckeatingdisorders", "id": "icwko2c", "text": "You don’t need to be so hard on yourself lol, it’s all good! I understand how my post can come off and I appreciate you saying something. You’re right about the absolute thinking; black and whites are a thought distortion that is *super* common in EDs and mental illness in general and it can be tempting to distill the issue down into a neat little solution. While eating is certainly a key part of the equation, it’s not as simple as just listing the food to one’s mouth, chewing, and swallowing. But seriously no hard feelings.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657498508.0, "datetime": "2022-07-11T00:15:08", "subreddit": "fuckeatingdisorders", "id": "ifnt9sq", "text": "My relationship with my family and friends. Now that I’m solidly in recovery I have so much more mental space for my friends, family, and hobbies. I’m in a decent mood and can be mentally and emotionally present when I’m with others in a way I just couldn’t when I was restricting. This also translates into being able to enjoy my hobbies, both physical (hiking/biking/swimming/weight lifting) and mental (art/sewing/reading). Everything is just sharper in my mind. \n\nAlso just the improvement in my relationship with food. I’m totally a foodie and I LOVE to cook but it’s hard to truly enjoy any of that when you’re an orthorexic anorexic mess. Being able to cook intuitively again and not constantly worry about measurements and weighing out each individual ingredient has been totally freeing. Plus the bonus of being able to go out and try a variety of new foods without melting down over it or needing to scour the menu for hours to determine what my “safest” option is.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657901886.0, "datetime": "2022-07-15T16:18:06", "subreddit": "fuckeatingdisorders", "id": "iga3zdt", "text": "FANTASTISK 🤩 du burde være stolt av deg!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659820125.0, "datetime": "2022-08-06T21:08:45", "subreddit": "AnorexiaNervosa", "id": "ij8d9vq", "text": "A N O R E X I A P U S S Y", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659855570.0, "datetime": "2022-08-07T06:59:30", "subreddit": "AnorexiaNervosa", "id": "ija88xd", "text": "Not stupid haha, it’s a reference to a post in the “main” ED subreddit that discussed how restriction/malnutrition can totally fuck uo your vaginal health", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659989037.0, "datetime": "2022-08-08T20:03:57", "subreddit": "AnorexiaNervosa", "id": "ijhhvka", "text": "Yes! An eating disorder diagnosis is just a label for symptoms you are experiencing. Whether or not a doctor gives you that label, those experiences you have are still completely real.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659989057.0, "datetime": "2022-08-08T20:04:17", "subreddit": "AnorexiaNervosa", "id": "ijhhxio", "text": "Yes! An eating disorder diagnosis is just a label for symptoms you are experiencing. Whether or not a doctor gives you that label, those experiences you have are still completely real.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659990938.0, "datetime": "2022-08-08T20:35:38", "subreddit": "AnorexiaNervosa", "id": "ijhmi4u", "text": "Not at all TMI! It’s actually quite possible that your CKD is a result of chronic malnutrition; I was entering liver failure and my kidneys were also under a lot of stress at the peak of my illness, and I never purged or abused laxatives. Going without adequate fuel is so so stressful for your whole body.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1663127256.0, "datetime": "2022-09-14T03:47:36", "subreddit": "fuckeatingdisorders", "id": "iocng43", "text": "Respectfully, this isn’t even just about your brain. The longer and more heavily you restrict, the harder *all your other organs* have to work. Can’t get top surgery or go to grad school when you’re 6 ft under because you had a stroke at 20.", "parent_id": null, "link_id": null, "context": null}
