{"type": "comment", "timestamp": 1620850120.0, "datetime": "2021-05-12T20:08:40", "subreddit": "fuckeatingdisorders", "id": "gxw8uto", "text": "Very relatable... Especially considering I eat four meals a day... My mind just counts down till my next meal, and I feel like I cannot possibly have an ED when I eat that often.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647673097.0, "datetime": "2022-03-19T06:58:17", "subreddit": "fuckeatingdisorders", "id": "i196zq7", "text": "Another issue I have regarding \"what's normal lunch\" is liquid calories. Whenever I see someone else eat lunch they almost never drink calories, such as milk. I love milk and have it with every meal, but is that \"ok\" or \"normal\"? I have no clue, and it annoys me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655447833.0, "datetime": "2022-06-17T06:37:13", "subreddit": "fuckeatingdisorders", "id": "icoimro", "text": "My favorite is when different people say things like \"carbs are unhealthy\", followed by \"fats aren't as good as you think!\", followed by \"too much protein causes cancer\". So.... what do do I consume? Air? I've heard air can contain oxygen, and that also kills!!!\n\nMan sometimes I just need to chill down and follow your advice...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655555784.0, "datetime": "2022-06-18T12:36:24", "subreddit": "fuckeatingdisorders", "id": "ictr7je", "text": "Grapes, like most fruit, mostly contains water. Would you skip breakfast because you drank too much water the other day? That sounds stupid in my head. Not only do you need breakfast, you also need that apricot that you wanted, and then some!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656681445.0, "datetime": "2022-07-01T13:17:25", "subreddit": "fuckeatingdisorders", "id": "ieg5kes", "text": "It's really sad... these kinds of people are the ones who convince me that \"all in\" is too risky; the many \"what-ifs\" about this being BED or not is too excrtutiating to bear. I know logically that restrictive eating causes binges that aren't related to BED, but I also think \"what if I eat because of emotions? maybe I trick myself into thinking this is a restrictive binge, when it is in fact not?\".\n\nThese stupid scenarios are always reinforced whenever I see people (who barely know what EDs even are) advocating FOR stupid diet culture...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656777795.0, "datetime": "2022-07-02T16:03:15", "subreddit": "fuckeatingdisorders", "id": "iel9g04", "text": "I like using one and a half desiliters, which equals to around 60-70g oats. Then I use 3 desiliters of skimmed milk (I have a genetic disorder where I need to avoid saturated fats, otherwise I wouldn't have used skimmed), a large spoonful of peanutbutter, same size spoonful of jam, and plenty of raisins (with some cinnamon on top because yummy). I am a male, not particularly tall, around 170cm, but I certainly am not a \"gym bro\". My ED does have me doing a lot of walking and running though.\n\nI just have to admit; I do not believe ANYONE in their right mind would actually enjoy oatmeal made with water. Like honestly, it becomes less satiating, less nutritious, and the consistency is all weird; plus it tastes sooooo bland regardless of what toppings you use...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656777900.0, "datetime": "2022-07-02T16:05:00", "subreddit": "fuckeatingdisorders", "id": "iel9oo7", "text": "Absolutely NOTHING wrong with following directions as long as the end result is what you want. Consistency in oatmeal is so personal, I like mine more creamy and silky than dry; also if I had to choose between soup-like oatmeal versus completely dry oatmeal, I would choose the former.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656777973.0, "datetime": "2022-07-02T16:06:13", "subreddit": "fuckeatingdisorders", "id": "iel9uki", "text": "40 grams is enough! As an appetizer for a bigger bowl of oatmeal of course :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656779272.0, "datetime": "2022-07-02T16:27:52", "subreddit": "fuckeatingdisorders", "id": "ielcsdl", "text": "Oatmeal is as subjective as each and every human being... For every human being, there's a perfect, unique oatmeal it seems", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657368414.0, "datetime": "2022-07-09T12:06:54", "subreddit": "fuckeatingdisorders", "id": "ifgr6i7", "text": "Carbohydrates, more like... goodohydrates amirite", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657377631.0, "datetime": "2022-07-09T14:40:31", "subreddit": "fuckeatingdisorders", "id": "ifh8fhx", "text": "Oven-roasting potatoes with tons of oil and spices is so good! Good ol' potato wedges are my favorite :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657377664.0, "datetime": "2022-07-09T14:41:04", "subreddit": "fuckeatingdisorders", "id": "ifh8i3d", "text": "Can an ED by itself trigger celiac disease? I didn't know that D:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657377789.0, "datetime": "2022-07-09T14:43:09", "subreddit": "fuckeatingdisorders", "id": "ifh8rti", "text": "Also; people who restrict fruits? What the heck... I understand it if you are diabetic, but still? Some idiot online told me I was \"unhealthy\" and would get metabolic syndrome and diabetes if I kept eating a banana a day?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657386498.0, "datetime": "2022-07-09T17:08:18", "subreddit": "fuckeatingdisorders", "id": "ifhstvh", "text": "The more you know; the world and the human body are complicated for sure...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657388132.0, "datetime": "2022-07-09T17:35:32", "subreddit": "fuckeatingdisorders", "id": "ifhwlbk", "text": "I'm glad you survived! I hope you can keep pushing forward, and enjoy life regardless of your celiac disease!\n\nRemember, oats can be gluten-free! And oatmeal is SOOO delicious c:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657462353.0, "datetime": "2022-07-10T14:12:33", "subreddit": "fuckeatingdisorders", "id": "iflj0kv", "text": "That reminds me of one of my favorite shows, BoJack Horseman! Diane experiences depression and goes on meds, and happens to gain weight. Nobody even mentions the weight gain, and everyone treats her just the same as before, except she becomes happy in the end.\n\nEven though there are bad shows that contribute to diet culture and fatphobia, there are also good shows that make you feel like there's more to the world than fearing calories!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657468815.0, "datetime": "2022-07-10T16:00:15", "subreddit": "fuckeatingdisorders", "id": "iflxq7f", "text": "When you say you are still hungry, is it mentally or physically? Because I just ate an entire pizza, tons of watermelon, strawberries in custard and more, and I am so physically full... but I still want to eat everything, my mental hunger isn't satiated and I don't really know what to do", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657469533.0, "datetime": "2022-07-10T16:12:13", "subreddit": "fuckeatingdisorders", "id": "iflzehz", "text": "You're absolutely brilliant and inspirational! I just wanted you to know that, thank you kindly :-)", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1657887322.0, "datetime": "2022-07-15T12:15:22", "subreddit": "fuckeatingdisorders", "id": "vzn91t", "text": "So, I live in Norway, about a 2 hour drive away from Sweden. A family tradition is to take a day trip with my family to Sweden to buy cheap food, clothes, electronics and most importantly, candy! Due to covid and ED I haven't been there for 3 years. I always used to buy 1+ kg of assorted candy, and that was always a highlight of my summers.\n\nFast forward till today, I went to Sweden again with my Dad, but also my ED. We did some shopping, and ate a delicious pizza for lunch, and I ate the whole thing. Then, I went to the candy store: literally being a kid in the candy shop! There are hundreds of different candies, chocolates, caramels, fudge etc. and I went absolutely insane! I picked all the candies I wanted (literally so much chocolate and fudge), and filled my bag with 2,3kg of candy! Not only that, I bought 2 large toblerones, 360g each, so in total over 3kg of candy :-)\n\nSo now for the next weeks I'm going to thoroughly enjoy my 3kg of chocolates. And also, dinner today is going to be pizza even though I ate pizza for lunch. Screw you ED, I'm the winner now, and I'm still going to eat all my normal meals on top of the candy!", "title": "Screeeeew you ED :-)", "context": null}
{"type": "comment", "timestamp": 1657888895.0, "datetime": "2022-07-15T12:41:35", "subreddit": "fuckeatingdisorders", "id": "ig99eyi", "text": "Thank you so much! To be fair, the candy selection in Swedish candy stores is quite literally many kids' dream! Was mine atleast, and still kind of is at soon 22 years of age :-)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657898045.0, "datetime": "2022-07-15T15:14:05", "subreddit": "fuckeatingdisorders", "id": "ig9u8ti", "text": "Bloody enjoy it! What's the point of a vacation if your ED ruins it for you? It's much more fun and exciting to do all the things your ED don't want you to do; it kind of makes you feel empowered? It does for me at least :)\n\nHave a good trip!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657905970.0, "datetime": "2022-07-15T17:26:10", "subreddit": "fuckeatingdisorders", "id": "igaedvy", "text": "Thank you for the kind words! <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657906000.0, "datetime": "2022-07-15T17:26:40", "subreddit": "fuckeatingdisorders", "id": "igaegpa", "text": "Tusen takk! Jeg er ganske stolt, og skikkelig lykkelig som et resultat!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657910795.0, "datetime": "2022-07-15T18:46:35", "subreddit": "fuckeatingdisorders", "id": "igaqgr3", "text": "It is literally so hard to pick a favorite, but if I had to narrow it down, it would either be the banana-caramel fudge, or perhaps the rekrutt (hard caramel covered with chocolate). Otherwise I just love chocolate, white, milk and dark, and also fudge!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659265925.0, "datetime": "2022-07-31T11:12:05", "subreddit": "fuckeatingdisorders", "id": "iidazp0", "text": "I just want to say a single thing. You are a champ!\n\n\\> Now I am no longer malnourished and yeah it turns out (again) science is right. The malnourished brain is indeed not capable of realising a lot of things. It indeed is necessary to gain the weight.\n\nThat part, I hope is true, as I've yet to get there myself. It almost sounds good enough to be true, as I tell myself \"my brain isn't malnourished enough to NOT realize things\". I'm happy there are people out there fighting the good fight, being inspirational!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659271534.0, "datetime": "2022-07-31T12:45:34", "subreddit": "fuckeatingdisorders", "id": "iidjhgp", "text": "Thank you! I have been eating much more consistently for a while now, and though not much has changed, I feel a bit happier, warmer and a tad more energetic :)\n\nAlso, family has commented that it's nicer to be around me (as I'm less annoying/angry)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659646725.0, "datetime": "2022-08-04T20:58:45", "subreddit": "fuckeatingdisorders", "id": "iiyu24l", "text": "You know what's good? Yoghurt covered nuts! Man I could eat them endlessly; though I'm not even sure what kind of nuts are hiding underneath the yoghurt cover...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1660058318.0, "datetime": "2022-08-09T15:18:38", "subreddit": "fuckeatingdisorders", "id": "ijl8pb5", "text": "If you're against eating bread more than once a day, you shouldn't move to Norway! It's relatively normal that we eat 4 meals each day, breakfast, lunch, dinner and an evening meal. Well, some people usually eat bread for breakfast, lunch and evening! We love our bread :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1660069268.0, "datetime": "2022-08-09T18:21:08", "subreddit": "fuckeatingdisorders", "id": "ijm2255", "text": "I always feel \"off\" and sad whenever people say \"eat three meals a day\" (which is still better than those intermittent fasters); I want four meals, dammit!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1664135647.0, "datetime": "2022-09-25T19:54:07", "subreddit": "fuckeatingdisorders", "id": "ipvqj18", "text": "I have no words to describe how much I relate to you... I just physically and mentally cannot restrict anymore. I just keep eating more and bigger meals. I'm in that spot where eating more makes me feel like I'm doing something wrong, and restricting is impossible, and if I manage to do it it also feels wrong.\n\nIt's terrifying. I can't describe how much it scares me. I have given up control completely, and it all feels so wrong and horrible, but I don't know how to restrict again. I don't know how to go back? I'm just so scared... and tired.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1664216933.0, "datetime": "2022-09-26T18:28:53", "subreddit": "fuckeatingdisorders", "id": "iq03x69", "text": "This is good to hear after eating three large slices of cake; they were delicious leftovers from my sister's birthday yesterday. Can't believe I ate cakes on a monday, but one step at a time", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1664258213.0, "datetime": "2022-09-27T05:56:53", "subreddit": "fuckeatingdisorders", "id": "iq2m3z2", "text": "One brownie cake with chocolate cream cheese frosting (sounds weird, but tastes great!), also known as swedish kladdkaka. And two pieces of my mom's special cake with an almond and sugar base with tons of sweet buttercream! It is called \"suksessterte\" which means success tart :-)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1664389382.0, "datetime": "2022-09-28T18:23:02", "subreddit": "fuckeatingdisorders", "id": "iq9m9h2", "text": "Already doing it; pizza fridays are sacred c:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1666003483.0, "datetime": "2022-10-17T10:44:43", "subreddit": "fuckeatingdisorders", "id": "isnq63r", "text": "In terms of the \"thin/not thin\" dichotomy; I was happier when I was chubby than when I am thin. So why does society want us all to be thin? What's so good about that? Osteoporosis?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1666508922.0, "datetime": "2022-10-23T07:08:42", "subreddit": "fuckeatingdisorders", "id": "itfifbk", "text": "And then there's the competetiveness of an ED... \"My hair didn't fall out and my GI system wasn't a wreck so technically I didn't even have an ED!\"\n\nED's are scary things; but lowered intelligence, memory loss/unable to retain new memories, horrible concentration, check, check and check.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1666522021.0, "datetime": "2022-10-23T10:47:01", "subreddit": "fuckeatingdisorders", "id": "itfyds5", "text": "Yes! You're not sick! /s\n\nOn a more serious note, the validity of any given eating disorder shouldn't depend on you meeting every known side effect known to man. As soon as an ED affects your quality of life or health, you are sick. Doesn't matter if your hair doesn't fall out, doesn't matter if you don't have osteoperosis; you ARE sick.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1666524091.0, "datetime": "2022-10-23T11:21:31", "subreddit": "fuckeatingdisorders", "id": "itg15n3", "text": "To be fair, it's SOOOO much easier to tell others what to do, than to do it oneself!", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1669807971.0, "datetime": "2022-11-30T11:32:51", "subreddit": "fuckeatingdisorders", "id": "z8p7fe", "text": "And I'm tired of pretending it's not. Also, sugar instead of honey also works. Get outta here with the artificial sweeteners, they make the tea taste horrid.\n\nExtra calories be damned", "title": "Tea with honey and milk is infinitely better than tea made with just water and leaves", "context": null}
{"type": "comment", "timestamp": 1669812212.0, "datetime": "2022-11-30T12:43:32", "subreddit": "fuckeatingdisorders", "id": "iycpe8x", "text": "That's the greatest decision you could make today; honey is brilliant, and so are bees", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669828949.0, "datetime": "2022-11-30T17:22:29", "subreddit": "fuckeatingdisorders", "id": "iydqz2v", "text": "Might try syrup in my tea! But it is as you say; not \"extra\", but just \"how I like it\". Always look forward to a warm, sweet cup of tea, and it always makes me happy and calm. How awesome is that?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669835349.0, "datetime": "2022-11-30T19:09:09", "subreddit": "fuckeatingdisorders", "id": "iye7s22", "text": "That sounds delicious!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669839913.0, "datetime": "2022-11-30T20:25:13", "subreddit": "fuckeatingdisorders", "id": "iyejkvg", "text": "I hate when people say \"just drink coffee/tea with no sweetener over time! you'll get used to it!\"\n\nLiterally drinking it daily for many months, and it was never something I looked forward to. Milk and sugar/honey? Now it's a highlight of any given day! And you're right; low quality and high quality tea/coffee both benefit from a little extra, in my opinion!", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1670619949.0, "datetime": "2022-12-09T21:05:49", "subreddit": "fuckeatingdisorders", "id": "zh8q1j", "text": "Or is it just me? It's Friday night and I'm going to bed at 10pm. Is it because I'm tired? No, it's because I've already \"eaten all my meals and snacks\", so what else is there to do? It's really sad to be honest... I remember enjoying watching good movies, playing games till late in the night etc., but now I just go to bed so I can commence a new day of eating :(\n\nEat; sleep; repeat", "title": "Does anyone else go to bed early because of food related reasons?", "context": null}
{"type": "comment", "timestamp": 1670653828.0, "datetime": "2022-12-10T06:30:28", "subreddit": "fuckeatingdisorders", "id": "izmqxrk", "text": "It's so sad to see how much EDs really affect our lives; I hope you can ultimately recover!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670653961.0, "datetime": "2022-12-10T06:32:41", "subreddit": "fuckeatingdisorders", "id": "izmr46a", "text": "Yes I most certainly have mental hunger despite eating my meals+snacks. But I just can't get myself to eat any more, you know? Early bedtime is probably a way to avoid eating more than I \"should\"; and also allows me to wake up early enough to eat breakfast+lunch (because if I wake up too late I \"have\" to skip one of the meals, in my head at least).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670654093.0, "datetime": "2022-12-10T06:34:53", "subreddit": "fuckeatingdisorders", "id": "izmraj6", "text": "I have no idea what this commenter wrote; but I DO walk a lot and run a lot, and to be honest if I were to walk/run more to compensate for my food intake, I would just hurt myself physically. My legs are already sore on a daily basis.  \n\n\nSo in this case there would be literally no health benefits to walking more, I think. Thanks for standing up for me :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670666399.0, "datetime": "2022-12-10T09:59:59", "subreddit": "fuckeatingdisorders", "id": "izn62w9", "text": "In my mind it's just \"dumb\" to eat meals close to each other. Why fill up with more energy when you already did an hour ago? That's kind of how my ED holds me back, I think.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670878077.0, "datetime": "2022-12-12T20:47:57", "subreddit": "fuckeatingdisorders", "id": "izypezw", "text": "Your food choices all sound so good! I love PB+J, salmon is amazing, I prefer granola to cereal, though! And all the fruits, pastries and toasts; yum! If I were to add something delicious to your list it would be chocolate milk and oatmeal (with PB, raisins and raspberry jam!)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670941503.0, "datetime": "2022-12-13T14:25:03", "subreddit": "fuckeatingdisorders", "id": "j01y9af", "text": "And I absolutely HATE when people say breakfast isn't important; and blame it on \"Kellogg's\" because they were the ones coining the \"breakfast is the most important meal of the day\" phrase. \n\nAlso; a cup of coffee is not breakfast.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671220251.0, "datetime": "2022-12-16T19:50:51", "subreddit": "fuckeatingdisorders", "id": "j0hyses", "text": "I love me some optimism, positive thinking and a good recovery progress! Thank you for posting this; it makes me feel better myself! Good going :)", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1671877530.0, "datetime": "2022-12-24T10:25:30", "subreddit": "fuckeatingdisorders", "id": "zu76al", "text": "I need to tell myself this! I need to stop counting calories, because if I eat everything I want to do today, tomorrow and even the day after, it will EASILY be >!6000-7000+!< calories every day, and that's OKAY! We've made so many delicious cakes and cookies and chocolates! We've bought in so many packs of different chocolates and candies and treats! I want hot chocolate, I want PB oatmeal, I want pizza, I want the Christmas dinners and desserts! I want fruits and veggies in addition; I want it all!\n\nFor me to TRULY enjoy myself, I can't count calories today; not sure how to avoid it though...\n\nHeck, even if I count everything and eat four times what I usually do, screw it! It's the holiday season; and I won't try to compensate for new years either!\n\nI wish you all luck with the holidays; and most importantly, enjoy yourselves with good company and food and whatever else you desire! What's the point of life if it can't be fully enjoyed!", "title": "Calories don't exist today, or tomorrow, or for the rest of the year at least!", "context": null}
{"type": "comment", "timestamp": 1671878679.0, "datetime": "2022-12-24T10:44:39", "subreddit": "fuckeatingdisorders", "id": "j1heof3", "text": "Here's to the both of us!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1685996097.0, "datetime": "2023-06-05T20:14:57", "subreddit": "fuckeatingdisorders", "id": "jn153cf", "text": "A \"bonus\" is when diet culture says that your body will attempt to go towards the highest weight it has been at. So if you suddenly gain weight, losing it will be \"harder\". This is one mental barrier I just cannot seem to let go of.\n\nWhat does lose weight healthily even mean? How healthy is exercise and diet truly, when it literally takes up all your mental capacity?\n\nDiet culture bad", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724696217.0, "datetime": "2024-08-26T18:16:57", "subreddit": "fuckeatingdisorders", "id": "lk1tzi8", "text": "Toblwrone is banging! And any milk or dark chocolate with candied or roasted almonds with salt!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724696267.0, "datetime": "2024-08-26T18:17:47", "subreddit": "fuckeatingdisorders", "id": "lk1u4uy", "text": "The only solution is this - a glass of cold chocco milk AND a mug of cocoa ;)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726937283.0, "datetime": "2024-09-21T16:48:03", "subreddit": "fuckeatingdisorders", "id": "lo8cnds", "text": "I just went to a steak house and ate good steak, some root veggies cooked in OIL, and a baked potato. And I had a large bowl of aioli that I put on EVERYTHING! No idea about the calories; but meat and FATS in my meal? I call that progress!\n\nI'm about to go buy real mayonnaise and start putting it on my food; I'm sure you ate some good sushi pieces, maybe some fried with mayo aswell?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726942203.0, "datetime": "2024-09-21T18:10:03", "subreddit": "fuckeatingdisorders", "id": "lo8rzoj", "text": "Love to hear it! Stay strong and keep challenging yourself! We got this :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727520570.0, "datetime": "2024-09-28T10:49:30", "subreddit": "fuckeatingdisorders", "id": "lpblxzb", "text": "I love me some bananas", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727534017.0, "datetime": "2024-09-28T14:33:37", "subreddit": "fuckeatingdisorders", "id": "lpcew5a", "text": "My favorites are bananas, pears and oranges :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734364544.0, "datetime": "2024-12-16T15:55:44", "subreddit": "fuckeatingdisorders", "id": "m2ceemp", "text": "Better safe than sorry. Many of these kinds of comments can harm/trigger people who read them; and if mods misread a comment, others can too. The mods on this subreddit are doing a phenomenal job and contribute to creating a safe community.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742072439.0, "datetime": "2025-03-15T21:00:39", "subreddit": "fuckeatingdisorders", "id": "mhze1js", "text": "Everything is honestly so much better when I stop giving a shit... Now all that remains is to CONSISTENTLY not give a shit; but being consistent and continuous is the hard part. Good job pushing past that boundary!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742678470.0, "datetime": "2025-03-22T21:21:10", "subreddit": "fuckeatingdisorders", "id": "mj7jzlp", "text": "The moment when you encounter a trigger, and OVERCOME it is a great sign of recovery! I am proud of you, chocolatecoveredcats! :-)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744003441.0, "datetime": "2025-04-07T05:24:01", "subreddit": "fuckeatingdisorders", "id": "mlthill", "text": "This is very good advice; thank you for sharing!", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1748964309.0, "datetime": "2025-06-03T15:25:09", "subreddit": "fuckeatingdisorders", "id": "1l2ery0", "text": "... I don't need permission. I don't need an excuse. I don't need a reason; other than I want it, it tastes good, the weather is nice and the old woman who sells it to me is nice and chatty!\n\nOnly troublesome part of my ice cream adventures is that it's getting expensive! Worth the money though", "title": "I can eat ice cream whenever I want", "context": null}
{"type": "comment", "timestamp": 1748970199.0, "datetime": "2025-06-03T17:03:19", "subreddit": "fuckeatingdisorders", "id": "mvsuym6", "text": "I wasn't really that big of a fan of normal vanilla soft serve; but this place serves the best one I've tried! Delicious, and I vary sprinkles from strawberry sprinkles, chocolate powder, caramelized almonds and more! I never used to be adventureous, but look at me trying new, different flavors!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1748970318.0, "datetime": "2025-06-03T17:05:18", "subreddit": "fuckeatingdisorders", "id": "mvsvdzc", "text": "What you \"shouldn't\" do is spend literal years of your life obsessing about food, what and how much you can eat, and compensating and \"punishing\" yourself regardless of what you eat. THAT, is the true \"shouldn't\". I've wasted way too much of my life on this crap already, let me have the ice cream and the food, and let me move on with my day :-)\n\nI love local ice cream shops so much! 'tis the season now, after all", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749013141.0, "datetime": "2025-06-04T04:59:01", "subreddit": "fuckeatingdisorders", "id": "mvwf12o", "text": "Yeah but I don't want the ones at the grocery store; I prefer the ice cream parlor \"experience\", and they also have yummier ice cream!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749058129.0, "datetime": "2025-06-04T17:28:49", "subreddit": "fuckeatingdisorders", "id": "mvzje8s", "text": "Never had one, but sounds delicious! :-)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749212175.0, "datetime": "2025-06-06T12:16:15", "subreddit": "fuckeatingdisorders", "id": "mway58i", "text": "And what are you implying with this comment?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749276327.0, "datetime": "2025-06-07T06:05:27", "subreddit": "fuckeatingdisorders", "id": "mwg59cg", "text": "The implication in your comment can easily be interpreted as \"eating much ice cream = really bad for you\". Keep in mind what kind of sub this is. Pro-recovery.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749288226.0, "datetime": "2025-06-07T09:23:46", "subreddit": "fuckeatingdisorders", "id": "mwgp11i", "text": "But your comment does not contribute to anything positive? This post did not specifically ask for your negative approach on eating ice cream without so many rules. You weren't sharing your story, you were forcing it upon me in a triggering fashion. Binge eating is also NOT solved by having a more restricted diet; this is binge-purge-restrict cycle. It does not sound like you are recovered.\n\nI apologize that I offended you, I do care about others. However, you need to acknowledge that \"sharing your story\" can be done in a more positive, less triggering fashion. This is almost comparable to \"I used to indulge in X, until I got cancer\" - it contributes nothing positive towards recovery, nor did you in fact state that you recovered from the issue. Additionally, adding the comment \"F off\", just shows how childish you are acting towards others.\n\nI would recommend you reflect on your position in life; both in regards to your binge eating issue, and how you react when socializing with others.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749291037.0, "datetime": "2025-06-07T10:10:37", "subreddit": "fuckeatingdisorders", "id": "mwgtndv", "text": "Whenever you feel in doubt, read through this post again! Good luck, and may your journey be filled with joyful moments :)", "parent_id": null, "link_id": null, "context": null}
