{"type": "comment", "timestamp": 1633192510.0, "datetime": "2021-10-02T16:35:10", "subreddit": "fuckeatingdisorders", "id": "hf44ton", "text": "I definitely agree but with the caveat that at the very beginning of recovery it's probably too much to ask and probably a phrase which is still best avoided. (I remember even having to stop looking at my fitbit resting heart rate because it felt like a failure when it went back into the 'normal' range. Logically I knew that was a good thing but it still made me tempted to do more exercise and eat less). I'm now at the stage where I still kind of want to be sick but am trying to see being health as a positive (which it really really is).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1633957148.0, "datetime": "2021-10-11T12:59:08", "subreddit": "fuckeatingdisorders", "id": "hg823n9", "text": "Oh my god IF is basically a fast track to anorexia for me. I still have the demon in the back of my head telling me I can 'just' do a fasting day and have 500 calories.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1634703807.0, "datetime": "2021-10-20T04:23:27", "subreddit": "fuckeatingdisorders", "id": "hhbotxz", "text": "Oh my god this is the best description of an eating disorder! (Iwas goin to write my own post bt you just nailed it).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1635443084.0, "datetime": "2021-10-28T17:44:44", "subreddit": "fuckeatingdisorders", "id": "hieoju1", "text": "I feel exactly the same! It's ridiculous but I feel I have to instantly stop getting help as soon as my weight gets into the 'healthy' range or my period returns. It's a stupid cycle because I need to gain weight for my brain to work properly to actually tackle the mental side of the ED but I feel like I can't gain too much weight or I won't be considered sick any more so won't be deserving of help for the actual mental problem.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636198260.0, "datetime": "2021-11-06T11:31:00", "subreddit": "fuckeatingdisorders", "id": "hjjeaqu", "text": "A psychologist once said to me 'i could do with being a bit anorexic maybe I should come live with you'. She was actually nice and meant no harm but it was a crazy thing to say!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636219333.0, "datetime": "2021-11-06T17:22:13", "subreddit": "fuckeatingdisorders", "id": "hjkmqvd", "text": "I know I was a bit confused, I was seeing her for anorexia so wasn't like she didn't know!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636611234.0, "datetime": "2021-11-11T06:13:54", "subreddit": "fuckeatingdisorders", "id": "hk68bhy", "text": "Wow I kinda feel like that's two acheivements in one. First you got your body healthy enough to grow another life (if you ever choose to) and second you got your mind healthy enough to be happy about it!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637770501.0, "datetime": "2021-11-24T16:15:01", "subreddit": "fuckeatingdisorders", "id": "hlwyo4w", "text": "I'm obsessed with bread and butter! Tonight I'm having a chip butty (aka french frie sandwich to Americans) with my dinner and I'm not even calculating how many calories are in it. 'm carb obsessed. Maybe I'll have toast butter and jam too because fuck it!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638264489.0, "datetime": "2021-11-30T09:28:09", "subreddit": "fuckeatingdisorders", "id": "hmn7sgk", "text": "Wow, if this wasn't real life it would be kind of funny. You \\*might\\* have an ED and your residential treatment was a holiday? Not really sure I'd even know how to respond to that!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641685879.0, "datetime": "2022-01-08T23:51:19", "subreddit": "fuckeatingdisorders", "id": "hrue0pn", "text": "Oh my god I always wonder that. I remember eating 6 croissaints 2 bagels and an entire packet of cookies. How the hell does that all fit in?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641925662.0, "datetime": "2022-01-11T18:27:42", "subreddit": "fuckeatingdisorders", "id": "hs8mein", "text": "I love that! How did you manage this?!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642666413.0, "datetime": "2022-01-20T08:13:33", "subreddit": "fuckeatingdisorders", "id": "htfnr77", "text": "There's no truth in what she said. She was trying to hurt you and was going for the comment that would really strike your insecurties. If you had a birth mark you were self conscious about she would have mentioned that. Don't let her words live in your head rent free.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643057053.0, "datetime": "2022-01-24T20:44:13", "subreddit": "fuckeatingdisorders", "id": "hu2fcxn", "text": "Good for you! I'm glad the pizza was delicious! Screw you ED! Also screw the cheeky bastard who drank your milk!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643259023.0, "datetime": "2022-01-27T04:50:23", "subreddit": "fuckeatingdisorders", "id": "hueel72", "text": "I remember your posts well and I'm so glad you broke up with your partner. Even if you managed to recover despite having a shitty partner you've done yourself a huge favour getting rid of them. Congratulations on taking that enormous step, it's all up from here!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643455955.0, "datetime": "2022-01-29T11:32:35", "subreddit": "fuckeatingdisorders", "id": "hupjbqb", "text": "I'm on a few other UK based forums like that too. I see things all the time like 'well it's better to be underweight than overweight' (Errr no it's not.). You shouldn't eat carbs every day, shouldn't ever eat desert. I had definitely internalised alot of these things too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644989172.0, "datetime": "2022-02-16T05:26:12", "subreddit": "fuckeatingdisorders", "id": "hx4z5vn", "text": ">Also low key jealous that you had a session with Tabitha Farrar! I always said if I ever chose a recovery coach it would be her lol\n\nhaha me too. I've watched so many of her youtube videos she's like a celebrity to me now!\n\n&#x200B;\n\nWell done OP! Enjoy all that food!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645376100.0, "datetime": "2022-02-20T16:55:00", "subreddit": "fuckeatingdisorders", "id": "hxpztsu", "text": "I was going to write a comment but you've said exactly what I wanted to say better than I was going to say it. I think my ED was the only mental health issue where I was actively proud of indulging in. That said  other issues did make me want to be coddled and looked after which fuelled the pathological coping mechanisms.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1646976774.0, "datetime": "2022-03-11T05:32:54", "subreddit": "fuckeatingdisorders", "id": "i07gr8t", "text": "Not only do they not care most of the time, it makes no sense for me to care about what 99% of people think. Even if they did think something negative about my body, does the 2 seconds I spend as a thought in some random person's mind justify ruining my life for?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647063799.0, "datetime": "2022-03-12T05:43:19", "subreddit": "fuckeatingdisorders", "id": "i0c6uvk", "text": "I (think) I'm slowly coming out of quasi recovery and actually doing this so am loving that this sub is safe from that kind of stuff. My brain would still love to read a 'here's a magical way of indulging in your messed up eating disorder behaviour more easily'. So I really appreciate the mods taking that stuff down.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647109779.0, "datetime": "2022-03-12T18:29:39", "subreddit": "fuckeatingdisorders", "id": "i0ebzlx", "text": "I know you must get bored of repeating yourself to all the different posters but your comments have been SO helpful! For some reason every extra time I read it I get a bit closer to accepting what I need to do. (Before I was like well as long as I'm not bigger than X size, the size would slowly increase but there was always an upper limit. The other day I was like oh wait if I get bigger than that actually the world won't end and not caring and just fucking eating would be kind of amazing).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647377326.0, "datetime": "2022-03-15T20:48:46", "subreddit": "fuckeatingdisorders", "id": "i0sqlbt", "text": "God I have no idea but can't bloody stand it when people have to comment on my food/weight/exercise. Fuck the fuck off with pointing out and commenting on this stuff. Even without an ED no one needs your input and with one it's ten times worse! (Oops that was quite ranty......might not be in the best mood today!)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647439105.0, "datetime": "2022-03-16T13:58:25", "subreddit": "fuckeatingdisorders", "id": "i0vvjgg", "text": "This a thousand times. I don't know why but everytime I hear pretty much the same thing from someone who is recovered I believe it a tiny bit more. I finally feel I might actually have a shot at recovery. Thanks guys!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647511890.0, "datetime": "2022-03-17T10:11:30", "subreddit": "fuckeatingdisorders", "id": "i101j3g", "text": "Awww thanks so much! I love this sub.....literally everyone from super recovered people to people just starting have helped me so much! (I don't think I'd heard of body neutrality before and the whole concept has helped so much!)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648645452.0, "datetime": "2022-03-30T13:04:12", "subreddit": "fuckeatingdisorders", "id": "i2pkkww", "text": "I'm so curious about this as I've heard it so many times. Who are these people who develop BED? My extreme hunger would definitely have looked like a binge in that it was an insane amount of food but it was just because I was insanely hungry. Now I've put on weight and got used to eating enough I completely lost the desire to do that. All this stuff about 'getting used' to eating huge quantities just hasn't happened. The only thing that perpetuated the 'binges' (AKA extreme hunger) was feeling guilty and restricting in response to it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648698880.0, "datetime": "2022-03-31T03:54:40", "subreddit": "fuckeatingdisorders", "id": "i2t1ngl", "text": "I'm so sorry to hear that. I hope you've emerged out of that episode now. If you don't mind me asking do you feel the binge eating disorder was a result of unrestricted eating in recovery or was it emotionally driven?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648727139.0, "datetime": "2022-03-31T11:45:39", "subreddit": "fuckeatingdisorders", "id": "i2u3ppy", "text": "That's really interesting, thanks for clarifying. I hope things are better. This stuff is hard!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649362504.0, "datetime": "2022-04-07T20:15:04", "subreddit": "fuckeatingdisorders", "id": "i3t2uqk", "text": "Absolutely this. Eating too much protein is actively bad for you as it needs to be broken down. Sugar also isn't inherently bad for you. An ideal according to my dietician, diet contains one desert a day and that's for someone who isn't in recovery. In recovery you may well need ALOT more.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649425182.0, "datetime": "2022-04-08T13:39:42", "subreddit": "fuckeatingdisorders", "id": "i3wdld1", "text": "Even if you've never heard the word psychology you should be able to work out that's a stupid as hell thing to say. I'm sorry OP. That person is a moron.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650036166.0, "datetime": "2022-04-15T15:22:46", "subreddit": "fuckeatingdisorders", "id": "i4uayhd", "text": "That's why I love this group. I would have genuinely thought I was a freak without it. Can't stand YouTube what I ate in recovery videos. Their 'extreme hunger' what I ate in a day videos looked like what I might have eaten pre ED when I was trying to be healthy. I haven't seen a single person consume close to what I did. I doubt I would have stopped eating long enough to record it either!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650226548.0, "datetime": "2022-04-17T20:15:48", "subreddit": "fuckeatingdisorders", "id": "i54fpyw", "text": "Thanks for this! I'm beginning to actually feel this for myself now. The insane hunger has pretty much gone. Your posts have been so amazingly helpful!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652070116.0, "datetime": "2022-05-09T04:21:56", "subreddit": "fuckeatingdisorders", "id": "i7vs45g", "text": "I love this! This is what I'm aiming for. The thing is I've always been a kind of scruffy, casual person who values other things than appearance anyway so how the fuck I got so obsessed with this one aspect of how I look I don't know.\n\nIf anyone has any resources (books, youtube, websites etc) about body neutrality I'm all ears!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652617453.0, "datetime": "2022-05-15T12:24:13", "subreddit": "fuckeatingdisorders", "id": "i8osgfk", "text": "I sympathise! Can you buy huge bags of pasta and rice? I know it's just a load of effort but you could batch book some pasta sauce or just buy super cheap brands if you like that stuff. I used to chuck in some lentils, tinned tuna  for extra protein and or or sardines for fat when I was a student. Cheese and extra oil are also great if you can afford it. Oats are also great (and you can add peanut butter, chocolate, full fat milk etc). Potatoes are cheap and can be microwaves then add butter, cheese etc.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652807226.0, "datetime": "2022-05-17T17:07:06", "subreddit": "fuckeatingdisorders", "id": "i8yudni", "text": "I'm so sorry to hear about your friend. This was an uncomfortable post to read but really important. It's easy to imagine we're 'not that sick' if bloods come back OK or we're not as underweight as some other people according to BMI and easy to forget the damage we're actually doing and the risk to our lives.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653931960.0, "datetime": "2022-05-30T17:32:40", "subreddit": "fuckeatingdisorders", "id": "iakezhf", "text": "Jesus fucing Christ. I have nothing useful to say but your dad makes me so fucking angry. I'm assuming you can't access therapy or eat away from the house? That man sounds absolutely awful.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654623796.0, "datetime": "2022-06-07T17:43:16", "subreddit": "fuckeatingdisorders", "id": "ibifnao", "text": "Infertility \n\nLack of sex drive", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655237957.0, "datetime": "2022-06-14T20:19:17", "subreddit": "fuckeatingdisorders", "id": "icdeglc", "text": "I felt like it was a huge recovery milestone when I unsubscribed from my other ED sub and just stuck to this one.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655281067.0, "datetime": "2022-06-15T08:17:47", "subreddit": "fuckeatingdisorders", "id": "icfk85d", "text": "YES you totally nailed it. I was like that when I first joined ED subs on reddit. I was dipping my toes into the idea of recovery and told myself I needed a space to 'discuss behaviours' or vent. While there may have been some truth in that I did also really want tips on how to do my ED better. Now I'm just much more committed to recovery I do find it a bit irritating. I shouldn't because they're unwell just as I was. \n\n&#x200B;\n\nThis sub often made me uncomfortable telling me things I didn't want to hear (i.e. yes you're going to gain weight in recovery and it isn't up to you how much weight that'll be) but it was uncomfortable in a productive way.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655299085.0, "datetime": "2022-06-15T13:18:05", "subreddit": "fuckeatingdisorders", "id": "icg9qye", "text": "Bloody hell! That's the worst possible sub for someone with an ED. It's basically an ED sub for people who haven't acknowledged they have a problem yet.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655311401.0, "datetime": "2022-06-15T16:43:21", "subreddit": "fuckeatingdisorders", "id": "ich2jz4", "text": "For me it was kind of useful in that it was almost like a gateway sub to on my way to recovery. It was nice to read about other people who were at a similar stage to me at the time. I didn't like alot of the stuff I read on this sub because essentially it was the truth I didn't want to hear (basically you need to gain weight to recover - you can't decide what your set point weight is). I did unsubscribe recently though as it just wasn't recovery focused and I felt like I'm kind of outrgrown it in my recovery. Also being older I began to feel more like a mom than someone who could relate to lots of the other posts. I'm also a big fan of IE/unrestricted eating and felt like this sub was a much better fit for that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655453469.0, "datetime": "2022-06-17T08:11:09", "subreddit": "fuckeatingdisorders", "id": "icopgrs", "text": "I unsubbed recently too. I actually now feel secure enough in recovery (perhaps naively) that it didn't really trigger me but mainly just pissed me off. There was just a massive amount of denial about the reality that you might just need to gain weight. That it's OK to be at a higher weight and yes it'll feel shit at first because you have an eating disorder but it's not intrinsically a moral failing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655526891.0, "datetime": "2022-06-18T04:34:51", "subreddit": "fuckeatingdisorders", "id": "icsrwxo", "text": "The amount of money and plastic I wasted buying zero calorie sauces that 'taste just like curry/maple syrup/kethcup' my starved brain had such high hopes everytime only to be devastated when they tasted like acidic water.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655555879.0, "datetime": "2022-06-18T12:37:59", "subreddit": "fuckeatingdisorders", "id": "ictrcs4", "text": "Haha I love your realism! God I hated that feeling of never ever being full.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655579506.0, "datetime": "2022-06-18T19:11:46", "subreddit": "fuckeatingdisorders", "id": "icv2ci1", "text": "Oh my god that bloated and unsatisfied feeling is the worst!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655646972.0, "datetime": "2022-06-19T13:56:12", "subreddit": "fuckeatingdisorders", "id": "icy0cuk", "text": "1) My husband and child\n\n2) Kindness/Usefulness (I'm probably not going to cure cancer but I'd like to make the world just a little bit better)\n\n3) Being interested and interesting. (I love learning new things!)\n\n4) New experiences. (Travel, music, food - just living life).\n\n5) Individuality. (just being a genuine version of me).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655810011.0, "datetime": "2022-06-21T11:13:31", "subreddit": "fuckeatingdisorders", "id": "id63lid", "text": "Run as fast as you can from that man and never look back. That man is vile in many different ways.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655973048.0, "datetime": "2022-06-23T08:30:48", "subreddit": "fuckeatingdisorders", "id": "ideph65", "text": "This is something I need constant reminders of so thanks OP. It's so tempting to try and introduce 'just a bit' of restriction. Enough to feel in control but not so much I look sick. Then maybe a bit more. I need to just fucking stop it!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655988086.0, "datetime": "2022-06-23T12:41:26", "subreddit": "fuckeatingdisorders", "id": "idf9wfp", "text": "The extreme part of extreme hunger is no joke. I literally ate 2 protein bars, 6 croissaints with butter and jam two bagels with butter, and a king sized chocolate bar for breakfast and an hour later I was ravenous. I literally felt like I hadn't eaten in days. Now extreme hunger has passed I don't think I could eat that much if I tried.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656313318.0, "datetime": "2022-06-27T07:01:58", "subreddit": "fuckeatingdisorders", "id": "idwi3fg", "text": "That's what I came to say - she's great!\n\nI also like Emily Spence on youtube who has a similiar style.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656862901.0, "datetime": "2022-07-03T15:41:41", "subreddit": "fuckeatingdisorders", "id": "iephrzy", "text": "I was going to say this. I mean this is so fucking over the line it's ridiculous. The fact that someone would behave like this so unashamedly makes me  think there's no way she'll respond to boundaries, explanations or anything else a reasonable person could do. I'd probably just draw a firm line and say STOP NOW or I'll cut you off. Then I'd stick to it. Don't let anyone make you feel guilty about it either.\n\nAs a parent this is something I find really really hard to understand. I do think my mum's eating issues was one of the (many) factors that lead tome developing an ED. This was definitely unintenional on her part and I make SO MUCH effort (including just trying to recover myself) to not allow my issues to affect my son. I can't even begin to comprehend a parent deliberately acting so maliciously.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656869553.0, "datetime": "2022-07-03T17:32:33", "subreddit": "fuckeatingdisorders", "id": "iepxp4b", "text": "That's so true. Such a difficult situation!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657138616.0, "datetime": "2022-07-06T20:16:56", "subreddit": "fuckeatingdisorders", "id": "if49bym", "text": "haha I know EH is literally insane. My husband has a huge appetite and even he was shocked at the amount I could put away. I literally didn't even know where the food was going. I'm surprised it physically fit in my digestive system. Then half an hour my stomach would be rumbling Like I had eaten all day. Completely mental. Now extreme hunger has gone I could never eat as much if you paid me a million pounds. I wouldn't be physically capable.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657369597.0, "datetime": "2022-07-09T12:26:37", "subreddit": "fuckeatingdisorders", "id": "ifgt2cp", "text": "Me too! They were the thing I restricted most in my ED. (I mean they only give you energy and allow your brain to function who needs that right?). Now I bloody love carbs. Bread. Pastry. Desert. Oats. God it's all so goddamn good!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658400856.0, "datetime": "2022-07-21T10:54:16", "subreddit": "fuckeatingdisorders", "id": "ih1960w", "text": "**If you binge in recovery DO NOT compensate for it. It kept me stuck in the cycle for months.**\n\nThis was me too. So glad I'm out of that cycle it's the absolute worst! Congratulations OP!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658421706.0, "datetime": "2022-07-21T16:41:46", "subreddit": "fuckeatingdisorders", "id": "ih2k585", "text": "And oatmeal with maple syrup and a load of dark chocolate. So damn good!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659537309.0, "datetime": "2022-08-03T14:35:09", "subreddit": "fuckeatingdisorders", "id": "iisbxd4", "text": "I've had this exact thought. Protein bars are definitely a huge part of the eating disorder combined with exercise addiction world. They're absolutely full of shitty low quality protein, sweeteners instead of real carbs and now I'm no longer massively starving I've realised they mostly taste like shit (although I do still have a soft spot for dark chocolate mint carb crusher because it tastes like a massive after eight mint). Massively inappropriate to be specifically targeting people with eating disorders. Alot of those recovery accounts are also people who have exchanged anorexia for a less visible eaing disorder and/or exercise addiction.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659642469.0, "datetime": "2022-08-04T19:47:49", "subreddit": "fuckeatingdisorders", "id": "iiyj63t", "text": "Regardless of what your physical preferences are you have no business getting married if you can't handle your partner's appearance changing. People fucking age. If you're that superficial do everyone a favour and stay single.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659642674.0, "datetime": "2022-08-04T19:51:14", "subreddit": "fuckeatingdisorders", "id": "iiyjpxm", "text": "Oh my god I was obsessed with fat. I think eating more fat massively helped my hormones re-establish as once that settled down I didn't crave it as much.\n\n Macademia nuts were way posher than my fat cravings though - I just went for insane amounts of butter on literally everything.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659710554.0, "datetime": "2022-08-05T14:42:34", "subreddit": "fuckeatingdisorders", "id": "ij25c33", "text": "I have to say I'm with you OP. I just find it very difficult to empathise. I did alot of crazy shit and wasn't always the best person during the height of my ED but I'm so glad I didn't actually wish my messed up food mindset on anyone else.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659814232.0, "datetime": "2022-08-06T19:30:32", "subreddit": "fuckeatingdisorders", "id": "ij7zzwh", "text": "She needs to be reported. She sounds incredibly stupid in an actively dangerous way. She's meant to be helping people and litreally someone could die as a results of her idiocy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1663244228.0, "datetime": "2022-09-15T12:17:08", "subreddit": "fuckeatingdisorders", "id": "ioirus4", "text": "Jesus OP I'm so sorry for what you've been through. I wish I had some better advice other than ride it out as best as you can and get away from that bunch of disordered people as fast as possible. I'm probably twice your age but find you so inspiring. The fact that you're forced to live with a mom who treats you like that and still you've recovered is amazing. Who the fuck cares if these people think your body is too big? It's your fucking body not theirs.", "parent_id": null, "link_id": null, "context": null}
