{"type": "comment", "timestamp": 1664442045.0, "datetime": "2022-09-29T09:00:45", "subreddit": "fuckeatingdisorders", "id": "iqcg14z", "text": "I see myself in this post and I don't like it", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1669555885.0, "datetime": "2022-11-27T13:31:25", "subreddit": "AnorexiaNervosa", "id": "z61azt", "text": "No seriously its the most censored ED place I have ever seen, seems like you can't even display a symptom without your post being deleted for \"pro ana\" or some other shit\n\nThis, this is why people flock to \"pro ana\" spaces, at least over there you can actually say how you feel\n\nNow give me the ban, i dont care", "title": "This subreddit genuinely sucks as an ED support place", "context": null}
{"type": "comment", "timestamp": 1688408791.0, "datetime": "2023-07-03T18:26:31", "subreddit": "AnorexiaNervosa", "id": "jqjbbj5", "text": "My ugw isn't death but its likely I'll die before I get to it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1688489105.0, "datetime": "2023-07-04T16:45:05", "subreddit": "AnorexiaNervosa", "id": "jqnghzu", "text": "I hope you find the strength to recover before it comes to that <3", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1690716628.0, "datetime": "2023-07-30T11:30:28", "subreddit": "AnorexiaNervosa", "id": "15djcpq", "text": "And it's... actually kinda shit? It tastes worse than sugar free soda\n\nAt this point I don't understand why anyone would drink soda with sugar, not only is it unhealthy as hell, its literally worse than the alternatives\n\nThis isn't even an anorexia thing seriously any health conscious person should avoid sugary drinks...", "title": "Had soda with sugar for the first time in years...", "context": null}
{"type": "comment", "timestamp": 1690718665.0, "datetime": "2023-07-30T12:04:25", "subreddit": "AnorexiaNervosa", "id": "ju2at7u", "text": "Same, only chocolate and gummy candy for me, everything else just tastes \"sweet\" to me\n\nBut yeah sugary soda is literally awful, and the fact that ur average person doesn't care is very alarming\n\nWorst part is, I can't even bring stuff like this up because whenever I do it's just my \"anorexia shit\"\n\nUgh", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1690719553.0, "datetime": "2023-07-30T12:19:13", "subreddit": "AnorexiaNervosa", "id": "ju2c977", "text": "Ikr honestly even way way before I developed anorexia I despised sugary drinks, the anorexia just intensified that feeling \n\nAnd so many people are weirdly disgusted by sugar free soda for some reason??? \n\nLike it's not poison, I promise you it's way way less harmful than your cola that's like 20% sugar in weight", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1690720286.0, "datetime": "2023-07-30T12:31:26", "subreddit": "AnorexiaNervosa", "id": "ju2dhin", "text": "Fair! But I won't lie I'm weird, I despise cold drinks, most of the time, can't stand soda out of a home fridge, it's borderline frozen and undrinkable to me\n\nI even drink my water slightly warm...\n\nI'm odd", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1690722320.0, "datetime": "2023-07-30T13:05:20", "subreddit": "AnorexiaNervosa", "id": "ju2h5px", "text": "I have but its been so many years I forgot how they taste", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1690738243.0, "datetime": "2023-07-30T17:30:43", "subreddit": "AnorexiaNervosa", "id": "ju3heb7", "text": "Yeah these people don't realise that almost everything we eat is genetically altered or artificially produced lol even ur shitty homegrown apples aren't truly free from that\n\nBut no no talking about anything regarding nutrition is just my \"annoying anorexia shit and I need to go to therapy\" like man I'm allowed to have opinions on food . _ .", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1690743647.0, "datetime": "2023-07-30T19:00:47", "subreddit": "AnorexiaNervosa", "id": "ju3uhy0", "text": "Oh for sure I'm absolutely not against GMOs at all, I actually think they're great!\n\nBut yeah the shit we eat just has too much sugar in it, some foods are so devoid of any real nutritional value that some people can literally become malnourished eating them, despite eating a shitton of calories otherwise, can't live off calories alone... this is a particularly bad problem with fast food.\n\nI don't eat a fully plant based diet, but I'm pretty close, but that's definitely just my disordered habits tbh, not really a choice I'm just messed up mentally", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1690756630.0, "datetime": "2023-07-30T22:37:10", "subreddit": "AnorexiaNervosa", "id": "ju4phwq", "text": "Holy shit that sucks", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1690812139.0, "datetime": "2023-07-31T14:02:19", "subreddit": "AnorexiaNervosa", "id": "ju7cowe", "text": "Tbh? Anorexia will kill me before I'm 25 anyway so I honestly don't care", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1699190161.0, "datetime": "2023-11-05T13:16:01", "subreddit": "AnorexiaNervosa", "id": "k7x7y1t", "text": "I was being threatened with hospitalisation, and I decided that ill bring a fucking knife and threaten to stab people if they attempt to nose fuck me...\n\nThankfully, that didn't happen", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1703167890.0, "datetime": "2023-12-21T14:11:30", "subreddit": "AnorexiaNervosa", "id": "kebp0m8", "text": "Im overweight and I somehow managed to be diagnosed with Anorexia Nervosa... Somehow, I thought its only a diagnosis for the \"valid ones\" but hey", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707043943.0, "datetime": "2024-02-04T10:52:23", "subreddit": "AnorexiaNervosa", "id": "kov3vno", "text": "For me personally it's honestly wanting to be skinny so I can be a real girl and to some degree go back to when I was a teenager...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1708971341.0, "datetime": "2024-02-26T18:15:41", "subreddit": "AnorexiaNervosa", "id": "ks92ta9", "text": "And who said that anorexia meals have to look like crap? This looks so friggin good I'd eat it, ana be damned I'm stealing that smoothie lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1708992015.0, "datetime": "2024-02-27T00:00:15", "subreddit": "AnorexiaNervosa", "id": "ksarrln", "text": "What's in it? Asking for a friend", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1710864179.0, "datetime": "2024-03-19T16:02:59", "subreddit": "AnorexiaNervosa", "id": "1binsis", "text": "This will so get deleted ....\n\nMy anorexia... It's been years and shit, I'm like 23...\n\nIt's normal, it feels natural, and although I talk about it a lot, in reality I genuinely barely think about anything ED related in a day, it's all so mundane that my mind barely registers it Al\n\nIts comfortable, I benefit to some degree from the routine, the rules, all that shit, it brings me some degree of comfort, which I likewise barely perceive \n\nI guess at this point, this is kinda just how I live?\n\nYes I'm making the lifestyle comparison, and no not any of that pro ana cringe, no I don't mean it like that... it's just, it feels so much like just a way of being, it's crazy how something so serious and deadly can become normal to someone\n\nHonestly if I'm gonna be honest, I even get some amount of joy from behaviours, hitting goals, I am actually not fat for the first time in 12 years, how can I not be happy? How the fuck am I ever supposed to get better when...\n\nIt all feels so normal? Like nothings wrong...\n\nI'm disabled, my muscles are non existent..  I need to at times ask strangers in the street to help me carry bags onto the tram\n\nYet I feel normal, like nothings wrong, like I'm meant to be this way\n\nWhat the hell...", "title": "Anorexia is genuinely my norm", "context": null}
{"type": "comment", "timestamp": 1710864781.0, "datetime": "2024-03-19T16:13:01", "subreddit": "AnorexiaNervosa", "id": "kvlhqhe", "text": "I never felt like that, but its scary how much it resembles any other way of being, almost as if its just a quirky little lifestyle choice\n\nI think, I for the first time truly understand why some anorexics so insist on it being a lifestyle, I honestly do, I get it\n\nAnd its strange because I have several mental disorders \n\nAnorexia is the only one that feels so deeply normal, as if I'm perfectly fine and nothings wrong \n\nI'm even happy? I smile and laugh, chill with friends \n\nAll while eating so little, with all these anorexic thoughts", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710866110.0, "datetime": "2024-03-19T16:35:10", "subreddit": "AnorexiaNervosa", "id": "kvllfn1", "text": "No\n\nI wouldn't mind being in therapy\n\nBut no psych wants to see me, I've been told (by medical professionals) that there's no point trying to find a new one", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710867113.0, "datetime": "2024-03-19T16:51:53", "subreddit": "AnorexiaNervosa", "id": "kvlof0s", "text": "\"There has to be something new to refer you for, you have already been treated for everything\"\n\nIDK If you consider being tube fed twice and two psychs, both eventually telling me to fuck off adequate treatment\n\nLook I have the right to a second opinion... and I could do it over and over and over again\n\nBut I'm tired, honestly I am, last psych gave me medical trauma and now I'm scared of doctors \n\nI just want someone to fucking talk to me, but no they all kick me out for \"non compliance\" like for fucks sake....\n\nI gave up on the medical system \n\nI'm planning to look into unaffiliated organisations that can offer me talk therapy, clearly the healthcare system is more occupied with \"results\" than helping a fucking chick cope with life", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710867337.0, "datetime": "2024-03-19T16:55:37", "subreddit": "AnorexiaNervosa", "id": "kvlp3gz", "text": "Same actually\n\nI never stuck to recovery for long\n\nBut every time I did, I found intuitive eating fucking useless \n\nMy default is literally starving, I had to count cals so I don't undereat \n\nWhich ofc eventually just made me relapse in like 2 weeks and there, \"eat of the apple, so young, I'm crawling back to start\"\n\nTo quote a song...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710867437.0, "datetime": "2024-03-19T16:57:17", "subreddit": "AnorexiaNervosa", "id": "kvlpei9", "text": "My ED feels integral to my identity \n\nIt feels like... the most interesting thing about me\n\nI feel like I would be losing a part of who I am if I recovered\n\nTHAT Is why I never got better no matter how many times I tried...\n\nI simply don't want to lose the lifestyle, the sickness, the identity it gives, all this insane shit, online communities...\n\nI don't want to lose who I am", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710868275.0, "datetime": "2024-03-19T17:11:15", "subreddit": "AnorexiaNervosa", "id": "kvlrwjb", "text": "Ikr... How can I live without weight loss?\n\nI need that spike of serotonin in the morning man :/", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710868490.0, "datetime": "2024-03-19T17:14:50", "subreddit": "AnorexiaNervosa", "id": "kvlsjqi", "text": "I honestly relate\n\nI don't think I'll try to recover again anytime soon\n\nI'm really close to my goal, and it seems like I'd be giving up right before the finish line\n\nI guess I want to see if being severely underweight is actually gonna make me happy\n\nIf not then... I guess at that point I can try to quit, but I know recovering at that point would be pretty hard \n\nIf not potentially deadly, I already had a refeeding syndrome scare when I was tube fed for the first time, and u was fucking obese \n\nYeah no carb and anorexia... not a good mix", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710869398.0, "datetime": "2024-03-19T17:29:58", "subreddit": "AnorexiaNervosa", "id": "kvlvae0", "text": "thats not really how it works here in Norway.... U dont really \"find\" a therapist, you get given one, and if they suck it takes months to get another one, and eventually unfortunately if they deem it that they cant help you anymore u just get kicked out :/\n\nI COULD go private, but im not on disability yet and im poor as FUCK, there is no way I can afford it\n\nWell...... I could also be referred to a treatment centre, but honestly my local one sounds like the kind of place that would force hospitalise me and torment me, im so fucking scared of doctors man.... Feel like they interrogate me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710871099.0, "datetime": "2024-03-19T17:58:19", "subreddit": "AnorexiaNervosa", "id": "kvm0f9i", "text": "well I meant it literally.... Im in the healthy bmi range for the first time since I was a young teenager\n\nAnd I sure as hell look like it too, I dont really have body dysmorphia, and i am absolutely losing it over how good i actually look, I look like any other average girl, and I love it\n\nFinally... I dont feel fat", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710877983.0, "datetime": "2024-03-19T19:53:03", "subreddit": "AnorexiaNervosa", "id": "kvml0jb", "text": "Yeah!\n\nTho we both know there's no way I'm stopping here, my specific weight goal would put me in like, severe anorexia category by bmi alone (tho my medical files mention \"severe eating disorder\" everywhere so???)\n\nIDK i just\n\nI want to be an overachiever \n\nI feel like, why should I settle for anything but the most extreme expression of the most fucked up body standard imaginable?\n\nIDK man I need help... if only I could genuinely talk to someone about this shit", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710878504.0, "datetime": "2024-03-19T20:01:44", "subreddit": "AnorexiaNervosa", "id": "kvmmllp", "text": "Haha lmao not with me, I'm the opposite! Summer means exercise fuckerssss, it's skinny bitch season XD\n\nOK cringe aside....\n\nIt's all so comfortable you know?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710879201.0, "datetime": "2024-03-19T20:13:21", "subreddit": "AnorexiaNervosa", "id": "kvmoopn", "text": "Gosh for me it's like\n\nThe only form of exercise I genuinely like is just walking aimlessly around the city?\n\nThe problem is that late autumn - mid spring temperatures for mid-Norway range from 0 to maybe 8 degrees C\n\nSo yeah ur fucked, winter coat, double layering everything, and u better carry nose spray and pray for that eyeshadow, hope those tears don't ruin it!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710940259.0, "datetime": "2024-03-20T13:10:59", "subreddit": "AnorexiaNervosa", "id": "kvq712f", "text": "Weird dump, I really didn't need all the tiny details about your intake...\n\nI eat little, very little, but I think telling everyone here the exact details would be uncalled for", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710948467.0, "datetime": "2024-03-20T15:27:47", "subreddit": "AnorexiaNervosa", "id": "kvqts2e", "text": "But...\n\nI'm not unhappy? I'm not miserable\n\nI'm actually very happy with my life, I have a lot of good things going on, the idea of being skinny as fuck is just gonna put a lil cherry on the top of it all\n\nHow can I go back to being miserable if I never was to begin with?\n\nI'm not even underweight and never was, I just want to know how it's like to be so skinny that people think ur too thin, I want to be extraordinary at something for the first time in my life", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1714741581.0, "datetime": "2024-05-03T13:06:21", "subreddit": "AnorexiaNervosa", "id": "l2e50cn", "text": "Just a reminder that the icd11 got rid of atypical anorexia and atypical bulimia all together \n\nThe dsm5 is only really used as a hard guide in America, so the rest of the world will be fine", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1714746918.0, "datetime": "2024-05-03T14:35:18", "subreddit": "AnorexiaNervosa", "id": "l2ej3ve", "text": "Every country is currently slowly transitioning to it and use it in some way, and in a couple years its expected to fully take over\n\nI was diagnosed with anorexia nervosa according to icd11 criteria in Norway, I was never underweight and was in fact obese when I was diagnosed", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1714757919.0, "datetime": "2024-05-03T17:38:39", "subreddit": "AnorexiaNervosa", "id": "l2feyz8", "text": "In the new version, rapid weight loss can replace the underweight criteria, allowing basically every anorexic to get the diagnosis", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1714757930.0, "datetime": "2024-05-03T17:38:50", "subreddit": "AnorexiaNervosa", "id": "l2ff04w", "text": "Why the hell am I getting downvotes im so confused?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1714762059.0, "datetime": "2024-05-03T18:47:39", "subreddit": "AnorexiaNervosa", "id": "l2fqvtt", "text": "The sub diagnosis is simply not given when someone isnt underweight, defaulting to 6B80.Y", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1714763817.0, "datetime": "2024-05-03T19:16:57", "subreddit": "AnorexiaNervosa", "id": "l2fvv27", "text": "Maybe some people just really like having atypical anorexia as a diagnosis?\n\nAnd this is sad, maybe some people like feeling better than others for \"deserving\" it... I don't know", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1714847954.0, "datetime": "2024-05-04T18:39:14", "subreddit": "AnorexiaNervosa", "id": "l2kwxuu", "text": "Fuck ana can I pls have one lmao", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717537876.0, "datetime": "2024-06-04T21:51:16", "subreddit": "AnorexiaNervosa", "id": "l74o89y", "text": "This kind of rigid shit is exactly why I don't want help\n\nBeing forced to stick to a meal plan would remove what little joy food has to me, the only good thing about it is being spontaneous...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717537968.0, "datetime": "2024-06-04T21:52:48", "subreddit": "AnorexiaNervosa", "id": "l74ohkv", "text": "I'm so sorry man\n\nIt doesn't even help, being forced into shit doesn't actually heal your mind", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717538051.0, "datetime": "2024-06-04T21:54:11", "subreddit": "AnorexiaNervosa", "id": "l74oq0f", "text": "I'm going to a new psych clinic soon, this exact shit is why I'm probably not telling them shit, leave me tf alone, I will recover when I'm ready, not when it's either that or the tube", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717538259.0, "datetime": "2024-06-04T21:57:39", "subreddit": "AnorexiaNervosa", "id": "l74papj", "text": "Been tube fed twice, if I was forced to gain weight I'd rather have thousands of cals pumped into me, get it over with so they piss off\n\nThis shit is exactly why people don't ask for help, being punished is not help, being in fear isn't help\n\nI had a friend that was nose fucked every couple weeks until she couldn't take it anymore and now she's not here anymore", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722165266.0, "datetime": "2024-07-28T11:14:26", "subreddit": "AnorexiaNervosa", "id": "lfbl2rc", "text": "The last thing this sub needs is even more removal of posts and comments but thats just my opinion", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722196898.0, "datetime": "2024-07-28T20:01:38", "subreddit": "AnorexiaNervosa", "id": "lfdv964", "text": "My friend, your sub is according to every anorexic I know, the worst place you can pick to post about your ED, you seem so unable to say just about anything here, the sub's more like a joke about excessive censorship to everyone I know\n\nYou know its bad when some less reputable forums will not only give you more responses, but also not delete your post for random shit\n\nThere's a reason this sub is so dead compared to all others of its kind", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1733845652.0, "datetime": "2024-12-10T15:47:32", "subreddit": "AnorexiaNervosa", "id": "1hb4q5c", "text": "Seriously, never been and probably never will, Im in the higher normal range, it feels like I'm the only one.\n\nEverywhere I turn its always underweight this underweight that, underweight underweight ....\n\nI feel forgotten by the medical world, and overall kinda alone amongst fellow anorexics even.", "title": "How many of you arent UW?", "context": null}
{"type": "comment", "timestamp": 1733847291.0, "datetime": "2024-12-10T16:14:51", "subreddit": "AnorexiaNervosa", "id": "m1dktr8", "text": "I'm diagnosed with AN, Europe's different", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733850024.0, "datetime": "2024-12-10T17:00:24", "subreddit": "AnorexiaNervosa", "id": "m1dtir1", "text": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733850075.0, "datetime": "2024-12-10T17:01:15", "subreddit": "AnorexiaNervosa", "id": "m1dtoi1", "text": "I was for 50% of my shitty ED journey either obese or overweight, and tbh although doctors cared, I even managed to get tubed twice, its still funny how googling anything anorexia related always brings up underweight as a \"must\" almost", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733865297.0, "datetime": "2024-12-10T21:14:57", "subreddit": "AnorexiaNervosa", "id": "m1f6p53", "text": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733968434.0, "datetime": "2024-12-12T01:53:54", "subreddit": "AnorexiaNervosa", "id": "m1mkvwn", "text": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733998154.0, "datetime": "2024-12-12T10:09:14", "subreddit": "AnorexiaNervosa", "id": "m1o6unp", "text": "I know, I agree, but I have a lot to lose\n\nI have a realistic chance of getting adhd meds from my psych, something I've been trying to get for years\n\nThink confessing to an ED would ruin that", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734019275.0, "datetime": "2024-12-12T16:01:15", "subreddit": "AnorexiaNervosa", "id": "m1pir3i", "text": "They make you skinny", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734023087.0, "datetime": "2024-12-12T17:04:47", "subreddit": "AnorexiaNervosa", "id": "m1puxkr", "text": "Maybe you're right.....\n\nMy gf and i have been talking, maybe I will give a recovery attempt a try again, my third\n\nI am growing tired of the thoughts, I admit\n\nBut im scared, my life feels more full with those ambitions", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734226801.0, "datetime": "2024-12-15T01:40:01", "subreddit": "AnorexiaNervosa", "id": "m23sabk", "text": "Its so scary, still on the fence", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737584859.0, "datetime": "2025-01-22T22:27:39", "subreddit": "AnorexiaNervosa", "id": "m8mda4y", "text": "I'm proud of you", "parent_id": null, "link_id": null, "context": null}
