{"type": "comment", "timestamp": 1600820477.0, "datetime": "2020-09-23T00:21:17", "subreddit": "ARFID", "id": "g69qchg", "text": "Just about the only fruits I like raw are culinary vegetables.  I mean, tomatoes are a little unpredictable, but they go between sour and bland unless they're really bad.  Fruits can go from sour to cloyingly sweet.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1601755405.0, "datetime": "2020-10-03T20:03:25", "subreddit": "ARFID", "id": "g7jrmb6", "text": "There are people who are allergic to pickles.  Man up and send that sandwich back.  And then if you taste pickle juice, send it back again.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605156413.0, "datetime": "2020-11-12T04:46:53", "subreddit": "ARFID", "id": "gc0dlqj", "text": "I dunno, the kid might just be going through a normal phase.  It's called pickiness, but really it's the monkey-brain screaming in terror so the kid doesn't poison himself with his lackluster ability to identify safe plants.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607622012.0, "datetime": "2020-12-10T17:40:12", "subreddit": "ARFID", "id": "gfax9u9", "text": "It is that simple, just shut down your emotions, but the only way I know how to get that training is through very specific torture at a young age.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607736201.0, "datetime": "2020-12-12T01:23:21", "subreddit": "ARFID", "id": "gfh1dz8", "text": "It's so sad that families can't put *something* on the table for you.\n\nAccommodating vegans has started to become a thing.  Heck, my mom and I were talking about how unlikely it was that my aunts would have ham as part of Christmas dinner because they think my mom can't have a single bite when really she just needs to limit it to garnish for anything she can eat lots of.  If they limit the meal to things they think I can eat, it's going to be pretty sad.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609035656.0, "datetime": "2020-12-27T02:20:56", "subreddit": "ARFID", "id": "gh4mn67", "text": "As someone with general sensory overload problems instead of ARFID... I get the threshold of \"can't muscle-through anymore.\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610105394.0, "datetime": "2021-01-08T11:29:54", "subreddit": "ARFID", "id": "gij5i1n", "text": "To be fair, cabbage is one of those foods that is easier to get wrong than right.  I like the concept of cabbage but don't love the texture.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610111052.0, "datetime": "2021-01-08T13:04:12", "subreddit": "ARFID", "id": "gijc8da", "text": "I can do cabbage any way... small amounts of coleslaw, boiled into nothingness in a soup... When I think cabbage, I think cabbage rolls and fortunately my texture-aversion isn't in my mouth... or rather I'm adverse to wool and I haven't had a food with the texture of wool.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610139775.0, "datetime": "2021-01-08T21:02:55", "subreddit": "ARFID", "id": "gil0cyj", "text": "Allergic to fruit is nothing to be ashamed of.  I just hate fruit (unpredictable unless it belongs in a veggie-salad) and I don't feel guilty even when I don't double-veggie to make up for it.\n\nFood morality goes out the window when you're starving, right?  Blame it on the low-energy lizard-brain that takes over in a lifeboat situation... where eating your best friend seems like a good idea.\n\nDo carbs and fat until you're not starving.  Worry about those micronutrients and fiber when you need to.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1612307107.0, "datetime": "2021-02-02T23:05:07", "subreddit": "ARFID", "id": "glsmgj0", "text": "If they're not in \"I'm your parent so eat your vegetables mode,\" they have no justification for razzing you.  I don't want to advise you to put your foot down about being able to choose what you eat.\n\nPeople are weird, and they think it's okay to criticize people for not liking the same things they do.  I guess it's like they feel personally attacked?\n\nI wish you the best of luck in this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613772991.0, "datetime": "2021-02-19T22:16:31", "subreddit": "ARFID", "id": "go1zkfz", "text": "I'm not ARFID, but I'm depressed and eating a lot of packaged foods.\n\nYou might be able to get cheese powder in bulk and pasta in larger boxes.  Really cardboard isn't a bad material compared to plastic.\n\nDo what you can and don't stress the rest.  There are people who are doing a lot worse and don't even care.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614657669.0, "datetime": "2021-03-02T04:01:09", "subreddit": "ARFID", "id": "gpdo7sw", "text": "They wanted a hot sandwich on fresh bread and subway couldn't manage it?\n\nI don't like prawns or olives, but... yeah I'm imagining that it's some sort of acquired taste.  Those things do not go well together.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621264393.0, "datetime": "2021-05-17T15:13:13", "subreddit": "ARFID", "id": "gygbytn", "text": "Not wanting to eat a burger that had onion and tomato touching it is such a normal thing though.  There's something wrong if he got to that age without having some empathy about a common thing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623896979.0, "datetime": "2021-06-17T02:29:39", "subreddit": "ARFID", "id": "h21kofj", "text": "Did you get any \"REEEEEEE Chicken NUGGIES\" comments yet?  I wonder if any assholes are going to pull out \"sneuflaik\"\n\nYeah, most people are ablest, and I'm not talking about the well-intentioned but misinformed kind.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623953144.0, "datetime": "2021-06-17T18:05:44", "subreddit": "ARFID", "id": "h247k3l", "text": "I was going to say... rum cokes.  Drinking cola as an adult is acceptable... or is it only acceptable when there is rum in it?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623966644.0, "datetime": "2021-06-17T21:50:44", "subreddit": "ARFID", "id": "h252vxw", "text": "I don't have ARFID and I probably don't even fall into the picky category because of how narrow my \"no\" category is.  (I will very rarely eat raw fruit that is not in the culinary vegetable category because of unpredictability, and it's apparently common enough to be normal.  Also I have a cilantro-response to all melon including watermelon and cucumber but can tolerate it with vinegar.)\n\nBut I think I can grasp enough about ARFID to be here and offer suggestions.  I won't eat bugs that haven't been ground into paste and I'm squeamish about pet food even though I know that USA requires it to meet standards for human consumption.  Apparently ARFID people could feel that way about food that I want to eat.\n\nGrowing up in special ed, and probably more importantly riding the bus with the full spectrum of non-typical, those were lessons in empathy that I wish that more people could learn.  (It was a full size bus, but six wheelchair tie-downs and the lift meant that the amount of students that would fit in a short bus needed the full chassis.)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625378727.0, "datetime": "2021-07-04T06:05:27", "subreddit": "ARFID", "id": "h3zxbck", "text": "This sums up with online and anyone with a condition that requires empathy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625379296.0, "datetime": "2021-07-04T06:14:56", "subreddit": "ARFID", "id": "h3zxyyt", "text": "I agree with you, but I can tell the difference between carrots and potatoes in the same stew and it's not just visual identification.\n\nI do love frozen spinach in a soup that it works with.  Broccoli-stem needs special treatment, and being put into a blender after being steamed is a valid way to prepare it.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1625491367.0, "datetime": "2021-07-05T13:22:47", "subreddit": "ARFID", "id": "oe7acs", "text": "", "title": "This is for the \"I eat buttered noodles with parmesan every day\" gang", "context": null}
{"type": "comment", "timestamp": 1629245320.0, "datetime": "2021-08-18T00:08:40", "subreddit": "ARFID", "id": "h9cpgu3", "text": "You're not picky, you have an eating disorder.  As a picky eater, eff that guy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1629245574.0, "datetime": "2021-08-18T00:12:54", "subreddit": "ARFID", "id": "h9cpyka", "text": "> If I knew all the things that I could do to prevent hours in the bathroom, I’d definitely do it.\n\nTalk to your doctor about an elimination diet?  I think FODMAP is a popular one.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1629309369.0, "datetime": "2021-08-18T17:56:09", "subreddit": "ARFID", "id": "h9fmwlz", "text": "Old scars.  You'd think I'd be over it by now.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1632507724.0, "datetime": "2021-09-24T18:22:04", "subreddit": "ARFID", "id": "he4d95d", "text": "It sucks that you had to pay for the meal plan... most colleges have a free shrink for students, so maybe you could go to the shrink and ask about special accommodations for your eating disorder.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1635778934.0, "datetime": "2021-11-01T15:02:14", "subreddit": "ARFID", "id": "hiw2p4v", "text": "I actually ranted here a month or two ago because my cheerios weren't round.\n\nI also accidentally picked up a shells and cheese when it had a picture of macaroni because that's their logo, but at least that one didn't upset me.\n\nI have several boxes of pasta because of mood.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638746008.0, "datetime": "2021-12-05T23:13:28", "subreddit": "ARFID", "id": "hndzbyi", "text": "I'm not ARFID and I thought that this was halfway-normal for the don't eat breakfast crowd.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639363907.0, "datetime": "2021-12-13T02:51:47", "subreddit": "ARFID", "id": "hoby96r", "text": "Carbs, sugar, and fat are only bad if you eat them in excess.  Otherwise they are a source of energy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639853774.0, "datetime": "2021-12-18T18:56:14", "subreddit": "ARFID", "id": "hp2t2p3", "text": "No, even if I still had teeth I would not eat dead leaves.  You want me to eat a salad?  Put me in a field where the lettuce is grown.\n\n~~Seriously~~, (edit: generic expletive) the last time I was happy about crunching into a whole apple was when I was doing an orchard-run with my mom and I yelled a spider off of the apple before biting the apple.  It's kinda weird that I'm fine with eating unwashed food just because I'm practically biting it off of the growing plant.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639875883.0, "datetime": "2021-12-19T01:04:43", "subreddit": "ARFID", "id": "hp43ins", "text": "good bot", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639876037.0, "datetime": "2021-12-19T01:07:17", "subreddit": "ARFID", "id": "hp43tny", "text": "Can you eat Doritos?  Those Fritos things that look like fake nails should provide enough dietary fiber to keep your colon functional.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639876153.0, "datetime": "2021-12-19T01:09:13", "subreddit": "ARFID", "id": "hp441mr", "text": "You made me laugh.  Apparently that was good enough for Jessica Rabbit to get married.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639877014.0, "datetime": "2021-12-19T01:23:34", "subreddit": "ARFID", "id": "hp45pzl", "text": "If you want to go pro on the dietary fiber... shredded wheat cereal.  Even frosted mini-wheats are good.  Just, you don't pour milk on it.  You eat it dry and wash it down with tea, coffee, juice, whatever.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640056538.0, "datetime": "2021-12-21T03:15:38", "subreddit": "ARFID", "id": "hpdog8j", "text": "I talk about hoarders having trash demons, but that's to let people hate the problem without hating the parent.  And beating hoarding is mostly about emotional work, which does put responsibility on the sufferer.\n\nWith ARFID, it sounds like if emotional work was all it took, the sufferers would happily do it.  It sounds a little like phobia.  The person isn't refusing to put their hand into a box of scorpions because they decided to be rude, they're terrified.\n\nI'm hating that the person is trying to categorize mental health problems as a construct and a way to shirk responsibility for a moral problem.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1640610149.0, "datetime": "2021-12-27T13:02:29", "subreddit": "ARFID", "id": "rpn31u", "text": "", "title": "\"Picky Eaters\" The spirit is \"We shouldn't care about weirdness no matter what.\"", "context": null}
{"type": "comment", "timestamp": 1640659929.0, "datetime": "2021-12-28T02:52:09", "subreddit": "ARFID", "id": "hq89xnh", "text": "They want to blame a person for their moral failings, but a diagnosis means that they can't without picking on a disabled person.\n\nAn old joke in some fat-hating sub was \"muh genetiks\" and \"thyroid\" (maybe they changed in the years since I last read anything from them) but they wanted to make being fat about being lazy and a bad person.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641485119.0, "datetime": "2022-01-06T16:05:19", "subreddit": "ARFID", "id": "hri7qs1", "text": "Well, you could tell the waiter that it's their choice to either let you order off of the kid's meal or not order food at all.  Not that they know any better about what your hangup is, but they're the nerfherder for being judgey about it.\n\nThe other option is to look through menus to see if there's a nearby restaurant where the same stuff is on the kid's menu and the standard menu.  Single-location diners usually will have grilled cheese for adults if they do patty-melts.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641485232.0, "datetime": "2022-01-06T16:07:12", "subreddit": "ARFID", "id": "hri81lp", "text": "It's their business.  I'm pretty sure that there isn't a formal law that says they can deny you service if you're not wearing shoes.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641487217.0, "datetime": "2022-01-06T16:40:17", "subreddit": "ARFID", "id": "hriddt5", "text": "Not unless the law says that ARFID is a disability that falls into needing reasonable accommodation.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641488713.0, "datetime": "2022-01-06T17:05:13", "subreddit": "ARFID", "id": "hrihgqd", "text": "That part falls under being an unaccommodating soda jerk.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641961508.0, "datetime": "2022-01-12T04:25:08", "subreddit": "ARFID", "id": "hsb3mhh", "text": "The problem with pickles and onions is that even if you pick them off, the flavor is still there.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642006910.0, "datetime": "2022-01-12T17:01:50", "subreddit": "ARFID", "id": "hsdassx", "text": "I can eat almost anything generally regarded as food, but I wouldn't eat crickets that aren't ground into flour, a cheese sandwich that has been taken over by green mold, or raw chicken.\n\nYour brain is just a bit miswired so that things that I could eat trigger your disgust in the same way.  I'm sure that if there was a way to \"cure\" that, you'd be open to it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642041069.0, "datetime": "2022-01-13T02:31:09", "subreddit": "ARFID", "id": "hsfocwq", "text": "I wonder if these people have never gotten ill after eating something.  I had a very temporary thing with mac & cheese, but I also had a period where I had to be careful with candies and sugary snacks because my gut bacteria was a bit bonkers.  I still don't really like more than a little cake.\n\nMy mom is still getting over some sort of trauma involving carrots, (a bad flu, I think?) but when I cook enough for both of us it's more \"there's extra if you're interested\" instead of actually doing meals together.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644957489.0, "datetime": "2022-02-15T20:38:09", "subreddit": "ARFID", "id": "hx2yv0n", "text": "Kefir is sour, but I think there are other brands of drinkable yogurt.\n\nHowever, the clerk doesn't know that you're not buying those for a kid, and it looks like the label will come off easily.\n\nAnyway, I happily suck on Gogurt in public and nothing bad has happened.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1663101742.0, "datetime": "2022-09-13T20:42:22", "subreddit": "ARFID", "id": "iob1dd3", "text": "I like pickles in my burger and I consider that a food crime.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683313705.0, "datetime": "2023-05-05T19:08:25", "subreddit": "ARFID", "id": "jizz5lj", "text": "That you're putting salt on ham seems like a slight vitamin deficiency.  I'd suggest either getting checked out or looking into it yourself.\n\nSalt isn't bad for you as long as your body is flushing the excess.  It's hard to get too much unless you're dehydrated.\n\nI have made rice simply for an excuse to have a lot of soy sauce in it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1688619793.0, "datetime": "2023-07-06T05:03:13", "subreddit": "ARFID", "id": "jqupt77", "text": "Mom wanted to go to a steakhouse, I was cool with it because I've been wanting a baked potato, but I have a feeling that I made the waitress feel bad.  (I can eat meat, it's just not worth ordering pricey meat when I can't really chew it with no teeth.)\n\nI know it's not really the same when y'all probably can't even deal with side-dishes or watching other people eat the equivalent of chilled monkey brains.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1689798661.0, "datetime": "2023-07-19T20:31:01", "subreddit": "ARFID", "id": "jsmzz7x", "text": "I saw it earlier and someone linked the sub, though to a sympathetic person instead of one of those who thought it was childish.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1689798966.0, "datetime": "2023-07-19T20:36:06", "subreddit": "ARFID", "id": "jsn0tgz", "text": "There was a post in r/anticonsumption where people who wouldn't eat fake meat were being downvoted.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1689876476.0, "datetime": "2023-07-20T18:07:56", "subreddit": "ARFID", "id": "jsrdjm5", "text": "All I know is that I reacted badly to the last fake meat I ate.  I have a problem with some processed food, but haven't tracked down if it's a specific ingredient.\n\nPeople don't even need fake meat.  It's just vegans trying to insist that meat-eaters have no reason, even a stupid one like liking meat, not to give it up.  (They expect to not be given a hard time over their choices, FFS.)\n\nI'm low-meat, as in I don't know if I have lacto-vegetarian days because I'm not paying attention to what was made with lard instead of oil.  Then I get grumpy and really need to eat a porkchop or something.  According to food-morality, I'm being better than someone who eats a pound of flesh every day.  Also I don't really care about food morality in more than an abstract group sense because some individuals have limited choice.\n\nSorry if this came off as rantish.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1691252291.0, "datetime": "2023-08-05T16:18:11", "subreddit": "ARFID", "id": "juwx8q5", "text": "WTF does a sugar-drink have sucralose?  I can taste it and am sensitive to artificial sweeteners.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700585454.0, "datetime": "2023-11-21T16:50:54", "subreddit": "ARFID", "id": "ka6g5ca", "text": "Yeah. People don't get fired over having arfid, just called picky if it comes up at all. I can imagine that there's about an equal level of just hurt feelings ablism going on.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700585669.0, "datetime": "2023-11-21T16:54:29", "subreddit": "ARFID", "id": "ka6gql6", "text": "In dentures, there was someone who was apparently getting lambasted because of a previous meth habit. Or maybe it was just assumed that the person brought it on themself, I only heard about it. \n\nHaters gonna be everywhere.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700858365.0, "datetime": "2023-11-24T20:39:25", "subreddit": "ARFID", "id": "kaly6l7", "text": "For Little Caesars... would it have been acceptable to get several undercooked ones and \"finish\" them in the oven after being in the fridge overnight?\n\nOh well, good thing Hot Pockets are a good thing for you again.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700858557.0, "datetime": "2023-11-24T20:42:37", "subreddit": "ARFID", "id": "kalyo0t", "text": "I'm not ARFID, but I did get upset at heart-shape Cheerios.  What really kicked me in the shins is when they went back to their normal packaging and the cereal was still heart-shaped.\n\nAlso I hate it when I want macaroni-shaped mac and cheese but accidentally grab a box of shells because their packaging is stupid.  I need to be in the mood for shells.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1702058295.0, "datetime": "2023-12-08T17:58:15", "subreddit": "ARFID", "id": "kcj0yet", "text": "I'm not ARFID but I did not like to eat raw fruits even when I had teeth.  Too unpredictable.\n\nI'm glad some people directed you here.\n\nI do eat vegetables, and drink fruit juice, but it seems to me like you can still get around the gaps in your nutrition.  Like eating shredded wheat for the fiber.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1702058512.0, "datetime": "2023-12-08T18:01:52", "subreddit": "ARFID", "id": "kcj1iyc", "text": "Being able to eat vegetable soup is pretty good.  You should be able to get most of what you need except for fiber.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1702064045.0, "datetime": "2023-12-08T19:34:05", "subreddit": "ARFID", "id": "kcjfvdy", "text": "At that point, might try V8.  I heat it up and treat it as an ingredient, though.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1703298873.0, "datetime": "2023-12-23T02:34:33", "subreddit": "ARFID", "id": "kejts6r", "text": "I didn't read too much comments about \"being picky\" because the allergy and religious exemption people drowned it out.\n\nIt's a cultural blind-spot I guess because many redditors don't knowingly eat organ meat as part of their culture but are used to being called childish if they don't want to eat vegetables.  Also it made me realize that I had never questioned what was in braunschweiger.  (I like liver, so no worries.)\n\nAlso too many people think that mental illness is something to be ashamed of.  (Thinking that normal food is disgusting is a bit of a short-circuit.)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707684606.0, "datetime": "2024-02-11T20:50:06", "subreddit": "ARFID", "id": "kpzhazd", "text": "I'd say that ARFID can develop if someone is constantly trying to eat food that makes them sick.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707684911.0, "datetime": "2024-02-11T20:55:11", "subreddit": "ARFID", "id": "kpzi7ps", "text": "Interesting.  I thought it was a natural childhood stage that doesn't get switched off.  Basically at a certain age, kids will freak out if their carrots are cut differently.  For foragers, this would keep a child from eating something unless they know it's good and they're unlikely to eat something that looks close.  (There's no shame in having a malfunctioning anything.)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707692725.0, "datetime": "2024-02-11T23:05:25", "subreddit": "ARFID", "id": "kq043fv", "text": "I was thinking more about the young chimp not eating a leaf because it looks slightly sus.  It just gets really wild when parents start cutting the food into unnatural shapes.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707702053.0, "datetime": "2024-02-12T01:40:53", "subreddit": "ARFID", "id": "kq0rgpu", "text": "Well yeah, there has to be something to explain \"privileged\" people developing ARFID.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707742719.0, "datetime": "2024-02-12T12:58:39", "subreddit": "ARFID", "id": "kq2r3gt", "text": "I'm sorry for not giving an exhaustive answer instead of just an example of how poor people could develop an eating disorder.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1711238459.0, "datetime": "2024-03-24T00:00:59", "subreddit": "ARFID", "id": "kw9qu7k", "text": "Is there some sort of oversight that you can report him to?\n\nPeople who worry about \"childish\" vs \"adult\" are small-minded idjits and it's a shame that other people are the ones to suffer from their disorder.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1712687249.0, "datetime": "2024-04-09T18:27:29", "subreddit": "ARFID", "id": "kyt0ehs", "text": "I'm not ARFID because I can eat just about anything generally recognised as food, (I might even willingly try a bite of sheep-brain quesdilla.)  \n\nTricking someone into eating something like that is rude AF.  Some people get grossed out by bread having lard in it, (they're silly but it's not right to argue with them,) and these days there are enough belief-based food restrictions that it should be normalized to tell people about anything unexpected.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1712687320.0, "datetime": "2024-04-09T18:28:40", "subreddit": "ARFID", "id": "kyt0m0g", "text": "That would be rude AF even if they didn't know you had an eating disorder.", "parent_id": null, "link_id": null, "context": null}
