{"type": "comment", "timestamp": 1611896674.0, "datetime": "2021-01-29T05:04:34", "subreddit": "bulimia", "id": "gl74gcp", "text": "oh my god this has been my entire life since i started b/ping again in dec. my face looks like someone took a red marker to a plastic dummy's face", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611955086.0, "datetime": "2021-01-29T21:18:06", "subreddit": "bulimia", "id": "glajbss", "text": "There are a lot of theories about not getting enough nutrients or the sugar in binge food causing acne, but imo it's the acid in vomit that you then get on your face when you use your hand to purge. Even your saliva on your face is full of gunk. I've started drinking propel and cleansing my face with an exfoliating scrub after my purges and it seems to prevent acne breakout like tremendously.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611955353.0, "datetime": "2021-01-29T21:22:33", "subreddit": "AnorexiaNervosa", "id": "glak15v", "text": "Honestly this sounds like straight up depression of some kind. One of the most common symptoms is a lack of interest in things that usually bring you pleasure.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1612345455.0, "datetime": "2021-02-03T09:44:15", "subreddit": "AnorexiaNervosa", "id": "glufdkp", "text": "As a psych major, I wholeheartedly endorse this post.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1612561838.0, "datetime": "2021-02-05T21:50:38", "subreddit": "bulimia", "id": "gm5ykp2", "text": "*YEEEEEEEEEEESSSSSSS*", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1612732185.0, "datetime": "2021-02-07T21:09:45", "subreddit": "AnorexiaNervosa", "id": "gmi9yyw", "text": "I ate chocolate today too! I promised myself I'd keep the food down and be okay with it. Let's keep it up! Thank you so much for sharing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1612863168.0, "datetime": "2021-02-09T09:32:48", "subreddit": "AnorexiaNervosa", "id": "gmok1mw", "text": "Not harsh enough tbr. Thank you for this comment!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613600031.0, "datetime": "2021-02-17T22:13:51", "subreddit": "bulimia", "id": "gnte128", "text": "s l o w c l a p", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613600170.0, "datetime": "2021-02-17T22:16:10", "subreddit": "bulimia", "id": "gntecfa", "text": "It's a joke. They're not saying it's a flex in actuality but using the meme format to make a joke.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613600208.0, "datetime": "2021-02-17T22:16:48", "subreddit": "bulimia", "id": "gnteff4", "text": "Food fuck: burn calories and eat at the same time!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613602865.0, "datetime": "2021-02-17T23:01:05", "subreddit": "bulimia", "id": "gntkc3h", "text": "Wow I didn't see the \"I'm tired of living\" bit at all. You're right - it isn't very funny.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613865320.0, "datetime": "2021-02-20T23:55:20", "subreddit": "bulimia", "id": "go67kzm", "text": "You're not in denial. The healthcare field is an industry that profits off your distress. Not to get on a soapbox or anything but the real reason they won't treat you w/o residential is probably monetary.\n\nI'm sorry you have to go through this, king/queen. I really hope you find a solution. You're doing a great thing for yourself.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614296251.0, "datetime": "2021-02-25T23:37:31", "subreddit": "bulimia", "id": "gorozv8", "text": "I'm so sorry you had to go through this. I'm sure you are absolutely beautiful and you deserve to be treated well.\n\nThe struggle is painfully real, and it was the primary factor in me developing my ED. My first boyfriend ever was suuuuper into porn. We'd watch it together and he'd ask me if my butt had ever looked like the actors, if my hair had always been the way it was, etc. Comparing me to all these impossibly beautiful, submissive women. \n\nWe'd be in the same room, sitting not 4ft apart and he'd be watching cam girls while half-heartedly talking to me. When I caught him, he started hiding and lying about it, and eventually even intended to cheat on my with some other guy (he was bisexual). \n\nThe sad part wasn't even his addiction to it. It was the fact that he was hiding it from me. Like, you can't trust or have a healthy relationship with someone who lies to you.\n\nHis indiscretions definitely led to me restricting and b/ping full stop. I was so tired of him comparing me, so tired of him watching other girls on the street and expecting our sex to be constantly evolving to be closer to porn... that I finally just went online to find a diet and dove completely into the proana community. It was so hurtful and I felt so trapped.\n\nEventually I realized he was never going to change without therapy (to which he would not go) so I dumped his ass. But it's taken me like 8 years to finally understand that people's interest in porn over reality isn't about me.\n\nSORRY I JUST DUMPED ALL THIS HERE I have a lot of feelings about EDs and porn. 😔", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614296281.0, "datetime": "2021-02-25T23:38:01", "subreddit": "bulimia", "id": "gorp23l", "text": "EDIT: oh my god this is so long. Please don't take this the wrong way, I honestly just have a lot of feelings about the way porn relates to EDs. Feel free to delete or ignore this if it's unhelpful! Though I do hope it helps!\n\nFirst I want to say that I 100% relate. I just made another comment about my ex's porn obsession and it was agony. So you're so not alone, queenie. I feel you. We all feel you, for real.\n\nThe thing is (and I hope this is helpful for you because you do NOT deserve to suffer or have your self-worth debased),  porn isn't actually the issue. It's the replacement of real intimacy with quick, physical pleasure. Anyone, male or female, who would rather look at porn or who wishes YOU were more like a pornstar, cannot have a healthy relationship with you because they don't want one. \n\nI repeat: The problem is NOT YOU.\n\nThe problem is fear of intimacy and an insecure attachment style. People look to porn because they don't want to risk investing in what is real. They don't want to get hurt, and denying their partner for something that is predictable and cannot hurt them (like porn) gives them the boost that they need to feel better about themselves. Porn will never abandon them, reject them, or find someone new. They can control porn. What they can't control is you.\n\nI don't mean to invalidate your feelings, because they're totally valid. But I get the feeling that you blame yourself for not being attractive to your partners - even the ugly ones, lol. When the truth is, queen, that you could be a model and your partners would still look elsewhere because they have an insecure attachment to real people.\n\nI was at a seminar yesterday about this, and the speaker reiterated the fact that those without healthy attachment are bound to treat us like shit. And it sounds to me like you were treated like shit. I could be totally wrong and if I am, please correct me. But the men who were in your life were not looking for a real relationship. They don't know how to have one.\n\nAgain, your experiences are valid and I know how you feel. This might not help at all, but I at least want to reassure you that *not all men are like this*. I've seen friends find healthy relationships after experiences like this and it *is* possible. But you have to stop hating yourself for not being perfect. Anyone who's asking for perfection is asking for the impossible, and trust me when I say that you don't want that.\n\nI'm sorry if this is too long or if I've overstepped boundaries. I just remember SO vividly how I felt about porn in my relationships AND outside of them, and it hurt really deeply. \n\nI don't want you to hurt, queen. ❤️ You deserve better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614302526.0, "datetime": "2021-02-26T01:22:06", "subreddit": "bulimia", "id": "gos1o6d", "text": "Omg thank you sm 🥺 You're already being a friend.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615423322.0, "datetime": "2021-03-11T00:42:02", "subreddit": "bulimia", "id": "gqiiu0v", "text": "My hero. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615517256.0, "datetime": "2021-03-12T02:47:36", "subreddit": "bulimia", "id": "gqnd2r2", "text": "This is it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615517610.0, "datetime": "2021-03-12T02:53:30", "subreddit": "AnorexiaNervosa", "id": "gqndqof", "text": "👏🏼👏🏼👏🏼", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616064764.0, "datetime": "2021-03-18T10:52:44", "subreddit": "AnorexiaNervosa", "id": "grc99c7", "text": "That's emotional and mental abuse full stop, and abuse kills (as I'm sure your ED will testify.) Putting people down in such a blunt, grotesque manner is not, never has been, and never will be okay. I'm sincerely so sorry you have to deal with this, queen. Recovery is a battle all is own!!\n\nI mean, you're welcome to correct me if I'm totally off the mark. Your mum could be a ray of sunshine and pancakes, but *this* particular aspect of her behavior, her pointing out your flaws as telling you your life will crash and burn? *NOT okay.*\n\nI hope you're able to keep people like this out of your life for good. You deserve so much better than to be treated this way. I'm sending aaaaaall the good vibes and love your way. 🏝\n\nAnd hey, if you ever need to talk, my PMs are open pretty much always due to covid.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616066363.0, "datetime": "2021-03-18T11:19:23", "subreddit": "AnorexiaNervosa", "id": "grcbyzx", "text": "I've been there. I know the feeling of loathing your mom - especially since they're supposed to be the ones you look up to. It hurts when they say something and you almost instantaneously  brace yourself for whatever cruel thing they may throw at you next.\n\nAnd that's called verbal/emotional abuse, queen. There's no other way around it. If it's a repeated  pattern that you've seen over and over, that pattern is called abuse. They won't do it in front of your friends usually, and they'll find subtle ways to punish you in public — but it's still abuse.\n\nI'm not trying to tell you to call the cops on yohr Mom, I just want you to know that (a) it is not okay how she treats you, (b) there IS help and a way out, and ( c ) what you're feeling is completely valid; you are not alone and it's 100% okay to cry.\n\nYour situation really blows. Really. I'm sorry you're having a rough go with your mom - especially while you're at a clinic. Again, it sounds like the combination of emotional and verbal abuse from her - which is all just used to put you down. Continuing to compare you to other, possibly thinner (cough sicker cough)\ngirls while you're all there for *treatment?* That's wrong. It's wrong and it put you in tears. And you deserve so much better than this. 💖\n\nIf you get the opportunity while you're there, please reach out to a counsellor, therapist or group facilitator. The psych doctors tend not to be very helpful for dealing with the feelings you're experiencing, but I've had some very positive and heartwarming talks with, say, the art therapist and group counsellor who were on my unit. Even some of the other patients and nurses can lend an empathetic ear. You're not alone, queen. I swear.\n\nWorst case scenario you have us. 🤡\n\nAlso: if you feel comfortable doing so... please mention your mother, the things she says, and how she makes you feel. Tell a therapist, a caseworker, another girl at the clinic... Anyone. tell anyone that you feel you can trust. \n\nBecause no one should be made to feel like they aren't good enough. And you are, sweetie. You are *so* good enough.\n\nSorry for the tl;dr, but I wanted to do justice by you! 😅 All my love and well wishes with the treatment, queen 💖💖 You can do this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616099644.0, "datetime": "2021-03-18T20:34:04", "subreddit": "AnorexiaNervosa", "id": "grel3vc", "text": "PM away by all means! I remember a study I read awhile back that showed how parents with that kind of behavior (constantly nit-picking and criticizing) are super common in people with EDs. It's awesome that you're fighting it and trying your best.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616197318.0, "datetime": "2021-03-19T23:41:58", "subreddit": "bulimia", "id": "grjdewy", "text": "Thank you for painting a picture of what successful recovery can actually be like. I remember this feeling very well; nothing beats the pure LIFE energy you have without disordered eating ravaging your brain.\n\nHoping that someday I'll get back there. Thanks for being an inspiration, queenie 💖", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616371529.0, "datetime": "2021-03-22T00:05:29", "subreddit": "AnorexiaNervosa", "id": "grr9prw", "text": "Sometimes I eat.\n\nThat's it, that's the whole thing. If I'm not literally fasting or eating under XXX calories of keto food, I feel fake as fuck. If not not weak and dizzy, I feel fake as fuck. If I'm not cold and my hands aren't shaking I feel fake as fuck.  \n\nBasically I have to be speed racing towards death for me to feel at all valid.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616575880.0, "datetime": "2021-03-24T08:51:20", "subreddit": "bulimia", "id": "gs1172f", "text": "Aw, this is wonderful. Good job, beautiful. I'll be keeping you in mind and hoping you get to celebrate a little. 😊 You deserve it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616971360.0, "datetime": "2021-03-28T22:42:40", "subreddit": "AnorexiaNervosa", "id": "gsmlnod", "text": "UGH THIS. \n\nNot eating = ✅ all good\n\nNot eating everything in the house after one bite = 🚫 eternal struggle", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616995394.0, "datetime": "2021-03-29T05:23:14", "subreddit": "AnorexiaNervosa", "id": "gsnoxgt", "text": "Right? I hate it here.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617361188.0, "datetime": "2021-04-02T10:59:48", "subreddit": "bulimia", "id": "gt4oavk", "text": "Same sis.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617361480.0, "datetime": "2021-04-02T11:04:40", "subreddit": "bulimia", "id": "gt4olyu", "text": "Glad I'm not just imagining the bit about girls being less nice! I was overweight for most of my adolescence and all my female cousins/friends/nieces *adored* me.\n\nThen when I turned 20 and lost nearly half my body weight I started getting catcalls, guys randomly striking up convos, offers for help carrying things. Generally all over me, not to uh brag I guess. That's just what happened.\n\nBut the girls? Somehow they were mysteriously nowhere to be found. Suddenly they distanced themselves. Except for times when they were two-faced around me and, yeah, treated me like a threat. I have had ZERO female friends since I was 20, and she was online so really since 17.\n\nBut hey, people will treat you the same whether you're skinny or not!!! 🙄", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617529203.0, "datetime": "2021-04-04T09:40:03", "subreddit": "bulimia", "id": "gtbzp60", "text": "I hate that I got back into it. That i got back into it so *easily*.\n\nIf it's any consultation, we were all probably feeling pretty low and desperate when we started, because why else do it? We weren't trying to hurt ourselves. We were trying to cope.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617671106.0, "datetime": "2021-04-06T01:05:06", "subreddit": "bulimia", "id": "gtip8vg", "text": "That *sounds* horrible honestly. This shit is just all around not a good time. Sorry you had to go through that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618186346.0, "datetime": "2021-04-12T00:12:26", "subreddit": "AnorexiaNervosa", "id": "gu799au", "text": "you're beyond talented, friend. this is brilliant.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618214148.0, "datetime": "2021-04-12T07:55:48", "subreddit": "AnorexiaNervosa", "id": "gu8ea43", "text": "curses, i was hoping to be the first to use a song by The 1975 👀 well played.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618214226.0, "datetime": "2021-04-12T07:57:06", "subreddit": "AnorexiaNervosa", "id": "gu8ecuc", "text": "oh my god I Wanna Get Better is *the* most slappable song i have ever known. love bleachers.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618359519.0, "datetime": "2021-04-14T00:18:39", "subreddit": "AnorexiaNervosa", "id": "guflc53", "text": "You look so cool ♥︎", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618359748.0, "datetime": "2021-04-14T00:22:28", "subreddit": "AnorexiaNervosa", "id": "gufls1l", "text": "Agree those beabadoobee lyrics are suuuper ED related.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618359821.0, "datetime": "2021-04-14T00:23:41", "subreddit": "AnorexiaNervosa", "id": "guflx7t", "text": "VOCALOID!! 💕", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618363626.0, "datetime": "2021-04-14T01:27:06", "subreddit": "AnorexiaNervosa", "id": "guft9o2", "text": "Late to the party but here are some of the more recent songs on my ED playlist.\n\n**Roadkill - The 1975** (tw: numbers)\n\n**Playing On My Mind - The 1975**\n\n**Demons - Hayley Kiyoko**\n\n**You Make Me Wanna Die - The Pretty Reckless**\n\n**Rolling Girl - Miku Hatsune** (like someone said above, you might not be into this one as much if you don't vibe with Vocaloid, but it's amazing and the lyrics deal with hiding your perfectionism/ED from everyone around you.)\n\nI wish I had more but everybody covered the good uns! Now I'm going to go through this thread and expand my playlist 🤡", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619052438.0, "datetime": "2021-04-22T00:47:18", "subreddit": "bulimia", "id": "gve3mdq", "text": "I know the feeling, queenie. I know how much it hurts to desire someone or something and to have it just out of your reach. The purging makes it feel like you're in control, like you don't have to feel what you're feeling. The purging feels like a secret lover who takes all that agony away. The embrace is intoxicating.\n\n\nBut you *will* find someone who feels what you do. And like the user above said, recovery is the only way. It doesn't have to be overnight... but if you want a partner who sees your beauty and gives you what you deserve, you have to give yourself what you deserve first:\n\nforgiveness.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1631515908.0, "datetime": "2021-09-13T06:51:48", "subreddit": "AnorexiaNervosa", "id": "hcnwlon", "text": "yup. the worst part is that i know it's all in my head. that i'm actually a beautiful person and don't deserve to be hurt by myself. that the people who are meant to be in my life will love me regardless of my weight. \n\nit's hard. but it gets better. if you look for the best parts of you - the parts of you that you believe being thin will bring out in you - you'll find that they're there already, and were all along.\n\nyup. sucks.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1664505406.0, "datetime": "2022-09-30T02:36:46", "subreddit": "bulimia", "id": "iqg94zv", "text": "LADY D MY GIRL.\n\nBut seriously, I happen to live in Vegas and am going to see the exhibit with my nephew in… whenever we find time!! 💕💕 So excited!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1664505535.0, "datetime": "2022-09-30T02:38:55", "subreddit": "bulimia", "id": "iqg9eu4", "text": "Omg VIBES. I’ve been saying it this whole time while everyone’s falling all over the place about how generous and brave the queen was. ICK.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1664510262.0, "datetime": "2022-09-30T03:57:42", "subreddit": "bulimia", "id": "iqgiqm5", "text": "Some of us should have a party. 🤡", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1664932725.0, "datetime": "2022-10-05T01:18:45", "subreddit": "bulimia", "id": "ir3fqny", "text": "We love you, OP. You’re more than worthy of it. No matter what you do, you’re always loved and deserve compassion and forgiveness.  \n\n doing your best with what you have!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1680326349.0, "datetime": "2023-04-01T05:19:09", "subreddit": "EatingDisorders", "id": "jei630t", "text": "I used to think the same - and with good reason. EDs are seriously scary and overwhelming. When you’re in the throes of one, it’s nearly impossible to imagine life without it.\n\nHowever: recovery *is* possible. I’m 1 month and 25 days “clean” from mine, and life could not be more beautiful. It’s such a relief to not have all the twisted thinking that goes along with an ED in my head anymore. I see people normally (not as thinspo), see my body normally, and all in all… it’s just great.\n\nIf you want to recovery, please try. Before my ED recovery I’d had it for 9 years. That’s 9 years I will never get back. Please don’t give up on yourself though. No matter how long it takes… reach for that happy ending. You’re so worth it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1680409761.0, "datetime": "2023-04-02T04:29:21", "subreddit": "EatingDisorders", "id": "jemhk33", "text": "Just because *society* believes something doesn’t mean you shouldn’t either.\n\nEspecially when it’s your life on the line.\n\nI’m 31, have suffered various EDs since I was 22. Definitely not a “young person’s disease.”", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1689460227.0, "datetime": "2023-07-15T22:30:27", "subreddit": "bulimia", "id": "js4bzbm", "text": "bestie stealing food in heels and a long coat is god tier bulimia 😔✌️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1697876966.0, "datetime": "2023-10-21T08:29:26", "subreddit": "AnorexiaNervosa", "id": "k5szo96", "text": "😐🔫", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1698068770.0, "datetime": "2023-10-23T13:46:10", "subreddit": "bulimia", "id": "k63r6qh", "text": "Ehn. Dump the whole friend. Shame doesn’t lead to recovery. Shame leads to shame.\n\nCut yourself some slack.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1702362754.0, "datetime": "2023-12-12T06:32:34", "subreddit": "AnorexiaNervosa", "id": "kd0a631", "text": "This is so beautiful it actually made me tear up. I don’t think I’ve ever been so directly confronted with the damage I do to my body and how much I deny it before now.\n\nThe act of caring for yourself and enjoying a meal is so powerful to me. I can identify so much with the fear – your gradual progress and courage is something I feel like really translates through just the pictures. I love the slow progression. I love how I can visualize your growing happiness and bravery with every new addition.\n\nI JUST THINK IT’S NEAT OKAY.\n\nBut no, seriously OP, good job. This is amazing. Thanks for the encouragement.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1704157931.0, "datetime": "2024-01-02T01:12:11", "subreddit": "AnorexiaNervosa", "id": "kfww09f", "text": "Fuck em. You don’t need the people you’re related to to give a shit about you to know you matter.\n\nYou matter. If I were there I’d make you some soup. Even one spoonful would be enough. \n\nI say this as someone whose family couldn’t care less about what happens to me. It isn’t wrong to expect or even want a favorable response even if you’re not willing to recover. You don’t have to be eating or to be well to expect others to WANT you to eat. You shouldn’t have to *earn* empathy and compassion with any kind of action on your part. It’s *implict* that the people who claim to love us express that in observable ways. \n\nAnd even if you DID want their attention just for the sake of it? Who *gives* a fuck? Human beings need attention. It isn’t a goddamn crime to want the people we care about to pay us notice. The postmodern aversion to “wanting attention” is fucking absurd and based in a scarcity mindset: “*I* don’t get any attention and I don’t expect any so you shouldn’t either!!” Like, please.\n\nTo prove the point, in my case, it isn’t even just anorexia. I was in the ER a few months ago for unrelated issues and not a single member of my immediate family blinked twice. \n\nIt’s not you. You’re not wrong. You deserve better.\n\nBut the fact that you aren’t getting the love and concern you deserve doesn’t mean you don’t deserve it. It only means that your circumstances suck and that it has nothing to do with you. The “they don’t want to push you or fight you” excuse only goes so far. Maybe they don’t want a conflict, but that’s still about them and not you. It means they’re unable to cope with the emotional consequences of forcing somebody to do something that’s good for them.\n\nSo fuck em. You matter and you don’t need them to believe it for it to be true.\n\nTake care of yourself. I care. I want you to live. I’m not gonna force you to recover, but please don’t die at the very least.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1704216997.0, "datetime": "2024-01-02T17:36:37", "subreddit": "AnorexiaNervosa", "id": "kg03h2q", "text": "Yeah, people are quick to pin the blame on those who hold their families accountable. They’re just projecting their own inability to draw boundaries onto other people. Sorry you have to deal with that - good luck!!!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1705600699.0, "datetime": "2024-01-18T17:58:19", "subreddit": "AnorexiaNervosa", "id": "kigrztz", "text": "they walked so we could run……", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707002647.0, "datetime": "2024-02-03T23:24:07", "subreddit": "AnorexiaNervosa", "id": "kosyqqz", "text": "You’re not superficial. I am *absolutely* trying to look skinny and hot but that doesn’t mean I don’t have a mental illness.\n\nThe person who wrote this is overcorrecting for the stereotype. You’re fine.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707149016.0, "datetime": "2024-02-05T16:03:36", "subreddit": "AnorexiaNervosa", "id": "kp1fz22", "text": "I get *why* people say and think this. I’m just saying that in the case of anorexia they’re incorrect.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707584907.0, "datetime": "2024-02-10T17:08:27", "subreddit": "AnorexiaNervosa", "id": "kpsxgpz", "text": "Damn do you do this for a living?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707585194.0, "datetime": "2024-02-10T17:13:14", "subreddit": "AnorexiaNervosa", "id": "kpsy9in", "text": "Yeah this is the right level of anger for this shit.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707585393.0, "datetime": "2024-02-10T17:16:33", "subreddit": "AnorexiaNervosa", "id": "kpsyt8w", "text": "Good for fucking you.\n\nAnd it’s cool that you work somewhere they actually take complaints and issues like this seriously! I have a friend who just left her club because stuff like this was so bad the creeps were getting in bed financially with management to keep it going. It’s fucking terrible what people think they can do to other human beings when “no one” is watching.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707644864.0, "datetime": "2024-02-11T09:47:44", "subreddit": "AnorexiaNervosa", "id": "kpwpvwj", "text": "As you should. Go off bestie 💅🏼", "parent_id": null, "link_id": null, "context": null}
