{"type": "comment", "timestamp": 1650164784.0, "datetime": "2022-04-17T03:06:24", "subreddit": "fuckeatingdisorders", "id": "i51dybz", "text": "So many people have given excellent answers as to the longterm physical and relational effects, so to avoid echoing all of that, I’ll share an anecdote from my life recently.\n\nI’m mid-30s, been dealing with this BS for 2 decades, and am in the middle of a relapse I didn’t realize was happening in 2021 until it was too late to pull myself out. I’ve been trying like hell to follow my team’s plan, but the ED voice is so loud.\n\nAnd not just to me. It effects my husband more than anything, and  that pisses me off. My ED makes me a callous bitch, who has the ability to say extremely hurtful things I never would say in my right mind, and my poor husband always gets the brunt of it. And he is THE most supportive and patient person on the planet. Last night there was a blow up so bad that he broke down crying, saying he felt like he’s living with an abuser, because the ED is running the show. He wasn’t calling me an abuser, but he said when the ED has taken over to this extent, every day feels like he’s living through abuse and gaslighting. I can honestly say I never realize/intend for it to happen, but hearing him say that as he broke down in tears last night absolutely destroyed me and made me want to fight like hell to never make him feel that way again. I may be the worst wife ever, but I’m determined to get back to the version of me he fell in love with years ago. I had an ED, still, but I also had a personality…fun…laughter…hobbies…interests…the ability to care about others or anything in life…a functioning brain…all things my ED steals when it’s running our life. And I say our life, because it’s never only the person with the ED who’s suffering as a result of the ED. Whether it’s an SO, or any other family members or friends, EDs affect EVERYONE around you. It’s not freaking worth it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652640120.0, "datetime": "2022-05-15T18:42:00", "subreddit": "fuckeatingdisorders", "id": "i8q4z5y", "text": "This is amazing. Getting my personality (and enjoyment of my hobbies) back is right at the top of my list of things I want with recovery. You have every reason to be fucking proud of yourself. This is a major step and I know it will help you keep staying the path and say fuck the disorder.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659535199.0, "datetime": "2022-08-03T13:59:59", "subreddit": "fuckeatingdisorders", "id": "iis6s83", "text": "I don’t have the energy to comment all I want to in the spirit of solace/camaraderie, but to your last point, intermittent fasting is what sent me into this relapse that started a year ago and I’m still desperately trying to find a way to climb out of it. FUCK IF.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1661459281.0, "datetime": "2022-08-25T20:28:01", "subreddit": "fuckeatingdisorders", "id": "ils4ns6", "text": "Agreed 100%.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1662608023.0, "datetime": "2022-09-08T03:33:43", "subreddit": "fuckeatingdisorders", "id": "injltrj", "text": "Obligatory plug for Tabitha’s Rehabilitate, Rewire, Recover book (a great adjunct to all her free content online, video or written). She’s got a few others as well.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1662608480.0, "datetime": "2022-09-08T03:41:20", "subreddit": "fuckeatingdisorders", "id": "injmpbe", "text": "Megsy Recovery doesn’t necessarily always talk about the all-in philosophy, but she very much followed certain things from it while also working with an outpatient ED therapist. Honestly one of my favorite Recovery channels by far, probably because we’re similar in age and were the same age when we started struggling, and the fact that she’s recovered now is really encouraging to me as someone who has fought for so long, has been labeled with the SE-AN, and lost hope that recovery was possible after living with it for so long.\n\nShe’s proof to me that it is possible, no matter how long you’ve been fighting, even if I struggle to believe it for myself, still.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1662665290.0, "datetime": "2022-09-08T19:28:10", "subreddit": "fuckeatingdisorders", "id": "inmne8x", "text": "AGREED! And her constant reminder that “nothing changes if nothing changes,” “different bodies, different paths,” and “challenge repeat, challenge repeat, challenge repeat”…she truly lived out the hard parts of recovery in an ACTUAL recovery way and shared them with the world. She’s a treasure.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665282960.0, "datetime": "2022-10-09T02:36:00", "subreddit": "fuckeatingdisorders", "id": "irl6ffj", "text": "I ditto what the other commenter said. It’s probably my fave ED memoir and I’ve read/listened to it more times than I can remember, but a decade ago I read it solely TO trigger myself. Now I just have it memorized, so I’m numb to the triggers, and always make myself finish it because her healing story is one that gives me hope. DEF proceed with MAJOR caution. It’s extremely triggering.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665296993.0, "datetime": "2022-10-09T06:29:53", "subreddit": "fuckeatingdisorders", "id": "irltbvh", "text": "Exactly. I can honestly say, while I spent the first several years after its release reading it with disordered intentions, and many times I’d just reread the overtly triggering parts. \n\nHowever, at some point 6-7 years ago, I realized just how powerful the ending (of this memoir, obviously she’s still doing amazing things) was, and I instituted a rule that said if I decided to read it, which I did, often, I had to read it all the way through to the last page. \n\nI realized if I did that, it even took some of the triggering power away from the previous passages I’d reread countless times for that purpose.\n\nI never recommend it to anyone simply because I think it needs to come with a huge warning and I err on the side of caution, but I’m glad to know you share a similar experience, and can really connect with that hope that ultimately is there at the end!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1667903910.0, "datetime": "2022-11-08T10:38:30", "subreddit": "fuckeatingdisorders", "id": "ivj67dq", "text": "That post and comments hit me the same way. Like…yeah, not a vibe I enjoy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670358301.0, "datetime": "2022-12-06T20:25:01", "subreddit": "fuckeatingdisorders", "id": "iz6d4hj", "text": "Bless you. And major congratulations.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670503649.0, "datetime": "2022-12-08T12:47:29", "subreddit": "fuckeatingdisorders", "id": "ize1zri", "text": "I share your rage. I wish I could say more, but since I can’t right now, just now you’re 100% in the right and they’re all either willfully ignorant or can’t handle being called out on something that needs called out, and can’t handle the idea that THEY need to make an adjustment and may not know everything. I’m so sorry you had to deal with this. Great job in flexing all the recovery muscles, you’re crushing it despite an understandably enraging situation.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1671570963.0, "datetime": "2022-12-20T21:16:03", "subreddit": "fuckeatingdisorders", "id": "zqzxkv", "text": "First, to clarify, I’m not on death’s door, I don’t mean that kind of wake up call.\n\nBut I’m 34. I’ve had this disorder for 20 years, and have avoided getting a DEXA scan since the one I got in 2004. And I now know why.\n\nBecause today, I was informed I have full-blown osteoporosis. At 34. And that’s one of the only irreversible conditions/effects of this disorder. If I were younger, under 30, even, I would have a better chance at rebuilding bone mineral density.\n\nBut now…the best I can hope for is first and foremost trying to keep aiming for nutritional rehabilitation, and taking meds as a second line defense to halt further bone density loss. I can’t get it back. \n\nI can’t get 20 years of my life back. I can’t get back my ability to do the things I love the most (sports like ice skating and skateboarding) without major danger. I can’t get back the years in which I probably would have been able to have my own children.\n\nI’m 34 years old, and I feel stupid for being this upset at this news, but also…I’m just 34. It feels suffocating to think about the reality of this not getting better, and the best case scenario just being pausing the damage that’s been done.\n\nFuck these disorders. Fuck EDs for not letting us see how much danger we’re in. Fuck the ED denial that tells us we’re the one person who won’t have [problem X]. And most of all, fuck me for not finding a way to break free for 2 freaking decades, until this damage was done.\n\nI’m sorry for the tone, I’m just lying here on my bed in tears, beating myself up for this extremely real wake/up call of a physical issue as a result of this mental freaking illness and it all feels so…exhaustingly overwhelming. I’m so mad that I relapsed majorly last year without realizing until it was too late. And I hate myself for not being able to keep this from happening.\n\nBecause like the title says…I was the exception…until I wasn’t. This hurts. Badly.\n\nedit: typos fixed because I’m an idiot who didn’t proofread", "title": "I was invincible…until I wasn’t. Major medical wake-up call today and I’m not okay.", "context": null}
{"type": "comment", "timestamp": 1671574100.0, "datetime": "2022-12-20T22:08:20", "subreddit": "fuckeatingdisorders", "id": "j1133as", "text": "I’m so sorry you understand so well. It sucks. No one deserves living in this hell for so long. Sending you gentle, virtual hugs (only with consent). Thanks for taking time to share. <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671576111.0, "datetime": "2022-12-20T22:41:51", "subreddit": "fuckeatingdisorders", "id": "j117x5o", "text": "If nothing else, I’m so glad this helped take away that guilt. I’ve always said I’m up for sharing my own journey if any part of it can have any remotely helpful effect for one other person, so thank you for letting me know it had that effect after you so kindly took the time to read it. Wishing you the best in your journey, it’s hard, but there has to be more to life. Thank you for your empathy, it means so freaking much.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671577139.0, "datetime": "2022-12-20T22:58:59", "subreddit": "fuckeatingdisorders", "id": "j11adi8", "text": "I’m so sorry you’re going through the same. It makes me furious on behalf of all of us who have fallen prey to this disorder. Thanks for the encouragement, though I wish you didn’t understand so personally. Sending virtual hugs (if wanted) across the airwaves.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671586903.0, "datetime": "2022-12-21T01:41:43", "subreddit": "fuckeatingdisorders", "id": "j11wgcp", "text": "I am so sorry you’re still so young and already having to deal with this. If your doctors have said that, I’m not going to disagree with medical opinion, but this doctor I am grateful to have the ability to see is pretty well into the current ED/recovery/treatment world and knowledge, and I think the recommendation is for nutritional rehabilitation above all else, because until somewhere between 25-30, it’s often possible to reverse the active loss and get to a place where our body is creating new bone mineral density faster than it’s being depleted. That tends to slow down in late 20s-30ish, but I wouldn’t stop doing everything I could if I were you. If there’s any chance at all you could even reverse some of it, I wish you all the luck in the world. You absolutely shouldn’t have to deal with this at age 21. Thank you for taking time to read and comment; sending all the love and best wishes for any success your way.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671650346.0, "datetime": "2022-12-21T19:19:06", "subreddit": "fuckeatingdisorders", "id": "j156ora", "text": "I loved reading this so much, thank you for sharing!!!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671659577.0, "datetime": "2022-12-21T21:52:57", "subreddit": "fuckeatingdisorders", "id": "j15tze0", "text": "It breaks my heart even more for anyone who’s even younger having to deal with this. Thanks for taking time to comment and empathize, but dang, I hate that you know it all too well firsthand. Really appreciate the encouraging and solace. I hope you’ve been able to at least find ways to keep it from progressing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671659731.0, "datetime": "2022-12-21T21:55:31", "subreddit": "fuckeatingdisorders", "id": "j15ud43", "text": "It’s funny you mention Dr. G’s book, because I’ve read it a couple times myself, and even before I got this most recent news, I was recently re-reading the section on bone in the city, but I also tend to forget those very logical resources when I’m dealing with emotional stuff, so I always love when I see others recommend the things that I usually recommend, but can never remember to go to, myself. \n\nThank you so much for taking time to share. I have actually listened to that podcast episode, but it’s been about a year, so thanks for the reminder to go back and give it a relisten, I do remember there were some specific things mentioned in there that couldn’t hurt to at least give a shot. \n\nI’m so sorry that you got stuck in this world after living as long as you did without it, and I hope that you’ve been able to find a way to enjoy life and work toward the freedom we all deserve, no matter how long we’ve been struggling, how old we are, or exactly what we might be dealing with. Your comment means more than I can say, thank you again.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671659987.0, "datetime": "2022-12-21T21:59:47", "subreddit": "fuckeatingdisorders", "id": "j15uzl3", "text": "Thank you so much for sharing this, I am all about anecdotal evidence when it comes to finding hope to cling to. My doctor did say there was a possibility that we could arrest the progress and keep it where it is for many, many years, but I know the practice she is with is on the front lines of the field in the research for bone density (I’m seeing them in a scholarship/grand I was granted after applying a few months ago, otherwise I would probably still be in the dark on this), especially in regards to SE-AN, so I am pretty sure she at least has some ideas to try, on the off chance they can actually improve and help me get any of my BMD back, I think she just didn’t feel like she could promise that since there’s no guarantee. \n\nBut she didn’t paint it nearly as hopeful as I felt when I posted it here, that was just my own hopelessness after hours of processing and crying and wanting to be in denial.\n\nThank you for the reminder that it doesn’t necessarily mean every single bit of hope is lost. I really appreciate that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671660209.0, "datetime": "2022-12-21T22:03:29", "subreddit": "fuckeatingdisorders", "id": "j15vihw", "text": "Thank you so much for every single word you said, sometimes one of the most helpful things someone can say is just acknowledging that something sucks. I try to do that a lot for people in my life, and it really means a lot when I encounter anyone else who does the same, so thank you. \n\nThankfully I have an extremely supportive husband, and I have an excellent outpatient team that I’m very fortunate to be able to work with right now, all of whom are very compassionate, empathetic, and eager to help me in any way they can. \n\nI don’t know how in the world my husband has stuck with me throughout all of this bull crap, but I couldn’t be more thankful that he has, because I couldn’t ask for a better partner in all of this. Part of the reason I’m so pissed off at this disorder is because of everything it’s taken from him because it stolen ME. \n\nAnd he is the sole reason I’m continuing to fight, because if I didn’t have him, and I got this news…I’m not sure I’d have it in me to keep fighting. I’m definitely not to a point where I really want this for myself yet, but I’m hoping that going through the motions for him, and at least knowing that I don’t want us to live the life we’re currently living, I’m OK with feeling like shit going through this process if it means he gets any relief, or gets any of his wife back.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671660351.0, "datetime": "2022-12-21T22:05:51", "subreddit": "fuckeatingdisorders", "id": "j15vutq", "text": "Thank you so much for your compassion and empathy; I’m so sorry you’re also dealing with this bitch of a physical repercussion from an insidious mental illness no one should ever have to face.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1676327695.0, "datetime": "2023-02-13T22:34:55", "subreddit": "AnorexiaNervosa", "id": "j8fgzsb", "text": "Just remember, motivation will inevitably wax  and wane, so it’s important in the moments you DO feel that motivation to make a definitive COMMITMENT to take the recovery actions even when the motivation drops. You can do this. I am really rooting for you. I’ve been married 12 years and AN is absolutely destroying our relationship.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1678339104.0, "datetime": "2023-03-09T05:18:24", "subreddit": "fuckeatingdisorders", "id": "jbi5r52", "text": "I love this. Way to go, OP. And also, thank you; I needed this more than you know tonight.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1696989082.0, "datetime": "2023-10-11T01:51:22", "subreddit": "ARFID", "id": "k4d0vhf", "text": "Thanks for being such an involved parent and not just lambasting your kiddo for a mental disorder. It seems like that would be the most basic level of care, but you might be surprised (or may not be, depending on how long you’ve been dealing with this as a family) how many parents refuse to do anything to make things more accessible, thinking it will solve everything.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700853710.0, "datetime": "2023-11-24T19:21:50", "subreddit": "ARFID", "id": "kalmk8z", "text": "This just happened with Daiya vegan cheese and it’s the only vegan cheese that was allergen free, AND I can’t eat dairy. There is no alternative now. My husband bought 10 of the old packs of slices when and wherever he found them, but I’m not looking forward to running out.\n\nI was talking to my recovery coach and dietitian, and I swear this has happened to at LEAST 6 different staple safe foods I’ve had while working with them, and it’s always a panicky time trying to find something to replace it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1702406787.0, "datetime": "2023-12-12T18:46:27", "subreddit": "EatingDisorders", "id": "kd2lej3", "text": "Wow, I felt this on a visceral level. You captured this experience so perfectly. I’m unsettled by how much it resonates.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1704582565.0, "datetime": "2024-01-06T23:09:25", "subreddit": "EatingDisorders", "id": "kgngb56", "text": "Firstly, congratulations feels like far too tame a word for how awesome this is, but nonetheless, CONGRATULATIONS for making it to this point. That is heard earned and SO deserved, and I legit had a smile on my face reading those.\n\nI’ve been dealing with AN for 20+ years, and since the start of the year, I’ve taken more action than any other points in my most recent relapse that started in 2021. Fear is paralyzing me, mentally at least, but I’ve been pushing forward, and you gave me hope that next year I very well could be able to say similar things to what you’re saying now. Thank you so much for sharing this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1704679865.0, "datetime": "2024-01-08T02:11:05", "subreddit": "EatingDisorders", "id": "kgtv134", "text": "Exactly. I keep trying to tell myself I’ve had over 2 decades of knowing what the ED can give me…I owe it to myself and anyone supporting me to really give recovery a full try because I can actually say it didn’t work. And I’ve not yet gotten to that place, so I gotta keep going or this is going to be a lifelong fight.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721712784.0, "datetime": "2024-07-23T05:33:04", "subreddit": "AnorexiaNervosa", "id": "lei2kjd", "text": "Almost 36. I feel like I’ve lost and wasted so many years and possibilities.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722248688.0, "datetime": "2024-07-29T10:24:48", "subreddit": "AnorexiaNervosa", "id": "lfgtwz9", "text": "THANK YOU! Sorry for the all caps, I’m just really freaking grateful for the mod team here.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727184743.0, "datetime": "2024-09-24T13:32:23", "subreddit": "AnorexiaNervosa", "id": "loorse0", "text": "That “gold standard” treatments (looking at you, CBT) aren’t designed with autistic brains in mind. And a lot of people with AN are autistic, much larger a percentage than the population at-large. It doesn’t mean you’re a failure if it takes a long time to find an approach that works for you.\n\nEdit: stupid typo", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727184987.0, "datetime": "2024-09-24T13:36:27", "subreddit": "AnorexiaNervosa", "id": "loosgej", "text": "Preach! I’m right there with you. I’m so glad you have a team now who seems to get it, that’s a big deal! (Proud of you for continuing to push forward to find care that worked for you!)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727185369.0, "datetime": "2024-09-24T13:42:49", "subreddit": "AnorexiaNervosa", "id": "lootinb", "text": "I actually feel like I could write the comment you wrote, because it took forever, but I’ve finally got a decent support system. Still currently being recommended for a HLOC, but will be able to return to working with my current OP team, which is a huge deal. Thank you, friend.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727434509.0, "datetime": "2024-09-27T10:55:09", "subreddit": "ARFID", "id": "lp5z2uz", "text": "There’s a reason there’s a whole Friends episode about this. Sorry, dude, you deserve better than that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728322439.0, "datetime": "2024-10-07T17:33:59", "subreddit": "AnorexiaNervosa", "id": "lqt3s09", "text": "Hey, I just want to say I know this sucks. I know you’re pissed. You’re probably also scared. And the eating disordered part of your brain (“ED”) is freaking terrified–but it’s coming out as anger because that’s an easier emotion to feel than the terror, especially when you’re in a situation like being inpatient.\n\nAND, I want to echo a little of what others have said, while also holding space for the valid emotions you’re experiencing. This is a mental illness, and one that requires weight monitoring, especially in an inpatient setting. \n\nIf you’re getting inpatient care, it means you need that care. No EDU is admitting patients who don’t need the level care, because insurance wouldn’t cover it. Most outpatient providers can’t ethically work with someone who is medically unsafe, and again, that’s likely why you’re inpatient right now. \n\nAs much as it sucks, it IS also just part of how treatment works. Especially when going through nutritional rehabilitation and/or weight restoration. It’s extremely common for blind weights to be the norm, and I’m not sure any ED-specific facility would let an adolescent see it, even if they allow adults the choice (some do–but definitely not all–and some that do only really show you a range/trend). I don’t know how old you are, OP, but if you’re under 18 (or even under 21, with close family involvement), that can play a factor. But even if you’re an adult, this can be distressing…and in some places may be policy.\n\nAgain, it sucks, and as much as your brain is fighting against it (because that’s what the disordered brain does), it’s also for your long term benefit. And the cruel part of this illness is that a malnourished brain isn’t capable of accurately perceiving the fact that the body it’s attached to is, in fact, in danger…not until we are nutritionally stable can we even begin to recognize the very real danger, and it’s hard, because the body has to do a lot of recovery much sooner than the mind can follow. \n\nHowever, the only way for the mind to be able to truly follow and heal is to keep pushing through the physical suckiness and trusting the process (or radically accepting it, if you’re not the one making treatment decisions) so your mind has a chance.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738075310.0, "datetime": "2025-01-28T14:41:50", "subreddit": "EatingDisorders", "id": "m9n4m2y", "text": "I see both sides in the comment section, and have been on both sides at points. Now, nearly 2 and a half decades into this, I’m more than ever convinced that while full recovery can be possible, I don’t think there’s a life where I’m ever truly free from all aspects of this disorder, mentally or physically.\n\nBut that’s why I’m a fan of harm reduction done on an individual level. It’s not “giving up,” it’s a team/provider meeting you where you are and working on quality of life improvements and incremental steps forward in that way, that may hopefully lead to pursuing further ED recovery, but not given up on if that doesn’t happen. There’s usually a contingency of ED behavior at least being somewhat reduced or managed/monitored, but I’ve seen a lot of people able to enjoy life again without the pressure of choosing between “you have to recover 100%” (which feels impossible for many at various points) or “you have to be super sick and utterly miserable 100% of the time.”", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742598690.0, "datetime": "2025-03-21T23:11:30", "subreddit": "AnorexiaNervosa", "id": "mj2635l", "text": "Unfortunately that’s not completely accurate. I was just inpatient at a program a couple times last year, and the therapist I had there said they had seen patients admitted to the EDU who had managed to get Ozempic despite already being on in the UW/anorexia bmi range.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744194414.0, "datetime": "2025-04-09T10:26:54", "subreddit": "AnorexiaNervosa", "id": "mm6s6zt", "text": "I wanna say more than I can, but I at least want to add this comment. Honestly, your roommate sounds very toxic. I don’t use that word lightly. If your roommate has an ED, and knows you have an ED, that kind of comment serves nothing except to try to tear you down and make your roommate feel better about themselves. It’s just guys in the way of a fake compliment. \n\nOr, your roommate’s clearly very disordered mind was speaking up, and either way, their words are bullshit. \n\nAlso, I would even consider setting boundaries about grocery talk, if you can’t stop him from sharing his, you can absolutely set your own boundary that he cannot ask about your groceries or food. You have to prioritize you.", "parent_id": null, "link_id": null, "context": null}
