{"type": "post", "timestamp": 1596090229.0, "datetime": "2020-07-30T06:23:49", "subreddit": "bulimia", "id": "i0h1ll", "text": "not only are they expensive but i had to go to the hospital so thats gonna cost a ton also. plus taking them is exhausting", "title": "laxatives are stupid", "context": null}
{"type": "comment", "timestamp": 1596121314.0, "datetime": "2020-07-30T15:01:54", "subreddit": "bulimia", "id": "fzqgqcw", "text": "i thought i had no issues, its been 2 years and i seem fine to others. other day though literally 30 hours straight of diarrhea and vomiting until i had to call an ambulance. now only were my electrolytes bad, but my esophagus is injured and the doctor said it looks like pre cancerous cells are forming from the stomach acid exposure. please be safe.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1596121935.0, "datetime": "2020-07-30T15:12:15", "subreddit": "bulimia", "id": "fzqi1rk", "text": "Okay so I know some these people use scare tactics to talk about them but I’m going to be 100% honest. I started taking laxatives a little over 2 years ago and became really obsessed. I went off to college and at the time I was taking around 8 per day. Beyond suffering from anorexia, my roommates were god awful and made me out to be like some heroine addict and accused me of doing something illegal and tried to get me kicked out of my apartment (which didn’t work, cause they were like.. um these are just poo pills from CVS). Anyways I became more addicted and weaker, eventually not being able to do much without worrying about my GI tract. I threw up during a final once (I do not force myself to vomit. Laxatives have ruined the lining of my esophagus leaving me with severe GERD and Barrett’s esophagus) so I vomit unintentionally. Sometimes I wake up in the middle of the night, vomiting in my sleep, choking. The other night I took some laxatives and thought nothing of it. Than, I spent 30 + hours vomiting and having diarrhea. There was blood in my diarrhea and esophagus. I called myself an ambulance and my blood pressure was 64/50 which is DEADLY. I was also so dehydrated that in a 2 day hospital stay I had to get over 40 needles because my veins kept bursting snd collapsing which is excruciating and my mom couldn’t visit me because of COVID. On top of that, not having access to laxatives meant I gained 5 lbs of water weight due to intense swelling in my ankles, and swelling in my arms. Luckily, I am able to have bowel movements without them which I am very lucky. But this is because the GI was kind enough to understand and provided me with SAFE GI medications that could help my stomach properly empty to avoid more buildup which could hurt my esophagus more. Because of laxatives, I have colitis which doesn’t go away and means I get ulcers on my colon. I have a tear in my esophagus and am at increased risk for esophageal cancer. I’m 21 years old. I’ve barely lived. My GI system is a mess and they only make you feel empty. They’re an illusion. Don’t let them fool you, please", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600400090.0, "datetime": "2020-09-18T03:34:50", "subreddit": "AnorexiaNervosa", "id": "g5o2ans", "text": "You are a beautiful woman! ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1601418502.0, "datetime": "2020-09-29T22:28:22", "subreddit": "AnorexiaNervosa", "id": "g743eo1", "text": "wow great job! about 2 months ago i started allowing myself one cup of 2% chocolate milk per evening. some nights i don’t have it but i have also turned my fear foods of juice (apple) and (orange) into safe foods so before bed i always allow myself a caloric beverage as a dessert and its been a great step bc i was very afraid. great job!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1601653710.0, "datetime": "2020-10-02T15:48:30", "subreddit": "AnorexiaNervosa", "id": "g7eu5pg", "text": "I will keep you in my prayers. I totally agree. Right now I am not in a real state of recovery, I have dream about it but they turn into nightmares where my ED taunts me and my mom is so stuck in the idea that when I weighed more I was doing better. She says if I gain weight and stuff again my life will be great again, she thinks I wasn’t struggling at all when I was physically recovered and I’m like you don’t get it my mind was still completely engulfed with this pain it was never easy. I want you to continue and try to live, take all the time you need it certainly is a full time job and there is no rush to heal. You are doing your best. 💕", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1603490622.0, "datetime": "2020-10-23T22:03:42", "subreddit": "AnorexiaNervosa", "id": "g9t1qoy", "text": "I love pizza I’m gonna make some on Sunday. A cheese pizza and a veggie pizza with mushrooms, peppers, onions, and tomatoes. Yummmmy", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1603846285.0, "datetime": "2020-10-28T00:51:25", "subreddit": "AnorexiaNervosa", "id": "gac0jj3", "text": "You should be very happy for yourself. You are very accomplished!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1603936462.0, "datetime": "2020-10-29T01:54:22", "subreddit": "bulimia", "id": "gag6e7o", "text": "yes its scary", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1604069244.0, "datetime": "2020-10-30T14:47:24", "subreddit": "EatingDisorders", "id": "galrqig", "text": "You’re the only person i’ve seen advocate for this and you’re so right. My ed recovery is more important than anything else.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605678659.0, "datetime": "2020-11-18T05:50:59", "subreddit": "bulimia", "id": "gcozd6q", "text": "that sounds so yummy", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606445576.0, "datetime": "2020-11-27T02:52:56", "subreddit": "EatingDisorders", "id": "gdq8t7b", "text": "if she is an adult its hard to stop her. sincerely an adult who drives her worried mom insane", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606585505.0, "datetime": "2020-11-28T17:45:05", "subreddit": "fuckeatingdisorders", "id": "gdwax8o", "text": "i agree. this is triggering and presumptuous and i don’t like it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606844892.0, "datetime": "2020-12-01T17:48:12", "subreddit": "fuckeatingdisorders", "id": "gea2fnt", "text": "About 2 years ago I insisted on getting my steps in by going for a walk in my neighborhood at night, around 7 pm. It was November and dark outside. My mom wouldn’t let me use our treadmill at the time. \n\nAbout 1/2 a mile from my house a car pulled up to me, a man stepped out of his car, got in my face, began asking my age, and attempted to lure me into his car. Another car pulled over and honked their horn and told him to get his car out of the road. The man pulled out of my community at over 90 miles per hour. I was so scared to walk home. I knocked on the door of the house I was in front of and they let me wait inside, I called my mom and we called the police. \n\nYeah don’t walk at night. He was definitely trying to kidnap me. I was so scared.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606884653.0, "datetime": "2020-12-02T04:50:53", "subreddit": "fuckeatingdisorders", "id": "gec79rz", "text": "Thank you. I havent walked at night since. If anything, my mom just has let it go that im a “pacer” in my house lol", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1607234827.0, "datetime": "2020-12-06T06:07:07", "subreddit": "fuckeatingdisorders", "id": "k7oail", "text": "This isn’t really that big a deal I guess because I eat a lot of these “challenging” foods all the time but ordering or even admitting that i want takeout is a HUGE deal for me. I cook every night bc I feel the need to provide for others and that in order to eat i need to accomplish something like make something nice or make others happy by making food for them (i enjoy eating with family theyre kinda supportive) but literally college has been SO rough and its been impossible to cook all the time, finish my exams, and have time to do normal sh** like shower (or do my nails which i really wanted to do tonight!) Yesterday I had a bad stomach all day and couldnt eat til late and my mom was like what can i make you and i was like i really want pizza can we got pizza and we ordered cheese pizza from the place that makes real New York Pizza and it was so good 😊 and i had that for dinner last night and then for lunch today too. And after lunch I had to take an exam for 3 hours online and then i wanted to shower, go for a walk, and do my nails and i was CRAVING Chinese food. I havent had chinese takeout in a minimum of 5 years. Only ever would steal like 4 spoons of fried rice when my dad got it bc he never dared asked me bc im anxiety times 1000x. So tonight my mom was like what do u wanna eat and i was like uh idk and after like 20 minutes of me shaking i was like “honestly im craving chinese food so badly like craving” and she was like “let me see if dad is near the good place on his way home from work, ill have chinese too.” and she was like what do you want and i was like, soup, spare ribs, and lo mein. so for all of us she ordered a wonton soup, a small hot and sour bc thats my jam, spare ribs, pork fried rice, and vegetable lo mein noodles. we ate and watched a movie and it was SO good!!!! omg i had takeout twice in one day and for dinner two nights in a row obviously were not made of money so can’t do that everyday but man i really needed it so bad. i needed reassurance like 90 times and my mom was like “um i get food/order food at work a few days per week food is a necessity you’re allowed to have someone else do the work you dont need a reason.” do yeah im freaking out a bit but it was delicious 10/10", "title": "I had pizza and chinese food today", "context": null}
{"type": "comment", "timestamp": 1607278040.0, "datetime": "2020-12-06T18:07:20", "subreddit": "fuckeatingdisorders", "id": "geuqypq", "text": "IM FREAKING OUT BC I GAINED 2 LBS OVERNIGHT IM JUST TRYNA TELL MYSELF ITS WATER AND FLUCTUATIONS AND TO CHILL\n\nand yes most of the time they are quite nice i am so happy they ordered me takeout bc like they get it a lot but are always scared to ask me bc im in a panic about food 107% of the time but theyre like girl u know if u want chinese food or pizza or ramen or chick fil a we gotchu. like my first year of college my dad would pick up vegan takeout every weekend or even sometimes eat in the vegan restaurant with me that he hated bc it was my “safe place” and then the weird restaurant fear happened :o", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607280804.0, "datetime": "2020-12-06T18:53:24", "subreddit": "fuckeatingdisorders", "id": "geuxfep", "text": "True. Yesterday I ate 2 slices of pizza (lunch), one scoop of rice, 3 ribs, and a serving of lo mein noodles. And 2 cups of organic apple juice. That is not 7000 calories. That is a normal amount of food! I walked 5 miles and my body needed to eat well! I need to remember that! Salt and fluids can shift our bodies water balance all the time it is no biggie just relax and let it pass. :-)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1608662493.0, "datetime": "2020-12-22T18:41:33", "subreddit": "AnorexiaNervosa", "id": "ggpsg7k", "text": "yes i used to be a nanny for a 4 year old and he was like 35 pounds and liked to weigh himself on his moms scale for fun and i would genuinely be envying a baby", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609912933.0, "datetime": "2021-01-06T06:02:13", "subreddit": "fuckeatingdisorders", "id": "gi9z6ar", "text": "I have to push through this a lot and its hard and im so proud of you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609970144.0, "datetime": "2021-01-06T21:55:44", "subreddit": "bulimia", "id": "gicnyez", "text": "As a result of my laxative abuse, I now have ulcerative colitis. An incurable autoimmune disease which causes bleeding of the intestines. I shit blood. I agree, DO NOT DO THIS", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610173589.0, "datetime": "2021-01-09T06:26:29", "subreddit": "EatingDisorders", "id": "gims63d", "text": "hello. you sound like you mean well and i know you think that you can help her reach her goals and stuff, but i must forewarn you, this is dangerous territory. eating disorders are not just something you get over. they are extraordinarily deadly diseases. your girlfriend sounds like she is sort of in \"remission\" but her thoughts are still there, and once she starts acting on these behaviors, it can go from \"healthy weight loss\" to death by ed. \n\nher body is not nearly recovered enough. it's been less than a year and this us a dangerous time. i do not think it is a good idea despite the fact that for your healthy brain, numbers are a great progress tracker- for her they are not. \n\nyou should not be out loud agreeing with her desire to lose weight as it affirms her current insecurities. the low end of healthy is not the only healthy weight or body fat percentage. she sounds to be in a healthy range at this moment and disrupting that and risking a relapse is not worth it. \n\nin addition, the comment \"her anorexia didn't appear as severe as it can be for some individuals,\" is irrelevant here. people of ed's die at all different weights. some people with bulimia hide it for years and die of heart failure while being at a perfectly healthy bmi, because their muscle is so damaged from their ed behaviors. \n\ni was in the same position your gf was in a few years ago. i started recovery and was doing great, got a boyfriend who was health conscious and treated me kindly. i expressed that i wanted to lose weight despite being a healthy weight and he loved working out with me. -- i will not continue the story or blame him because the relapse was out of his hands, but within a few months i was about 66 pounds and unable to control my bowels anymore. i was a 19 year old who could not control my ability to pee or use the restroom the other way. \n\nit spirals so quickly and is such a dangerous disease. it sounds like you love her very much and losing these few pounds could put her in a lot of danger. i encourage you to support her through her continued nourishment and assurance that she is worthy and valuable no matter what she weighs or her body fat percentage. none of those numbers matter to you as much as she does. make sure she remembers that and best of luck to you both on health and happiness.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610254311.0, "datetime": "2021-01-10T04:51:51", "subreddit": "AnorexiaNervosa", "id": "giqfrgg", "text": "i mean id probably genuinely think you had a baby but at the same time if u told me u eat baby food id be like \"sounds good as hell we love babies so much so i bet theyre food is hella healthy and fresh. luv ur self care vibes 12/10\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610776550.0, "datetime": "2021-01-16T05:55:50", "subreddit": "fuckeatingdisorders", "id": "gjffecx", "text": "Yes, and it's very sad. I have restrictive ed too and understand being at that severity but even when i was in a compromised state i didn't go out of my way to trigger others. I noticed she has difficulty interacting with others in public and I wonder what else could be wrong. I just pray she lives. Idc what she looks like just please God she's still so young she deserves to LIVE", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610903243.0, "datetime": "2021-01-17T17:07:23", "subreddit": "AnorexiaNervosa", "id": "gjm8lvb", "text": "That sounds absolutely delicious! Great job!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611248586.0, "datetime": "2021-01-21T17:03:06", "subreddit": "AnorexiaNervosa", "id": "gk2u02t", "text": "How does telling everyone how many grams of rice you ate today help ur progress\n\nif u need to bring others down and make them sicker just to make \"progress\" than ur an asshat", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611250196.0, "datetime": "2021-01-21T17:29:56", "subreddit": "AnorexiaNervosa", "id": "gk2xph9", "text": "You come on to a sub for the most deadly mental illness. If you feel the need to purposefully trigger others who are also dying from this, than that's just awful. Being sick is not an excuse to hurt other people.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611251299.0, "datetime": "2021-01-21T17:48:19", "subreddit": "AnorexiaNervosa", "id": "gk307le", "text": "Well the sub rules is no numbers. So if you post on the sub, you agree to follow the rules. Same how in treatment centers in group therapys no numbers are allowed. Because if your recovery means having to put others at risk, *that* is selfish", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611253414.0, "datetime": "2021-01-21T18:23:34", "subreddit": "AnorexiaNervosa", "id": "gk34v3o", "text": "It doesn't matter if it's not intentional. It's been shown to negatively affect others' recovery and lead them to engage in increased ED behaviors. *That* is selfish. \n\nYou'd get kicked out of treatment centers/groups if you acted that way because it's childish. End point.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613579970.0, "datetime": "2021-02-17T16:39:30", "subreddit": "AnorexiaNervosa", "id": "gns3c3z", "text": "Yes. But i think even that deprivation feeds ed! and thats who we never want to feed :D", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615432446.0, "datetime": "2021-03-11T03:14:06", "subreddit": "bulimia", "id": "gqj03v3", "text": "My diagnosis is technically anorexia but my biggest issue is definitely purging (I restrict and purrge). I also feel ashamed and out of place around other anorexics since I use laxatives and don't vomit. I eat about 12-1500 calories per day and people with anorexia tend to tell me I don't seem anorexic I just seem \"lucky to be so thin.\"\n\nI feel much safer in the bulimia community if i'm honest. Less competitive, mean, less shame around purging.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615996328.0, "datetime": "2021-03-17T15:52:08", "subreddit": "fuckeatingdisorders", "id": "gr8yaan", "text": "other day GI told me i \"eat a lot more than most anorexics.\" it freaking hurt", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615996791.0, "datetime": "2021-03-17T15:59:51", "subreddit": "fuckeatingdisorders", "id": "gr8zbv5", "text": "unfortunately not even that is enough. i hate using numbers but my bmi is in the 12's range and i just got out of the hospital last month and wear a heart monitor and have to take heart medication to keep my circulation going and my legs from turning blue. they really don't care until you've gone weeks without eating and are completely dead. i told her i eat between 900 and 1400 per day right now and mapped out a few random days and she was like wow you went out to eat and got a steak! i'm shocked. she was surprised that i could socialize and speak like a f**king adult because she was using this damn baby voice whEn i finally corrected her and said, \"i'm not a smart kid, i'm a grown woman.\"\n\neating disorders and the ignorance surrounding them is literally horrible. its like cute and runny and quirky, until you're dead", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616001072.0, "datetime": "2021-03-17T17:11:12", "subreddit": "fuckeatingdisorders", "id": "gr9905t", "text": "i was there to get a scan because i have ulcers and intestinal damage from laxative use and she was like isnt it gross to take that many laxatives i was like no its so fun :-)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616001459.0, "datetime": "2021-03-17T17:17:39", "subreddit": "fuckeatingdisorders", "id": "gr99v4c", "text": "the most evil was when she said \"ive never heard of someone abusing that many laxatives\" and i said \"i think most people dont talk about it because they get judgmental comments from doctors (who are supposed to be professional), sort of like the ones you just made to me\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616001691.0, "datetime": "2021-03-17T17:21:31", "subreddit": "fuckeatingdisorders", "id": "gr9adsd", "text": "on a more positive note at the cardiologist where they figured out what was wrong with my heart the nurse asked if i use substances and i said, \"i abuse a lot of laxatives and diuretics,\" and she said, \"thank you for telling me. which ones if i may ask? we appreciate it, it makes it easier for us to help you and make sure the medications we prescribe for you are safe to use with what you take at home.\" and i asked if i could just write it and she was like, \"no problem.\" made it easy for me.\n\nit does suck though because a gastro could actually help with my stomach issues and help me get OFF THE LAXATIVES but instead laughed in my damn face!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623817307.0, "datetime": "2021-06-16T04:21:47", "subreddit": "AnorexiaNervosa", "id": "h1xle2a", "text": "I already got the post saying it was deleted hours ago omg why am i getting more notifications of the comment being deleted? Just delete it lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651181461.0, "datetime": "2022-04-28T21:31:01", "subreddit": "AnorexiaNervosa", "id": "i6l456b", "text": "I'm in the exact same place", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651182097.0, "datetime": "2022-04-28T21:41:37", "subreddit": "AnorexiaNervosa", "id": "i6l5nzy", "text": "Its so horrible friend", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659546038.0, "datetime": "2022-08-03T17:00:38", "subreddit": "fuckeatingdisorders", "id": "iisyls1", "text": "Yeah for real and this is coming from someone who is underweight and has experienced different problems. My heart rate isn't deathly low, it's too high and I need meds to lower it. Half the posts on this sub are just triggering af people with Restrictive AN bragging about how \"dangerous\" it is while gloating in it. I hate it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665114504.0, "datetime": "2022-10-07T03:48:24", "subreddit": "bulimia", "id": "ird886g", "text": "I'm honestly jealous and so proud of you today is my day 1 and i have such anxiety i wish u so much luck", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665330230.0, "datetime": "2022-10-09T15:43:50", "subreddit": "fuckeatingdisorders", "id": "irn92za", "text": "I'd have a hard time with it because I'm still living with my mother who's a lot like hers was.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1668298673.0, "datetime": "2022-11-13T00:17:53", "subreddit": "bulimia", "id": "iw4ywws", "text": "Been both and i prefer Anorexia as well. Trying to go back to it. Bulimia is hard and recovery. You don't sound offensive we get it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1668298725.0, "datetime": "2022-11-13T00:18:45", "subreddit": "bulimia", "id": "iw4z0ro", "text": "This is exactly what happened to me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684646751.0, "datetime": "2023-05-21T05:25:51", "subreddit": "AnorexiaNervosa", "id": "jkzuhbp", "text": "This sent me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684646812.0, "datetime": "2023-05-21T05:26:52", "subreddit": "AnorexiaNervosa", "id": "jkzukhz", "text": "😂", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1685552504.0, "datetime": "2023-05-31T17:01:44", "subreddit": "bulimia", "id": "jmd0dld", "text": "I had a heart attack at 14, have been in kidney failure at least 3 times, became severely septic, been in the ICU, had my entire body and face swell until I couldn't even walk or move. Shat blood at disney world... list goes on", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1685732634.0, "datetime": "2023-06-02T19:03:54", "subreddit": "bulimia", "id": "jmnet65", "text": "Just one day i started eating and cutting the laxatives down. It was after the sepsis last july. I was using about 200 a day. Of dulcolax. I'm down to 36 a day, which is way better. I really hate my body and still count calories, but its really nice to not vomit and poop blood all day. I also really try to eat a lot of fiber. Naturally i get hungry now which i have to remind myself is normal and means i'm a human being. \n\nGI system still gets extreme bloating and I can definitely look \"heavier\" than people the same weight due to swelling in my stomach, calves, and face. I wear loose clothes, make my own food, and another thing that helps me is verbalizing my anxiety. Saying out loud \"i feel fat and disgusting. Eating this is hard,\" helps. But you have to counteract it with like \"yeah this cheese has fat, but the spinach has a lot of fiber and is nutritious,\" \"the starbucks barista would not sabotage me by adding cream to my drink cause she doesn't care enough to do that,\" and \"you can't work tomorrow if you take 100 laxatives tonight, cause you'll be vomiting.\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1685732812.0, "datetime": "2023-06-02T19:06:52", "subreddit": "bulimia", "id": "jmnf9ft", "text": "Last random caveat sorry i'm rambling. \nI'm really good at cooking and have found my friends and loved ones are far more impressed with my ability to cook than they ever were with my abilities to starve.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1690598880.0, "datetime": "2023-07-29T02:48:00", "subreddit": "AnorexiaNervosa", "id": "jtw5wox", "text": "I feel this same way can we message. I am going through it so much to", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1690765518.0, "datetime": "2023-07-31T01:05:18", "subreddit": "AnorexiaNervosa", "id": "ju58hrg", "text": "I stopped drinking regular soda two years before I developed my ED. No fear of liquid cals - I drink juice, smoothies, and milk daily. But I only like diet soda! I tried regular a couple times recently and I do not like it. It's ok just to not like it 💖 anorexic people are allowed to have food preferences too!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1697949937.0, "datetime": "2023-10-22T04:45:37", "subreddit": "AnorexiaNervosa", "id": "k5xg3nf", "text": "i do too bro", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1701632018.0, "datetime": "2023-12-03T19:33:38", "subreddit": "bulimia", "id": "kbuprw4", "text": "Yes", "parent_id": null, "link_id": null, "context": null}
