{"type": "comment", "timestamp": 1630231289.0, "datetime": "2021-08-29T10:01:29", "subreddit": "fuckeatingdisorders", "id": "hasc5c7", "text": "So happy for you! Hope you had a wonderful beach day!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630488561.0, "datetime": "2021-09-01T09:29:21", "subreddit": "fuckeatingdisorders", "id": "hb61bi8", "text": "Hell yeah, congratulations! You wanted it, so you had it, love to hear it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630579877.0, "datetime": "2021-09-02T10:51:17", "subreddit": "fuckeatingdisorders", "id": "hbatthm", "text": "Hi, I'm glad you feel safe to post about this here! Thank you for sharing this win, really made me smile to read the excitement in your post and man are pancakes so delicious! Happy you got to enjoy them", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630971447.0, "datetime": "2021-09-06T23:37:27", "subreddit": "fuckeatingdisorders", "id": "hbv9oiw", "text": "It pisses me off beyond belief when they try to put it off as a health concern. Like, no, you're just misogynistic and fatphobic. Because, you don't seem them \"concerned\" about people smoking, drinking, having unprotected sex, (more recently) not wearing masks, etc.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1631698472.0, "datetime": "2021-09-15T09:34:32", "subreddit": "fuckeatingdisorders", "id": "hcxj4wc", "text": "This is literally why it's so important to just have fat people in media whose narratives aren't focused on their weight. I'm so sick of movies/shows where fat people are the butt of the jokes or the premise is about them losing their weight in order to be \"beautiful\" when weight has nothing to do with beauty. \n\nCan I ask which influencers/activists you follow? I'd love to see their content!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1632561956.0, "datetime": "2021-09-25T09:25:56", "subreddit": "fuckeatingdisorders", "id": "he7a825", "text": "I actually used to do this not for keto, but because I heard somewhere that the fat in butter binds to the caffeine molecules, which makes it harder to metabolize, so it essentially elongates the window of time that the caffeine affects you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1632561992.0, "datetime": "2021-09-25T09:26:32", "subreddit": "fuckeatingdisorders", "id": "he7a9mt", "text": "That being fat is bad or having fat on you is bad.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1632603388.0, "datetime": "2021-09-25T20:56:28", "subreddit": "fuckeatingdisorders", "id": "he9kbso", "text": "And it makes me angry still when people try to combat diet culture by saying \"you're not fat!\" as a compliment when it still equates fat as bad (and unattractive).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1633215234.0, "datetime": "2021-10-02T22:53:54", "subreddit": "fuckeatingdisorders", "id": "hf5l8lg", "text": "I feel like I'm in the minority in this because I do like being told that I look healthy. For me, being told that I look \"good\" or \"better\" makes me feel worse? Like, I know that doesn't make sense, but it's just like my disordered eating habits started from low self esteem and I just don't like tying my worth with my appearance anymore even if it's meant to be a compliment (which I probably shouldn't take negatively, but I do :/).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1634904153.0, "datetime": "2021-10-22T12:02:33", "subreddit": "fuckeatingdisorders", "id": "hhlyja9", "text": "I've felt so invalidated as well by this... especially from \"ED recovery\" accounts where they show how skinny/bony they were (listing out their weights, heights, or BMIs, talking about the specific number of calories they'd eat, their thigh gaps, etc.). Then, they'd encourage weight gain and say things about how thigh gaps aren't important (whilst still looking very thin, unfortunately it makes me question if they are really in recovery). \n\nI don't know, it just makes me feel like I can't gain weight or eat more if I never got as skinny as they did (never got a thigh gap, never restricted to the x amount of calories they ate, never got to x amount of steps or worked out for x amount of time for x amount of days). \n\nIt's hard to get past these thoughts, but it's most helpful when I find other accounts that are actually encouraging. The bottom line is that these numbers don't mean shit. Eating disorders look different for people but recovery is relatively the same. You deserve to eat and you deserve to do it unconditionally because your body and your mind needs it. It's not something you have to earn, it's something you SHOULD have.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636193789.0, "datetime": "2021-11-06T10:16:29", "subreddit": "fuckeatingdisorders", "id": "hjj86el", "text": "I know people like this (or knew, I guess). My guess though is that she's likely gonna develop disordered eating habits or she's already struggling. Part of developing an ED can be wishing you had (disordered thoughts).\n\nAs for stuff like \"I'm so OCD!\" \"I'm actually so bipolar about\" etc. that is definitely gross to say :/ and I'm sorry you have to hear that. It seems so invalidating yet at the same time perpetuating negative stereotypes", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636741630.0, "datetime": "2021-11-12T18:27:10", "subreddit": "fuckeatingdisorders", "id": "hkd1xir", "text": "I'm actually crying, because so often I see \"WIEIAD - Extreme Hunger Edition\" and it's literally nothing compared to what I eat. Seeing your post look similar to the amount that I eat has really helped reassure me that extreme hunger looks different for people.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636742779.0, "datetime": "2021-11-12T18:46:19", "subreddit": "fuckeatingdisorders", "id": "hkd4o8m", "text": "For sure! I didn't want to say that and discredit them because I do feel bad but I honestly and genuinely believe they aren't actually honoring their extreme hunger. \n\nI'm very much glad whenever I see something like that I scroll past/indicate \"not interested\" to avoid seeing posts like that in the future.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1637766918.0, "datetime": "2021-11-24T15:15:18", "subreddit": "fuckeatingdisorders", "id": "r17ghe", "text": "i love bread. \n\nidk. like all carbs. but especially toast. with butter. oml.\n\ni used to hate the butt end of bread/crust. but now i fucking love it. like after it's been toasted... it's a different type of love. unconditional. so beautiful. so tasty. \n\ni just had to express my love <3 and formally apologize to all the butt ends i used to skip over :( im so sorry :(", "title": "bread", "context": null}
{"type": "comment", "timestamp": 1637769129.0, "datetime": "2021-11-24T15:52:09", "subreddit": "fuckeatingdisorders", "id": "hlwva1r", "text": "YUP, IT'S SO VERSATILE.\n\nAt any meal you can have bread without people thinking you're weird. And you take it on the go. And you get it at like any restaurant. You can have it by itself. With sauces/dips. As a sandwich. With soup. \n\nAnd having a whole loaf (like sourdough) and tearing off chunks with your hands and dipping in oil or using the piece to scrape butter!! It's literally so fun ?? \n\nBread is love.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637781319.0, "datetime": "2021-11-24T19:15:19", "subreddit": "fuckeatingdisorders", "id": "hlxqcen", "text": "Ma'am, very relatable :) I had 4 pieces of toast with butter as a mid-morning snack after breakfast. Then had a sandwich with toast for lunch <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637795180.0, "datetime": "2021-11-24T23:06:20", "subreddit": "fuckeatingdisorders", "id": "hlyov2b", "text": "BREAD BOWLS\n\ncue TikTok song... \"gorgeous gorgeous girls love soup\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637836755.0, "datetime": "2021-11-25T10:39:15", "subreddit": "fuckeatingdisorders", "id": "hm0rtf8", "text": ":) Aw I love to hear this!\n\nBut yes, that's such a good combo! I love making it in the oven to get it toasty/crusty (b/c of the sugar)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637863059.0, "datetime": "2021-11-25T17:57:39", "subreddit": "fuckeatingdisorders", "id": "hm24kj0", "text": "Peanut butter, then sliced banana, drizzle honey, and some cinnamon!\n\nSo delicious!\n\nI've been really wanting to try cream cheese with jam, like that sounds so good and I feel like I'm missing out.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638206392.0, "datetime": "2021-11-29T17:19:52", "subreddit": "fuckeatingdisorders", "id": "hmjw4r7", "text": "A lot of these actors and actresses have disordered eating habits or a perpetual diet.\n\nIf you look at Selena Gomez, Taylor Swift, Demi Lovato, Christina Aguilera, you see that they used to be super tiny and all of them have come out talking about their eating disorders. As for the reverse, Brittany Murphy, Ariana Grande, and many others (that I'm blanking on) have lost weight as they've become more famous. \n\nIn other words, most skinny celebrities have to try hard to maintain the physique because it isn't sustainable and isn't their set weight/point. Like, when I was younger, I thought Taylor was just \"naturally\" skinny but then she came out and talked about her eating disorder. And, I'm honestly thinking the same for every celebrity now (especially when they do \"WIEIAD\" interviews and you see how little they actually eat and how much they exercise).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638226559.0, "datetime": "2021-11-29T22:55:59", "subreddit": "fuckeatingdisorders", "id": "hmla49n", "text": "The tabloids and paparazzi too... Like when they put women with cellulite or rolls on their covers just to body shame them? Like wtf, these women are just existing and living in their bodies? What is so shameful about that? :/", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640206970.0, "datetime": "2021-12-22T21:02:50", "subreddit": "fuckeatingdisorders", "id": "hplqhu3", "text": "I feel so weird but I always like skim read through posts lmaoo and if something catches my eye that is indicative of a triggering statement, I skip the post (usually, if it's not asking for help/advice). I agree that it would be nice if people tried to minimize going into the actual details ab their behaviors", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640269073.0, "datetime": "2021-12-23T14:17:53", "subreddit": "fuckeatingdisorders", "id": "hponoi7", "text": "Sometimes it's nice to relate, but then I see people comment their behaviors on the thread but they seem to go a \"step further\" than the OP in whatever behavior it is and it just turns into a huge ED behavior collection", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641550508.0, "datetime": "2022-01-07T10:15:08", "subreddit": "fuckeatingdisorders", "id": "hrmbck0", "text": "Bro this is kind of badass the way you smashed it, I'm just imagining it and it seems like it'd be so fun and cathartic.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641576161.0, "datetime": "2022-01-07T17:22:41", "subreddit": "fuckeatingdisorders", "id": "hrnt5b5", "text": "That's such a great idea!! Hope you'll make a post again once you figure out what you're gonna do with it!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641722557.0, "datetime": "2022-01-09T10:02:37", "subreddit": "fuckeatingdisorders", "id": "hrwblyv", "text": "I know doctors have so much information they have to remember and retain, but I really wish that they were also told about extreme hunger and at least some information on eating disorder recovery/eating disorder signs. \n\nI feel like a lot of people are often invalidated by their doctors because they aren't well-versed on eating disorders (which isn't entirely on them, curriculum plays a large role in their education/training).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641722602.0, "datetime": "2022-01-09T10:03:22", "subreddit": "fuckeatingdisorders", "id": "hrwbo4p", "text": "have you ever put your Oreos in the freezer? They're so delicious when they're cold. Of course I'm sorry if you're off-put by Oreos now lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641722708.0, "datetime": "2022-01-09T10:05:08", "subreddit": "fuckeatingdisorders", "id": "hrwbt2u", "text": "Can't wait until this gets deleted <3\n\nI know you're saying you're not trying to be rude, but if you take a look at literally any posts here, you can figure out that this behavior is GOOD and is part of recovery. This isn't unhealthy. This is a WIN for OP.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641735794.0, "datetime": "2022-01-09T13:43:14", "subreddit": "fuckeatingdisorders", "id": "hrwv446", "text": "Morning, I just had for breakfast:\n\n&#x200B;\n\nProtein oats\n\n2 bagels with strawberry preserves\n\n2 bananas\n\n3 trail mix packets\n\n1 granola bar\n\n2 pieces mint dark chocolate\n\n3 servings thin mint dark chocolate covered almonds\n\n1 serving regular dark chocolate covered almonds\n\n1 mint oreo\n\n1 unreal coconut dark chocolate bar\n\n1 bag of fritos w/ hummus\n\n1 bag of lays potato chips\n\n2 clementines\n\n1/3 sleeve of townhouse crackers\n\n&#x200B;\n\nand I'm still going (okay well taking a slight break right now because I don't want to get super nauseous, but I'm still mentally wanting more)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641737804.0, "datetime": "2022-01-09T14:16:44", "subreddit": "fuckeatingdisorders", "id": "hrwz45v", "text": "IF YOU CAN FIND THEM YOU HAVE TO TRY THE GINGERBREAD ONES. They're my favorite and I'm so upset they're seasonal :((", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641776800.0, "datetime": "2022-01-10T01:06:40", "subreddit": "fuckeatingdisorders", "id": "hrzvgu5", "text": "The only reason why I ate 1/3 sleeve is because that's all there was left :((", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641776825.0, "datetime": "2022-01-10T01:07:05", "subreddit": "fuckeatingdisorders", "id": "hrzvj21", "text": "I'm at home for break, raiding my parents' pantry >>>>", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643636382.0, "datetime": "2022-01-31T13:39:42", "subreddit": "fuckeatingdisorders", "id": "huzpfyv", "text": "They also love to defend themselves saying that they can exercise because they've been in recovery for x amount of months or that they lost weight because it was \"overshoot\" weight but they really look the same as before they started \"recovering\" or saying that they really are eating whatever they want, they just happen to only crave/want protein oatmeal, no-fat yogurt, spinach, rice cakes with \"pb\" (probably powdered) like hmm... that sounds so tasty to me lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643657419.0, "datetime": "2022-01-31T19:30:19", "subreddit": "fuckeatingdisorders", "id": "hv170ca", "text": "And then they have \"cereal\" for a late-night snack haha so CHEEKY lol <3 xx", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643657430.0, "datetime": "2022-01-31T19:30:30", "subreddit": "fuckeatingdisorders", "id": "hv171hc", "text": "Or popcorn", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643676138.0, "datetime": "2022-02-01T00:42:18", "subreddit": "fuckeatingdisorders", "id": "hv2hxdz", "text": "LMAO and it's like \"ate the whole tub!! honor ur cravings guys\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645014168.0, "datetime": "2022-02-16T12:22:48", "subreddit": "fuckeatingdisorders", "id": "hx5xciu", "text": "I LOVE HER. I can't thank everyone enough for always commenting/recommending her videos/blogs.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645124437.0, "datetime": "2022-02-17T19:00:37", "subreddit": "fuckeatingdisorders", "id": "hxce88e", "text": "Congrats!! I love your excitement lmfao reminds me of when I got my very first period, I feel like most people dreaded it/was scared but I really wanted to have it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645488746.0, "datetime": "2022-02-22T00:12:26", "subreddit": "fuckeatingdisorders", "id": "hxwfp3w", "text": "This is just my opinion... but it really pisses me off.\n\nThe way I see it, they're doing it for the attention. Like, they're still able to restrict and have their ED but they're also getting praised for \"recovering\" and \"challenging\" themselves. So, they're basically getting love for being a recovery account despite not actually recovering (they get to stay skinny). \n\nOf course this isn't the case for everyone, there definitely are some people who are recovering and do genuinely struggle with eating an apple or something. I'm not trying to discredit you if that is you or if that applies to anyone else. My issue is with the accounts where they don't seem to be making much progress (and getting defensive when people show concern) and they seem to be body checking a lot.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1646270742.0, "datetime": "2022-03-03T01:25:42", "subreddit": "fuckeatingdisorders", "id": "hz4jj64", "text": "This is so cute", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1646781074.0, "datetime": "2022-03-08T23:11:14", "subreddit": "fuckeatingdisorders", "id": "hzwh3s4", "text": "I'm so happy for you! (and your friends because they get to see you happy and get to enjoy your company!)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647049672.0, "datetime": "2022-03-12T01:47:52", "subreddit": "fuckeatingdisorders", "id": "i0bh6r4", "text": "I'm just glad that most of the time, when I get to posts, they're already removed by you lol. Can't help but feel bad for the OP when they end up having to read some of those comments on their posts asking for RECOVERY help", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647051529.0, "datetime": "2022-03-12T02:18:49", "subreddit": "fuckeatingdisorders", "id": "i0bkvfh", "text": "It's even worse when OP ends up criticizing themselves saying things like \"you're right\" to the person commenting/giving disordered \"advice.\" :(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647088868.0, "datetime": "2022-03-12T12:41:08", "subreddit": "fuckeatingdisorders", "id": "i0d2j4n", "text": "Yeah, I absolutely can't stand those. It made me feel like I was recovering \"wrong\" because unlike them, I was constantly eating, bloating, barely moving unless I was eating (otherwise I was laying bed, thinking about food, waiting until I was even just a little bit less full so that I could eat again).\n\nTo me, it's clear that they're still disordered. They may be \"recovering\" still but they are far from their claim of being recovered. I find it way easier to ignore them and find solace here where people are more serious about recovering and are honest about their journeys", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647128319.0, "datetime": "2022-03-12T23:38:39", "subreddit": "fuckeatingdisorders", "id": "i0fhis4", "text": "Okay YUM!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647441299.0, "datetime": "2022-03-16T14:34:59", "subreddit": "fuckeatingdisorders", "id": "i0w0nhk", "text": "Your replies are awesome! Just wanted to let you know! I'm glad you're also getting some benefit as well because I've felt you've done so much that has helped me (and I'm sure many others here)", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1647528234.0, "datetime": "2022-03-17T14:43:54", "subreddit": "fuckeatingdisorders", "id": "tgbtmh", "text": "By our parents (probably moms). Family. Friends. Classmates. Significant others. Society most of all. \n\nI'm sorry for all of us. None of this shit is our fault and I want to say that because part of the ED tells us we're to blame. That there's something wrong with US, but I'm here to say that's a fucking lie and FUCK anyone who has told us otherwise that's led in part to our EDs (or to the people that STILL say shit even now when we're in recovery).", "title": "We Were All Failed", "context": null}
{"type": "comment", "timestamp": 1647561315.0, "datetime": "2022-03-17T23:55:15", "subreddit": "fuckeatingdisorders", "id": "i137h37", "text": "This just made me so incredibly sad. I'm so sorry for you (and your mom). It always hurts the most from people that are close to you and are supposed to really love/care for you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647642544.0, "datetime": "2022-03-18T22:29:04", "subreddit": "fuckeatingdisorders", "id": "i17n9p6", "text": "Yes, that shit annoys meeeee\n\nI legit got banh mi  for dinner the other day. Was not enough. So... I got another banh mi AND I got a rice noodle bowl. So basically I ate the equivalent of 3 \"meals\" for dinner. I'm sure the blogger would honestly count it as 6 meals because the banh mi is a baguette sandwich (similar I guess to Subway's footlong) and they'd probably only eat half of it for a meal lmfao", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647643537.0, "datetime": "2022-03-18T22:45:37", "subreddit": "fuckeatingdisorders", "id": "i17phrb", "text": "HAHA, I used to get home from high school and have a Chipotle burrito bowl as a pre dinner snack lmfaoo. I'm sorry but those school lunches were MINISCULE", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647647214.0, "datetime": "2022-03-18T23:46:54", "subreddit": "fuckeatingdisorders", "id": "i17xg2e", "text": "OMG, glad I wasn't the only one. Everyone at lunch would complain about the food, but here I was cleaning off my plate and getting hella servings of the chili, devouring the hot dogs, the spicy chicken patties. They were good and I stand by that. The amount of shame I'd sometimes feel because it felt like I had \"low\" standards or something or was some sort of food gremlin lmfao", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647944669.0, "datetime": "2022-03-22T10:24:29", "subreddit": "fuckeatingdisorders", "id": "i1n7fcc", "text": "Lol I don't really like them on their own, unless flavored. The small like chips version are good but the actual like discs lmfao, cannot do anymore. Otherwise, popcorn <3 if I want something with a similar texture or if I just want a salty snack, then chips.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647997858.0, "datetime": "2022-03-23T01:10:58", "subreddit": "fuckeatingdisorders", "id": "i1qlq16", "text": "I did this but coupled with being cold all the time, it really sucked. I'd deadass wrap myself up in blankets while eating them. Or I'd take a scalding hot shower afterwards to warm myself up", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648411598.0, "datetime": "2022-03-27T20:06:38", "subreddit": "fuckeatingdisorders", "id": "i2cqdsj", "text": "Yes. try different brands/types (smooth, crunchy, runny, chocolate). You can also try peanut butter flavored things if you're not keen on peanut butter itself (pb cookies, pb granola bars, pb cereal, pb ice cream). If you're not a fan of sweets, try peanut noodles (SO SO GOOD, there are different types like Chinese, Thai, Vietnamese). \n\nI think one of the best ways to enjoy peanut butter is spreading it on a cinnamon raisin bagel after it's toasted, because the peanut butter melts into it and it's just SO good. Otherwise I really like peeling a banana, and then spreading peanut butter onto it, taking a bit, and then repeat.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649353937.0, "datetime": "2022-04-07T17:52:17", "subreddit": "fuckeatingdisorders", "id": "i3sg29d", "text": "I toast my bagels and our toaster can only toast one bagel at a time.\n\nI've been eating 5 bagels in one sitting. So I'll make a bagel. Pop another in the toaster. Eat it. Repeat until I've finished the package. It's annoying because I have roommates like you and I know they can hear the \"ding\" the toaster does when it's ready. I eat in my room, so they can also hear me going in and out of room numerous times in like a 15 minute period as I'm making these bagels and gobbling them down. Maybe they can't actually hear it but I'm convinced they can. Either way, I try to do it as stealthily as I can lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650051809.0, "datetime": "2022-04-15T19:43:29", "subreddit": "fuckeatingdisorders", "id": "i4vd4q7", "text": "There's this girl that I follow and who follows me back, so we're \"friends\" on TikTok. She posts WIEIAD stuff and it's a good amount I guess. But it's obvious there are some food rules she's still abiding by, especially with measurements and serving sizes. She's recently been doing \"Eating Like \\_\\_\\_ For a Day\" and it's ALWAYS a model or a super skinny celebrity (e.g. Bella/Gigi Hadid).\n\nI've just been skipping all her videos that I see. I just can't bear to unfollow her because she did help me early in recovery, but for the sake of my own self, I just can't watch her new TikToks unless they're like recipes or unrelated to food.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650051840.0, "datetime": "2022-04-15T19:44:00", "subreddit": "fuckeatingdisorders", "id": "i4vd7b6", "text": "The Misfits protein bars L O L", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650058177.0, "datetime": "2022-04-15T21:29:37", "subreddit": "fuckeatingdisorders", "id": "i4vrlge", "text": "\"if you warm it up, it tastes just like a candy bar!\" \n\nNo tf it does not LMFAO", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650327887.0, "datetime": "2022-04-19T00:24:47", "subreddit": "fuckeatingdisorders", "id": "i5a187g", "text": "I love it too, because no one else seems to get it (especially the people who are following them and commenting on their posts). It's like no one sees beyond their bullshit besides the people here in this sub", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650347315.0, "datetime": "2022-04-19T05:48:35", "subreddit": "fuckeatingdisorders", "id": "i5b4xst", "text": "I've definitely seen a couple worried comments, but they always get ruthlessly attacked either by OP or OP's fans :/", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650730383.0, "datetime": "2022-04-23T16:13:03", "subreddit": "fuckeatingdisorders", "id": "i5w4iqx", "text": "It's when they encourage you to think about whatever it is you want to eat. To me, if you want to eat it, you should eat it. You shouldn't have to sit for 5, 10, 15 seconds thinking about whether or not \"you can\" eat it only to ultimately feel guilt/shame so you end up not having it regardless of how much you actually crave it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650730539.0, "datetime": "2022-04-23T16:15:39", "subreddit": "fuckeatingdisorders", "id": "i5w4vc6", "text": "I sometimes stalk people and I recently saw a post/replies where they talked about their ED in the sub, but people were actually giving good advice about not restricting and to eat when they experience any hunger (mental or physical). \n\nI was surprised to see helpful comments, like you said, it seems much better than when I last frequented the sub.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650733438.0, "datetime": "2022-04-23T17:03:58", "subreddit": "fuckeatingdisorders", "id": "i5wbh9i", "text": "Exactly. And it's highly unlikely that the food will actually make them \"feel bad\" (GI/digestion issues). \n\nLike, those fries are not gonna make your stomach hurt lmfao. \n\nI'm sure in some cases, people aren't necessarily restricting, but do know certain foods end up causing issues for them. But, I think for a lot of them, the \"feeling good\" isn't tied to digestion, but rather a feeling of morality where not eating that piece of chocolate makes them feel good about their \"discipline\" or something.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650933169.0, "datetime": "2022-04-26T00:32:49", "subreddit": "fuckeatingdisorders", "id": "i67c5bs", "text": "STOP LMFAO I was looking for posts about her here, but only found some in ED anon. \n\nI used to love her, but she literally works out like every single day. Her videos are SO repetitive. She says she loves her body at every and any size, but is constantly trying to lose weight when she gains like what? 5 lbs? 10 lbs? \n\nThe format of her uploads are:\n\n1. I gained weight, but I'm okay with it.\n2. I lied, I'm sad because I gained weight.\n3. I lost weight! \n\nIt's so contradicting. She also frames it in a way that exercising and eating \"healthy\" makes her \"feel good.\" Why does it make you feel good, Linda? Is it because it causes you to lose weight and to lose \"fat?\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650933606.0, "datetime": "2022-04-26T00:40:06", "subreddit": "fuckeatingdisorders", "id": "i67d5op", "text": "Also, can we mention how they're always sponsored by big companies?\n\nLike Gymshark... Are you kidding lmfao? They literally recruit so many people recovering from EDs that still have a relatively poor relationship with food, but the sponsorship makes it seem like they're healthy and good role models for fitness. It's so sick.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650940375.0, "datetime": "2022-04-26T02:32:55", "subreddit": "fuckeatingdisorders", "id": "i67svcz", "text": "The posts were actually talking about how she's still disordered. I was surprised!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650987876.0, "datetime": "2022-04-26T15:44:36", "subreddit": "fuckeatingdisorders", "id": "i6a1x9s", "text": "LOL, just found the person. I think it's the right one, but won't say anything more.\n\nI never really watched her personally, because I did find her more triggering than Linda (back when I thought Linda was about body positivity). And, judging by her video titles... yikes. It is all about eating whatever and losing weight or eating whatever and STAYING SKINNY like lol ?? No one asked, but thanks lmfao", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651098595.0, "datetime": "2022-04-27T22:29:55", "subreddit": "fuckeatingdisorders", "id": "i6gl8pc", "text": "Me with Love Island because they're just living in bikinis the whole time lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651122127.0, "datetime": "2022-04-28T05:02:07", "subreddit": "fuckeatingdisorders", "id": "i6hyd40", "text": "\"how can you eat THAT much\" \"i'd feel so gross if i ate all of that omg\" \n\nlike, bro, fuck off", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1651632173.0, "datetime": "2022-05-04T02:42:53", "subreddit": "fuckeatingdisorders", "id": "uhwq4j", "text": "TW: Mentioning of numbers (dieting-related)\n\nIdk if anyone keeps up with this stuff. Personally, I love looking at the outfits and whatnot.\n\nAnyway, Kim wore Marilyn Monroe's \"Happy Birthday\" dress and was interviewed about it. Turns out she lost 16 lbs in 3 weeks to fit the dress. And she proudly said as if it's an accomplishment. I don't think the interviewer even asked about it, she just interjected with this bullshit. Like, I don't give a shit if you lose weight to fit a dress, that's your choice whatever. But to say it with such pride to the public?? That's fucked up.\n\nLili Reinhardt though called her out on it over her IG stories, thank God for her.", "title": "TW: Kim Kardashian at the Met", "context": null}
{"type": "comment", "timestamp": 1651640164.0, "datetime": "2022-05-04T04:56:04", "subreddit": "fuckeatingdisorders", "id": "i7986so", "text": "It makes me feel so bad for their children. Far from a healthy environment", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651663570.0, "datetime": "2022-05-04T11:26:10", "subreddit": "fuckeatingdisorders", "id": "i7a224n", "text": "And there's always that fucking question \"are you gonna eat?\" \n\nBut, Zendaya (the absolute angel) with her legendary \"Imma eat\" from a few years back", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651674018.0, "datetime": "2022-05-04T14:20:18", "subreddit": "fuckeatingdisorders", "id": "i7amvkv", "text": "I do feel the need to add that they were treated horribly in the media, so I understand the issues w/ fatphobia and dieting. \n\nLike all the bullshit Khloe went through and the relentless bullying of Kim during her pregnancy. \n\nStill, it sucks that they continue to promote this shit, but I still sympathize with the horrible treatment they've gotten.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651681796.0, "datetime": "2022-05-04T16:29:56", "subreddit": "fuckeatingdisorders", "id": "i7b5xro", "text": "I've been watching KUWTK and from the earlier seasons, I'm just stunned by how different yet SO beautiful they all looked. Especially Khloe and it hurts my heart knowing how the media has affected her so much.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651871484.0, "datetime": "2022-05-06T21:11:24", "subreddit": "fuckeatingdisorders", "id": "i7lo99c", "text": "Oh and if you don't happen to have a heating pad, besides the water bottle, you can also heat dry rice in the microwave and use a cloth bag or just a cloth and use a rubber band or hair tie to make it into a pad.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652566657.0, "datetime": "2022-05-14T22:17:37", "subreddit": "fuckeatingdisorders", "id": "i8ml0z9", "text": "This is so sweet, I'm glad you're getting recognition! Thanks for all the work and encouragement you do for us", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655255147.0, "datetime": "2022-06-15T01:05:47", "subreddit": "fuckeatingdisorders", "id": "icef0wt", "text": "That's what they're trying to do here...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659567012.0, "datetime": "2022-08-03T22:50:12", "subreddit": "fuckeatingdisorders", "id": "iiud8uv", "text": "Built bar and Misfits can kiss my ass. \n\nThe recovery influences are always like \"they taste JUST like a candy bar\" like no?? They may taste good but don't advertise them as an alternative to a candy bar. It's not the same and if someone wants a Snickers over a chalky protein bar, let them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659567158.0, "datetime": "2022-08-03T22:52:38", "subreddit": "fuckeatingdisorders", "id": "iiudkof", "text": "I was so close to buying them lmfaoo (Anna Archer influenced lmfao) but the shipping price saved me from that travesty cuz from non-sponsored ppl all I hear is that it's grossss", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659640507.0, "datetime": "2022-08-04T19:15:07", "subreddit": "fuckeatingdisorders", "id": "iiydzjw", "text": "Y'all make me feel so normal with these posts. This is how I feel every day since being in recovery since Dec/Jan", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659772687.0, "datetime": "2022-08-06T07:58:07", "subreddit": "AnorexiaNervosa", "id": "ij5ua4b", "text": "The pins and needles feeling. My feet, hands, legs, arms just got numb so easily. Had no idea it was related until I started eating more and the feeling/frequency went away", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1662595831.0, "datetime": "2022-09-08T00:10:31", "subreddit": "fuckeatingdisorders", "id": "inivdyq", "text": "Yeah she recently admitted that she had been losing too much weight and her mistakes when doing All-In. It was refreshing to see her acknowledge how she wasn't exactly recovered.\n\nStephanie was a good introduction to me for All-In but Tabitha Farrar (and this sub) is who really taught me what it means.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1662596073.0, "datetime": "2022-09-08T00:14:33", "subreddit": "fuckeatingdisorders", "id": "inivyah", "text": "I get what you mean. I didn't believe it too much at first when I saw people talking about it. But, I think a lot of us just aren't posting videos of us eating for our EH. We're recovering and eating for our EH can bring a lot of guilt/shame/embarrassment.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1667912931.0, "datetime": "2022-11-08T13:08:51", "subreddit": "fuckeatingdisorders", "id": "ivjjk5c", "text": "They're also sometimes so mean about it when other people bring it up... Like, I've seen some similar sentiments that you've written here made in ED anon and you'll get a plethora of people getting mad at them for sharing their feelings...\n\nI saw the other day that one person suggested people come here to this sub, but then another person replied saying how we're worse over here... I don't know, but this sub is the only thing that's keeping me sane and has actually helped in recovery.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669395978.0, "datetime": "2022-11-25T17:06:18", "subreddit": "fuckeatingdisorders", "id": "ixqyvde", "text": "I don't get it. Genuinely. They're always like \"we're not FATPHOBIC. we don't hate fat people. we just don't wanna be fat\" like babes, that's what internalized fatphobia is. You don't want to be fat. \n\nWe're not attacking you, we're just saying for those whose ED's stem in internalized fatphobia, accepting it and taking steps to unlearn it is helpful.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669745543.0, "datetime": "2022-11-29T18:12:23", "subreddit": "fuckeatingdisorders", "id": "iy96p2z", "text": "new mantra unlocked <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1672297212.0, "datetime": "2022-12-29T07:00:12", "subreddit": "fuckeatingdisorders", "id": "j22xzh9", "text": "this is a recovery-focused ED sub... idk why you're suggesting them to focus on that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1680594741.0, "datetime": "2023-04-04T07:52:21", "subreddit": "AnorexiaNervosa", "id": "jew5w7p", "text": "I actually hate Diet Coke, but I like Coke Zero only if it's cold because if it's room-temp it tastes off and artificial. But somehow when it's cold, it tastes pretty similar to regular Coke.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683302057.0, "datetime": "2023-05-05T15:54:17", "subreddit": "fuckeatingdisorders", "id": "jiz6c7p", "text": "I hate seeing those posts. It's ODD. I don't trust them because they say they have \"BED\" now but it's them just eating in recovery because they've been restricting, so it isn't actually \"BED.\" Still, they're using it and spreading it around which puts fears into people from entering recovery because now they're scared that they'll develop \"BED\" too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683302352.0, "datetime": "2023-05-05T15:59:12", "subreddit": "fuckeatingdisorders", "id": "jiz72vd", "text": "You nailed it with \"trend.\" People use the term \"BED\" rather lightly and loosely. I think it also detracts from actual people who do have BED when people who restrict encounter reactive eating and then label that as \"BED.\" \n\nBED is a mental disorder just like every other ED, you don't just \"develop\" it by eating more than usual, especially if it's recovery eating from a restrictive ED.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746015315.0, "datetime": "2025-04-30T12:15:15", "subreddit": "AnorexiaNervosa", "id": "mptsll9", "text": "I’ve recovered! Yeah I couldn’t believe no one really mentioned it, I guess people (me included at first) didn’t think it was related.\n\nHope you’re doing okay!", "parent_id": null, "link_id": null, "context": null}
