{"type": "comment", "timestamp": 1613591880.0, "datetime": "2021-02-17T19:58:00", "subreddit": "fuckeatingdisorders", "id": "gnsv129", "text": "F those kind of comments, it is flipping terrifying to recover and eat a proper meal. Please eat as much food as you won’t and don’t let that hinder you from recovering. Focus on the present, and I’m sorry that you’re going through that", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613719371.0, "datetime": "2021-02-19T07:22:51", "subreddit": "fuckeatingdisorders", "id": "gnzff82", "text": "It’s always scary in the beginning, but to overcome fear you have to face it. One step at a time, you can do it (:", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1614101329.0, "datetime": "2021-02-23T17:28:49", "subreddit": "fuckeatingdisorders", "id": "lqnw20", "text": "I ate strawberries, grapes, oranges etc when I was restricting and those were my “foods” I let myself have to not drop dead but today I can eat all of those because I genuinely enjoy them. They went from being my only “meal” to being a light snack and those things make me feel like I’m doing something right. Keep on fighting guys, you can do it.", "title": "Eating the foods that I used to eat only to restrict but now for enjoyment.", "context": null}
{"type": "comment", "timestamp": 1614150778.0, "datetime": "2021-02-24T07:12:58", "subreddit": "fuckeatingdisorders", "id": "gok5b9u", "text": "Thank you sm!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614150812.0, "datetime": "2021-02-24T07:13:32", "subreddit": "fuckeatingdisorders", "id": "gok5cml", "text": "Wooo hood job!! Love to see that ((:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614150840.0, "datetime": "2021-02-24T07:14:00", "subreddit": "fuckeatingdisorders", "id": "gok5du5", "text": "Thanks, and you too!! That’s amazing keep enjoying them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615812987.0, "datetime": "2021-03-15T12:56:27", "subreddit": "fuckeatingdisorders", "id": "gr0a6wi", "text": "Oh my, yes exactly. I mean I get that she’s skinny but she really felt like all those posts I used to romanticize pre recovery. Especially the scene where she got her shirt of it was so triggering.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615825379.0, "datetime": "2021-03-15T16:22:59", "subreddit": "fuckeatingdisorders", "id": "gr0z5n2", "text": "Oh didn’t know that, that’s sad still because it feels like it could almost send the wrong message unintentionally", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616025032.0, "datetime": "2021-03-17T23:50:32", "subreddit": "fuckeatingdisorders", "id": "graojnh", "text": "I’m not a crier, but this made me tear up. As a obsessive tumblr user during my eating disorders I always felt inferior to the rest of the people because I did more “normal” stuff. I convinced myself to have eg fear foods so I could be anorexic/bulimic enough. So thank you so much for painting the picture of how it is and was for many anorexic and anorexic recovering people.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616056773.0, "datetime": "2021-03-18T08:39:33", "subreddit": "fuckeatingdisorders", "id": "grc00e2", "text": "Exactly!!! Eating disorders “online” literally brainwashed everyone that didn’t have those specific restrictions that they’re weren’t anorexic enough so you almost had to “fake” a part of you to be enough. Even though social media still sucks it’s becoming more inclusive and I hope that one day people can stop looking at anorexia through one fkn perspective", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1618037463.0, "datetime": "2021-04-10T06:51:03", "subreddit": "fuckeatingdisorders", "id": "mnzt0n", "text": "I thought i was doing so well in recovery, I eat to nourish & fuel my body, eat because food actually tastes good and I eat whatever I crave. Basically in my mind I had beaten my ED’s, but something I noticed was eg I wore some new pants today and they were loose on the back part and I was like “ooh I’m still in shape”. I hate hate hate thinking that being one size is better than being another size. I don’t know what I’m asking for but I’m wondering if someone has struggled with the same issues during/after recovery? Someone that relates or have gone past that..", "title": "How do you get rid of the mentality that “skinny looks best”", "context": null}
{"type": "comment", "timestamp": 1618044726.0, "datetime": "2021-04-10T08:52:06", "subreddit": "fuckeatingdisorders", "id": "gu0y1nv", "text": "Eughh it’s so messed up, the mental part is probably the hardest part... I hope we can one day stop thinking like that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618044811.0, "datetime": "2021-04-10T08:53:31", "subreddit": "fuckeatingdisorders", "id": "gu0y4pz", "text": "Thank you so much for the tips and everything. You’re definitely right about thin equaling good is just a stupid beauty standard that switches up every century. I’m definitely going to check out some books, again thank you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618076957.0, "datetime": "2021-04-10T17:49:17", "subreddit": "fuckeatingdisorders", "id": "gu2bof3", "text": "That makes sense, I guess it takes time to unlearn the ideals that have been imprinted in mine (our?) head. Thank you for that tip, I appreciate it (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618077116.0, "datetime": "2021-04-10T17:51:56", "subreddit": "fuckeatingdisorders", "id": "gu2c01o", "text": "Woa, thats a good way to remind yourself no matter body you take you with you. With age do you mean the older you get or with time it gets better? Definitely agree with scales, I still live at home and unfortunately my family has a scale (I avoid it though). Maybe should throw away the batteries heh. Thank you so so much for taking the time to respond and giving these tips (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618077280.0, "datetime": "2021-04-10T17:54:40", "subreddit": "fuckeatingdisorders", "id": "gu2cbz3", "text": "Ahhh definitely. You’re definitely right, I need to take time to appreciate for how they look especially when they have another body type. This definitely helped a lot, super grateful for this thank you so much!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618077398.0, "datetime": "2021-04-10T17:56:38", "subreddit": "fuckeatingdisorders", "id": "gu2ckd4", "text": "Never thought about having “using” a radical acceptance “method”. Thank you for responding and giving me super helpful advice. Definitely going to try to implant this type of thinking (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618077477.0, "datetime": "2021-04-10T17:57:57", "subreddit": "fuckeatingdisorders", "id": "gu2cpzp", "text": "I’m glad that it helped you, and true. I have so many different people around me both friends and family with wide ranges of body types. I think I need to do what you said and actively think like you said. Thanks for the tips!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618170857.0, "datetime": "2021-04-11T19:54:17", "subreddit": "fuckeatingdisorders", "id": "gu6g14e", "text": "Thank you for this, seems to be very important to reminds yourself of that (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618171402.0, "datetime": "2021-04-11T20:03:22", "subreddit": "fuckeatingdisorders", "id": "gu6h3vm", "text": "Hello, I don’t even think you know how much this helped me for real. I love psychology and understanding the brain as well, so thank you so much for taking your time to explain the “linking”.  I didn’t think it was easy to unlearn this behavior, but definitely not this hard but the explanation behind how this happened makes it easier to understand. Anyways thank you for all the tips, I’m literally screenshoting this so I can actively remember it hehe. Thank you for the help and for taking your time to write this (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618171820.0, "datetime": "2021-04-11T20:10:20", "subreddit": "fuckeatingdisorders", "id": "gu6hy8d", "text": "This was beautifully written... I just wanted to add I’m so happy that you’ve come to the realization you’ve have now. It took some time but I guess better later than never. I don’t know if you’re fully recovered now but I really hope you are but I guess looking back at a younger pic of you with positive affirmations is a good sign (: thank you again for writing!", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1618172566.0, "datetime": "2021-04-11T20:22:46", "subreddit": "bulimia", "id": "moyjzd", "text": "I a 100% believe that this is supposed to be a safe space where you can say what you think unfiltered. When having an eating disorder it’s so isolating that a online group might be the only comforting thing but...\n\n\nI’ve noticed that some post almost seem pro-bulimic, not in the obvious ways but in those slight ways of almost “encouraging” or triggering people. I just wanted to say to people that are actively recovering or just in general to people:\n\nDon’t read all the posts if you can’t handle it. There’s a lot of triggering stuff and some people can handle it some can’t. Some people mention trigger words, or something that can make you relapse (if you’re recovering) or install that “competition” mentally. Please take care of yourself and remove yourself if you’re not strong enough. For your own sake. \n\nI just want us to take care of each other. There’s no one who’s going to understand the pain we have gone through and go through everyday than these people right here. Stay safe friends. I love you all individually.", "title": "I mean this in the kindest way.. but this group can be very regressive regarding recovery.", "context": null}
{"type": "comment", "timestamp": 1618215387.0, "datetime": "2021-04-12T08:16:27", "subreddit": "bulimia", "id": "gu8fgs8", "text": "Yeah exactly, I don’t want to say to people they can express themselves because obviously this is the only way they can do it without judgment. But I don’t recommend this for people who are easily triggered. I hope you can feel comfortable and not triggered while in this sub (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618215476.0, "datetime": "2021-04-12T08:17:56", "subreddit": "bulimia", "id": "gu8fjt9", "text": "Of course, it’s so lonely when having an eating disorder so I’m definitely with you there. I hope you get better soon and my dms are always open!! So please if you ever feel lonely or need encouragement/support don’t hesitate to write to me. All luck to you love 🧡", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618215685.0, "datetime": "2021-04-12T08:21:25", "subreddit": "bulimia", "id": "gu8fqz2", "text": "Definitely agree with everything you said, I agree with a separate r/ but I think it’s easier for people to come over here since they can guarantee a response. I love to see when people vent and get support but as you said some comments can unintentionally support that behaviour. I definitely think people are here only for help and to relate to others i just want people to make sure they’re not destroying themselves or others because they’re not well enough to handle it. I’ve seen so much love, support, encouragement towards me and others on this sub but I know like just every other community it can be accidentally triggering. Still love this group and think it’s amazing for people struggling or going through recovery (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618218819.0, "datetime": "2021-04-12T09:13:39", "subreddit": "bulimia", "id": "gu8irjn", "text": "I just want to start of by saying that don’t feel like you can’t express yourself because I said all that. I think the line between encouraging someone and thinking that you’re helping/relating to someone can be thin.\n\nmentioning binging and purging in example!!!!\nCouldn’t find many examples but one person was talking about how they had binged and physically couldn’t purge it. One person in the comment mentioned they didn’t want to encourage it but recommended a drink that would help them throw up. \n\nI completely understand that the OP felt terrible and the comment wanted to help them to feel better but I feel like some stuff can come of as triggering to someone stumbling across it or the OP(s). I think that you can relate to whoever you want, express however you want but not to forget that telling someone “same” versus saying “I did this to make myself throw up” is two different things. I really wish you all luck and I think try to do everything with right intentions and it will go well. I hope this doesn’t make you feel like you have to censor yourself though (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618218916.0, "datetime": "2021-04-12T09:15:16", "subreddit": "bulimia", "id": "gu8iuym", "text": "Ahh I think that’s the reason why so many people go over here because it’s extremely active and it just becomes a mess sometimes. r/fuckeatingdisorders is where I usually go. But that’s not for a specific disorder like bulimia but for everyone which also can get messy..", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618219006.0, "datetime": "2021-04-12T09:16:46", "subreddit": "bulimia", "id": "gu8iy36", "text": "Of course, it’s important to make clear that we all are in this together but not to drive each other further into the eating disorder. (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618219183.0, "datetime": "2021-04-12T09:19:43", "subreddit": "bulimia", "id": "gu8j469", "text": "I’m sorry for that... I’m barley active in this group because I’ve been trying to recover for the past year and sometimes this literally makes me feel like relapsing. I encourage you to maybe post if you feel like you need positive support but not to read though some posts because as you said it’s not as positive as it looks like. r/fuckeatingdisorders might be less triggering but I’m not sure. if you feel like you need someone to talk to completely anonymously my dms are always open (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618219424.0, "datetime": "2021-04-12T09:23:44", "subreddit": "bulimia", "id": "gu8jcyy", "text": "I’m so happy that you feel like you’re understood over here. There’s this saying, which can be very harsh, but “people are not responsible for your triggers” so do post whatever you feel like you need to vent about. Though make sure you’re not encouraging people, people have different triggers, some can’t look at some words, some bodies etc so it can be hard balancing that. I feel like it’s important to make sure people in this community \n1) don’t encourage the behaviour\n2) make sure they’re not *intentionally* triggering someone. In the end of the day you cannot control how other people are going to feel when you express your own feelings.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618219799.0, "datetime": "2021-04-12T09:29:59", "subreddit": "fuckeatingdisorders", "id": "gu8jpsa", "text": "You’re right, I don’t think there’s a lot of things to do about this but to challenge the thoughts, like you said. Thank your for saying that, especially the part about guilt (since it’s the constant recurring emotion for me). Thanks for taking the time to write this and help me, I really appreciate it!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618222539.0, "datetime": "2021-04-12T10:15:39", "subreddit": "bulimia", "id": "gu8mg9n", "text": " 🧡🧡", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618297816.0, "datetime": "2021-04-13T07:10:16", "subreddit": "bulimia", "id": "guchs5f", "text": "I appreciate you saying that, thank you (: Recovery sometimes is/feels like the hardest part of the whole disorder “process”. It takes a lot of strength to try to recover again and again, so it says a lot about you my friend. Thank you, hopefully we can and will one day come to the point of full recovery <3", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1618344841.0, "datetime": "2021-04-13T20:14:01", "subreddit": "fuckeatingdisorders", "id": "mqajzy", "text": "Every recovery I went through, I failed. Most of the times because I felt like without my eating disorder I lost a part of myself. The ED was so ingrained in me, I didn’t know who I was without it, or that’s what I thought. You are so much more than that thought that tells you “don’t eat that” or “get rid of the meal you had” or the “just run one more lap and you’ll deserve what you eat”. Those thoughts might have occupied your brain for so long that you might think you’ve lost yourself but you haven’t. Recovery or not, remember you’re still you. You deserve to eat. You deserve happiness. You deserve love. You deserve to be loved by yourself. \n\nEvery person on here is unbelievably strong, and I love all of you guys.", "title": "You are not your eating disorder. You are not “no one” without your eating disorder.", "context": null}
{"type": "comment", "timestamp": 1618346446.0, "datetime": "2021-04-13T20:40:46", "subreddit": "fuckeatingdisorders", "id": "guevatt", "text": "Thanks and of course my friend. <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618362473.0, "datetime": "2021-04-14T01:07:53", "subreddit": "fuckeatingdisorders", "id": "gufr0ca", "text": "I think every recovered person has been exactly where you are now, thinking it’s impossible to both recover and have a normal relationship with food but it’s not. It is possible. I’m sorry that you feel discouraged but just that you want to be healthy will take you so much further. I promise you, you can be more than you’re ed, you already are. I hope you find yourself in recovery soon and having a normal relationship with food. I’m rooting for you, and many are too 🧡", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618385353.0, "datetime": "2021-04-14T07:29:13", "subreddit": "fuckeatingdisorders", "id": "gugppkh", "text": "I hope she comes to that conclusion soon, it takes time but it’s never impossible.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618776574.0, "datetime": "2021-04-18T20:09:34", "subreddit": "bulimia", "id": "gv05huy", "text": "Sorry for very late response :\n\nDefinitely don’t think that it is (most) peoples intention when entering this group. I don’t think anyone, except a evil person, would want someone to continue to suffer a awful disease like bulimia, but as someone who’s been through recovery it’s obvious that the ED doesn’t make you think the most logical. Doesn’t mean it’s right to promote bulimia ofc. I understand that this group is a bit confused (the two points/two types of people who’ve joined the community).\n\nI think it’s pretty clear that no one should encourage an eating disorder. There’s a clear difference between venting and encouraging an eating disorder. I myself this week removed myself from this group because it actually made me feel like I wanted to become bulimic again. Doesn’t mean it’s their fault, people have to be able to learn their triggers. I usually recommend venting but not reading through posts if you know you cannot handle it.\n\nps. no need to argue about promia or ana websites but the description of this group is literally “pro recovery” which means no pro bulimia or pro anorexia or pro anything. In the end of the day, my post was made for people who don’t want to become triggered because this isn’t the best place for recovery in general. Thanks for responding to my post! (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619897309.0, "datetime": "2021-05-01T19:28:29", "subreddit": "fuckeatingdisorders", "id": "gwkqykr", "text": "You go friend! Recovery is really worth it, makes you appreciated the smallest (and the painful) things (:", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1620341538.0, "datetime": "2021-05-06T22:52:18", "subreddit": "fuckeatingdisorders", "id": "n6k2dc", "text": "365 days of recovery. One year of trying to recovery and successfully doing it. I never thought I would be able to talk about my eating disorder(s) in past tense but I do now. My love for all kinds of food has strengthen and my mental health has been so good.\n\nRecovery feels amazing and it is very possible. Eating disorders are rough and exhausting so is recovery but that is worth it. Finally I consider myself happy and still in recovery but semi-recovered.\n\nWishing you all well", "title": "Today is my 1 year recovery", "context": null}
{"type": "comment", "timestamp": 1620368845.0, "datetime": "2021-05-07T06:27:25", "subreddit": "fuckeatingdisorders", "id": "gx8um7d", "text": "Thank you so much!! And keep on fighting, it’s a constant battle but it’s really a battle worth it when you do win it! \n\nWishing you all that back (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620368889.0, "datetime": "2021-05-07T06:28:09", "subreddit": "fuckeatingdisorders", "id": "gx8uo2z", "text": "Thank you so much, and congrats to you too. Takes will power to continue!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620369512.0, "datetime": "2021-05-07T06:38:32", "subreddit": "fuckeatingdisorders", "id": "gx8vf6n", "text": "I definitely share how it was, obviously is my personal experience so it might not be the exact same!\n\nThe first months were terrible to be honest, as you said, I was bloated too and had the constant fear that I would just gain a pound or two. Since I had slipped into two different disorders at different points of time it was a bit of a struggle not restricting or not to overindulge. I felt like was thinking even more about what to eat or not, how I looked etc aka more fixated on everything. I just tried to tell myself “I don’t want to become the statistic of those who don’t make it” and just fought the urge. (Fighting the urge is hard, don’t get discouraged if you do relapse, just continue trying to recover despite the setbacks).\n\nAs the months went by and I just tried to recover (I can’t remember at which month) I suddenly didn’t wake up every morning thinking about what foods. For me, I was constantly thinking about food (in a negative way) sometimes even dream about it, but after a while it kind of faded. I think I might have had an easier recovery than some, so I’m only speaking for myself, but I felt myself going back to the old me. The child me who could eat whatever she wanted without thinking about the content or what I should do before or after consuming it.\n\nAbout the weight, that probably took me the longest time to come with terms with. When I got to my set point or what was “average” for my height, I honestly felt more beautiful at that then when I felt approved by my eating disorder. Not that you should base your value on what other say, but people who didn’t know I was in recovery told me I looked healthy, that I looked well and happy. Just by taking care of myself and trying to love myself more and more everyday the better it  got.\n\nTry to love yourself despite how you look, feel or do. Also if there’s anything you would like to know more about, just DM me (:\n\nYou’re so strong, just trying to recover is probably the most difficulty part of having an eating disorder!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620396990.0, "datetime": "2021-05-07T14:16:30", "subreddit": "fuckeatingdisorders", "id": "gx9xtom", "text": "Of course love, it’s not easy and it can be really discouraging to recover. It’s always worth it to keep on going because it’s really rewarding in the end.\n\nYou’re doing so well, 2 months can really feel like long in recovery, keep fighting and good luck!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620429498.0, "datetime": "2021-05-07T23:18:18", "subreddit": "fuckeatingdisorders", "id": "gxbx0sg", "text": "Win the battle friend! You can do it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1632578574.0, "datetime": "2021-09-25T14:02:54", "subreddit": "fuckeatingdisorders", "id": "he80wm5", "text": "Grapes should be fine lmao, not for diabetics tho.. spikes their sugar levels way too much.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1632590866.0, "datetime": "2021-09-25T17:27:46", "subreddit": "fuckeatingdisorders", "id": "he8s4mk", "text": "Oh really? My sister and mom are type one diabetic and it doesn’t work for them. But if they do work for you, I love that!(:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1633959903.0, "datetime": "2021-10-11T13:45:03", "subreddit": "fuckeatingdisorders", "id": "hg87d5w", "text": "I love you for this.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1638363731.0, "datetime": "2021-12-01T13:02:11", "subreddit": "fuckeatingdisorders", "id": "r6e9bn", "text": "Recovery is the best decision I’ve ever done and will ever do. Though it’s FAAR from the easiest decision I’ve done, it feels great to be able to eat whatever the heck I want on my birthday.", "title": "Today is my birthday and I’ll eat whatever I want :p", "context": null}
{"type": "comment", "timestamp": 1638364291.0, "datetime": "2021-12-01T13:11:31", "subreddit": "fuckeatingdisorders", "id": "hmsimgs", "text": "Thank you so much! It really is huh hahah, thank you! (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638373847.0, "datetime": "2021-12-01T15:50:47", "subreddit": "fuckeatingdisorders", "id": "hmt35k2", "text": "Thank you sooo much! I love that, I am a pirate!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638381444.0, "datetime": "2021-12-01T17:57:24", "subreddit": "fuckeatingdisorders", "id": "hmtmdob", "text": "THANK YOU!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638381473.0, "datetime": "2021-12-01T17:57:53", "subreddit": "fuckeatingdisorders", "id": "hmtmgbg", "text": "I love that, I hope you have a great birthday and recovery. Thank you!(:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638394210.0, "datetime": "2021-12-01T21:30:10", "subreddit": "fuckeatingdisorders", "id": "hmujv5j", "text": "Eyooo, happy birthday twin! Thank you! I hope you enjoy your birthday <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638394231.0, "datetime": "2021-12-01T21:30:31", "subreddit": "fuckeatingdisorders", "id": "hmujx77", "text": "So sweet of you to say, thank you so much!!!🧡", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638401160.0, "datetime": "2021-12-01T23:26:00", "subreddit": "fuckeatingdisorders", "id": "hmv0yrf", "text": "Thank you, and I will!! ☺️🧡", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638401598.0, "datetime": "2021-12-01T23:33:18", "subreddit": "fuckeatingdisorders", "id": "hmv1w7w", "text": "It’s the end of the day for me now so I’m updating you hahah! I don’t really like celebrate my birthday (it’s not a big thing with my family so it wasn’t really “special”) but I had a big breakfast in bed. Fruits, oatmeal, sandwich - the food ol’ breakfast foods. \n\nI honestly ate only desserts the first half of my day hahahah. I had these yummy Swedish chocolate balls (kokosbollar) and had these delicious chocolate wafers that are heavenly. Might be too much to write on here but I had a fun day. Played some games with my family and watched some documentaries. Ended sweet. Thanks for asking and caring 😆<3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638426160.0, "datetime": "2021-12-02T06:22:40", "subreddit": "fuckeatingdisorders", "id": "hmwhmx9", "text": "Honestly breakfast in bed is game changer! Well then I hope you enjoy your birthday (and the food of course) when it comes around. I definitely did (:", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638444339.0, "datetime": "2021-12-02T11:25:39", "subreddit": "fuckeatingdisorders", "id": "hmx4i16", "text": "Thanks! But what do you mean by “easy way out and another bad decision”?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639043086.0, "datetime": "2021-12-09T09:44:46", "subreddit": "fuckeatingdisorders", "id": "hnu2796", "text": "YOU GO GIRL/BOY/PERSON!!! I love this post more than I can express.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639671728.0, "datetime": "2021-12-16T16:22:08", "subreddit": "fuckeatingdisorders", "id": "hoso7h9", "text": "Thank you for this!!! I feel like we need a daily reminder on this sub 🙄", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639682091.0, "datetime": "2021-12-16T19:14:51", "subreddit": "fuckeatingdisorders", "id": "hotey9y", "text": "Yeah I feel yah, I love this sub but it happens accidentally now and then. I also made a similar post a couple months ago about people being borderline pro-ED.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641817767.0, "datetime": "2022-01-10T12:29:27", "subreddit": "fuckeatingdisorders", "id": "hs1zesw", "text": "There’s also people with non restrictive eating disorders. When I was in the beginning of my recovery from bul*mi* and I heard that line it was awful. Eating doesn’t equal healthy. \n\nThey probably have the right intention but eating disorders are incredibly individual. So not everything will work for everyone.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645526004.0, "datetime": "2022-02-22T10:33:24", "subreddit": "fuckeatingdisorders", "id": "hxy6miw", "text": "That’s when I stopped caring about eating disorder “influencers”. Used to follow a bunch of them but last year I said F it and if I need help/advice, I go to reddit or other places but them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650013632.0, "datetime": "2022-04-15T09:07:12", "subreddit": "fuckeatingdisorders", "id": "i4t7u0o", "text": "You’ll die if you don’t recover. Not the peaceful dying in your sleep type of death. Type of death that would make you wish you recovered before this moment.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653144940.0, "datetime": "2022-05-21T14:55:40", "subreddit": "fuckeatingdisorders", "id": "i9gf2m7", "text": "I don’t know if it’s a “radar” but I can easily spot people who have it or have it without knowing because their eating (or just in general) habits look like my old habits or my other disordered friends habits.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655285987.0, "datetime": "2022-06-15T09:39:47", "subreddit": "fuckeatingdisorders", "id": "icfpp1o", "text": "Yup I literally wrote [this ](https://www.reddit.com/r/bulimia/comments/moyjzd/i_mean_this_in_the_kindest_way_but_this_group_can/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) when I noticed how toxic that space was. I personally felt like a lot of people of there were going backwards in their eating disorder which made me sad. I used to be on Tumblr too being a sick person but I was a bit shook. Tried to say it in a kind way as I understand a lot of people are sick and not mentally capable to see what they do wrong.", "parent_id": null, "link_id": null, "context": null}
