{"type": "comment", "timestamp": 1607601677.0, "datetime": "2020-12-10T12:01:17", "subreddit": "AnorexiaNervosa", "id": "gf9pvbx", "text": "Not many talk about how painful this disease is. I can't even sit on a wooden chair for a long time without bruising my tuches. Stairs hurt, walking hurts, running is hell. I can get exhausted from going to the grocery store two minutes away.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609010415.0, "datetime": "2020-12-26T19:20:15", "subreddit": "AnorexiaNervosa", "id": "gh3fx7f", "text": "All very, very good reasons:)\n\n-Memory! I used to have good long- and short term memory. Now I can’t remember if I even locked my front door or what my friend told me thirty seconds ago.\n\n-Cognition! The brain fog makes me miserable and renders me unable to function in my job.\n\n-Mood and humour! When did I lose my jibe? When did I start existing like a ghoul sent to plague my surroundings like a dark cloud?\n\n-Peace of mind! I’m so jittery and anxious every waking hour, and even when I am able to fall asleep, which is rare, I sleepwalk, and it’s getting dangerous. One morning I had unlocked my front door (fortunately not the security chain). This may not be eating disorder specific, but it’s probably connected to my being angst ridden and miserable.\n\n-For my family! My GP told me the straight facts, and my parents, however much they fucked me up should not have to bury me, nor should my niece and nephew have to know that their aunt died because she didn’t eat.\n\n-I actually know how to cook. So having friends over and making dinner for them without spending the day in complete panic would be nice.\n\n-TMI: actually getting a libido back.\n\n-Also not spending every day in physical pain would be nice.\n\nYou can do it, OP! I believe in you and am rooting for you. Happy holidays:)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609373433.0, "datetime": "2020-12-31T00:10:33", "subreddit": "AnorexiaNervosa", "id": "ghjxx2c", "text": "That’s a place of peace, isn’t it? I’m not doing super well, but am physically fine after months of work, but I remember how good it was to look at an image of an emaciated person and not thinking about how I could make myself further deteriorate. That’s important progress, OP.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609722394.0, "datetime": "2021-01-04T01:06:34", "subreddit": "AnorexiaNervosa", "id": "gi0nn2u", "text": "That's a tough spot, OP. I believe and pray you'll ride it out. \n\nIt took some effort I didn't really have the energy for, but for my psychology finding something I could engage with has helped. For me that was one thing, for others it will be other things. It can really be anything, just something to draw you out and help you find value in living, despite. As simple or complicated as you like. Could be as simple watching birds, or as complex as playing chess. Whatever keeps you engaged and not isolated with depression.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609748378.0, "datetime": "2021-01-04T08:19:38", "subreddit": "AnorexiaNervosa", "id": "gi1tg6d", "text": "Is that a common occurence for you, or is it new? Maybe it’s time to talk to your GP about the severity of your depression. I know you’re tired, but you don’t always have to feel this way and be this low. Are you able to consume something so complete depletion isn’t aggravating your already fragile state?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609753480.0, "datetime": "2021-01-04T09:44:40", "subreddit": "AnorexiaNervosa", "id": "gi1ygl3", "text": "Jesus you scare the shit out of me. The 'point' of eating something is that restricting fucks up your mood and your outlook as well as your body. Though depression is its own animal, not eating will not help. You should call your physician today, right now. I know you say you're ready for it to end, but then you post here, and I have no choice but to urge you to lift up the phone and ask a professional how to make you more comfortable. Commit to doing today, please commit to asking for help.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609976677.0, "datetime": "2021-01-06T23:44:37", "subreddit": "AnorexiaNervosa", "id": "gid2oye", "text": "That is GLORIOUS! Very, very well done, OP:) Yes, we tally all victories, c’mon.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611499439.0, "datetime": "2021-01-24T14:43:59", "subreddit": "AnorexiaNervosa", "id": "gkkrm9d", "text": "Everyone is getting them. Fasting is like the coolaid du jour. Too many people are already fucked, and now there's this appetite in culture to fuck even more people over.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611537133.0, "datetime": "2021-01-25T01:12:13", "subreddit": "AnorexiaNervosa", "id": "gknp3sk", "text": "How about you go buy some food after this session?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611680536.0, "datetime": "2021-01-26T17:02:16", "subreddit": "AnorexiaNervosa", "id": "gkub2og", "text": "My sincere condolences.\n\nAnd also my warmest congratulations. Godspeed, sending peace and love in return!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1612257484.0, "datetime": "2021-02-02T09:18:04", "subreddit": "AnorexiaNervosa", "id": "glpn7p7", "text": "I totally agree it's fascinating. Equally comforting and sad.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1612909528.0, "datetime": "2021-02-09T22:25:28", "subreddit": "AnorexiaNervosa", "id": "gmr11v0", "text": "Fantastic! I hope you enjoyed it, it looks delicious!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614334943.0, "datetime": "2021-02-26T10:22:23", "subreddit": "AnorexiaNervosa", "id": "gotd1lp", "text": "That's amazing work, I'm so happy to see this! I'm a cheerleader without a team right now, and I've got my eyes on ya, OP!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616746697.0, "datetime": "2021-03-26T08:18:17", "subreddit": "AnorexiaNervosa", "id": "gs9qe5x", "text": "Aw yiss! Congratulations! All love and support back atcha!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618839125.0, "datetime": "2021-04-19T13:32:05", "subreddit": "AnorexiaNervosa", "id": "gv2v77c", "text": "Happy, happy birthday, sweetheart! Enjoy your day to the max!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619299284.0, "datetime": "2021-04-24T21:21:24", "subreddit": "AnorexiaNervosa", "id": "gvr1w62", "text": "I try and err until I find the general silouette that leaves me feeling protected and not exposed (this changes), and I bring out all the bottoms and tops that fit that description for heavy rotation. I prepare the next day’s outfit the night before, put it in the bathroom. Then I scurry into the shower and slither into the outfit quickly. I rotate between outfit with the same safe silouette until my perception of my body invariably changes and I need a new getup. It really helps me to limit my choices and to only have clothes I’m comfortable in in rotation.\n\nThat’s my tip, so now over to sharing some truth: you are not disgusting, OP, and it kills me that you speak that way about yourself.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619308925.0, "datetime": "2021-04-25T00:02:05", "subreddit": "AnorexiaNervosa", "id": "gvrk1lh", "text": "Hehe, well for me that’s a question of where personal taste and work dresscode intersects. My silouette du jour is wide jeans and wide shirts, I kinda look like a banner. I don’t wear tight fitting clothes ever. I have to look semi presentable for work (rarely full business formal fortunately), but I can get away with jeans and a fine knit wool sweater or button downs most days. This winter I wore two pairs of presentable wool trousers that both fit well enough with a belt that I didn’t look too crazy, with very large and long (but nice quality) wool sweaters. It suggests the general idea of a professional-ish person, but renders it impossible to gauge the shape of my body. For spring I’m in dark wash, wide jeans and big button downs. I find for work the trick to mitigate this hobo look is materials, cuts, shoes and coats as well as being groomed. I wear a-line or men’s section coats without belts at the waist. For summer it’s basically the same, only swap jeans for linen suit pants or similar. Colour is also important for looking put-together (and invisible), I have a lot of black and dark blues for bottoms and sweaters because it’s so easy to combine. Trousers that fit me at the waist are usually too tight for my taste over hips, buttocks and legs, so I size way up and alter them at the waist. Probably wouldn’t if I had to pay for the alteration, but I’ve learned how to do it myself. \n\nIf I’m not working it’s very baggy, but nice clothes that I like. I’m currently not in any zoom meetings (halleluja), and the past two weeks I’ve been in just huge, nice heavy cotton t shirts that go beneath the buttocks and beneath the elbow and levi’s high ribcage wide in the indigo wash. I look like a cartoon, but I actually like it very much. And a hooded, thin parka. I prefer clothing that’s not cinched waists and such, I’m sure that helps me. (I realize now I don’t sound terribly chic.)\n\nThe safe hoodie is a hero! My favourite one went out of production, but I wore my last one until the sun and the salt from my persoiration had mostly bleached it from navy to a weird beige:) RIP hoodie (2014-2020)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619377436.0, "datetime": "2021-04-25T19:03:56", "subreddit": "AnorexiaNervosa", "id": "gvui8ms", "text": "An honour to be of service;)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620930113.0, "datetime": "2021-05-13T18:21:53", "subreddit": "AnorexiaNervosa", "id": "gy09j3q", "text": "There is so much to get excited for! I'm rooting for you with all I've got! I don't know you, but it makes me genuinely happy to see that you've had this shift in mindset. It's important, and it's big, and I believe in you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625530508.0, "datetime": "2021-07-06T00:15:08", "subreddit": "AnorexiaNervosa", "id": "h46mktd", "text": "Sleep well, sweetheart!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636141428.0, "datetime": "2021-11-05T19:43:48", "subreddit": "AnorexiaNervosa", "id": "hjgg6w8", "text": "Fuck yeah, OP! Great job, and I hope that donut stepped up to the occasion and tasted its very best. Proud of you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637417712.0, "datetime": "2021-11-20T14:15:12", "subreddit": "AnorexiaNervosa", "id": "hldxjs1", "text": "I once had the waiter decline my payment at and Indian restaurant. I had a vegetable side dish only, so I guess they assumed I was broke? «You are thin. We will cook». A very sweet and kind gesture, and yes, I was underweight and I am poor (relative to the country I live in), but it made me feel so ashamed at myself.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655539492.0, "datetime": "2022-06-18T08:04:52", "subreddit": "AnorexiaNervosa", "id": "ict7pdy", "text": "Hey I'm always up for a cute cat. Hope she recovers well!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665943860.0, "datetime": "2022-10-16T18:11:00", "subreddit": "AnorexiaNervosa", "id": "isklpap", "text": "Ooh! Congratulations! Many wishes for a thriving, supportive and fun engagement and marriage!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669469076.0, "datetime": "2022-11-26T13:24:36", "subreddit": "AnorexiaNervosa", "id": "ixugmxy", "text": "Fantastic work. I’m proud of you for breaking through. That sandwich looks smackin’", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1673954358.0, "datetime": "2023-01-17T11:19:18", "subreddit": "fuckeatingdisorders", "id": "j4pmq3c", "text": "Aww YISS, OP! That's amazing! Proud of ya.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1674414091.0, "datetime": "2023-01-22T19:01:31", "subreddit": "AnorexiaNervosa", "id": "j5fxt94", "text": "Have snacks you know she eats, and then just what you normally have at home. It’s very kind of you to want to accomodate your friend! Like the other commenter says, eat normally as you would if she wasn’t visiting. For me at least, being around people with healthy relationships with food helps me eat better. I wouldn’t comment on her rituals. It can be triggering to be “confronted”. Also don’t praise her if she chooses to eat and don’t remark on her portion sizes etc. I hope you have a great time together!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1674414378.0, "datetime": "2023-01-22T19:06:18", "subreddit": "AnorexiaNervosa", "id": "j5fyk5p", "text": "That’s very sweet of you! It’s a nasty illness, but I still have a good life, much due to my wonderful friends. You seem like a great friend and person.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1678254187.0, "datetime": "2023-03-08T05:43:07", "subreddit": "AnorexiaNervosa", "id": "jbdchut", "text": "Addiction IS an illness. \n\nMy shrink works with people with ptsd and c-ptsd. She has a lot of experience with folks with addiction. Though it’s not a complete overlap in my case, we treat the anorexia behaviours like addiction. It gives me actionable steps to do harm reduction and give me some control back and steer me over to less harmful coping skills.\n\nI’m sorry you’re having a rough time. What you’re dealing with sounds like a handful.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683171272.0, "datetime": "2023-05-04T03:34:32", "subreddit": "AnorexiaNervosa", "id": "jise714", "text": "That is beautiful! Not because of the hair, though your hair is beautiful, but because you healed.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683975502.0, "datetime": "2023-05-13T10:58:22", "subreddit": "AnorexiaNervosa", "id": "jjzhdi6", "text": "I LOVE this for you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1685704090.0, "datetime": "2023-06-02T11:08:10", "subreddit": "AnorexiaNervosa", "id": "jmlk347", "text": "That’s not a small win, that’s a huge win! Well done!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1696211564.0, "datetime": "2023-10-02T01:52:44", "subreddit": "AnorexiaNervosa", "id": "k332lly", "text": "K, I’ll just kick it then, thanks, mom!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1704619741.0, "datetime": "2024-01-07T09:29:01", "subreddit": "AnorexiaNervosa", "id": "kgpm36o", "text": "That’s amazing! I’m so happy for you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1706021944.0, "datetime": "2024-01-23T14:59:04", "subreddit": "AnorexiaNervosa", "id": "kj79izd", "text": "Ouch:(\n\nI don’t know the laws in Australia, so I don’t know anywhere to direct you. But if she is indeed in a mental- and physical health crisis, in many places there are systems put in place to prevent ill people from dying. If a neighbour was having a psychotic break, I wouldn’t hesitate to call an ambulance, you know?\n\nI agree that deterioration is very «easy» if you have no social support system or people who observe you closely. It’s sad, but true. When I moved overseas, I rapidly became worse because nobody knew me and my close ones couldn’t see me. The pharmacy lady where I bought nutridrinks took me by the arm one day and walked me over to the entrance, pointed at a pizzeria across the street and said «they have really good slices». I still think about that lady.\n\nWhatever you decide on doing, it’s touching to see yours and your roomie’s care and concern for this lady. I hope she pulls through and that you aren’t negatively affected by this sad story.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1712321383.0, "datetime": "2024-04-05T12:49:43", "subreddit": "AnorexiaNervosa", "id": "ky5w9jt", "text": "Congratulations, gorgeous! You’re an inspiration!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1712464529.0, "datetime": "2024-04-07T04:35:29", "subreddit": "AnorexiaNervosa", "id": "kyfdkna", "text": "I teach grad students, and although different than law, looking like Gollum is for sure not an advantage in my career. It is embarrassing and I am also afraid of triggering vulnerable young adults.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1713805010.0, "datetime": "2024-04-22T16:56:50", "subreddit": "AnorexiaNervosa", "id": "l0rl00p", "text": "According to Smithsonian Mag, an average adult human being is quite the meal. Numbers aren’t allowed here, but it’s a quick google away. \nDidn’t say where that average is from, though.\n\nWhere I live, the rich are thinner than the poor. \nIt’s still gonna be quite the meal, but we could gang up and share so each of us only have to pick at them. I don’t eat meat, but I am willing to make an exception for the greater good.\n\n-another socialist with an ED.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1713808243.0, "datetime": "2024-04-22T17:50:43", "subreddit": "AnorexiaNervosa", "id": "l0ruhb7", "text": "Let’s get together and jerk som jerks", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1714899656.0, "datetime": "2024-05-05T09:00:56", "subreddit": "AnorexiaNervosa", "id": "l2nxndg", "text": "Beautiful-looking! Congrats, chef!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1715003196.0, "datetime": "2024-05-06T13:46:36", "subreddit": "fuckeatingdisorders", "id": "l2tv4td", "text": "Aw yiss! You deserve it!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1715240354.0, "datetime": "2024-05-09T07:39:14", "subreddit": "AnorexiaNervosa", "id": "l392qze", "text": "I’m pretty much normal weight now (huzzah, take that stupid anorexia), but when I am underweight, I know. I also never perceived myself as overweight because I never have been. I am aware of my situation. I know it’s bad for me to dip below a certain weight. I’m not labouring under the delusion that I do this because it’s good for me. My kidneys will attest to the fact that it’s not.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1715614705.0, "datetime": "2024-05-13T15:38:25", "subreddit": "AnorexiaNervosa", "id": "l3v3xgq", "text": "Great job!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717742532.0, "datetime": "2024-06-07T06:42:12", "subreddit": "fuckeatingdisorders", "id": "l7hrbkr", "text": "I’m sorry y’all are getting flack. It should be self-evident why the rules are in place. Thanks for your time and labour, mods, I luv u", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722137573.0, "datetime": "2024-07-28T03:32:53", "subreddit": "AnorexiaNervosa", "id": "lfac5p9", "text": "Can you distance yourself? She sounds emotionally immature and like she needs a lot of attention. My mother is an ok person, but a terrible parent. When I was actively dying from anorexia, she still asked me «if I was gonna eat all that» with the therapeutic nutrition drinks I had to do every few hours. I think she felt uncomfortable with me being sick. I wasn’t a kid, either. I just went to them needing help.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722141997.0, "datetime": "2024-07-28T04:46:37", "subreddit": "AnorexiaNervosa", "id": "lfal5p3", "text": "Good!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722152784.0, "datetime": "2024-07-28T07:46:24", "subreddit": "AnorexiaNervosa", "id": "lfb2xl3", "text": "Thank you. I have really great sisters that make up for all of that:-)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722244637.0, "datetime": "2024-07-29T09:17:17", "subreddit": "AnorexiaNervosa", "id": "lfgnyjh", "text": "Heard! Thanks for your work💛", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723449428.0, "datetime": "2024-08-12T07:57:08", "subreddit": "AnorexiaNervosa", "id": "lhppmsy", "text": "I have come to understand that Family Based Therapy can be a VERY mixed bag, but I wouldn’t doscourage you. Individual therapy for your son and you seeing a registered dietician would be my advice.\n\nI feel for your son, and you. I’m sorry this is happening. Don’t underestimate the psychological aspect despite the physical symptoms being alarming.\n\nHere are some resources in case you haven’t been given them: https://capp.ucsf.edu/sites/g/files/tkssra6871/f/Family%20Resources%20for%20Eating%20Disorders%20%28PDF%29.pdf", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726290370.0, "datetime": "2024-09-14T05:06:10", "subreddit": "AnorexiaNervosa", "id": "ln1jfct", "text": "I concur.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729592939.0, "datetime": "2024-10-22T10:28:59", "subreddit": "AnorexiaNervosa", "id": "lt5fwj2", "text": "Hell yeah!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733809065.0, "datetime": "2024-12-10T05:37:45", "subreddit": "AnorexiaNervosa", "id": "m1bhldb", "text": "Yes. I speak and write for a living. I’ve been asked if I’m intoxicated. It’s embarrassing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734542556.0, "datetime": "2024-12-18T17:22:36", "subreddit": "AnorexiaNervosa", "id": "m2opuo5", "text": "Bravo! Looks delicious!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740055555.0, "datetime": "2025-02-20T12:45:55", "subreddit": "AnorexiaNervosa", "id": "mdsk8cb", "text": "I’m crazy, and I do want to recover, but I will say restriction is: predictable. Tempering. Easy. It takes all your problems and turns it into one problem. It will kill you, your intellect and relationships, of course. Buuuuut", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740907693.0, "datetime": "2025-03-02T09:28:13", "subreddit": "AnorexiaNervosa", "id": "mfkwi05", "text": "Proud of youuuuuu💕", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742543947.0, "datetime": "2025-03-21T07:59:07", "subreddit": "AnorexiaNervosa", "id": "mixu8cy", "text": "I believe you. My mother not only demanded the nutridrinks I got in treatment. She also wanted my medication (anti emetics… like..). And once told me «are you gonna eat ALL THAT???» at me drinking the nutridrink I had to drink on a schedule. \n\nShe also doesn’t handle criticism well. Once when I still lived with them, my father and I, backed by my two older sisters who’d already moved out, sat her down. We very calmly explained how her actions were affecting us. She hollered something like «so I guess I’m just a TYRANT AND YOU HATE ME» and stormed off.\n\nI left that shit show the day I turned 18. \n\nShe’s coming to visit in 3 days:):)\n\nYou have to protect yourself. Do you have siblings or anyone else in your corner where you can try to make light of the situation? Can you come here for support? Use your friends, engulf yourself in your studies. For me personally, I use a version of what they call grey-rocking. I just assume everything out of her mouth is nonsense. Water off a duck’s back. It can help to visualize, to really imagine you are a rock. Another visualization aid I was taught was to imagine you are behind a bulletproof, sound proof glass and they’re just a nasty customer. \n\nGood luck in res. I’m glad you will receive help.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742629070.0, "datetime": "2025-03-22T07:37:50", "subreddit": "AnorexiaNervosa", "id": "mj42sma", "text": "Wow, I’m so sorry your family is unsupportive. What a hand to be dealt. You sound really resourceful, though. Very glad to hear your pre-program team functions as a support system. Our parents will affect us all out lives I’m afraid, but you will not always have to be close to them. I want to share a funny poem by Philip Larkin with you:\n\nThey fuck you up, your mum and dad.   \n    They may not mean to, but they do.   \nThey fill you with the faults they had\n    And add some extra, just for you.\n\nBut they were fucked up in their turn\n    By fools in old-style hats and coats,   \nWho half the time were soppy-stern\n    And half at one another’s throats.\n\nMan hands on misery to man.\n    It deepens like a coastal shelf.\nGet out as early as you can,\n    And don’t have any kids yourself.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1748142810.0, "datetime": "2025-05-25T03:13:30", "subreddit": "AnorexiaNervosa", "id": "mu44gi1", "text": "I’m proud of you, too💕", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749566463.0, "datetime": "2025-06-10T14:41:03", "subreddit": "AnorexiaNervosa", "id": "mx0vx91", "text": "I like your way with words.", "parent_id": null, "link_id": null, "context": null}
