{"type": "comment", "timestamp": 1595774787.0, "datetime": "2020-07-26T14:46:27", "subreddit": "fuckeatingdisorders", "id": "fzazksq", "text": "I have a similar issue - my therapist calls this “restriction in disguise” but I think what she means is unconscious restricting. Meaning restriction is such a decades long habit for me that I’ll easily “forget to eat” for half the day and not realize how hungry I am until my blood sugar is crashing. Or I’ll also not eat because I put off grocery shopping until the last possible minute. I had some historical issues around food scarcity, I think the avoiding eating habit goes much deeper in my mind than just weight loss and it’s been so tricky for me to manage my restricting habits - even though I’m technically “recovered” from my ED. Meal plans are helpful because they are already planned out, meaning they take out some of the mental and emotional labor of feeding myself, and they’re really just a minimum - and I do the same thing, I’ll swap out something else that I want to eat if I feel like it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1595870750.0, "datetime": "2020-07-27T17:25:50", "subreddit": "fuckeatingdisorders", "id": "fzf9a1g", "text": "Ugh this is so hard, OP and you are absolutely right to be concerned. Isn't it amazing that having even a small brush with our own ED can really illuminate how widespread these disturbing behaviors are in our cultures? \n\nIt sounds like you've given your girlfriend some very sound advice, and lots of love (good on you!) and you did everything right, but she's not ready to listen. Sometimes that's the painful thing about eating disorders, people see \"positive\" results (i.e. they start losing weight) and there is just no convincing them that what they're doing is unhealthy because they see weight loss, which they (falsely) equate to health. But as you know, these \"temporary\" behaviors do become habits and we can spiral into some very medically destructive behavior without realizing how much damage we are doing until its way out of control. \n\nIf she said she's only doing it for \"one week\", even though we both know what's likely to happen, just sit her down and say, \"Look, I know you feel like I'm not being supportive but I'm just really worried about your health because I know, because of what I experienced, that you're not eating enough to support your body and feel good. If this is really just for one week, then I can live with that. But in 7 days we need to sit down and make sure we have a plan to get you back on an eating schedule that is metabolically sustainable and I'd like to see you eating more than one meal a day so I know that you're taking care of yourself.\" And then once that seven days is over, I would re-present her with that good scientific information you and I both know about chronic restriction and eating disorders. [This is a great place to start](https://eating-disorders.org.uk/information/the-effects-of-under-eating/), it has good scientifically supported information about the myriad effects of chronic restriction that is not shaming about dieting (although I share your feelings about almost every \"diet\" being a bunch of BS).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1595870917.0, "datetime": "2020-07-27T17:28:37", "subreddit": "fuckeatingdisorders", "id": "fzf9msm", "text": "BMI is a pretty useless measure when it comes to \"overweight\" and \"underweight\" [https://www.npr.org/templates/story/story.php?storyId=106268439](https://www.npr.org/templates/story/story.php?storyId=106268439)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1595873714.0, "datetime": "2020-07-27T18:15:14", "subreddit": "fuckeatingdisorders", "id": "fzffmah", "text": "I'm not exactly sure what you're getting at, but some 16 years olds do have curves and some don't. Neither are a metric of health. Every body is different, another reason why universal metrics like BMI that don't take other physiological factors into account are basically worthless when it comes to measuring weight OR health. Give that article a read, I think its really informative about what BMI actually signifies medically :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1599861424.0, "datetime": "2020-09-11T21:57:04", "subreddit": "fuckeatingdisorders", "id": "g4vckrj", "text": "Heck yeah! Hooray for good days and feeling happy and nourished!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600465999.0, "datetime": "2020-09-18T21:53:19", "subreddit": "fuckeatingdisorders", "id": "g5qxzzm", "text": "PREACH", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600708816.0, "datetime": "2020-09-21T17:20:16", "subreddit": "fuckeatingdisorders", "id": "g64hf4b", "text": "Love this - men really do seem to face a double-bind when trying to address these disorders as society is so dismissive and makes it such a punishing experience for men to be vulnerable or ask for help. Upvoted for visibility! <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1604440536.0, "datetime": "2020-11-03T21:55:36", "subreddit": "fuckeatingdisorders", "id": "gb1svwk", "text": "What you did was so brave - but reaching out for help is the most important thing and your parents just want to see you happy and thriving! ED's thrive on shame, so feeling that is totally normal. But know that you are not alone and you have nothing to be ashamed of - and so much to recover for. You can do this!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1608356644.0, "datetime": "2020-12-19T05:44:04", "subreddit": "fuckeatingdisorders", "id": "ggc2p8p", "text": "Omg hit her over the head with a baguette", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1608928948.0, "datetime": "2020-12-25T20:42:28", "subreddit": "fuckeatingdisorders", "id": "gh0jy9g", "text": "The liberation of eating FOR PLEASURE!! We deserve it just as anyone else!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609016249.0, "datetime": "2020-12-26T20:57:29", "subreddit": "fuckeatingdisorders", "id": "gh3pz56", "text": "If ONLY it was only on Reddit. On all social media I’m constantly getting pushed ads for diets, fasting aids, exercise equipment, shapewear etc etc. I’m like STFU srsly LET ME LIVE!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609099817.0, "datetime": "2020-12-27T20:10:17", "subreddit": "fuckeatingdisorders", "id": "gh7repm", "text": "You’re noticing and recognizing the mentality - that’s a big deal. The sooner you learn to identify that voice as your ED, the easier it will become overtime to deconstruct those ideas. Even if you can’t resist them right now, you can change the way you feel about them. Get angry! Be sad! Start countering those thoughts with good information that disarms them: \n\nRestricting after a meal doesn’t “balance out” the calories - we don’t work like that metabolically. Restricting always puts your body under stress, no matter how much you’ve eaten before.\n\nYou can’t “lose” water weight - the bloating will subside once you’re eating and drinking enough to recalibrate the minerals in your body.\n\nEating is not “earned” it is a natural biological process and one of our most basic physical needs. \n\nBody size or weight gain are not limiting diagnostic factors for eating disorders. Fat ppl have disordered eating. Thin people have disordered eating. It’s about the behavior, and al of it is harming you.\n\nEven if the behavior doesn’t change right away, if you can intentionally repeat these truths and counter your ED thoughts with them, you will start giving TRUTH the power, instead of your ED’s lies.\n\nIt’s ok to be struggling - never stop fighting for your health. You deserve to recover, and you do not have to live like this!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609971100.0, "datetime": "2021-01-06T22:11:40", "subreddit": "fuckeatingdisorders", "id": "gicq5ym", "text": "I had the same experience when uploading a cache of old photos to a new phone. It was a photo of me in pajama shorts and a tank top and I honestly couldn't believe how small I was - I didn't even recognize it was me at first, Not because I was emaciated, I was a normal weight like you, but I never ever looked at myself and saw a body that small. It shocked me how dismorphic I had been. I had been so trained to obsess over being smaller, I was unable to see what size my body really was, like, truly. Like by a lot. It made me so sad, man. I really grieved for that girl, and like you said was bummed at all of the wasted time, energy, and money - not to mention all of the years I could have just been happy with my body as it was because in fact I did conform to thin body standards. \n\nBody acceptance isn't something you receive based on conformity to these arbitrary beauty standards, its something you have to choose to do and can choose to do no matter what size you are - and something you will never feel, no matter how small you are, unless you decide that you're good enough.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610133692.0, "datetime": "2021-01-08T19:21:32", "subreddit": "fuckeatingdisorders", "id": "gikmj9b", "text": "Ditto. Happier at my larger size than I've ever been because I'm finally liberated from the constant obsession and destructive behavior of my ED and its ensuing comorbid problems. Recovery helped me address underlying trauma that I had been avoiding for years. I've gotten my life back. My weight fluctuates, but that hardly seems that consequential now. Once you can look back and see how sick you were, the size of your body seems hardly the issue anymore.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611419916.0, "datetime": "2021-01-23T16:38:36", "subreddit": "fuckeatingdisorders", "id": "gkehc3h", "text": "No shame in that if it helped! You can always re-follow people when you're in a better headspace.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611419974.0, "datetime": "2021-01-23T16:39:34", "subreddit": "fuckeatingdisorders", "id": "gkehlhb", "text": "\"you need to go to the gym to build a healthy relationship with food\" is....so problematic. Its sad that people think this is sound advice.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611420771.0, "datetime": "2021-01-23T16:52:51", "subreddit": "fuckeatingdisorders", "id": "gkeku5b", "text": "Oh absolutely, anyone who constantly posts about weight loss, weight loss supplements and diets, or posts pics of them at the gym constantly or really just body check photos all of the time is mute city for me. It is absolutely not personal, I just have realized over time that curating an online environment that is conducive to my well-being is something I can do for myself that has a surprisingly powerful impact. I have a weight neutral social media feed because its my personal choice :) Honestly its only a couple of people I know who post like that, so its not been a huge sacrifice.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614789594.0, "datetime": "2021-03-03T16:39:54", "subreddit": "fuckeatingdisorders", "id": "gpjt2b0", "text": "Ugh, what a feeling! Even when we're struggling we can have a moment of clarity <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620147193.0, "datetime": "2021-05-04T16:53:13", "subreddit": "fuckeatingdisorders", "id": "gwxdrc6", "text": "now throw that scale in the trash because you don't need it! ;p\n\n...but seriously, that's what I did and I've never looked back.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623765455.0, "datetime": "2021-06-15T13:57:35", "subreddit": "fuckeatingdisorders", "id": "h1ujxg1", "text": "I agree, use this as a jumping off point to examine the things you fixate on, like your thighs. What did having a thigh gap *mean about you* that you're afraid won't be true anymore? Where does that fear come from? The more curious you are about your disordered thoughts, the more you will be able to look at them objectively and show yourself some compassion.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623867366.0, "datetime": "2021-06-16T18:16:06", "subreddit": "fuckeatingdisorders", "id": "h1zvfto", "text": "Talk to your doctor, and ask them to call your father and have a chat. Seriously, doctors have to do this with recalcitrant parents all of the time, sadly. \n\nThen after that, you can feel free to tell him to fuck off with his comments, as he knows better now but is simply choosing to be cruel. Ugh, I'm so sorry your Dad is such a douche. My father was also a real asshole during my ED and it pretty much led to our relationship crumbling for many years. We've since made amends, but its still a sore area for me. Parents are just people, unfortunately, and they carry the same prejudices and dysfunction as everyone else.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626566600.0, "datetime": "2021-07-18T00:03:20", "subreddit": "fuckeatingdisorders", "id": "h5kl6f9", "text": "Gently, don’t worry about other people. What works for you? I’m def in the camp that can never even dabble in diets or weight-conscious exercise regimes. There is no healthy way for me to try and lose weight, because that’s just not something I can monitor and control: like an alcoholic who can’t just have one drink. I don’t spend a lot of time wondering why this is, but I instead work on accepting that’s what it is for me. Acceptance is the balm to my insecurities.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1627053589.0, "datetime": "2021-07-23T15:19:49", "subreddit": "fuckeatingdisorders", "id": "h69a9ld", "text": "Inspired by your strength and resilience! Congratulations on coming so far and best of luck with your studies!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1627333467.0, "datetime": "2021-07-26T21:04:27", "subreddit": "fuckeatingdisorders", "id": "h6mqsx4", "text": "I swear to god if a man tapped me on the head like that I would bite his finger off. Blechhh I’m sorry you had to spend 16 hours with this ding dong you’ll never get back.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628046491.0, "datetime": "2021-08-04T03:08:11", "subreddit": "fuckeatingdisorders", "id": "h7muy1v", "text": "also tagging the post as a \"Vent\" helps signal readers that it could include triggering content :-)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628188445.0, "datetime": "2021-08-05T18:34:05", "subreddit": "fuckeatingdisorders", "id": "h7u7yiv", "text": "I wish people understood that making a value judgement about how someone looks is not innocuous or an offhand or casual comment. You would think a DOCTOR would know better than make this comment after you disclosed an eating disorder but they're unfort just as clueless as everyone else most of the time.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638293866.0, "datetime": "2021-11-30T17:37:46", "subreddit": "fuckeatingdisorders", "id": "hmoqea8", "text": "Oy. Since she's minimizing and blowing off how difficult treatment is, you should respond, \"well you know Mom, I actually really do think you should go, you deserve a break\" and then you can enjoy the irony when she gets there and has a complete breakdown.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641571704.0, "datetime": "2022-01-07T16:08:24", "subreddit": "fuckeatingdisorders", "id": "hrngqfc", "text": "Omg yessss this is the energy we need in 2022!!!!!! I threw mine unceremoniously in the trash, but I should have gone full hulk on it, that would have felt amazing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641571909.0, "datetime": "2022-01-07T16:11:49", "subreddit": "fuckeatingdisorders", "id": "hrnhaqi", "text": "I also highly recommend getting rid of full length mirrors, if you still have one. That was even more major for me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642619020.0, "datetime": "2022-01-19T19:03:40", "subreddit": "fuckeatingdisorders", "id": "htcrbvu", "text": "Same! And I've NEVER had a doctor who was not seeing me to treat my ED explain this to me. Yet again, doctors just don't know shit about ED unless they're actually engaged in treating it and see a lot of patients and start to recognize the patterns themselves.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642619077.0, "datetime": "2022-01-19T19:04:37", "subreddit": "fuckeatingdisorders", "id": "htcrhfs", "text": "I second all of this. Additionally, if you're allergic to confrontation like me, feel free to put it in an email!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642623702.0, "datetime": "2022-01-19T20:21:42", "subreddit": "fuckeatingdisorders", "id": "htd3y6h", "text": "I'm gathering they're not treating your ED, but your ED is an important part of your medical history, especially if you're still in recovery, as much as say high blood pressure or a family history of certain cancers. Two reasons:\n\n1) Differential diagnosis. Especially when it comes to mental health, it is super important that your clinician rule out your ED before treating your symptoms as whatever mental health issue you are there to be treated for. \n\n2) Medication management. If they're prescribing you medications that may suppress your appetite OR prompt changes in weight, they REALLY need to know this presents additional risks for you. Medications have side effects for everyone; ideally clinician and patient together decide if that benefit-to-cost ratio is therapeutic. \n\nMental health treatment should be supportive of your recovery, not working against it, and your psychiatrist can't make sure that happens if they don't know the full picture.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642623884.0, "datetime": "2022-01-19T20:24:44", "subreddit": "fuckeatingdisorders", "id": "htd4g2k", "text": "I mean first red flag: she didn't take a full history before addressing your labs. That's already not great to me. Also...not good advice to address high cholesterol anyway? Was the cookies and ice cream thing supposed to be a joke? \n\nI don't know, I mean I realize its a sensitivity of mine and I totally own that, but I wouldn't feel safe discussing my ED with someone operating with that level of obliviousness/ignorance (well-meaning though it might be) and that's not workable for me. I don't have a ton of choice when it comes to doctors, thanks US healthcare system, but I would try someone else after this encounter. One way I've learned to broach the subject of ED with new clinicians during a consult, is to simply ask them if they have experience treating patients \\[for whatever you are there to be treated for\\] with ED. Based on their response to this, I can usually tell if I feel comfortable disclosing, and if not, then I wrap it the fuck up. I'm not paying copays through the nose to continue seeing someone I can't fully trust, but that's totally me. I completely understand how this made you feel. What a bummer.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643066728.0, "datetime": "2022-01-24T23:25:28", "subreddit": "fuckeatingdisorders", "id": "hu34ffq", "text": "Ugh common kitchens are a nightmare for my ED, I find it so hard to use them without freaking the fuck out. I really applaud you for conquering this, you rock!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1646065250.0, "datetime": "2022-02-28T16:20:50", "subreddit": "fuckeatingdisorders", "id": "hyskh2l", "text": "Oh yeah, its a shitshow. And once you're in a recovery mindset, its almost like you can't unsee these accounts. I just would encourage you not to engage with them, in some ways people who are in this kind of denial and pseudo-recovery are even more harmful than people who are just active in their disorder. Its sad, I really feel bad for these people who are really struggling and aren't in any meaningful way free of their disorders.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1646154506.0, "datetime": "2022-03-01T17:08:26", "subreddit": "fuckeatingdisorders", "id": "hyxl4jm", "text": "ugh, what a gut check - I'm so sorry. Of course you wanted to confide in your mom. I'm sure she thinks she's helping, but she doesn't understand ED and carries a lot of the misconceptions most people do around what makes us sick. Unfortunately bringing those misconceptions into your home can really undermine your recovery, and you're going to need to draw some boundaries with her. I would slide some materials her way, maybe just send her some links to websites you think have good and helpful explanations so she can begin to understand why, if she wants to help, demonizing foods and telling you to \"eat less\" is the opposite of helping. The problem isn't the food. The problem is the compulsive need to control and restrict in order to feel ok - and the overwhelming fear of what will happen to our bodies if we're not controlling and restricting that is terrorizing our lives. \n\nMaybe start by saying, \"you know Mom, I've been thinking about what you said about keeping junk food out of the house and I think what might actually be more helpful than removing the food from the house, is removing the SCALE from the house.\" I found it really helpful to stress to my family that my recovery goals were not about my weight in any way, but about healing my relationship to food so I can eat when I'm hungry and not be stressed around meals. Fixating on my weight as it fluctuated in recovery was not only not helpful, but was a huge obstacle to making the right choices for my health.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647379051.0, "datetime": "2022-03-15T21:17:31", "subreddit": "fuckeatingdisorders", "id": "i0sv37g", "text": "Whyyyyy are ppl like thissssss", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647379539.0, "datetime": "2022-03-15T21:25:39", "subreddit": "fuckeatingdisorders", "id": "i0swccc", "text": "Or like fine you ask because you don’t know better. But now you’re giving me advice? Like MYOB yo! Let us eat in peace goddam!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651256276.0, "datetime": "2022-04-29T18:17:56", "subreddit": "fuckeatingdisorders", "id": "i6p2bsu", "text": "Rediscovered my love of cooking! I love exploring new recipes and ingredients, letting my senses go wild, and working with my hands. It makes me feel so connected to my ancestors and I love feeding my family (and myself!)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651257877.0, "datetime": "2022-04-29T18:44:37", "subreddit": "fuckeatingdisorders", "id": "i6p63am", "text": "uhhhh OKAY THAT SOUNDS AMAZING", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655824746.0, "datetime": "2022-06-21T15:19:06", "subreddit": "fuckeatingdisorders", "id": "id6vupt", "text": "It is not normal for your fiancé to be showing you pictures of girls he finds attractive, or pointing out other women he's attracted to. Of course its natural to feel some degree of physical attraction to other people, but I think its really hurtful to bring those images or point out those people to *you*: there's an implied comparison between you and these other women, which is making you feel insecure - and I'm sure he's aware of that, unless he's incredibly stupid. That's not healthy, loving, or supportive, to feel like you're being scrutinized. \n\nAttraction to purely physical qualities is part of nearly every relationship in the beginning, but by the time you're thinking about things like marriage, your love should have deepened into a stronger bond beyond the physical: there should be admiration, respect, and loyalty that aren't about your appearance. You're going to spend the rest of your life with this person, surely he understands that you will both age, your bodies will change, and you should both expect to be loved regardless. Sex is also not something one party demands and the other submits to - sexual desire should be mutual and shared, as should sexual pleasure, its not an obligation. Its up to both partners to foster desire in their partner if they want to engage in intimacy: if you're not feeling it, and he really wants sex, then he needs to learn what does turn you on and do those things. He doesn't sound very concerned with your pleasure. Is that what you want the rest of your sex life to be?\n\nI don't know my friend, I think the problem here is your fiancé - you actually sound like you've handled your ED recovery beautifully and he's just dragging you back down. Maybe you *should* just go home and get back into therapy. He's clearly in your head, and as we all do in relationships that aren't the best that we really want to work, you're rationalizing and normalizing this treatment: but it isn't ok. Whether or not you're \"ok with it.\" Though I suspect once you're out of his grasp and back in therapy you'll probably realize that you aren't (nor should you be!)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656425426.0, "datetime": "2022-06-28T14:10:26", "subreddit": "fuckeatingdisorders", "id": "ie21tws", "text": "This enraged me my friend - your parents/step parents are so out of line, not only is their approach to your ED incredibly traumatic, they don’t also seem to have a good handle your ASD, and their ableism is really troubling, just reading some of that made me sick to my stomach. I’m so so sorry you’re being subjected to this, it’s not ok, it’s not fair, it’s not caring or loving or supportive. I’m glad to hear you have a plan to leave when the time comes, but I’m trying to think how we can support you and your recovery until then.\n\nI’m not ASD, but I do have ADHD, so if you’re like me you’re probably really flooded and overwhelmed when it comes to conflict and direct confrontation so I won’t suggest you take on your relatives when they say disordered and ableist things - but can you just stand up and walk out of the room? Even if they’re talking directly to you. Just get up and leave. You’ve asked them to accommodate you, and they’ve refused - there’s really nothing else you can do about their choices and behavior, but you *can* control what you have to sit through. If this angers them or they find this rude, just calmly state “I am healing my relationship to food, how you choose to speak has consequences for me so I am removing myself from a harmful situation.” Don’t justify it any further than that - you do not need their understanding or validation.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656433406.0, "datetime": "2022-06-28T16:23:26", "subreddit": "fuckeatingdisorders", "id": "ie2lfoy", "text": "Dude, I'm so sorry your family of origin is like this -  I won't get into too much detail but I can definitely relate. I'm 37 now and my family still won't acknowledge my eating disorder (my mom still refers to it as my \"body issues\") nor me not being neurotypical, they put me on stimulants as a teenager and when that didn't change me into a different person, they decided I just didn't have the \"willpower\" to \"do better\". Meanwhile I graduated from high school with honors, got myself a scholarship to college where I also worked to support myself, and at the first opportunity moved 3000 miles away from them so I could finally live the life I wanted to and started learning about myself for real. So you're not alone. But its not ok that you're going through this, and one day when you have some distance from the situation and you're living independently, you will be able to heal. Like you've already begun to with your current partner, you will find people who believe you, accept you, and love you unconditionally - and through their example you'll have the opportunity to re-parent yourself in this way. A happy and full life is out there for you, though it may not be accessible right now <3 It gets better. I promise. \n\nRemember, if your [boundaries](https://www.talkspace.com/blog/family-boundaries/) aren't being respected, you can always leave. Even if that means you leave that donut, and go get another donut ;-p You have a right to keep yourself safe and you do not have to withstand whatever harmful things your family does and says - your needs are important.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1661533097.0, "datetime": "2022-08-26T16:58:17", "subreddit": "fuckeatingdisorders", "id": "ilw472q", "text": "I def feel this. Maybe we should make tshirts :p", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1661533374.0, "datetime": "2022-08-26T17:02:54", "subreddit": "fuckeatingdisorders", "id": "ilw4x0t", "text": "Why did this make me cry so much? Damn", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1663171072.0, "datetime": "2022-09-14T15:57:52", "subreddit": "fuckeatingdisorders", "id": "ioethms", "text": "I def relate - my restriction really ramped up in college because I was broke af (going to college was expensive enough!) and I began skipping meals to see how little money I could spend, it was almost a game to see how low I could get my weekly food budget (got it down to $8 a week once, which should have been a red flag, but I felt like I had really accomplished something!) It gave me *more* positive reinforcement and a pride in not eating because a) I was thinner and b) had more money in my bank account. Both felt like a victory to me. Years later, I wound up in ED treatment, and I *know* those years of scarcity contributed heavily to that. Yes, weight stigma and diet culture drove my ED, but also not wanting to 'waste' my limited funds on food which wasn't about my appearance at all. \n\nWhat I'll say about justifying spending money on food when its so easy not to eat: spending $50 a week on food now will cost you a lot less in the long run than spending THOUSANDS on healing from years upon years of the internal ravages of ED. That *will* impact your long-term spending goals, and I can say that with confidence now that I'm 37 and spent the last 6 years spending $120/week on therapy - that's over $37k. Money spent on eating and even some costs to start recovering (of couple of clinic meetings, or some coaching) gives you the greatest cost benefit, and the *sooner* you do it, the more time you'll get back, which compounds your benefit. On top of, of course, the non-quantifiable value of just feeling better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665160531.0, "datetime": "2022-10-07T16:35:31", "subreddit": "fuckeatingdisorders", "id": "irf5vkj", "text": "Be angry. I am. And as I come to terms with that anger in recovery, the shittiness of BMI does reveal something: how limited these standardized metrics really are. That health and healing are things you feel, not things you compute. That taking the time to check-in and self-evaluate and be honest with myself about how I'm really doing, is more important in the long-run than validation from a medical system that does not acknowledge or value my whole health. I was never outside a \"healthy\" BMI range, even at my sickest, and my life was still down the tubes: and I refuse to be gaslit by people wholly unconnected to me. Don't get me wrong: I rely on physicians for my general health, I'm not at all against science or clinical care. But I no longer seek 'treatment' from physicians for my issues with ED-related stuff because I know they rely on metrics that are not meaningful to me (I am years into recovery so obviously this wouldn't apply for someone who is still medically restoring.)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683739310.0, "datetime": "2023-05-10T17:21:50", "subreddit": "fuckeatingdisorders", "id": "jjmlywb", "text": "You got this! If it helps, this is the place I was in mentally when I finally recovered for good: I was just so freaking sick of agonizing over everything I put in my mouth and missing out on life. I still had allllll of my fatphobia to confront, but this really lit the fire for me and kept me going.", "parent_id": null, "link_id": null, "context": null}
