{"type": "post", "timestamp": 1738003747.0, "datetime": "2025-01-27T18:49:07", "subreddit": "bulimia", "id": "1ibgpdk", "text": "Even though it’s been hell, dealt with digestive issues, weight loss, persistent distended stomach, and many mental obstacles, I’ve managed to start off 2025 b/p free! It feels awesome to go this long and remember that recovery is worth it! Things do get better the longer you go away from damaging yourself!", "title": "I’ve gone 1 full month purge free!", "context": null}
{"type": "comment", "timestamp": 1738162137.0, "datetime": "2025-01-29T14:48:57", "subreddit": "bulimia", "id": "m9tv5zh", "text": "Thank you so much! I’m proud of you too! You’re doing a great job! Don’t forget that!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738162149.0, "datetime": "2025-01-29T14:49:09", "subreddit": "bulimia", "id": "m9tv7ai", "text": "Thank you! This means so much!🙏", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738162165.0, "datetime": "2025-01-29T14:49:25", "subreddit": "bulimia", "id": "m9tv96y", "text": "Thank you!!! 🙏❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738162196.0, "datetime": "2025-01-29T14:49:56", "subreddit": "bulimia", "id": "m9tvckp", "text": "That means so much to me! Recovery is possible!! ✅", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738162211.0, "datetime": "2025-01-29T14:50:11", "subreddit": "bulimia", "id": "m9tvecd", "text": "Thank you so much! Know you are incredible yourself!❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738184629.0, "datetime": "2025-01-29T21:03:49", "subreddit": "bulimia", "id": "m9w48y8", "text": "It takes time, I’m still working through them right now. I got severely constipated (just learned that a few days ago so I could’ve prevented it from happening this long) but it all takes time and consistency of doing the right things for yourself! It’s hard, but recovery is worth it!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738184797.0, "datetime": "2025-01-29T21:06:37", "subreddit": "bulimia", "id": "m9w4ve3", "text": "You’re so right, the longer you go without b/p, the easier it is to refrain from doing it overall. By no means is it easy or does it officially go away as I definitely have my moments where I REALLY want to b/p but you got this! Your support means the world to me! I’m glad this can be an inspiration in any way!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738701315.0, "datetime": "2025-02-04T20:35:15", "subreddit": "bulimia", "id": "mazhi3r", "text": "Thank you so much!", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1740680070.0, "datetime": "2025-02-27T18:14:30", "subreddit": "bulimia", "id": "1izme15", "text": "I wanted to share this not to Brag or show off that I’m doing better than everyone else (because that it NOT at all the case. I’m still severely struggling) but to remind anyone (including myself) that recovery is worth it and possible! By no means am I “recovered”. I still have incredible urges to binge/purge and technically have binged on some occasions but managed to keep it down. I still am struggling with many other things in recovery. I’m a 22 yea old male whos very underweight and anorexic and malnourished and have severe constipation from all the b/p I did two months ago. Even though I still am struggling with those symptoms, I know purging won’t solve or make those issues better, and the same goes for all of you if you struggle with bulimia. Know that you got this! I still struggle everyday but remember that recovery is hard, but worth it❤️", "title": "I’ve gone two full months b/p free!", "context": null}
{"type": "comment", "timestamp": 1740692401.0, "datetime": "2025-02-27T21:40:01", "subreddit": "bulimia", "id": "mf56m37", "text": "Thank you so so much! You’re not alone and I worried and thought the same thing! I was relived it was only constipation but I definitely thought it was worse! Glad you feel more reassured because your feelings are valid as is your recovery! I hope and wish nothing but the best for you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740692563.0, "datetime": "2025-02-27T21:42:43", "subreddit": "bulimia", "id": "mf575s1", "text": "Thank you so much! You should be proud of yourself too :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740692574.0, "datetime": "2025-02-27T21:42:54", "subreddit": "bulimia", "id": "mf577kj", "text": "Thank you! This means so much!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740692609.0, "datetime": "2025-02-27T21:43:29", "subreddit": "bulimia", "id": "mf57cn2", "text": "This made me emotional ❤️thank you! Bulimia won’t win this war :) we can kick its ass together!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740692823.0, "datetime": "2025-02-27T21:47:03", "subreddit": "bulimia", "id": "mf583rx", "text": "You deserve the same! Recovery is HARD, but one I know you’ll get to :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740695626.0, "datetime": "2025-02-27T22:33:46", "subreddit": "bulimia", "id": "mf5hi6t", "text": "SO SO SO proud of you for being mostly free of bping. You’ll get there and you’re absolutely right, it’ll be amazing and an achievement you’ll always be so proud of that you overcame and won over and deserved to win!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740695672.0, "datetime": "2025-02-27T22:34:32", "subreddit": "bulimia", "id": "mf5hnn2", "text": "Thank you and yes that first month was HELL. It still is today, but it’s a tad easier to control myself when I really want to b/p. I had no idea that can happen and those things are true, but good to know!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740702403.0, "datetime": "2025-02-28T00:26:43", "subreddit": "bulimia", "id": "mf62ce7", "text": "Of course and thank you!🙏❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740702525.0, "datetime": "2025-02-28T00:28:45", "subreddit": "bulimia", "id": "mf62pn6", "text": "That makes a lot of sense and makes me feel valid and reassured after all the times I struggling b/p in the past and feeling that way. The only thing holding me back now from going back to b/ping is that the last few times I tried to, I couldn’t purge hardly anything out and I never want to experience the emotions that I experienced through that again but you’re right, it definitely sent a “high” that felt better than anything I’ve ever felt before when I would purge successfully and be sick. Looking back now, I never want to experience that again. Thank you for sharing this. This makes a lot of sense and really helpful and made me learn a lot", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740769534.0, "datetime": "2025-02-28T19:05:34", "subreddit": "bulimia", "id": "mfaswvr", "text": "Thank you for this! Honestly I could use any advice right now to what can help my constipation as it’s been two whole months with it now but this is all very helpful! What are easy peelers? I’ve never heard of them. Is it similar to miralax and Is it stronger and better? Dates help too?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740780507.0, "datetime": "2025-02-28T22:08:27", "subreddit": "bulimia", "id": "mfbw1d9", "text": "Thank you so much for this! I’ll definitely give them a try! I go daily myself but it definitely feels incomplete or more should/needs to come out (sorry if that’s tmi) but I really appreciate your input and advice! I’m glad you’re finding a solution that works (hopefully stays that way) for you! I wish you the best and again I really appreciate your help and time :) I wish you the best in your recovery!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740781991.0, "datetime": "2025-02-28T22:33:11", "subreddit": "bulimia", "id": "mfc0zyl", "text": "Thank you and I’m actually a guy but still, thank you so much for your support and kindness! Don’t forget how many people are proud of you as well!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740787685.0, "datetime": "2025-03-01T00:08:05", "subreddit": "bulimia", "id": "mfcirhi", "text": "This made my day! Thank you so so so much❤️🙏I’m so glad my story can help in any way! That means the world to me! You can do this! You’re doing a great job! Don’t forget that !", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740962398.0, "datetime": "2025-03-03T00:39:58", "subreddit": "bulimia", "id": "mfp8kh3", "text": "I don’t think so, but my stomach and abdomen area is bloated 24/7, so I’m not sure if it’s mostly related to my constipation or other things like edema but I’m so sorry to hear about your struggles with it :( I haven’t gained much weight since I stopped because I’m struggling with over exercising and restriction but I do know that things will get better with time, I promise! You’re doing an amazing job!", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1745157947.0, "datetime": "2025-04-20T14:05:47", "subreddit": "bulimia", "id": "1k3naej", "text": "Last night I binged over 10k calories and right as I was trying to purge, my body wouldn’t let me purge out hardly anything. I purged 2 days prior to this fairly easily and successfully, but I was purged for like 4 hours that day. Since I couldn’t purge anything out (hardly anything), I started to stress out, freak out, cry, and felt like a failure and was scared for all the weight I was gonna gain. I never wanted to die more than ever then.  I started to hurt myself by cutting myself. I felt like a failure. I called my dad and his gf, my brother, and him came over and supported me and stopped me from hurting myself more than I did. They cleaned up my wounds and I luckily didn’t cut to deep to go to the hospital. I still had the worst night sleep ever. This morning the guilt is hitting me hard and I still feel so uncomfortably full and tired from the binge last night. I say this to say I wish this disorder on nobody. I wish and pray for you all to recover and get the help you need. This is a serious mental health disorder that deserves to be addressed. I hope u all have a great Easter and a better day than me. ", "title": "I had the worst day of my life", "context": null}
{"type": "comment", "timestamp": 1745164244.0, "datetime": "2025-04-20T15:50:44", "subreddit": "bulimia", "id": "mo3v1kx", "text": "I’m so so sorry you can even relate to this. I wish this on nobody and for you. You deserve the same grace and deserve support, love, attention, and happiness. Please take care of yourself too❤️please don’t hurt yourself either, you’re to valuable to this world and so many people. Your words and support mean so much to me. Thank you, it’s somehow put a smile on my face on a time and day where I can’t feel anything else but pain and suffering. I wish and hope nothing but the best for you. I mean that. Again, thank you for everything you said and I want to say again that I’m so sorry you experienced and went through what you did. Let this moment have us learn that our bodies have been through enough, and not letting us purge was a sign of that. It’s had enough damage done from us already, we deserve to give it the love and care it deserves. We will get through this stronger and better than ever❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745173919.0, "datetime": "2025-04-20T18:31:59", "subreddit": "bulimia", "id": "mo4pnhq", "text": "To avoid what?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745174102.0, "datetime": "2025-04-20T18:35:02", "subreddit": "bulimia", "id": "mo4q880", "text": "Thank you so so much. Your support and empathy means the world to me. Part me of me wishes it too, but I’ve been down this road before unfortunately of hurting myself and going to the hospital. For past experiences, it doesn’t help besides getting stitches and resolving my injuries. The actual support and care they do for mental health isn’t there. I am on medication, currently on olanzapine. I do get support for my mh and ed. I’ve been with an all virtual ed program for over a year now, but I’m starting a php program hopefully this week. My family is looking for higher level of care. Again, thank you for your support and I really appreciate your words and care🙏", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745174122.0, "datetime": "2025-04-20T18:35:22", "subreddit": "bulimia", "id": "mo4qage", "text": "I’m so sorry, I’m wishing the best for you and hope to get the support and help u deserve and need", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745174234.0, "datetime": "2025-04-20T18:37:14", "subreddit": "bulimia", "id": "mo4qnb2", "text": "I did that, my body wouldn’t allow me to get much out no matter how much water or how thorough I ate my food", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1747535550.0, "datetime": "2025-05-18T02:32:30", "subreddit": "bulimia", "id": "1kp9ov0", "text": "I hate life. I hate this disorder. I feel like a failure and I’ve gained so much weight off this binge. What do I do to get past this? I never wanted to die more than I do now. ", "title": "Binged over 10k calories and can’t purge anything out", "context": null}
{"type": "comment", "timestamp": 1747573842.0, "datetime": "2025-05-18T13:10:42", "subreddit": "bulimia", "id": "msy6fuj", "text": "Thank you for the insight. I needed to hear this. This definitely doesn’t want me to b/p again. I wish this on nobody. This disorder is a monster.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747573859.0, "datetime": "2025-05-18T13:10:59", "subreddit": "bulimia", "id": "msy6hc0", "text": "I couldn’t relate more 🙏", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747573916.0, "datetime": "2025-05-18T13:11:56", "subreddit": "bulimia", "id": "msy6mnv", "text": "Thank you for this. This really makes me feel better. It’s just so uncomfortable sitting with the fullness and bloating and weight gain right now :(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747573946.0, "datetime": "2025-05-18T13:12:26", "subreddit": "bulimia", "id": "msy6pes", "text": "That’s a good way to look at it. Thank you, that makes me feel better🙏", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747573960.0, "datetime": "2025-05-18T13:12:40", "subreddit": "bulimia", "id": "msy6qql", "text": "It’s awful :( I’m sorry you had to go through it too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747573981.0, "datetime": "2025-05-18T13:13:01", "subreddit": "bulimia", "id": "msy6sqi", "text": "Thank you❤️I hope you’re doing well and okay yourself.  Wish you nothing but the best", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747574020.0, "datetime": "2025-05-18T13:13:40", "subreddit": "bulimia", "id": "msy6wc9", "text": "Wasn’t asking for help. Just reassurance.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747574107.0, "datetime": "2025-05-18T13:15:07", "subreddit": "bulimia", "id": "msy74bi", "text": "Thank you for the reminder. I just feel like I have no water in me since I purged all of it out. Even if I drink water, it’ll go down eventually?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747574826.0, "datetime": "2025-05-18T13:27:06", "subreddit": "bulimia", "id": "msy8zl6", "text": "That’s amazing you did what you did! So proud of you! I hope to get there one day too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747580581.0, "datetime": "2025-05-18T15:03:01", "subreddit": "bulimia", "id": "msypy86", "text": "You’re so kind, thank you for your support and kind words❤️No need to be sorry! I will do my best to do those things and I hope you do the same for yourself! You deserve that same kind of treatment too!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747615089.0, "datetime": "2025-05-19T00:38:09", "subreddit": "bulimia", "id": "mt1mglf", "text": "I’m right there with you on that :(", "parent_id": null, "link_id": null, "context": null}
