{"type": "comment", "timestamp": 1611530582.0, "datetime": "2021-01-24T23:23:02", "subreddit": "fuckeatingdisorders", "id": "gknbv3w", "text": "Yes... all the fucking time. So many influencers and even friends who just trigger me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611546701.0, "datetime": "2021-01-25T03:51:41", "subreddit": "EatingDisorders", "id": "gko7i00", "text": "I feel the same but the paradox is that the Ed will continue to fuck up the metabolic rate causing metabolic damage and digestion issues or hormonal imbalance. I feel like I can’t win. But I know that the restrict purge over eat cycle will not help me lose weight it’ll make me gain", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1612069918.0, "datetime": "2021-01-31T05:11:58", "subreddit": "fuckeatingdisorders", "id": "glg8oxp", "text": "This gives me hope. Your birthday sounds lovely and so expansive and creative. Your boyfriend sounds like a really down to earth guy. All the special little things .... makes me happy", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1612843856.0, "datetime": "2021-02-09T04:10:56", "subreddit": "bulimia", "id": "gmnvdnk", "text": "Sometimes it unfortunately takes someone to get to this kind of breaking point to really get the mental illness to crack, and once it’s cracked, you open up the psyche to a new life. You’re on your way there. Your mind is expanding and you have purpose. Sometimes our mental illness becomes our life mission and soul purpose. You deserve treatment that works but it starts with you and your mindset and it sounds like you’re on the path to reclaiming yourself and your life. Sending love to you xo", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613190628.0, "datetime": "2021-02-13T04:30:28", "subreddit": "EatingDisorders", "id": "gn51zxk", "text": "Yes, you’re not alone, chewing and spitting is very common especially in anorexia because it provides some sort of eating sensation without the feeling of fullness. It’s stressful, and comforting at the same time. I go through phases... l occasionally find myself chewing and spitting very randomly too even when I’m cooking . It’s something to be mindful of and don’t beat yourself up for it. Just gradually try to decrease how much you do it each day and week", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613275009.0, "datetime": "2021-02-14T03:56:49", "subreddit": "fuckeatingdisorders", "id": "gnchs70", "text": "After treatment for my anorexia , it swung the other way and I developed binge eating disorder at age 16 after the anorexia treatment. I hated it. I would binge on peanut butter and my body wouldn’t be able to digest it and the next day I would feel absolutely so sick and burp these burps that tasted like rotten eggs because of all the protein. I hate peanut butter now. I only allow myself single servings of sunflower butter or almond butter. But I really over did it with nut butters in the past that I just am digested with myself . I never want to binge on it again", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613279909.0, "datetime": "2021-02-14T05:18:29", "subreddit": "fuckeatingdisorders", "id": "gncv8cu", "text": "Thanks for that info!! Very interesting", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613714165.0, "datetime": "2021-02-19T05:56:05", "subreddit": "bulimia", "id": "gnz8mlp", "text": "Omg I FEEL FOR YOU. I will share a little story that will make you feel better. Summer 2019 I moved into a house in Philly. After a week my personal bathroom toilet got clogged and I couldn’t use it for a week or so. I was binging and purging on the regular. I ended up purging in a bag, walking it down the street searching for a trash bin but couldn’t find one. I ended up chucking it under the bridge where a lot of garbage was and when I walked back, a woman on her porch literally called me out and asked me if I just threw out trash over there. It was so embarrassing and I had to make up some insane excuse.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1613883895.0, "datetime": "2021-02-21T05:04:55", "subreddit": "bulimia", "id": "go743ri", "text": "I feel the same way , except I don’t even binge yet I’m still gaining  weight", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614152499.0, "datetime": "2021-02-24T07:41:39", "subreddit": "AnorexiaNervosa", "id": "gok79ol", "text": "This is exactly how I feel. I never wanna look like I did at weight a and b", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614927353.0, "datetime": "2021-03-05T06:55:53", "subreddit": "bulimia", "id": "gpqyjyn", "text": "Cats know .... they just know", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637297864.0, "datetime": "2021-11-19T04:57:44", "subreddit": "bulimia", "id": "hl7v17r", "text": "I’ve been on both sides of the spectrum. I’ve been hospitalized for anorexia years ago. And then I full blown swung to bulimia in my late twenties so I know how you feel. I’m so sorry.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637358143.0, "datetime": "2021-11-19T21:42:23", "subreddit": "AnorexiaNervosa", "id": "hlb4ype", "text": "If your finances are so low you definitely qualify to get help from the govt. I applied ans got food stamps and there’s also other assistance for rent etc.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637986080.0, "datetime": "2021-11-27T04:08:00", "subreddit": "fuckeatingdisorders", "id": "hm8iony", "text": "@lilsipper who has literally blocked me for messaging her and calling her out on her clear and apparent eating disorder :) there’s threads on her, she’s clearly anorexic and lied to her followers that she’s never had an Ed yet she has photos of her emaciated on her website and claims it’s “IBS”.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637986386.0, "datetime": "2021-11-27T04:13:06", "subreddit": "fuckeatingdisorders", "id": "hm8j8hm", "text": "@danifernandez.g. This girl is the most triggering girl on IG Ed space and she’s doing HARM. She claims she’s recovering from her clear and apparent anorexia. She continues to LOSE WEIGHT, she works out ALL the time. She lifts weights and has literally zero body fat and looks like she should be on a death bed. She is emaciated and she even posts what she eats posts and it’s clear that she is anorexic and orthorexic. She legit hasn’t gained any weight even though she tags it. People like her are doing harm. If she’s trying to recover great but being a recovery advocate is a Fucking lie and she’s doing a huge disservice to her followers bu flaunting her emaciated body", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638058955.0, "datetime": "2021-11-28T00:22:35", "subreddit": "fuckeatingdisorders", "id": "hmc83r9", "text": "Her account has gotten even worse too… she is now posting photos OF HER BODY, inn5 week comparisons and she looks emaciated and completely the same and she’s claiming she’s gaining weight. I legit commented on one of them saying “these posts are doing harm to the Ed community” like why the fuck are you posting photos of your anorexic body??? It’s not helping anyone. She secretly loves flaunting her emaciated body", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638244611.0, "datetime": "2021-11-30T03:56:51", "subreddit": "bulimia", "id": "hmmdzus", "text": "Amazing! I remember when I really decided to stop the bulimia thing as well. One day at a time, no purging. That’s all we can do. Meetings helped me a lot. Dharma recovery meetings are free online support group meetings 12 step based but also meditation and there’s usually always Ed people in there along w addicts of all kinds", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638547224.0, "datetime": "2021-12-03T16:00:24", "subreddit": "fuckeatingdisorders", "id": "hn2wdov", "text": "Oh wow I would love to see the video of him calling her out if you could send the link to me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638548192.0, "datetime": "2021-12-03T16:16:32", "subreddit": "fuckeatingdisorders", "id": "hn2ys1k", "text": "Omg thank you. Glad I’m not the only one super disturbed by her. She just needs to stop what she’s doing because she’s doing more harm than good.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640407127.0, "datetime": "2021-12-25T04:38:47", "subreddit": "fuckeatingdisorders", "id": "hpvwdh9", "text": "If she has an Ed then that would explain her comments toward you. I’m sorry. You don’t deserve that at all. Eat your cookies and she’ll just be jealous", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641055975.0, "datetime": "2022-01-01T16:52:55", "subreddit": "fuckeatingdisorders", "id": "hqtlc5t", "text": "I have both on my list lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642889484.0, "datetime": "2022-01-22T22:11:24", "subreddit": "bulimia", "id": "htsrbm1", "text": "I’ve been there… that’s why I had bulimia for years… it got to the point where I HAD to stop purging because I was going to die or what it felt like. Heart palpatations and hypnotic jerks when I tried to sleep.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643654511.0, "datetime": "2022-01-31T18:41:51", "subreddit": "fuckeatingdisorders", "id": "hv0z6et", "text": "Cough cough Daniela Fernandez, who has been clinically emaciated for years yet, “in recovery and gaining weight” , while she works out and eats like a complete anorexic. It’s extremely triggering yes. There’s probably so many others. There was one girl I found who was saying she was an Ed recovery advocate and she posts mirror selfies of her underweight body in lingerie. Like wtf is this narcissist Ed bullshit", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643654563.0, "datetime": "2022-01-31T18:42:43", "subreddit": "fuckeatingdisorders", "id": "hv0zbob", "text": "And Daniela Hernandez or Fernandez whatever her name is", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643656419.0, "datetime": "2022-01-31T19:13:39", "subreddit": "fuckeatingdisorders", "id": "hv14cnu", "text": "She needs to be cancelled for real. She’s doing more harm than any good at all.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643659318.0, "datetime": "2022-01-31T20:01:58", "subreddit": "fuckeatingdisorders", "id": "hv1c3dg", "text": "Right…I mean that’s no surprise. She’s literally emaciated and “can’t gain weight”", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643661067.0, "datetime": "2022-01-31T20:31:07", "subreddit": "fuckeatingdisorders", "id": "hv1gqh2", "text": "She shouldn’t be even on YouTube talking about recovery because she’s not really doing it. She’s still emaciated and it’s harmful af. I don’t care if she’s gained 10 lbs, she still looks incredibly sick and she’s not helping anyone in my opinion.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643670969.0, "datetime": "2022-01-31T23:16:09", "subreddit": "fuckeatingdisorders", "id": "hv267ww", "text": "hahah. I agree. Her YouTube and IG is just a way for her to validate herself, it’s a way to cover up her emaciation and tries to tell her followers that she “just can’t seem to gain weight”— it’s toxic", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643758499.0, "datetime": "2022-02-01T23:34:59", "subreddit": "fuckeatingdisorders", "id": "hv7baoh", "text": "Yeah she sucks. She needs to be cancelled", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644174647.0, "datetime": "2022-02-06T19:10:47", "subreddit": "EatingDisorders", "id": "hvugoz8", "text": "It is very similar yes.  I have lived both sides. Drug addiction, and ed/ exercise addiction. I find that recovering  an ed is way harder than any drug addiction or alcohol problem. I am clean and sober and it hasn’t been that hard for me. But the ed is more of a mental disorder which goes deeper than just substance and habits. We can’t go cold turkey off food. So it’s more of a mental brain re wiring that needs to occur which can feel\nNearly impossible to folks like me who have had an ed of all various types for 17 years", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645503260.0, "datetime": "2022-02-22T04:14:20", "subreddit": "fuckeatingdisorders", "id": "hxxagjo", "text": "Oh there’s definitely some dumb as fuck “anorexia recovery influencers”. Who are basically emaciated and preaching that they’re in recovery. But they’ve maintained their emaciated body for months and months and months. Makes no sense. They’re doing it for validation. They are still in their Ed.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1646333771.0, "datetime": "2022-03-03T18:56:11", "subreddit": "fuckeatingdisorders", "id": "hz7ua56", "text": "Anything hair or face related makes me happy because my hair has been falling out and I have face dysmorphia as I’m aging", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647116481.0, "datetime": "2022-03-12T20:21:21", "subreddit": "fuckeatingdisorders", "id": "i0erq97", "text": "They are still in their Ed’s. There are tons of “anorexia recovery influencers” online that have been called out bc they are losing weight while saying they’re in recovery? Makes no sense. They only share what they share you have no idea what they do to keep their bodies that thin. They love selling anorexia recovery without the weight gain, which is literally insane. I relate to what you’re saying though, when I eat even a “normal” amount or less than normal I gain weight and I’m a healthy weight .", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647116532.0, "datetime": "2022-03-12T20:22:12", "subreddit": "fuckeatingdisorders", "id": "i0eruea", "text": "There’s so many influencers like this that are literally harming the Ed recovery community. Makes me sick", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647116651.0, "datetime": "2022-03-12T20:24:11", "subreddit": "fuckeatingdisorders", "id": "i0es3xv", "text": "I agree. No one who is recovered would be flaunting their emaciated or underweight body on social media. They would know that isn’t helpful to people really trying to recover. It’s like none of these recovery influencers have stepped foot into a single Ed recovery support group. They’re all free groups and they have rules and guidelines. It’s obvious they have NEVER actually been in one lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648000459.0, "datetime": "2022-03-23T01:54:19", "subreddit": "EatingDisorders", "id": "i1qrh3n", "text": "I agree with this. In my experience. The Ed seems more of a resiliency mental illness, the drugs are more of a weakness mental illness. I know this is fucked up to think but since I’ve lived both experiences it’s kinda funny to reflect back", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648005300.0, "datetime": "2022-03-23T03:15:00", "subreddit": "EatingDisorders", "id": "i1r1fdg", "text": "Oh 1000000% . I easily got sober but the Ed is not as easy. You can’t just go cold Turkey off food or Behauvors like it’s easy to go cold Turkey off a drug or alcohol substance", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649307088.0, "datetime": "2022-04-07T04:51:28", "subreddit": "fuckeatingdisorders", "id": "i3q48ak", "text": "I definitely know the feeling of needing to eat something or you’d get no sleep. Some people don’t understand that it’s not a fuckkng sin to eat late at night like who cares. You deserved that food.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650754735.0, "datetime": "2022-04-23T22:58:55", "subreddit": "fuckeatingdisorders", "id": "i5xmcq9", "text": "I find intuitive eating as a means to recover from an Ed extremely paradoxical and it’s an oxy moron. It’s like telling a drug addict or alcoholic to “just go to the bar for one drink” or “just do a little bit of drugs”. Also. For those of us with anorexia or atypical anorexia, “Intuitive  eating” looks like starving one self. IE is not an end all be all to eating disorders and recovery, it’s toxic as fuck in my opinion.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650756301.0, "datetime": "2022-04-23T23:25:01", "subreddit": "fuckeatingdisorders", "id": "i5xpq23", "text": "I agree! But so many Ed professionals and experts praise IE like it’s a no brainer. It makes absolutely no sense. And then it injects shame into the folks who IE does not work for like binge eaters or bulimic. IE only works for folks who have a deep understanding of food/ body/ nourishment/ nutrients/ etc etc etc.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650758406.0, "datetime": "2022-04-24T00:00:06", "subreddit": "fuckeatingdisorders", "id": "i5xu17i", "text": "Nice. Well I’m glad it works for some people", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654020672.0, "datetime": "2022-05-31T18:11:12", "subreddit": "fuckeatingdisorders", "id": "iaov9dp", "text": "Yeah I actually  have body confidence when I restrict.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654214835.0, "datetime": "2022-06-03T00:07:15", "subreddit": "AnorexiaNervosa", "id": "iaz60yf", "text": "Right there with you. This is exactly why I choose to just continue my Ed but try to do it in a more healthy way than when I was anorexic in high school", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654286754.0, "datetime": "2022-06-03T20:05:54", "subreddit": "EatingDisorders", "id": "ib2q5yn", "text": "Idk This probably wouldn’t work for me considering my auto immune issues and laundry list of food sensitivities. Wouldn’t be worth it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654665379.0, "datetime": "2022-06-08T05:16:19", "subreddit": "AnorexiaNervosa", "id": "ibkqiq0", "text": "She’s not vegan lmao. She’s eaten tons of meat on her show. Burgers, chicken etc. is she newly vegan?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654690533.0, "datetime": "2022-06-08T12:15:33", "subreddit": "AnorexiaNervosa", "id": "iblm8re", "text": "I don’t think she eats healthy either lol. Maybe since being with Travis she wants to be vegan because he’s been vegan for years. But she definitely doesn’t eat healthy, she also gained like 30+ lbs", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656280071.0, "datetime": "2022-06-26T21:47:51", "subreddit": "fuckeatingdisorders", "id": "idut122", "text": "It would be nice to find some recovery accounts who are also not rail thin and claiming to be recovered", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656282042.0, "datetime": "2022-06-26T22:20:42", "subreddit": "fuckeatingdisorders", "id": "iduxavs", "text": "They’re doing a huge disservice to the Ed community. They should be ashamed", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656440737.0, "datetime": "2022-06-28T18:25:37", "subreddit": "EatingDisorders", "id": "ie3452q", "text": "This! I hate how recovery is so focused on weight. Why not focus on our eating habits and focusing on nourishing in a better way? Why does it have to be about gaining weight. Me like OP is healthy weight and I have no desire to “fully recover” because I am not ok with gaining more weight.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656441615.0, "datetime": "2022-06-28T18:40:15", "subreddit": "EatingDisorders", "id": "ie36ba9", "text": "If I gained 40 lbs with my short frame I would be obese. I have no desire to gain weight. I think recovery IS possible for folks who want to maintain. But the Ed recovery community is so black and white thinking. This is why I love and follow the work of mindy pluzter", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657120461.0, "datetime": "2022-07-06T15:14:21", "subreddit": "fuckeatingdisorders", "id": "if30grg", "text": "Yes. I am in craZy money saving mode. I refuse to buy things other than groceries and healing treatment . I have a deep fear of spending on a trip or something even though I really want to", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659411916.0, "datetime": "2022-08-02T03:45:16", "subreddit": "fuckeatingdisorders", "id": "iilm576", "text": "It’s totally worthy of a celebration. I’ve been praying for my period to come. I’d celebrate with you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659817413.0, "datetime": "2022-08-06T20:23:33", "subreddit": "fuckeatingdisorders", "id": "ij876nc", "text": "Did she actually say those words ?? I had a therapist do something similiar. He said “before I started working with you I thought you’d be a lot worse and on the verge of hospitalization but you’re fine!” \n\nIt sucks . It made me relapse and really start starving myself again. I fired him because he was a terrible therapist with no Ed experience", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659934482.0, "datetime": "2022-08-08T04:54:42", "subreddit": "fuckeatingdisorders", "id": "ijekbx7", "text": "It’s time to set boundaries and tell your mom that you are not open to discuss anything body/ weight: food related . End of story.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1660108634.0, "datetime": "2022-08-10T05:17:14", "subreddit": "fuckeatingdisorders", "id": "ijokb86", "text": "What the fuck is wrong with your dad? Is he slow? If you’re still in contact with anyone from residential please tell them what he said. Do you have a Therapist? I’m assuming yes. Please tell on your dad. He needs to be callled the fuck out for his ignorant behavior", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1662876277.0, "datetime": "2022-09-11T06:04:37", "subreddit": "fuckeatingdisorders", "id": "inye0yg", "text": "Call me crazy but I actually like AZ. I can’t have milk so maybe that’s why.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1662910803.0, "datetime": "2022-09-11T15:40:03", "subreddit": "fuckeatingdisorders", "id": "inzzwfy", "text": "I can’t waste any more of my energy here. This sub Reddit is way too black and white for me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1664346427.0, "datetime": "2022-09-28T06:27:07", "subreddit": "AnorexiaNervosa", "id": "iq7f4kh", "text": "Woah and this song really dates my high school Ed days. Fuck", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669564997.0, "datetime": "2022-11-27T16:03:17", "subreddit": "AnorexiaNervosa", "id": "ixzcio4", "text": "The mod there is ignorant ad uneducated. That sub is absolutely terrible. She speaks to everyone in such a condescending way and has no idea what the hell she is talking about. It’s toxic", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669565010.0, "datetime": "2022-11-27T16:03:30", "subreddit": "AnorexiaNervosa", "id": "ixzcjvk", "text": "FACTS", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669565060.0, "datetime": "2022-11-27T16:04:20", "subreddit": "AnorexiaNervosa", "id": "ixzco3u", "text": "Yeah fuck that. That insane mod blocked me for stating that sugar and food addiction is real. Again, she’s an uneducated ignorant person.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1671856830.0, "datetime": "2022-12-24T04:40:30", "subreddit": "EatingDisorders", "id": "zu1vgw", "text": "I’m seeing a lot of posts here and in other Ed communities basically just begging for someone to help them with their binge eating issues.  If we had the answer to that problem, none of us would be here. Binge eating isn’t a one size fits all approach to healing. Some people are moderators and some people are abstainers  and some people fall in between. Some people can do intuitive eating and some people cannot because it wouldn’t make sense or be possible with their lack of hunger hormones or hunger/ satiety cues and signals. Coming to this sub and expecting others to help you stop bingeing is absolutely not going to happen. Again, if we had the answers, none of us would be going through the cycles. \n\nListening to podcasts about binge eating is probably the BEST and MOST EFFECTIVE way to get the support and the inspiration needed to stop bad habits around food or eating . Podcasts are FREE :) and there’s thousands of them. If you just type in bingeing or eating disorders in Spotify you get all the support and information you need to get through really bad moments with ED’s. \n\nHere’s a list of them that you can listen to! Spotify is easy to navigate. Listen to episodes with the topics you’re struggling with. Podcasts can help you re wire your brain and help change your habits. \n\n• The Recovery warriors shows\n\n• What you’re craving \n\n• Nutrition matters podcast \n\n• Any podcast you can find with Isabella foxen duke\n\n• any podcasts with James clear (author of atomic habits) \n\n• Brain over binge podcast \n\n• Any podcasts with Glenn Livingston \n\n• The psychology of eating podcast\n\n• Food junkies - amazing !!!! \n\n• any podcasts with Joan ifland \n\n• any podcasts with Mary roberts and Jessyca Reynolds \n\n• unsweetened sio \n\n• any podcasts with Susan pierce Thomson \n\nHope this helps. Knowledge is power. Support is medicine. Habits can change but it requires the will to WANT to change. And trust me, I’m not perfect because I have a host of Ed habits I am trying to release. :)\n\nMerry Christmas 🎁 I hope this gift helps y’all", "title": "ED/ bingeing/ FREE list of podcasts and support 🎁🎄🎁", "context": null}
{"type": "comment", "timestamp": 1671939478.0, "datetime": "2022-12-25T03:37:58", "subreddit": "EatingDisorders", "id": "j1kosan", "text": "Awesome! I’m gonna listen to it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671942779.0, "datetime": "2022-12-25T04:32:59", "subreddit": "EatingDisorders", "id": "j1ku91d", "text": "🎁🎄❤️‍🔥", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1677340547.0, "datetime": "2023-02-25T15:55:47", "subreddit": "ARFID", "id": "j9ytne8", "text": "I’m in the same exact situation. No restaurant will serve my safe foods. Maybe Starbucks or a coffee place but no one finds that to be an actual social outing. I don’t drink anymore so there’s that. Going to a bar sounds like a nightmare for me and would trigger my ptsd. So I’m just stuck going to the grocery store and hoping I meet someone there", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1678733551.0, "datetime": "2023-03-13T18:52:31", "subreddit": "bulimia", "id": "jc39vou", "text": "For some reason though, when I’m thin; I do feel happier and way less miserable. Maybe I’m just fucked and disordered but I’m more able to live with my Ed and I enjoy my life more when I’m thin", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1680312592.0, "datetime": "2023-04-01T01:29:52", "subreddit": "EatingDisorders", "id": "jehh4me", "text": "I don’t think it ever “goes away”. We can’t burn away memories or brain cells. We can’t get a brain transplant. We can’t erase the memory of having an Ed , therefore, what makes people think full recovery is possible? It doesn’t make sense to me lol. It’s just getting to a point of living with it or lowering the intensity.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1685847814.0, "datetime": "2023-06-04T03:03:34", "subreddit": "EatingDisorders", "id": "jmtisk0", "text": "Yes these are all valid as fuck. Also the extreme inability many of us have with eating in front of or with others. I just refuse to eat with or around people anymore. It feels like trauma and attacking myself when I have to eat in front or with others. The food combinations and weird concoctions that I make everyday is also really self shaming for sure. I also have auto immune conditions and gut disorders so the way I eat is to keep that at bay and I literally have to make all of my food for myself at home, can’t have anything packaged etc. so that manifests as orthorexia, Arfid etc", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1688585267.0, "datetime": "2023-07-05T19:27:47", "subreddit": "bulimia", "id": "jqsn3tz", "text": "Yes it’s a total mind Fuck. Go listen to the fitness and sushi podcast… they talk all about this. And it’s been really helpful in my recovery. They have tons of episodes about binging and permission based eating and emotional eating etc", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1688613717.0, "datetime": "2023-07-06T03:21:57", "subreddit": "bulimia", "id": "jqufht0", "text": "Just search the key works of the topics I mentioned in my comment . Permission based eating, binge eating, emotional eating. Etc.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1688617089.0, "datetime": "2023-07-06T04:18:09", "subreddit": "bulimia", "id": "jqulhjw", "text": "I’ve farted 😂😂😂", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1689459666.0, "datetime": "2023-07-15T22:21:06", "subreddit": "bulimia", "id": "js4aswm", "text": "Oh god :( OP I’m so sorry. This is my worst fear right now. What store was this? A mom and pop shop? Or a corporate grocery?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1698272935.0, "datetime": "2023-10-25T22:28:55", "subreddit": "EatingDisorders", "id": "k6gjljv", "text": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1698273594.0, "datetime": "2023-10-25T22:39:54", "subreddit": "EatingDisorders", "id": "k6gl7di", "text": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1698284335.0, "datetime": "2023-10-26T01:38:55", "subreddit": "EatingDisorders", "id": "k6hb3g2", "text": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1698286147.0, "datetime": "2023-10-26T02:09:07", "subreddit": "EatingDisorders", "id": "k6hfdvr", "text": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1698289453.0, "datetime": "2023-10-26T03:04:13", "subreddit": "EatingDisorders", "id": "k6hmo5m", "text": "Yeah I forget where I read it but it was a while ago and it was the whole “oh yeah I USED to have eating issues” but the truth of the matter is, that’s a cover up and that’s what a lot of celebrities and influencers are doing now, they say they USED to have an Ed and so they pretend their bodies are naturally emaciated or underweight", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700789481.0, "datetime": "2023-11-24T01:31:21", "subreddit": "AnorexiaNervosa", "id": "kaigbof", "text": "I don’t spend thanksgiving with anyone but the dogs that I dog sit for. I’m a loner. So it’s just me myself and my Ed. I starve, then I eat at night as usual. And no matter what I eat even if it’s all low calorie safe food which is all I allow myself to eat anyway, it’s always too much. It’s hell. I’m sorry", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710194086.0, "datetime": "2024-03-11T21:54:46", "subreddit": "bulimia", "id": "kufk4ci", "text": "Purging is absolutely an addiction for me because it makes me feel empty and it’s a physical and emotional release after I purge and it definitely releases endorphins like drugs. I have lived both sides because I used to take drugs and drink / party and I can honestly say that purging is an addictive behavior and that’s why it’s so hard to stop. If I don’t purge it leaves me feeling full and gross and unable to breathe and I am uncomfortable and angry but when I purge it releases all of that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1715244079.0, "datetime": "2024-05-09T08:41:19", "subreddit": "AnorexiaNervosa", "id": "l397h4s", "text": "I logically know that I’m underweight but I don’t consider myself to be scary underweight because my body is super low body fat so my muscle is very prominent. No one around me seems to be that concerned either so I don’t think it’s an issue. My body fluctuates with water retention and inflammation because of my auto immune issues so 90% of the time I don’t even feel underweight because of how swollen I feel in my body. So I’m always trying to lose weight, I recently feel like I’ve gained and it’s making me spiral. I like the way I feel and look when I am close to my lowest bmi. I don’t look deathly since I have a lot of muslce. So no matter how skinny I get I won’t have that anorexic look I don’t think.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1715900918.0, "datetime": "2024-05-16T23:08:38", "subreddit": "ARFID", "id": "l4dm88s", "text": "I’ve literally taken my safe foods so far and eaten so much of them everyday that I’ve given my body an auto immune allergic type reaction to them and I’ve had to literally cut the foods out. I’m going through it right now and it’s really upsetting and triggering. Nothing feels safe anymore. Especially when you have auto immune issues and SIBO and leaky gut and all the gut issues.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1715900999.0, "datetime": "2024-05-16T23:09:59", "subreddit": "ARFID", "id": "l4dmf7l", "text": "This is what happens to me. I just wrote a comment about it but yeah I have literally triggered my own body to reject the safe foods . And now I’ve had to cut them out of my diet completely. Food doesn’t even feel safe anymore, nothing feels safe", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716347039.0, "datetime": "2024-05-22T03:03:59", "subreddit": "AnorexiaNervosa", "id": "l549p64", "text": "Did you say anything to her about it? I would totally tell her that her underweight body is triggering me.\nI’d love to know her response to that. She’s working in a field full of very impressionable fragile people. It’s very bizarre to be noticely underweight and have an Ed and work with anorexic patients. It’s just not right", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716360109.0, "datetime": "2024-05-22T06:41:49", "subreddit": "AnorexiaNervosa", "id": "l54ww57", "text": "Nothing is over stepping in my opinion. I would literally tell her that the fact that she looks like she has anoreixa herself is really triggering to you. It’s confusing and it’s affecting you. I told my Ed primary care dr that she is underweight and it’s kind of triggering to have a dr who is also underweight and working with anorexic patients. They need to be called out. If it affects you I’m sure there are 20 others it affectd as well", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716845624.0, "datetime": "2024-05-27T21:33:44", "subreddit": "ARFID", "id": "l5xtd8z", "text": "I am absolutely ashamed with the way I eat and the things I do with food and the things I feel safe eating. I do some really disordered things with food and I will never eat around or with others.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718056271.0, "datetime": "2024-06-10T21:51:11", "subreddit": "bulimia", "id": "l80zybd", "text": "I’m very open about it to my therapists but I wouldn’t ever make it “public”. I find that to e\nBe bizarre tbh. Like why would I go on Instagram and willingly let everyone know I’m bulimic? I hate the double standard too when it comes to addiction. It’s obvious I have an Ed. But with drug and alcohol addicts it’s totally accepted to talk about addiction and their life and process but for someone with anorexia or bulimia it’s like taboo. I hate it but I won’t be letting social media in on my privacy like that. Nothing good would come from it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718915109.0, "datetime": "2024-06-20T20:25:09", "subreddit": "AnorexiaNervosa", "id": "l9im0yn", "text": "Yes. Gaining weight is a very visceral and somatic feeling for me. It triggers trauma responses for me. And I have like physical reactions to when my body changes in that direction . Keeps me from ever wanting to recover what so ever", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1720335510.0, "datetime": "2024-07-07T06:58:30", "subreddit": "AnorexiaNervosa", "id": "1dxafqr", "text": "It’s funny how no one in my life shows any concern. I have no friends in real life. I guess I have many acquaintances via social media, but none of that is real. Well I’ve been relapsing hard the last several months and I guess I’ve lost weight. I thought I maintained but I don’t know since I don’t weigh myself. No one in my physical reality shows any concern so it makes me feel like my Ed isn’t that bad. Then I post things on IG and all of a sudden I have two “friends” reach out to me with concern about my weight loss. No body gives a flying fuck about me, until weight loss is in the picture. That’s funny, because I remember when I was a healthy bmi, and my Ed was in such a horrible place, purging, over exercising, self harming, but no one cared then because I looked normal. my family all lives far away and they have no idea how sick I am. And no one around me seems to care either. Im severely depressed and going through some sort of depressive episode. Life seems pointless ", "title": "Nobody gives a fuck until weight loss is involved ", "context": null}
{"type": "comment", "timestamp": 1720346717.0, "datetime": "2024-07-07T10:05:17", "subreddit": "AnorexiaNervosa", "id": "lc0r8u0", "text": "It’s honestly sickening me. The one “friend” who reached out I haven’t heard from in years. But now all of a sudden bc I’ve lost a lot of weight she is soOO concerned. Is it concern or is it jealousy? Or is she just curious? And what is her intention? How can she even help? She can’t. And she’s not a real friend. Until you are sick and deeply ill no one gives a fuck", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720393763.0, "datetime": "2024-07-07T23:09:23", "subreddit": "AnorexiaNervosa", "id": "lc40wc8", "text": "That’s a good point. I can defiantly isolate , but I have actually told my mom that I am struggling with my Ed. I’ve even told her I have bulimia and puke my food. She chooses to hear what she wants to hear. She cares for me obviously but she has no idea how I am actually suffering and she doesn’t know how to help either. I think it just triggered me so much yesterday getting comments from these two old friends because it’s like neither of them get it. And a text from them concerned about my weight loss is far gone. It’s not helpful at this point", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720401896.0, "datetime": "2024-07-08T01:24:56", "subreddit": "AnorexiaNervosa", "id": "lc4laz0", "text": "Yeah… I’m not feeling bitter but it almost reiinforces me just wanting to continue my anoreixa at this intensity because if I gain weight now, my body is on display and people are watching and if they see me gain weight I don’t want comments In that way either. If I god Forbid gained weight and someone said I “look better or healthy” I would lose my fuvking mind . So now I just feel like I want to keep this going", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720403662.0, "datetime": "2024-07-08T01:54:22", "subreddit": "AnorexiaNervosa", "id": "lc4plb8", "text": "Yeah… I am just so easily triggered when it comes to body comments. I used to be in a larger ish body. And I never ever ever want to go back there. I’m happy being underweight and anorexic compared to how I felt back then. So if someone were to comment on my body if I gain a few lbs, game over. I would have a fuckkng nervous breakdown", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720407948.0, "datetime": "2024-07-08T03:05:48", "subreddit": "AnorexiaNervosa", "id": "lc4zo4s", "text": "Ugh… there’s a lot there . A lot of trauma and a lot that would need to be worked on in therapy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720486437.0, "datetime": "2024-07-09T00:53:57", "subreddit": "AnorexiaNervosa", "id": "lca53b7", "text": "That’s the problem with anorexia treatment. Same thing happened to me in 2005, I was very young but they porked me up and that was the goal. I left with aBSOLUTLEY no mental health tools, I was so uncomfortable, now I have truama when it comes to weight gain", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721864390.0, "datetime": "2024-07-24T23:39:50", "subreddit": "bulimia", "id": "lesgx0q", "text": "Time to leave your husband. He sounds like a manipulative ignorant fuck. I’m sorry.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721898532.0, "datetime": "2024-07-25T09:08:52", "subreddit": "bulimia", "id": "leuel58", "text": "Yeah that’s literally insane. I don’t think that’s good customer service at all.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722305624.0, "datetime": "2024-07-30T02:13:44", "subreddit": "bulimia", "id": "lfl6h9s", "text": "That’s how I feel often. Last night I actually didn’t purge because I had severe GI issues. Diarrhea literally all night and I was so exhausted from using the bathroom that I literally just didn’t feel the need to purge. But I often times feel so tired of purging", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724635954.0, "datetime": "2024-08-26T01:32:34", "subreddit": "AnorexiaNervosa", "id": "ljy4mdn", "text": "Harm reduction does exist. Recovery isn’t an option for everyone, financially, resources wise, trauma, etc.  I won’t go to inpatient again because it caused more Ed issues and mental issues for me and treatment trauma. So I am in a middle place. I’m not in the worst part of my anorexia and not my LW, close but I’m still able to eat, work, take care of things. And I don’t WANT to be my LW, so there’s that. I also don’t want to gain weight so I’m obviously active in my anorexia but it could be worse. I also focus on nutrient dense foods, supplements, protein, etc", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725694682.0, "datetime": "2024-09-07T07:38:02", "subreddit": "bulimia", "id": "llxapn9", "text": "How though", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726128111.0, "datetime": "2024-09-12T08:01:51", "subreddit": "ARFID", "id": "lmqglab", "text": "Can’t really open my eating window until late late night. I eat the same list of about 4-5 things everyday. I eat things that make my colitis flare up and can’t stop. I consume tons of sugar free pudding, it’s one of the only things that feels truly safe anymore. I consume a lot of weird things. Concoctions. Gelatin. Sugar free jello. Idk anymore.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726138183.0, "datetime": "2024-09-12T10:49:43", "subreddit": "ARFID", "id": "lmqvdjx", "text": "Yeah… it really is. This disorder is exhausting and sometimes I just have to embrace my fucking insanity and the fact that I’ll never be normal with food", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726475450.0, "datetime": "2024-09-16T08:30:50", "subreddit": "AnorexiaNervosa", "id": "lndpwk3", "text": "This is so heart warming. I thought his comment was going to be detrimental. Thank you for sharing this story", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727242793.0, "datetime": "2024-09-25T05:39:53", "subreddit": "bulimia", "id": "lotahmi", "text": "Was anorexic first. Then forced impatient where I was forced to gain an insane amount of weight in a short period of time. Then the next 12 years of my life was just me trying to lose weight/ bingeing/ exercise bulimia. Then I finally started purging in my early/ mid 20s as a way to lose weight obviously and then it just spiraled over the years and now I have anorexia with purging subtype.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727730468.0, "datetime": "2024-09-30T21:07:48", "subreddit": "bulimia", "id": "lppn4ql", "text": "Telling me now I have to purge even a normal amount of food or small meal because if I don’t I’ll gain weight?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728367621.0, "datetime": "2024-10-08T06:07:01", "subreddit": "bulimia", "id": "lqwg0y2", "text": "Why is it so fucked up to purge it ? :( is there something in harm reduction that could lessen the severity of purging nut butter?", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1730419752.0, "datetime": "2024-11-01T00:09:12", "subreddit": "bulimia", "id": "1ggswcn", "text": "I know how idiotic I sound here, I’m fully aware. But at this point, the only way to stop purging is to eat less. Eating causes me to purge. The only way to combat the purging is to eat less so I am not tempted to purge. And since I have anorexia that’s a fucking stupid way to combat this. Anorexia with purging subtype is a special kind of hell and it’s a confusing place to be where I feel like I am an anorexic food addict. Nothing feels safe anymore, even my safe foods. I only eat safe foods and things that I consider safe, it doesn’t fucking matter, I will still purge those foods because I eat too much. There is no fucking winning and I’m so frustrated I mine as well just give up and accept that this will be my life forever ", "title": "Restriction is the only cure for purging for me ?", "context": null}
{"type": "comment", "timestamp": 1730426347.0, "datetime": "2024-11-01T01:59:07", "subreddit": "bulimia", "id": "lusn954", "text": "Ugh man.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730426387.0, "datetime": "2024-11-01T01:59:47", "subreddit": "bulimia", "id": "lusncq1", "text": "Pretty much. I can go long periods of time without eating but I actually need to eat at some point like I can’t just fast for days at a time. It’s just so fucking chaotic when I have to eat", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730426416.0, "datetime": "2024-11-01T02:00:16", "subreddit": "bulimia", "id": "lusnfeb", "text": "I try to nourish as best as I can. The thing is, I’ll eat, then purge, then eat something again, then purge. It’s fucking so stupid", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730426435.0, "datetime": "2024-11-01T02:00:35", "subreddit": "bulimia", "id": "lusnh5h", "text": "It sucks, nothing feels safe anymore if I am even compulsively eating my safe foods.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730426489.0, "datetime": "2024-11-01T02:01:29", "subreddit": "bulimia", "id": "lusnm1j", "text": "I take an insane amount of supplements, tinctures and a variety of digestive enzymes. I’m super into all of that already. I’m basically doing my eating disiorder in the “healthiest” way possible. I already drink electolyes and take minerals and stuff.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730428057.0, "datetime": "2024-11-01T02:27:37", "subreddit": "bulimia", "id": "lusriru", "text": "I mean… I’m purging my safe foods. I am not eating anything outside of my safe foods. But the amounts I am eating is I guess too much even though I have anorexia. I eat volume amounts of low cal safe foods and purge. So I’m damned if I do eat and nourish myself. And I’m damned if I don’t.  The only thing I don’t need to purge is sugar free pudding or protein fluff that I make. But when I eat solid food in a normal sized meal, I’m going to end up purging.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730431265.0, "datetime": "2024-11-01T03:21:05", "subreddit": "bulimia", "id": "lusz906", "text": "🩵🩵🩵🩵", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730431272.0, "datetime": "2024-11-01T03:21:12", "subreddit": "bulimia", "id": "lusz9kd", "text": "🩵🩵🩵", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730431377.0, "datetime": "2024-11-01T03:22:57", "subreddit": "bulimia", "id": "luszi5i", "text": "Oh my god that’s so true because Ozempic just completely lowers appetite. It’s basically just giving people “will power” to not eat. And that’s what causes the weight loss. It’s basically anorexia in an injection. It’s like… when I eat tiny portions of things I obviously don’t feel the need to throw up. But eating for me is never eating small portions. I have anorexia but I eat volume amounts of my healthy orthorexic foods. If I just ate a small portion of food once or twice a day I would be even more anorexic than I already am. So what the fuck am I supposed to do.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730443154.0, "datetime": "2024-11-01T06:39:14", "subreddit": "bulimia", "id": "lutjzv4", "text": "Yep. I go hours and hours without food no problem.but once I have opened my eating window and I can’t procrastinate nourishing myself any longer, it’s fucking chaos. Once I start eating my safe foods, I just want to continue eating them. And sure, it’s not a “binge”, but I feel like I am eating too much, so it results in purging every single night, I feel so trapped like nothing I do will ever make this stop", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730443758.0, "datetime": "2024-11-01T06:49:18", "subreddit": "bulimia", "id": "lutku5r", "text": "It’s comforting knowing I’m not the only one in this predicament. It sucks and it makes me feel so fucking crazy like there is no coming back from this .eating has become a trauma I have to go through every day", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730445280.0, "datetime": "2024-11-01T07:14:40", "subreddit": "bulimia", "id": "lutmxwo", "text": "Ugh. This is upsetting to hear. I’ve been in the nightly purging cycle for over a year and a half pretty much. But lately it’s been getting up to 3 purges a night and i can’t fuvking imagine living like this for 14 years. Even just getting myself down to just one purge a night would be progress. And whenever someone says the solution is to just eat more during the day, like no, that isn’t the solution. Because when I’ve tried to do an earlier eating time it just means I eat more and purge more and there’s more hours of damage I do to myself. So I try to wait until the last few hours of being awake to eat", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730446735.0, "datetime": "2024-11-01T07:38:55", "subreddit": "bulimia", "id": "lutowob", "text": "It’s one big paradox for me. And I’m sure for you too. To combat bulimia with anorexia. It’s like no matter how much of my safe foods I eat it’s never enough. Even if I’m full, I want to eat more because of the mental and physical starvation. So when I finally do eat, it’s just chaos.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730447566.0, "datetime": "2024-11-01T07:52:46", "subreddit": "bulimia", "id": "lutq134", "text": "There is never going to be any kind of normal for me. It’s been 16-17 years of this shit. But the last 3 years has been the most intense with the restricting and purging. Some nights I wish I could just be like hard core anorexics who just go to bed starving but I actually do want to eat. I want to eat and eat in a peaceful way. But once I eat it’s game over. The chaos and purging is bound to happen. I’m so tired right now and I haven’t eaten yet and I’m just dreading what’s about to come", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730455653.0, "datetime": "2024-11-01T10:07:33", "subreddit": "bulimia", "id": "luu1ggn", "text": "I’ve been on many meds in my teens and 20s . It’s not for me. I do other holistic things like micro dose which helps a lot with my depression, but I’m glad the Prozac works for you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730495407.0, "datetime": "2024-11-01T21:10:07", "subreddit": "bulimia", "id": "lux5w9j", "text": "I’m surprised so many people are in the same predicament as me. But it’s comforting. I’m sorry tho because this sucks", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730597046.0, "datetime": "2024-11-03T01:24:06", "subreddit": "AnorexiaNervosa", "id": "lv414wk", "text": "I eat the same circulation of foods every single night yes", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1730780002.0, "datetime": "2024-11-05T04:13:22", "subreddit": "AnorexiaNervosa", "id": "1gjybiw", "text": "Some days, very rarely, I will be hit with a string of days or a day where I feel literally high from my anorexia. But I know deep down it’s because I am deep in the addiction of the ED. When I feel my clothes fitting looser, when I see my body getting smaller it’s the only thing that truly gives me this drug like high. I’m not proud of this, but I know it’s stemming from addiction. As folks with Ed’s we are in an active addiction, just not to a substance, we’re addicted to feelings and sensations and habits and behaviors. Sometimes I even think I am a food addict, like I’m “addicted” to my healthy low calorie sugar free orthorexic safe foods, but is it really food addiction or is it actually because my body and mind are starved and malnourished. So when I do finally work myself up to eating, it makes me feel high too. Like the safe foods make me feel high. It feels like I enjoy food too much even if it’s low grade stupid safe foods that any normal person would not enjoy whatsoever.  Eating has become something I dread and simultaneously look forward to as if it’s the highlight of my day while it’s also the darkness of my night because eating comes with chaos and panic and discomfort and purging and overwhelm. It’s like nothing I do has any outcome of winning. I try to eat more and that backfires into potential weight gain and purging. I starve myself more and that gives me a false high and euphoria because of the addiction. Some days I am completely obsessed and fixated on food and what foods I want to eat or could eat and some days I have no hunger and food isn’t on my mind at all. The highs and lows are similar to bipolar or Borderline personality disorder ", "title": "The anorexia euphoric high ", "context": null}
{"type": "comment", "timestamp": 1730781316.0, "datetime": "2024-11-05T04:35:16", "subreddit": "AnorexiaNervosa", "id": "lvh29mt", "text": "Yes. Same for me… except I don’t weigh myself so I base my weight off clothing and how I feel/ look etc. I’m also addicted to restricting, using the sauna, walking, purging. Sometimes I feel like I’m addicted to the process of eating as well.\nLike even tho I’m anorexic I am literally addicted to eating? It feels so fucking insane to explain this to someone because no one gets it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730781507.0, "datetime": "2024-11-05T04:38:27", "subreddit": "AnorexiaNervosa", "id": "lvh2pmv", "text": "Exactly! I have lived through substance abuse and addiction and I am easily and effortlessly sober. But the anorexia and bulimia are engrained in my body and brain. It’s not going anywhere. You’re absolutely right as it’s a way to cope as well and a way for me to regulate my emotions and depression/ anxiety / trauma etc", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730782323.0, "datetime": "2024-11-05T04:52:03", "subreddit": "AnorexiaNervosa", "id": "lvh4l0y", "text": "Ugh yeah the way you just worded that is very poetic and i resonate with that. It’s like a deeply codependent relationship with the Ed. It’s an entity. It shows love and hate and I need it in order to function but it’s also very destructive", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730785545.0, "datetime": "2024-11-05T05:45:45", "subreddit": "AnorexiaNervosa", "id": "lvhbbo2", "text": "LOL!! I relate to this so hard. I am SO TRIGGERED by the liars in the influencer space. There’s so many full blown anorexic girls in the “health” and wellness space and girls who are all about intermittent fasting and carnivore but deep down they are fucking just full blown Anorexic and trying to do anything they can to be as skinny as possible. Like just admit you have an Ed. It’s almost easier to like someone if they just admit to having anorexia rather than covering it up with “ibs” or crohsn or whatever the fuck. I’d have more respect for someone who just says they have an Ed rather than painting it as a thing like crohns. Drives me fucking insane", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730788011.0, "datetime": "2024-11-05T06:26:51", "subreddit": "AnorexiaNervosa", "id": "lvhfujt", "text": "This is true. First round of my anorexia was in high school. I became very ill and on the brink of death, everyone was concerned, forced inpatient, gained a fuck load of weight and then no one gave a shit anymore. I had an Ed all through my teens and 20s when I was in a normal body bmi, my highest weight was when I was the most miserable. Now I am close to my LW, and I’m wondering, when will people show concern. No one around me seems to care but I’m also not around family, so I guess people just don’t care. I am addicted to being a certain size, and feeling a certain way in my body. It’s truly like drugs.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730863127.0, "datetime": "2024-11-06T03:18:47", "subreddit": "AnorexiaNervosa", "id": "lvn24q6", "text": "🥹🩵", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730957941.0, "datetime": "2024-11-07T05:39:01", "subreddit": "AnorexiaNervosa", "id": "lvuqfob", "text": "I love writing. I used to write articles and blog posts for a very well known online publication. I don’t really write anymore other than here on Reddit", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730962674.0, "datetime": "2024-11-07T06:57:54", "subreddit": "bulimia", "id": "lvuz9ee", "text": "Oh my god. Were you super young when you got caught?? Was jr just blatantly obvious you were stealing ?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730969133.0, "datetime": "2024-11-07T08:45:33", "subreddit": "bulimia", "id": "lvv9o52", "text": "Ugh yeah. I’m a klepto. I know deep down I am a good person and I’m not hurting anyone but I still feel the shame and guilt", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731017859.0, "datetime": "2024-11-07T22:17:39", "subreddit": "bulimia", "id": "lvz5yfo", "text": "I don’t think we are horrible people for stealing. There are worse things we could do. We aren’t hurting anyone and yeah you’re right about the bit Corp thing. If they were really worried about theft then they would hire more people and not have self checkout", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731017929.0, "datetime": "2024-11-07T22:18:49", "subreddit": "bulimia", "id": "lvz673p", "text": "Safety.. and it’s also sort of an addiction at this point. Addiction to high chemicals in brain too", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731622144.0, "datetime": "2024-11-14T22:09:04", "subreddit": "bulimia", "id": "lx5qzjc", "text": "Yeah… this is how mine manifests. I don’t binge though… I just eat. Then purge. Then eat again because I have room to eat. I have anorexia purging subtype so I can relate to that cycle. It usually will last 4-5 hours maybe. Usually I purge twice a night with eating in between. But I always eat after the 2nd purge , usually some protein or some sugar free pudding or something. I can’t go to bed with a completely empty stomach", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732603328.0, "datetime": "2024-11-26T06:42:08", "subreddit": "bulimia", "id": "lz1ehrh", "text": "Yup. I dread it but once I am finished I feel a lot better and relieved. The feeling I get when I am done eating my main meal and way too full and need to purge, I’m always scared it’s going to be really challenging or everything’s not gonna come out easily.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732619762.0, "datetime": "2024-11-26T11:16:02", "subreddit": "bulimia", "id": "lz245ng", "text": "Ugh. You’re not alone", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732748449.0, "datetime": "2024-11-27T23:00:49", "subreddit": "bulimia", "id": "lzbjsah", "text": "Didn’t you just post this yesterday ?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732758311.0, "datetime": "2024-11-28T01:45:11", "subreddit": "ARFID", "id": "lzc9pyi", "text": "I don’t celebrate it. I don’t do anything with anyone. I don’t submit to the stupidity that society makes this holiday. It’s a gluttony holiday and serves no purpose other than food and “family” and drinking and getting fucked up. I have no friends or family where I live. I’m happy to be alone and just eat the same shit I eat everyday. Same shit different day :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732844128.0, "datetime": "2024-11-29T01:35:28", "subreddit": "ARFID", "id": "lzhux70", "text": "I don’t even celebrate it or do anything with anyone. It’s literally one day. It’s one meal. It’s over tomorrow and no one gives a shit about the holiday", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732848550.0, "datetime": "2024-11-29T02:49:10", "subreddit": "ARFID", "id": "lzi552k", "text": "At the end of the day you’re an adult. You can choose to engage in whatever holidays you want or don’t want. End of story, if they can’t handle it that’s on them. There’s 365 days in the year. Can they not connect with you on any of the other days", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732850057.0, "datetime": "2024-11-29T03:14:17", "subreddit": "ARFID", "id": "lzi8mbp", "text": "I’m not being ignorant. But okay. Im just saying if it really traumatizes you so much to engage in thanksgiving dinner there are other options. Good luck to ya!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733023231.0, "datetime": "2024-12-01T03:20:31", "subreddit": "AnorexiaNervosa", "id": "lztfye5", "text": "For me it’s not always that easy to just choose to eat. This is so engrained in my body and mind and being. It’s engrained in me and my mind. I also have colitis and other autoimmune gut disorders and it plays a huge role in my anorexia. And when my body reacts to even my safe foods or if I god forbid feel a tiny bit of weight gain, I complete spiral.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733255968.0, "datetime": "2024-12-03T19:59:28", "subreddit": "AnorexiaNervosa", "id": "m0939qq", "text": "Yes… it’s an addiction and can become euphoric", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733877026.0, "datetime": "2024-12-11T00:30:26", "subreddit": "AnorexiaNervosa", "id": "m1g5r49", "text": "I feel seen and heard. The amount of safe foods I have hoarded in my cupboards and drawers and even on the top of my kitchen shelves is insane. Feels good not being the only crazy one", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734472776.0, "datetime": "2024-12-17T21:59:36", "subreddit": "AnorexiaNervosa", "id": "m2k9jqw", "text": "I could have written this word for word. I feel content and happy in my anorexic body but if I’m around family for some reason, I will cover up. Before my anorexia relapse I was chubby in my opinion and I couldn’t even handle wearing leggings without having to put a flannel around it. I wojkd have nervous breakdowns because I felt like I was wearing a fat suit, I feel so much more comfortable in my underweight body. I can wear leggings now and just walk around. I’m not pro ana but I am for myself I guess because I truly am happier in my anorexic body.the one thing that sucks is how visibly sick I am now and I teach yoga and some students will look at me in a way that I know is not good . Chest bones and legs look very sickly and there’s no hiding it unless I wrap a flannel around my waiste and wear some sort of tank top that covers chest", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734654315.0, "datetime": "2024-12-20T00:25:15", "subreddit": "AnorexiaNervosa", "id": "m2wpp7n", "text": "I’ve never heard this take before but it makes me sick . This country is fucked", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734855190.0, "datetime": "2024-12-22T08:13:10", "subreddit": "bulimia", "id": "m39apdj", "text": "I’m so very sorry for your loss. Was it health complications directly linked to her ED? I’m so sorry you’re going through this. We’re all here for you. My inbox is open", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736152551.0, "datetime": "2025-01-06T08:35:51", "subreddit": "AnorexiaNervosa", "id": "m5o4dtz", "text": "Oh hun. No. If that was the case world hunger would end and there wouldn’t be anyone in the world who is starving and malnourished and dying", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736999330.0, "datetime": "2025-01-16T03:48:50", "subreddit": "bulimia", "id": "m7e8sz1", "text": "Never thought to shake or jump. I drink hot drinks or fizzy. Sometimes I’ll do some twists. Now I want to invest in one of those tiny lymphatic drainage trampolines but have no clue where the fuck I would fit that in my shoebox apartment", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737964409.0, "datetime": "2025-01-27T07:53:29", "subreddit": "AnorexiaNervosa", "id": "m9f3xdh", "text": "I hate how intervention has like 4 ed episodes. They literally have none!  It’s a disgrace. It’s all about meth and heroin. It’s the same shit every episode. It would be nice to see other types of addictions like Ed’s.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738575494.0, "datetime": "2025-02-03T09:38:14", "subreddit": "bulimia", "id": "mapn155", "text": "I relate so fuckinf hard, I am an anorexic volume eater with purging. I need to eat volume amounts of food to feel full, and then I feel too full and purge. But if I were to eat a small portion of food I would still be hungry. I am UW and utterly malnourished so I feel like the volume rating goes along with that but I am also addicted to eating volume amounts of my safe foods. I don’t understand how people can eat such small portions either. It blows my mind and it makes me feel like a monster and so much shame and guilt with how much I eat.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738739907.0, "datetime": "2025-02-05T07:18:27", "subreddit": "ARFID", "id": "mb2j9eq", "text": "Can you bring your food on a nice tray and bring to your room? Fuck that noise", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738760091.0, "datetime": "2025-02-05T12:54:51", "subreddit": "ARFID", "id": "mb3j2ds", "text": "I’m sorry…. You pay rent right?? Who makes the rules of no eating in your room?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738840274.0, "datetime": "2025-02-06T11:11:14", "subreddit": "bulimia", "id": "mb9vn68", "text": "I feel like a shell of a human. I can relate", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740036637.0, "datetime": "2025-02-20T07:30:37", "subreddit": "AnorexiaNervosa", "id": "mdrm4vd", "text": "Yeah I could have written this word for word. I have headaches more often now, I am angry, I have a short fuse, I get so fuckinf upset when things happen. I’m exhausted but can’t sleep. I’m fatigued. But I’m also not willing to “recover” because I don’t even believe in recovery. I believe I can live in harm reduction and maybe find a lesser intense version of my ED but I am not willing to gain weight what so ever and I will do anything and everything to make sure I maintain my current weight. If I feel like I’m gaining, I freak the fuck out", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740038252.0, "datetime": "2025-02-20T07:57:32", "subreddit": "ARFID", "id": "mdrow69", "text": "I used to love smoked salmon. I haven’t eaten it in a long time and needed to eat a package I had in my fridge before it expired. I was eating it and I literally could not stomach the texture and taste. So I chewed and spit it because I still wanted to feel like I ate it but I didn’t want to swallow it. Obviously very disordered of me. Seems like my safe foods have dwindled down to a list of 5 things", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1741831966.0, "datetime": "2025-03-13T02:12:46", "subreddit": "AnorexiaNervosa", "id": "mhhy02p", "text": "It comes from a deep sense of either trauma or abaondment or betrayal. Your soul is desperate for attention or love or care and you think that being emaciated is what’s going to get you that…", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742544415.0, "datetime": "2025-03-21T08:06:55", "subreddit": "AnorexiaNervosa", "id": "mixuyia", "text": "Yeah this is the pure and utter ignorance of people who just don’t realize how detrimental their fucking words can be and how it can literally cause us to become worse in our Ed’s. I had to stay at my uncles a few years ago for a few days, and it was a fucking nightmare. He commented on how huge my salads were, he complained and made fun of me about how it smelled, how late I was eating, he just could not handle being in front of me while I was eating without making constant remarks.\nIt got to the point where I had to literally call him out and say “ the comments about my food need to stop”. And he was shook when called\nHim out. Like it blows my fucking mind someone could actually think it’s appropriate to comment on the dynamics of someone’s meal.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1742561434.0, "datetime": "2025-03-21T12:50:34", "subreddit": "AnorexiaNervosa", "id": "1jgg25x", "text": "EDIT: I’m in no way shaming people with obesity for using glp1 meds. It’s actuwllt\nIncredible that they have these meds to help\nFolks who have obesity.  My issue is with the people who don’t have obesity but they are somehow getting these drugs and losing tons of weight and it’s just enforcing Ed behaviors and lifestyle for them. Tons of woman in Hollywood, probably hundreds of thousands of  people who don’t have much weight to lose at all, but they are becoming sick and ill both physically and mental from these drugs. Hence why I labeled it as Anorexia in an Injection. \n\noverweight or obese people are taking ozempic and other glp1s and they are saying all their food noise and food obsession has lifted and just gone away. Isn’t that nice? Meanwhile, All of us idiots with anorexia are just raw dogging it because well, it’s a fucking real mental illness. But now people are paying to inject themselves with drugs to help them basically form anorexic tendencies \n\n Having an Ed  is misery. But society now glamorizes it and everyone wants to low key be anorexic now. Cool. What I would do for my food noise and obsession to go away. How life would be so different. But of course we can’t be on these drugs because we don’t need to lose weight obviously… but wouldn’t it be cool if they could make a drug for food noise to go away regardless of weight ", "title": "Ozempic is just anorexia in an injection except better", "context": null}
{"type": "comment", "timestamp": 1742590079.0, "datetime": "2025-03-21T20:47:59", "subreddit": "AnorexiaNervosa", "id": "mj1fdkd", "text": "Agreed", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742596552.0, "datetime": "2025-03-21T22:35:52", "subreddit": "AnorexiaNervosa", "id": "mj1zmih", "text": "Ew. wtf lmao. High horse? For having a severe mental illness and being low key jealous of people using Ozempic… high horse bullshit", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742597314.0, "datetime": "2025-03-21T22:48:34", "subreddit": "AnorexiaNervosa", "id": "mj21xkf", "text": "I’m right there with you…. I’ve had Ed’s for 20 years. I’m deep deep in my Anorexia again and when we become underweight and malnourished, food focus and food obsession is normal. Im amazed that this medication can turn off food noise. But im not sure how it would work for anorexics who are physically malnourished. I am the same exact way. I literally starve myself all day and night and I can’t let myself eat until a couple hours before bed. Because I can’t handle a long eating window, I can’t trust myself", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742602499.0, "datetime": "2025-03-22T00:14:59", "subreddit": "AnorexiaNervosa", "id": "mj2h66j", "text": "It’s not about “being happy” for them. That’s great they are using something that works. I’m just saying it would be cool to have something to help folks with Ed’s to lower the food noise. You know the experience of anorexia yourself, it sucks to be completely mentally ill around food", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742623040.0, "datetime": "2025-03-22T05:57:20", "subreddit": "AnorexiaNervosa", "id": "mj3tckp", "text": "Right… there are thousands and thousands of claims that it turns off food noise and obsession. And overall makes people eat less. (Because of satiety sure,) but this is also doing work in the brain and it’s also being used for addictions. So I do truly think it can just zap away hunger and food focus", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742676607.0, "datetime": "2025-03-22T20:50:07", "subreddit": "AnorexiaNervosa", "id": "mj7eeuh", "text": "Yes.. that’s what I was meaning but people love to twist and turn words here on Reddit . I’m not shaming obese or overweight people for using the medication. But there’s a huge abuse of the medication as well, even in overweight folks, or people who don’t have weight to lose", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742676649.0, "datetime": "2025-03-22T20:50:49", "subreddit": "AnorexiaNervosa", "id": "mj7ejht", "text": "I can confirm that therapy doesn’t help with food noise but okay. Haha. To each their own", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742717877.0, "datetime": "2025-03-23T08:17:57", "subreddit": "bulimia", "id": "mja3g9l", "text": "This is why support and meetings and community is so important. Go to Ed recovery meetings, they’re all free. EDA, OA, anorexics bulimics anonymous. Also all the Ed orginzarions like MEDA, EDF, ANAD and alliance for Ed hold free zoom meetings everyday / week. Tons of them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742808229.0, "datetime": "2025-03-24T09:23:49", "subreddit": "AnorexiaNervosa", "id": "mjg99p4", "text": "I feel like having anorexia as an adult, you don’t really have a choice but to be high functioning. I’m single, no relationship, no kids, no family around or  room mates (thank god cuz I hate living with people). But no one is going to help me, I had to move apartments all by myself. No one could help. It was fucking stupid. I keep injuring myself because my body is so malnourished and weak but no one is around to help. But I have no choice but to work, grocery shop, clean, laundry, errands, appointments. It sucks", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742957041.0, "datetime": "2025-03-26T02:44:01", "subreddit": "AnorexiaNervosa", "id": "mjrsm9d", "text": "Yeah it works on the fullness receptor of the brain. But if someone already is super disordered and wants to basically become anorexic and get super skinny they can use Ozempic as fuel to fuel the fire if that.theyll use it for the physical and emotional side effects and use that as fuel to starve and maybe placebo too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743233546.0, "datetime": "2025-03-29T07:32:26", "subreddit": "bulimia", "id": "mkbnmoe", "text": "It doesn’t really sound like this is sustainable and it’s not like you’re doing it out of fear of weight gain so I don’t dealt know what’s stopping you from getting treatment. Like go to inpatient.\nYou’re like the perfect candidate.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745058290.0, "datetime": "2025-04-19T10:24:50", "subreddit": "AnorexiaNervosa", "id": "mnwm8dt", "text": "Yes holy shit yes… sadly, and I’ve even explained this to my therapist. That getting underweight has actually made my mental health better because I’m not in this constant panic mental breakdown feeling swollen and having visceral reactions to the way my body feels, seeing my body in the mirror etc. I used to have to wear leggings and a long sleeve shirt and a flannel around my waiste when I taught hot yoga. Now I can wear leggings and walk around the room and not feel like I’m going to have a severe nervous breakdown. Like… I truly felt worse when I was a normal bmi, I couldn’t function. I probably sound like an idiot but yeah…. Being underweight has made my body image issues way better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745552797.0, "datetime": "2025-04-25T03:46:37", "subreddit": "AnorexiaNervosa", "id": "mowvmfy", "text": "Used to be a fear food for me and now it’s like one of my only safe foods. Things can change. Ed’s are insane", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1746102447.0, "datetime": "2025-05-01T12:27:27", "subreddit": "bulimia", "id": "1kc7haa", "text": "You know what’s fun? When you’ve finished eating and it’s time to purge but then your colitis starts to flare up at the same time and you have to also go diarrhea. But you want to purge first because if you shit and then purge you will face the possibility of shit remnants in the toilet bowl coming back at your face.   This disorder is so fucking vile but I cannot sit with food in me like this ", "title": "Needing to puke and shit at the same time", "context": null}
{"type": "comment", "timestamp": 1746231010.0, "datetime": "2025-05-03T00:10:10", "subreddit": "bulimia", "id": "mqahqm5", "text": "It’s happened to me. Especially because of my fucking colitis and when I’m flaring up it’s always after I eat anyway so it’s shifting and puking every night . So fun", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746256108.0, "datetime": "2025-05-03T07:08:28", "subreddit": "AnorexiaNervosa", "id": "mqc2010", "text": "When I look at other women’s bodies who are normal BMI and not underweight, I think they look great and lovely. But when I was a healthy bmi I felt absolutely disgusting and couldn’t handle it. My sensory issues went insane, my physical and mental discomfort made me unable to function in a normal bmi body. So it’s like I accept bodies of all kinds but for me, I don’t look right or feel good when I’m a normal weight so I basically just have to stay underweight in order to feel sane. When I was chubby and healthy bmi I had panic attacks and nervous breakdowns and self harmed and I was in a worse state of mind even though I looked healthier", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746928711.0, "datetime": "2025-05-11T01:58:31", "subreddit": "AnorexiaNervosa", "id": "mron6xz", "text": "She’ll crash eventually. Her body could be high on ketones but eventually she will feel like shit. Don’t worry", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1752306073.0, "datetime": "2025-07-12T07:41:13", "subreddit": "AnorexiaNervosa", "id": "n2oyqcr", "text": "Yeah. I relate the only time I can relax is when I have conpletler exhausted myself. Starving myself literally is an addiction to the euphoria and the emptiness and the feeling of calm. But it’s fake . It’s actually just the body giving out and reaching a level of burnout and fatigue. I feel I need to find some balance of an in between place of still being starved enough to be calm but not eat enough to feel overly energetic because that will just spiral me too", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1752978342.0, "datetime": "2025-07-20T02:25:42", "subreddit": "AnorexiaNervosa", "id": "n43mcdh", "text": "Yes and It’s gotten to the point where I am now having to cover up certain parts of my body, even tho I live in the hottest climate right now, but chest area looks scary even to me. I wish I could just gain weight in my chest bone area. But whenever I gain it goes right to stomach legs or arms. Never chest . Makes  me fucking furious", "parent_id": null, "link_id": null, "context": null}
