{"type": "comment", "timestamp": 1614909735.0, "datetime": "2021-03-05T02:02:15", "subreddit": "AnorexiaNervosa", "id": "gpq63iq", "text": "Excuse the language:\n\nWhat the actual fuck? Like what were they expecting, it’s soo disrespectful. They don’t know how much shit emotions it can bring up. Good on you for being able to open up, takes strength 👏👏👏", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614909891.0, "datetime": "2021-03-05T02:04:51", "subreddit": "AnorexiaNervosa", "id": "gpq6e5t", "text": "Please just shut up, for everyone’s sake", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614910367.0, "datetime": "2021-03-05T02:12:47", "subreddit": "AnorexiaNervosa", "id": "gpq7ano", "text": "Welcome bro", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614910762.0, "datetime": "2021-03-05T02:19:22", "subreddit": "AnorexiaNervosa", "id": "gpq81kc", "text": "Sorry, but I’m not the only one seeing how fucked up your comments are. Calling someone who has such a fragile mind who already has to fight their image doesn’t need another tosser on the internet behind a screen fuelling it. If your comment was “right” explain why it has negative votes????\n\nYes it is silencing, hearing comments like you’re are so dangerous and I want them to stay out of hospital and actually be healthy", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614910997.0, "datetime": "2021-03-05T02:23:17", "subreddit": "AnorexiaNervosa", "id": "gpq8hza", "text": "To be heartless and rude, I can agree. Yes I an heartless, yes I am rude. But I am also wise and sympathetic and use a filter when I need to, to protect people. Right now it’s defending so no filter is needed", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614911839.0, "datetime": "2021-03-05T02:37:19", "subreddit": "AnorexiaNervosa", "id": "gpqa44o", "text": "Is that all you got, that’s such a primary school reply", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614911952.0, "datetime": "2021-03-05T02:39:12", "subreddit": "AnorexiaNervosa", "id": "gpqac26", "text": "Where the fuck did a panic attack come from", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614912520.0, "datetime": "2021-03-05T02:48:40", "subreddit": "AnorexiaNervosa", "id": "gpqbfb6", "text": "I’m asexual fo how the fuck do I have a crush on you?\nHow much do you think I weigh?!?!?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614913432.0, "datetime": "2021-03-05T03:03:52", "subreddit": "AnorexiaNervosa", "id": "gpqd4cs", "text": "What species, let’s be specific here?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615121183.0, "datetime": "2021-03-07T12:46:23", "subreddit": "bulimia", "id": "gq3cd93", "text": "Well done 👏 baby steps, it’ll take time but you’ll eventually walk a mile and appreciate the view.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615348725.0, "datetime": "2021-03-10T03:58:45", "subreddit": "bulimia", "id": "gqesemp", "text": "I’ve gone past that point, I’m still practically at my lowest but eat what I want without gaining and I love it. I treasure purging and keep it sacred. My reflex is weak: it works really well but it’s easy to wear it out so can’t do it often. Though I’m not binging as much so I don’t really need to", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615348801.0, "datetime": "2021-03-10T04:00:01", "subreddit": "bulimia", "id": "gqesizp", "text": "“You can’t recover and still be underweight”\n\nThen I don’t want to recover and that’s that", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615366983.0, "datetime": "2021-03-10T09:03:03", "subreddit": "AnorexiaNervosa", "id": "gqff6ox", "text": "Feeling full makes me feel gross so it’s *fantastic* that I have anorexia. \n\nOne of my favourite singers, Alec Benjamin, said in one of his songs:\n\n‘The only way I know that I’m alive it’s cause it hurts. So anything that takes away my pain will makes it worse.’", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615367652.0, "datetime": "2021-03-10T09:14:12", "subreddit": "AnorexiaNervosa", "id": "gqffxxy", "text": "That’s what tipped my anorexia over the edge. Counsellors came into my house and into my space to tell me: I can’t have 3 pieces of bread, only two and there was too much topping on them and I can’t hide it and told my family’s bout it. Then everyone came in to ‘have a look’. I got criticised and it was bad that I added chicken, sweet corn and extra cheese onto a pizza for lunch. Of course I was given the *look* and was said that I can’t have that much for lunch.\n\nJokes now on them because 2 months later they were begging me to eat an apple and they have to take me to clinics all the time.\n\nWeighing it up (no pun intended) it seems far easier and more time efficient to let it happen. Rather than waste 5 hours each week", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615384274.0, "datetime": "2021-03-10T13:51:14", "subreddit": "AnorexiaNervosa", "id": "gqg0zzx", "text": "Have you heard of nf, that hits a whole other level of deep. Must see songs are:\n\nIf you want love (most relatable)\nLie (most friendless)\nLike this (most doubles)\nRemember this (most meaningful)\nLet me go (bluest)\nParalysed (loneliest)\nReturns (best beat)\nI’m gonna fly (saddest but cheeriest)\n\nChaging_(demo)_   (deepest)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615384431.0, "datetime": "2021-03-10T13:53:51", "subreddit": "AnorexiaNervosa", "id": "gqg1ahq", "text": "You won’t regret it, trust me. I bought his mercy and I’m glad I did. It’s got my own personal sign on, leave me alone lyric hoodie", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615384711.0, "datetime": "2021-03-10T13:58:31", "subreddit": "AnorexiaNervosa", "id": "gqg1tar", "text": "Good luck, he can really spit. I love it when he says: \n\nI know this probably isn't really realistic\nAnd honestly, I might not ever make a difference\nBut that don't make a difference, I'ma have to risk it\nI been crunchin' numbers, you ain't gotta be a mathematician\nTo see the odds ain't rootin' for me\nI can't lie though, it's kinda how I like it to be\nThe underdog, yeah, you probably think you know what I mean\nBut what I'm saying is they ever push me, I'm gonna swing, yeah.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615429145.0, "datetime": "2021-03-11T02:19:05", "subreddit": "AnorexiaNervosa", "id": "gqitzbx", "text": "I’m trying, it went into a restrictive to a b/p over Christmas as my bday was couple days before, and then Christmas and mums a few days after Christmas, and my sisters in January...... but I’m getting over it and it’s going back into low restriction (restrictive but not an insanely low intake)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615726833.0, "datetime": "2021-03-14T13:00:33", "subreddit": "AnorexiaNervosa", "id": "gqw92on", "text": "I can relate, not dress shopping but looking in the mirror and seeing ribs looking like the Himalayan mountains", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615971689.0, "datetime": "2021-03-17T09:01:29", "subreddit": "bulimia", "id": "gr7whge", "text": "Yep, kinda like: oh well, I’m over anyway wether it’s by an apple or jam tart. I think it’s cause I don’t allow myself them often and then in a binge I do and go in short: trigger happy", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616051260.0, "datetime": "2021-03-18T07:07:40", "subreddit": "AnorexiaNervosa", "id": "grbudw6", "text": "I feel sorry not only for you but also the girl, how would that have helped. \n\nMy mum asked if ‘I was on a hunger strike’ and then said ‘fine don’t eat, I’ll let you die’\n\nWhat’s worse, therapist pointed out what I was eating and laughed saying I can’t have that it’s too much or it was a dinner food. I’d expect that from a family member or friend but 2 therapist who proceeded to inform everyone I was being greedy. Hah gotta love them for it. 5 weeks later I was threatened to go inpatient as my heart was failing. That was in august 2020, to date it’s up to 6 times threatening to go in. In 5 months. \n\nThen my eating disorder therapist didn’t do anything apart from say want me to call the hospital, you’re wrong, why you acting like that. Hey you gained, you must’ve eaten a lot. Literally gonna run away from the clinic and play ‘hide and seek’. \n\nIf it happens again (unlikely cause I’m on a new mental health therapist instead of an eating one) I’ll run into the center and go into a place they least expect, a restaurant bathroom for example, or a diy shop. Cause why would a 16 year old female go into a building supplies store? Especially when a few doors down is a pet store w animals in?\n\nThis is a personal example, based on me and my preferences and location. My clinic is on the outskirts on a large town, 40 min walk from the centre. There’s a retail park with a diy shop, home shop, mattress shop, pet store, bed shops... etc typically theyd go where you like, so pick a random place. The shop people also wouldn’t know. I’d personally say avoid food places as they might think it’s a double bluff. Aka they might think you’ll go to maccies as it’s an unlikely place. Nah go really random.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616330003.0, "datetime": "2021-03-21T12:33:23", "subreddit": "AnorexiaNervosa", "id": "grp15t7", "text": "That I havent been diagnosed long enough so have to wait to recover", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616330034.0, "datetime": "2021-03-21T12:33:54", "subreddit": "AnorexiaNervosa", "id": "grp17bt", "text": "Same, I do that to.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616976119.0, "datetime": "2021-03-29T00:01:59", "subreddit": "AnorexiaNervosa", "id": "gsmu7k1", "text": "I was like ughhhh mood. Couldn’t relate mire.\n\nI hate hunger but also hate fullness- that’s hard aswell", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617804581.0, "datetime": "2021-04-07T14:09:41", "subreddit": "AnorexiaNervosa", "id": "gtouaa9", "text": "Doesn’t everyone just wanna blame everything on your ED, or not??? \n\n\n\nCause for me yes, it’s never me, always ana talking like I’ve been misplaced.... but I’m still me, just with a ton of bad habits. I have the same friends, same likes/ dislikes, same hobbies. Yes I’ve put em off for ages, but they’re still the same, I am running on reserved energy and different priorities going on in my head. \n\n\nOn that note: well done, I’m soo fucking proud. I bet you never knew how much a piece of glass and plastic would control you. I’m proud that you are seeing your positively. I’m proud that you see that to be a smaller size isn’t your sole purpose. I’m glad that you have found your souls purpose. Idk you but I love and admire you. Shows real strength not many people have. Well done for not falling into the jaws of death and escaped anas luring trap before it’s too late. Love you, peace out. Xx", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617978135.0, "datetime": "2021-04-09T14:22:15", "subreddit": "EatingDisorders", "id": "gtxm71a", "text": "As none of us are professionals, we are unable to diagnose anything apart from suggesting things. I’d recommend going to see a doctor or therapist and they should be able to help.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617978999.0, "datetime": "2021-04-09T14:36:39", "subreddit": "AnorexiaNervosa", "id": "gtxo2nn", "text": "Dismissing an ED I found reinforces the “I’m not sick enough”", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618011838.0, "datetime": "2021-04-09T23:43:58", "subreddit": "AnorexiaNervosa", "id": "gtzmkdn", "text": "Yes definitely, they ignore it and say they love you. But in my head; I say- they love who I was.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618144131.0, "datetime": "2021-04-11T12:28:51", "subreddit": "AnorexiaNervosa", "id": "gu550j5", "text": "It’s scared to think about. Once I turn an adult, I’m planning on leaving the ED services as all the therapists treated me like I was a joke and twisted what I said after explaining several times. I tried a new therapist and they did the same. The only doctor that made a huge difference was not even an ED one, they were from A & E. like you know when they soo good and your fed up of the ED and their words are soo kind you just wanna hug them and cry, but then it’s unprofessional for them so have to resist. So shout out to you Bridget, literally only doctor who made everything seem okay even when life was crumbling. The other one being my consultant who listens but I’m terrified of cause I don’t want to be sectioned- that’s the only reason. \n\nFrom personal experience doctors are nicer than ED ones. Or maybe because it was my age they were nice. But I think it’s cause you don’t want them to be scared of doctors and make it feel like you can always go to them. Therapy is 100% effort, it only works if you try.........\n\n\nIdk where this is going \n\n\nIt definitely shouldn’t have happened, there was no reason for it to. Unless it was like no one could’ve predicted like a cardiac arrest, but anything else is pretty preventable if they only would’ve helped her. Sadly, this isn’t the first case and certainly won’t be the last. They’re are going to be may more victims, which will be hard , cause even if we change the media- things slip through but also support groups. And new vulnerable people are ‘getting taught’ behaviours and it’ll forever be out there 😢😢\n\n\nSo I’m gonna personally apologise to anyone who has been blackmailed by their brain, the media, friends or family into believing that they aren’t good enough so they did what they had to and it never felt enough. ❤️❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618145102.0, "datetime": "2021-04-11T12:45:02", "subreddit": "EatingDisorders", "id": "gu56cs8", "text": "I’m kinda the same I eat one thing and my brain tells me your ED had now *G  O  N  E* (it hasn’t) then I’m like: oh shit, better do something to keep it. \n\nI know it’s not healthy but when anorexia is the thing that gave me a purpose, how could I not fall in love with my illness? \n\nI felt powerful. It made me powerful yet stripped me of my strength. I’m sorta a funny person on the fence with that: want encouragement; sure I’ll give it. Want a friend; I’ll be there. Need comfort; right here. Need to experiences; I’m your guy. I’ll never be pro ana: I’ll walk by your side to help you, or boost you higher for an achievement :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618226884.0, "datetime": "2021-04-12T11:28:04", "subreddit": "AnorexiaNervosa", "id": "gu8rhkc", "text": "I like orange juice by Melanie Martinez but that’s about bulimia, waiting to be weightless is good, along with smaller than this- Sara Kays, prom queen- beach bunny, mrs potatoe head-Melanie Martinez", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618360087.0, "datetime": "2021-04-14T00:28:07", "subreddit": "bulimia", "id": "gufmfn5", "text": "I’m currently in that cycle: I have my food set aside and no one can eat that, only I can. When I run out, my problem is, everything left is everyone else’s so it feels like I’m stealing along with all the food having a binge warning and red flags plastered all over.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618458187.0, "datetime": "2021-04-15T03:43:07", "subreddit": "AnorexiaNervosa", "id": "gukgw9a", "text": "Omg I got to that point, I was desperate to be smaller and free were to cut it off.thank the lord I didn’t- it was soo tempting though", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618587203.0, "datetime": "2021-04-16T15:33:23", "subreddit": "AnorexiaNervosa", "id": "guqgqax", "text": "I feel pride and almost congratulate myself when I finished fasting", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618797044.0, "datetime": "2021-04-19T01:50:44", "subreddit": "bulimia", "id": "gv19ma0", "text": "What’s worse is if it’s not what I expected aka underwhelming.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619348415.0, "datetime": "2021-04-25T11:00:15", "subreddit": "AnorexiaNervosa", "id": "gvt22tc", "text": "I’d say I agree to, I felt left out. It was like all my family walked out on me and I wanted to see if they care: conclusion is they care when other people are around. At therapy and my meetings it’s all distraught but alone it’s: you ate a lot, keep getting angry, quit wasting everyone’s time, *clothe sizes*..........", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619357334.0, "datetime": "2021-04-25T13:28:54", "subreddit": "AnorexiaNervosa", "id": "gvtdxih", "text": "I don’t, lockdown means I’m nit seeing anyone so I keep it all on and change like 2 times a week cause I’m disgusting like that", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619479780.0, "datetime": "2021-04-26T23:29:40", "subreddit": "AnorexiaNervosa", "id": "gvznii4", "text": "Mate, all the fucking time. I feel cold in a bath that’s burning my skin and feel sick cause of the heat yet can’t stop shaking.......", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619479897.0, "datetime": "2021-04-26T23:31:37", "subreddit": "AnorexiaNervosa", "id": "gvznr0v", "text": "There are also heated jackets and gloves which sound like heaven in winter. They were made for skiing and extreme/ snow sports. According to me, an Ed is an extreme whatever so qualifies", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619691953.0, "datetime": "2021-04-29T10:25:53", "subreddit": "EatingDisorders", "id": "gwa3qpb", "text": "It is soo competitive isn’t it???????", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620084063.0, "datetime": "2021-05-03T23:21:03", "subreddit": "bulimia", "id": "gwud8ap", "text": "That happened to me aswell- but it came back. When it lest I couldn’t stop panicking", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620119494.0, "datetime": "2021-05-04T09:11:34", "subreddit": "bulimia", "id": "gwvxid4", "text": "Maybe you get used to it; your body knows what it wants so won’t let it go easily. \n\nIt’s kinda a double once it gets used to it.\n\n\nIf it feels food it learns that this is gonna happen after. Therefore just does it.\n\nBut then if the aim is to trigger the gag reflex, you have to do more and more each time as it gets less sensitive \n\nI know that my body doesn’t have a secret equation to make me change shape and I need to learn to trust my body. It’s worked perfectly fine for years so why am I doubting it now????", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620229490.0, "datetime": "2021-05-05T15:44:50", "subreddit": "AnorexiaNervosa", "id": "gx1dv7p", "text": "My family ask me for diet tips- that’s low\n\n(They know about my Ed aswell", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620257319.0, "datetime": "2021-05-05T23:28:39", "subreddit": "AnorexiaNervosa", "id": "gx373xp", "text": "Meanwhile I got exposed now I can’t eat in front of the people who know because I’m “not supposed to be eating”. \n\nI told my friend and told her to keep it a secret because paediatrics said it wasn’t safe to go to school so I let her know why I wasn’t gonna be in for a little while. She took it upon herself to let my whole friendship groups as well as form tutor teacher; despite the promise she made to nit tell anyone: it was 11 people. \n\nAnd in secondary school, you can’t really switch friendship groups (I was ages 15-16)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620257573.0, "datetime": "2021-05-05T23:32:53", "subreddit": "EatingDisorders", "id": "gx37mut", "text": "Genetics; everyone is also built differently so there’s no real way for anything to be put into an equation.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620259440.0, "datetime": "2021-05-06T00:04:00", "subreddit": "EatingDisorders", "id": "gx3bhvp", "text": "I got fed up of being told that I had too much of this too much of that can’t have 3 pieces of toast only 2, pizza isn’t a lunch thing, then was laughed at weekly by my sisters counsellors and said that I couldn’t hide it. Went to my room and cried. Then someone opened up the flood gates and all the “little comments from the past couple months came for a visit: make sure to do your excerecise said the news; everyone’s gonna eat and get fat said society; you’ve got big thighs we’re gonna have to size up; remember when you were tiny and nothing would fit your waist now they do; growing up I was always called thin and low key liked it and that dreaded age called puberty hit :( \n\nI saw a post like a year ago calling out what I feel is 90% of people:\n\nWho gave you an ED and why was it your mum...........\n\n\nSo like if I don’t eat, there’s nothing to judge and I get my “slender” frame back. I did alright and look like the result of if slender man had and orgee with the beldam from coraline but feel like I’m mr bobinski.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620303580.0, "datetime": "2021-05-06T12:19:40", "subreddit": "AnorexiaNervosa", "id": "gx5490o", "text": "Oh yea same. I wasn’t allowed to go to school for 2 weeks and the doctor put me on high restriction (ironically) it’s when I wasn’t allowed to walk more than 400m a day, had to have 3 meals and 3 snacks, (I didn’t have the snacks) and like not make anything (didn’t do that either: it was a) aggression or b) passive silence) I got very overprotective.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620315936.0, "datetime": "2021-05-06T15:45:36", "subreddit": "AnorexiaNervosa", "id": "gx5udnw", "text": "Same a little- I went into what I would consider a binge and then throw it up. Love that for me \n\n\nRexi ——> “recovery” ——> “Liam/ llama” (Mia but I prefer a more gender neutral approach/name)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621035452.0, "datetime": "2021-05-14T23:37:32", "subreddit": "AnorexiaNervosa", "id": "gy5rgc0", "text": "That feeling like how you want the destination but not the journey. However feel like you can’t reach the destination but stay on the journey cause you “haven’t had it long enough”", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621417287.0, "datetime": "2021-05-19T09:41:27", "subreddit": "EatingDisorders", "id": "gyoe4xx", "text": "I can’t really help as everyone is different and the worst thing to feel is words being put in your mouth. So I’d say have you considedered consulting r/AnorexiaNervosa and hear a range of ideas from people all dealing with this one particular ED?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621570877.0, "datetime": "2021-05-21T04:21:17", "subreddit": "AnorexiaNervosa", "id": "gywpks7", "text": "I want for people to treat me like I’m not there but get sad from being lonely. Also when I do eat I feel everyone staring and I get tonnes of thoughts and slow down till I stop (I eat slowly anyway)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1627028736.0, "datetime": "2021-07-23T08:25:36", "subreddit": "bulimia", "id": "h686qpa", "text": "Same for peeing aswell", "parent_id": null, "link_id": null, "context": null}
