{"type": "comment", "timestamp": 1599642562.0, "datetime": "2020-09-09T09:09:22", "subreddit": "EatingDisorders", "id": "g4j470y", "text": "yeah i second this. i’m on ed twt too & i love it & hate it ahaha", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1599816182.0, "datetime": "2020-09-11T09:23:02", "subreddit": "EatingDisorders", "id": "g4t3v9b", "text": "i’m the exact same but just with anything really. i can’t hang out with my friends until i’ve lost loads of weight, i avoid going out to eat because i’ve gained too much & everyone will notice etc etc. even going to school is hard & i find myself sat alone during breaks all because of my body. it’s really tough & isolating man i wish i could give u some advice. just know ur not alone", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600075095.0, "datetime": "2020-09-14T09:18:15", "subreddit": "bulimia", "id": "g57r94o", "text": "same here, i never understood how people could do that & how weird it is like “just eat omg” but now look at me.... bruh", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607335128.0, "datetime": "2020-12-07T09:58:48", "subreddit": "EatingDisorders", "id": "gexgk0e", "text": "i’m 17 & bulimic, i’ve been purging for about 4 years now (ever since i was 13). regardless of if i’m losing lots of weight or not i get bad rashes, my excema flares up where i get patches of dry bleeding skin (it’s horrible), i feel cold all the time, dizzy, i get pains, my heart races including right now for absolutely no reason.\n\ni look dead all the time, my cheeks are puffy, i look fat in the face, my eyes swell quite easily & i have dark eyes. i look really unwell & i’m not even underweight yet. i can’t go a day without purging & it’s even gotten to the point of getting urges to purge WATER because of the realise it gives me. it’s like once you start there’s no going back. \n\nevery time i purge i tell myself it will be the last time, but it never is. i’ve tried going 1 week purge free to then quit on day 1 as the urges are too strong. \n\nbecause of all of this, gaining, losing, rapidly losing & rapidly gaining my body is skinny fat. i have a huge stomach that looks like i’m bloated 24/7, visible collarbones & thin arms. my body is a mess & like i said earlier i have bad excema which is very unattractive. not cute at all. \n\nmy ed has basically ruined my work, i can’t function properly & i’m quite slow. i don’t have many friends now, i feel so lonely & it’s becoming me & my ed because of how bad this all is.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607335701.0, "datetime": "2020-12-07T10:08:21", "subreddit": "bulimia", "id": "gexh2i9", "text": "me too man", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1631443984.0, "datetime": "2021-09-12T10:53:04", "subreddit": "bulimia", "id": "hcjrx8n", "text": "so so proud of you! also you’re very beautiful and i love your piercings, so unique", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636312086.0, "datetime": "2021-11-07T19:08:06", "subreddit": "bulimia", "id": "hjpiwy9", "text": "So proud of you <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637246786.0, "datetime": "2021-11-18T14:46:26", "subreddit": "bulimia", "id": "hl4j06d", "text": "Same, it’s horrible i feel like I’m rotting on the inside from all the binging purging & my mental health is just so bad. I feel disgusting oh and I’m not even thin :/ just maintaining most of the time so invalidating", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637262632.0, "datetime": "2021-11-18T19:10:32", "subreddit": "bulimia", "id": "hl5mri1", "text": "Literally. I hate what it’s done to me, completely ruined me it’s so fucking depressing man I hate everything", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637272237.0, "datetime": "2021-11-18T21:50:37", "subreddit": "bulimia", "id": "hl6aytx", "text": "yep im also now overweight and it feels so invalidating/as if nothing is wrong, like no one will look at me and worry so", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637325958.0, "datetime": "2021-11-19T12:45:58", "subreddit": "bulimia", "id": "hl8yflx", "text": "Same like these restriction periods for me only last 2 days then I’m b/ping again, weight fluctuating like crazy and I’m overweight now ugh, thank you so much i hope I can get help in the future i just get super scared and feel like no one will take me seriously. Yesterday I saw a tiktok, this other black girl with bulimia but very thin, everyone in the comments sympathising for her, made me feel so fat and like a fake even though for me this has been going on for years. \n\nSeems like the only way I deserve to recover is if my weight & looks show for it, like get super thin & look super unhealthy & sick to then receive the validation and get that first push to really get help. Like if someone tells me and validates me that I look xyz then that means I finally deserve to recover. Does that make sense? Life sucks. Hope you can escape this one day too :/", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637783320.0, "datetime": "2021-11-24T19:48:40", "subreddit": "bulimia", "id": "hlxvfkp", "text": "i just finished purging haha but yeah im the EXACT same. i started at 14, purging everyday, i'm 18 now so thats a total of 4 years non stop. due to being on many ed sites and platforms, i would compare myself to other bulimics and question if anything was wrong with me but the fact that i cant even go a solid week without doing it says a LOT so there clearly is a problem. if i'm not doing it every single day i'm doing it like 4 times a week. \n\nits horrible man, i after years of doing it im getting the effects like you, every time i finish purging i feel shitty", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648570484.0, "datetime": "2022-03-29T16:14:44", "subreddit": "bulimia", "id": "i2kwrmj", "text": "this is a great way of thinking, so proud of you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650042512.0, "datetime": "2022-04-15T17:08:32", "subreddit": "bulimia", "id": "i4uqmbz", "text": "well done so so proud of u", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1650474967.0, "datetime": "2022-04-20T17:16:07", "subreddit": "bulimia", "id": "u81hkf", "text": "this is such a sad life. all ive been doing today is b/p all day on easter chocolate, mcdonalds, cookies, bread, ice cream every snack going. my teeth hurt so much i feel so tired, emotional and drained. i tell myself after each time that i'm never going to do it again, for it to repeat the next day. i always have a bit of money left over so i use that on binge food. no one has found out and its been going on for almost 5 years now, i'm such a good liar when it comes to it, i know my family's schedule, times they leave the house and return so i can fit a b/p in\n\nat first it excites me and gives me such a thrill as ive always loved food so i cant wait to eat but after purging i feel so sad again and its back to reality, its back to feeling how i always feel before b/ping just so alone isolated and misunderstood. my teeth are chipping away and are looking more yellow than ever that no amount of toothpaste and mouthwash can fix, i have no friends in the real world just online, my skin is so blotchy and dry, i feel and look so run down oh and the joke is im not even losing weight consistently just gaining and losing so no one would even notice whats going on anyway. the thrill quickly wears away and its back to laying in bed crying wishing my life was different.... im so tired thanks for reading", "title": "so tired of this", "context": null}
{"type": "comment", "timestamp": 1650476963.0, "datetime": "2022-04-20T17:49:23", "subreddit": "bulimia", "id": "i5ic3vt", "text": "> i feel so alone i’m angry and upset that my family haven’t noticed yet i know that even if they did say something i would deny it\n\nme too, logically i know i would spiral and cry if someone caught me purging but at the same time i feel so invalid like there isnt really a problem because no ones picked up on it yet, but i know in my heart its a problem and im bulimic like its not normal to do this", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650479819.0, "datetime": "2022-04-20T18:36:59", "subreddit": "bulimia", "id": "i5ijfh7", "text": "): sending love", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650482051.0, "datetime": "2022-04-20T19:14:11", "subreddit": "bulimia", "id": "i5ip69f", "text": "): i’m so sorry. i’m almost 19, each year i tell myself it’s time to recover as i can’t keep going on like this but i keep slipping and i can’t seem to let this go completely. \n\nall my “recovery” attempts have only lasted a day or so, i know i need professional help in order to completely get rid of this abs recover properly but even that scares me as bulimia is all i know. it’s “helped” me in a way, it’s a coping mechanism, helps me feel more in control and it’s something i can turn to.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650484507.0, "datetime": "2022-04-20T19:55:07", "subreddit": "bulimia", "id": "i5ivjud", "text": "> i really want to be alive, instead of just breathe.\n\nthis ):", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650523628.0, "datetime": "2022-04-21T06:47:08", "subreddit": "bulimia", "id": "i5l5o9z", "text": "what is the 12 steps? and thank you sm", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650523746.0, "datetime": "2022-04-21T06:49:06", "subreddit": "bulimia", "id": "i5l5tmm", "text": "thank you so much, so sorry your going through this ): i just woke up. hope today is a good day so i won’t have to do this again", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650524000.0, "datetime": "2022-04-21T06:53:20", "subreddit": "bulimia", "id": "i5l65as", "text": "> All I can say is it took me almost dying from a heart attack to be \"scared straight\" so to speak. After that it was a matter of life or death and I had no other choice but to figure it out. I prayed hard.\n\ni’m so sorry. that’s what i feel, i feel like i’m waiting for something bad to happen to sort of kickstart me into recovery like if i was to end up in the hospital, i’d get loads of attention & get well soons etc which would encourage me to stop & like you said “scared straight”, but logically i don’t want that, i wish i had the power in myself to recover instead of waiting for encouragement & validation from others that i should", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650562689.0, "datetime": "2022-04-21T17:38:09", "subreddit": "bulimia", "id": "i5n5r9l", "text": "that’s so sweet!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650580214.0, "datetime": "2022-04-21T22:30:14", "subreddit": "bulimia", "id": "i5ocm7r", "text": "thank u so much ): <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650737814.0, "datetime": "2022-04-23T18:16:54", "subreddit": "bulimia", "id": "i5wlfsf", "text": "thanks for all the support and upvotes <3 such a shame we’re all going through the same thing though ):", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650995582.0, "datetime": "2022-04-26T17:53:02", "subreddit": "bulimia", "id": "i6alyku", "text": "me too! proud of u", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651255625.0, "datetime": "2022-04-29T18:07:05", "subreddit": "bulimia", "id": "i6p0t4e", "text": "oh my godddd that sounds like an absolute nightmare. and i thought my story of attempting to shower purge and it going absolutely everywhere was bad… yikes", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651649665.0, "datetime": "2022-05-04T07:34:25", "subreddit": "bulimia", "id": "i79l5hl", "text": "oh no ): i’m so sorry. i don’t know what i would do in this situation… i think you should if you can try and talk to him about triggers and just more about ur ed. he should understand, sending love <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656166526.0, "datetime": "2022-06-25T14:15:26", "subreddit": "EatingDisorders", "id": "idotuz9", "text": "that's so nice!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656409739.0, "datetime": "2022-06-28T09:48:59", "subreddit": "bulimia", "id": "ie1bd7f", "text": "i always feel so tempted to get into lax but then stories like this scare me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657755451.0, "datetime": "2022-07-13T23:37:31", "subreddit": "bulimia", "id": "ig25hvq", "text": "thats exactly it for me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658098072.0, "datetime": "2022-07-17T22:47:52", "subreddit": "bulimia", "id": "igko1sm", "text": "LMAOOOO me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658098800.0, "datetime": "2022-07-17T23:00:00", "subreddit": "bulimia", "id": "igkpmzz", "text": "for real... i hate this inflation shit man everything going up", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658105016.0, "datetime": "2022-07-18T00:43:36", "subreddit": "bulimia", "id": "igl2hm9", "text": "same", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665487305.0, "datetime": "2022-10-11T11:21:45", "subreddit": "bulimia", "id": "irvkds9", "text": "aw man ): the amount of times i’ve been here, throwing things away to go back and get it. makes me feel so disgusting after it’s all done, like i’m an animal. i would buy the book but it would trigger me so much, i’m guessing there’s numbers involved too like how much she weighed and everything. no thanks", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665592982.0, "datetime": "2022-10-12T16:43:02", "subreddit": "bulimia", "id": "is1gn07", "text": "oh no. my last appointment was 3 years ago just before the lockdown. they usually send a letter through the door reminding you to book an appointment. this is so embarassing and disgusting but on top of bulimia ive struggled to brush my teeth twice a day like especially in the evenings so i dread to hear what my teeth are like. \n\nive been bulimic since 14 and only a year in they told me the enamel is bad, i never understood until now why that was & you'd think that would be motivation to stop and look after myself but the ed and feelings of depression always wins", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665651127.0, "datetime": "2022-10-13T08:52:07", "subreddit": "bulimia", "id": "is4s8pc", "text": "so glad i’m not alone. i doubt they’ll ever send a letter through for me anyway as it’s been so long", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716371041.0, "datetime": "2024-05-22T09:44:01", "subreddit": "bulimia", "id": "l55bjcc", "text": "me too i’ve been b/ping for the past 5 days, i feel like absolute shit. i work in a grocery store though and i promise you were not judging, when i see someone buy lots of snack food i just think wow i wish i could afford to buy so much in one go for a binge", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716371281.0, "datetime": "2024-05-22T09:48:01", "subreddit": "bulimia", "id": "l55bv9w", "text": "> I think anyone in your boat (doesn’t leave the house) would struggle with overeating at the very least. I’ve read almost everywhere during the lockdown period, people put on weight…so at least you know what your going through is somewhat universal. Eating cures boredom.\n\ni’m going to have to disagree, as someone who works and leaves the house frequently, i still b/p after every shift. going to school, i would b/p every single day after school. nothing to do with boredom and the lockdown 4 years ago, it’s an eating disorder", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716383883.0, "datetime": "2024-05-22T13:18:03", "subreddit": "bulimia", "id": "l55zv7y", "text": "its just the way you worded it, as to say anyone who doesnt the house will binge eat, but those who leave the house wont, so i explained that i still binge and purge and i regularly leave the house to go to work. therefore, your argument is a bit silly", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725805637.0, "datetime": "2024-09-08T14:27:17", "subreddit": "bulimia", "id": "lm4a8zz", "text": "this is amazing, do you have any tips on how you went an entire year? did you replace physically being sick for a diff way of compensating or have you gone 100% purge free because i know taking lax and stuff still counts", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732290215.0, "datetime": "2024-11-22T15:43:35", "subreddit": "bulimia", "id": "lyfgusz", "text": "This is heartbreaking and so scary man.. I'm 7 years into bulimia, I'm 21f now and it truly is catching up to me, my teeth are so sensitive, I get chest pains now but I'm unsure if its the anxiety or bulimia. I havent been to the dentist since lockdown because of the shame and being unable to admit why my enamel is wearing away and why my teeth have chipped.. I know it's all the disorders fault.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732292405.0, "datetime": "2024-11-22T16:20:05", "subreddit": "bulimia", "id": "lyfnrf9", "text": "This is painfully relatable as I'm just like your girlfriend. I still live at home with my family but say no to all plans so the disorder comes first. I have no friends and have never dated which I think is because of my need for control and because I cant give up the eating disorder. I work and spend my wages on binge food only to throw it up. \n\nReading this has made me tear up.. I can imagine that when the day comes that someone finally looks me in the eye and says they love me, it will end up just like this. I think when you're so far gone, you believe it's normal. I've been bulimic for 7 years, and still brush off my heart problems as anxiety, the teeth sensitivity as \"oops, I shouldn't of put ice in my drink\" and everything is just because \"I havent had enough sleep\" - I make my own excuses for the ed like its nothing. It's ruining my health. I have no solid advice for you.. I think if you was my partner I'd not want you to do anything, but then thats letting it win :(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732301514.0, "datetime": "2024-11-22T18:51:54", "subreddit": "bulimia", "id": "lyghhsr", "text": "Can I private message you instead? X", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732808852.0, "datetime": "2024-11-28T15:47:32", "subreddit": "bulimia", "id": "lzf5011", "text": "So relatable I always take photos of myself after I purge, I love the look of my bloodshot eyes and shaky hands struggling to unlock my phone.. I feel such a high its unreal", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735543506.0, "datetime": "2024-12-30T07:25:06", "subreddit": "bulimia", "id": "m4hopsr", "text": "No one irl knows about mine and it’s been 7 years. It’s not something I want anyone to ever find out about as truthfully I’d hate to lose the control and have nothing to fall back on. My mum asked me if I was purging once or twice but I always denied it. Mental health isn’t really spoken about much and you’re seen as insane if you have any issues with my family seeing it as “just be grateful because you’re alive, some people don’t live to 21” blah blah blah. Just me, random people on reddit and a journal. I hope to leave a huge digital footprint for when the time comes and I die. I can’t see myself living long tbh, can you? Or do you see hope?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736031181.0, "datetime": "2025-01-04T22:53:01", "subreddit": "bulimia", "id": "m5ffrz5", "text": "Just out of curiosity, if you are recovered why are you in ed subreddits surely that would trigger you to want to go back? I also dont think anyone here truly wants to recover thats the thing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736127008.0, "datetime": "2025-01-06T01:30:08", "subreddit": "bulimia", "id": "m5mhoy6", "text": "This is absolutely amazing WOW teach me your ways", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736180081.0, "datetime": "2025-01-06T16:14:41", "subreddit": "bulimia", "id": "m5pr3ay", "text": "This is something that I struggle so much with as well which his why I have never been able to go more than a few days purge free as I hate the fullness too it makes me feel disgusting and inflated and gross", "parent_id": null, "link_id": null, "context": null}
