{"type": "comment", "timestamp": 1597078649.0, "datetime": "2020-08-10T16:57:29", "subreddit": "AnorexiaNervosa", "id": "g10d3s4", "text": "This made my morning 😂", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600130985.0, "datetime": "2020-09-15T00:49:45", "subreddit": "AnorexiaNervosa", "id": "g5b3oet", "text": "Yes. Completely.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600481387.0, "datetime": "2020-09-19T02:09:47", "subreddit": "fuckeatingdisorders", "id": "g5rrtua", "text": "Holy fuck YES", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1602730505.0, "datetime": "2020-10-15T02:55:05", "subreddit": "AnorexiaNervosa", "id": "g8v3gzq", "text": "I think so <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1602731316.0, "datetime": "2020-10-15T03:08:36", "subreddit": "fuckeatingdisorders", "id": "g8v4phy", "text": "Right??? WTF. She has a totally normal body, except maybe bigger boobs than the average woman...? Jesus, people can fuck off.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605741483.0, "datetime": "2020-11-18T23:18:03", "subreddit": "AnorexiaNervosa", "id": "gcrt2ap", "text": "Yeah, I feel this. I simultaneously feel a pressure to eat more so I seem normal, and a pressure to eat less because I'm ashamed and embarrassed that people won't think my ED is real...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606787196.0, "datetime": "2020-12-01T01:46:36", "subreddit": "fuckeatingdisorders", "id": "ge7r2d7", "text": "Ugh this is me whenever I stay at work late. Feels bad man.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606870091.0, "datetime": "2020-12-02T00:48:11", "subreddit": "AnorexiaNervosa", "id": "gebhy3f", "text": "I definitely don't want anybody to starve themselves.\n\nBut I do judge others for all the stupid ineffective bullshit they do to try to lose weight.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610649987.0, "datetime": "2021-01-14T18:46:27", "subreddit": "AnorexiaNervosa", "id": "gj986yr", "text": "Also asexual here, but I often wonder if it's a hormonal consequence of being underweight most of the time since puberty...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610754061.0, "datetime": "2021-01-15T23:41:01", "subreddit": "fuckeatingdisorders", "id": "gjed6kp", "text": "Yep, absolutely. And it's especially sad because she's put herself in a position where recovery, should she ever choose to seek it, will be infinitely harder.\n\nHer emaciated bodychecks are on the Internet, permanently, with millions of views.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610986387.0, "datetime": "2021-01-18T16:13:07", "subreddit": "AnorexiaNervosa", "id": "gjqbi8l", "text": "Heh, this made me snort.\n\nToo true, though.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611769533.0, "datetime": "2021-01-27T17:45:33", "subreddit": "AnorexiaNervosa", "id": "gkz5rg8", "text": "Yes, I’m convinced that my entire body bloats, not just my stomach. My legs, arms, face, ankles...everything", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614106282.0, "datetime": "2021-02-23T18:51:22", "subreddit": "AnorexiaNervosa", "id": "gohqa74", "text": "Yes, this so much. I /know/ I was comfortable weighing X at one point, but now that I'm lower, the thought of going back makes my skin crawl. It's so frustrating and really makes no sense :(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616292975.0, "datetime": "2021-03-21T02:16:15", "subreddit": "AnorexiaNervosa", "id": "grnqip5", "text": "Because I've never hit X lbs/BMI of X. Because I've never passed out. Because the only \"exercise\" I do is walking. Because I have binge/purge subtype.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617913942.0, "datetime": "2021-04-08T20:32:22", "subreddit": "AnorexiaNervosa", "id": "gtuq0g7", "text": "Taquitos are usually hella small?? 3 or 4 + grapes is still like an average snack??? And frankly tiny for a whole-ass meal???? WTF is your aunt even on about.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617923351.0, "datetime": "2021-04-08T23:09:11", "subreddit": "fuckeatingdisorders", "id": "gtvagqk", "text": "I don't think they're a choice.\n\nI hear what you're saying...I really do. But I also think that:\n\n(A) Anyone who chooses to address their body dissatisfaction or anxiety or what-have-you by starving themselves or purging is not mentally well to begin with, and\n\n(B) EDs tend to take on a life of their own. Once you start, it's hard to stop. Forgive me for snooping on your profile, but you mentioned before that you've dealt with this for 4+ years now? So obviously your plan to  \"go anorexic\" for a few months went awry somewhere along the way. Maybe you weren't satisfied with your weight loss. Maybe you just got addicted to the feeling of restricting, or losing weight. I dunno. But that doesn't happen to normal dieters...they usually *can't wait* to stop and have no trouble doing so.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618186515.0, "datetime": "2021-04-12T00:15:15", "subreddit": "AnorexiaNervosa", "id": "gu79kfs", "text": "The Sea is a Good Place to Think of the Future is the only “ED song” that I like. The rest are a bit too on-the-nose for my taste, especially Prom Queen haha", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618699636.0, "datetime": "2021-04-17T22:47:16", "subreddit": "AnorexiaNervosa", "id": "guws2bt", "text": "It happens to me nearly every night. I bundle up in warm PJs because I’m freezing when I go to bed, only to wake up sweating in the middle of the night and having to change into shorts.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618723368.0, "datetime": "2021-04-18T05:22:48", "subreddit": "AnorexiaNervosa", "id": "guxvm38", "text": "Shhhhhh 🤫", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1619286706.0, "datetime": "2021-04-24T17:51:46", "subreddit": "AnorexiaNervosa", "id": "mxp25c", "text": "I don't think anorexic-me is more attractive. I know nothing in my life will be fixed if I lose more weight, and I don't have any particular goal weight/number that I'm trying to reach. I don't stare at women on Instagram thinking that my life would be better if I had their bodies. *I do not have an eating disorder because of \"diet culture\"* and I'm so fucking tired of that narrative. \n\nIt makes it easy for people to say things like, oh, well, *if you just accepted yourself/your natural body* or *if you just ate intuitively and let yourself enjoy food again* then you could get better. Like I'm killing myself just because I want to ~look hot~ or something. Nothing infuriates me more.", "title": "I do not have an eating disorder because of \"diet culture.\"", "context": null}
{"type": "comment", "timestamp": 1619293139.0, "datetime": "2021-04-24T19:38:59", "subreddit": "AnorexiaNervosa", "id": "gvqpsr9", "text": "Exactly. I think diet culture creates an environment that makes recovery challenging. And no hate to people who do see it as a major contributor to their ED. But the things I struggle with are so divorced from wanting to look attractive/fit an ideal figure/etc. that it frustrates me when people try to make that point. I'm both glad the post resonated with you and sorry you can relate.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619293597.0, "datetime": "2021-04-24T19:46:37", "subreddit": "AnorexiaNervosa", "id": "gvqqoi5", "text": "Personally: I find that it's first and foremost a coping mechanism. It started when I was younger in response to some chronic physical and mental health issues, then got a lot worse during a time in my life when I was very isolated. Now, it's like my lifeline...a familiar comfort. When I feel shitty about everything else in my life and who I am as a person, I self-soothe by restricting and losing weight. It's also very much a physical thing for me...the hunger high keeps me calm and distracted.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619294171.0, "datetime": "2021-04-24T19:56:11", "subreddit": "AnorexiaNervosa", "id": "gvqrt4c", "text": "You would think so. But I see so much lately about how recovery is about \"unlearning diet culture\" and \"unpacking internalized fatphobia\" from recovery advocacy groups, influencers, etc. It rubs me the wrong way.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619317760.0, "datetime": "2021-04-25T02:29:20", "subreddit": "AnorexiaNervosa", "id": "gvrzwtm", "text": "> fade into invisibility\n\nYep, this right here.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619471021.0, "datetime": "2021-04-26T21:03:41", "subreddit": "AnorexiaNervosa", "id": "gvz4uyd", "text": "This. Sometimes I get so cold in my own apartment that my lips and hands turn blue-ish purple and I can't stop violently shivering. I just turn the shower on full blast and sit there and close my eyes. Sometimes for over an hour.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619501940.0, "datetime": "2021-04-27T05:39:00", "subreddit": "AnorexiaNervosa", "id": "gw0q7xn", "text": "I can see my weight loss at first, but it's like I get desensitized to it. I feel thinner when I first drop to a lower weight, and then I start to feel like it's not enough and I'm actually fat at the same weight that previously felt thin. And then I play all sorts of mind games, like: what if I gained body fat? what if I'm actually gaining weight but I can't tell because I'm dehydrated? what if I'm getting flabby because I've been less active lately? etc. So I lose more \"just to be safe.\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619908812.0, "datetime": "2021-05-01T22:40:12", "subreddit": "AnorexiaNervosa", "id": "gwlhlsz", "text": "I know this struggle and how miserable it is (trust me). However, I want to point out that until you’ve been weight restored for at least 6 months to a year, *you do not know how your healthy body will actually look when the weight redistributes*. When you first gain weight, it usually goes to your trunk/midsection and (you guessed it) your face. This is NOT necessarily permanent! Your body is in a state of flux. Weight redistribution is an honest-to-God real thing, and often you will look thinner at a higher weight after recovering than you looked at a lower weight while recovering. I know it sucks and is super uncomfortable...please try to be patient though.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620237886.0, "datetime": "2021-05-05T18:04:46", "subreddit": "AnorexiaNervosa", "id": "gx1ybro", "text": "Right?? Wtf. I'm so embarrassed by the way I eat and am constantly talking about all the random shit I \"eat\" in casual conversation so that I seem normal...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620408471.0, "datetime": "2021-05-07T17:27:51", "subreddit": "AnorexiaNervosa", "id": "gxaomdd", "text": "Yeah, the fact that she said that she’s *losing weight* in recovery because she’s *feeding herself properly for the first time* just reeks of bullshit. \n\nStarvation mode DOES NOT EXIST. If she was restricting, she would have lost weight. Recovery looks different for different people, but anorexia recovery specifically is NOT COMPATIBLE WITH WEIGHT LOSS.\n\nI have no doubt that she was in some sort of binge/purge/restrict cycle, and that emerging from that cycle has resulted in weight loss for her. But for fuck’s sake, the audacity it takes to call that anorexia nervosa...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620951667.0, "datetime": "2021-05-14T00:21:07", "subreddit": "fuckeatingdisorders", "id": "gy1kmi0", "text": "Yep, this. Also, not trying to step on any toes, but a lot of die-hard proponents of all-in say that it’s the only way to recover and that people who follow meal plans are still disordered, which is just...problematic. There is no one way to recover. Do what works for you, IMO", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621122931.0, "datetime": "2021-05-15T23:55:31", "subreddit": "fuckeatingdisorders", "id": "gy9q8fx", "text": "I think this is me, but I haven’t ever been healthy enough for long enough to know for sure. Estradiol/estrogen was in the toilet last time I had it checked, though, and I’ve never had regular periods in my life...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621289117.0, "datetime": "2021-05-17T22:05:17", "subreddit": "fuckeatingdisorders", "id": "gyhyaf6", "text": "I love this comment so much--could not agree more. I am *so sick* of people pretending that either extreme is in any way healthy, *especially* when it comes from ED treatment providers! Please, for the love of God, I just want a treatment team that will have an honest conversation with me about making predominately balanced food choices, maintaining a healthy weight, and getting a moderate amount of exercise. I'm severely underweight right now due to an AN relapse, and I fully acknowledge that it's not healthy, and that I need to gain some weight and eat more regularly to be in a better spot. But just because I'm at one extreme does not mean encouraging me to go to the other extreme is a good strategy... I'm a big girl, lol, I can handle the truth about nutrition, and I'd respect the hell out of any treatment provider that gave me actual scientific, evidence-based information instead of feel-good BS.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1622172205.0, "datetime": "2021-05-28T03:23:25", "subreddit": "AnorexiaNervosa", "id": "gzpuarj", "text": "This, so completely. I get so jealous when other people are \"allowed\" to be disordered and I'm not, as stupid as it sounds...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1622945812.0, "datetime": "2021-06-06T02:16:52", "subreddit": "AnorexiaNervosa", "id": "h0r46rk", "text": "Y’all are pooping every day?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623210465.0, "datetime": "2021-06-09T03:47:45", "subreddit": "EatingDisorders", "id": "h142ha6", "text": "Check out /r/ARFID too--they may be able to offer some support for this specifically", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1623372044.0, "datetime": "2021-06-11T00:40:44", "subreddit": "fuckeatingdisorders", "id": "nx34c1", "text": "This is the first time I’ve had non-safe food in over 5 months. I’m freaking out right now and want to skip dinner to compensate.\n\nI could really use some support :(", "title": "My boss brought in donuts today, and I ate one.", "context": null}
{"type": "comment", "timestamp": 1623611128.0, "datetime": "2021-06-13T19:05:28", "subreddit": "AnorexiaNervosa", "id": "h1nfjuh", "text": "Hey, I hear you, and I’ve been there. But I also want to offer another perspective, in case it helps a little: *being seen as “the anorexic” seems like it would feel validating, but in actuality, it is mortifying*. People look at you with pity. They think you’re pathetic…it’s your biggest problem, plastered for the world to see. They’re afraid to say something because they don’t want to set you off and make you worse. People treat you with kiddie gloves, and with it comes a total lack of respect and dignity…", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623952541.0, "datetime": "2021-06-17T17:55:41", "subreddit": "AnorexiaNervosa", "id": "h2464at", "text": "Yes, lol. I guess I do eat \"healthy\" foods but I restrict so I'm definitely missing out on a lot of nutrients... even though, proportionally, everything is ~balanced~, I simply don't get enough of what I need. It's not healthy at all, lol.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625510894.0, "datetime": "2021-07-05T18:48:14", "subreddit": "fuckeatingdisorders", "id": "h45l9id", "text": "I've heard that this is based on the amount an average person is likely to eat at once, and it has nothing to do with how much you should be eating total throughout the day.\n\nNow, I'm not totally sure I buy that, because there's no way the average person's bowl of cereal is only 1/2 cup. But yeah.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625525990.0, "datetime": "2021-07-05T22:59:50", "subreddit": "AnorexiaNervosa", "id": "h46ee8c", "text": "This is exactly what I needed 🥰", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626309249.0, "datetime": "2021-07-15T00:34:09", "subreddit": "AnorexiaNervosa", "id": "h57vswy", "text": "I’ve wondered for a long time if I have this, mostly because I’ve had sensory issues with food and difficulty breaking food routines since  long before I developed AN. Also have trouble relating socially to my peers and often feel like I’m trying (and failing) to “act normal” by mimicking the behavior of those around me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626828362.0, "datetime": "2021-07-21T00:46:02", "subreddit": "AnorexiaNervosa", "id": "h5xzlnv", "text": "Yeah, regardless of how they said it, it’s grossly inappropriate to bring up when someone is in the hospital for medical complications of a restrictive ED. Sorry you had to go through that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628371607.0, "datetime": "2021-08-07T21:26:47", "subreddit": "fuckeatingdisorders", "id": "h83lc5u", "text": "I honestly don't think this is an unpopular opinion...it's pretty well-acknowledged amongst the ED circles I'm in that treatment centers are, at best, problematic, and, at worst, actively harmful.\n\nLike you, I think that hospitalization for medical issues (and/or severe psychiatric issues like acute suicidality) followed by individual treatment in the community is the way to go. A few things, though:\n\nFirst, community-based treatment often relies upon meeting the patient where they're at and working with them to minimize harm/practice harm reduction where it's indicated. The problem with harm reduction is that (a) in the U.S., insurance companies usually have strict criteria for how much progress you \"should\" be making and how fast, and they might not cover services that practice a harm-reductive/patient-centered approach, and (b) individual providers may be hesitant to take on ED patients who they think of as a \"liability,\" especially if they are not making \"enough\" progress or working towards the goals that the provider thinks should be prioritized.\n\nSecond, I don't think there's a good solution for treating children and teenagers who point-blank refuse help. The best practice is to use family-based treatment, but FBT will not work in a number of situations. For example, FBT is time- and resource-intensive and probably won't be possible in a family where both parents/caregivers work full-time or in a single-parent household. Also, in a situation where there is abuse, FBT will not be effective. In those situations, it might be in the best interests of the child or teenager to get help in a residential setting. But as someone who received treatment as a teenager in an ethically-questionable facility that has fucked with me long-term, I still feel uneasy saying that.\n\nFinally (and this is purely me playing devil's advocate), I *do* want to point out that you can be grateful that a facility saved your life AND resent the way they went about doing it. Which is certainly the case for me and probably lots of people who have been in inpatient/residential treatment.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628657126.0, "datetime": "2021-08-11T04:45:26", "subreddit": "fuckeatingdisorders", "id": "h8hzuh5", "text": "Guess I’m opposite of everyone in this thread, lol, so I’ll give some perspective from the other side:\n\nThe way my body dysmorphia works, I literally think I am continuously gaining massive amounts of weight constantly unless I have evidence to prove otherwise. So hopping on the scale helps give me a reality check that *no*, actually, eating like a normal human didn’t make me put on a gazillion pounds in one week, and in reality, my body works and processes food just like anyone else’s. So it’s a huge trigger for me not to know, and I’ve done the best and eaten the most consistently in recovery when I’ve known my weight on a regular basis.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1632535311.0, "datetime": "2021-09-25T02:01:51", "subreddit": "fuckeatingdisorders", "id": "he643yl", "text": "\"Fruit is bad for you. You'll gain weight.\"\n\n*Ok, so what should I eat to lose weight?*\n\n\"Coffee with butter in it.\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1634706399.0, "datetime": "2021-10-20T05:06:39", "subreddit": "EatingDisorders", "id": "hhbt004", "text": "There are treatment centers out there who encourage intuitive eating rather than exchanges. Usually, they *will* start you out on some kind of structured/portioned meal plan so that you can get used to eating an appropriate amount of food again first, but then they'll transition you to following your body's cues. The caveat here is that this initial meal plan will probably be very, very far from restrictive if you are underweight--it will probably be designed for weight gain. Just throwing that out there.\n\nBut if you don't think treatment is helpful...maybe it's not. I've always thought it just keeps me stuck in eating disorder world and disconnected from the \"real world\"/my actual hopes and dreams and goals in life. In that case, there are lots of resources out there that might appeal to you. Support groups (even for general mental health stuff--sometimes being around other ED people makes it worse), podcasts, workbooks... it's all about finding what helps you reach where you want to be. Sorry you're feeling so frustrated.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1635286795.0, "datetime": "2021-10-26T22:19:55", "subreddit": "AnorexiaNervosa", "id": "hi68l8u", "text": "This is so adorable 🥰 it looks like a poptart!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1635997867.0, "datetime": "2021-11-04T03:51:07", "subreddit": "AnorexiaNervosa", "id": "hj8pynp", "text": "Hey, just wanted to say I'm so sorry you're going through this. It's enough to just let her know she is loved. Don't forget to take care of yourself, too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637293315.0, "datetime": "2021-11-19T03:41:55", "subreddit": "AnorexiaNervosa", "id": "hl7m2na", "text": "QUEEN SHIT RIGHT HERE", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637789587.0, "datetime": "2021-11-24T21:33:07", "subreddit": "fuckeatingdisorders", "id": "hlyb6oj", "text": "The bread butt is the best part :) especially with hummus, or dipped in soup", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637795385.0, "datetime": "2021-11-24T23:09:45", "subreddit": "fuckeatingdisorders", "id": "hlypbzq", "text": "Ugh yes. #soupgirl4eva", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641506495.0, "datetime": "2022-01-06T22:01:35", "subreddit": "AnorexiaNervosa", "id": "hrju1xh", "text": "r/anorexiamemes", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649374248.0, "datetime": "2022-04-07T23:30:48", "subreddit": "AnorexiaNervosa", "id": "i3tvfe7", "text": "I wouldn’t respond, honestly. This is inappropriate of them, especially if they are “recovered.” Your body is not their business.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651603778.0, "datetime": "2022-05-03T18:49:38", "subreddit": "AnorexiaNervosa", "id": "i76zvhx", "text": "That we’re vain. Apart from my weight, I could not give less of a shit about how I look. And I don’t think being severely underweight looks “good”…being way too thin is something I try to hide, not show off.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654480640.0, "datetime": "2022-06-06T01:57:20", "subreddit": "AnorexiaNervosa", "id": "ibbjl6z", "text": "I'm also 24, am in recovery now but hit probably my lowest point with anorexia last year (aged 23) after struggling since my teenaged years and being in and out of treatment many times.\n\nYes, this sucks as an adult. It's embarrassing...I found myself trying to hide my weight much more than when I was younger--not because I didn't want to be \"found out,\" but because I was ashamed of how emaciated I'd become. I was also trying to figure out how to navigate treatment while working a full-time job, and ended up deciding it was not worth it because goddamn is treatment not set up to help adults who have to work. It's depressing, and it's brutal, and it's hard to escape.\n\nI do think recovery is possible though. I'm not \"recovered\" per se, but after getting on the right meds, getting out of an extremely toxic/abusive relationship, and putting effort into surrounding myself with a positive group of people...I'm getting there. Hang in there.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654710829.0, "datetime": "2022-06-08T17:53:49", "subreddit": "AnorexiaNervosa", "id": "ibmv5u1", "text": "lmao, when I was at my sickest I’d intentionally walk past a bunch of restaurants every day on my way home from work just to smell the food. Fucked up.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684633958.0, "datetime": "2023-05-21T01:52:38", "subreddit": "AnorexiaNervosa", "id": "jkz7iiw", "text": "Make our beds, walk up stairs, carry text books across the school room, lie down on our sides (this last one may have been a body check thing though, unclear!)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1696188279.0, "datetime": "2023-10-01T19:24:39", "subreddit": "AnorexiaNervosa", "id": "k31fgmc", "text": "those skinny legs 😍\n\njk this is hilarious tho", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1701561908.0, "datetime": "2023-12-03T00:05:08", "subreddit": "AnorexiaNervosa", "id": "kbqyi5z", "text": "When I had anorexia, it felt like a choice in some ways.\n\nNow that I’m recovered and can see how warped my brain was…there’s no way it was a choice. You just can’t choose to think like that or act that way.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1703725867.0, "datetime": "2023-12-28T01:11:07", "subreddit": "AnorexiaNervosa", "id": "kf7dazg", "text": "I relapsed over and over again for 10 years before recovering - how much of that was me vs. the illness vs. life circumstances vs. the toxic treatment centers I was in, I dunno. It doesn’t matter.\n\nI think you have to be gentle with yourself. All you can do is move forward and try to focus on recovery.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1710812426.0, "datetime": "2024-03-19T01:40:26", "subreddit": "fuckeatingdisorders", "id": "1bi8gyp", "text": "And I feel really weird.\n\nI’m not grieving exactly. We weren’t particularly close. I hadn’t spoken to her in a few years.\n\nI’m in recovery, but more and more of the people I knew during the time in my life when I was ill are dying. I’m in my mid-20s, and so were they. I shouldn’t have dead friends.\n\nI feel simultaneously lucky to have escaped this and sad that so many people haven’t. I don’t want to keep watching this happen.", "title": "Another person I met in treatment died.", "context": null}
{"type": "comment", "timestamp": 1717547633.0, "datetime": "2024-06-05T00:33:53", "subreddit": "AnorexiaNervosa", "id": "l75dfi6", "text": "Yeah, I hear you. When you’re underweight and “fragile,” the expectations are low. It’s almost like that by focusing obsessively on food and your body, you earn permission to only focus on food and your body. It feels so safe.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735363380.0, "datetime": "2024-12-28T05:23:00", "subreddit": "EatingDisorders", "id": "m45hkke", "text": "11 - diagnosed with type 1 diabetes, which led to a sudden focus on food, exercise, etc. coupled with weight gain due to starting insulin. Fell into restrict/binge cycle at 13. Full-blown AN-b/p at 15. Hospitalized at 16.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1752610162.0, "datetime": "2025-07-15T20:09:22", "subreddit": "fuckeatingdisorders", "id": "n3bnxz7", "text": "Big emphasis on point #2. Recovering in silence, and largely alone, is one of the hardest things I’ve done. Most people don’t care - you need internal motivation.", "parent_id": null, "link_id": null, "context": null}
