{"type": "comment", "timestamp": 1599101127.0, "datetime": "2020-09-03T02:45:27", "subreddit": "fuckeatingdisorders", "id": "g3svtyq", "text": "It’s my only hobby, which is sad.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600103070.0, "datetime": "2020-09-14T17:04:30", "subreddit": "bulimia", "id": "g5932xb", "text": "***massive hugs***", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1600995010.0, "datetime": "2020-09-25T00:50:10", "subreddit": "fuckeatingdisorders", "id": "g6hka6b", "text": "Or they say “why would you do something that stupid?” Makes you feel awesome.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609027013.0, "datetime": "2020-12-26T23:56:53", "subreddit": "fuckeatingdisorders", "id": "gh487zx", "text": "I get Noom ones—just as bad.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609535932.0, "datetime": "2021-01-01T21:18:52", "subreddit": "bulimia", "id": "ghreml8", "text": "I will join you. I have shit my pants a few times too, although never at work. It’s only a matter of time though...my ED voice is also screaming at me. I know it needs to end now. I contacted my old therapist and she is willing to do", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609536048.0, "datetime": "2021-01-01T21:20:48", "subreddit": "bulimia", "id": "ghreujw", "text": "(Didn’t finish typing lol) FaceTime sessions with me. I hate how bad this has become and I hate the person it’s made me. Being thin is only a small consolation for the crap I put myself through.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609959948.0, "datetime": "2021-01-06T19:05:48", "subreddit": "bulimia", "id": "gic09tv", "text": "I needed to hear this. I have been using them for years and I just like the empty feeling. I think I’m depending on them and I need to get off them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610246525.0, "datetime": "2021-01-10T02:42:05", "subreddit": "fuckeatingdisorders", "id": "giq1wjx", "text": "That quote from Tommy Boy always pops into my head: “Ugh, I can just HEAR you getting fatter” as Chris Farley squirts ketchup into a mouthful of fries.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623113786.0, "datetime": "2021-06-08T00:56:26", "subreddit": "fuckeatingdisorders", "id": "h0z7xln", "text": "I purge with laxatives and I have a similar and also horrifying list. This disease absolutely sucks.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625940729.0, "datetime": "2021-07-10T18:12:09", "subreddit": "bulimia", "id": "h4q4qc7", "text": "I used to abuse them until an incident where I was in my basement and felt a slight urge to go followed by a mass of semi liquid shit literally pouring out of my pants. It was the worst thing ever. Sending you big hugs—I definitely get it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630974298.0, "datetime": "2021-09-07T00:24:58", "subreddit": "fuckeatingdisorders", "id": "hbvferc", "text": "Mariah Vitoria on YT has been really honest about how fasting totally fucked up her system. It is NOT healthy or magical or detoxing. It’s dangerous.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637956364.0, "datetime": "2021-11-26T19:52:44", "subreddit": "fuckeatingdisorders", "id": "hm6udta", "text": "He is very clearly an exercise bulimic. It’s sad but I hope he gets over it at some point.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641153474.0, "datetime": "2022-01-02T19:57:54", "subreddit": "fuckeatingdisorders", "id": "hqz3pp5", "text": "Grossest that it’s made me do is take so many laxatives that I’d have to shit in trash cans in the basement since I couldn’t make it to the bathroom.  I forced my husband to work a super stressful job for years because I couldn’t handle a full time job so I worked only part time.  I focus only on myself and this disease has made me so, so selfish.   Thank you all for sharing your stories too—it makes me feel less alone.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644374585.0, "datetime": "2022-02-09T02:43:05", "subreddit": "fuckeatingdisorders", "id": "hw685pr", "text": "I know that my looks are worse at a lower weight than when I’m about 20 lbs up—better color, fuller cheeks, and more boobs/butt.  It’s honestly my motivation to recover.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644784862.0, "datetime": "2022-02-13T20:41:02", "subreddit": "fuckeatingdisorders", "id": "hwtmgq7", "text": "This is great!  I need a good kick in the butt to help me realize that gaining some weight is good. This might be the kick I needed—I want to shave my pits so bad!  But the razor won’t fit….duh, why didn’t I think it wasn’t related to me weight before?  It totally makes sense.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645387282.0, "datetime": "2022-02-20T20:01:22", "subreddit": "fuckeatingdisorders", "id": "hxqr3iq", "text": "My husband is bipolar 1 and when he is manic (happens rarely now that he’s on decent medication), he is extremely proud of how little he sleeps and how “creative” he feels.  Even though he is clearly in a very bad state to anyone looking in from the outside.  When we are in the ED we have a skewed view of what’s happening…we think we are doing it all “right” yet we are going against what our body’s limits are.  Doesn’t help that society reinforces how great it is to be thin and disciplined.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647717682.0, "datetime": "2022-03-19T19:21:22", "subreddit": "fuckeatingdisorders", "id": "i1bd26g", "text": "Malnutrition can elevate your cholesterol for sure—mine got better when I upped my intake of fat too. Amazing how our bodies work, isn’t it?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649527400.0, "datetime": "2022-04-09T18:03:20", "subreddit": "fuckeatingdisorders", "id": "i429b5u", "text": "I’ve actually had people say that to me too. My BMI is below UW.  Lots of people don’t think you look “anorexic skinny” unless you are literally dying.  Society normalizes UW bodies and most people that are ignorant say things like that because they don’t realize the truth.  Honestly my doctor thinks my ideal weight is more like the standard “overweight” category just because of my build.  And yeah, most people with EDs are not UW.  I’m sorry you had to go through that because I know it’s invalidating AF.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650050571.0, "datetime": "2022-04-15T19:22:51", "subreddit": "fuckeatingdisorders", "id": "i4vaaex", "text": "I’m 40 and have had this shitty illness for 20 years.  I have a permanently messed up digestive system and whenever I eat, I get horrible bloating because my system just doesn’t move.  I have awful scraggly hair that breaks like straw, I am constantly exhausted and I basically sacrificed my whole life for this stupid disease.  Please, you don’t want this. It’s a horrible existence.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651940177.0, "datetime": "2022-05-07T16:16:17", "subreddit": "fuckeatingdisorders", "id": "i7owvhh", "text": "Oh yeah I definitely have to watch the fiber. I try to avoid lots of it and focus instead on things like peanut butter toast on white bread and graham crackers with Nutella on them and a banana.  Stuff like that really makes eating more possible.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653440955.0, "datetime": "2022-05-25T01:09:15", "subreddit": "fuckeatingdisorders", "id": "i9vnsml", "text": "I always craved highly flavorful food—tons of condiments and spices. I think I was trying to make up for it not having many calories.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653931232.0, "datetime": "2022-05-30T17:20:32", "subreddit": "fuckeatingdisorders", "id": "iakdcj8", "text": "Never heard of these but I am going to check them out! What a good concept. I hate when my jeans get too tight.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653932327.0, "datetime": "2022-05-30T17:38:47", "subreddit": "fuckeatingdisorders", "id": "iakftb0", "text": "I know you can’t move out right now but holy shit, that is such a toxic environment. I would try to leave when you can. Are there any friends or relatives who are safe places to eat with? So at least you won’t be subjected to his shitty comments while you eat?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655649825.0, "datetime": "2022-06-19T14:43:45", "subreddit": "fuckeatingdisorders", "id": "icy5wky", "text": "1) Being a great wife and a fun aunt to my nieces and nephews \n\n2) Being a kind and selfless person, which is the opposite of what ED makes me\n\n3) Being the best dog mom to my fur baby. She absolutely doesn’t care what my body looks like.\n\n4) Being a helping partner at home and a valuable contributor at work. ED makes those things difficult sometimes.\n\nYou’re right—there’s so so much more to life than how we look. I’m also at the “IDGAF” stage of my life where I’m not trying to impress anyone anymore. So why do I still let ED have its way?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656108013.0, "datetime": "2022-06-24T22:00:13", "subreddit": "fuckeatingdisorders", "id": "idm5r9m", "text": "I would pity the person who had it because my body looks sick. I wouldn’t hate it, but when I see it in pictures I can tell it’s not healthy yet.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656203090.0, "datetime": "2022-06-26T00:24:50", "subreddit": "fuckeatingdisorders", "id": "idr038j", "text": "Yeah same here. I have literally wasted 20 years just trying to be thin. Fuck that noise. I’m also just going to go for it because this is such a stupid illness.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656281845.0, "datetime": "2022-06-26T22:17:25", "subreddit": "fuckeatingdisorders", "id": "iduwvh5", "text": "Kailin Heals, I think is her channel—she never made content when she actively had ED but now she makes videos on unrestricted eating, how to combat diet culture. Bonus—she has a very normal body. Not rail thin.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656860085.0, "datetime": "2022-07-03T14:54:45", "subreddit": "fuckeatingdisorders", "id": "iepbc59", "text": "My grandma too—she always criticized my mom and her sisters for being fat and lazy and that all us grandkids better be good at school because no man would ever be attracted to us. She was so toxic and I’ve actually totally lost contact with her now because I just do not need that in my life right now.  Also, she herself is morbidly obese and has tons of health problems. So yeah, I just don’t understand that mindset. The further you can distance your self from these people the better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657488924.0, "datetime": "2022-07-10T21:35:24", "subreddit": "fuckeatingdisorders", "id": "ifn8e60", "text": "I want my hair and nails back. I am sick of being freezing all the time. I’m sick of having my day revolve around food and what I can or can’t eat. I just want my life back.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658079125.0, "datetime": "2022-07-17T17:32:05", "subreddit": "fuckeatingdisorders", "id": "igjganv", "text": "Mine’s falling out too. And it did get worse when I started eating more but I think that’s normal because your body is prepping for new hair growth and all that extra food is going to our organs and muscles first. Unfortunately hair comes last…but keep up the eating because it’ll come back after a while. It’s definitely freaky to see it falling out. It is not a pleasant thing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1661110663.0, "datetime": "2022-08-21T19:37:43", "subreddit": "fuckeatingdisorders", "id": "il8ay9f", "text": "I’m wondering if he’s older. I’ve found many older practitioners adhere to that advice. Like, get to normal BMI and then stop. Except that your body doesn’t know what BMI to shoot for because bmi is bullshit. I would try to find a new doctor, but in the meantime just keep eating what you want.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1662915060.0, "datetime": "2022-09-11T16:51:00", "subreddit": "fuckeatingdisorders", "id": "io0ajw5", "text": "Sugar helps with my hydration I think—I feel more energetic when I eat it. I hate that it is so demonized because when you are malnourished you do need the fuel.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1662917233.0, "datetime": "2022-09-11T17:27:13", "subreddit": "fuckeatingdisorders", "id": "io0g90y", "text": "I’ve actually never tried any of the Arctic Zero/halo top type things. Mainly because I am cheap and I cannot justify paying that much money for air and ice, haha. At least with Ben and Jerry’s you get some good ice cream.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1663892622.0, "datetime": "2022-09-23T00:23:42", "subreddit": "fuckeatingdisorders", "id": "ipjgne3", "text": "Me too. My mom is dead and my dad remarried and moved away and barely talks to me. Granted I’m older, but it still stings. I think I use ED to tell people that I need to be cared about or something.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1664130300.0, "datetime": "2022-09-25T18:25:00", "subreddit": "fuckeatingdisorders", "id": "xnuxv0", "text": "I physically cannot do it anymore. Which is good for my recovery because I am eating a lot more. It’s like once I started eating, I can’t go back. What’s even MORE frustrating is my stupid therapist telling me “well if you miss restricting after you try recovery, just go back”. Because I can’t. I feel like they tricked me or something. I’m still going to continue to recover because I pretty much have to at this point. I’m just venting…it just frustrates me that my body will not cooperate any more with my bullshit.", "title": "I’m sort of mad that I can’t restrict anymore.", "context": null}
{"type": "comment", "timestamp": 1664140872.0, "datetime": "2022-09-25T21:21:12", "subreddit": "fuckeatingdisorders", "id": "ipw40v6", "text": "Yeah I think she says it to let me know that I could go back if I wanted to. It kind of makes sense but my ED really hates her saying it. It just reinforces that I can’t really do it anymore even if I did want to.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1664140949.0, "datetime": "2022-09-25T21:22:29", "subreddit": "fuckeatingdisorders", "id": "ipw47po", "text": "Yeah that’s what’s getting me through it.  That I actually feel much better…I didn’t like being cold and foggy all the time.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665337398.0, "datetime": "2022-10-09T17:43:18", "subreddit": "fuckeatingdisorders", "id": "irnr2s9", "text": "I worked with an ED specific dietitian who always encouraged me to honor EH, even if my doctor or therapist would have me stick to a meal plan. Basically, once you are out of any refeeding danger, you can and should eat as much as you need and want.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1666547843.0, "datetime": "2022-10-23T17:57:23", "subreddit": "fuckeatingdisorders", "id": "ithfq6n", "text": "Yes! I found my whole face shape changed when I got weight restored the first time and it sent me into relapse. I wish I could recover and keep my low normal BMI, but my body just genuinely isn’t happy there.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1666550062.0, "datetime": "2022-10-23T18:34:22", "subreddit": "fuckeatingdisorders", "id": "ithlk75", "text": "Mine likes in person sessions but she might take virtual clients. DM me and I’ll give you the website.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1667677716.0, "datetime": "2022-11-05T19:48:36", "subreddit": "fuckeatingdisorders", "id": "iv6xh3w", "text": "I know what you mean. My EH episodes are fairly chaotic. I eat a lot of random things and it usually adds up to a LOT of food. I don’t think people portraying it online are necessarily posting everything if they actually are honoring EH.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669407740.0, "datetime": "2022-11-25T20:22:20", "subreddit": "fuckeatingdisorders", "id": "ixrpkuz", "text": "I acknowledge that I haven’t worked through Al my internalized fat phobia. I do know I have to do it though because it’s toxic. What’s odd is that I honestly had less thought about my body when I was fat than I do now. That’s what ED does to your head. It lies to you so much about how “bad” it is to be fat when in reality, I felt much better then. It gets easier for me the more I realize that my body is going to win anyway. I may as well enjoy eating and not worry about it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670169243.0, "datetime": "2022-12-04T15:54:03", "subreddit": "fuckeatingdisorders", "id": "iyvtd6q", "text": "I’m short and I need like 2300 or so to maintain. I HATE that every diet plan out there puts you on 1200 a day.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670626546.0, "datetime": "2022-12-09T22:55:46", "subreddit": "fuckeatingdisorders", "id": "izlawrg", "text": "Yep. It’s all I look forward to anymore. Also going to bed at 10:00pm tonight btw.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1673810431.0, "datetime": "2023-01-15T19:20:31", "subreddit": "fuckeatingdisorders", "id": "10cs9vr", "text": "I need to rant. I hate it when I see influencers talk about wanting to gain weight, but doing it “healthy”.  If you are needing to gain weight, any way you do it will be healthier than staying at a lower weight. It makes me so irritated that they want to stick to safe foods and eat “healthy” and only gain “muscle” when they do need to gain fat too. Grr! Ok, rant over. Eat what you want!!", "title": "Gaining weight “healthily”…", "context": null}
{"type": "comment", "timestamp": 1673812296.0, "datetime": "2023-01-15T19:51:36", "subreddit": "fuckeatingdisorders", "id": "j4hk0p3", "text": "Thank you!! I’m glad I’m not the only one who notices stuff like this. It sends a dangerous message that there’s a right and wrong way to gain weight. Which, as we know, there isn’t.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1673822793.0, "datetime": "2023-01-15T22:46:33", "subreddit": "fuckeatingdisorders", "id": "j4ibzo6", "text": "Fat is a hormonally active tissue. If you are underweight, you need more fat.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1673822859.0, "datetime": "2023-01-15T22:47:39", "subreddit": "fuckeatingdisorders", "id": "j4ic5q2", "text": "I can assure you that most underweight and restricted individuals don’t have fatty liver disease.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1673823051.0, "datetime": "2023-01-15T22:50:51", "subreddit": "fuckeatingdisorders", "id": "j4icn7u", "text": "That could be underweight for your frame—BMI is not a concrete number. I have to be at BMI 22 in order to menstruate…much lower than that and I get my hormones thrown way off.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1673824061.0, "datetime": "2023-01-15T23:07:41", "subreddit": "fuckeatingdisorders", "id": "j4if6s1", "text": "Um, how? You don’t need to eat just healthy foods to gain weight “healthy”. And many of us need to rest more because of hormone disruptions. I hardly think suggesting any weight gain at all is “fighting fire with fire”.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1673827044.0, "datetime": "2023-01-15T23:57:24", "subreddit": "fuckeatingdisorders", "id": "j4imi3z", "text": "You can eat “unhealthy” food and still gain weight “healthy” because you don’t need to only eat peanut butter and avocados to put on weight. You can eat cookies and cake and such and you’ll gain weight—it will still be healthy for your body to get back to where it needs to be. It just irritates me that people think the only good way to gain weight is by eating more “clean” foods and weight lifting.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1676068019.0, "datetime": "2023-02-10T22:26:59", "subreddit": "fuckeatingdisorders", "id": "j81emig", "text": "I right now can only tell when I am physically full. It only happens after I eat a massive amount of food because I don’t have normal leptin and ghrelin levels yet. I remember a time as a kid when I would eat my food and not actually want more. But then again, I’ve always had a large appetite. I’m not sure what it feels like to eat an actual normal amount of food and not want more though.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1676148381.0, "datetime": "2023-02-11T20:46:21", "subreddit": "fuckeatingdisorders", "id": "j85p5z9", "text": "I’ve gotten comments like that too. A few people have said “Well at least you aren’t fat in your middle age, unlike most women. You must have a lot of self discipline!”. It makes it so hard to recover.", "parent_id": null, "link_id": null, "context": null}
