{"type": "comment", "timestamp": 1716842708.0, "datetime": "2024-05-27T20:45:08", "subreddit": "ARFID", "id": "l5xlu1r", "text": "Thankfully I’m not but my bio dad worked hard to make me feel that way but I was a bit rebellious about things I couldn’t change and got angry instead of ashamed. By 57 I’ve gotten used to being the major problem when it comes to meal time. A few months ago when I learned about ARFID it was a relief to know I have an ED. \n\nI’ve always been the pickiest eater anyone knows. As a kid I learned to bring food for myself any time we went anywhere. I learned to cook at an early age and took over cooking for the family as a preteen including doing menu planning and grocery shopping with mom. I’m the one who makes other people feel better about their picky eating kids. Typical “picky eaters” feel so much better after meeting me because they aren’t “that bad.” \n\nHaving lived with this for so long I’ve learned how to deal with family, friends, restaurants, bosses, and explaining why I probably won’t be able to eat food cooked at peoples houses. For many years I had a handy list of safe foods and at the top it stated only specific brands, cooked exactly right so better to let me cook it there or bring to reheat, and a number of other factors so no food was a a given until right before it was time to eat although certain packaged snacks and cheese (unless I was having dairy issues which come and go) were safer than anything cooked. \n\nThe foods I can eat have expanded over the years. Some of my safe foods are the same from childhood. Other safe foods from childhood no longer are safe. \n\nI hope you all find ways to get over your sense of shame as well as add additional foods to your safe list.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716842776.0, "datetime": "2024-05-27T20:46:16", "subreddit": "ARFID", "id": "l5xm0gn", "text": "Very relatable. I’m starting a meal kit service this week.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716918170.0, "datetime": "2024-05-28T17:42:50", "subreddit": "ARFID", "id": "l61y5o0", "text": "Mac and cheese in the microwave has been a go to meal for me at times. I mean this: go you for making hot food. Many days I’m eating cold cereal as a snack without milk. Any food eaten is good food. Be proud you ate. It’s hard to switch our minds to that but seriously food is a necessity so eating always trumps not eating and is a positive.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716918370.0, "datetime": "2024-05-28T17:46:10", "subreddit": "ARFID", "id": "l61yqfl", "text": "Total bitch. Good for you for bringing foods you can eat. I’m so proud of you for doing so instead of skipping meals. It takes courage and bravery to bring and eat easy safe foods to work.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716918562.0, "datetime": "2024-05-28T17:49:22", "subreddit": "ARFID", "id": "l61za7b", "text": "Yeah my dad was into shoving food literally down my throat and making me sit at the table until I finished. My mom didn’t do those and dad wasn’t around much but mom didn’t stop him which I now suspect was due to abuse I didn’t see/know about when he was drunk, his normal state. To say he made my relationship with food worse is an understatement. I’m sorry you also went through this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716921689.0, "datetime": "2024-05-28T18:41:29", "subreddit": "ARFID", "id": "l6285ky", "text": "It’s wrong of me not to remember that is a side of ARFID. I’m sorry.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716924560.0, "datetime": "2024-05-28T19:29:20", "subreddit": "ARFID", "id": "l62gdta", "text": "I’m an over snacker myself unless I’m in my “all food is gross so I’m not eating”. I’ve gotten better over time, I’m 57, at being able to eat small breakfast and dinner. Most of my life I was underweight starting at birth. Sometime in my 30s I began keeping weight on. Most of what I eat is junk food. Dinner is generally a good protein as I’ll eat a small amount of beef, chicken, or pork. No veggies. Sometimes a little stuffing or mashed potatoes completely drowned in gravy needing a spoon. My snacks are various chips, candy, or kids cereal eaten dry.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1716994251.0, "datetime": "2024-05-29T14:50:51", "subreddit": "ARFID", "id": "l66k0gt", "text": "Yep, I’m about to start trying new foods again. Thanks to reading so many post here I know it takes multiple tries before I’ll like it. I’ll count it a win anytime the new food isn’t an instant hate & gag. Over the last couple years I’ve been able to eat broccoli stalks but not florets. Broccoli was definitely a no way no how food in my childhood. The florets are a texture problem.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1717786796.0, "datetime": "2024-06-07T18:59:56", "subreddit": "ARFID", "id": "l7kjpt7", "text": "I can handle a little bit of bbq sauce on a burger but that’s only since my 30s. I can do a few brands of Italian salad dressing and occasionally handmade balsamic vinegar dressing on salad. Otherwise I use salt on tomatoes and cucumbers. My salads are fairly plain: tomatoes, skinned cucumbers, iceberg lettuce (starter to tolerate romaine occasionally), grated carrots, I do like crushed tortilla chips, and grated cheese in salad as well as sour cream LOL. No mayo, ketchup, mayonnaise, mustard, ranch on anything ever. Tomato sauce belongs on pasta or pizza or for dipping fried mozzarella sticks, or bread sticks in. I do enjoy some olive oil and garlic/herb dipping combos for rolls & soft bread sticks.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718238303.0, "datetime": "2024-06-13T00:25:03", "subreddit": "ARFID", "id": "l8cqs3n", "text": "I eat cucumber but many times not if skin is still on. Carrots are another sometimes, baby carrots are usually ok. Tomatoes I eat if cut in half and I can sprinkle salt or dip in Italian salad dressing. No on shrimp or corn dogs. Sometimes I like a corn muffin. A few times a year I can eat a hot dog.\n\nNow if it was steak, mashed potatoes, and gravy I’d be in heaven. Or grilled cheese with mashed banana.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718242491.0, "datetime": "2024-06-13T01:34:51", "subreddit": "ARFID", "id": "l8d16vl", "text": "I’m 57 and have had many years to add things to my safe foods even though I only learned about ARFID this year. It is always interesting to see how different peoples safe foods are. I still think of myself as “most unique super duper pickiest person in the universe”. I hadn’t written down a safe food list in many, many years. Sometime in the last week or two I did a safe food list on a thread here and was shocked at how few things had “specific brand, cooked only one exact way, only if I’m in right mood, changes frequently over a couple hours”. My safe food list in ~2004 almost every one of the 15-20 items had that next to it. \n\nI prefer grape tomatoes cut exactly in half to cherry tomatoes as cherry are a little too big for my mouth. I can eat cherry cut into fourths and regular tomatoes if that’s what’s available.\n\nSalad is fairly new safe food. It was a rare thing for me to eat until some time in my mid/late 30s. Prior to that I’d occasionally pick out the tomatoes and cucumbers if they didn’t have dressing and eat them plain. I had a low blood pressure problem in my mid-20s/early-30s and doctors insisted I eat more salt which is when I forced myself to add salt to things I used to prefer plain. Now I prefer with salt or Italian dressing (able to eat most brands)\n\nI cut all gristle and fat off my steak as well as any meat touching them. So I understand why you don’t like it. I prefer to get lean cuts and cook on grill or under broiler so less greasy. I’ve been known to pat with paper towels to degrease. LOL\n\nFor mashed foods they must be perfectly mashed, no lumps. Same with gravy, no lumps. I don’t actually like potatoes much but I love my homemade super duper too much garlic mashed potatoes with gravy or sour cream - the potatoes are simply an acceptable delivery for those. Like one thin layer of potatoes and 2x of gravy, eat with spoon. 🤣\n\nOne of the cooking tricks that has helped increase the number of safe foods for me is to use tons of seasoning to drown out taste of foods I don’t care for. I didn’t realize that’s what I’ve done for most of my life until I heard about ARFID and was reading various ways people use to make an unsafe food safe and a lightbulb went off. In many cases where a recipe calls for a teaspoon of this, a 1/2 teaspoon of that, I multiple each by 4. Recipe calls for 4 garlic cloves I use a head of garlic. I don’t automatically increase as above. Each time I cook something I increase a little until it smells and taste right. I cook based on smell because I’m not eating food that is gross and then not able to eat dinner. Plus since I cooked different food for my family than I did for me I had to learn how to know it was right as no way was I getting it anywhere near my mouth. \n\nProcessed food is reliable. Always same shape, texture, smell, taste. Many of us with ARFID are wedded to specific brands or restaurants because it exactly the same every time.\n\nBeing able to cook is probably going to help you a lot in increasing your safe foods over time. Especially since you are able to cook foods you won’t eat. It has for a number of us. \n\nIt can be difficult to say ewwww gross respectfully - your doing a great job of that. I commend you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718287590.0, "datetime": "2024-06-13T14:06:30", "subreddit": "ARFID", "id": "l8fe9lr", "text": "Dipping veggies is the way I like them so I can control how much on each.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718300466.0, "datetime": "2024-06-13T17:41:06", "subreddit": "ARFID", "id": "l8ggi7r", "text": "Yes", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718573418.0, "datetime": "2024-06-16T21:30:18", "subreddit": "ARFID", "id": "l8wyqmj", "text": "What a great idea. Congrats on adding so many fruits to your list.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718579142.0, "datetime": "2024-06-16T23:05:42", "subreddit": "ARFID", "id": "l8xchux", "text": "I love that. So cool. I think you’ve given a number of us a way to incentivize ourselves. Thanks and congrats again. We need victory stories to remind us we can get better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718942370.0, "datetime": "2024-06-21T03:59:30", "subreddit": "ARFID", "id": "l9kh2v0", "text": "Grilled cheese with banana", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718942411.0, "datetime": "2024-06-21T04:00:11", "subreddit": "ARFID", "id": "l9kh5qb", "text": "OMG I’m going to have to try that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718942455.0, "datetime": "2024-06-21T04:00:55", "subreddit": "ARFID", "id": "l9kh8qp", "text": "That sounds yummy. Know what I’m making soon.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718942548.0, "datetime": "2024-06-21T04:02:28", "subreddit": "ARFID", "id": "l9khf8x", "text": "I love those. Sometimes I have them as is. Other times I use them in making protein smoothies.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718942613.0, "datetime": "2024-06-21T04:03:33", "subreddit": "ARFID", "id": "l9khjpu", "text": "The only way I’ll eat peas is if I’m picking them & then I eat them out of the pod.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718942688.0, "datetime": "2024-06-21T04:04:48", "subreddit": "ARFID", "id": "l9khoy6", "text": "I love Brie cheese. Do you ever bake it to make it warm and gooey?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718942842.0, "datetime": "2024-06-21T04:07:22", "subreddit": "ARFID", "id": "l9khzmo", "text": "I can only eat the pineapple cottage cheese. Although I had a different fruit one last year and it was ok. Haven’t seen it again.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1719179301.0, "datetime": "2024-06-23T21:48:21", "subreddit": "ARFID", "id": "l9yohjh", "text": "Blood taste gross to me so I’ve had mixed feelings on becoming a vampire.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1719179871.0, "datetime": "2024-06-23T21:57:51", "subreddit": "ARFID", "id": "l9ypz1z", "text": "I’d much prefer a pill or even a couple pills to a smoothie. I’ve yet to find a protein/meal replacement drink that wasn’t disgusting to me. 3 pills a day each as a full meal replacement I’m down for. \n\nIf IVs didn’t cause me to lose it mentally demanding they be removed RIGHT NOW or I’ll pull them out I’d be ok with getting a daily nutrient treatment that way. I managed one a week for a month for iron infusions to recover from anemia but it didn’t get easier and the amount of Xanax my doctor authorized I’m surprised I was able to drive. Panic attack just remembering the experience. Argh", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1719181264.0, "datetime": "2024-06-23T22:21:04", "subreddit": "ARFID", "id": "l9ytk5o", "text": "Each to their own. I gag when I accidentally taste my own blood which happens too frequently due to spontaneous morning bloody noses where I wake up to blood dripping down my throat. LOL 😝", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1719242337.0, "datetime": "2024-06-24T15:18:57", "subreddit": "ARFID", "id": "la26iez", "text": "We knew the cause of my anemia and were able to fix it (partial hysterectomy) the anemia saved my life until I could get the surgery and topped me off giving my body time to heal. \n\nI’m extremely lucky that I can go up and down on Xanax as needed even after being on it for over 25 years. For the IV infusions he had me taking 2-3mg instead of my usual 0.5mg. I’m on 0.25mg  atm and only take as needed although sometimes I need to double or triple how much in specific situations. It’s definitely been years since I could cut the 0.25 in half but it wouldn’t surprise me if in the next year or two I was able to cut back as I’m having fewer attacks.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720730114.0, "datetime": "2024-07-11T20:35:14", "subreddit": "ARFID", "id": "lcqc6ko", "text": "WTG. Bananas are awesome. Yummy on their own. Yummy banana pancakes, banana bread, strawberry banana smoothies. Yummy yummy in my tummy. YUMMY", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720730174.0, "datetime": "2024-07-11T20:36:14", "subreddit": "ARFID", "id": "lcqccv1", "text": "Strawberries are so good with bananas. Maybe try them mashed together instead of separate & see if they hook you that way.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720730870.0, "datetime": "2024-07-11T20:47:50", "subreddit": "ARFID", "id": "lcqehne", "text": "ROTFL great joke.\n\nOh I get it. No food should touch other food was one of mine until recently. Now I’ve no idea what falls under the rule and what doesn’t. Some days I don’t panic when it happens I just eat the food. I’m funny about what can be mixed and what can’t. It’s great being around people who get our rules that look weird to people without ARFID because they aren’t consistent under all circumstances for every single food. New foods can change everything sometimes. It’s like woah wouldn’t that be good with x & all of a sudden… yeah and that’s how my salad went from iceberg lettuce to just about anything I’m served as long as it’s no dressing as I’m still just one kind of dressing. 😂", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721023796.0, "datetime": "2024-07-15T06:09:56", "subreddit": "ARFID", "id": "ld955sb", "text": "Congrats. Thanks for sharing your success.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721982100.0, "datetime": "2024-07-26T08:21:40", "subreddit": "ARFID", "id": "lf059kx", "text": "Good for you", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722381468.0, "datetime": "2024-07-30T23:17:48", "subreddit": "ARFID", "id": "lfqail3", "text": "Always nice to find out not the only one", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722381482.0, "datetime": "2024-07-30T23:18:02", "subreddit": "ARFID", "id": "lfqajxq", "text": "Ewww", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722381587.0, "datetime": "2024-07-30T23:19:47", "subreddit": "ARFID", "id": "lfqaugs", "text": "Just reading about this has me gagging", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722524120.0, "datetime": "2024-08-01T14:55:20", "subreddit": "ARFID", "id": "lfzfzoh", "text": "I say I’m allergic to restaurants I don’t trust to get it right as I’ve sent food back and too frequently it’s obvious they tried scraping the things things off - like gross. I was a waitress for a few years in my 20s and remember how some staff took offense and ignored special orders. \n\nSeafood is my main gag/vomit and only junk food snacking for days. This problem started in the womb per se as I had dairy issues and had to go on soy formula which came out the year before I was born. I’m not sure why my mom didn’t give up dairy once it was confirmed that was the problem. As soon as solid foods were introduced if I didn’t like something I refused to eat anything for hours and if they tried to reintroduce it I refused to taste it and refused to eat anything else for hours. I learned not to trust people before I was one.\n\nI also have some food sensitivities, not actual allergies, I’m not going to end up in ER or die, but I’ll end up with painful digestive problems, bloody noses, congestion, migraines for a few days. Not fun. \n\nHopefully some time in the future people will be respected when it comes to special requests and we won’t have to lie. I feel like preferences should be respected whether they are life threatening or simply dislikes.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723153168.0, "datetime": "2024-08-08T21:39:28", "subreddit": "ARFID", "id": "lh6ev7v", "text": "Oh definitely. Sometimes I’ll see a food and think that looks so yummy. But if put in front of me I’d run away.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723154133.0, "datetime": "2024-08-08T21:55:33", "subreddit": "ARFID", "id": "lh6hs83", "text": "Yeah not saying anything out loud. I’ve been getting braver about trying things but only at home where the only person seeing me is my roommate who will happily eat what I can’t and no judgment. \n\nI didn’t see your post of ARFID. These books might help you.\nThe Picky Eater’s Recovery Book: Overcoming Avoidant/Restrictive Food Intake Disorder by Jennifer J. Thomas, Kendra R. Becker, Kamryn T. Eddy \n\nColor Taste Texture: Recipes for Picky Eaters, Those with Food Aversion, and Anyone Who’s Ever Cringed at Food by Matthew Broberg-Moffitt", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723154527.0, "datetime": "2024-08-08T22:02:07", "subreddit": "ARFID", "id": "lh6iyko", "text": "I keep a bunch of info handy to share in notes on my phone/tablet. I need to write a couple post so I can just grab the links on cooking, meal prep, snacking, how to get more food/protein/calories, etc so I don’t keep writing from scratch. LOL", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723166362.0, "datetime": "2024-08-09T01:19:22", "subreddit": "ARFID", "id": "lh7fc7x", "text": "Yep safe foods is correct", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723166433.0, "datetime": "2024-08-09T01:20:33", "subreddit": "ARFID", "id": "lh7fisn", "text": "Aww that’s like the perfect way to try a new food", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723803768.0, "datetime": "2024-08-16T10:22:48", "subreddit": "ARFID", "id": "lidtm8x", "text": "Horrid. I would have failed too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724355375.0, "datetime": "2024-08-22T19:36:15", "subreddit": "ARFID", "id": "ljfgorc", "text": "Flavor definitely transfers if cooking things open in the oven. Whenever possible I wrap my food in aluminum foil twice if my food is in with other foods. Unfortunately it doesn’t work with all foods. For example roasted veggies and fries/chips come out soggy if they’re covered/wrapped which most people don’t like.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724355464.0, "datetime": "2024-08-22T19:37:44", "subreddit": "ARFID", "id": "ljfgyj3", "text": "Such BS. Picking out things we can’t eat doesn’t work much of the time as flavor is there as well as small pieces of food eww gross\n\nEdit: typo", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724356436.0, "datetime": "2024-08-22T19:53:56", "subreddit": "ARFID", "id": "ljfk2oy", "text": "A baked potato works great in this situation. But not if you’re in the mood for chips. I haven’t used a toaster oven in years but if I lived at home I’d be trying to convince my family it’d be perfect for me. I loved my mom’s last house as she had a double oven. When I’d visit, frequently for a month, she’d make the bottom one mine except for the big holiday meal but most of the time we managed even for that to be only food I could eat.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724428561.0, "datetime": "2024-08-23T15:56:01", "subreddit": "ARFID", "id": "ljkb3pu", "text": "Definitely a number of us are super tasters. Also the fewer foods we eat the more sensitive to teeny tiny differences which is why we become so brand/ specific restaurant dependent. And so much of how a food taste is based on how it smells. We don’t want to eat next to open rotting garbage because the smell spoils the taste of food. People without ARFID understand that but can’t stretch the analogy to foods that make us gag or that it taints our food even if it’s not super stinky to them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724428726.0, "datetime": "2024-08-23T15:58:46", "subreddit": "ARFID", "id": "ljkbmyb", "text": "Super taster doesn’t actually mean food taste better. It specifically refers to a few extra taste buds which causes things like cilantro/coriander to taste like soap (most common). It restricts foods one can enjoy because of how they taste to us is very different and than to non-super tasters.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724429052.0, "datetime": "2024-08-23T16:04:12", "subreddit": "ARFID", "id": "ljkcoa6", "text": "OMG they are so different. It’s in the name “sour”dough literally is slightly sour although unlike us many people don’t taste the sour/bitter . I was brought up on whole grain homemade wheat bread. As a kid white bread was literally tasteless I couldn’t understand why anyone ate it. As I’ve had it more over time it’s not as tasteless - I can tell the difference between many white breads. I also understand why people like it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724429311.0, "datetime": "2024-08-23T16:08:31", "subreddit": "ARFID", "id": "ljkdhmy", "text": "Yeah I love silicone for a lot of things but they will take on the flavor of strong foods and impart it on other foods and people are wrong that cleaning it solves the problem. Having 2 liners works though if one is for bland things like fries and the other is for everything else as long as they are different colors.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724435216.0, "datetime": "2024-08-23T17:46:56", "subreddit": "ARFID", "id": "ljkw6f2", "text": "I love the texture and always take the crust off. My housemate made me grilled cheese last night and cut the crust off. First person who doesn’t give me a hard time about it and I’m 57.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724859836.0, "datetime": "2024-08-28T15:43:56", "subreddit": "ARFID", "id": "lkcvo3y", "text": "LOL. Me calculating so I can eat the best first. Never know what might happen and prevent me from finishing my meal I always want to make sure I get the best tasting. The yuckiest is eaten in the middle so I ate enough for a meal and have something ok for final bites. Dessert is a couple hours later.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724960444.0, "datetime": "2024-08-29T19:40:44", "subreddit": "ARFID", "id": "lkk09ij", "text": "It depends on a number of factors for me but I’m not big on soup too many texture issues as well as ingredients I have issues with. The biggest is mood for the few soups I like. I have to be in the right mood which only happens a few times of year for all combined. \n\nI love French onion soup with a large piece of bread and melted cheese is optional. I eat the bread and cheese and sip on a little bit of the broth. I never eat the onions. I give them to whoever I’m dining with. It’s a texture thing.\n\nI like some tomato soups - imagine, pacific, and sometimes condensed but I have to be in the right mood. I take slightly toasted garlic bread and dip it in the soup. But I’m rarely in the mood. \n\nChicken noodle occasionally. I only eat the noodles not veggies. I used to make this twice a year for Passover and Sukkot (Jewish holidays).\n\nWonton soup I eat the wontons and a little bit of the broth only at a few Chinese restaurants.\n\nA few years ago I got into cold fruit soups in the summer. I haven’t had them in years. I should look for my recipes.\n\nOther than those keep soup away from me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725324345.0, "datetime": "2024-09-03T00:45:45", "subreddit": "ARFID", "id": "ll8f11t", "text": "I’m psychic", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725333326.0, "datetime": "2024-09-03T03:15:26", "subreddit": "ARFID", "id": "ll91nrh", "text": "Maybe I should try jumping off bridges and tall buildings I might like it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725362771.0, "datetime": "2024-09-03T11:26:11", "subreddit": "ARFID", "id": "llafd2r", "text": "Good for you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725585915.0, "datetime": "2024-09-06T01:25:15", "subreddit": "ARFID", "id": "llq5afw", "text": "I’ve reported them", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725652051.0, "datetime": "2024-09-06T19:47:31", "subreddit": "ARFID", "id": "llugs55", "text": "As long as we continue to support each other the troll loses. If you see a suspicious post report it to the mods.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725652114.0, "datetime": "2024-09-06T19:48:34", "subreddit": "ARFID", "id": "llugz96", "text": "Thanks for the work you do. It’s greatly appreciated. I’ve modded on other platforms and know how difficult it can be.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725750384.0, "datetime": "2024-09-07T23:06:24", "subreddit": "ARFID", "id": "lm11ky4", "text": "I don’t eat seafood but I have trauma around it thanks to bio dad and force feeding. Over the last few years I’ve been able to start handling, cooking, and eating my food if I can smell seafood which are all huge victories. I don’t think I’ll ever be eating it. At 57 I’m trying to add more vegetables and fiber but don’t feel the need to push myself on this one. \n\nWe are all so different in what our safe foods are. I know for many it’s beige foods and mostly a specific brand/restaurant but that’s not the case for all of us. I cook a lot, I’m a big meat eater, love fruit, use tons of herbs and spices, my safe foods have so many different ways they can be prepared.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725750566.0, "datetime": "2024-09-07T23:09:26", "subreddit": "ARFID", "id": "lm12241", "text": "I used eat tuna melts a few times a year - open face tuna fish sandwich with cheese melted in an oven but I can’t anymore although I still get the craving.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725844956.0, "datetime": "2024-09-09T01:22:36", "subreddit": "ARFID", "id": "lm7ljfm", "text": "I take an hour break after breakfast because eating is exhausting. Dinner doesn’t require the same kind of down time but it’s a chore to sit for meals. I do ok if I snack while reading or playing games but just eating to eat is not my thing unless I’m out at a favorite restaurant. \n\nThis week I’ve skipped dinner as we’ve run out of safe food in the house and grocery shopping hasn’t been doable. My housemate has had a few things they can eat. If I ignore my hunger cues after an hour they disappear.\n\nI’m lucky that while there are a number of foods I won’t eat the ones I will can be prepared a bunch of different ways.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726971991.0, "datetime": "2024-09-22T02:26:31", "subreddit": "ARFID", "id": "loazof4", "text": "Happy birthday. What a fantastic victory.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729552845.0, "datetime": "2024-10-21T23:20:45", "subreddit": "ARFID", "id": "lt36u1n", "text": "I’m not ashamed of having ARFID and in many ways I’m comfortable with my diet as is. Most of the time I’ve reached a point where I have a reasonable varied diet. I don’t care what other people think and have no problem handling situations where someone tries to make my ARFID a problem. Anyone I see regularly has long since stopped pressuring me and for the most part are supportive or indifferent.\n\nOn the other hand I have health issues and making a few changes to my diet by adding more veggies would be a huge help. I’m also getting tired of cooking two versions of things like omelettes or not being able to eat leftovers. I’ve been making changes I want to make for me in my 50s without finding it onerous over the last year. \n\nUnfortunately I’m in my yearly severe depression cycle and I’m back to eating breakfast and not eating dinner or snacks as I’m having problems with a number of my safe foods. Hopefully I’ll be out of this stage by November.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729553182.0, "datetime": "2024-10-21T23:26:22", "subreddit": "ARFID", "id": "lt37ry5", "text": "I think, pending serious health issues, accepting our ARFID restrictions, and having supportive people in our lives may make it easier to then try new foods. It may be different for different people. There’s rarely one right way for everyone.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729553584.0, "datetime": "2024-10-21T23:33:04", "subreddit": "ARFID", "id": "lt38w3b", "text": "I get a kick out of the term recovery as I literally came out of the womb having ARFID - it started with breast milk and showed up as soon as foods were introduced. I can’t recover what never was. I have had some luck expanding what I can eat under ideal situations, if the planets are aligned, and my luck is holding that day.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729553614.0, "datetime": "2024-10-21T23:33:34", "subreddit": "ARFID", "id": "lt38z1i", "text": "Yeah that’s hard.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729565872.0, "datetime": "2024-10-22T02:57:52", "subreddit": "ARFID", "id": "lt45ytl", "text": "Our stories are so interesting and stranger than fiction. \n\nI ended up on the very first soy formula, I was sensitive to dairy, which came out the year before I was born but it had to be modified with yogurt, I know doesn’t make sense but ya know our bodies are weird, and brewers yeast. As soon as they tried foods if I didn’t like it I wouldn’t eat beyond the 1st taste and refused food for a number of hours. Try to give it to me again and I wouldn’t eat it of anything else for 6 hours. No trust in those who’d try to feed me vile gross food after I’d let them know I didn’t like it. At like 4-5 months old. Sometimes I wonder how much this impacted my issues with authority figures.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730160414.0, "datetime": "2024-10-29T00:06:54", "subreddit": "ARFID", "id": "lu9mx0m", "text": "The smell of seafood for much of my 50+ years killed my appetite. Other foods are more hit or miss depending on how I’m doing. Over the last couple of years seafood hasn’t been as bad. I suspect my ability to smell is decreasing and I’m not complaining. \n\nCoffee smells like garbage to me. So bad.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732805794.0, "datetime": "2024-11-28T14:56:34", "subreddit": "ARFID", "id": "lzew7zu", "text": "This looks awesome. Thanks for creating.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732849973.0, "datetime": "2024-11-29T03:12:53", "subreddit": "ARFID", "id": "lzi8fb4", "text": "I’m so sorry", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732850008.0, "datetime": "2024-11-29T03:13:28", "subreddit": "ARFID", "id": "lzi8i9z", "text": "That’s the worst. Solidarity", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732850114.0, "datetime": "2024-11-29T03:15:14", "subreddit": "ARFID", "id": "lzi8qzh", "text": "Great mom. Thanks for understanding and supporting him. We need more people like you in this world.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732851039.0, "datetime": "2024-11-29T03:30:39", "subreddit": "ARFID", "id": "lziau4u", "text": "I second all of this. Not being forced to eat foods would have made for a less complicated relationship with food. So many foods I can’t eat because dad forced them. \n\nMy mom had me in the kitchen with her starting around three. As long as my dad wasn’t around I had a lot of control around food, from planning menus, shopping, cooking, learned to modify recipes for my tastes and very comfortable with failure and it taking a number of tries, it made a huge difference for me. Even though I had a restricted number of ingredients I had a much less restricted number of foods. For example I can eat a multitude of chicken, beef, and pasta dishes. I think your right about how you handled things with your son and many of us would have more safe foods if our parents had done it similar.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732851172.0, "datetime": "2024-11-29T03:32:52", "subreddit": "ARFID", "id": "lzib4x4", "text": "Always a smart move. My family, when we get together, which isn’t as often anymore, always does appetizers so it’s easy to accidentally eat too much before the big meal.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732852326.0, "datetime": "2024-11-29T03:52:06", "subreddit": "ARFID", "id": "lzidqc5", "text": "It’s a combination of factors: \n* For many of us our families don’t accept we have an ED, ARFID, we need to grow up and stop with the picky eating so they make comments or we know from their looks and body language they are unhappy with us for not eating the normal meal like everyone else. For example Aunt Shirley is loudly offended I’m not having her green bean casserole, just a little taste and she’s sure I’ll love it. We’ve had the same “discussion” for 20 years, it started when I was 5, and will continue until she dies at 80, another 40 years from now. Don’t get me started on Uncle Sam and his special giblet gravy *shudders*\n* Many of us are self conscious eating around others after years and years of people commenting on what we do and don’t eat. We prefer to limit who we eat around as we are ashamed of our limited safe foods \n* Depending on what’s being served it might be a food that just smelling or looking at triggers our gag reflex so being around it is impossible. For example seafood smells literally make me vomit so being around my family when they are doing lobster for Christmas can be extremely difficult as sometimes I can’t eat with the house smelling and I’m trying very hard not to get sick at the table while looking like everything is just fine and people keep asking me what’s wrong and I can’t claim a migraine and upset stomach every single Christmas", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733251814.0, "datetime": "2024-12-03T18:50:14", "subreddit": "ARFID", "id": "m08pr0o", "text": "Good to see someone else talking about it. I’ve found it helpful and I mention it here all the time. Have you checked out: \n\nColor Taste Texture: Recipes for Picky Eaters, Those with Food Aversion, and Anyone Who’s Ever Cringed at Food by Matthew Broberg-Moffitt \n\nI’ve only glanced at my copy so I haven’t been able to give more than a “this might help too” LOL", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733256016.0, "datetime": "2024-12-03T20:00:16", "subreddit": "ARFID", "id": "m093fhc", "text": "Kids cookbooks are fine. In my 50s I’m long past being embarrassed by book covers especially on my kindle. More resources are better than not enough. I also like to have them to share. We frequently have parents looking for help with kids. I keep a doc of things to share from books, to how I do weekly & monthly prep, to lists of safe foods as that gets asked a lot here, to working in the kitchen with kids.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733256131.0, "datetime": "2024-12-03T20:02:11", "subreddit": "ARFID", "id": "m093srz", "text": "Yeah the only adult book I’ve seen that looked any good is the one I mentioned which is written by someone with ARFID, on this sub, who talked to lots of other adults with ARFID in creating it. In 20 years hopefully the situation will be better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733267030.0, "datetime": "2024-12-03T23:03:50", "subreddit": "ARFID", "id": "m0a2g21", "text": "That is so cool", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733353122.0, "datetime": "2024-12-04T22:58:42", "subreddit": "ARFID", "id": "m0g68dd", "text": "Later in the book there are specific sections for each subtype of ARFID with specific steps to take to overcome that type. For example those of us that aren’t interested in eating are given steps to take to train our bodies to notice hunger and to help our stomach grow bigger to be able to handle normal size meals I was making progress on this before I hit annual depression and had a set back. Another section has practical steps for taking your safe foods and increasing the forms you can eat them - I was  also making progress hear before the annual depression. I’m hoping I can move faster through the steps I was working on when the depression ends. I haven’t looked past those as I didn’t want to overwhelm myself before I was ready for further steps.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733535031.0, "datetime": "2024-12-07T01:30:31", "subreddit": "ARFID", "id": "m0sw4o8", "text": "I will post when I do l if you want to be sure I get back to you DM me mentioning the book and vegetarian friendly recipes. I’m pretty good about moving things up in my “I should get to this” queue when I have someone in my chat", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734129077.0, "datetime": "2024-12-13T22:31:17", "subreddit": "ARFID", "id": "m1xj6dl", "text": "I know I’ve had an easier time than many because my mom had me in the kitchen helping at age 3. The ability to cook, control all steps in the food going into my body, is huge. I didn’t realize that until I found out my picky eating was ARFID, at 55, and reading peoples stories on this sub.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734129391.0, "datetime": "2024-12-13T22:36:31", "subreddit": "ARFID", "id": "m1xk2ev", "text": "It doesn’t bother me. Possibly because I’m rarely around anyone who doesn’t have any problems with my eating restrictions or because at 57 I’m out of f*cks.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734238885.0, "datetime": "2024-12-15T05:01:25", "subreddit": "ARFID", "id": "m24ju6c", "text": "Yeah they mention the overweight component in passing but I had a similar problem as I’m overweight and in the section on diagnosis they only include underweight. Which means in the diagnosis section if one is overweight the diagnosis says nope not ARFID which conflicts with what they say earlier. \n\nSome of the changing eating habits focuses on eating regularly and a normal portion size but because it’s focusing on people needing to gain weight only it’s frustrating. They should have separate section on the changing your eating habits for those who are overweight which is as compassionate as the rest of the book is. While I found it frustrating I got enough from it and figured out what steps I needed to take on my own based around their goals. I need to change my grazing to regular snack times, force myself to do regular mealtimes, and choose more of my healthier safe foods for snacks. But at 57 that’s pretty obvious - how to do that is harder and while I can apply some of their advice trying to pick out what’s useful and what isn’t requires having a fair amount of knowledge and not finding the guidance triggering.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734240396.0, "datetime": "2024-12-15T05:26:36", "subreddit": "ARFID", "id": "m24mue9", "text": "Thanks for coming back to update on the book. I’m glad you found it helpful. I’m still aiming for starting over again in January.\n\nI loathe BMI. It’s been proven it’s inaccurate as a measure of someone’s health. Medical organizations are suggesting a number of [additional factors](https://www.ama-assn.org/press-center/press-releases/ama-adopts-new-policy-clarifying-role-bmi-measure-medicine) should be taken into account but doctors are frequently behind on new standards.\n\nI don’t think I’ve heard of myplate but taking a quick look this could definitely set me back in making forward progress if I came across this too soon. It was called something else in the 70s-80s. It’s also one of those things where therapy might be needed in the same way I know if I’m going to tackle adding certain foods I’ll need therapy before and while I’m trying to move them from PTSD/auto vomit to safe foods.\n\nThanks again.\n\nEdited to fix grammar", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735955773.0, "datetime": "2025-01-04T01:56:13", "subreddit": "ARFID", "id": "m5ac1qm", "text": "ARFID plus: Avoidant & Restrictive with a little but of Aversive mixed in for fun. Avoidant for me includes looks, texture, taste, and smell but I’m not limited to a color like my food isn’t beige. Restrictive is more I have no interest in meals, preparing food is too much work so I won’t bother if I’m the only one eating, I’d be happy to get all my nutrition in a pill, eating meals is exhausting. I’m a snacking grazer so most of the time I get enough calories, and I’ve gotten better over 50+ years of keeping some more nutritious snacks in rotation as well as taking supplements. Over the last few years with a new housemate who helps with shopping and meal prep I’ve gotten better about having two fairly healthy meals a day with yogurts, protein bars, fruit, and cheese, not just junk food for snacking in between meals but I’m still lacking in veggies\n\nLuckily the aversive is pretty limited:\n* Rice which I do sometimes choke on thanks to a car accident \n* All Seafood as well fresh water fish, pretty much anything that grows in water, except rice and cranberries and agar agar powder (vegan gelatin), cause gagging from smell, occasionally vomiting from smell, not being able to eat for up to 6 hours after smelling seafood, and vomiting if I end up eating it because someone thought it’d be cute to hide it in my food to prove I don’t actually have issues eating it. This one was always a problem but I have PTSD from having it literally forced down my throat a number of times by my bio dad. I’ve gotten better to the point where I can sometimes cook seafood for others now and be able to eat when around others eating fish, shellfish, etc. but that’s been less than 10 years (I’m 57) and it’s not something I can rely on. I cannot eat in restaurants that are mostly seafood oriented.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737171834.0, "datetime": "2025-01-18T03:43:54", "subreddit": "ARFID", "id": "m7qy31b", "text": "As others have mentioned kid’s meals are frequently loss leaders where the restaurant loses money on those servings. Ask if you can order off the lunch menu as meals tend to be smaller and cheaper. Ask for 1/2 servings but offer to pay full price - I’m willing to pay for the larger serving but don’t want it sitting in front of me - or I’ll request they put half in a to go container before bringing the meal out as it’s less stressful to me - I bring insulated lunch bags with me when I go out. Ask to talk with a manager as sometimes they will work something out with the kids meal by tacking on a few dollars.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739164345.0, "datetime": "2025-02-10T05:12:25", "subreddit": "ARFID", "id": "mbyxkpa", "text": "29 with the caveats on a few more as once a year or only when prepared a certain way if I’m in the exact right mood and the moon is aligned right (ok the last probably isn’t true)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739164396.0, "datetime": "2025-02-10T05:13:16", "subreddit": "ARFID", "id": "mbyxom5", "text": "If caveats can’t be included a bunch of foods drop out.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739208869.0, "datetime": "2025-02-10T17:34:29", "subreddit": "ARFID", "id": "mc1px7t", "text": "I’m with you on dry chicken. I’m lucky my mother taught me to cook and not only is she a good cook but she encouraged experimenting and laughing when things go sideways and don’t come out as hoped so I’m able to cook for myself and others with restrictions and teach others how to make food as they need it to be.\n\nFor years my mothers uncle made the only mashed potatoes I could eat. That changed when I found out his secret - instant potato flakes so no lumps. I’ve since learned to make no lump with regular potatoes but I frequently turn to instant potatoes as it’s easy, quick, and always comes out perfect.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739259177.0, "datetime": "2025-02-11T07:32:57", "subreddit": "ARFID", "id": "mc5cw97", "text": "For some foods I have to leave the last bite. But if I have dinner with meat and potatoes/rice/pasta/etc. I have to leave some of the mashed potatoes on my plate. Just thinking of eating it makes my feel nauseous. I suspect this goes back to fights with my parents when I wasn’t allowed to leave the table until I finished everything on my plate.\n\nOther foods like sandwiches or pancakes I’m fine eating the entire thing. It’s definitely dinner related.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739399820.0, "datetime": "2025-02-12T22:37:00", "subreddit": "ARFID", "id": "mcg7964", "text": "Chewing is way too much work for food and can trigger a migraine. Ugh on your date cooking the food until it was way past dead. Quick thinking on your part.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742612777.0, "datetime": "2025-03-22T03:06:17", "subreddit": "ARFID", "id": "mj38bcs", "text": "Great response", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742695076.0, "datetime": "2025-03-23T01:57:56", "subreddit": "ARFID", "id": "mj8uopx", "text": "I find it depends on the food. I actually love some leftovers but but I hate others. Liking leftovers doesn’t necessarily mean they taste the same though. Other people telling me leftovers taste the same aren’t to be trusted though. Textures definitely changes for all sorts of things even fresh ice cream put in the freezer isn’t the same texture as it was at the ice cream stand.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744460466.0, "datetime": "2025-04-12T12:21:06", "subreddit": "ARFID", "id": "mmq03hc", "text": "I’m sorry people were jerks and objectively wrong. Obviously it’s better to eat apples all day than Oreos. It’s way better to snack on carrots than chips or candy when looking for that crunch. Even if you didn’t have ARFID or food sensory issues/restrictions these would be better choices. Like duh. \n\nCarrots and apples are healthy and each new safe food can lead to more. I’m excited with you finding an awesome apple to munch on for that crunch craving. Did you know you can sprinkle a little salt on apples to get that salty crunch? If you like nut butter or cheese both go well with apples. I like hard cheddar pre-cut snack pieces or cheese fondue. Nut butter can be done as a dip or spread on each slice. Any of my suggestions might be a sensory issue but I thought I’d mention them.\n\nBaby carrots are great for dipping or just sprinkle a little salt for that salty crunch craving. If you like yogurt to get more protein you can make a number of dips - onion soup, dill, ranch, etc. If you are having problems getting enough calories daily I love sour cream dip especially Lipton onion soup. Lots of mixes and recipes for veggie dips out there to try. I love wishbone robusto Italian salad dressing so I’ll pour a little in small dipping bowls and dip the carrots in that.\n\nGiven you like the hardness of cosmic crisp apples, if you haven’t tried them yet, you might like red delicious apples - just make sure they feel hard and aren’t on their final week. As apples age they get mushier so squeeze them when shopping to make sure they feel super hard.\n\nSo exciting you found a fruit to love. I’ve been known to do a little dance when I find a new safe food. My youngest niece also taught me to say “I win, I win, I win” while doing the dance. I’m in my 50s for context.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744791034.0, "datetime": "2025-04-16T08:10:34", "subreddit": "ARFID", "id": "mndiyaa", "text": "Love this for dessert. We definitely should be proud of progress we’ve made increasing safe foods and eliminating restrictions. \n\nCongrats on your progress. So happy for you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746484614.0, "datetime": "2025-05-05T22:36:54", "subreddit": "ARFID", "id": "mqsdxgc", "text": "Have felt that way for over 50 years. I’m a grazer/snacker I wish I could get full nutrition from a pill. I don’t mind breakfast but if no one is around I skip it. Dinner I resent having to eat even when I love the food it’s just too much work to chew that much food at a single sitting. Breaking it up into smaller meals sometimes is ok but depends on if the food requires more prep than remove from fridge and let warm up for 15-30 minutes by setting it down next to me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746484773.0, "datetime": "2025-05-05T22:39:33", "subreddit": "ARFID", "id": "mqseeec", "text": "Relatable. Very relatable. Manana from Heaven also sounded good as it tasted like whatever I wanted it to and no work to make or cleanup afterwards.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747687999.0, "datetime": "2025-05-19T20:53:19", "subreddit": "ARFID", "id": "mt6qyct", "text": "She might be right about emptying the kitchen but NOT in the way she thinks… as I take everything in the kitchen out to the trash can…\n\nMy ex-MIL always thought she knew everything and was always right. She was 50% of what led to the divorce. I just couldn’t take dealing with her anymore and her son did nothing to make her stop.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1748068752.0, "datetime": "2025-05-24T06:39:12", "subreddit": "ARFID", "id": "mtywylu", "text": "I’m in my 50s and still alive. I had ARFID as soon as I came out of the womb - problems with breast milk, the only soy formula on the market only kinda worked so had to be modified, and the minute I was given solid food I was like “nope I don’t like this not at all”. If possible try snacking more as I found that helped. Dry cereal works if you can’t manage anything else. I always kept snacks on me and had a few bites between classes and at my desk at work. Add supplements to help with the vitamin deficiencies. My mom started me on them as a toddler I think. Ask a doctor to do a full blood work up to figure out what supplements you need/where your deficiencies are. If you’re like many of us and find taking pills difficult try using a straw. \n\nTry to find a protein drink or meal supplement drink you can tolerate and have 1-2 a day to make up for missed meals. Many people like Fairlife as well as various Ensure options. It’s not easy finding one that works but it’ll help you feel better. I went through some 5-10 protein drinks and powders before I found one that worked for me. Use a straw as it helps with the taste. Don’t throw out what you can’t finish. Put it in the fridge and drink more an hour later. It’s fine if it takes 3 hours to drink a single bottle. Add extra sugar or a packet of carnation essential chocolate or strawberry to help with the taste and getting more calories. If it’s too thick dilute it with a little milk. \n\nI spent up until my 30s underweight, dizzy spells, lightheaded, and bruised. I did have more variety in what I ate than you did but I had most of the same symptoms. Most of those symptoms are gone now as long as I maintain a weight over 150 lb. No idea why the weight requirement but I’m mostly able to maintain that now.\n\nIt’s entirely possible to increase your safe foods once you get your body used to eating more and at regular times.\n\nARFID is really hard on our mind and spirit not just our body. Give yourself grace.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1748069197.0, "datetime": "2025-05-24T06:46:37", "subreddit": "ARFID", "id": "mtyxq6e", "text": "I’m familiar with the problem. Maybe try timers? I’ve done that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1748904329.0, "datetime": "2025-06-02T22:45:29", "subreddit": "ARFID", "id": "mvo8c22", "text": "That’s how I managed peas as a kid.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1748904344.0, "datetime": "2025-06-02T22:45:44", "subreddit": "ARFID", "id": "mvo8dna", "text": "Congrats that’s awesome.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1748967435.0, "datetime": "2025-06-03T16:17:15", "subreddit": "ARFID", "id": "mvsl19s", "text": "Thank you for keeping this place safe for us.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749400663.0, "datetime": "2025-06-08T16:37:43", "subreddit": "ARFID", "id": "mwoiiia", "text": "I’m always ordering off the menu. I’ve been doing this since I was under 10 back in the 1970s. It’s gotten so much easier now that allergies, eating disorders, vegan, vegetarian, fad diets, and religious restrictions have gotten more acceptable. It’s also much easier now that menus are online so I can figure out what I’m going to order, make notes in my phone, and am prepared for the rare freeze moments where I’ll show the waitstaff my notes because I’m tongue tied.\n\nI was a waitress for a few years. The only thing I cared about my customers orders was getting them right. No judgments on the food. \n\nTips from 50 years of ordering off menu\n* Look at online menus and pick 2-3 options in case they are out of your #1 \n* Look at children’s and lunch menus as those are smaller portions and frequently have fewer ingredients - talk to a manager if waitstaff says no you can’t order off those and explain your making this request due to food restrictions/smaller appetite for medical reasons. I’ll offer to pay more for the kids menu if I sense this is the issue.\n* I find it can be easier to create something new based off of ingredients so instead of asking for menu item X but having them remove 10 things I’ll ask can they make me a grilled chicken with garlic with a side of mashed potatoes with only butter. \n* Write down what you’ve decided to order in a note on your phone so if you have a brain fart you can remember what you decided & can even show it to waitstaff if your having a hard time speaking due to anxiety \n* Don’t be afraid to ask to talk to the chef if you’re at a fancy/very expensive restaurant as they are frequently willing to work with you based on your safe food restrictions - calling ahead at a quieter hour (ex. 10-11:30am & 2-5pm on weekdays) as someone else mentioned may be easier \n* Order a drink and an appetizer or drink and dessert if that’s the only thing on the menu you feel confident eating. I’m including soda, lemonade, tea, and coffee as drinks no matter the time of day.\n* I joke with the waitstaff that “I’m going to be the complicated order in our party are you ready?” it “disarms” anyone I’m eating with - kinda hard to give me a hard time when I’m joking and laughing about my food restrictions \n* It’s ok to request a complete list of all ingredients including all seasonings - just say you’re sensitive to a lot of ingredients and it’s easier to see a recipe list than carry around pages of ingredients that your unable to enjoy", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749817481.0, "datetime": "2025-06-13T12:24:41", "subreddit": "ARFID", "id": "mxjv3yc", "text": "I mostly do this with foods I used to like that I want to add back in. I remember how good they tasted but every time I try to have them the gag reflex hits. \n\nIf it’s something that can be cooked I will prepare it for others and then end up not eating anything because my body rejects any food after working with that one.\n\nIf it’s a snack or beverage in individual size I’ll pull it out frequently when I first get it and just have it available for snack times. After a month or two it ends up in the pantry where I know it’s there and gets pulled out occasionally. I try to donate them to the local food pantry months before their expiration date because it’s obvious I’m not going to manage it this time. As soon as I’ve donated or thrown it out I get a craving for it but I won’t buy it again for a couple years to repeat the cycle.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1750030632.0, "datetime": "2025-06-15T23:37:12", "subreddit": "ARFID", "id": "mxzrs5e", "text": "I was wondering if hormones might help. For me the best thing to help my ARFID was being in a very severe accident although the change wasn’t nearly this drastic.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1750031931.0, "datetime": "2025-06-15T23:58:51", "subreddit": "ARFID", "id": "mxzvf83", "text": "I feel for you. To have the experience of being able to eat anything and then back to full restrictions is my worst nightmare. \n\nMy experience isn’t as extreme. After being in a bad accident years ago I’ve been able to eat more foods including a number that were gag foods just thinking about. Something in my brain changed. Not to the extreme where everything taste amazing but I can eat them and over time I get more and more enjoyment doing so. But during times of crisis or high stress my restrictions come back.\n\nI hope this will be encouraging for you. I’ve found when the high stress/crisis lessens it takes very little for my to add the newer safe foods back in. Like simply only having frozen omelette makings for the rest of the family which normally I can’t eat but just before my most recent stress time I was able to eat it so I gave it a try the other day and I could eat half my normal portion. Sometimes I don’t even notice I’ve done it. I know that sounds weird like how can you not notice? So I like my eggs a particular way and any bits that aren’t cooked perfect I slide onto my partner’s plate. As the situation gets less stressful I just eat what’s on my plate and only notice when my partner passes his plate to me and I don’t have anything to put on it. \n\nYou’ve just had a baby and your hormones are all over the place. You’re stress levels are through the roof. It’s possible in 18 months when things settle down you’ll find it easier to add a number of the new foods you enjoyed back in. It may take a bit of effort - I’ve sometimes had to do it a few bites at a time over weeks or longer and work my way up to a full portions but I hold in my mind what it tasted like and how I felt eating it before the current crisis and it does come back. But during the stressful time not being able to enjoy those new foods adds to my stress and if I were in your situation I’d be completely destroyed too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751147255.0, "datetime": "2025-06-28T21:47:35", "subreddit": "ARFID", "id": "n0b5wug", "text": "Excellent advice. My mom had me cooking as a very young child, starting at 3, we still cook and laugh together now, I’m in my late 50s. It definitely helped me be around food I can’t eat and cut back on my gag reflex on many of my problem foods although on bad days I still occasionally revert back and some foods like fish/seafood were problematic to be around until my late 40s.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751152217.0, "datetime": "2025-06-28T23:10:17", "subreddit": "ARFID", "id": "n0bjr5m", "text": "I’m in my late 50s. I’ve survived, my safe food list has expanded over the years, it hasn’t seriously impacted my ability to socialize, eat out, or attend events in years. It can get better. I consider myself fairly recovered during good times but during crisis and times of great stress various of my food restrictions reappear but not as severe as they were. \n\nMy mom started me on cooking with her at 3 - somewhat age appropriate as I grew up. This helped in many ways.\n* I got over much of my gag reflex from touching or being around unsafe/gross foods. I wash my hands a lot when cooking and go through many paper towels so I can throw them away as soon as I’ve used them. \n* It increased my ability to eat around most foods I found gross, not all, fish/seafood still had a “cannot eat anything for up to 6 hours if I smell it at eating times”. \n* Having control over cooking and learning to modify recipes expanded my safe foods. More so when I got older than as a minor living at home but even as a kid. I’d sometimes be distracted and lick my fingers which led to finding recipes I wanted to modify because what we were making was interesting but not to my taste.  Learned doubling and tripling seasonings I liked could increase the chances I’d eat something which made a huge difference in the number of chicken, pasta, beef, and pork dishes I can eat - instead of having a single dish or brand I could eat 10-20 dishes by my teen years\n* My knowledge of recipes made it easier to order off menu in restaurants as I knew what ingredients they had on hand based on the menu and I knew what quick easy dishes they could make with those ingredients \n\nImportant dinners: Check menu beforehand to see if there is anything you can eat. If not eat beforehand hand. If possible have bread, something to drink, if you eat salad or some of the salad vegetables eat those (ask for no dressing). At events I’ve always said the smell of food is making me nauseous and kicking off a headache due to one of my various chronic illnesses but otherwise I’m fine and no I don’t have something anyone needs to worry is catching.\n\nYou may find cooking in school helps with your ARFID but see about wearing gloves and a mask (keep in mind these may help with ARFID but cause social issues), maybe getting an anti-anxiety med just for that class, sitting down with your parents and the teacher to explain ARFID, your particular issues, and why you may need to walk out of class sometimes. You may want to start trying this at home to see what works for you (gloves, mask) and what doesn’t. It’s not going to be easy but it likely will help you in the long run. You can start out at home just sitting in the room close to foods/ingredients you expect will be part of the class. \n\nHow do we not die? Thankfully we live in a modern world and for many of us we have access to our safe foods, meal replacement drinks and bars, and feeding tubes if things get really bad. That said it’s important to take supplements, expand our safe food list, get regular checkups and blood test, as lack of good nutrition can cause a number health issues some which may not show up until later in life.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751484734.0, "datetime": "2025-07-02T19:32:14", "subreddit": "ARFID", "id": "n0zxaek", "text": "I’m self-diagnosed with ARFID, autism, and ADHD (AuDHD), I’m nonbinary and in my late 50s. I’ve had ARFID since I came out of the womb and rejected breast milk, rejected all but one formula just released the year before I was born (infant with failure to thrive), and rejected many solid foods refusing to eat for up to 6 hours whenever they were reintroduced. I also have cPTSD, depression, anxiety, fibromyalgia, chronic fatigue syndrome, migraines, hard of hearing, and a slew of other health issues all of which make the others worse at times. \n\nIn the 1970s, girls weren’t being diagnosed with ADHD or autism. Then ADHD was considered something kids grew out of. I mask heavily so autism has never been considered. At this point in my life, with my other health issues, and lack of finances, fighting the system to get diagnosed is a waste of my time and money. I’m finding tools to help me survive thanks to various subs. It’s been hard enough to get doctors to take any of my invisible illnesses seriously I’m not pushing to add more for them to question. \n\nI have my ARFID reasonably under control although my diet could improve. I’m still trying to add more veggies to my safe food list.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751569503.0, "datetime": "2025-07-03T19:05:03", "subreddit": "ARFID", "id": "n16eh2f", "text": "I crave low sodium V8. For a while I could drink a small can every morning. My digestive system was so much better when I did that. But one day I just couldn’t anymore. The gag was back. Every couple years I’ll by a few hoping my cravings mean I can have them again but as I’m opening the can I’m running to the bathroom with dry heaves. It sucks as it was a great way to get veggies and my body was so happy getting them. I’m about due to try them again. Maybe this time I’ll succeed.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751596549.0, "datetime": "2025-07-04T02:35:49", "subreddit": "ARFID", "id": "n18nbw5", "text": "I’m sorry you are at this stage at 60. I’m seeing more people believe in ARFID but it’s slow going. I’m a couple years younger than you, 58, but I’ve had more support, understanding , and help so my safe food list is larger. I have a couple book suggestions which might help. \n\nTry not to judge the books by their titles/covers. They are aiming for a wide audience, one that may not have heard of ARFID, and some of them are for adults and kids so the covers have kids. The books on my TBR are for parents of kids with ARFID but I’m hoping they might be helpful to me.\n\nI’ve started Reading and am finding these 2 helpful \n* The Picky Eater’s Recovery Book: Overcoming Avoidant/Restrictive Food Intake Disorder by Jennifer J. Thomas, Kendra R. Becker, Kamryn T. Eddy (only book I know for adults with ARFID)\n* Color Taste Texture: Recipes for Picky Eaters, Those with Food Aversion, and Anyone Who’s Ever Cringed at Food by Matthew Broberg-Moffitt (written by someone on this sub who talked with a number of adults with ARFID while writing this book)\n\n\nOn my TBR\n* Food Chaining: The Proven 6-Step Plan to Stop Picky Eating, Solve Feeding Problems, and Expand Your Child's Diet\n* Try New Food: How to Help Picky Eaters Taste, Eat & Like New Foods by Jill Castle\n* Helping Your Child with Extreme Picky Eating: A Step-by-Step Guide for Overcoming Selective Eating, Food Aversion, and Feeding by Katja Rowell", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751628087.0, "datetime": "2025-07-04T11:21:27", "subreddit": "ARFID", "id": "n1aelxe", "text": "Thanks for sharing the 5x. I’ll try adding that to my toolkit although my bodies reaction is “nope, no way, nope we had it once we know we didn’t like it never again feed it to us.” LOL", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751630865.0, "datetime": "2025-07-04T12:07:45", "subreddit": "ARFID", "id": "n1akxps", "text": "I’ve had some wins with the first book. My biggest problem is still veggies. I’m hoping you’re advice on five tries helps as I really want to add more veggies as it’s the main area I’m weak in. I know throughout my 50+ years it’s impacted my health. I’m hopeful it’ll work best for foods I once could eat or drink but now can’t like V8 juice I crave but every time I buy I just can’t get myself to drink it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751637996.0, "datetime": "2025-07-04T14:06:36", "subreddit": "ARFID", "id": "n1b4jb9", "text": "I have a few more veggies than you. The list always looks large when I type it out but is so small compared to the people I’m around and the veggies I cook for others. \n\nSalad: iceberg and romaine lettuce, occasionally I can do baby greens, tomatoes, cucumbers, grated carrots, scallions if sliced super thin\n\nSnacking on raw veggies either sprinkled with salt or with onion soup dip: baby carrots, celery, tomatoes, cucumbers \n\nCooked if frozen or fresh nothing canned: corn, corn on the cob, baby carrots, sliced carrots, tomatoes\n\nIf minced very thin in soups and sauces: peppers, onions, shallots, leeks, scallions \n\nSometimes veggies currently working on: minced peppers & onions in things like omelettes, broccoli stalks NOT florets, the onions in French onion soup and similar (I love the broth but don’t eat the onions). Not exactly working on but I occasionally eat a few bites of asparagus if it’s grilled or prepared in a balsamic vinegar glaze but then the stringiness of it starts to gross me out so I never get beyond 3 bites.\n\nI love the flavor of mushrooms but not texture so I cook with them in sauces and dishes where I can do in large pieces easy to pick out & give to eating companions. I’m not currently working on this beyond what might be considered exposure therapy as I cook with them so I buy and sauté them. Sometimes I wash and cut them but other times that’s too much and the people I’m cooking for wash and cut to my instructions although that doesn’t always work and I have to take over the cutting as they are making either too small or too big. I keep forgetting I can get the flavor by soaking dried mushrooms in water to use in cooking and those mushrooms are already cut up. SMH", "parent_id": null, "link_id": null, "context": null}
