{"type": "comment", "timestamp": 1602447121.0, "datetime": "2020-10-11T20:12:01", "subreddit": "fuckeatingdisorders", "id": "g8is6oz", "text": "Apparently caloric recommendations were like \"people underestimate how many cals they eat, so if we give them the ACTUAL numbers, they're gonna overeat\" \n\n...but then ED ppl are TOO good at calorie tracking, so...we eat the recommendations and they're not enough.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1605297047.0, "datetime": "2020-11-13T19:50:47", "subreddit": "fuckeatingdisorders", "id": "jtmuoy", "text": "Yall, we post about how we can never be satisfied with \"normal\" amounts of food, \"normal\" kcals, etc. \n\nWe can be. But you gotta pull yourself out of restriction first. You gotta eat fats, not just protein and carbs, because your body *needs* fat and if you don't eat any, you're just gonna be hungry because your body will tell you to keep eating with the hope that eventually you'll do something other than yeet celery or carrots or apples into it. If youre working out for 1-3 hrs a day (and believe me, I know some of yall do, hell, sometimes *I* do, for sure) then no, 1600-1800-2000 whatever kcals IS NOT ENOUGH. Yall keep saying \"I ate 1800 kcals today and ran for an hour and ohmygodiatesomuch\" and either a) you know thats bullshit or b) you do now, bc I'm telling you that it is BULLSHIT. \n\nYou're never gonna be satisfied when you're deprived of what your body needs. If you want to be satisfied on \"normal\" amounts of \"normal\" food, you have to eat NORMALLY, and by normally, I mean ENOUGH. THAT MIGHT BE A LOT, especially if you've fucked up your body! Or if you work out! \n\nPsa over. If you want to stop feeling like OHMYGODIJUSTWANTTOEATANENTIREJAROFPEANUTBUTTER, STOP PUTTING YOUR BODY IN A PLACE WHERE IT THINKS IT NEEDS AN ENTIRE JAR OF PEANUT BUTTER.", "title": "The only way out is through", "context": null}
{"type": "comment", "timestamp": 1605300320.0, "datetime": "2020-11-13T20:45:20", "subreddit": "fuckeatingdisorders", "id": "gc6swbe", "text": "It's really funny, ever since I started *actually* eating at maintenance, I've had *zero* desire to yeet 5000 calories into my body.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605306467.0, "datetime": "2020-11-13T22:27:47", "subreddit": "fuckeatingdisorders", "id": "gc74w71", "text": "Still takes lot of cals to run a human properly", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605308621.0, "datetime": "2020-11-13T23:03:41", "subreddit": "fuckeatingdisorders", "id": "gc78u2z", "text": "I loosely track cals rn bc name a more iconic duo than ED peeps and overestimating how much they've eaten and ill be like IM SO HUNGRY and ill be like YEAH ITS CUZ YOURE IN A 1000-CALORIE HOLE GODDAMMIT JUST EAT SOMETHING", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1605380868.0, "datetime": "2020-11-14T19:07:48", "subreddit": "fuckeatingdisorders", "id": "gca04pm", "text": "If recovery were easy then EDs wouldn't have such a high mortality rate.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1606336977.0, "datetime": "2020-11-25T20:42:57", "subreddit": "fuckeatingdisorders", "id": "k10ge3", "text": "It was never the goal to destroy my body, torpedo all my relationships and completely lose myself. \n\nIt was never the goal to become a skeletal shell of a human. \n\nIt was never the goal to be so concerned about what other people thought that I would willingly destroy myself. \n\nThis was never the goal.", "title": "This was never the goal", "context": null}
{"type": "comment", "timestamp": 1606350532.0, "datetime": "2020-11-26T00:28:52", "subreddit": "fuckeatingdisorders", "id": "gdly8gh", "text": "To you as well. \n\nTomorrow is Thanksgiving and im just gonna forget calories exist for a day", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606350732.0, "datetime": "2020-11-26T00:32:12", "subreddit": "fuckeatingdisorders", "id": "gdlykw3", "text": "Honestly I didn't even get into it for those reasons, it was all about control and feeling like I could succeed at *something*, and now it's just kinda destroyed me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606359463.0, "datetime": "2020-11-26T02:57:43", "subreddit": "fuckeatingdisorders", "id": "gdmcxci", "text": "I miss those days", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606443069.0, "datetime": "2020-11-27T02:11:09", "subreddit": "fuckeatingdisorders", "id": "gdq501m", "text": "Can I get my money back please life is more expensive when you make an effort to feed yourself", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1606544360.0, "datetime": "2020-11-28T06:19:20", "subreddit": "fuckeatingdisorders", "id": "k2iq3f", "text": "ETA: all these numbers are hella lowballed it turns out, that just further proves my point\n\nSo let's say your bmr is between 1100-1350 kcals (which unless you're super short, THIS IS YOU). \n\nThat means you need to take in 1100 cals just to run your organs. \n\nExcept it takes cals to digest food, too. TEF varies by food product, but 10-15% is reasonable. \n\nSo, that means that to net 1100 cals, you need to eat 1300. \n\nThat means that just laying in bed, propped up in pillows and whatever the fuck else, you need 1300-1400cals. \n\nMoving takes cals. Sitting up takes cals. Typing on your phone takes cals. Exercising (like most of us do) - more cals. \n\nSee why 1200 is 100% bullshit?", "title": "yall it takes a lot to properly run a human tw: calorie numbers", "context": null}
{"type": "comment", "timestamp": 1606574507.0, "datetime": "2020-11-28T14:41:47", "subreddit": "fuckeatingdisorders", "id": "gdvjcta", "text": "Basically if your body needs 1100kcals just to run your organs n shit ( bmr) you need to eat more than that to \"net\" your bmr bc of the calories it takes to digest food.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606576051.0, "datetime": "2020-11-28T15:07:31", "subreddit": "fuckeatingdisorders", "id": "gdvmv97", "text": "This is a totally valid response! I just kinda randomly picked 1200 because it's a common number, but I know restrictive EDs can be higher or lower or maybe not even calorie based - I also cannot word posts with an actual point AND be nonspecific enough to encapsulate all of the ED community, because all EDs are different and everyone with an ED is different! Sorry if you didn't find this helpful, but I think a lot of people did. When I was at my worst, something like this was literally EXACTLY what I needed. It might not be for you, but it might be for someone else!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606576139.0, "datetime": "2020-11-28T15:08:59", "subreddit": "fuckeatingdisorders", "id": "gdvn35i", "text": "Sorry that this wasn't helpful for you, it would've been hella helpful for me when I was at my worst tho, I can't make posts that'll help everyone with every ED at every stage of their ED but I try to make the posts that *I* would have needed bc that's really the only posts I can comfortably make.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606579046.0, "datetime": "2020-11-28T15:57:26", "subreddit": "fuckeatingdisorders", "id": "gdvtxtt", "text": "Water? Food weight? If you're OBSERVING a weight change, odds are, it isnt a weight change, its a hydration or food weight change. \n\nBut I can tell from your tone that you're not gonna listen to me that it isn't *real* weight, so I'm not getting any further into it. \n\nEdit: sorry, didn't pick up on the sarcasm, didn't want to get into it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606585641.0, "datetime": "2020-11-28T17:47:21", "subreddit": "fuckeatingdisorders", "id": "gdwb9hy", "text": "...sarcasm doesn't carry well online, hence why \"/s\" exists. There are people who would legitimately write that in seriousness, and I don't want to engage with them. I'm sorry I missed your joke, but I stand by that decision.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606586364.0, "datetime": "2020-11-28T17:59:24", "subreddit": "fuckeatingdisorders", "id": "gdwd95x", "text": "Yknow that's quite a range but I'm not surprised tbh I eat 2500+ and then don't track once a week", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606586590.0, "datetime": "2020-11-28T18:03:10", "subreddit": "fuckeatingdisorders", "id": "gdwdx82", "text": "That's literally just how it should be :) take care of your body, your body will take care of the rest :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606593862.0, "datetime": "2020-11-28T20:04:22", "subreddit": "fuckeatingdisorders", "id": "gdwz1vp", "text": "Hence why it has the tw, some people will find it helpful, some will find it triggering", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606594117.0, "datetime": "2020-11-28T20:08:37", "subreddit": "fuckeatingdisorders", "id": "gdwztal", "text": "No worries, I did phrase it pretty matter-of-fact, no padding, straightforward, maybe even a little tersely or overly firmly - I just wanted to say \"here's a realistic explanation, I'm not getting into it,\" because honestly, if someone thinks 1200 is too much, it's *very* difficult to convince them of otherwise.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606601347.0, "datetime": "2020-11-28T22:09:07", "subreddit": "fuckeatingdisorders", "id": "gdxl82n", "text": "That's fair, I have a bad habit of lowballing. My bad, thanks for calling me out.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606601767.0, "datetime": "2020-11-28T22:16:07", "subreddit": "fuckeatingdisorders", "id": "gdxmhl0", "text": "...I did a Google and my BMR is actually roughly 1450ish oops wow sometimes I forget that I have an ED and need someone to remind me that not everyone lowballs how much food they need", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1608862819.0, "datetime": "2020-12-25T02:20:19", "subreddit": "fuckeatingdisorders", "id": "ggyd6cb", "text": "Oops I have a bad habit of lowballing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611554830.0, "datetime": "2021-01-25T06:07:10", "subreddit": "fuckeatingdisorders", "id": "gkojhl1", "text": "I still measure my oil, but I started by just measuring out 1/4 tsp, and worked up from there to... half a teaspoon. \n\nSometimes progress is slow. Doesn't mean it isn't progress.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1611589331.0, "datetime": "2021-01-25T15:42:11", "subreddit": "fuckeatingdisorders", "id": "l4qces", "text": "Note: this is aimed at people in recovery from restrictive EDs, that's really the only one I have experience with. \n\nI see so many posts here about \"I'm never satisfied on maintenance calories, so why bother?\" \"I just want to EAT AND EAT AND EAT, when will it end???\" \"Normal meals just *aren't enough*\" \n\nIt gets better. Yes, at first all you want are large meals. You're hungry *all the time*. \n\nSorry, but what did you fucking expect? You just spent X amount of time starving yourself. You're physically deprived of nutrients and calories. Your body wants them back. If you \"estimate\" that you're eating maintenance, odds are, you're overestimating. If you *know* you're eating maintenance, well, you still might be hungry for more, and you have 2 options. \n\n1) Wait it out. Your body will normalize if you just *fucking eat consistently*. This means eating maintenance *every day*, regardless of how you ate the day before. Note: this will mean anything from a few weeks to a few months of being hungry despite eating maintenance. \n\n2) Eat above maintenance. Seriously, an extra bowl of cereal for a couple days will not be the end of the world. Normal people do this all the time. Don't torture yourself. Fucking eat. You're not special just because you can ignore basic bodily signals. \n\nI've been eating *actual* maintenance of 2500+ for months. I have not \"blown up.\" I just don't feel like shit all the time, have actual energy, and can eat regular- sized portions and feel satisfied. Sometimes I eat an entire pint of ice cream because it's just ~the vibe~, but there is no part of me that feels like it's a *need*, and honestly, most of the time I want *nothing* to do with *that much ice cream*. \n\nIt gets better, but you have to stick it out and *fucking eat*.", "title": "It really does get better (TW: numbers)", "context": null}
{"type": "comment", "timestamp": 1611596352.0, "datetime": "2021-01-25T17:39:12", "subreddit": "fuckeatingdisorders", "id": "gkq9pix", "text": "It's gonna be hard as hell! I just jumped to maintenance. The first time I did that, I gained like... double digit pounds practically overnight. A month later I was back to my starting weight. \n\nThe best advice I can give is that you have to just *do* it. It'll be the hardest thing you ever do, I know, trust me, but your body is not going to wait for your brain to get on board.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611597055.0, "datetime": "2021-01-25T17:50:55", "subreddit": "fuckeatingdisorders", "id": "gkqbcnz", "text": "Take your BMR and multiply by 1.4-1.5, then add exercise. Most TDEE calculators use a multiplier of 1.2 which *literally* means bedbound. Very few people are going to have a tdee anywhere near that low.\n\nEdit: there's research showing most sedentary people have a PAL multiplier of 1.4-1.69.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611603057.0, "datetime": "2021-01-25T19:30:57", "subreddit": "fuckeatingdisorders", "id": "gkqp721", "text": "Yeah, I agree that maintenance calories are bullshit, tbh. Theres no good way to accurately calculate them and the basic idea is \"these are always going to be wrong but they'll probably average out to what your body actually needs.\" And I agree that if you're hungry on \"maintenance,\" it's probably *not* enough -  macro- and micronutrient composition can affect satiety to some degree, but consistent hunger is never a positive indicator.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611611422.0, "datetime": "2021-01-25T21:50:22", "subreddit": "fuckeatingdisorders", "id": "gkr7o4r", "text": "It gets better, but the only way out is through, not out, and then back in again, and then out, and then back in again, and then one more time-- \n\nSorry, I love Finding Nemo.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611618343.0, "datetime": "2021-01-25T23:45:43", "subreddit": "fuckeatingdisorders", "id": "gkrlqwf", "text": "Also, I did the exact same last Wednesday. It freaked me out too, but you know what freaks me out even more? The idea of being stuck like this for the rest of my (shortened, if I'm lucky) life.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611632822.0, "datetime": "2021-01-26T03:47:02", "subreddit": "fuckeatingdisorders", "id": "gksd43q", "text": "If you're still hungry, you're not at maintenance calories. EDs fuck you up, you might need more, probably *much* more. Don't make yourself suffer. It doesn't make you unique or special, it just makes you miserable, hungry, tired, and probably cold. Your body will normalize, but you have to give it time. It took me *months* to get there. You can't rush it. We didn't fuck ourselves up overnight, you can't expect to fix something in a week when you spent months and months destroying it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611716170.0, "datetime": "2021-01-27T02:56:10", "subreddit": "fuckeatingdisorders", "id": "gkwk1fd", "text": "So much. It's worse than physical hunger imo", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611762084.0, "datetime": "2021-01-27T15:41:24", "subreddit": "fuckeatingdisorders", "id": "gkyjlwb", "text": "That sub has, ironically, been one of my biggest sources of support during recovery. It's got a fair share of hateful idiots, yes, but it's also got a pretty great community of people who are just trying to figure out how to best integrate diet and exercise for *health* when mental health issues make IE unrealistic. I didn't start exercising to control my weight. My ED and exercise habits were separate, and figuring out a healthy balance has been challenging but rewarding.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611765678.0, "datetime": "2021-01-27T16:41:18", "subreddit": "fuckeatingdisorders", "id": "gkyu056", "text": "I made pizza last night! Wooooo look at us!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611770208.0, "datetime": "2021-01-27T17:56:48", "subreddit": "fuckeatingdisorders", "id": "gkz7tnv", "text": "Right? Every time I wait until 11PM to cook dinner and end up super hungry I'm like \"well no one forced you to wait until 11 to eat, you did this to yourself homie. This is just straight-up bad behavior.\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1612306661.0, "datetime": "2021-02-02T22:57:41", "subreddit": "fuckeatingdisorders", "id": "glslgio", "text": "\"Hey guys, sorry your labs are a little late, I can't put together a grocery order without panicking and well I finally had to Just Do It but it took three hours\"\n\n(Also the pacing thing makes me feel personally attacked I do that too!!)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1614029207.0, "datetime": "2021-02-22T21:26:47", "subreddit": "fuckeatingdisorders", "id": "godwrqc", "text": "I can relate, it's easy to go from misusing food in one way to misusing it in another, filling a void with undereating vs. filling it with overeating.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615841323.0, "datetime": "2021-03-15T20:48:43", "subreddit": "fuckeatingdisorders", "id": "gr1z6ce", "text": "Baby steps are steps!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615998292.0, "datetime": "2021-03-17T16:24:52", "subreddit": "fuckeatingdisorders", "id": "gr92qch", "text": "I think they mean that weight loss might result from recovering from BED, just because the person has stopped their binge behaviors (not necessarily through restriction.) I think they're trying to say that a cessation of bingeing behavior can cause weight loss without restriction, just like the cessation of restriction can (and usually should!) cause weight gain without implying that bingeing has occurred. \n\nComing from restriction can leave us hypersensitive to the psychological and physical effects of restriction to the point of not recognizing the psychological effects of binge behavior.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616094281.0, "datetime": "2021-03-18T19:04:41", "subreddit": "fuckeatingdisorders", "id": "gre9pg8", "text": "I'm the opposite, I have a weird frame and a fuckton of muscle, so I look pretty underweight even though I'm not. BMI isn't really something you can eyeball.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616296117.0, "datetime": "2021-03-21T03:08:37", "subreddit": "fuckeatingdisorders", "id": "grnvwp9", "text": "Yesssss! This is the progress we like to see", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1617123703.0, "datetime": "2021-03-30T17:01:43", "subreddit": "fuckeatingdisorders", "id": "mgknzj", "text": "yall I feel like sometimes we even fail hardcore at supporting each other to recover, like EDs are competitive as fuck so like \"omg ur doing so great eating that it makes me feel like shit that I'm not recovering\" and like yeah, sometimes I do genuinely feel like that, but sometimes I feel superior for *not* being in the healthiest place? Like how tf does that make any fcking sense this disorder could fucking kill me but I feel like I'm winning if someone else is doing better at recovery than me? \n\nTl;dr EDs are competitive and make no sense and sometimes I wonder if unmonitored ED spaces are a good idea tbh", "title": "another reason EDs are the worst", "context": null}
{"type": "comment", "timestamp": 1617132494.0, "datetime": "2021-03-30T19:28:14", "subreddit": "fuckeatingdisorders", "id": "gsu1uxn", "text": "Right? People are like 'I'm relapsing' and I'm like 'well now that makes 2 of us!'", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617160553.0, "datetime": "2021-03-31T03:15:53", "subreddit": "fuckeatingdisorders", "id": "gsvkf48", "text": "Right like if there's a no numbers rule it needs to include no blacked out numbers jfc like they aren't hidden in the previews anyways \n\nAnd like tbh I'm not against 'no numbers' rules but not because of triggers bc life is triggering but bc like there's no point??? Like who cares how badly you starved yourself/other behaviors *you're in an ED sub, you're not special, your ED just wants you to* think *you are.*", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618545347.0, "datetime": "2021-04-16T03:55:47", "subreddit": "fuckeatingdisorders", "id": "guoqwue", "text": "I agree with this except my physics PhD brain wants to edit that you do burn somewhat more calories running than walking just because there's more vertical motion in running which requires energy expenditure \n\nI say this not to say \"RUN BECAUSE IT BURNS MORE CALS\" but because runners are notorious for not recognizing how intensive exercise running is and not fueling properly because of it so I feel the need to do PSAs before more runners end up with deficit induced injuries", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1618677960.0, "datetime": "2021-04-17T16:46:00", "subreddit": "fuckeatingdisorders", "id": "msu7sr", "text": "No one cares that my intake at my lowest was [redacted], or my longest fast was [redacted], or about my exercise compulsions when I was at my worst. \n\nI'm not special just because I can torture my body and make myself suffer for no goddamn reason. \n\nPeople *do* care about me, and they *do* want to hear about my life, but the behaviors that went along with my ED aren't interesting topics of conversation. No one wants to hear about my obsessive calorie counting strategies and food rituals and body fixations. \n\nWe talk about our EDs like we're these beautiful, sick unicorns and we really aren't. We're a dime a dozen. The stuff we do isn't special and no one cares. They want us to get better so we can talk about other hobbies, have our personalities back, be the people we were before the ED behaviors became our entire lives. \n\nYour ED isn't special and no one cares.  It's not interesting. You're not special because you can stubbornly slowly kill yourself - there are a million reasons that people should love you and care about you, but that isn't one of them.", "title": "I'm not special and no one cares: tough love recovery vibes", "context": null}
{"type": "comment", "timestamp": 1618753978.0, "datetime": "2021-04-18T13:52:58", "subreddit": "fuckeatingdisorders", "id": "guyvier", "text": "Yeah, this is what interacting with other EDers has been showing me too. Hits hard.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618761952.0, "datetime": "2021-04-18T16:05:52", "subreddit": "fuckeatingdisorders", "id": "guzb69q", "text": "I think there's also something to be said for a careful balance of self-compassion and tough love, though. Like, EDs are a mental illness. You don't say that the average adult has too many responsibilities to be depressed, have PTSD, etc. Mental health conditions do interfere with daily functioning, and it isn't the sufferer's fault. \n\nBut that being said, once you've recognized that you have a problem, it is your responsibility to find the help and put in the work. If you get diagnosed with cancer, no one would blame you for the cancer, but they would blame you for not putting in any effort to treat the cancer. Same with depression, PTSD, anxiety, anorexia, etc. It's not your fault that you have one of the above conditions, but it is your responsibility to pursue treatment and put in the work to effect the treatment.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618762463.0, "datetime": "2021-04-18T16:14:23", "subreddit": "fuckeatingdisorders", "id": "guzc8ef", "text": "God this hits hard. My roommate finds my pacing hilarious. \n\nI miss running, but it's my own goddamn fault for letting it get that out of hand. \n\nHaving friends \\*in\\* your workout hobby is invaluable, IMO. Like, exercise *is* a healthy endeavor...in reasonable quantities. Having friends who enjoy similar types of exercise are great for maintaining balance when you've struggled with that in the past - someone on my taekwondo team said he took a break from running to focus on feeding himself and to *stop* burning all his calories, and honestly, that was the best thing he could have said.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618764692.0, "datetime": "2021-04-18T16:51:32", "subreddit": "fuckeatingdisorders", "id": "guzgv9r", "text": "Stuff like this really drives home that *I'm not fucking special*. ED experience is unique in some ways, but in other ways, we really are a dime a dozen, and it's quite an experience to see your bullshit reflected back at you. Red pill vibes all the way.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621182895.0, "datetime": "2021-05-16T16:34:55", "subreddit": "fuckeatingdisorders", "id": "gyc8iq9", "text": "Those calculators use a PAL multiplier of 1.2 for sedentary, 1.375 for lightly active, 1.55(?) for moderately active, etc. Actual data from DLW studies shows expenditures in SEDENTARY people are at minimum a PAL multiplier of 1.4, and range from around 1.4-1.7...before adding purposeful exercise. This is also assuming your BMR is that of a rough population average, but that varies by 100-300kcals in the *general* population, and well, most of the general population don't acquire a prolonged starvation hobby. \n\nPeople tend to think the calculators are accurate because normies *suck* at tracking their calories. They'll track one day (poorly), see that it roughly coincides with what they \"should\" be eating, and then go back to how they *actually* eat. If someone says they eat 1900kcals a day, I assume they're tracking 1900, eating 2100-2300+, and occasionally having a \"cheat day\" that brings their average to a MINIMUM of 2400. Probably more. People with ED history tend to track more accurately, so we think we're eating *sooooo much* to maintain our weights, when in reality, we're just eating normal kcals, probably unintentionally higher-volume foods and fewer liquid kcals, moving a bit more b.c. there's neuroscience suggesting restrictive EDs can mess with the pathways that govern NEAT even *before* you add movement compulsions, and we've lost the privilege of eating without being painfully aware of *what* we've eaten.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621185116.0, "datetime": "2021-05-16T17:11:56", "subreddit": "fuckeatingdisorders", "id": "gycdhuk", "text": "Most people who volume eat are still achieving reasonable calorie intakes, IME, EDers tend to...volume eat without the volume and expect, idk, photosynthesis? to take care of the rest.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621185832.0, "datetime": "2021-05-16T17:23:52", "subreddit": "fuckeatingdisorders", "id": "gycf5nd", "text": "A huge part of restrictive ED is that we trade volume for caloric density. E.g., we eat 3k, or more, but we still use so many safe foods that the volume is HUGE. More professional meal plans probably have like, same calories, but done in a way that 3k looks like \"normal\" portions (whatever the fuck that means). Like, I've seen people doing MinnieMaud with HaloTop and im like...why. that's a whole ass pint of ice cream for like, 300 kcals. Where you getting your other 2700+? \n\nUltimately, it's caloric and macro/micronutrient sufficiency that drives satiation. A professionally designed meal plan may be able to achieve that while the portions don't look 'insane.' \n\nThere's also a mental part of restriction, too. For me, if I know I have a whole jar of peanut butter in the fridge, and that it's mine, and that I can have it *whenever,* I just...stop caring. Same for cereal, etc. When it's not in limited supply, food gets less interesting. Being able to look at a meal plan and see that XYZ is literally REQUIRED can help as much as all-in HOLY FUCK I CAN HAVE ALL THE FOOD type recovery - meal planning works well for me because I struggle with decisions, and all-in terrifies me because I don't know *what* I want, but planning meals according to nutrition goals? Can do. If I want something else? ...working on it. Recovery is a process.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621186111.0, "datetime": "2021-05-16T17:28:31", "subreddit": "fuckeatingdisorders", "id": "gycftjv", "text": "Yes. My recovery involves figuring out nutritional goals and trying to restore \"normal\" eating, with a little flexibility. One, because flexibility *is* normal, but two, I'm ok with cutting myself a little slack in the aftermath of a, well, starvation hobby.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621188080.0, "datetime": "2021-05-16T18:01:20", "subreddit": "fuckeatingdisorders", "id": "gyck8l2", "text": "See, the average American isn't really mindful of the fact that they eat a lot of nutrient/calorie dense foods, though...they just either do, or don't. You're mindfully aiming for what you know you need, not restricting, etc., and that's all *fantastic*, but how you talk about your eating habits (in this comment, and in other posts/comments) varies a *lot* from how people without ED and recovery history approach their eating habits.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621188593.0, "datetime": "2021-05-16T18:09:53", "subreddit": "fuckeatingdisorders", "id": "gyclerk", "text": "Oh for sure! There's just a VERY common thread of people saying OH MY GOD I EAT SO MUCH NOW and I've been trying to mathematically/scientifically/psychologically unravel that for a couple of months now. It's really interesting! Calories are super cool and I love learning about them, I much prefer this mode to caloric restriction, and also to \"oh my god I cannot handle calorie counts at ALL.\" Like, they exist, they are a unit of energy, and I find learning about them to be far more empowering than either avoiding them altogether or obsessing over them.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621191429.0, "datetime": "2021-05-16T18:57:09", "subreddit": "fuckeatingdisorders", "id": "gycrqhu", "text": "and poor use of terminology. In calorimetry, sedentary means \"bedbound, or suffering from a medical condition that significantly limits freedom of movement.\" PAL multipliers of 1.2-1.25 (which is what the \"sedentary\" setting in TDEE calculators is based on) are observed sometimes in the very elderly, or individuals with severe neuromuscular disorders that prevent freedom of movement.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621191460.0, "datetime": "2021-05-16T18:57:40", "subreddit": "fuckeatingdisorders", "id": "gycrsz8", "text": "TDEE CALCULATORS ARE SO FRICKING TERRIBLE OOPS", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621195881.0, "datetime": "2021-05-16T20:11:21", "subreddit": "fuckeatingdisorders", "id": "gyd1j5h", "text": "Yeah, it's unreal. You can accidentally add several hundred kcals a day through stuff like that, and then add on drinks like full soda? Easy 1000kcals that normies just...forget.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623419175.0, "datetime": "2021-06-11T13:46:15", "subreddit": "fuckeatingdisorders", "id": "h1ehso6", "text": "I like to describe it as just being done with your BS. sometimes you still struggle. That doesn't mean you're not done with your BS, it's just not done with you. \n\nProud of you <3 ride the momentum", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625200538.0, "datetime": "2021-07-02T04:35:38", "subreddit": "fuckeatingdisorders", "id": "h3rofwo", "text": "I was the opposite, my body was so unused to sugar and processed foods that I couldn't eat enough calories of them without literally feeling sick from grease/sugar, what got me through was dense-ish foods that didn't have a ton of sugar and grease, so like...peanut butter sandwiches and pancakes with nut butter, basically.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626631323.0, "datetime": "2021-07-18T18:02:03", "subreddit": "fuckeatingdisorders", "id": "h5no1ny", "text": "Honestly yes plus when EH hits, \"health food\" is not going to make a dent in the caloric needs you're looking at. Like, volume + macros are for when you're kinda in energy balance and looking to optimize things, if you're into that... extreme hunger is about calories and mental/physical restriction, pure and simple.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636465228.0, "datetime": "2021-11-09T13:40:28", "subreddit": "fuckeatingdisorders", "id": "hjxmxit", "text": "Yea pls tell me how you want to slowly destroy your body to ignore how you destroying your body is ruining your life 🙃", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1636665489.0, "datetime": "2021-11-11T21:18:09", "subreddit": "fuckeatingdisorders", "id": "qrvai6", "text": "I've cycled through ED-recovery-lapse-relapse-lapse-quasi-lapse-relapse\\[...\\] (I'll be 23 in a week and started this bullshit when I was 20).\n\nNote: I know there are different EDs (BED, bulimia, etc.) but I really only have experience with restrictive ED so...sorry. I can't write to everyone's experiences, only my own.\n\nThere's a LOT of panic in this sub about extreme hunger, and it's been a while since anyone's bumped a post about what it's like when you're NOT experiencing extreme hunger, so I figured I'd attempt one. Please call me out if I say stuff that isn't helpful for people in early recovery and I'll edit ASAP.\n\nAlso, if you have weird cardiac symptoms, REGARDLESS of level of restriction, PLEASE seek medical attention if you can.  \n\nThat being said, here's what I've learned/experienced/would advise:\n\n1. Stay the FUCK away from IG/TikTok \"extreme hunger\" or \"What I eat in a day - ED recovery\" posts. You don't know if they're still restricting (they probably are), how far into recovery they are (I seriously doubt anyone documents their first 2-3 days of extreme hunger on social media because you're too busy with the insane feeding frenzy that is extreme hunger). If you're panicked about how much you're eating, comment and we can talk through it. (If you've gone through extreme hunger and you want to also offer to support, feel free to do so in the comments!)\n2. DO NOT COMPENSATE. None of this \"okay that was fun but since I CLEARLY ate \\[amount\\] over \\[allowed amount\\], tomorrow needs to be more reasonable!\" Whatever you ate *today* is whatever you ate *today*. Tomorrow is a new day. If you're still hungry, EAT. If you're not hungry, stick to 3 meals and add a snack or two. Stay hydrated but don't water-load (this does bad stuff to your electrolytes in addition to just being miserable). \n3. Don't fight it. Seriously, loading up on, idk, iceberg lettuce or whatever \"diet hacks\" you've heard is really just setting you up to be simultaneously STILL REALLY HUNGRY and also full of...lettuce. See \"water-loading,\" because really, that's what veggie-loading is.\n4. It's okay if you literally find yourself just wanting high-carb, processed foods like yknow...PopTarts. They're quick energy. Your body wants (and needs!) quick energy. Don't try to \"slow-carb-Peak-Nutrition\" your way through extreme hunger. \n5. DO NOT WEIGH YOURSELF THE DAY (OR WEEK) AFTER IT SETS IN (OR HELL, AT ALL). DO NOT. DO NOT. DO NOT. It is ALL water and food weight. (Eventually, your brain might reset to realize that gaining weight is actually the better alternative to endless physical/psychological suffering and/or death, but for now, I'll just tell you - REAL weight gain takes TIME. A LOT OF TIME. Mathematically and physiologically, you need a LOT of extra food over a substantial period of time.) \n6. Don't set a time limit. Ideally, free-eating will be your LIFE, not just X days/weeks \"while I'm recovering.\" Extreme hunger won't last forever, but freedom with food is the *goal.* \n7. It's okay to enjoy food. It's okay to enjoy eating. It's okay to enjoy giving yourself freedom to eat unrestrictedly for the first time in however long it's been. It's okay. You have not somehow failed, you are not somehow lesser. You're killing it. \n8. ...don't try to safe-food your way through extreme hunger. please. it's miserable and I'm experiencing second-hand misery just thinking about it. Get some goddamn Nutella, REAL ice cream (none of that Halo Top bullshit), cook pasta and rice instead of shirataki noodles and cauliflower, eat the egg yolk. Get a cookie (or several!) without the protein content as the main attraction, get a Starbucks drink that makes your ED tremble in fear. Conquer the weeds and the gremlins because make no mistake, they want nothing more than for you to continue suffering. \n9. Food is energy. That doesn't mean you will feel energized. I'm sorry but your body is TIRED. Even if you didn't realize it beforehand, restriction is EXHAUSTING and if you find yourself literally ONLY eating and sleeping, that's normal.\n10. You don't get a say in when it ends, and the more you fight it, the longer it will take. If you can listen to your body through extreme hunger and recovery, you get your life back. It'll be worth every minute, but you just gotta stick it out. \n\nAlso, here's a sample of *one* of my days with extreme hunger, for anyone curious:\n\n* Entire large pizza (16-18\")\n* order of mozzarella sticks (8)\n* 9-12 poptarts\n* 1-2 pints of ice cream\n* ice cream sandwich\n* 3-4 nut butter sandwiches\n* 2-3 sleeves of saltines\n* 2 protein shakes\n* cereal\n* 1-2 apples\n* tiramisu\n* steak sandwich\n* probably more things that I'm forgetting because this seems too little for extreme hunger\n\n...and I was still hungry the next day, so I ate. There were no \"protein oatmeal bowls\" or \"green smoothies\" involved. I wanted some *fucking calories* on an order of magnitude that  spinach was *not* going to deliver, and so I *fucking got some calories*.", "title": "What I've learned about extreme hunger", "context": null}
{"type": "comment", "timestamp": 1636670317.0, "datetime": "2021-11-11T22:38:37", "subreddit": "fuckeatingdisorders", "id": "hk9dvdh", "text": "Self-talk. Come up with mantras and reminders of why you want to recover. Some of mine: \n\n\"The only way out is through.\"\n\n\"Fuck the gremlins, we do not claim them as our own.\" \n\n\"No food will hurt you like starvation did.\" \n\n\"I'm done with my bullshit, even if it isn't done with me.\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636674438.0, "datetime": "2021-11-11T23:47:18", "subreddit": "fuckeatingdisorders", "id": "hk9mw3h", "text": "Yes good point! Recovery and no longer having extreme hunger does *not* mean you no longer need to eat...lol we need to eat regularly no matter what.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636675979.0, "datetime": "2021-11-12T00:12:59", "subreddit": "fuckeatingdisorders", "id": "hk9pqs7", "text": "Bingeing is a mindset. Eating because you're hungry is not a binge. \n\nAren't meal plans a minimum? Do they legitimately tell you not to exceed them? Cuz that sounds like BS to me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636723488.0, "datetime": "2021-11-12T13:24:48", "subreddit": "fuckeatingdisorders", "id": "hkbvh3n", "text": "This is where it really helped to be living with a single roommate. Yes, I was eating a fuckton more than him, but also, we didn't eat together and he literally did not care what or how much I ate. I don't think he even paid any attention tbh cuz like... healthy people aren't monitoring other people's food intake unless they need to for whatever reason.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636725942.0, "datetime": "2021-11-12T14:05:42", "subreddit": "fuckeatingdisorders", "id": "hkc0dyi", "text": "Without extreme hunger, I have no desire for that EH menu. At all. I'm also a distance runner, so my daily menu CAN be fairly intense if I need more fuel for running or recovering from running. But no, I don't want an entire large pizza with 2 pints of ice cream and a fuckton of pb sandwiches lol. I mostly just want pancakes and mashed potatoes and eggs and veggie burgers and sautéed veggies (because fuck that oil-free cooking BS). \n\n...and ice cream. I still eat ice cream LITERALLY every day.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636729120.0, "datetime": "2021-11-12T14:58:40", "subreddit": "fuckeatingdisorders", "id": "hkc7cxm", "text": "Yea extreme hunger tiktok is like wow I put an extra strawberry on my single-serve yogurt cup and made mini pitas for lunch. \n\n...if you're eating mini-ANYTHING, it's not \"extreme.\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1636741824.0, "datetime": "2021-11-12T18:30:24", "subreddit": "fuckeatingdisorders", "id": "hkd2e4x", "text": "EDs are competitive, so I suspect a lot of \"extreme hunger recovery\" videos are neither EH nor recovery. They're still-disordered individuals trying to capitalize on the social media trend of \"recovery uwu\" without actually going through the grueling process of recovery.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638492774.0, "datetime": "2021-12-03T00:52:54", "subreddit": "fuckeatingdisorders", "id": "hn0912p", "text": "Bingeing is a mindset. Eating a fuckton because you're mentally or physically hungry is entirely different than a binge. \n\nI wish you the best in recovery.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638592319.0, "datetime": "2021-12-04T04:31:59", "subreddit": "fuckeatingdisorders", "id": "hn5pu9p", "text": "Cravings can be mental hunger. Or just cravings. Who knows? Normies eat because of cravings all the time, it's not like they Only Ever Eat When Desperately In Need Of Food. \n\nhonestly, I hear the best part of recovery is not going through a 10-step checklist to determine whether you should eat or not.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1638656531.0, "datetime": "2021-12-04T22:22:11", "subreddit": "fuckeatingdisorders", "id": "hn8y65e", "text": "That's great!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641775249.0, "datetime": "2022-01-10T00:40:49", "subreddit": "fuckeatingdisorders", "id": "hrzrifq", "text": "my mom insists on calling all my food that I eat or that I make for her \"sooooooo filling, omg I don't even need to eat my next meal bc I'm sooooooo full after *ALL THAT FOOD*\" like bitch you outweigh me by 50 lbs so clearly you're just being toxic AF and my food intake is not at all \"more\" than yours...", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641851838.0, "datetime": "2022-01-10T21:57:18", "subreddit": "fuckeatingdisorders", "id": "hs4e7iq", "text": "I think some people really do think they \"dont eat\" until someone ELSE gives them food and they don't have a preconceived notion of how much they're \"not eating\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645144548.0, "datetime": "2022-02-18T00:35:48", "subreddit": "fuckeatingdisorders", "id": "hxdtahg", "text": "Extreme hunger is literally \"body wants as many calories as it can process as quickly as it can process them.\" The less you resist, the better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1645202412.0, "datetime": "2022-02-18T16:40:12", "subreddit": "fuckeatingdisorders", "id": "hxgq49o", "text": "No idea, honestly. I think it varies. Probably roughly depends on how long you restricted for, though.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653598513.0, "datetime": "2022-05-26T20:55:13", "subreddit": "fuckeatingdisorders", "id": "ia42zdx", "text": "Did not need to be attacked like this lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656439052.0, "datetime": "2022-06-28T17:57:32", "subreddit": "fuckeatingdisorders", "id": "ie2zwxf", "text": "No no no you microwave quest-type protein bars, built bars are better chilled. \n\nthis has been quasi-recovery nutrition hacks with tkdaw. ill be here all week with hot tips on how to pretend your eating habits aren't thinly-veiled self-hatred.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656439232.0, "datetime": "2022-06-28T18:00:32", "subreddit": "fuckeatingdisorders", "id": "ie30dhr", "text": "ok to be fair im a distance runner and like if i dont get a fair amount of protein (in addition to carbs) i get injured so fast lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656440676.0, "datetime": "2022-06-28T18:24:36", "subreddit": "fuckeatingdisorders", "id": "ie33zln", "text": "fair I more meant that a lot of the fake recovery people adding protein to everything might also need that cuz lifting increases your protein needs \n\nbut like it can also absolutely be disordered too", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1660997412.0, "datetime": "2022-08-20T12:10:12", "subreddit": "fuckeatingdisorders", "id": "il238lh", "text": "Righttt??????? I'm just over here like \"godfuckindammit either eat it or don't but can I please enjoy my food without a side of your guilt???\" also why would you get food just to berate yourself while eating it, like...just don't get the food?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1660998403.0, "datetime": "2022-08-20T12:26:43", "subreddit": "fuckeatingdisorders", "id": "il24xy8", "text": "I have a running watch and it tells me my calories, I don't usually look at it too closely but once in a while when I'm out walking I'll wait for the Active Cals to increase by 1 and then think \"that was powered by the amount of energy required to raise 1 cc of water 1k °C...4,184 Joules of PURE SPITE AND RAGE (as I take 20-40ish very calm steps on a paved path through the woods)", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1691632686.0, "datetime": "2023-08-10T01:58:06", "subreddit": "fuckeatingdisorders", "id": "15myslu", "text": "Idk I feel like it's just letting your body *be*? Like the endgoal is just eating a variety of foods, being willing to try new things, not focusing on calories (either restriction OR \"maintenance\" OR gymbro gainz) but just accepting that there will be days you're at a deficit and days you're at a surplus and your body may change over time and that's OK. \n\nrecognizing that nothing changes in a day or a week \n\nrecognizing that movement is healthy unless you do it for unhealthy reasons or in unhealthy ways \n\nlearning to live life without eating from a calculator or a checklist \n\njust..learning to *be* again \n\nI hope I get there some day", "title": "is a big part of recovery just...letting go?", "context": null}
{"type": "comment", "timestamp": 1691640548.0, "datetime": "2023-08-10T04:09:08", "subreddit": "fuckeatingdisorders", "id": "jvjii1u", "text": "Right 😭", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1691763716.0, "datetime": "2023-08-11T14:21:56", "subreddit": "fuckeatingdisorders", "id": "jvqg9he", "text": "I'm halfway through a PhD in physics and recovery is harder 🙃", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1695867676.0, "datetime": "2023-09-28T02:21:16", "subreddit": "fuckeatingdisorders", "id": "k2iubvz", "text": "Calories calories calories, drink if you're thirsty but don't chug water to feel full. It's terrifying but the only way out is through. Sending hugs", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1696877195.0, "datetime": "2023-10-09T18:46:35", "subreddit": "fuckeatingdisorders", "id": "k4619zq", "text": "It's going well!! I'm vibing, still have my days in the weeds but the highs are higher and the low points aren't as low. The EH didn't last forever and getting out on the other side is very freeing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707230631.0, "datetime": "2024-02-06T14:43:51", "subreddit": "fuckeatingdisorders", "id": "kp6kzey", "text": "No. Stretching or gentle yoga or short walks, maybe! But drop the gym and chill 😎 it'll be OK", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707252319.0, "datetime": "2024-02-06T20:45:19", "subreddit": "fuckeatingdisorders", "id": "kp8bxi1", "text": "Recovery does sometimes entail weight gain. Odds are that most of that is water and food/waste in your intestines. Maybe 5-7lbs of *weight* weight, max.\n\nDon't weigh in recovery. It will not serve you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1715624553.0, "datetime": "2024-05-13T18:22:33", "subreddit": "fuckeatingdisorders", "id": "l3vwigj", "text": "A while. But you'll be ok. You find a balance eventually.", "parent_id": null, "link_id": null, "context": null}
