{"type": "comment", "timestamp": 1621199921.0, "datetime": "2021-05-16T21:18:41", "subreddit": "bulimia", "id": "gydaikz", "text": "16F, been struggling with anorexia nervosa for 2 1/2 years. I’ve had bouts of purging before but for the past few months I’ve really spiralled into b/p almost every day, sometimes several times per day. I also struggle with anxiety, depression and self harm. Sometimes I don’t want to get better but I know I need to stay alive to take care of my cat, who I love more than anything on earth (ik that’s kinda a dumb reason but it’s all I have right now)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625871972.0, "datetime": "2021-07-09T23:06:12", "subreddit": "bulimia", "id": "h4n8ab8", "text": "I wish my dentist had been this supportive. After I told him about my purging he just said I didn’t have much acid damage and left it at that. Would you mind sharing the info you gave your patient about protecting teeth? I would really appreciate it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1627785024.0, "datetime": "2021-08-01T02:30:24", "subreddit": "bulimia", "id": "h79rf0c", "text": "I’m really sorry. I had/have anorexia, it’s morphed to AN b/p though and it’s 1000% worse. I restrict all day and b/p at night. Thank god I’m still losing weight but I’m having serious side effects and I’m barely underweight.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1635185171.0, "datetime": "2021-10-25T18:06:11", "subreddit": "bulimia", "id": "hi0hctc", "text": "Wow congrats that must be so tough… 100 days is a huge accomplishment! Keep it up and good luck with your recovery!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1637938174.0, "datetime": "2021-11-26T14:49:34", "subreddit": "AnorexiaNervosa", "id": "hm5qjoo", "text": "Yeah I get this, I want to lose weight to show that I’m sick, to get people around me to understand that and because I’m so tired of everyone thinking I’m fine just because I’m functioning. Being physically ill, and/or in hospital makes me feel valid. I do want to be skinny but only because I know it looks bad, I know people will think I’m fucked up. I want to prove that I’m sick", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1646869674.0, "datetime": "2022-03-09T23:47:54", "subreddit": "bulimia", "id": "i01gp5o", "text": "Omg you know me so well… I do all except numbers 2 and 11. I’m obsessed with food tbh my whole life revolves around it even when I’m not actively eating", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651156068.0, "datetime": "2022-04-28T14:27:48", "subreddit": "AnorexiaNervosa", "id": "i6jcurs", "text": "I haven’t dealt with the social media side of things but I was forced to recover (which basically just meant extreme weight gain) and the way it was done was extremely traumatic to me. I was allowed no input or opinions, belittled and borderline abused by parents and doctors.\n\nWhile I accept that it’s too much to ask loved ones to simply stand by and allow someone to die, recovery has to come from within, and it has to be on the person’s own terms.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651230135.0, "datetime": "2022-04-29T11:02:15", "subreddit": "AnorexiaNervosa", "id": "i6ngioe", "text": "Yeah it was FBT :(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651244086.0, "datetime": "2022-04-29T14:54:46", "subreddit": "AnorexiaNervosa", "id": "i6o8fop", "text": "I'm so sorry you had to go through that too. I agree, it is absolutely awful.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652198467.0, "datetime": "2022-05-10T16:01:07", "subreddit": "EatingDisorders", "id": "i82d5pl", "text": "I developed anorexia at 13, and I had a very small chest before that. I never had any problems with puberty or anything, after being weight restored I grew an inch at 15, and my breasts got a bit bigger but still relatively small. I went on birth control at 16 and that made them grow a fair amount, even though I was/still am underweight. One thing is though that I only lost my period for a few months. If you lost yours for longer it might be different. I do have other lasting side effects though. EDs can really mess up your body.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652303215.0, "datetime": "2022-05-11T21:06:55", "subreddit": "bulimia", "id": "i88hj6m", "text": "Yikes I’m sorry, that sucks. I’ve only been purging for a year on and off, and I’m already seeing tooth damage and pain. I’m honestly so scared I’ll lose my teeth, I want to stop, but it’s so hard. Congratulations on your recovery though!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658013015.0, "datetime": "2022-07-16T23:10:15", "subreddit": "AnorexiaNervosa", "id": "iggbxed", "text": "I know right? It encompasses your entire life.  Every single memory from the years since I got sick has been tainted. Instead of remembering a holiday with my family for all the good times and fun, I remember avoiding the pool, seeing a really skinny woman, and binging on banana bread. Instead of remembering my prom for spending time with my friends, I remember the number of steps I took that day and panicking about drinking a juice. I don’t even know who I am anymore except this illness. I’ve hurt so many people because I was/am only focused on eating less or finding a place to p*rge. I hate this life. You’re right, it’s such a waste.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658022786.0, "datetime": "2022-07-17T01:53:06", "subreddit": "AnorexiaNervosa", "id": "iggvj0e", "text": "I wouldn’t call myself in recovery, but I’m maintaining at only slightly underweight and trying to eat more. I’m still struggling and I don’t plan to actually recover anytime soon but I’m doing wayyy better than I was before, with my ED and with depression and self harm", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658343527.0, "datetime": "2022-07-20T18:58:47", "subreddit": "bulimia", "id": "igyb7op", "text": "As someone who used to have AN-R and switched over to AN-BP (basically BN but I’m slightly underweight) I totally agree. Yes, having restrictive anorexia was hell, I was miserable, for sure. All EDs fucking suck. But b/p is a whole other hell. Despite being 15lbs over my lowest weight I feel just as physically bad as I did then, I have no energy, all my time is spent b/ping or planning it. The mental and physical energy it takes up is ridiculous. And the health effects have fucked me up so fast. And I don’t even get the sick sense of pride and control that comes with restriction bc I feel so guilty for b/ping.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658758528.0, "datetime": "2022-07-25T14:15:28", "subreddit": "bulimia", "id": "ihkw9od", "text": "Oh boy there are a lot of potential side effects… damaged knuckles, nosebleeds or even sinus infections, GERD (chronic acid reflux), other stomach issues such as gastritis, ulcers, gastroparesis, Barrett’s esophagus, esophageal cancer, Mallory-Weiss tears (tears in your esophagus), stomach or esophageal rupture (this is often fatal), in addition to tooth damage there could also be sores in your mouth or damage to the gums, dehydration, electrolyte imbalances leading to heart attacks, chest pain, arrhythmias, type 2 diabetes, high or low blood pressure, dizziness and fainting, hair loss, brittle nails, nutrient deficiencies such as iron deficiency anemia, and seizures (I’ve had a seizure from purging and it was TERRIFYING). Some of these are relatively mild but a lot of them are very serious - you can end up with lifelong chronic health problems or you can die suddenly.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659557477.0, "datetime": "2022-08-03T20:11:17", "subreddit": "ARFID", "id": "iitr4tx", "text": "What?!?! If she knew anything about EDs she’d know that that’s not even what you have… what a low blow. Don’t listen to a word she says", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1660179711.0, "datetime": "2022-08-11T01:01:51", "subreddit": "bulimia", "id": "ijsqa5h", "text": "I’m not an expert on this, but I’m pretty sure the amount absorbed can vary drastically. Otherwise you wouldn’t see severely underweight ED sufferers who b/p massive amounts of food daily. \n\nFrom my limited understanding of human physiology though, doesn’t nutrient absorption start in the small intestine? Food is broken down in the mouth and stomach but I thought that you only started actually absorbing macronutrients (which are broken down into energy) through the walls of the digestive tract once it was in the intestine. Your body can’t utilize food for energy much less store it as fat while it’s still physically in chunks - anything that comes back up will not have been absorbed. Doesn’t make purging even remotely worth it, though. The health consequences far outweigh any potential (some may lose weight, some may maintain, some may gain) weight loss even if 0 calories were metabolized. I don’t understand where these statistics on “x percent is absorbed” come from though so I may be wrong. Idk.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1663432203.0, "datetime": "2022-09-17T16:30:03", "subreddit": "ARFID", "id": "iotatyu", "text": "Yeah, I guess i have avoidant ARFID+ (and techincally adult too?)\n\nAlso what would you call it if you have comorbid GI issues that make it difficult to eat and cause anxiety around food? Like I’m not irrationally scared of vomiting/nausea, it’s just that it actually happens a lot and therefore kills my appetite…", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1664224254.0, "datetime": "2022-09-26T20:30:54", "subreddit": "ARFID", "id": "iq0n01a", "text": "Ugh it is SO hard having ARFID and being vegan. There’s usually just one vegan option and since I don’t like/won’t eat a lot of things my options are even more limited", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1667766179.0, "datetime": "2022-11-06T20:22:59", "subreddit": "bulimia", "id": "ivbs4hf", "text": "This is so weird… I also had a similar dream last night that all my teeth fell out!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1668293795.0, "datetime": "2022-11-12T22:56:35", "subreddit": "bulimia", "id": "iw4o7r9", "text": "I initially had AN-R for a few years and then switched over to AN-BP (/bulimia, they’re basically the same) and I miss having typical old restrictive anorexia SO MUCH. I’ve had so many negative health effects but also just the constant weight fluctuations due to having or not having food in my stomach, being scared of keeping things down, trying to quit over and over and failing, filthy apartment, no money bc I spend it all on binge food, no social life or hobbies, and the crushing guilt. I think the guilt and shame and mental anguish that comes with b/p is the worst part of it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1677357075.0, "datetime": "2023-02-25T20:31:15", "subreddit": "bulimia", "id": "j9zz0vm", "text": "- Going the corner store 4 times in one evening and knowing the same cashier just saw you buy their entire stock of apple pies (too specific? 😭)\n- Shitting yourself while purging\n- spending literally all your money on b/p food\n- eating expired or half-frozen food\n- having dirty dishes and food containers and crumbs everywhere", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679698258.0, "datetime": "2023-03-24T22:50:58", "subreddit": "EatingDisorders", "id": "jdjxr45", "text": "This sucks, I had the same experience with a hospital ED program. They recommended IP but it wasn’t possible for me so they wouldn’t offer me anything else. And then you end up getting no treatment whatsoever. It’s so fucked up. I’m sorry this has happened to you too, healthcare system sucks sometimes", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679717626.0, "datetime": "2023-03-25T04:13:46", "subreddit": "EatingDisorders", "id": "jdl1rf0", "text": "Oh I totally understand WHY they refuse to offer lower-level care, I was told the exact same thing. That they would not be equipped to handle it at a lower LOC and would be liable if something happened. I still just think it’s pretty fucked up that OP and many others, including me, get left with no alternatives which can be incredibly dangerous.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1680742799.0, "datetime": "2023-04-06T00:59:59", "subreddit": "bulimia", "id": "jf4mkrw", "text": "Oh boy I’ve got so many…\n- being hospitalized for general mental health and they didn’t know about my purging so I b/ped on the psych ward and purged in the shower… shower got clogged, water level RAPIDLY rising, had to unclog this filthy shower with my hands while ankle deep in puke water\n- binging on a jar of natural peanut butter (nothing else) while staying at a friends house, purging in the shower… worst purge of my life, it wouldn’t come out and thought I was gonna die choking. \n- staying up literally all night multiple nights in a row (sleeping most of the day) b/ping 6 times a day and only leaving my apartment to go to the corner store in the middle of the night for food\n- going to said corner store 4x in one day and buying their ENTIRE stock of frozen apple pies (the cashier was confused 💀)\n- b/ping while hospitalized FOR my ED… staff were clueless. Most unhelpful IP experience of my life.\n- purging in a bush in the park in the middle of winter (I live in Canada btw) bc my parents made me eat a strawberry yogurt\n- and just in general over last fall/winter spending almost every night feeling like I was dying (I think it was hypoglycaemia +/- dehydration) and being 100% convinced that my family was going to find my dead body after weeks of not hearing from me (I was living alone) bc I dropped dead in front of the toilet. Dark times.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1682442556.0, "datetime": "2023-04-25T17:09:16", "subreddit": "bulimia", "id": "jhobj7w", "text": "I can’t believe I’m admitting to this but… took money from my parents. Like I’d steal a $20 now and then from their wallet to spend on b/p food. God, I feel so awful", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683120720.0, "datetime": "2023-05-03T13:32:00", "subreddit": "bulimia", "id": "jip0vrz", "text": "I lost quite a bit of weight and got underweight while b/ping multiple times a day, but then after a while it stalled. Partially bc the frequency of b/p kept increasing. I’ve been gradually decreasing b/p frequency over the past few months and had been losing and gaining the same 2kg. I think part of it was also that my intake (outside of b/p) had gotten very low so when I increased it there was a bit of weight gain while my body adjusted. And I went through a little phase where I was trying to quit while simultaneously increasing my cal intake and had some extreme hunger episodes, after which I’d purge but bc it wasn’t planned I ended up absorbing quite a lot of food from them. Now I do seem to be losing weight again with the OCCASIONAL b/p but it is slower than expected and if I b/p more than about 3-4x a week I maintain. The other problem is that the constant quitting-then-giving-in-again cycle is causing recurrent water retention.\n\nHonestly though, even if you do lose weight from b/p that doesn’t make it worth it AT ALL. The health effects, and overall impact on your life is so awful.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1688418797.0, "datetime": "2023-07-03T21:13:17", "subreddit": "bulimia", "id": "jqjznsj", "text": "Yes. I will never be satisfied until I’m dead. It’s not about looking a certain way for me, it’s about slowly destroying my body.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1692581935.0, "datetime": "2023-08-21T01:38:55", "subreddit": "bulimia", "id": "jx2r0op", "text": "I can absolutely totally relate. I also hate when others are home, I avoid going out or socializing bc I’d rather b/p, i actively try to get the place to myself so I can b/p. I spend every second of every day either b/ping, preparing to b/p (buying and making food), cleaning up, or thinking about how I’m going to later. I can’t go a day without doing it. It’s the only thing that brings me comfort anymore. I’ve lied and stolen and just in general been a terrible person bc of how much I want (or think I want, anyways) to do this. It really does feel like an addiction. The habit is so ingrained at this point. You don’t need to feel like you are greedy or bad though (although I can understand why you feel that way as I often do too), at the end of the day it is a severe mental illness and not a character flaw or a choice. I’m so sorry you’re going through this too 🖤", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710185459.0, "datetime": "2024-03-11T19:30:59", "subreddit": "bulimia", "id": "kuetz42", "text": "You have a point, but also I would argue that we’re not talking about an “addiction to food” in which case abstinence from food would be a logical thought progression. What if we called the addictive behaviour/substance, in this model, binging and purging? As a behaviour? And that you need to abstain 100% from the addictive behaviour of b/p in order to recover?\n\nI’m not sure I would completely equate bulimia to substance addiction, you’re right. But there are a lot of parallels if you consider the addictive “thing” to be b/p rather than food generally.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1711897226.0, "datetime": "2024-03-31T15:00:26", "subreddit": "AnorexiaNervosa", "id": "kxekz36", "text": "There’s a huge genetic component. Some people have genes where for some reason they derive a huge sense of reward and easing of psychological distress from starvation. It’s sometimes described as a “high” or “I just function better when I’m hungry”. Combine that with certain personality traits or life circumstances such as perfectionism, rigidity, possible OCD or autism, possible trauma, and it’s easy for an innocent diet or even some instance of accidental weight loss to “flip the switch” and send the person down a spiral where the restriction feels so rewarding and “helpful” that they can’t get out.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1713153056.0, "datetime": "2024-04-15T03:50:56", "subreddit": "AnorexiaNervosa", "id": "kzmremf", "text": "You’re absolutely not alone. The VAST majority of people with anorexia and other EDs feel like their illness isn’t valid. It’s kind of a hallmark symptom. Even people on their deathbed will still express this feeling - it will NEVER be enough.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1713188583.0, "datetime": "2024-04-15T13:43:03", "subreddit": "AnorexiaNervosa", "id": "kzoefxq", "text": "Totally agree! Well said", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1715257906.0, "datetime": "2024-05-09T12:31:46", "subreddit": "AnorexiaNervosa", "id": "l39tys1", "text": "Oh, yeah, I know for sure I’m dangerously underweight. Sometimes I can even look at myself and see “wow, I look really sick”. I know I’m not healthy, I don’t feel healthy, I know I need to gain weight. The problem is I’m terrified, and I feel safe this way. I don’t have to deal with all the scary, difficult things about a normal life. I can withdraw, I can control, I can remain safe in my little cocoon of disorder. It’s all I’ve known for so long. And sometimes when I look at my body I still think, oh this bone could be more prominent. This part could be smaller. There’s still some fat here, even if I know I’m not fat. It doesn’t feel like enough. I could still be smaller.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1719447792.0, "datetime": "2024-06-27T00:23:12", "subreddit": "AnorexiaNervosa", "id": "lag65zh", "text": "I feel really uncomfortable and watched. Especially since often I go and buy b/p food and I know I look weird as a visibly underweight person with a cart full of junk food and like… energy drinks. I have a real problem/compulsion around food shopping and now I’m scared to go to the stores near home bc all the cashiers recognize me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1719713211.0, "datetime": "2024-06-30T02:06:51", "subreddit": "bulimia", "id": "lax65gb", "text": "I was in this exact situation a few months ago. It was a pretty small local store too. I felt so vulnerable and watched. If it’s any comfort to you, probably most other ppl there don’t care at all, they just want to get through their shift and go home.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725032150.0, "datetime": "2024-08-30T15:35:50", "subreddit": "bulimia", "id": "lkor5m0", "text": "The whole thing about “purging doesn’t get rid of the calories” is a myth. If you’re seeing it in the toilet bowl you have not absorbed anything from it. Some people aren’t very effective at getting everything out. Some are. \n\nAs for the whole “I stop purging and gain 10kg”… that’s not real weight gain. That’s severe water retention and edema. Your body has gotten used to existing in a chronic state of dehydration. Vomiting is extremely dehydrating and so when you stop, your body will upregulate production of certain hormones that control your water/salt balance. It’s doing this in order to hold onto as much of that precious water as possible, because it’s been lacking. This makes the scale weight go up and you may even notice visible swelling. Also, when you stop purging you’ll weigh more bc of the weight of the food in your digestive tract. Again, not real body weight. Your digestion may be very slowed as your body learns to process food normally again. It’s very distressing and uncomfortable but it’s temporary. The only way out is to push through it until your body reaches a place of equilibrium again.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725032623.0, "datetime": "2024-08-30T15:43:43", "subreddit": "bulimia", "id": "lkospbl", "text": "You got this! It will probably be uncomfortable and difficult at first, but your body is trying to protect and take care of you. And if you take care of it then in time you will grow to trust each other again.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725043344.0, "datetime": "2024-08-30T18:42:24", "subreddit": "bulimia", "id": "lkpqeg0", "text": "So glad I could help in some way!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725043353.0, "datetime": "2024-08-30T18:42:33", "subreddit": "bulimia", "id": "lkpqfhg", "text": "❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725052452.0, "datetime": "2024-08-30T21:14:12", "subreddit": "bulimia", "id": "lkqi604", "text": "Most of my information is drawn from *Eating Disorders: a comprehensive guide to medical care and complications (4th edition)* which is generally regarded as an excellent resource in the field. Specifically you can check out pages 139-140, and 182-191. I’ve also drawn from peer-reviewed research in this area; you can check out the citations in the book above if you’re looking for a place to start. If you want to read something a bit more concise and accessible, *Sick Enough* also touches on this issue a bit. \n\nSo, no, not “bro-science”. I don’t expect anyone to take random medical information from a stranger on the internet at face value, as you reasonably pointed out, but I’m not pulling this out of my ass.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725052604.0, "datetime": "2024-08-30T21:16:44", "subreddit": "bulimia", "id": "lkqimi3", "text": "Absolutely! I most certainly have found that I gain weight steadily over weeks/months on that amount. I wasn’t saying that *any* weight gain wouldn’t be body mass, but rather that if, as many other commenters have been saying, you gain many pounds in a matter of several days upon cessation of purging behaviours, there are probably fluid shifts to blame.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725068278.0, "datetime": "2024-08-31T01:37:58", "subreddit": "bulimia", "id": "lkrok6c", "text": "Honestly, I’m not entirely sure. I imagine it’s quite individualized and dependent on you completely quitting purging cold turkey. Factors like how frequently you were purging, if you used laxatives, your weight, and how long you’ve had bulimia would affect it too. From what I’ve read it’s somewhere in the realm of a couple/few weeks for things to resolve.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725196747.0, "datetime": "2024-09-01T13:19:07", "subreddit": "bulimia", "id": "lkzg57q", "text": "You may be right! I’ve searched far and wide for a definitive answer on whether any macronutrient (generally, carbohydrate) can actually be absorbed into the bloodstream through the mouth, and I really can’t find anything clear-cut. So I guess it’s possible that some minor amount of carbohydrate may be absorbed through the mouth. But the vast majority of macronutrient absorption happens in the small intestine, and whatever amount may be absorbed through the mouth is negligible. Honestly I find it difficult to believe that any meaningful amount of carbohydrate can actually enter the bloodstream through the mouth as most of the reliable sources I’ve read on this make no mention of it… but I might be wrong lol, I’m not an expert\n\nThis is a very minor thing, but I want to be clear that digestion is not the same thing as absorption. Digestion = breaking down of food into its energy- and nutrient-containing substituents, while absorption = crossing of these molecules from the GI tract into the bloodstream where they can eventually be used for energy. Yes, carbohydrates begin to be broken down into simple sugars in the mouth. Digestion happens all along the upper GI tract. Absorption happens in the small intestine.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727735281.0, "datetime": "2024-09-30T22:28:01", "subreddit": "bulimia", "id": "lpq0v31", "text": "Yep this was me. Developed AN-R at 13 and after years of forced treatment interventions it eventually acquired b/p behaviours when I was 16. I’ve had AN-BP the last 5 years and honestly the b/p component is way more an issue than the “anorexia”, it’s gotten so out of control. \n\nResearch seems to suggest that a significant percentage of AN-R patients will eventually symptom-switch into AN-BP or BN. And that this is associated with longer duration of illness, lower functioning, and worse outcomes.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727966764.0, "datetime": "2024-10-03T14:46:04", "subreddit": "bulimia", "id": "lq582gl", "text": "Yes, absolutely. I’ve binged on broccoli, and many other vegetables. I’ve binged on raw oats. I’ve binged on flour mixed with water and salt. I’ve binged on moldy food. Sure, my binges mostly consist of hyperpalatable high calorie food but they actually always include vegetables.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727989522.0, "datetime": "2024-10-03T21:05:22", "subreddit": "bulimia", "id": "lq77tr8", "text": "When you’re desperate and deep in the habitual, addictive behaviour, it doesn’t matter so much what you binge on. You crave the *feeling*, the release, the calming of the mind. I prefer to b/p tasty things because I have taste buds lol but also it’s not the food itself that I’m addicted to that’s keeping me stuck in this behaviour, it’s the neurochemicals that are released due to the behaviour itself. If I just wanted to taste something nice I’d find a less harmful way of doing that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728049113.0, "datetime": "2024-10-04T13:38:33", "subreddit": "bulimia", "id": "lqarjsa", "text": "I agree that highly processed foods and wheat flour can be easily over consumed. And that they produce a lot of reward in the brain. But it is absolutely incorrect to say that bulimia is at its core caused by an addiction to these substances and that removing them will solve the problem. There is absolutely no evidence to show that to be the case. Also, considering I am at a dangerously low BMI it kind of makes sense for my brain to seek out calorie dense and rapidly digesting foods. \n\nIn any case, I’m not arguing that people can’t struggle with food addiction or that the nature of hyper palatable foods can’t contribute to the problem, but it is not the root cause or the sole solution.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729032766.0, "datetime": "2024-10-15T22:52:46", "subreddit": "AnorexiaNervosa", "id": "ls45ueq", "text": "Aaahhh I love Amy’s burritos! Proud of you 💕", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729804064.0, "datetime": "2024-10-24T21:07:44", "subreddit": "AnorexiaNervosa", "id": "ltkurx7", "text": "I totally agree. There’s more to recovery than just physical healing and behavioural remission. You also have to let go of your ED identity, and find other interests and things to fill your life. If you are still thinking about your ED all the time or revolve your whole personality - or, god forbid, career - around your past ED… then, while you may be in remission, and you may have a wonderful life, that’s not for me to judge… I’d still hesitate to call such a person fully recovered.\n\nThe people in my life who I know are fully recovered for real, they don’t talk about it, they don’t base their identity around their illness OR their recovery. I wouldn’t have even know they’d ever been ill unless they’d told me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733092286.0, "datetime": "2024-12-01T22:31:26", "subreddit": "AnorexiaNervosa", "id": "lzxz9zg", "text": "Some people are mean. I wish it were true that all ED sufferers were able to have empathy for others based on their own experience and thus not be cruel, but alas there will always be ppl who do shitty things. You also have to bear in mind that a lot of the ppl who are bullying others online for their weight are teenagers; their brains haven’t fully developed and they are probably struggling a lot mentally. Of course that is NOT an excuse to harm others but given the prevalence of bullying in the non-ED teen population, I wouldn’t expect it to be any different. We also know how much malnutrition can affect behaviour and judgement, and it can lead to some kind of stunted emotional maturity in young people. Again, none of these things are excuses and I can’t understand why someone would ever want to make a stranger feel bad, but I’m sure it feels logical and justified to the perpetrators.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735159506.0, "datetime": "2024-12-25T20:45:06", "subreddit": "AnorexiaNervosa", "id": "m3s5xr0", "text": "Spending incredible amounts of my parents’ time and money on private treatment while I had absolutely no intention of even trying to recover. My mom took time off work, it was incredibly hard on everyone, and I lied and said I was trying my hardest and really wanted to get better. The truth eventually came out, of course, but far too late. I wish I’d just found a way to have an honest conversation about it sooner to spare us all that hardship.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735846470.0, "datetime": "2025-01-02T19:34:30", "subreddit": "AnorexiaNervosa", "id": "m521kgq", "text": "It’s not a healthy or normal way to think, but it certainly doesn’t make you a bad or wrong person in any way. You have a mental illness that is distorting your thoughts. A lot of us with EDs feel the same way.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737667431.0, "datetime": "2025-01-23T21:23:51", "subreddit": "bulimia", "id": "m8sozv4", "text": "You’re not alone. I don’t really track them often bc it’s so tedious but even a quick mental sum of an average binge is always well over 10k, and when you multiply that by 2-5+ episodes a day, well…\n\nIt’s crazy how much things can escalate. It feels genuinely normal to me now to demolish entire cakes, entire bags of pasta, loaves of bread, tubs of butter and more in one sitting. To spend my whole paycheck on food. Sometimes I forget how way outside of normal this behaviour is, and how incredibly destructive it is to the body.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738511390.0, "datetime": "2025-02-02T15:49:50", "subreddit": "bulimia", "id": "makhrai", "text": "I feel exactly the same way. Had AN-R for a few years and then switched to AN-BP and it is hell. My family doesn’t understand, they kind of get the AN part but they just can’t wrap their heads around b/p and it causes them so much frustration and pain. I have been completely taken over by this behaviour in a way that restriction never did. And it has destroyed my body faster and more completely than straight restriction did either. The sense of shame is overwhelming and yet stopping feels impossible.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743610198.0, "datetime": "2025-04-02T16:09:58", "subreddit": "bulimia", "id": "ml1lcx2", "text": "This is such a complex and interesting issue. While I admit I have concerns about ppl obtaining GLP-1s illicitly and abusing them (ie. ppl with restrictive EDs), I also recognize that they can be game-changers for other folks. I’m glad to hear that your quality of life has improved; as someone who strongly believes in harm reduction, I’m all for that. I’m curious, do you see yourself taking semaglutide long term, or do you plan to taper off at some point? Have you discussed with your therapist how to sustain this amazing progress long term? I encourage you to think about this, in case your access or life circumstances change.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744416286.0, "datetime": "2025-04-12T00:04:46", "subreddit": "AnorexiaNervosa", "id": "mmnjjys", "text": "I totally empathize with your experience. People think “oh well if this sucks for you so much then go to a higher level of care and get better” and how do I explain the clinical PTSD I’ve gotten from repeated, horrific IP experiences? I’m also autistic and I truly cannot think of a *worse* environment for an autistic person than ED inpatient. \n\nI also have bladder issues from my anorexia, namely incontinence and interstitial cystitis. I never dare speak of it bc of the horror and stigma it would provoke from others. I also never expected to get weird neurological issues - it’s probably a cervical nerve impingement (more testing needed) but I get painful electric shocks down my back and arms, and it happens whenever I swallow anything. Eating is painful in ways I could have never anticipated. I don’t *know* that it’s from my ED but that seems the most likely explanation. Don’t get me started on the chronic pain. I’m in my 20s, I shouldn’t be feeling like this. I can’t ask for help because I either hear “well duh, it’s just your ED, you should gain some weight and it’ll go away”, or “haha just wait until you get to my age, you don’t know what pain is!”", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745096386.0, "datetime": "2025-04-19T20:59:46", "subreddit": "AnorexiaNervosa", "id": "mnzkkfj", "text": "Honestly, yes. For the most part. I know it’s kind of a controversial thing to say and certainly not the case for everyone. A large part of my body image issues is to do with having a feminine body, gender dysphoria, etc. When I’m very underweight it doesn’t bother me much. I don’t bodycheck or take a bunch of pictures compulsively or change outfits a bunch. I don’t look at my body excessively or avoid looking at it at all. \n\nThe caveat is that although I don’t experience body image *distress*, I still have some degree of body image *distortion* as I see myself as just mildly thin or like, skinny in a way that passes as healthy, rather than severely underweight. Loved ones tell me I look sick and I truly don’t believe them, because I think that’s just bc they know about my ED and are worried - strangers never comment on my body or act concerned. \n\nWhen I was at a healthier weight I experienced so much distress, and body checking/avoidance behaviours. It doesn’t bother me like that anymore. If I gain even a little bit though, even though I’m still objectively underweight, I get very distressed again. And since I regained my period (despite not gaining weight) I’ve also experienced a resurgence of distress associated with my gender.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746280723.0, "datetime": "2025-05-03T13:58:43", "subreddit": "AnorexiaNervosa", "id": "mqde8zk", "text": "It’s ok for people to not want to recover, not pursue recovery, and actively choose to remain sick. People shouldn’t be forced into treatment, assuming they have the most basic decision making capacity. Choosing to remain sick isn’t a bad or wrong choice, even if that choice is a direct result of the ED itself. \n\nOf course I want recovery for everyone (except maybe myself lol) and that would be the ideal scenario but some ppl aren’t capable of it at the moment, aren’t ready, or don’t want to and *that’s fine*. Professionals refusing to work with someone who isn’t willing to recover/go to a higher level of care/sign a contract is unethical and causes more harm. Threatening people into recovery doesn’t work. \n\nNo one wants to admit it, but oftentimes the ED is serving a function and, as a coping strategy or protective thing, it WORKS. There are downsides, yes, but forcing someone to give up ED behaviours that may be keeping them safe in other ways is cruel. Virtually everyone has harmful and negative coping mechanisms, whether that is alcohol/substances, relationship issues, overeating, isolation, overworking, self harm, whatever. No one coerces them into giving those things up or tells them they’re just delusional and incapable of making decisions… until it’s a restrictive ED.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746286773.0, "datetime": "2025-05-03T15:39:33", "subreddit": "AnorexiaNervosa", "id": "mqdx1s6", "text": "I know you can get sectioned for many reasons. And, like I said, *assuming basic decision making capacity*. I understand if someone is at imminent risk of death, and I understand other situations like severe self injury, suicidality, mania, psychosis etc. \n\nThis was “unhinged ED hot takes” for a reason. People have been “encouraging me to reconsider” for years. I’ve *been* sectioned, I’ve been force fed, multiple times, I’ve been coerced and pressured into treatment. It made me sicker, because I wasn’t ready. It almost killed me. \n\nNow, I have a wonderful therapist and family physician who work with me from a harm reduction perspective, who don’t try to threaten or scare me into treatment. They meet me where I’m at and for the first time in years I have actually found the genuine motivation to try and make changes, because I WANT to live a better quality of life. That’s something that forced treatment never did for me. I’m well informed of the risks and medical complications that can/will arise from an untreated ED. But it is my firm belief that for sound-minded, informed adults - especially those who have been ill many years - it is their choice to recover or not, or to pursue harm reduction. You can, in some cases, force someone to weight restore but you cannot force someone’s mind to heal.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746306063.0, "datetime": "2025-05-03T21:01:03", "subreddit": "AnorexiaNervosa", "id": "mqflzsh", "text": "If you are a minor, then things are kind of different. I will never tell a young person that it’s ok to not pursue treatment, and ultimately at that age it kind of isn’t up to you. I am personally not a fan of FBT because I had a negative experience, although I know it can work for some people. I doubt anything you say would convince your parents or team to just say “ok cool you can not do treatment, have a nice life”. You’re young, and chances are you haven’t had a long, enduring, entrenched illness so your chances of recovering and being able to live a full, happy, free life are better now. I advise you to really take this chance to give treatment your all and get this behind you. \n\nThat being said, it’s true that although, as a minor, they CAN make you gain weight and normalize your eating habits, only you can make the decision to commit to recovery and do the psychological work needed to truly get better. I can’t just tell you to do that, your team can’t make you, and it isn’t wrong to not want to recover. I’d argue that not wanting to recover is pretty normal, especially in the earlier years of illness. So, you’re kind of at a crossroads here. You’re probably going to have to do treatment of some kind whether you want to or not, but you can choose to get as much as you can out of that and really give it your best shot, or you can half-ass things and get through it without really giving recovery a chance. \n\nI’m sorry, I probably should have clarified in my original two comments that my stance on this is more so for adults. I don’t think forced treatment works, period, and I am not a fan of FBT… but I DO feel that family and the healthcare system have a responsibility to minors to try and help them get well even if they do not feel ready to.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747349107.0, "datetime": "2025-05-15T22:45:07", "subreddit": "AnorexiaNervosa", "id": "msj580s", "text": "Incontinence - shitting and pissing yourself so often it becomes almost normal. Lying to everyone you love, because honestly is less important than your ED. It feels easy. You become mean and irritable and totally unpleasant to be around. You lash out to everyone around you, especially when it has to do with food. Depending on your particular behaviours, you might find yourself spending ungodly amounts of money on food (or heck, treatment) or dental work. \n\nAbsolutely stunting your EMOTIONAL development - now you’re an adult and you haven’t hit all the normal milestones, maybe your education or career has been derailed, you’ve lost social skills. Maybe it’s affected your ability to have a relationship or live independently. I’m in my 20s and am only part time in college and work, years behind in my degree, living with my parents, no money (as in, 0.74 in my bank account), no driver’s license, no friends (literally none), have never been in a relationship or even gone on a date. I feel light years away from everyone else my age, I can’t relate. I’m sure part of it is the autism, but having had an ED since age 13 certainly hasn’t helped.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1750619695.0, "datetime": "2025-06-22T19:14:55", "subreddit": "bulimia", "id": "mz79g3q", "text": "I’m glad to hear that you found it helpful! It might also be good to know that the longer you’ve been purging the more likely you are to have water retention and other uncomfortable side effects when you stop. If you just started doing it again, now is the best time to stop and it will be much easier, both psychologically and physically, if you stop it sooner.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1752457382.0, "datetime": "2025-07-14T01:43:02", "subreddit": "fuckeatingdisorders", "id": "n303nar", "text": "I really, really needed this. Thank you. I love the garden analogy, as an avid gardener myself!", "parent_id": null, "link_id": null, "context": null}
