{
  "id": "1095r1j",
  "subreddit": "AnorexiaNervosa",
  "author": "Oddiemarie",
  "created_utc": 1673446538.0,
  "title": "I’ve been eating more, and in a year I was able to hit a healthy weight. My clothes fit again. I feel better, no dark circles, complexion more even, and my hair is happy and not falling out. My eyelashes are so long and full. I never realized how much anorexia ravished every inch of my body.",
  "selftext": "",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1095r1j/ive_been_eating_more_and_in_a_year_i_was_able_to/",
  "score": 181,
  "num_comments": 10,
  "comments": [
    {
      "id": "j3w6i3m",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1673446538.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j3wkfzw",
      "author": "NZKhrushchev",
      "body": "Yep, there is not a single part of your body that your ED does not negatively impact. I am so happy you are doing so well, keep going! 😊",
      "created_utc": 1673452159.0,
      "score": 25,
      "context": []
    },
    {
      "id": "j3xdwtl",
      "author": "meladey",
      "body": "I've been taking a lot of selfies when I'm not looking my best, just lounging at home, to remind myself of just how bad and sick I look right now. I compare them to pictures from when I was recovered earlier this year. I cannot believe I thought I looked bad then. I looked so cute and pretty. I'm going to hang onto these so that every time I get the urge to relapse, I will remember that I was balding, had sunken eyes and cheeks, irritated and discolored skin, and couldn't be comfortable in any position. Healthy is pretty.",
      "created_utc": 1673462899.0,
      "score": 22,
      "context": []
    },
    {
      "id": "j3y4b89",
      "author": "None",
      "body": "This gave me more motivation than you can imagine. I've had a rough couple of days and have been thinking of relapsing. Fuck it, I'll try to keep on going for my hair and lashes (and my general well being ofc)!",
      "created_utc": 1673472647.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j3zhjjq",
      "author": "None",
      "body": "I want to get to that place… I have been in recovery for a year and I’m still bloating all the time it’s really painful",
      "created_utc": 1673492474.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j42kcbg",
      "author": "None",
      "body": "Happy for you. Keep it up!",
      "created_utc": 1673550408.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j42kf48",
      "author": "None",
      "body": "Do you mind sharing a little about what was helpful for your recovery?",
      "created_utc": 1673550436.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j42uh6p",
      "author": "hiimRo",
      "body": "Has your hair started growing back/how much? 😁",
      "created_utc": 1673554199.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j7r7ouq",
      "author": "AggravatingTop6521",
      "body": "Okay this is me. I have been in recovery for about 7 months now and bloated every day. I look 10 months pregnant and it’s painful. + I struggle with a swollen/puffy face. Hang in there! We can do this ♥️",
      "created_utc": 1675889929.0,
      "score": 3,
      "context": [
        {
          "id": "j3zhjjq",
          "author": "None",
          "body": "I want to get to that place… I have been in recovery for a year and I’m still bloating all the time it’s really painful",
          "created_utc": 1673492474.0
        }
      ]
    },
    {
      "id": "j7rfd00",
      "author": "None",
      "body": "Thank you darling, this journey isn’t for sissy’s lol",
      "created_utc": 1675892741.0,
      "score": 1,
      "context": [
        {
          "id": "j3zhjjq",
          "author": "None",
          "body": "I want to get to that place… I have been in recovery for a year and I’m still bloating all the time it’s really painful",
          "created_utc": 1673492474.0
        },
        {
          "id": "j7r7ouq",
          "author": "AggravatingTop6521",
          "body": "Okay this is me. I have been in recovery for about 7 months now and bloated every day. I look 10 months pregnant and it’s painful. + I struggle with a swollen/puffy face. Hang in there! We can do this ♥️",
          "created_utc": 1675889929.0
        }
      ]
    }
  ]
}