{
  "id": "10iqndi",
  "subreddit": "AnorexiaNervosa",
  "author": "sweetenermaz",
  "created_utc": 1674412667.0,
  "title": "Advice on anorexic houseguest?",
  "selftext": "Hi, I am looking for some advice here, I have a friend coming to stay for the weekend whom I love dearly. She struggles with anorexia, and just getting her to stay was a huge triumph in itself. I want to make the weekend as comfortable and enjoyable for her as possible. I know she wouldn’t want to go out to eat, so I will plan activities which don’t involve food, like a gallery, maybe going to a garden to see some flowers. But my main question is how do i adress the food issue? I need to offer to feed her of course as she is my guest, but I don’t want to make her uncomfortable or like she has to make excuses not to eat/ avoid certain foods. \n\nSo, do I offer to get some of her “safe foods” (I heard that is a thing)? Or is that going down the wrong path…\n\nWhen I notice her doing rituals (won’t mention specificities as not to trigger anyone), should I say anything? \n\nBasically what can I do to make the weekend as comfortable and safe for her as possible? \n\nThanks in advance!",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/10iqndi/advice_on_anorexic_houseguest/",
  "score": 139,
  "num_comments": 24,
  "comments": [
    {
      "id": "j5fu1ph",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1674412667.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j5fwu4y",
      "author": "underthesauceyuh",
      "body": "Very considerate question! I’ll share some things that have helped me personally, but obviously I’m aware not everyone is the same. \n\nNot too much physical activity (including walking) if no food is involved. If you’re walking a lot have opportunities for rest (sitting on a bench). \n\nEat as you normally do, don’t change your eating habits it’s good for ED sufferers to see intuitive eating. Bring granola bars out with you if you sense your friend is getting fatigued/dizzy but hopefully it doesn’t get to that point. \n\nWhen you eat meals, you don’t need to ask “do you want to eat?” just say “I’m hungry, let’s get some lunch.” You can also say “Im going to have a granola bar, I have plenty so if you want one let me know.” If they choose not to eat if you go out or cook, that’s their prerogative but don’t put it in question form as if it’s an option. \n\nAt the same time, you don’t really need to censor yourself. Don’t feel like you have to walk around on egg shells. You don’t need to bring up food outside of the context of meals/snacks but it’s okay if it comes up. Obviously no talk about weight/calories. If there’s any panic about “healthy/unhealthy” foods, no reassurance is necessary. It doesn’t really help the situation and I would dismiss that kind of talk and try to change the subject. Talking about anything other than food while eating is important. No need to comment on rituals. If you sense any anxiety try to keep a fun topic of conversation going. If it’s prolonged, check in. A simple  “you okay?” works but no need to push. \n\nWhen I visit friends, they’re pretty straight up with me and sometimes that’s necessary. For example I’ve been told “I don’t feel comfortable drinking with you tonight if you’re drinking on an empty stomach.” “I wanted to take you to this museum but it’s a lot of walking, I’d feel more comfortable if you had something to eat before we go.” Technically, still my choice to decide but in these situations I opted to eat. It may not be comfortable, but my friends feelings are valid. They want to enjoy activities without worrying about me, and I want them to enjoy activities without worrying about me. \n\nNot sure if this helps, I know it’s a lot but I hope it did a little!",
      "created_utc": 1674413719.0,
      "score": 140,
      "context": []
    },
    {
      "id": "j5fxt94",
      "author": "pathologicalprotest",
      "body": "Have snacks you know she eats, and then just what you normally have at home. It’s very kind of you to want to accomodate your friend! Like the other commenter says, eat normally as you would if she wasn’t visiting. For me at least, being around people with healthy relationships with food helps me eat better. I wouldn’t comment on her rituals. It can be triggering to be “confronted”. Also don’t praise her if she chooses to eat and don’t remark on her portion sizes etc. I hope you have a great time together!",
      "created_utc": 1674414091.0,
      "score": 37,
      "context": []
    },
    {
      "id": "j5h8bis",
      "author": "Almondmilkicedlatte_",
      "body": "Don’t make it seem optional. Plate them up some of everything you have and offer it to them. Imo if someone asks me “do you want some dinner?” my anorexia forces me to say no. But if it’s phrased “there’s dinner on the table for you” in a way that’s not forcing them to eat it, I’ll probably come and try it. If going out for lunch, say what you’re having and then ask them what they’d like. Sometimes it’s easier to pick once you don’t have to worry about the other person not eating first",
      "created_utc": 1674432112.0,
      "score": 19,
      "context": []
    },
    {
      "id": "j5glc34",
      "author": "InnocentaMN",
      "body": "Don’t eat less than you normally would, or otherwise try to accommodate yourself to anorexic habits. If anything it is more likely to be triggering for her if she feels a sense of being “in competition” with you because you skipped a meal (even if it’s actually fine for you to skip just one because you are not sick and will catch up!). Eat as you normally would. Offer her drinks and food regularly unless she explicitly asks you to stop doing so; a lot of anorexics would be hesitant to ask if you stopped offering, even if they had said no to previous offers and were perhaps considering taking offer number ten. \n\nDon’t comment on what she eats or doesn’t eat - don’t praise her. Don’t comment on her appearance in any way. Best of luck - you seem like a kind friend. I am mostly recovered now. There’s still hope. 💗\n\n(Side note: I hope this won’t ever apply to your friend, but if she develops any significantly worse symptoms like chest pain, you should encourage her to go to hospital. Obviously she is an adult and you can’t force her, but everyone around someone with an ED should be aware of the risks and potential for quick deterioration.)",
      "created_utc": 1674423082.0,
      "score": 14,
      "context": []
    },
    {
      "id": "j5i9i9b",
      "author": "puppyface21",
      "body": "All good advice, and I would add that I have a really hard time saying “I need a snack” or “let’s get dinner”. And even worse eating when the person I’m with isn’t. So I’d recommend just doing meals and snacks. it and your friend may or may not go along with it. But I think it’s really sweet that you care and want to make her as comfortable as you can. You’re an amazing friend!",
      "created_utc": 1674448479.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j5j40f0",
      "author": "mustardmitt_",
      "body": "Other people have already said it but I wanted to stress it - making sure food is available and convenient to pick at is very comforting for me. Like a bowl of grapes/ berries / nuts is a great one because I feel like it’s not “obvious” that I’m eating (it sounds so stupid I know but like others have said there’s a certain “privacy” we might appreciate around food that basically makes me think that if others see me eating they think poorly of me lolololol) so like I can have a handful of nutrient dense food when no one’s looking and it’s safe because I’ve not been “caught”. \nIf you’re making yourself dinner putting a portion out for them without asking is so great but I personally would also love to hear “hey I’m just going to put the rest in the fridge there’s so much of it; help yourself” so I know I can go back, say, in the middle of the night when everyone’s asleep 😅. \nIdk if that’s my personal brand of crazy or if it’s more universal but if my homies did this I’d feel so taken care of. \nGood luck!",
      "created_utc": 1674471019.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j5g55qa",
      "author": "gemmaparss",
      "body": "i’d phrase questions as “i’m going to have something, can i make you something aswell” or “what can i get you for breakfast/linch/dinner” rather than “do you want to eat”. if they politely decline then i’d just leave it. if it’s been a long period of time and you’re concerned they haven’t ate, maybe just mention “i don’t want to make a fuss, but you haven’t eaten yet today, and i know your body could do with some energy. can we get something to eat together, or can i get you something please”\n\ni hope you two have a lovely weekend and you’re a very considerate friend (:",
      "created_utc": 1674416979.0,
      "score": 12,
      "context": []
    },
    {
      "id": "j5he33u",
      "author": "Neurosporac",
      "body": "When I was sick, I was TERRIFIED of inconveniencing other people and them feeling like they couldn’t eat or talk normally. So just reiterating what others have said: I think it’s best for you to eat normally as possible and as you mentioned, providing food options. \n\nYou are incredibly considerate for thinking of this and being compassionate toward your friends struggles. She is lucky to have you, and the fact that you see who she is outside of the disorder is such a gift. 💜",
      "created_utc": 1674434500.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j5gq3n3",
      "author": "Sudden_Lie8782",
      "body": "You’re an awesome friend for understanding that friends can have a good time without food. You’re also wholesome for understanding and trying to make her comfortable instead of forcing her to eat like she will magically recover like my friends do :(",
      "created_utc": 1674424924.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j5gj5ob",
      "author": "ThinkItsHardIKnow",
      "body": "Have food that you know she likes readily available at all times, and eat, yourself, like you normally would. Offer her some if she'd like but don't make a big deal about it if she accepts or declines or takes a tiny portion and eats only a little. Basically, you do you (she will be uncomfortable if you don't, and you need to do what works for you) and let her be. If possible, let her serve herself at the table, and don't bring up what she's not eating when food is happening. Have appealing caloric liquids too, readily available, and offer, but make it no big deal if she just wants water. I don't know anyone who struggles with this that drinks alcohol, but many drink tea or enjoy something warm, you might ask if she wants something like that, or make a cup for yourself and offer her one (I'm English, and even when eating is hard, often tea is so ingrained into our culture, it will be wanted; but I know herbal teas are quite popular in other areas)",
      "created_utc": 1674422255.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j5kj5j7",
      "author": "TrashGorlUwU",
      "body": "Before she comes ask if there are any safe foods she'd like put in the house and if she wants to bring her own food \n\nIf she has food rituals **do not say anything** whatever you say can possibly be trigger say nothing and maybe leave the room if she look uncomfortable",
      "created_utc": 1674495713.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j5ghlm7",
      "author": "TrackConnect8709",
      "body": "Really good advice is already given. I would say maybe go the the grocery store with her so she can choose and get her own food. And maybe ask her if she has ideas for meals that she feels comfortable with.",
      "created_utc": 1674421703.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j5ryfhp",
      "author": "qcarnage123",
      "body": "i think this is the best question ive seen. you are a great friend. based on my situation i would just like to say maybe just let her be. privacy is privacy. i struggle with anorexia as well and the way my friends or family get me to eat is to just leave food i love out. eventually i will eat at least alittle when no one is looking. you can ask her to eat all you want but at least for me it makes me insecure that people notice. try to be under the radar if you know she likes a food get it. everytime my bf goes to the store he gets me cottage cheese because thats my safe food, if we are at the store together he will grab it and not say anything, if i pick something out he gets it, no questions because he knows if he questions my choices i will not eat and will put it back. understand it isnt your fault and please dont take her disorder on.",
      "created_utc": 1674617137.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j5jfk5o",
      "author": "everythingabove02",
      "body": "Not sure if mentioned, but normally it has helped me if I get to choose what to eat later/grocery shopping etc. He/she may eat less than normal just from being out of home, but hopefully if some safe foods are available, it may help. \nDon’t.ever.adress what he/she eats, and do not ask if you should eat, just sat you are hungry, “now I am eating!”\n\nAnd you are such a nice person, considering all this, and also to stay as friend, eventhough anorexia is such a harmfull disease in all ways.",
      "created_utc": 1674478942.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j5fxt3p",
      "author": "sweetenermaz",
      "body": "Thankyou yes that’s very helpful, thankyou for taking the time to write it all out. I will certainly keep that all in mind. I really hope you recover and beat this awful illness.",
      "created_utc": 1674414090.0,
      "score": 42,
      "context": [
        {
          "id": "j5fwu4y",
          "author": "underthesauceyuh",
          "body": "Very considerate question! I’ll share some things that have helped me personally, but obviously I’m aware not everyone is the same. \n\nNot too much physical activity (including walking) if no food is involved. If you’re walking a lot have opportunities for rest (sitting on a bench). \n\nEat as you normally do, don’t change your eating habits it’s good for ED sufferers to see intuitive eating. Bring granola bars out with you if you sense your friend is getting fatigued/dizzy but hopefully it doesn’t get to that point. \n\nWhen you eat meals, you don’t need to ask “do you want to eat?” just say “I’m hungry, let’s get some lunch.” You can also say “Im going to have a granola bar, I have plenty so if you want one let me know.” If they choose not to eat if you go out or cook, that’s their prerogative but don’t put it in question form as if it’s an option. \n\nAt the same time, you don’t really need to censor yourself. Don’t feel like you have to walk around on egg shells. You don’t need to bring up food outside of the context of meals/snacks but it’s okay if it comes up. Obviously no talk about weight/calories. If there’s any panic about “healthy/unhealthy” foods, no reassurance is necessary. It doesn’t really help the situation and I would dismiss that kind of talk and try to change the subject. Talking about anything other than food while eating is important. No need to comment on rituals. If you sense any anxiety try to keep a fun topic of conversation going. If it’s prolonged, check in. A simple  “you okay?” works but no need to push. \n\nWhen I visit friends, they’re pretty straight up with me and sometimes that’s necessary. For example I’ve been told “I don’t feel comfortable drinking with you tonight if you’re drinking on an empty stomach.” “I wanted to take you to this museum but it’s a lot of walking, I’d feel more comfortable if you had something to eat before we go.” Technically, still my choice to decide but in these situations I opted to eat. It may not be comfortable, but my friends feelings are valid. They want to enjoy activities without worrying about me, and I want them to enjoy activities without worrying about me. \n\nNot sure if this helps, I know it’s a lot but I hope it did a little!",
          "created_utc": 1674413719.0
        }
      ]
    },
    {
      "id": "j5g69cs",
      "author": "yaknali",
      "body": "One thing for me has been privacy, too. Everyone's different but when I visited a friend we agreed beforehand that I'd just get alone times to be able to eat because it stressed me way too much to eat, let alone in front of people.\nMaybe even subtly set up some small snacks and safe foods in the bedroom so she can sneak some alone if she needs it but is too stressed by company.",
      "created_utc": 1674417410.0,
      "score": 20,
      "context": [
        {
          "id": "j5fwu4y",
          "author": "underthesauceyuh",
          "body": "Very considerate question! I’ll share some things that have helped me personally, but obviously I’m aware not everyone is the same. \n\nNot too much physical activity (including walking) if no food is involved. If you’re walking a lot have opportunities for rest (sitting on a bench). \n\nEat as you normally do, don’t change your eating habits it’s good for ED sufferers to see intuitive eating. Bring granola bars out with you if you sense your friend is getting fatigued/dizzy but hopefully it doesn’t get to that point. \n\nWhen you eat meals, you don’t need to ask “do you want to eat?” just say “I’m hungry, let’s get some lunch.” You can also say “Im going to have a granola bar, I have plenty so if you want one let me know.” If they choose not to eat if you go out or cook, that’s their prerogative but don’t put it in question form as if it’s an option. \n\nAt the same time, you don’t really need to censor yourself. Don’t feel like you have to walk around on egg shells. You don’t need to bring up food outside of the context of meals/snacks but it’s okay if it comes up. Obviously no talk about weight/calories. If there’s any panic about “healthy/unhealthy” foods, no reassurance is necessary. It doesn’t really help the situation and I would dismiss that kind of talk and try to change the subject. Talking about anything other than food while eating is important. No need to comment on rituals. If you sense any anxiety try to keep a fun topic of conversation going. If it’s prolonged, check in. A simple  “you okay?” works but no need to push. \n\nWhen I visit friends, they’re pretty straight up with me and sometimes that’s necessary. For example I’ve been told “I don’t feel comfortable drinking with you tonight if you’re drinking on an empty stomach.” “I wanted to take you to this museum but it’s a lot of walking, I’d feel more comfortable if you had something to eat before we go.” Technically, still my choice to decide but in these situations I opted to eat. It may not be comfortable, but my friends feelings are valid. They want to enjoy activities without worrying about me, and I want them to enjoy activities without worrying about me. \n\nNot sure if this helps, I know it’s a lot but I hope it did a little!",
          "created_utc": 1674413719.0
        }
      ]
    },
    {
      "id": "j5gjytw",
      "author": "ThinkItsHardIKnow",
      "body": "I have had that too; friend asked for a favor on the next day, and I was like \"sure no problem\" and his request was that I eat a piece of toast bc it was a working day and he was uncomfortable asking me to go up down stairs without something. He said it was fine if it took an hour, and he'd be happy to make it and it up into little pieces for me and sit with me, but that it would really help the day go smoother. It was a little different bc it was a working day; but he didn't pressure the rest of the day, just made it clear he was happy to share his own food, and/or go and get me something if I wanted it. It was OK bc it felt tied to specific tasks we were collaborating on. I can see something similar being good with recreational activities.",
      "created_utc": 1674422557.0,
      "score": 4,
      "context": [
        {
          "id": "j5fwu4y",
          "author": "underthesauceyuh",
          "body": "Very considerate question! I’ll share some things that have helped me personally, but obviously I’m aware not everyone is the same. \n\nNot too much physical activity (including walking) if no food is involved. If you’re walking a lot have opportunities for rest (sitting on a bench). \n\nEat as you normally do, don’t change your eating habits it’s good for ED sufferers to see intuitive eating. Bring granola bars out with you if you sense your friend is getting fatigued/dizzy but hopefully it doesn’t get to that point. \n\nWhen you eat meals, you don’t need to ask “do you want to eat?” just say “I’m hungry, let’s get some lunch.” You can also say “Im going to have a granola bar, I have plenty so if you want one let me know.” If they choose not to eat if you go out or cook, that’s their prerogative but don’t put it in question form as if it’s an option. \n\nAt the same time, you don’t really need to censor yourself. Don’t feel like you have to walk around on egg shells. You don’t need to bring up food outside of the context of meals/snacks but it’s okay if it comes up. Obviously no talk about weight/calories. If there’s any panic about “healthy/unhealthy” foods, no reassurance is necessary. It doesn’t really help the situation and I would dismiss that kind of talk and try to change the subject. Talking about anything other than food while eating is important. No need to comment on rituals. If you sense any anxiety try to keep a fun topic of conversation going. If it’s prolonged, check in. A simple  “you okay?” works but no need to push. \n\nWhen I visit friends, they’re pretty straight up with me and sometimes that’s necessary. For example I’ve been told “I don’t feel comfortable drinking with you tonight if you’re drinking on an empty stomach.” “I wanted to take you to this museum but it’s a lot of walking, I’d feel more comfortable if you had something to eat before we go.” Technically, still my choice to decide but in these situations I opted to eat. It may not be comfortable, but my friends feelings are valid. They want to enjoy activities without worrying about me, and I want them to enjoy activities without worrying about me. \n\nNot sure if this helps, I know it’s a lot but I hope it did a little!",
          "created_utc": 1674413719.0
        }
      ]
    },
    {
      "id": "j5fy7aw",
      "author": "sweetenermaz",
      "body": "Ok thankyou that’s also very helpful advice, thankyou for taking the time to reply. I really hope you recover, this awful illness hits such wonderful people who don’t deserve it",
      "created_utc": 1674414241.0,
      "score": 12,
      "context": [
        {
          "id": "j5fxt94",
          "author": "pathologicalprotest",
          "body": "Have snacks you know she eats, and then just what you normally have at home. It’s very kind of you to want to accomodate your friend! Like the other commenter says, eat normally as you would if she wasn’t visiting. For me at least, being around people with healthy relationships with food helps me eat better. I wouldn’t comment on her rituals. It can be triggering to be “confronted”. Also don’t praise her if she chooses to eat and don’t remark on her portion sizes etc. I hope you have a great time together!",
          "created_utc": 1674414091.0
        }
      ]
    },
    {
      "id": "j5iu8fx",
      "author": "Lostfoxpleasecall",
      "body": "This is very good advice to not ask questions that the ED can/will answer with “no”—just plate some food for her, if others are there, plate food for them as well so it doesn’t stand out as different. And don’t talk about portion size or calories or whether or not they are eating, that can be really triggering. It can be useful to watch a movie or tv while eating b/c it lowers the focus on food and helps the ED stay quieter.",
      "created_utc": 1674462661.0,
      "score": 8,
      "context": [
        {
          "id": "j5h8bis",
          "author": "Almondmilkicedlatte_",
          "body": "Don’t make it seem optional. Plate them up some of everything you have and offer it to them. Imo if someone asks me “do you want some dinner?” my anorexia forces me to say no. But if it’s phrased “there’s dinner on the table for you” in a way that’s not forcing them to eat it, I’ll probably come and try it. If going out for lunch, say what you’re having and then ask them what they’d like. Sometimes it’s easier to pick once you don’t have to worry about the other person not eating first",
          "created_utc": 1674432112.0
        }
      ]
    },
    {
      "id": "j5glmt9",
      "author": "InnocentaMN",
      "body": "I know some anorexics who definitely like their alcohol! Haha. But totally agree, the tea and coffee are legendary for a reason 😆",
      "created_utc": 1674423196.0,
      "score": 2,
      "context": [
        {
          "id": "j5gj5ob",
          "author": "ThinkItsHardIKnow",
          "body": "Have food that you know she likes readily available at all times, and eat, yourself, like you normally would. Offer her some if she'd like but don't make a big deal about it if she accepts or declines or takes a tiny portion and eats only a little. Basically, you do you (she will be uncomfortable if you don't, and you need to do what works for you) and let her be. If possible, let her serve herself at the table, and don't bring up what she's not eating when food is happening. Have appealing caloric liquids too, readily available, and offer, but make it no big deal if she just wants water. I don't know anyone who struggles with this that drinks alcohol, but many drink tea or enjoy something warm, you might ask if she wants something like that, or make a cup for yourself and offer her one (I'm English, and even when eating is hard, often tea is so ingrained into our culture, it will be wanted; but I know herbal teas are quite popular in other areas)",
          "created_utc": 1674422255.0
        }
      ]
    },
    {
      "id": "j5fzc3x",
      "author": "underthesauceyuh",
      "body": "Glad it helped:) & thank you! I am actually doing pretty well these days. I appreciate it.",
      "created_utc": 1674414679.0,
      "score": 12,
      "context": [
        {
          "id": "j5fwu4y",
          "author": "underthesauceyuh",
          "body": "Very considerate question! I’ll share some things that have helped me personally, but obviously I’m aware not everyone is the same. \n\nNot too much physical activity (including walking) if no food is involved. If you’re walking a lot have opportunities for rest (sitting on a bench). \n\nEat as you normally do, don’t change your eating habits it’s good for ED sufferers to see intuitive eating. Bring granola bars out with you if you sense your friend is getting fatigued/dizzy but hopefully it doesn’t get to that point. \n\nWhen you eat meals, you don’t need to ask “do you want to eat?” just say “I’m hungry, let’s get some lunch.” You can also say “Im going to have a granola bar, I have plenty so if you want one let me know.” If they choose not to eat if you go out or cook, that’s their prerogative but don’t put it in question form as if it’s an option. \n\nAt the same time, you don’t really need to censor yourself. Don’t feel like you have to walk around on egg shells. You don’t need to bring up food outside of the context of meals/snacks but it’s okay if it comes up. Obviously no talk about weight/calories. If there’s any panic about “healthy/unhealthy” foods, no reassurance is necessary. It doesn’t really help the situation and I would dismiss that kind of talk and try to change the subject. Talking about anything other than food while eating is important. No need to comment on rituals. If you sense any anxiety try to keep a fun topic of conversation going. If it’s prolonged, check in. A simple  “you okay?” works but no need to push. \n\nWhen I visit friends, they’re pretty straight up with me and sometimes that’s necessary. For example I’ve been told “I don’t feel comfortable drinking with you tonight if you’re drinking on an empty stomach.” “I wanted to take you to this museum but it’s a lot of walking, I’d feel more comfortable if you had something to eat before we go.” Technically, still my choice to decide but in these situations I opted to eat. It may not be comfortable, but my friends feelings are valid. They want to enjoy activities without worrying about me, and I want them to enjoy activities without worrying about me. \n\nNot sure if this helps, I know it’s a lot but I hope it did a little!",
          "created_utc": 1674413719.0
        },
        {
          "id": "j5fxt3p",
          "author": "sweetenermaz",
          "body": "Thankyou yes that’s very helpful, thankyou for taking the time to write it all out. I will certainly keep that all in mind. I really hope you recover and beat this awful illness.",
          "created_utc": 1674414090.0
        }
      ]
    },
    {
      "id": "j5h5xrb",
      "author": "iamg0rl",
      "body": "Leaving snacks in the room theyre staying in is honestly such good advice. Eating in front of people can be hard",
      "created_utc": 1674431125.0,
      "score": 16,
      "context": [
        {
          "id": "j5fwu4y",
          "author": "underthesauceyuh",
          "body": "Very considerate question! I’ll share some things that have helped me personally, but obviously I’m aware not everyone is the same. \n\nNot too much physical activity (including walking) if no food is involved. If you’re walking a lot have opportunities for rest (sitting on a bench). \n\nEat as you normally do, don’t change your eating habits it’s good for ED sufferers to see intuitive eating. Bring granola bars out with you if you sense your friend is getting fatigued/dizzy but hopefully it doesn’t get to that point. \n\nWhen you eat meals, you don’t need to ask “do you want to eat?” just say “I’m hungry, let’s get some lunch.” You can also say “Im going to have a granola bar, I have plenty so if you want one let me know.” If they choose not to eat if you go out or cook, that’s their prerogative but don’t put it in question form as if it’s an option. \n\nAt the same time, you don’t really need to censor yourself. Don’t feel like you have to walk around on egg shells. You don’t need to bring up food outside of the context of meals/snacks but it’s okay if it comes up. Obviously no talk about weight/calories. If there’s any panic about “healthy/unhealthy” foods, no reassurance is necessary. It doesn’t really help the situation and I would dismiss that kind of talk and try to change the subject. Talking about anything other than food while eating is important. No need to comment on rituals. If you sense any anxiety try to keep a fun topic of conversation going. If it’s prolonged, check in. A simple  “you okay?” works but no need to push. \n\nWhen I visit friends, they’re pretty straight up with me and sometimes that’s necessary. For example I’ve been told “I don’t feel comfortable drinking with you tonight if you’re drinking on an empty stomach.” “I wanted to take you to this museum but it’s a lot of walking, I’d feel more comfortable if you had something to eat before we go.” Technically, still my choice to decide but in these situations I opted to eat. It may not be comfortable, but my friends feelings are valid. They want to enjoy activities without worrying about me, and I want them to enjoy activities without worrying about me. \n\nNot sure if this helps, I know it’s a lot but I hope it did a little!",
          "created_utc": 1674413719.0
        },
        {
          "id": "j5g69cs",
          "author": "yaknali",
          "body": "One thing for me has been privacy, too. Everyone's different but when I visited a friend we agreed beforehand that I'd just get alone times to be able to eat because it stressed me way too much to eat, let alone in front of people.\nMaybe even subtly set up some small snacks and safe foods in the bedroom so she can sneak some alone if she needs it but is too stressed by company.",
          "created_utc": 1674417410.0
        }
      ]
    },
    {
      "id": "j5fyk5p",
      "author": "pathologicalprotest",
      "body": "That’s very sweet of you! It’s a nasty illness, but I still have a good life, much due to my wonderful friends. You seem like a great friend and person.",
      "created_utc": 1674414378.0,
      "score": 4,
      "context": [
        {
          "id": "j5fxt94",
          "author": "pathologicalprotest",
          "body": "Have snacks you know she eats, and then just what you normally have at home. It’s very kind of you to want to accomodate your friend! Like the other commenter says, eat normally as you would if she wasn’t visiting. For me at least, being around people with healthy relationships with food helps me eat better. I wouldn’t comment on her rituals. It can be triggering to be “confronted”. Also don’t praise her if she chooses to eat and don’t remark on her portion sizes etc. I hope you have a great time together!",
          "created_utc": 1674414091.0
        },
        {
          "id": "j5fy7aw",
          "author": "sweetenermaz",
          "body": "Ok thankyou that’s also very helpful advice, thankyou for taking the time to reply. I really hope you recover, this awful illness hits such wonderful people who don’t deserve it",
          "created_utc": 1674414241.0
        }
      ]
    }
  ]
}