{
  "id": "11d0466",
  "subreddit": "AnorexiaNervosa",
  "author": "Traditional_Sun2355",
  "created_utc": 1677464415.0,
  "title": "I chose to have anorexia",
  "selftext": "At first I started counting calories everyday and when I wasn’t seeing a lot of results I made the decision to skip breakfast altogether eating only two meals a day and each meal halved. I finally started loving my body until everyone around me started noticing and telling me how thin I am. Everyday I stare at my body and see my rib cage, which scares me but also somehow feels like an achievement. I thought that I could always stop when I wanted to but I can’t. I’m not sure I can.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/11d0466/i_chose_to_have_anorexia/",
  "score": 137,
  "num_comments": 24,
  "comments": [
    {
      "id": "ja5zf0q",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1677464415.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ja7rj3f",
      "author": "Sirocla",
      "body": "You can’t choose to be anorexic, it just happens. What you can try and choose is recovery but even that takes time. There’s nothing to beat yourself up over. Accepting that you have it is just the first part of understanding yourself. You’ll be okay.",
      "created_utc": 1677506559.0,
      "score": 45,
      "context": []
    },
    {
      "id": "ja6h9hk",
      "author": "NotoriousBPD",
      "body": "You don’t choose to get it, it happens. It slides in the back of your head and seduces you. Next think you know, you have it.",
      "created_utc": 1677473623.0,
      "score": 85,
      "context": []
    },
    {
      "id": "ja6r3kn",
      "author": "yaknali",
      "body": "you already have anorexia when you \"choose to have it\". I get the feeling of choosing it but you wouldn't make that choice unless you already have anorexia",
      "created_utc": 1677480014.0,
      "score": 43,
      "context": []
    },
    {
      "id": "ja60gh7",
      "author": "b1u3brdm",
      "body": "No, you were getting sick, it’s not a choice",
      "created_utc": 1677464914.0,
      "score": 54,
      "context": []
    },
    {
      "id": "ja6bvdh",
      "author": "disposable_valves",
      "body": "Babes. No, you didn't. You chose to diet. And like everyone else, it got away from you. This isn't your fault.",
      "created_utc": 1677470617.0,
      "score": 29,
      "context": []
    },
    {
      "id": "ja71rl8",
      "author": "Character-Pipe-9805",
      "body": "omg this is so relatable where my anorexia started. W post",
      "created_utc": 1677488688.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ja9740e",
      "author": "Committee-Academic",
      "body": "You didn't choose to have anorexia, you succumbed to it. It's a mental illness, and it's most certainly not your fault.",
      "created_utc": 1677527082.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ja68mdb",
      "author": "None",
      "body": "📣Anorexia is not a choice!📣",
      "created_utc": 1677468940.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ja6xucg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1677485318.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ja6le9l",
      "author": "Yo3xX",
      "body": "I know it feels like a choice. I felt like it was a choice for me too. I got hated by my mother for that. But even tho it feels like a choice, anorexia and any other mental health disorder is not a choice. Your eating disorder is not a choice no matter what",
      "created_utc": 1677476162.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ja7jq31",
      "author": "strangemaryland",
      "body": "bro mental illnesses are not a choice lmfao if they were recovery would be the easiest thing ever 🤡",
      "created_utc": 1677502452.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ja8m52p",
      "author": "syntheticseasalt",
      "body": "The thing is, a “normal” (not sick) person would never have been able to choose to restrict so much. Anorexia is a mental illness, and it infiltrates your thoughts. And the fact that you feel that you can’t stop means it is not your choice.",
      "created_utc": 1677519157.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ja714gf",
      "author": "carnivorous_unicorns",
      "body": "No, you didn't. You may think it was a choice, but a healthy person with no predisposition for mental illnesses wouldn't be able to ' become ill by choice' like that. Something had to be wrong before even if you didn't noticed it. Its NOT your fault its the disease trying to tell you that!",
      "created_utc": 1677488117.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ja71x52",
      "author": "catlover0306",
      "body": "developing a disorder cannot be a “choice”",
      "created_utc": 1677488824.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ja9azcq",
      "author": "None",
      "body": "This Fr, started out counting calories but then realized I could “make progress” faster by just reducing and reducing over and over and now I’m only a little away from my original gw but the goal posts have shifted the closer I get",
      "created_utc": 1677528550.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ja9iw06",
      "author": "brookleiaway",
      "body": "same bro",
      "created_utc": 1677531508.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ja7c50w",
      "author": "kasialis721",
      "body": "i feel the same way. i chose to see starved bodies as beautiful and i chose to look at them every day for motivation.",
      "created_utc": 1677497453.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ja89t82",
      "author": "haleyannoymous",
      "body": "you might think that you chose it. but to have those thoughts, is being sick. you never chose it. i struggle with thinking i chose my ed too. if you ever need anything, feel free to reach out. otherwise take the steps into recovery. its so much better. try before it continues to worsen. sending love. 🤍",
      "created_utc": 1677514362.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jad0jib",
      "author": "Extreme-Substance-25",
      "body": "You're not alone, every time I relapse I feel like a choose it too, that I'm making the choice consciously like \"okay now I'm gonna force myself to be anorexic again\", I feel like somehow I enjoy it, when my family tells me how thin I am I feel validated, I feel happy, like I could stop at anytime and I'm just pretending to be anorexic, I count every single calorie on my fitness pal, I do my \"quiet\" workout before bed, I lie and feel like a manipulative scum, I \"eat\" in my room and throw away the food, that's not a choice, that's something genuinely wrong and sick, we don't choose it.",
      "created_utc": 1677598837.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jkr08e2",
      "author": "Lonely-Tangerine9451",
      "body": "Lol having anorexia is better than being disrespected by someone because you are fat",
      "created_utc": 1684487658.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ja6l5dl",
      "author": "No_Individual501",
      "body": "It’s like the dark side of the force.",
      "created_utc": 1677476004.0,
      "score": 22,
      "context": [
        {
          "id": "ja6h9hk",
          "author": "NotoriousBPD",
          "body": "You don’t choose to get it, it happens. It slides in the back of your head and seduces you. Next think you know, you have it.",
          "created_utc": 1677473623.0
        }
      ]
    },
    {
      "id": "jacum5v",
      "author": "yennefah",
      "body": "I know it probably sounds like bs (it certainly did for me at first), but I promise you didn't choose this. I spent so many years of my life believing that I chose anorexia, and when I was in res I literally told my therapist that I felt like I was \"pretending\" to have anorexia and it got away from me. In reality, it's just something in my brain that couldn't just diet or \"eat healthy\" like people without anorexia. Plenty of people make the conscious decision to count calories. Most people never feel the urge to eat as little as possible. That's just what makes us different, I guess.",
      "created_utc": 1677596433.0,
      "score": 2,
      "context": [
        {
          "id": "ja6xucg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1677485318.0
        }
      ]
    },
    {
      "id": "ja71qnp",
      "author": "Character-Pipe-9805",
      "body": "LMFAO",
      "created_utc": 1677488665.0,
      "score": 6,
      "context": [
        {
          "id": "ja6h9hk",
          "author": "NotoriousBPD",
          "body": "You don’t choose to get it, it happens. It slides in the back of your head and seduces you. Next think you know, you have it.",
          "created_utc": 1677473623.0
        },
        {
          "id": "ja6l5dl",
          "author": "No_Individual501",
          "body": "It’s like the dark side of the force.",
          "created_utc": 1677476004.0
        }
      ]
    }
  ]
}