{
  "id": "11lnkqy",
  "subreddit": "AnorexiaNervosa",
  "author": "Shameful-throwaway23",
  "created_utc": 1678253664.0,
  "title": "My eating disorder feels more like an addiction rather than an illness",
  "selftext": "So basically that, I have other disorders and mental illnesses so I how how they feel, and I've dealt with substance abuse so I know both feelings and my eating disorder Is more an addiction than an illness.\n\nI'm constantly thinking about it, it's the only thing in my head, I'm completely obsessed, my life and everything I do revolves around food and my ED, feeling the hunger pain in my stomach gives me a high and so much serotonin that I crave when I eat and I stop that hunger,, every time I eat I just get anxious and want that pain like it's a fix.\n\nSo with all that, the anorexia doesn't feel like other mental illnesses I have (BPD, CPTSD, bipolar etc) I live it like it's a straight up addiction, I crave, I have what I feel when I had withdrawals, I constantly lie and cheat and manipulate, it sounds so stupid but I'm an addict when it comes to anorexia.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/11lnkqy/my_eating_disorder_feels_more_like_an_addiction/",
  "score": 144,
  "num_comments": 10,
  "comments": [
    {
      "id": "jbdbodc",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1678253664.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jbdchut",
      "author": "pathologicalprotest",
      "body": "Addiction IS an illness. \n\nMy shrink works with people with ptsd and c-ptsd. She has a lot of experience with folks with addiction. Though it’s not a complete overlap in my case, we treat the anorexia behaviours like addiction. It gives me actionable steps to do harm reduction and give me some control back and steer me over to less harmful coping skills.\n\nI’m sorry you’re having a rough time. What you’re dealing with sounds like a handful.",
      "created_utc": 1678254187.0,
      "score": 31,
      "context": []
    },
    {
      "id": "jbdhxc3",
      "author": "BotGivesBot",
      "body": "Same. I treat it like an addiction as well and that’s what got me into remission. \n\nI avoid triggers. I don’t keep a scale in the house. I don’t let doctors weight me. I don’t read calorie content on packages, etc. I treat it like a full blown addiction and don’t let it in at all. \n\nIf I did it would be like me slamming back shots of alcohol and saying ‘yeah, nbd, I may have an alcohol use disorder but this is totally fine’ (it’s not fine btw, slamming back shots would relapse me into drinking too lol).",
      "created_utc": 1678257938.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jbdkdyz",
      "author": "None",
      "body": "Same. I started this trying to get skinny but now it’s so much more than that. The feeling of power I get from being hungry, I will never give that up.",
      "created_utc": 1678259800.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jbdcbwg",
      "author": "CatsAndSloths_13",
      "body": "I feel this way too. So much.",
      "created_utc": 1678254077.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jbgz3ux",
      "author": "Pakoma7",
      "body": "In German anorexia is called Magersucht so „skinny addiction“. Quite literally but in the other hand not. It’s an addiction but not about the being skinny part, about the numbers and the control.",
      "created_utc": 1678318792.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jbfrvrw",
      "author": "None",
      "body": "I’m an addict and an anorexic, the two go hand in hand",
      "created_utc": 1678302028.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jbivi51",
      "author": "nadjauwu",
      "body": "Addictions are illnesses and eating disorders are addictions. \nIn german the word for anorexia liteally is \"starving-addiction\"",
      "created_utc": 1678359229.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jbet7ap",
      "author": "BedroomImpossible124",
      "body": "How did you start to eat more? This is where I’m stuck. I’m addicted too🙁. Thank you?",
      "created_utc": 1678288744.0,
      "score": 3,
      "context": [
        {
          "id": "jbdhxc3",
          "author": "BotGivesBot",
          "body": "Same. I treat it like an addiction as well and that’s what got me into remission. \n\nI avoid triggers. I don’t keep a scale in the house. I don’t let doctors weight me. I don’t read calorie content on packages, etc. I treat it like a full blown addiction and don’t let it in at all. \n\nIf I did it would be like me slamming back shots of alcohol and saying ‘yeah, nbd, I may have an alcohol use disorder but this is totally fine’ (it’s not fine btw, slamming back shots would relapse me into drinking too lol).",
          "created_utc": 1678257938.0
        }
      ]
    },
    {
      "id": "jbf8g9b",
      "author": "Extreme-Substance-25",
      "body": "For me it stopped being about getting skinnier for a while now, it's an obsession that controls my whole life and the only thing I think about, the hunger pain is a feeling that no other drug I've taken can compare.\nAnd the validation, that feels as good as the hunger, having people telling me I lost weight, and having people telling me how good my ribs collarbones etc look, I'm going straight to hell for this",
      "created_utc": 1678294664.0,
      "score": 6,
      "context": [
        {
          "id": "jbdkdyz",
          "author": "None",
          "body": "Same. I started this trying to get skinny but now it’s so much more than that. The feeling of power I get from being hungry, I will never give that up.",
          "created_utc": 1678259800.0
        }
      ]
    }
  ]
}