{
  "id": "11ngtva",
  "subreddit": "AnorexiaNervosa",
  "author": "TRKevinSpacey",
  "created_utc": 1678428915.0,
  "title": "Don’t get fat on us",
  "selftext": "I work with people. People see me everyday. I tend to be a very chilled out kind person at work. I completely get that some people don’t know what’s going on so I don’t blame them one bit if they say something off kilter. But some comments have no place. I was working at my standing desk and a patient came up to me and says “you’re gaining weight, don’t go and get fat on us now” I was so shocked I didn’t know what to say other than “I’ll try” I just went into the bathroom cried for a bit and just continued my day. Later a fucking co worker comes up to me and says “I’ve noticed you’ve been gaining weight, it looks good” I want to fucking cut myself jfc. Do people not understand there is no place to talk on other peoples weight. I feel fucking disgusting. Yes I gained weight I went from severely underweight to a low but healthy weight for someone my size and men specifically feel the need to comment. Like stop looking at my fucking body and pondering it’s size go fucking look at porn if you want to look at womens body’s like holy fucking shit why are people so fucking dense. Fuck humanity.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/11ngtva/dont_get_fat_on_us/",
  "score": 192,
  "num_comments": 18,
  "comments": [
    {
      "id": "jbn6hj5",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1678428915.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jbofgyv",
      "author": "peshnoodles",
      "body": "# NO ONE appreciates comments on their body when they weren’t asked for. \n\nHow do I put this on a billboard",
      "created_utc": 1678459128.0,
      "score": 57,
      "context": []
    },
    {
      "id": "jbpr3il",
      "author": "Damaya-Syenite-Essun",
      "body": "People suck, I’m sorry. Resting bitch face helps, but still people are dumb. I decided to turn it, but not everyone will feel comfortable with this. In the workplace if someone comments I say something like “yeah, I’ve really been struggling with a health issue. It has been really stressful.” Then the important part is to dead stare them in the face, and pause for reply. There is no reply. Pretty sure since I’ve given no context people probably think I’m dying but still the pure discomfort is internally satisfying. And my hope is next person they will think of that interaction before speaking.",
      "created_utc": 1678477712.0,
      "score": 17,
      "context": []
    },
    {
      "id": "jbna9pm",
      "author": "Excellent-World-476",
      "body": "Ugh!!  I’m so sorry this happened. I want to remind you though off what a strong person you are. You are accomplishing such a difficult thing and moving toward a life of health and hopefully more freedom from the clutches of an all consuming ED bent on destroying you. Hang in there.",
      "created_utc": 1678431593.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jbsip3p",
      "author": "Individual-Panda-184",
      "body": "The only compliments I will take about my body: \n- damn your arms look so strong \n- damn your ass looks so nice",
      "created_utc": 1678532054.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jbnbe4l",
      "author": "gaping8utthole",
      "body": "God some people have no filter. I’m so sorry, just know that comments like that say a lot more about the person than about you",
      "created_utc": 1678432407.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jbniyba",
      "author": "archangelaine",
      "body": "I’m so sorry this happened. I’m in the same boat right now, and created a similar post- these comments are seriously nightmare fuel. I’m still technically quite small, but in comparison it’s a big difference, and of COURSE the unsolicited “you look so HEALTHY now” is ringing EVERYWHERE.",
      "created_utc": 1678438374.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jbrwgd3",
      "author": "Lemon_m1lk",
      "body": "It intrigues me that people without EDs can talk about weight and think nothing of it. Even when the person being discussed isn’t me, these comments always make my stomach churn because the topic of weight has become something that I am so sensitive about.",
      "created_utc": 1678514023.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jbo24lh",
      "author": "GulfCoastFlamingo",
      "body": "Seconding what everyone has said. Keep up all your hard work!\n\n“My body is not an appropriate topic to discuss” but we can talk about… (literally anything. Keep it light: a funny thing that happened at work, bring up a local event coming up, the weather, etc)",
      "created_utc": 1678452780.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jbnz5tb",
      "author": "greenthumbsup1",
      "body": "I have never understood what makes people say stuff like that. No common sense. Those people suck.",
      "created_utc": 1678451043.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jbqkfno",
      "author": "strawberryfritter",
      "body": "Unless you are my girlie friend, I do not want to hear anything about you perceiving me.",
      "created_utc": 1678489552.0,
      "score": 0,
      "context": []
    },
    {
      "id": "jbu7r9c",
      "author": "Kristycat",
      "body": "I’m so sorry that happened. People don’t think before they speak. I doubt they meant to hurt you, even though they did. Maybe take this opportunity to think of what you want to say the next time someone says something like this again to show them you disapprove of their comment. Or like someone said above, saying something like, I’m dealing with a health issue that is unresolved or something like that then just stare at them to embarrass them. Fight back instead of hide. My first instinct is always hide and feel isolated/sad/overwhelmed, so I understand you completely. ❤️❤️❤️❤️",
      "created_utc": 1678562433.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jbrmsap",
      "author": "Character-Pipe-9805",
      "body": "#I AM RESPONDING TO THIS COMMENT. I HAVE NOTHING TO ADD I JUST WANT TO USE THE BIG TEXT TOO.",
      "created_utc": 1678508129.0,
      "score": 10,
      "context": [
        {
          "id": "jbofgyv",
          "author": "peshnoodles",
          "body": "# NO ONE appreciates comments on their body when they weren’t asked for. \n\nHow do I put this on a billboard",
          "created_utc": 1678459128.0
        }
      ]
    },
    {
      "id": "jbps6gf",
      "author": "Damaya-Syenite-Essun",
      "body": "Honestly even if they do ask you should seriously consider if you respond lol. Comments on bodies deserve serious thought and reflection. I still remember some random stranger telling me I had bird legs when I was a little kid and I’m 40. I thought he was saying they were fat like drumsticks but he prob wasn’t. 😂",
      "created_utc": 1678478138.0,
      "score": 6,
      "context": [
        {
          "id": "jbofgyv",
          "author": "peshnoodles",
          "body": "# NO ONE appreciates comments on their body when they weren’t asked for. \n\nHow do I put this on a billboard",
          "created_utc": 1678459128.0
        }
      ]
    },
    {
      "id": "jbpu7cn",
      "author": "SieBanhus",
      "body": "This is a great response - it’s both honest and very clearly a call out of inappropriate questions/comments.",
      "created_utc": 1678478934.0,
      "score": 3,
      "context": [
        {
          "id": "jbpr3il",
          "author": "Damaya-Syenite-Essun",
          "body": "People suck, I’m sorry. Resting bitch face helps, but still people are dumb. I decided to turn it, but not everyone will feel comfortable with this. In the workplace if someone comments I say something like “yeah, I’ve really been struggling with a health issue. It has been really stressful.” Then the important part is to dead stare them in the face, and pause for reply. There is no reply. Pretty sure since I’ve given no context people probably think I’m dying but still the pure discomfort is internally satisfying. And my hope is next person they will think of that interaction before speaking.",
          "created_utc": 1678477712.0
        }
      ]
    },
    {
      "id": "jckd9se",
      "author": "Eastern_Yam_5975",
      "body": "Yeah and people not understanding that sometimes when you call me “healthy” it makes me wanna go cry in the bathroom",
      "created_utc": 1679061134.0,
      "score": 2,
      "context": [
        {
          "id": "jbniyba",
          "author": "archangelaine",
          "body": "I’m so sorry this happened. I’m in the same boat right now, and created a similar post- these comments are seriously nightmare fuel. I’m still technically quite small, but in comparison it’s a big difference, and of COURSE the unsolicited “you look so HEALTHY now” is ringing EVERYWHERE.",
          "created_utc": 1678438374.0
        }
      ]
    },
    {
      "id": "jclw9i4",
      "author": "archangelaine",
      "body": "There’s a student I work with who brings up “I’m only 78 pounds” before saying ANYTHING. And granted I work with middle school age kids so that’s normal for a smaller framed kid, but it should NOT be as triggering to me as it is. I feel this.",
      "created_utc": 1679082678.0,
      "score": 3,
      "context": [
        {
          "id": "jbrwgd3",
          "author": "Lemon_m1lk",
          "body": "It intrigues me that people without EDs can talk about weight and think nothing of it. Even when the person being discussed isn’t me, these comments always make my stomach churn because the topic of weight has become something that I am so sensitive about.",
          "created_utc": 1678514023.0
        }
      ]
    },
    {
      "id": "jbqx25c",
      "author": "Canjo_667",
      "body": "Awwwh! Isn’t it really something how those comments from the past stick with us? I’m sure your legs are just perfect exactly the way they are. Hugs.",
      "created_utc": 1678495227.0,
      "score": 3,
      "context": [
        {
          "id": "jbofgyv",
          "author": "peshnoodles",
          "body": "# NO ONE appreciates comments on their body when they weren’t asked for. \n\nHow do I put this on a billboard",
          "created_utc": 1678459128.0
        },
        {
          "id": "jbps6gf",
          "author": "Damaya-Syenite-Essun",
          "body": "Honestly even if they do ask you should seriously consider if you respond lol. Comments on bodies deserve serious thought and reflection. I still remember some random stranger telling me I had bird legs when I was a little kid and I’m 40. I thought he was saying they were fat like drumsticks but he prob wasn’t. 😂",
          "created_utc": 1678478138.0
        }
      ]
    }
  ]
}