{
  "id": "12coniv",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1680709845.0,
  "title": "I miss my eating disorder.",
  "selftext": "Thats it, just that. I miss my anorexia. \nI cried over pasta? Yes I did. \nI saw myself fat when I was too thin? Yes, but ai was thin. \nMy social life was miserable? Yes and still is, now I have no one, before I wouldn’t go out because my friends wanted to go to an ice cream store. \nBasically all I had was my sickness, and now I have nothing and am a fat pig.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/12coniv/i_miss_my_eating_disorder/",
  "score": 276,
  "num_comments": 43,
  "comments": [
    {
      "id": "jf2c9tx",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1680709845.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jf2ozzu",
      "author": "boopydoopy2102",
      "body": "i understand.  i feel the same.  ive been physically recovered for a good few months, its only a matter of time before im underweight again cos thats the hellish cycle im trapped in.  i get uw, decide i want to recover and gain, and then can't handle it anymore so go back down.  its pathetic and you'd think id learn, but i don't. \n\ni don't wanna give ana up, that voice in my head is comforting and its presence is always felt.  im used to it and if i lose it then i have nothing left.  being anorexic is the most interesting thing about me despite most people in my life not knowing about it.  it gives me purpose.\n\ni understand your pain, im sorry you're going through this.  you aren't alone, even though it feels like you are.  sending hugs <3",
      "created_utc": 1680714705.0,
      "score": 61,
      "context": []
    },
    {
      "id": "jf3jnlx",
      "author": "None",
      "body": "the truth is that you don't miss the disorder itself, you miss the feeling of control, the \"voice\" was your \"friend\". you felt like you were on a secret mission. to a degree, restriction is fun because you start feeling like you're better than everyone else because you're able to \"control\" yourself around food. even if it means binging when no one is watching, or crying yourself to sleep because of how hungry and exhausted you are. but the honest truth is that that voice only wants to kill you and hurt you as much as it can. you're not a pig, you're a normal human being that requires fuel to keep going. choose the good fight.",
      "created_utc": 1680726182.0,
      "score": 44,
      "context": []
    },
    {
      "id": "jf33h17",
      "author": "None",
      "body": "You're still sick. You're just making better choices. Keep going to therapy and taking medication if it was prescribed. You've got this! I'll say a prayer for you.",
      "created_utc": 1680720132.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jf2x5l2",
      "author": "Cylinelee",
      "body": "I feel you 100% i dealt with anorexia for about 2 years and I’ve gained weight for the first time since then. I try on the daily to convince myself that gaining weight is a good thing in my case, but i still count my food and its hard to accept the fact that i gained weight even though it isn’t exactly noticeable.",
      "created_utc": 1680717756.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jf32xni",
      "author": "None",
      "body": "I’m going through the same feelings at the moment <3 I’ve been in recovery a year, but the fact I would genuinely trade all my health and happiness for my old life of misery and skinniness shows I’m definitely not fully recovered; regardless of the fact I can eat without thinking and as much as I want.",
      "created_utc": 1680719930.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jf40sh6",
      "author": "Traditional_Ad7867",
      "body": "100%... Gained 50lb in 2 months 'recovery' and have had enough. I feel 100x worse. But the promise of freedom pushes you on.... Not sure it's attainable however.",
      "created_utc": 1680732994.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jf5cw7j",
      "author": "None",
      "body": "I feel you. I felt the same and in fact still do. There's something familiar and comforting about ED that I can't seem to let go. Was I hungry? Yes. Did I ever feel like I might not wake up the next day cause my body might just give in? Yes. Did I lose all my friends and family's trust? Yes. But did ED give me a sense of comfort and achievement? Also yes. \n\nIn the most fucked up way possible, ED give this sense of comfort that as long as i restrict, I'm doing good. Cold all the time? Yup, good job, you're on the right track. Seeing stars? Even better, you're doing great. \n\nThat's the ED voice. It's the only voice that approves my effort. The only voice that see how hard I try. That voice is mean most of the time, but when that ED voice is nice, it feels real good. \n\nBut trust me, recovery is worth it. The world is bigger than that voice in your head. So much bigger.",
      "created_utc": 1680756019.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jf3365o",
      "author": "AstronautMediocre809",
      "body": "i feel this so deeply- i don’t have anything to really say besides that you’re not alone in this feeling and this is probably the post about ed that i’ve connected to the most in my entire life. if you want to dm me id love that (selfishly) because i too am painfully alone. that being said, no pressure. \ni just want you to know i love you. \nand that no matter what happens you are never truely alone and there’s everyone around the world dealing with these issues who would do anything to make you smile (bc happiness isn’t always possible)",
      "created_utc": 1680720019.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jf3er3f",
      "author": "Skringybingybungy",
      "body": "I do similar things. Currently in a restriction portion because I’ve gained weight. I keep continuously losing/gaining the same 15-20lbs",
      "created_utc": 1680724348.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jf2h9va",
      "author": "Ku4ancitu",
      "body": "It sounds like you still have anorexia. Those who are cured do not dream of anorexia.",
      "created_utc": 1680711775.0,
      "score": 21,
      "context": []
    },
    {
      "id": "jf5runv",
      "author": "weedmassacre",
      "body": "I’m so sorry for what you’re going through, it sounds incredibly isolating. I am also sadly relating to everything you have said. Your reply to another comment about it being like a scar, that was a really good way of putting it. I feel like one of the gnawing pains of “”getting better”” is that the scar becomes less and less visible. On my bad days I cry because nobody would look at me today and guess that I’m dealing with this monster in my head. I miss it being a scar in the open that everyone could see. It became so much of my personality to be sick that having aspects of my personality that are healthy and outgoing didn’t even seem possible. Still hardly does, depends on the day. \nBut also, I find that even though it isn’t manifesting in the same way, that energy, that drive, anxiety, still goes somewhere. So if I try to give up one vice, it balances out with another. And so far my recovery has just been trying to bounce my vices of choice back and forth until I find some balance of fulfillment with (hopefully) less and less harmful vices. But sometimes I trick myself Cos the vices I fall for ARE harmful, just in other ways. I hope you are okay and have some people who are around you to help you know you’re heard and understood. And if you ever don’t, you have a lot of loving and sad internet friends who will ❤️",
      "created_utc": 1680767488.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jf7bc7c",
      "author": "Curious_Insurance694",
      "body": "I think you're just lacking something, almost like a void you need to fill now thst you dint have what anorexia gave you. Maybe try see what you were gaining from your ed and then see what you can do and change in your life to fill it back up again.\n\nSome thing I need to do is make friends and have experiences I can actually be present. I need to move my body and practice self love. I need to have routine and need to be productive. I need to be creative. I need to learn how to be with my emotions and to just be and not react to restrict or to binge or to purge. Idk",
      "created_utc": 1680798230.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jfdhr8o",
      "author": "anaperfectionskin22",
      "body": "Same.. especially when everybody comments your weight gain and on how „pretty u used to be“ damn",
      "created_utc": 1680905783.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jf4x7lr",
      "author": "buildingbeautiful",
      "body": "S a m e 😓",
      "created_utc": 1680747660.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf6b9u3",
      "author": "caretaker1971",
      "body": "Focus on what you DO have. A life, a future, potential. Your eating disorder created a wall between you and anything good. You’ve been busy tearing down that wall. But you haven’t gotten to find out what’s on the other side yet. It will take time and patience. But something awesome is waiting for you!!",
      "created_utc": 1680782537.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf6g2yj",
      "author": "DiligentCheesecake44",
      "body": "I can understand this. It does improve over time tho.",
      "created_utc": 1680785120.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jgmvzw1",
      "author": "FrankIerooo",
      "body": "I feel u",
      "created_utc": 1681752396.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jh2vt2r",
      "author": "maggot_1219",
      "body": "I understand it. I just came to this community for the first time because I’ve been feeling the exact same way for months. Ive been told self love and acceptance comes in time, and it’s a difficult journey. I hate how I look and I’m hoping I can accept myself soon. Sending support and hugs <3",
      "created_utc": 1682033967.0,
      "score": 2,
      "context": []
    },
    {
      "id": "llvljuo",
      "author": "Plastic_Leek_2460",
      "body": "became obese after 2 years of what i thought was overcoming my anorexia, gained 110lbs and i want to kms so i hear u .. working on trying to get back to being anorexic , i miss it so much i feel like a disgusting pig now … i was 80lbs two years ago and now im a fat pig all because i couldn’t stop the eating and anorexia left me , i hate myself i hate everything about me i just wish i could’ve killed myself when i was thin so id at least have been thin forever now im just a mess no one wants to be around and i don’t want to be around me either .. id rather be miserable and thin than miserable and fat , i hate my life",
      "created_utc": 1725666026.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lv9xmpe",
      "author": "DeliciousOpinion9542",
      "body": "I feel for you. Stay strong",
      "created_utc": 1730682036.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7xl37i",
      "author": "Konij",
      "body": "Felt this, hope everything is going well for you 💛",
      "created_utc": 1718005563.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5700hn",
      "author": "2cringey1",
      "body": "I miss it too now i can't even look at myself without feeling disappointed",
      "created_utc": 1735918130.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks0auj8",
      "author": "HopesBurnBright",
      "body": "Oh no it’s a body image problem\n\nAre you better nowadays?",
      "created_utc": 1708826336.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jf2pnx8",
      "author": "None",
      "body": "Sending hugs to you! Your middle paragrapher are my daily mantras… i see myself in you.",
      "created_utc": 1680714957.0,
      "score": 11,
      "context": [
        {
          "id": "jf2ozzu",
          "author": "boopydoopy2102",
          "body": "i understand.  i feel the same.  ive been physically recovered for a good few months, its only a matter of time before im underweight again cos thats the hellish cycle im trapped in.  i get uw, decide i want to recover and gain, and then can't handle it anymore so go back down.  its pathetic and you'd think id learn, but i don't. \n\ni don't wanna give ana up, that voice in my head is comforting and its presence is always felt.  im used to it and if i lose it then i have nothing left.  being anorexic is the most interesting thing about me despite most people in my life not knowing about it.  it gives me purpose.\n\ni understand your pain, im sorry you're going through this.  you aren't alone, even though it feels like you are.  sending hugs <3",
          "created_utc": 1680714705.0
        }
      ]
    },
    {
      "id": "jwgr3j4",
      "author": "Neither-Society-9104",
      "body": "wow this is so accurate",
      "created_utc": 1692210078.0,
      "score": 1,
      "context": [
        {
          "id": "jf3jnlx",
          "author": "None",
          "body": "the truth is that you don't miss the disorder itself, you miss the feeling of control, the \"voice\" was your \"friend\". you felt like you were on a secret mission. to a degree, restriction is fun because you start feeling like you're better than everyone else because you're able to \"control\" yourself around food. even if it means binging when no one is watching, or crying yourself to sleep because of how hungry and exhausted you are. but the honest truth is that that voice only wants to kill you and hurt you as much as it can. you're not a pig, you're a normal human being that requires fuel to keep going. choose the good fight.",
          "created_utc": 1680726182.0
        }
      ]
    },
    {
      "id": "lh6ykgm",
      "author": "Far_Adhesiveness1586",
      "body": "your comment makes me feel so much better, i’m currently pregnant but had a horrid ed prior and seeing the numbers go up makes me want to die i try to not relapse for my kid. i hope your still doing just as good as you were when this post was made :,)",
      "created_utc": 1723160037.0,
      "score": 1,
      "context": [
        {
          "id": "jf40sh6",
          "author": "Traditional_Ad7867",
          "body": "100%... Gained 50lb in 2 months 'recovery' and have had enough. I feel 100x worse. But the promise of freedom pushes you on.... Not sure it's attainable however.",
          "created_utc": 1680732994.0
        }
      ]
    },
    {
      "id": "jf6hpbf",
      "author": "Inevitable_Brush5800",
      "body": "What are you eating that's making you feel bad? Or is it just that your GI in general isn't happy with anything that you do?",
      "created_utc": 1680785920.0,
      "score": 1,
      "context": [
        {
          "id": "jf40sh6",
          "author": "Traditional_Ad7867",
          "body": "100%... Gained 50lb in 2 months 'recovery' and have had enough. I feel 100x worse. But the promise of freedom pushes you on.... Not sure it's attainable however.",
          "created_utc": 1680732994.0
        }
      ]
    },
    {
      "id": "jf4xyjo",
      "author": "None",
      "body": "Thats so frustrating!",
      "created_utc": 1680748004.0,
      "score": 1,
      "context": [
        {
          "id": "jf3er3f",
          "author": "Skringybingybungy",
          "body": "I do similar things. Currently in a restriction portion because I’ve gained weight. I keep continuously losing/gaining the same 15-20lbs",
          "created_utc": 1680724348.0
        }
      ]
    },
    {
      "id": "jf2hnu6",
      "author": "None",
      "body": "Do you ever get cured cured? I feel like anorexia is like a scar. It never disappears 100%. It always there, even if faint, making you remember.",
      "created_utc": 1680711924.0,
      "score": 33,
      "context": [
        {
          "id": "jf2h9va",
          "author": "Ku4ancitu",
          "body": "It sounds like you still have anorexia. Those who are cured do not dream of anorexia.",
          "created_utc": 1680711775.0
        }
      ]
    },
    {
      "id": "jf6x7zn",
      "author": "None",
      "body": "I identify a lot with you! My vice became working. Anorexia is a vice.",
      "created_utc": 1680792694.0,
      "score": 1,
      "context": [
        {
          "id": "jf5runv",
          "author": "weedmassacre",
          "body": "I’m so sorry for what you’re going through, it sounds incredibly isolating. I am also sadly relating to everything you have said. Your reply to another comment about it being like a scar, that was a really good way of putting it. I feel like one of the gnawing pains of “”getting better”” is that the scar becomes less and less visible. On my bad days I cry because nobody would look at me today and guess that I’m dealing with this monster in my head. I miss it being a scar in the open that everyone could see. It became so much of my personality to be sick that having aspects of my personality that are healthy and outgoing didn’t even seem possible. Still hardly does, depends on the day. \nBut also, I find that even though it isn’t manifesting in the same way, that energy, that drive, anxiety, still goes somewhere. So if I try to give up one vice, it balances out with another. And so far my recovery has just been trying to bounce my vices of choice back and forth until I find some balance of fulfillment with (hopefully) less and less harmful vices. But sometimes I trick myself Cos the vices I fall for ARE harmful, just in other ways. I hope you are okay and have some people who are around you to help you know you’re heard and understood. And if you ever don’t, you have a lot of loving and sad internet friends who will ❤️",
          "created_utc": 1680767488.0
        }
      ]
    },
    {
      "id": "jf7m9l4",
      "author": "None",
      "body": "I need to be thin. I’m fat.",
      "created_utc": 1680802448.0,
      "score": 1,
      "context": [
        {
          "id": "jf7bc7c",
          "author": "Curious_Insurance694",
          "body": "I think you're just lacking something, almost like a void you need to fill now thst you dint have what anorexia gave you. Maybe try see what you were gaining from your ed and then see what you can do and change in your life to fill it back up again.\n\nSome thing I need to do is make friends and have experiences I can actually be present. I need to move my body and practice self love. I need to have routine and need to be productive. I need to be creative. I need to learn how to be with my emotions and to just be and not react to restrict or to binge or to purge. Idk",
          "created_utc": 1680798230.0
        }
      ]
    },
    {
      "id": "jf3u7m6",
      "author": "boopydoopy2102",
      "body": "im so sorry lol.  anyone who sees themselves in me is someone i feel very bad for XD\n\ni hope you'll be okay <3",
      "created_utc": 1680730245.0,
      "score": 4,
      "context": [
        {
          "id": "jf2ozzu",
          "author": "boopydoopy2102",
          "body": "i understand.  i feel the same.  ive been physically recovered for a good few months, its only a matter of time before im underweight again cos thats the hellish cycle im trapped in.  i get uw, decide i want to recover and gain, and then can't handle it anymore so go back down.  its pathetic and you'd think id learn, but i don't. \n\ni don't wanna give ana up, that voice in my head is comforting and its presence is always felt.  im used to it and if i lose it then i have nothing left.  being anorexic is the most interesting thing about me despite most people in my life not knowing about it.  it gives me purpose.\n\ni understand your pain, im sorry you're going through this.  you aren't alone, even though it feels like you are.  sending hugs <3",
          "created_utc": 1680714705.0
        },
        {
          "id": "jf2pnx8",
          "author": "None",
          "body": "Sending hugs to you! Your middle paragrapher are my daily mantras… i see myself in you.",
          "created_utc": 1680714957.0
        }
      ]
    },
    {
      "id": "jwgr8qf",
      "author": "None",
      "body": "i hope you're healing, my friend :)",
      "created_utc": 1692210129.0,
      "score": 1,
      "context": [
        {
          "id": "jf3jnlx",
          "author": "None",
          "body": "the truth is that you don't miss the disorder itself, you miss the feeling of control, the \"voice\" was your \"friend\". you felt like you were on a secret mission. to a degree, restriction is fun because you start feeling like you're better than everyone else because you're able to \"control\" yourself around food. even if it means binging when no one is watching, or crying yourself to sleep because of how hungry and exhausted you are. but the honest truth is that that voice only wants to kill you and hurt you as much as it can. you're not a pig, you're a normal human being that requires fuel to keep going. choose the good fight.",
          "created_utc": 1680726182.0
        },
        {
          "id": "jwgr3j4",
          "author": "Neither-Society-9104",
          "body": "wow this is so accurate",
          "created_utc": 1692210078.0
        }
      ]
    },
    {
      "id": "jf31jew",
      "author": "None",
      "body": "I think that similar to my depression and anxiety it never goes away but as I live and grow I get more able to handle it. As my perspective changes the problems stay the same but they seem easier to overcome. I'm a dude who struggles with it so I feel like I have few to confide in for the ED but when I did tell an old therapist they said to focus on being thankful for the body you're in. Helped me a little at the time",
      "created_utc": 1680719404.0,
      "score": 7,
      "context": [
        {
          "id": "jf2h9va",
          "author": "Ku4ancitu",
          "body": "It sounds like you still have anorexia. Those who are cured do not dream of anorexia.",
          "created_utc": 1680711775.0
        },
        {
          "id": "jf2hnu6",
          "author": "None",
          "body": "Do you ever get cured cured? I feel like anorexia is like a scar. It never disappears 100%. It always there, even if faint, making you remember.",
          "created_utc": 1680711924.0
        }
      ]
    },
    {
      "id": "jf3frby",
      "author": "None",
      "body": "I think so tbh. \n\nI've been recovered for a solid year or two Idk. Zero Ed thoughts or urges. Sometimes when I'm eating I'll think back and be like ha remember 5 years ago when I literally would've cried doing this. Or I'll be walking and I'll be grateful because a couple years ago Id be too exhausted for anything \n\nI do think about it, but more in relation to how much bigger and better my life is without my Ed. I'll never actually intentially relapse again.",
      "created_utc": 1680724722.0,
      "score": 5,
      "context": [
        {
          "id": "jf2h9va",
          "author": "Ku4ancitu",
          "body": "It sounds like you still have anorexia. Those who are cured do not dream of anorexia.",
          "created_utc": 1680711775.0
        },
        {
          "id": "jf2hnu6",
          "author": "None",
          "body": "Do you ever get cured cured? I feel like anorexia is like a scar. It never disappears 100%. It always there, even if faint, making you remember.",
          "created_utc": 1680711924.0
        }
      ]
    },
    {
      "id": "jf6hrl2",
      "author": "Inevitable_Brush5800",
      "body": "Is Anarexia not tied into anxiety and OCD as well?",
      "created_utc": 1680785951.0,
      "score": 5,
      "context": [
        {
          "id": "jf2h9va",
          "author": "Ku4ancitu",
          "body": "It sounds like you still have anorexia. Those who are cured do not dream of anorexia.",
          "created_utc": 1680711775.0
        },
        {
          "id": "jf2hnu6",
          "author": "None",
          "body": "Do you ever get cured cured? I feel like anorexia is like a scar. It never disappears 100%. It always there, even if faint, making you remember.",
          "created_utc": 1680711924.0
        },
        {
          "id": "jf31jew",
          "author": "None",
          "body": "I think that similar to my depression and anxiety it never goes away but as I live and grow I get more able to handle it. As my perspective changes the problems stay the same but they seem easier to overcome. I'm a dude who struggles with it so I feel like I have few to confide in for the ED but when I did tell an old therapist they said to focus on being thankful for the body you're in. Helped me a little at the time",
          "created_utc": 1680719404.0
        }
      ]
    },
    {
      "id": "jf32f2h",
      "author": "None",
      "body": "I’m so sorry you have those issues. Its really hard yo deal with our brain. The brain commands everything, who commands the brain, right? Your therapist didn’t choose the best approach in my opinion, but its good that it helped you! I hope you feel better and that you keep felling better and better. Thank you for commenting. ❤️",
      "created_utc": 1680719735.0,
      "score": 2,
      "context": [
        {
          "id": "jf2h9va",
          "author": "Ku4ancitu",
          "body": "It sounds like you still have anorexia. Those who are cured do not dream of anorexia.",
          "created_utc": 1680711775.0
        },
        {
          "id": "jf2hnu6",
          "author": "None",
          "body": "Do you ever get cured cured? I feel like anorexia is like a scar. It never disappears 100%. It always there, even if faint, making you remember.",
          "created_utc": 1680711924.0
        },
        {
          "id": "jf31jew",
          "author": "None",
          "body": "I think that similar to my depression and anxiety it never goes away but as I live and grow I get more able to handle it. As my perspective changes the problems stay the same but they seem easier to overcome. I'm a dude who struggles with it so I feel like I have few to confide in for the ED but when I did tell an old therapist they said to focus on being thankful for the body you're in. Helped me a little at the time",
          "created_utc": 1680719404.0
        }
      ]
    },
    {
      "id": "jf4etlg",
      "author": "BedroomImpossible124",
      "body": "That’s comforting to know. Thank you!",
      "created_utc": 1680739290.0,
      "score": 3,
      "context": [
        {
          "id": "jf2h9va",
          "author": "Ku4ancitu",
          "body": "It sounds like you still have anorexia. Those who are cured do not dream of anorexia.",
          "created_utc": 1680711775.0
        },
        {
          "id": "jf2hnu6",
          "author": "None",
          "body": "Do you ever get cured cured? I feel like anorexia is like a scar. It never disappears 100%. It always there, even if faint, making you remember.",
          "created_utc": 1680711924.0
        },
        {
          "id": "jf3frby",
          "author": "None",
          "body": "I think so tbh. \n\nI've been recovered for a solid year or two Idk. Zero Ed thoughts or urges. Sometimes when I'm eating I'll think back and be like ha remember 5 years ago when I literally would've cried doing this. Or I'll be walking and I'll be grateful because a couple years ago Id be too exhausted for anything \n\nI do think about it, but more in relation to how much bigger and better my life is without my Ed. I'll never actually intentially relapse again.",
          "created_utc": 1680724722.0
        }
      ]
    },
    {
      "id": "jf4y2a1",
      "author": "None",
      "body": "I’m jealous. I wish…",
      "created_utc": 1680748053.0,
      "score": 1,
      "context": [
        {
          "id": "jf2h9va",
          "author": "Ku4ancitu",
          "body": "It sounds like you still have anorexia. Those who are cured do not dream of anorexia.",
          "created_utc": 1680711775.0
        },
        {
          "id": "jf2hnu6",
          "author": "None",
          "body": "Do you ever get cured cured? I feel like anorexia is like a scar. It never disappears 100%. It always there, even if faint, making you remember.",
          "created_utc": 1680711924.0
        },
        {
          "id": "jf3frby",
          "author": "None",
          "body": "I think so tbh. \n\nI've been recovered for a solid year or two Idk. Zero Ed thoughts or urges. Sometimes when I'm eating I'll think back and be like ha remember 5 years ago when I literally would've cried doing this. Or I'll be walking and I'll be grateful because a couple years ago Id be too exhausted for anything \n\nI do think about it, but more in relation to how much bigger and better my life is without my Ed. I'll never actually intentially relapse again.",
          "created_utc": 1680724722.0
        }
      ]
    },
    {
      "id": "jf4yahc",
      "author": "None",
      "body": "Thats so good for you though!!",
      "created_utc": 1680748163.0,
      "score": 1,
      "context": [
        {
          "id": "jf2h9va",
          "author": "Ku4ancitu",
          "body": "It sounds like you still have anorexia. Those who are cured do not dream of anorexia.",
          "created_utc": 1680711775.0
        },
        {
          "id": "jf2hnu6",
          "author": "None",
          "body": "Do you ever get cured cured? I feel like anorexia is like a scar. It never disappears 100%. It always there, even if faint, making you remember.",
          "created_utc": 1680711924.0
        },
        {
          "id": "jf3frby",
          "author": "None",
          "body": "I think so tbh. \n\nI've been recovered for a solid year or two Idk. Zero Ed thoughts or urges. Sometimes when I'm eating I'll think back and be like ha remember 5 years ago when I literally would've cried doing this. Or I'll be walking and I'll be grateful because a couple years ago Id be too exhausted for anything \n\nI do think about it, but more in relation to how much bigger and better my life is without my Ed. I'll never actually intentially relapse again.",
          "created_utc": 1680724722.0
        }
      ]
    },
    {
      "id": "jf73u8u",
      "author": "None",
      "body": "Not sure! It would make sense though",
      "created_utc": 1680795325.0,
      "score": 1,
      "context": [
        {
          "id": "jf2h9va",
          "author": "Ku4ancitu",
          "body": "It sounds like you still have anorexia. Those who are cured do not dream of anorexia.",
          "created_utc": 1680711775.0
        },
        {
          "id": "jf2hnu6",
          "author": "None",
          "body": "Do you ever get cured cured? I feel like anorexia is like a scar. It never disappears 100%. It always there, even if faint, making you remember.",
          "created_utc": 1680711924.0
        },
        {
          "id": "jf31jew",
          "author": "None",
          "body": "I think that similar to my depression and anxiety it never goes away but as I live and grow I get more able to handle it. As my perspective changes the problems stay the same but they seem easier to overcome. I'm a dude who struggles with it so I feel like I have few to confide in for the ED but when I did tell an old therapist they said to focus on being thankful for the body you're in. Helped me a little at the time",
          "created_utc": 1680719404.0
        },
        {
          "id": "jf6hrl2",
          "author": "Inevitable_Brush5800",
          "body": "Is Anarexia not tied into anxiety and OCD as well?",
          "created_utc": 1680785951.0
        }
      ]
    },
    {
      "id": "jf8ncvx",
      "author": "Inevitable_Brush5800",
      "body": "I think it's a form of OCD, personally. Should probably be treated the same. I think if you drew a graph of anxiety disorders, you could probably make a sweet flow chart using logic alone. If you think about the fixation, the palpable anxiety, the response, and how irrational it all feels.",
      "created_utc": 1680817170.0,
      "score": 2,
      "context": [
        {
          "id": "jf2h9va",
          "author": "Ku4ancitu",
          "body": "It sounds like you still have anorexia. Those who are cured do not dream of anorexia.",
          "created_utc": 1680711775.0
        },
        {
          "id": "jf2hnu6",
          "author": "None",
          "body": "Do you ever get cured cured? I feel like anorexia is like a scar. It never disappears 100%. It always there, even if faint, making you remember.",
          "created_utc": 1680711924.0
        },
        {
          "id": "jf31jew",
          "author": "None",
          "body": "I think that similar to my depression and anxiety it never goes away but as I live and grow I get more able to handle it. As my perspective changes the problems stay the same but they seem easier to overcome. I'm a dude who struggles with it so I feel like I have few to confide in for the ED but when I did tell an old therapist they said to focus on being thankful for the body you're in. Helped me a little at the time",
          "created_utc": 1680719404.0
        },
        {
          "id": "jf6hrl2",
          "author": "Inevitable_Brush5800",
          "body": "Is Anarexia not tied into anxiety and OCD as well?",
          "created_utc": 1680785951.0
        },
        {
          "id": "jf73u8u",
          "author": "None",
          "body": "Not sure! It would make sense though",
          "created_utc": 1680795325.0
        }
      ]
    }
  ]
}