{
  "id": "12cwrj7",
  "subreddit": "AnorexiaNervosa",
  "author": "rileyyj001",
  "created_utc": 1680726368.0,
  "title": "Currently in Kidney Failure",
  "selftext": "Hello friends—\n\nI’ve been MIA for some time now, both having been in Inpatient and just needing to step away from these communities for a moment. \n\nI wanted to share with you all that I am currently in kidney failure, and awaiting lab results to determine which stage I am at. I am only 32 years old. There is little hope that I can recover at this point without major medicinal intervention, of which I am not willing to do. I have suffered long enough, and wish to die with my dignity. \n\nI have suffered for over 25 years with this terrible illness, and I wanted to compassionately warn you all that death by EDs is a VERY REAL THING. I hope this shakes you to your core. I am 32 and dying. It could be within days, or months, but I will die from this. \n\nI wish you all nothing but healing, and peace. I am terrified. My family is in ruins. I truly cannot believe I am writing this post.\n\nThank you to every single one of you who has sent me well wishes; I take every word to heart and I have made some beautiful connections here. You are spectacular people, and you deserve full recovery.\n\nBe well, friends 🤍\n\nETA: Wow, thank you all for your incredibly kind words of love and support. This is the exact energy we all need, here.\n\nIn incredibly surprising news, my lab results are in, and by some chance of all that is good in the world, almost every single value has SHOT up; not just little jumps here and there, like major life-changing amounts. My doctor, family and I are shocked, as I haven’t changed any behaviors! \n\nI don’t know what to make of this; is it a second chance? I have so much thinking to do. \n\nLove you every one of you! I think the prayers I have received here are what has made this happen?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/12cwrj7/currently_in_kidney_failure/",
  "score": 157,
  "num_comments": 18,
  "comments": [
    {
      "id": "jf3k5wd",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1680726369.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jf4xxw8",
      "author": "None",
      "body": "Thank you so much for your vulnerability. You’re right, death by eating disorders is very real and it’s not talked about enough, nor is the grief that accompanies it. Please reach out for support at the hospital you’re at, they should have social workers who can help with psychosocial support specifically with medical issues. Your life matters, regardless of how much longer you have. You matter and your story matters. Thank you for sharing part of it with us.",
      "created_utc": 1680747995.0,
      "score": 26,
      "context": []
    },
    {
      "id": "jf5q8dd",
      "author": "None",
      "body": "Everyone reading this: please get help before its too late. if you are not recovering, you are dying. \n\ni only had AN for a few years and I currently have a strange type of diabetes due to chronic hypoglycemia! And I'm 21 years old. \n\nOne day you will not want the ED anymore, one day it will no longer serve you, or it will get too scary, but the health consequences will still remain.",
      "created_utc": 1680766067.0,
      "score": 21,
      "context": []
    },
    {
      "id": "jf4l4sg",
      "author": "SieBanhus",
      "body": "Hey, I fully understand the sentiment but don’t give up until you know more - this may not be the end, and there may be fairly moderate treatment you can try. That said, I absolutely believe you have the right to decide when you don’t want to keep trying stuff, so I just wish you peace no matter what.",
      "created_utc": 1680742150.0,
      "score": 29,
      "context": []
    },
    {
      "id": "jf44me1",
      "author": "UniqueCalendar3479",
      "body": "Gosh I really am sending all the love I can, I want to say be strong but that's what you've been doing this whole time. You're a beautiful soul I hope you can recupirate to some extent and I wish the best for your family as well.",
      "created_utc": 1680734669.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jf5in5k",
      "author": "myetheresa",
      "body": "Thank you for having the courage to tell your story, I hope that your message reaches all that need to hear you.",
      "created_utc": 1680759977.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jf4ildm",
      "author": "necromxnia",
      "body": "Sending you all my love right now <3",
      "created_utc": 1680740985.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jf72go2",
      "author": "SugaryShrimp",
      "body": "This could be a second chance, love. In all the pain we endure in life, there can be some reason we can assign ourselves to persevere. You are already spreading awareness to help other avoid the pain you’ve experienced. I don’t know you, but god, I wish you so much peace and passion for life, on behalf of all of those still searching. ❤️",
      "created_utc": 1680794775.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jf7869p",
      "author": "ProThrowaway929",
      "body": "this is your second chance, don’t let it go to waste op. your words are so saddening to read because you seem so set on your life being over. please don’t give up so soon, i would not call what you’re doing “dying with dignity” unfortunately if anything i think it’s the opposite. now you can live with dignity, thank you so much for your vulnerability and for shaming your story.",
      "created_utc": 1680797010.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jf74p9f",
      "author": "pinkrynnn",
      "body": "sending love <33",
      "created_utc": 1680795661.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf7t997",
      "author": "-Skelly-",
      "body": "crying on the bus after reading your update. i'm so so sorry you went through this but so thankful that things seem to be looking up, i hope this is the second chance you need ❤️",
      "created_utc": 1680805176.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jfrhuhx",
      "author": "EasternLow3751",
      "body": "ive somewhat followed your story for a bit now, silently hoping that you could do it. seeing you on forums, and on subs. in my own decision to recover, i have seperated myself from most of these spaces. seeing this really gave me chills. we dont know eachother, really, but i am so sad for you. this illness is the worst thing. i wish you true peace, whether it be letting it happen or taking the 2nd chance. thank you for being so open and helping me realize that this illness is not worth giving my life up for.",
      "created_utc": 1681170674.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf64i60",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1680778239.0,
      "score": 0,
      "context": []
    },
    {
      "id": "jf79mgj",
      "author": "MandrakeMoonBoy",
      "body": "Sometimes in our life we get a near death experience. Something that will bring us so close to death, only to have the Gods/Universe or God save you and give you a second chance. Sometimes we need to look death in the eye and be given a second chance for us to have the opportunity to see how beautiful life can be. I wish you the best and I'm so glad you're doing better. Don't waste this second chance you've been gifted. I love you. 💙🌒🌕🌘",
      "created_utc": 1680797570.0,
      "score": 0,
      "context": []
    },
    {
      "id": "jf53dj9",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1680750631.0,
      "score": -15,
      "context": []
    },
    {
      "id": "jf7i5eb",
      "author": "Crystalcicle",
      "body": "What are your next steps?",
      "created_utc": 1680800868.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jf6g63p",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 8: Don't give medical advice in any way, shape, or form. \n\nWe cannot diagnose or give critical advice over an online subreddit. Doing this can be harmful for the community of r/AnorexiaNervosa. It will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1680785164.0,
      "score": 2,
      "context": [
        {
          "id": "jf64i60",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1680778239.0
        }
      ]
    },
    {
      "id": "jf5icxm",
      "author": "xsullengirlx",
      "body": "So passive aggressive for what reason?",
      "created_utc": 1680759767.0,
      "score": 7,
      "context": [
        {
          "id": "jf53dj9",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1680750631.0
        }
      ]
    }
  ]
}