{
  "id": "12ogvrj",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1681663766.0,
  "title": "The nurse was like I can see you ate alot by the way your stomach is looking",
  "selftext": "🥲like why would you say something like that",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/12ogvrj/the_nurse_was_like_i_can_see_you_ate_alot_by_the/",
  "score": 123,
  "num_comments": 11,
  "comments": [
    {
      "id": "jgi1574",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1681663766.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgjezfc",
      "author": "kitkatkoo",
      "body": "As a former supervisor in an ED hospital, hard disagree with the other commenter, given the context I’d give someone a verbal warning for this. If she’s aware of your diagnosis (or ESPECIALLY if she’s a psych nurse specifically) I’d inform another staff member you trust.",
      "created_utc": 1681684395.0,
      "score": 101,
      "context": []
    },
    {
      "id": "jgksrlb",
      "author": "NoProtection252",
      "body": "That is horrible. I am so incredibly sorry she said that to you in such an early and sensitive state. If it makes you feel better, I’ve been hospitalized for almost three weeks and it’s pretty much all gone to my stomach. Its protecting your vital organs!! It’s normal and you are not alone!",
      "created_utc": 1681709088.0,
      "score": 23,
      "context": []
    },
    {
      "id": "jgknkvf",
      "author": "hippybitty",
      "body": "It’s like they want to trigger you. I will never understand how anyone says something like that. What a piece of shit!!!",
      "created_utc": 1681705777.0,
      "score": 22,
      "context": []
    },
    {
      "id": "jgp1kf4",
      "author": "Formal_Candle37",
      "body": "Wow what the fuck",
      "created_utc": 1681784902.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jgpu5oa",
      "author": "coffeeandmilk123",
      "body": "Ughh I feel you, a few years back I told a nurse my weight & she replied “you? You weight Xlbs?” then proceeds to scoff and chuckle at me as if to say “yeah sure”\n\nShe didn’t know about my problem but seriously why do they do that?",
      "created_utc": 1681801715.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jgi83se",
      "author": "ProThrowaway929",
      "body": "i can see how she would say it without bad intention. if she sees you everyday she probably knows what your empty stomach looks like so she noticed. it definitely came off waaaaay wrong though, sorry you had to experience that.",
      "created_utc": 1681666623.0,
      "score": -19,
      "context": []
    },
    {
      "id": "jgrfs2x",
      "author": "None",
      "body": "Wow that’s terrible and incredibly insensitive. If a nurse said that to me I’d say something and suggest she find another job, one where she doesn’t hate her patients. \n\nHugs.",
      "created_utc": 1681834868.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgjpubk",
      "author": "heavycreambasement",
      "body": "you don't actually have to comment on everything you notice. especially if you're a nurse working with patients with eating disorders and the thing you noticed is that one of them looks fatter than usual. like even if they didn't mean it with any ill intent they're still fucking stupid at the very least.",
      "created_utc": 1681689388.0,
      "score": 50,
      "context": [
        {
          "id": "jgi83se",
          "author": "ProThrowaway929",
          "body": "i can see how she would say it without bad intention. if she sees you everyday she probably knows what your empty stomach looks like so she noticed. it definitely came off waaaaay wrong though, sorry you had to experience that.",
          "created_utc": 1681666623.0
        }
      ]
    },
    {
      "id": "jgik5u2",
      "author": "None",
      "body": "Ya agree with ProThrowaway, it's easy for those in the medical field to notice small changes of full versus empty. I am sure she meant it in a positive way but I get it...",
      "created_utc": 1681671561.0,
      "score": -19,
      "context": [
        {
          "id": "jgi83se",
          "author": "ProThrowaway929",
          "body": "i can see how she would say it without bad intention. if she sees you everyday she probably knows what your empty stomach looks like so she noticed. it definitely came off waaaaay wrong though, sorry you had to experience that.",
          "created_utc": 1681666623.0
        }
      ]
    },
    {
      "id": "jgjzqtj",
      "author": "mehnifest",
      "body": "Agree. It is so difficult to truly want to get better when treating the disorder feels like absolute failure. Something like “you’re looking well” feels like an insult, and what the nurse said was far worse than that.",
      "created_utc": 1681693788.0,
      "score": 17,
      "context": [
        {
          "id": "jgi83se",
          "author": "ProThrowaway929",
          "body": "i can see how she would say it without bad intention. if she sees you everyday she probably knows what your empty stomach looks like so she noticed. it definitely came off waaaaay wrong though, sorry you had to experience that.",
          "created_utc": 1681666623.0
        },
        {
          "id": "jgjpubk",
          "author": "heavycreambasement",
          "body": "you don't actually have to comment on everything you notice. especially if you're a nurse working with patients with eating disorders and the thing you noticed is that one of them looks fatter than usual. like even if they didn't mean it with any ill intent they're still fucking stupid at the very least.",
          "created_utc": 1681689388.0
        }
      ]
    }
  ]
}