{
  "id": "134v34n",
  "subreddit": "AnorexiaNervosa",
  "author": "Luciferisnotalright",
  "created_utc": 1682962671.0,
  "title": "I hate the fact that some people treat Anorexia like a choice",
  "selftext": "\"Many sick people would give anything to be healthy and you purposefully make yourself sick\"\nThey're treating it like you can just stop anytime you want to, that would be wonderful if it was true but unfortunately it is not.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/134v34n/i_hate_the_fact_that_some_people_treat_anorexia/",
  "score": 148,
  "num_comments": 22,
  "comments": [
    {
      "id": "jigj8hf",
      "author": "Blezhenger",
      "body": "Opened up about my ed in group therapy and everyone was like \"you should stop, that's really unhealthy. You will die\". Thanks bro it was totally worth going to fucking therapy for this bullshit",
      "created_utc": 1682963867.0,
      "score": 66,
      "context": []
    },
    {
      "id": "jigp8yk",
      "author": "Healing_Self",
      "body": "Or my favorite when people around me are dieting \"I wish I had half the control you did! Then I'd be skinny like you!\" Like.... do you want all the mental issues it comes with too? Or ever enjoy a meal without stress?",
      "created_utc": 1682966232.0,
      "score": 36,
      "context": []
    },
    {
      "id": "jigv9sh",
      "author": "sadworldscaredgirl",
      "body": "\"just eat more again\" - thanks but I would rather kill myself than do that, that might be the more fundamental problem",
      "created_utc": 1682968628.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jiihmbv",
      "author": "Glennly",
      "body": "I especially hate it when they bring body shaming and fatphobia up with it, like \"oh so you think plus size  bodies can't be desirable?\" no, ma'am, I'm mentally ill and ✨traumatized✨ I think *my* body can't be desirable. And it's not like I chose that mindset. It's one that I have to constantly fight.",
      "created_utc": 1682993536.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jigio6t",
      "author": "brattcatt420",
      "body": "Eating Disorders are not a choice, but recovery is.",
      "created_utc": 1682963650.0,
      "score": 27,
      "context": []
    },
    {
      "id": "jih6kkp",
      "author": "None",
      "body": "Even if it was a choice: a person who WILLINGLY CHOOSES to get as sick as possible is still not a healthy person. Something was wrong beforehand, and the “””pursuit””” of an illness is just a manifestation of that. Healthy people don’t seek out dangerous or damaging behavior",
      "created_utc": 1682973005.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jih1nzi",
      "author": "BeachJax",
      "body": "I used to be quite overweight and I am always stunned at how much ruder people are to thin people. No one asked me what size I was, held up my clothes and said that they looked like a child’s, ask me what I weighed etc. when I was heavy.",
      "created_utc": 1682971103.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jigqxhg",
      "author": "recoveringhsp_hijabi",
      "body": "literally i hate it so much. people will say “i don’t understand why you’re *choosing* to latch on to all the negatives about yourself when other people would kill to be good at school, have a functioning body, a nice group of friends, and you’re throwing it all away just to be sKiNnY” like it’s that simple isn’t it ☠️☠️\nlast time i checked, it’s called body dysmorphia and low self esteem but apparently it’s a choice and all my mental health issues are my fault 😍😍",
      "created_utc": 1682966892.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jihsw9f",
      "author": "None",
      "body": "LIKEEEE I would love to not have my existence plagued by evil thoughts surrounding food please",
      "created_utc": 1682982452.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jikmynk",
      "author": "boopydoopy2102",
      "body": "i hate that too, but i sorta get it.  i do choose to keep doing this to myself.  ive been given an out many times and sometimes i try to let go, but it never lasts.  i always end up back with ana and it has such a hold over my every thought and my entire life.  i can understand why someone would see this as a choice, however wrong and frustrating that opinion can be",
      "created_utc": 1683040956.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jini6c5",
      "author": "Tommypickleknees",
      "body": "Lol it’s very odd that people don’t see it for what it is, a mental health condition. You can’t just tell someone who is bipolar to “just stop”. I don’t know why people insist on telling people with AN to just stop. Thanks Susan, why didn’t I think of that!",
      "created_utc": 1683083820.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jijl2nn",
      "author": "Puzzleheaded_Ad550",
      "body": "I hate it when people go on about how recovery is just like turning on a switch. If only things were that easy",
      "created_utc": 1683020956.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jikoo62",
      "author": "United-Author3509",
      "body": "yeah and people are like rubbing my nose when i suffer in some way saying see what youre doing yes butch I am no need to remind me",
      "created_utc": 1683041638.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jire63n",
      "author": "Burgundy_bell",
      "body": "I've been all the way through it. I have mostly recovered now and am doing a lot better. However, I have some lingering health issues regarding digestion that are possibly connected to my past ed. I spoke with my mom about it, and she still has the mindset that I made some decision to do that to myself. Like I had purposely decided to wreck my mental and physical health for 5 years. Even though she knows how horrible it is and that she was there when I was struggling, part of her still thinks that was a choice I made.",
      "created_utc": 1683154664.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jl3vy73",
      "author": "None",
      "body": "It’s weird. After recovering, I want tho scream it from the rooftops; “anorexia kills!”. \n\nBut we know that don’t we? We can’t help it. I was so sick and stuck in my illness that I didn’t even care. All I thought day in and out was food. Restricting food, being repulsed by food and desperately wanting to eat from somewhere deep within that I had repressed for so long. It’s a total cycle and addiction that sadly starts with us. Most outside advice falls on deaf ears with anorexia.",
      "created_utc": 1684722337.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jlta97p",
      "author": "g59g59g59",
      "body": "My friends I love them but I had like a 4 hour phone call w one of them last night and he told me to drink soup and was under the impression I physically couldn’t eat. I explained it to him and he said he was sorry (I wasn’t mad) and then told me to try and eat “if not for yourself then for your boyfriend and your son.” He’s such a sweet, genuine guy who’s always there for me but I can explain all I want that i physically cannot bring myself to eat and if I do it can’t be more than xx calories a day. It’s so hard explaining this to people cuz they get frustrated.",
      "created_utc": 1685188626.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jin99ii",
      "author": "Lemon_m1lk",
      "body": "after i was discharged from hospital after spending a month and a half there from ana, my high school mentor was always talking about her weight loss journey. I didn't mind it so much until she started joking about my experience by saying things like she wishes she could trade places with me and \"give me all her extra calories\".  Like what am I supposed to say to that?? \n\nIt should be common knowledge to NOT discuss weight and calories with someone you know is struggling with an ED.\nBetter yet, don't project your body image issues to anyone in general unless it is your therapist or a doctor or someone.",
      "created_utc": 1683079717.0,
      "score": 3,
      "context": [
        {
          "id": "jigp8yk",
          "author": "Healing_Self",
          "body": "Or my favorite when people around me are dieting \"I wish I had half the control you did! Then I'd be skinny like you!\" Like.... do you want all the mental issues it comes with too? Or ever enjoy a meal without stress?",
          "created_utc": 1682966232.0
        }
      ]
    },
    {
      "id": "jijvkeu",
      "author": "bigbuutie",
      "body": "Eating disorders are not a choice, but empathy can be.",
      "created_utc": 1683028379.0,
      "score": 11,
      "context": [
        {
          "id": "jigio6t",
          "author": "brattcatt420",
          "body": "Eating Disorders are not a choice, but recovery is.",
          "created_utc": 1682963650.0
        }
      ]
    },
    {
      "id": "jiibxg7",
      "author": "username248124",
      "body": "This !!! Skinny shamming is so normalized in todays society it’s sad",
      "created_utc": 1682991047.0,
      "score": 4,
      "context": [
        {
          "id": "jih1nzi",
          "author": "BeachJax",
          "body": "I used to be quite overweight and I am always stunned at how much ruder people are to thin people. No one asked me what size I was, held up my clothes and said that they looked like a child’s, ask me what I weighed etc. when I was heavy.",
          "created_utc": 1682971103.0
        }
      ]
    },
    {
      "id": "jkgjhws",
      "author": "IcyScientist6096",
      "body": "This is an honest question, do antidepressants help with anorexia? Is it an anxiety driven mental illness? I have tried to understand this disease for some time. I don’t have it myself so it’s hard for me to grasp. How does the deprivation, starvation help mental anguish in any way? Like what benefit does this ritual (for lack of a better word) have? Some say, it’s due to low self esteem.. how does becoming skeletal help self esteem? I would appreciate any insight.",
      "created_utc": 1684296078.0,
      "score": 1,
      "context": [
        {
          "id": "jini6c5",
          "author": "Tommypickleknees",
          "body": "Lol it’s very odd that people don’t see it for what it is, a mental health condition. You can’t just tell someone who is bipolar to “just stop”. I don’t know why people insist on telling people with AN to just stop. Thanks Susan, why didn’t I think of that!",
          "created_utc": 1683083820.0
        }
      ]
    },
    {
      "id": "jkn4tyx",
      "author": "Tommypickleknees",
      "body": "For me it’s control. Having a lack of control growing up and feeling that instability as a child caused me to become hyper fixated on controlling my food and my weight. I can’t speak to why anyone else struggles, but for me personally it’s a form of control that makes me feel ‘safe’",
      "created_utc": 1684421733.0,
      "score": 1,
      "context": [
        {
          "id": "jini6c5",
          "author": "Tommypickleknees",
          "body": "Lol it’s very odd that people don’t see it for what it is, a mental health condition. You can’t just tell someone who is bipolar to “just stop”. I don’t know why people insist on telling people with AN to just stop. Thanks Susan, why didn’t I think of that!",
          "created_utc": 1683083820.0
        },
        {
          "id": "jkgjhws",
          "author": "IcyScientist6096",
          "body": "This is an honest question, do antidepressants help with anorexia? Is it an anxiety driven mental illness? I have tried to understand this disease for some time. I don’t have it myself so it’s hard for me to grasp. How does the deprivation, starvation help mental anguish in any way? Like what benefit does this ritual (for lack of a better word) have? Some say, it’s due to low self esteem.. how does becoming skeletal help self esteem? I would appreciate any insight.",
          "created_utc": 1684296078.0
        }
      ]
    }
  ]
}