{
  "id": "13n2q4s",
  "subreddit": "AnorexiaNervosa",
  "author": "Important-Hand-100",
  "created_utc": 1684608256.0,
  "title": "What's the dumbest thing you've been told not to do so you don't burn calories?",
  "selftext": "almost all hospitals practice this, in particular in families (fbt). people are literally forbidden to move their legs, they put clear limits on walking (when the condition is serious, no one will let you go anywhere). but sometimes it comes to boundless insanity. tell me how it was for you?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/13n2q4s/whats_the_dumbest_thing_youve_been_told_not_to_do/",
  "score": 114,
  "num_comments": 82,
  "comments": [
    {
      "id": "jkxoj7y",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1684608256.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jkxw2pz",
      "author": "Damage-heck",
      "body": "Wasn’t  allowed to solve my Rubik’s cube too fast",
      "created_utc": 1684611486.0,
      "score": 144,
      "context": []
    },
    {
      "id": "jkyllkl",
      "author": "xMariko",
      "body": "We had to do presentations and things like that, but weren't allowed to give applause so we had to count down from 3 to 1 and then do one short clap. Seemed a bit excessive",
      "created_utc": 1684623109.0,
      "score": 107,
      "context": []
    },
    {
      "id": "jkxu8e1",
      "author": "mili1002",
      "body": "Keep the window open at night because it burns more calories.",
      "created_utc": 1684610670.0,
      "score": 77,
      "context": []
    },
    {
      "id": "jky1ye6",
      "author": "AwayPineapple8074",
      "body": "One time a girl went on her tip toes to stretch and they thought she was doing calf raises so they cut her privileges for the day",
      "created_utc": 1684614091.0,
      "score": 125,
      "context": []
    },
    {
      "id": "jkyazn6",
      "author": "tintedpink",
      "body": "The ED unit I was on had a rule to always use an elevator if there was one. We got to go outside and sit in the hospital yard once a day. We had to take the elevator down/up what was literally half a floor. There weren't even stairs, just a ramp. Pretty sure the extra feet we walked to get to the elevator burned more calories than walking up the shallow ramp would've.",
      "created_utc": 1684618125.0,
      "score": 64,
      "context": []
    },
    {
      "id": "jkynn2x",
      "author": "VirtualApricot",
      "body": "I was told I was crocheting too rigorously. \n\nBeing on full bed rest, no ability to do ANYTHING (not even watch TV!), and having ADD who has been a fidgeter my entire life, I was never so uncomfortable in my body I’m my entire life. All of it. Far too much. All at once.",
      "created_utc": 1684624095.0,
      "score": 60,
      "context": []
    },
    {
      "id": "jky2mbr",
      "author": "irokanshou",
      "body": "i was told not to put pepper on my food",
      "created_utc": 1684614382.0,
      "score": 48,
      "context": []
    },
    {
      "id": "jky6h5g",
      "author": "fuckiwishicouldkms",
      "body": "they also seemed pretty upset when we rode down the hallway on our tube/iv pole. i mean, they got rid of the carpet… that was their fault 🤷‍♀️",
      "created_utc": 1684616088.0,
      "score": 51,
      "context": []
    },
    {
      "id": "jkylxut",
      "author": "gemmaparss",
      "body": "my camhs lady said i wasn’t allowed to talk with my hands as it was too much movement",
      "created_utc": 1684623270.0,
      "score": 44,
      "context": []
    },
    {
      "id": "jky3igq",
      "author": "wishicouldkms",
      "body": "I was told I couldn’t bounce a ball back and forth with another patient while we were sitting.",
      "created_utc": 1684614778.0,
      "score": 44,
      "context": []
    },
    {
      "id": "jkypg1o",
      "author": "Cokezerowh0re",
      "body": "Ok so not exactly answering the question but my dentist said I had to drink my juice through a straw but the staff said it had to be glass/silicon/plastic, not paper as it would absorb some of the juice. Wut👁️👄👁️",
      "created_utc": 1684624962.0,
      "score": 39,
      "context": []
    },
    {
      "id": "jky0onj",
      "author": "mykindabook",
      "body": "Selecting crafts tools in a group standing on my feet (because I couldn’t reach so far when sitting down)\n\nMoving my toes (the nurse always joked about it in a nitpicking way haha but he was lovely)\n\nSitting on my heels instead of having my butt on the chair…",
      "created_utc": 1684613534.0,
      "score": 25,
      "context": []
    },
    {
      "id": "jkypoxi",
      "author": "None",
      "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
      "created_utc": 1684625081.0,
      "score": 26,
      "context": []
    },
    {
      "id": "jkxy5o4",
      "author": "bienshee",
      "body": "There was a pose called the “flamingo” at the place where I was at. Basically one leg standing while the other is < (kinda like this <|) lmao",
      "created_utc": 1684612406.0,
      "score": 23,
      "context": []
    },
    {
      "id": "jkybitx",
      "author": "cuteinferno",
      "body": "crossing legs while sitting, and i got in trouble for leaning into the mirror while brushing my teeth because i was “squatting” but my legs weren’t bent idk 🤷‍♀️",
      "created_utc": 1684618368.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jkyhufx",
      "author": "None",
      "body": "We weren't allowed to sit with our legs hugged to our chest...apparently that burns more calories than sitting normally lol",
      "created_utc": 1684621308.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jky9smu",
      "author": "selkieflying",
      "body": "Crossing my legs, sitting on my legs, leg bouncing",
      "created_utc": 1684617585.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jkxvipk",
      "author": "Solal-King-Raccoon",
      "body": "Stand up. There were no more seats left in the « living room » of our PHP program. So we sat on the floor idk.",
      "created_utc": 1684611243.0,
      "score": 29,
      "context": []
    },
    {
      "id": "jkyok66",
      "author": "None",
      "body": "How I sat in chairs was relentlessly monitored; I had to use my autism to be allowed to sit criss-cross-apple-sauce, LOL.",
      "created_utc": 1684624535.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jkzc5vn",
      "author": "None",
      "body": "Literally stand. We had to sit at all times basically.",
      "created_utc": 1684636278.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jkyczdt",
      "author": "Evergreenpoppy",
      "body": "Stretch, tap my foot from anxiety, walk,",
      "created_utc": 1684619035.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jkz7iiw",
      "author": "sorcerers_apprentice",
      "body": "Make our beds, walk up stairs, carry text books across the school room, lie down on our sides (this last one may have been a body check thing though, unclear!)",
      "created_utc": 1684633958.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jkzbg7z",
      "author": "FallMedical",
      "body": "I wasn’t aloud to walk literally 2secs away from my wheel chair, couldn’t stand in the shower, or fidget (I have really bad anxiety and fidget toys and fidgeting just with my hands or legs is a way I cope)",
      "created_utc": 1684635920.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jkzn25n",
      "author": "dark_humor_to_cope",
      "body": "we weren’t allowed to wheel ourselves around in wheelchairs, even a few feet",
      "created_utc": 1684642073.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jl050ki",
      "author": "libertybells125",
      "body": "standing. Not even excessively but if i remember correctly, if you weren't sitting in a seat in the day room, you'd get called out. Couldn't even sit on the arm of a chair/couch. Even though there weren't enough seats for everyone to sit. And stretching. again, not excessively or anything remotely strenuous but a friend wanted to touch her toes. And she was \"corrected\". \n\nAnd don't even think about walking down a hallway unless it's mealtime lmao.",
      "created_utc": 1684654790.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jl0kich",
      "author": "YearConsistent2894",
      "body": "I wasn’t allowed to wear socks that don’t go above the ankle. That would burn too many calories. Also they told me not to think too much. That would take up too much energy either 💀",
      "created_utc": 1684667568.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jkzhbk9",
      "author": "petewentz-from-mcr",
      "body": "Chewing on my tongue!",
      "created_utc": 1684638844.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jkzq19v",
      "author": "rainspots",
      "body": "Eating standing up lmao",
      "created_utc": 1684643884.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jl09659",
      "author": "s0p16iiez",
      "body": "Anxiety shakes",
      "created_utc": 1684658270.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jl35r51",
      "author": "froggy_anarchist",
      "body": "All those comments about sitting, it’s like they want us to be uncomfortable. UW people have a hard time finding laying and sitting positions that don’t hurt so why restrict them from it?",
      "created_utc": 1684709901.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jl374cy",
      "author": "Unwanted-Pigeon",
      "body": "for shaking my legs, it’s just a general habit, OH AND WALKING TO THE BATHROOM",
      "created_utc": 1684710524.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jl6i93d",
      "author": "dulcelocura",
      "body": "I once got in trouble for stretching/rubbing my legs but ultimately got away with it because it truly wasn’t related to trying to burn calories. I would get awful leg pain that was nerve related and was even on meds for it. I was just like “I literally just asked for meds for this, just let me rub my own calf thanks”\nNot necessarily super surprising but stupid",
      "created_utc": 1684776181.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jl099uu",
      "author": "crunchyboiily",
      "body": "Honestly when i was admitted for a suicide attempt I got an GI tube cuz well i refused to eat at all. But they in general didn't give me any restrictions on exercise.",
      "created_utc": 1684658357.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jl0vred",
      "author": "thapug2023",
      "body": "I wasn't allowed to hold a journal or book, hold my arms up a bit while laying after eating for 1 hour",
      "created_utc": 1684674451.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jl11a5m",
      "author": "suetoniusaurus",
      "body": "I’m autistic & for me it was always stims/tics. I mean I get it but some of them are literally involuntary and nobody would fuckin believe me lol",
      "created_utc": 1684677216.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jl174kn",
      "author": "EmotionalTrash840",
      "body": "the walking thing is true i had to be wheelchaired to the toilet and back which was literally a few meters away 🤦‍♀️",
      "created_utc": 1684679872.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jl19zsi",
      "author": "prosciu",
      "body": "Won t allowed to put my fork down I always had to have it in my hands.and not cut the food in small portions",
      "created_utc": 1684681133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jl1h6d1",
      "author": "Significant_Trip_560",
      "body": "I wasn’t allowed to set the temperature before taking a shower cause if it’s too cold “I want to burn cals” and idk why too hot was bad lol. I was stuck with lukewarm and timed showers for 4 months",
      "created_utc": 1684684189.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jl1yoqj",
      "author": "Snorpan_",
      "body": "I wasn't allowed to lay down with my knees up. I had to lay as straight as possible...",
      "created_utc": 1684691462.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jl21jh7",
      "author": "psychgamer2014",
      "body": "Excessive limping. I have cerebral palsy, so I walk with a limp which apparently burns too many calories. I had to be pushed in a wheelchair if I wanted to go anywhere.",
      "created_utc": 1684692641.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jl2iy8i",
      "author": "Odd_Incident7140",
      "body": "Couldn’t sit on my knees. Crossing legs while sitting or sleeping. Being on tiptoes.Sleeping with my knees bent or folded. Standing if not going to grab something, or nurse/meds. Couldn’t walk between buildings (transport on golf cart) could walk outside my room (wheelchair)",
      "created_utc": 1684699961.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jl2u4zw",
      "author": "meladey",
      "body": "Couldn't move my weighted blanket. I just tried to move it off my bed and onto a chair not even a step away, I literally just turned my torso to set it down, and the camera person told me to stop.",
      "created_utc": 1684704727.0,
      "score": 1,
      "context": []
    },
    {
      "id": "joi65v9",
      "author": "coleisw4ck",
      "body": "When I was hospitalized with anorexia when I was 15 they said I couldn’t shake my leg. I wasn’t even doing it to burn calories I’m just autistic and need to move a lot/ jiggle my leg while sitting. It was super dumb and they didn’t help me at all",
      "created_utc": 1687030869.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k0lb84i",
      "author": "Rosietherider07",
      "body": "I remember when I was in hospital I wasn’t allowed to text as they thought it burnt to many calories?",
      "created_utc": 1694718475.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k3dnlwf",
      "author": "No_Armadillo469ttsp",
      "body": "Getting up to grab a game to bring to my table",
      "created_utc": 1696387946.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k3dnpd2",
      "author": "No_Armadillo469ttsp",
      "body": "Getting up to switch into a comfy chair",
      "created_utc": 1696387990.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jky1bas",
      "author": "manicpixietrainwreck",
      "body": "Question is how fast were you solving it for that to be a cause of concern?!!?",
      "created_utc": 1684613817.0,
      "score": 77,
      "context": [
        {
          "id": "jkxw2pz",
          "author": "Damage-heck",
          "body": "Wasn’t  allowed to solve my Rubik’s cube too fast",
          "created_utc": 1684611486.0
        }
      ]
    },
    {
      "id": "jkyprb4",
      "author": "Cokezerowh0re",
      "body": "Wtaf😭",
      "created_utc": 1684625113.0,
      "score": 27,
      "context": [
        {
          "id": "jkyllkl",
          "author": "xMariko",
          "body": "We had to do presentations and things like that, but weren't allowed to give applause so we had to count down from 3 to 1 and then do one short clap. Seemed a bit excessive",
          "created_utc": 1684623109.0
        }
      ]
    },
    {
      "id": "jkzvrne",
      "author": "firecat321",
      "body": "This is one of the most unhinged ED-related things I’ve ever heard. And that’s coming from someone with an extremely unhinged brain.",
      "created_utc": 1684647658.0,
      "score": 27,
      "context": [
        {
          "id": "jkyllkl",
          "author": "xMariko",
          "body": "We had to do presentations and things like that, but weren't allowed to give applause so we had to count down from 3 to 1 and then do one short clap. Seemed a bit excessive",
          "created_utc": 1684623109.0
        }
      ]
    },
    {
      "id": "jkzukhz",
      "author": "makeupyourworld",
      "body": "😂",
      "created_utc": 1684646812.0,
      "score": 5,
      "context": [
        {
          "id": "jkxu8e1",
          "author": "mili1002",
          "body": "Keep the window open at night because it burns more calories.",
          "created_utc": 1684610670.0
        }
      ]
    },
    {
      "id": "jkypikr",
      "author": "Cokezerowh0re",
      "body": "Im going to hell for laughing💀",
      "created_utc": 1684624996.0,
      "score": 41,
      "context": [
        {
          "id": "jky1ye6",
          "author": "AwayPineapple8074",
          "body": "One time a girl went on her tip toes to stretch and they thought she was doing calf raises so they cut her privileges for the day",
          "created_utc": 1684614091.0
        }
      ]
    },
    {
      "id": "jl10ql9",
      "author": "suetoniusaurus",
      "body": "Cutting privileges in treatment seems so fucked up to me I’m ngl, maybe in IP but I was in PHP, physically healthy/stable, and got my privileges cut for messing up at one meal (wasn’t even due to anorexia motivations, rather sensory issues) THE EFFECT OF WHICH WAS I wouldn’t be allowed to have half a day off to get dinner at a restaurant w/ my family to celebrate graduating high school. I was so excited for it and it seemed ridiculously counterproductive to stop me from going out to eat, I told them they could cut my privileges all they wanted I was going to dinner and if I had to withdraw myself from the program to do it I would. I was so mad and they kept trying to frame it as “we just thought you needed extra support” lmao",
      "created_utc": 1684676957.0,
      "score": 19,
      "context": [
        {
          "id": "jky1ye6",
          "author": "AwayPineapple8074",
          "body": "One time a girl went on her tip toes to stretch and they thought she was doing calf raises so they cut her privileges for the day",
          "created_utc": 1684614091.0
        }
      ]
    },
    {
      "id": "jkziows",
      "author": "katarina-stratford",
      "body": "Jokes on them elevators made me collapse because vertigo",
      "created_utc": 1684639580.0,
      "score": 12,
      "context": [
        {
          "id": "jkyazn6",
          "author": "tintedpink",
          "body": "The ED unit I was on had a rule to always use an elevator if there was one. We got to go outside and sit in the hospital yard once a day. We had to take the elevator down/up what was literally half a floor. There weren't even stairs, just a ramp. Pretty sure the extra feet we walked to get to the elevator burned more calories than walking up the shallow ramp would've.",
          "created_utc": 1684618125.0
        }
      ]
    },
    {
      "id": "jkz3umq",
      "author": "SieBanhus",
      "body": "I jiggle my foot CONSTANTLY, and I seriously almost exploded trying not to do it in the hospital. They eventually gave up because I would start doing it unconsciously so often",
      "created_utc": 1684632132.0,
      "score": 18,
      "context": [
        {
          "id": "jkynn2x",
          "author": "VirtualApricot",
          "body": "I was told I was crocheting too rigorously. \n\nBeing on full bed rest, no ability to do ANYTHING (not even watch TV!), and having ADD who has been a fidgeter my entire life, I was never so uncomfortable in my body I’m my entire life. All of it. Far too much. All at once.",
          "created_utc": 1684624095.0
        }
      ]
    },
    {
      "id": "jkzyktv",
      "author": "None",
      "body": "Why not TV?! How is that related 😭",
      "created_utc": 1684649737.0,
      "score": 3,
      "context": [
        {
          "id": "jkynn2x",
          "author": "VirtualApricot",
          "body": "I was told I was crocheting too rigorously. \n\nBeing on full bed rest, no ability to do ANYTHING (not even watch TV!), and having ADD who has been a fidgeter my entire life, I was never so uncomfortable in my body I’m my entire life. All of it. Far too much. All at once.",
          "created_utc": 1684624095.0
        }
      ]
    },
    {
      "id": "jl0ek7g",
      "author": "chickentittyenjoyer",
      "body": "omg yes “spicy food burns calories” ummm are you sure about that? pls relax",
      "created_utc": 1684662863.0,
      "score": 10,
      "context": [
        {
          "id": "jky2mbr",
          "author": "irokanshou",
          "body": "i was told not to put pepper on my food",
          "created_utc": 1684614382.0
        }
      ]
    },
    {
      "id": "jl1hc1z",
      "author": "Significant_Trip_560",
      "body": "For me it was vinegar for some reason",
      "created_utc": 1684684254.0,
      "score": 5,
      "context": [
        {
          "id": "jky2mbr",
          "author": "irokanshou",
          "body": "i was told not to put pepper on my food",
          "created_utc": 1684614382.0
        }
      ]
    },
    {
      "id": "kj628o0",
      "author": "techn0h0e",
      "body": "Lmao, this is funny considering I had to incorporate foods I actually enjoy eating in my recovery (I'm a slut for spicy food, so it helps me eat more tremendously.)",
      "created_utc": 1705996854.0,
      "score": 1,
      "context": [
        {
          "id": "jky2mbr",
          "author": "irokanshou",
          "body": "i was told not to put pepper on my food",
          "created_utc": 1684614382.0
        }
      ]
    },
    {
      "id": "jkzuhbp",
      "author": "makeupyourworld",
      "body": "This sent me",
      "created_utc": 1684646751.0,
      "score": 10,
      "context": [
        {
          "id": "jkylxut",
          "author": "gemmaparss",
          "body": "my camhs lady said i wasn’t allowed to talk with my hands as it was too much movement",
          "created_utc": 1684623270.0
        }
      ]
    },
    {
      "id": "jkyra5e",
      "author": "ConfidentStrength999",
      "body": "I went to a hospital like that. It really set a very negative tone about the idea of recovery when my admission was treated like a punishment (at the hospital I was at, they outright said that not being able to watch tv, etc was so that I could \"think about what I'd done\")",
      "created_utc": 1684625863.0,
      "score": 36,
      "context": [
        {
          "id": "jkypoxi",
          "author": "None",
          "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
          "created_utc": 1684625081.0
        }
      ]
    },
    {
      "id": "jl0emlu",
      "author": "chickentittyenjoyer",
      "body": "jokes on them; i could concentrate enough to read or write😂",
      "created_utc": 1684662918.0,
      "score": 3,
      "context": [
        {
          "id": "jkypoxi",
          "author": "None",
          "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
          "created_utc": 1684625081.0
        }
      ]
    },
    {
      "id": "jlughzt",
      "author": "Hedgehognoodle",
      "body": "Wtf, this reminds me of treatment for hysteria in the Victorian era",
      "created_utc": 1685209007.0,
      "score": 2,
      "context": [
        {
          "id": "jkypoxi",
          "author": "None",
          "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
          "created_utc": 1684625081.0
        }
      ]
    },
    {
      "id": "jl0w4ot",
      "author": "thapug2023",
      "body": "Yeah, that sucked for me. Bc I love drawing and I wasn't allowed to draw for like a month and then could only draw for an hour the next 3 months",
      "created_utc": 1684674644.0,
      "score": 1,
      "context": [
        {
          "id": "jkypoxi",
          "author": "None",
          "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
          "created_utc": 1684625081.0
        }
      ]
    },
    {
      "id": "jky1m9y",
      "author": "ThrowRA_1010100",
      "body": "That <| reminded me of this lol\n\n⊂_ヽ\n　 ＼＼ ＿\n　　 ＼(　•_•) F\n　　　 <　⌒ヽ A\n　　　/ 　 へ＼ B\n　　 /　　/　＼＼ U\n　　 ﾚ　ノ　　 ヽ_つ L\n　　/　/ O\n　 /　/| U\n　(　(ヽ S\n　|　|、＼\n　| 丿 ＼ ⌒)\n　| |　　) /\n`ノ )　　Lﾉ\n(_／",
      "created_utc": 1684613954.0,
      "score": 6,
      "context": [
        {
          "id": "jkxy5o4",
          "author": "bienshee",
          "body": "There was a pose called the “flamingo” at the place where I was at. Basically one leg standing while the other is < (kinda like this <|) lmao",
          "created_utc": 1684612406.0
        }
      ]
    },
    {
      "id": "jkzjr8f",
      "author": "uhhhhhhhhii",
      "body": "Crossing legs burns calories?",
      "created_utc": 1684640170.0,
      "score": 6,
      "context": [
        {
          "id": "jkybitx",
          "author": "cuteinferno",
          "body": "crossing legs while sitting, and i got in trouble for leaning into the mirror while brushing my teeth because i was “squatting” but my legs weren’t bent idk 🤷‍♀️",
          "created_utc": 1684618368.0
        }
      ]
    },
    {
      "id": "jkyptfp",
      "author": "Cokezerowh0re",
      "body": "I swear they’re just *teaching* us new behaviours..",
      "created_utc": 1684625144.0,
      "score": 44,
      "context": [
        {
          "id": "jkyhufx",
          "author": "None",
          "body": "We weren't allowed to sit with our legs hugged to our chest...apparently that burns more calories than sitting normally lol",
          "created_utc": 1684621308.0
        }
      ]
    },
    {
      "id": "jl0i1me",
      "author": "Maya__naise",
      "body": "Oml! I sleep on my side! ⊙︿⊙",
      "created_utc": 1684665713.0,
      "score": 1,
      "context": [
        {
          "id": "jkz7iiw",
          "author": "sorcerers_apprentice",
          "body": "Make our beds, walk up stairs, carry text books across the school room, lie down on our sides (this last one may have been a body check thing though, unclear!)",
          "created_utc": 1684633958.0
        }
      ]
    },
    {
      "id": "jl0w9jm",
      "author": "thapug2023",
      "body": "Why would you eat standing up tho",
      "created_utc": 1684674715.0,
      "score": 0,
      "context": [
        {
          "id": "jkzq19v",
          "author": "rainspots",
          "body": "Eating standing up lmao",
          "created_utc": 1684643884.0
        }
      ]
    },
    {
      "id": "jky1epu",
      "author": "ThrowRA_1010100",
      "body": "*sonic music plays*",
      "created_utc": 1684613859.0,
      "score": 53,
      "context": [
        {
          "id": "jkxw2pz",
          "author": "Damage-heck",
          "body": "Wasn’t  allowed to solve my Rubik’s cube too fast",
          "created_utc": 1684611486.0
        },
        {
          "id": "jky1bas",
          "author": "manicpixietrainwreck",
          "body": "Question is how fast were you solving it for that to be a cause of concern?!!?",
          "created_utc": 1684613817.0
        }
      ]
    },
    {
      "id": "jl5emtj",
      "author": "Tajskskskss",
      "body": "I got so mad while reading your comment and I’m really glad you insisted anyway because that’s wild. Imagine telling someone they aren’t allowed to go out for a graduation dinner with their family because… they have an eating disorder. Like wtf",
      "created_utc": 1684759719.0,
      "score": 5,
      "context": [
        {
          "id": "jky1ye6",
          "author": "AwayPineapple8074",
          "body": "One time a girl went on her tip toes to stretch and they thought she was doing calf raises so they cut her privileges for the day",
          "created_utc": 1684614091.0
        },
        {
          "id": "jl10ql9",
          "author": "suetoniusaurus",
          "body": "Cutting privileges in treatment seems so fucked up to me I’m ngl, maybe in IP but I was in PHP, physically healthy/stable, and got my privileges cut for messing up at one meal (wasn’t even due to anorexia motivations, rather sensory issues) THE EFFECT OF WHICH WAS I wouldn’t be allowed to have half a day off to get dinner at a restaurant w/ my family to celebrate graduating high school. I was so excited for it and it seemed ridiculously counterproductive to stop me from going out to eat, I told them they could cut my privileges all they wanted I was going to dinner and if I had to withdraw myself from the program to do it I would. I was so mad and they kept trying to frame it as “we just thought you needed extra support” lmao",
          "created_utc": 1684676957.0
        }
      ]
    },
    {
      "id": "jkz84pm",
      "author": "VirtualApricot",
      "body": "I’m constantly rocking or jiggling or doing something repetitive with my hands (Dx both ADD and ASD) so. The movement restriction was just. Impossible.",
      "created_utc": 1684634273.0,
      "score": 8,
      "context": [
        {
          "id": "jkynn2x",
          "author": "VirtualApricot",
          "body": "I was told I was crocheting too rigorously. \n\nBeing on full bed rest, no ability to do ANYTHING (not even watch TV!), and having ADD who has been a fidgeter my entire life, I was never so uncomfortable in my body I’m my entire life. All of it. Far too much. All at once.",
          "created_utc": 1684624095.0
        },
        {
          "id": "jkz3umq",
          "author": "SieBanhus",
          "body": "I jiggle my foot CONSTANTLY, and I seriously almost exploded trying not to do it in the hospital. They eventually gave up because I would start doing it unconsciously so often",
          "created_utc": 1684632132.0
        }
      ]
    },
    {
      "id": "jm6t1qm",
      "author": "gemmaparss",
      "body": "i wish it was a joke 😭",
      "created_utc": 1685446011.0,
      "score": 1,
      "context": [
        {
          "id": "jkylxut",
          "author": "gemmaparss",
          "body": "my camhs lady said i wasn’t allowed to talk with my hands as it was too much movement",
          "created_utc": 1684623270.0
        },
        {
          "id": "jkzuhbp",
          "author": "makeupyourworld",
          "body": "This sent me",
          "created_utc": 1684646751.0
        }
      ]
    },
    {
      "id": "jl07q7n",
      "author": "soynugget95",
      "body": "100% controlling movement is about punishment and control of patients. Writing or fidgeting or walking up a ramp or whatever the fuck doesn’t burn that many calories. The places that I was at when I had my ED that did this were abusive as hell and it makes no logical sense. They’re doing it so that you know they’re in charge.",
      "created_utc": 1684657048.0,
      "score": 9,
      "context": [
        {
          "id": "jkypoxi",
          "author": "None",
          "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
          "created_utc": 1684625081.0
        },
        {
          "id": "jkyra5e",
          "author": "ConfidentStrength999",
          "body": "I went to a hospital like that. It really set a very negative tone about the idea of recovery when my admission was treated like a punishment (at the hospital I was at, they outright said that not being able to watch tv, etc was so that I could \"think about what I'd done\")",
          "created_utc": 1684625863.0
        }
      ]
    },
    {
      "id": "jl02orn",
      "author": "Enthirl",
      "body": "That’s just awful.",
      "created_utc": 1684652918.0,
      "score": 2,
      "context": [
        {
          "id": "jkypoxi",
          "author": "None",
          "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
          "created_utc": 1684625081.0
        },
        {
          "id": "jkyra5e",
          "author": "ConfidentStrength999",
          "body": "I went to a hospital like that. It really set a very negative tone about the idea of recovery when my admission was treated like a punishment (at the hospital I was at, they outright said that not being able to watch tv, etc was so that I could \"think about what I'd done\")",
          "created_utc": 1684625863.0
        }
      ]
    },
    {
      "id": "jl0hto0",
      "author": "Maya__naise",
      "body": "That's actually wrong! I'm so sorry they shamed and guilted you like that! ❤️",
      "created_utc": 1684665539.0,
      "score": 1,
      "context": [
        {
          "id": "jkypoxi",
          "author": "None",
          "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
          "created_utc": 1684625081.0
        },
        {
          "id": "jkyra5e",
          "author": "ConfidentStrength999",
          "body": "I went to a hospital like that. It really set a very negative tone about the idea of recovery when my admission was treated like a punishment (at the hospital I was at, they outright said that not being able to watch tv, etc was so that I could \"think about what I'd done\")",
          "created_utc": 1684625863.0
        }
      ]
    },
    {
      "id": "jky1n83",
      "author": "ThrowRA_1010100",
      "body": "Well damn...",
      "created_utc": 1684613966.0,
      "score": 16,
      "context": [
        {
          "id": "jkxy5o4",
          "author": "bienshee",
          "body": "There was a pose called the “flamingo” at the place where I was at. Basically one leg standing while the other is < (kinda like this <|) lmao",
          "created_utc": 1684612406.0
        },
        {
          "id": "jky1m9y",
          "author": "ThrowRA_1010100",
          "body": "That <| reminded me of this lol\n\n⊂_ヽ\n　 ＼＼ ＿\n　　 ＼(　•_•) F\n　　　 <　⌒ヽ A\n　　　/ 　 へ＼ B\n　　 /　　/　＼＼ U\n　　 ﾚ　ノ　　 ヽ_つ L\n　　/　/ O\n　 /　/| U\n　(　(ヽ S\n　|　|、＼\n　| 丿 ＼ ⌒)\n　| |　　) /\n`ノ )　　Lﾉ\n(_／",
          "created_utc": 1684613954.0
        }
      ]
    },
    {
      "id": "jl0mmt2",
      "author": "ConfidentStrength999",
      "body": "Pretty ironic that we're always told we're the ones with control issues, but they're the ones trying to tell people they can't fidget (or something equally petty).  Agreed, this place was abusive af and traumatized me.  So many of the doctors I met there (and in ED treatment overall) were on a massive powertrip and desperate to prove they were in charge and to feel powerful over me, an already powerless 16 year old (at the time). It was pathetic. The rules had nothing to do with my safety and everything to do with a need to control, micro-manage, punish and feel powerful.",
      "created_utc": 1684669036.0,
      "score": 6,
      "context": [
        {
          "id": "jkypoxi",
          "author": "None",
          "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
          "created_utc": 1684625081.0
        },
        {
          "id": "jkyra5e",
          "author": "ConfidentStrength999",
          "body": "I went to a hospital like that. It really set a very negative tone about the idea of recovery when my admission was treated like a punishment (at the hospital I was at, they outright said that not being able to watch tv, etc was so that I could \"think about what I'd done\")",
          "created_utc": 1684625863.0
        },
        {
          "id": "jl07q7n",
          "author": "soynugget95",
          "body": "100% controlling movement is about punishment and control of patients. Writing or fidgeting or walking up a ramp or whatever the fuck doesn’t burn that many calories. The places that I was at when I had my ED that did this were abusive as hell and it makes no logical sense. They’re doing it so that you know they’re in charge.",
          "created_utc": 1684657048.0
        }
      ]
    },
    {
      "id": "jl0yap9",
      "author": "General_Clownery",
      "body": "I've been in one place that was abusive, at the institutional level. There was only one staff member who was an outright sadist: an egregious bully both to patients and to any staff junior to her, and an obsequious bootlicker to anyone more senior, as bullies so often are. But their policies were essentially a prison system.",
      "created_utc": 1684675759.0,
      "score": 3,
      "context": [
        {
          "id": "jkypoxi",
          "author": "None",
          "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
          "created_utc": 1684625081.0
        },
        {
          "id": "jkyra5e",
          "author": "ConfidentStrength999",
          "body": "I went to a hospital like that. It really set a very negative tone about the idea of recovery when my admission was treated like a punishment (at the hospital I was at, they outright said that not being able to watch tv, etc was so that I could \"think about what I'd done\")",
          "created_utc": 1684625863.0
        },
        {
          "id": "jl07q7n",
          "author": "soynugget95",
          "body": "100% controlling movement is about punishment and control of patients. Writing or fidgeting or walking up a ramp or whatever the fuck doesn’t burn that many calories. The places that I was at when I had my ED that did this were abusive as hell and it makes no logical sense. They’re doing it so that you know they’re in charge.",
          "created_utc": 1684657048.0
        }
      ]
    },
    {
      "id": "jl0mos9",
      "author": "ConfidentStrength999",
      "body": "Thank you <3",
      "created_utc": 1684669072.0,
      "score": 2,
      "context": [
        {
          "id": "jkypoxi",
          "author": "None",
          "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
          "created_utc": 1684625081.0
        },
        {
          "id": "jkyra5e",
          "author": "ConfidentStrength999",
          "body": "I went to a hospital like that. It really set a very negative tone about the idea of recovery when my admission was treated like a punishment (at the hospital I was at, they outright said that not being able to watch tv, etc was so that I could \"think about what I'd done\")",
          "created_utc": 1684625863.0
        },
        {
          "id": "jl0hto0",
          "author": "Maya__naise",
          "body": "That's actually wrong! I'm so sorry they shamed and guilted you like that! ❤️",
          "created_utc": 1684665539.0
        }
      ]
    },
    {
      "id": "jl2bwmt",
      "author": "soynugget95",
      "body": "Yes! I knew a twelve year old girl who was locked in solitary for 14 hours because she stood up without permission a few times. They wouldn’t even let her use the bathroom. They also liked to use food as a punishment - they would Boost you if you moved without permission, and they said it was to “make up the calories”, but crossing your arms without asking first doesn’t burn anything. Nothing about punishing children with food is good! That’s not building a healthy relationship with food, that’s making children fear it even more so that you can feel powerful for a minute.\n\nAlso, when I was a minor and in ED treatment, the adults loved making us strip for basically anything - weight checks, self harm checks, medical exams, anything. I get it for weight checks but it’s not generally necessary and as a csa survivor (literally the reason I had an ed lmao) it was so actively harmful. They did it to power trip 100%. Thy didn’t even do real therapy, they just had us walk around in a circle with a bead in our sock, holding a feather, so that we could focus on how “nice the feather felt” and “learn to ignore the negative” (ie, the bead). I swear to god you can’t make that shit up.\n\nEverything about most programs aimed at treating EDs in kids is bad. When I was 18-turning-19 I went to a good place for adults that changed my life and I’ve been chilling ever since (though I occasionally lurk in these subs… should probably stop lol), but when I was younger the treatment was awful. And they all convince your parents that if you say it’s abusive, that’s your “anorexia talking”. Deadass the place I went told parents that when kids complain about the treatment, it’s because “The Anorexia™️” is fighting the treatment and that “your *real* child” is there on the inside, happy to be getting their help. If you put that shit in any other context it would obviously be abusive, but people ignore it when it’s happening to mentally ill children.",
      "created_utc": 1684696964.0,
      "score": 4,
      "context": [
        {
          "id": "jkypoxi",
          "author": "None",
          "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
          "created_utc": 1684625081.0
        },
        {
          "id": "jkyra5e",
          "author": "ConfidentStrength999",
          "body": "I went to a hospital like that. It really set a very negative tone about the idea of recovery when my admission was treated like a punishment (at the hospital I was at, they outright said that not being able to watch tv, etc was so that I could \"think about what I'd done\")",
          "created_utc": 1684625863.0
        },
        {
          "id": "jl07q7n",
          "author": "soynugget95",
          "body": "100% controlling movement is about punishment and control of patients. Writing or fidgeting or walking up a ramp or whatever the fuck doesn’t burn that many calories. The places that I was at when I had my ED that did this were abusive as hell and it makes no logical sense. They’re doing it so that you know they’re in charge.",
          "created_utc": 1684657048.0
        },
        {
          "id": "jl0mmt2",
          "author": "ConfidentStrength999",
          "body": "Pretty ironic that we're always told we're the ones with control issues, but they're the ones trying to tell people they can't fidget (or something equally petty).  Agreed, this place was abusive af and traumatized me.  So many of the doctors I met there (and in ED treatment overall) were on a massive powertrip and desperate to prove they were in charge and to feel powerful over me, an already powerless 16 year old (at the time). It was pathetic. The rules had nothing to do with my safety and everything to do with a need to control, micro-manage, punish and feel powerful.",
          "created_utc": 1684669036.0
        }
      ]
    },
    {
      "id": "jlhh23m",
      "author": "ConfidentStrength999",
      "body": "That is so horrifying - I'm so sorry.  Solitary should only ever be used if the person is a danger to people around them.  There's no need for that for a twelve year old.\n\nSo many of the things about treatment really came down to exactly what you said: so someone could feel powerful for a minute.  It's so sickening.\n\nYou really couldn't even make up that bead/feather story - the sad excuses for \"therapy\" they presented were awful. I remember one \"therapy\" exercise i had to do was to illustrate in a specific way how big I thought my waist was, and then they showed me the reality! And I got to keep the comparison! (Of course all I ever did with this was use this to body check and see if my waist was as small as when I was in the hospital).\n\nSimilar for me - when I was 17 I went to Renfrew and was in the adult building, and it was SO MUCH better. It was still shit, but it wasn't as degrading and condescending and traumatizing as the hospital program.\n\nAnd I HATED the \"that's the anorexia talking\" thing! They said the same shit at the hospital I was at.  It made me feel even more like I wasn't heard, didn't matter, and didn't have a voice, and of course you know how I coped with those feelings? Anorexia, of course.\n\nSo much of treatment for mental illness (esp for children) is straight up abuse and I hope that at some point its recognized as exactly that.",
      "created_utc": 1684965254.0,
      "score": 1,
      "context": [
        {
          "id": "jkypoxi",
          "author": "None",
          "body": "I work at a hospital that often has patients with EDs and they don’t let them read, draw or write at the beginning of their admission",
          "created_utc": 1684625081.0
        },
        {
          "id": "jkyra5e",
          "author": "ConfidentStrength999",
          "body": "I went to a hospital like that. It really set a very negative tone about the idea of recovery when my admission was treated like a punishment (at the hospital I was at, they outright said that not being able to watch tv, etc was so that I could \"think about what I'd done\")",
          "created_utc": 1684625863.0
        },
        {
          "id": "jl07q7n",
          "author": "soynugget95",
          "body": "100% controlling movement is about punishment and control of patients. Writing or fidgeting or walking up a ramp or whatever the fuck doesn’t burn that many calories. The places that I was at when I had my ED that did this were abusive as hell and it makes no logical sense. They’re doing it so that you know they’re in charge.",
          "created_utc": 1684657048.0
        },
        {
          "id": "jl0mmt2",
          "author": "ConfidentStrength999",
          "body": "Pretty ironic that we're always told we're the ones with control issues, but they're the ones trying to tell people they can't fidget (or something equally petty).  Agreed, this place was abusive af and traumatized me.  So many of the doctors I met there (and in ED treatment overall) were on a massive powertrip and desperate to prove they were in charge and to feel powerful over me, an already powerless 16 year old (at the time). It was pathetic. The rules had nothing to do with my safety and everything to do with a need to control, micro-manage, punish and feel powerful.",
          "created_utc": 1684669036.0
        },
        {
          "id": "jl2bwmt",
          "author": "soynugget95",
          "body": "Yes! I knew a twelve year old girl who was locked in solitary for 14 hours because she stood up without permission a few times. They wouldn’t even let her use the bathroom. They also liked to use food as a punishment - they would Boost you if you moved without permission, and they said it was to “make up the calories”, but crossing your arms without asking first doesn’t burn anything. Nothing about punishing children with food is good! That’s not building a healthy relationship with food, that’s making children fear it even more so that you can feel powerful for a minute.\n\nAlso, when I was a minor and in ED treatment, the adults loved making us strip for basically anything - weight checks, self harm checks, medical exams, anything. I get it for weight checks but it’s not generally necessary and as a csa survivor (literally the reason I had an ed lmao) it was so actively harmful. They did it to power trip 100%. Thy didn’t even do real therapy, they just had us walk around in a circle with a bead in our sock, holding a feather, so that we could focus on how “nice the feather felt” and “learn to ignore the negative” (ie, the bead). I swear to god you can’t make that shit up.\n\nEverything about most programs aimed at treating EDs in kids is bad. When I was 18-turning-19 I went to a good place for adults that changed my life and I’ve been chilling ever since (though I occasionally lurk in these subs… should probably stop lol), but when I was younger the treatment was awful. And they all convince your parents that if you say it’s abusive, that’s your “anorexia talking”. Deadass the place I went told parents that when kids complain about the treatment, it’s because “The Anorexia™️” is fighting the treatment and that “your *real* child” is there on the inside, happy to be getting their help. If you put that shit in any other context it would obviously be abusive, but people ignore it when it’s happening to mentally ill children.",
          "created_utc": 1684696964.0
        }
      ]
    }
  ]
}