{
  "id": "13qttgg",
  "subreddit": "AnorexiaNervosa",
  "author": "Shadowed-Heart",
  "created_utc": 1684953587.0,
  "title": "Have some sympathy or get out.",
  "selftext": "This is a post dedicated to all those that think vent posts are pro-ana, bragging, unnecessary, stupid, or otherwise unsavory, and feel the need to belittle, ostracize, insult, \"harsh truth\", and be dicks about it. \n\nFirst off, you're wrong. Venting is encouraged and welcomed here, and does not break the subreddit's rules (unless it does). This is a fucking horrible disease where everyone experiences some of the same things, but also a lot of different things than someone else does. Those experiences aren't pleasant, they're probably not SFW, they're triggering. Amd that's okay, because people are allowed to vent about their problems, even if they don't want help. \n\nIf you don't like someone's vent, don't comment. If you want to comment because you don't like someone's vent, but are going to give them \"harsh truth advice\", mock them, belittle them, insult them, invalidate them, or anything else that is otherwise unsupportive, don't fucking comment. \n\nThis ENTIRE subreddit is under a trigger warning. It always has been, it always will be. Anorexia is a triggering subject. If you can't handle seeing triggering vents from people in the thick of it, ignore it and move on. If you can't handle seeing vents and can't control your urges to comment hate-filled, nonproductive, unsupportive things, this isn't the place for you and I'll escort you to the permanently closed door myself. \n\nI'm sick of it, and I'm not the only one. This is a support community. The amount of arguments, insults, unsupportive and outright *mean* comments I've had to remove just last night is unacceptable. This is not who we are as a community and I refuse to let this place go to the freaking dogs because a couple of you can't keep your unsympathetic mouths shut. \n\nWhile I can't control what people upvote or downvote, I DO control what gets removed and who gets permanently banned. Upvoting someone who's being an asshole makes YOU also an asshole, and downvoting those that come here for support and relatablity makes you a dick. \n\nGuys, this isn't highschool. The mean girls don't rule the school. The assholes are in the minority here, and the supportive community is in the majority. Don't stop posting here because of the people that decide they want to be dicks. The moderators have your back. If you see someone being a dick, report it. If you respond, make sure you're not breaking the rules or insulting them back, or your comment will be removed along with theirs. We can band together and *change*. We can drive out the people that aren't here to be supportive. We've done it before in the past, we can do it now. \n\nIf you don't have anything nice to say, shut the fuck up and don't say anything at all. If people start arguing in the comments, I'll lock the post and they can redirect their arguments into modmail where I'll be happy to converse with them. \n\nSincerely, a mod who's just about had it with those in the community that can't stop being dicks to others.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/13qttgg/have_some_sympathy_or_get_out/",
  "score": 627,
  "num_comments": 27,
  "comments": [
    {
      "id": "jlgmqcd",
      "author": "Shadowed-Heart",
      "body": "We aren't a place only for those in recovery, and we will not shame those that come here for non-recovery related support. If you think someone is breaking rule one or any other rules, report it and move on. We accept everyone here, even those without EDs, and we will not shame people.",
      "created_utc": 1684953905.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jlgojq4",
      "author": "anonomomamam",
      "body": "I am not lying when I say I couldn't read the whole post in one go because I ended up crying. Yesterday was just horrible, I thought I actually did something wrong. I react to comments and votes and I question if I am doing something harmful or not, but you're right, not everyone who comments and votes is nice about it. I shouldn't focuss on them, but I still want to keep an open mind about my actions by relying on what other people think. It's just so hard to know when everyone has a different thought about things. I hope people will be less scared to vent here and actually feel safe to talk about their problems. Not everyone has support and help and not everyone can have support and help, even if they want to and it's horrible how some people have been harassing others for having problems from anorexia \n\nI still think I reacted wrong, I still feel guilt, I still feel horrible for what I have said despite being told what I did was reasonable. I don't know why I feel this way but- *sigh* I feel lifted up by so many people and being hugged, given support, I honestly don't know what to say. I want to say thank you infinity times to you and those who have been supportive. I really cannot thank you guys enough ❤️‍🩹🫂",
      "created_utc": 1684954580.0,
      "score": 58,
      "context": []
    },
    {
      "id": "jlhi1t9",
      "author": "ConfidentStrength999",
      "body": "Right - this is a community for people who are struggling, whether in recovery or not.  People have every right to vent and look for support, kindness and community here.  There is a difference between pro-ana content and posting about experiences as a person who is not in recovery.  Everyone deserves to feel welcomed and respected",
      "created_utc": 1684965647.0,
      "score": 32,
      "context": []
    },
    {
      "id": "jlhwutj",
      "author": "thrxwxxx",
      "body": "thank you so so much for this. it crushes me how harsh people are. nobody treats those suffering from depression or anxiety this way",
      "created_utc": 1684971916.0,
      "score": 26,
      "context": []
    },
    {
      "id": "jlgw2ti",
      "author": "0074390",
      "body": "There have been a lot of unhelpful and dismissive comments on here recently, especially on vent posts. This is a place for everyone who is effected by Anorexia; those who are recovered and those who aren’t. We aren’t here to pass judgment, this is supposed to be a place where people support each other. Vent posts aren’t for everyone so if they bother you please just ignore them (it’s what flares are for). anorexia is a really isolating illness and not everyone has support from people in their lives so please try to be understanding and kind. Everyone is welcome here as long as they’re respectful and follow the rules.\n\nAlso it would be a great help to everyone if you can ensure your posts are flared correctly and trigger warnings are used when necessary.",
      "created_utc": 1684957386.0,
      "score": 38,
      "context": []
    },
    {
      "id": "jlhsfv3",
      "author": "neet5500",
      "body": "Everyone is \"logical\" until they themselves experience the difficulty. We don't know what others have been through nor their circumstances. Its easy to dismiss/downplay someone while giving them advice not knowing that complexities they may face. We really need to promote positive vibes as a community.",
      "created_utc": 1684969974.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jlj4xdz",
      "author": "schuylersisters-",
      "body": "GOD I wish I could send this to everyone I know",
      "created_utc": 1684994540.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jlh9vwe",
      "author": "ThrowRA_1010100",
      "body": "I didnt expect this post at all, thats amazing 🩵 Is this a new rule or what kind of announcement is this? What changes will there be if there will be? (⁠ ⁠╹o╹⁠ ⁠)~?",
      "created_utc": 1684962547.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jn0561w",
      "author": "Individual_Resort_38",
      "body": "Thanks so much saying this aloud to everyone. I felt very much welcome here no matter what I said. I think harm reduction is so important for so many of us when recovery is just not possible atm, and being able to talk about your issues while dealing with this disorder is extremely helpful. A million thanks !",
      "created_utc": 1685981248.0,
      "score": 6,
      "context": []
    },
    {
      "id": "josmyjh",
      "author": "anastasia_bytheriver",
      "body": " only eat because of this community —- even if I don’t want to . \\\\\\ thank you . <3 months\n\nnice to know relatable experiences always 😇",
      "created_utc": 1687236671.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jlglvjm",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1684953587.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l5qh4g7",
      "author": "Panickedbeans",
      "body": "The thing about your internet exposure, is you have to make your own boundaries. You have to be in charge of you. In a subreddit designated to something possibly triggering, you are your own mod. Be mindful, and take care of yourself.",
      "created_utc": 1716725646.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l9us2uj",
      "author": "Responsible_Poet3516",
      "body": "Just got downvoted for saying there are no doctors offices near me taking patients until July.  I almost deleted everything and left this community . Thank you for this post. ",
      "created_utc": 1719112641.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4o7irz",
      "author": "Tricky_Badger_2071",
      "body": "This means a lot <3",
      "created_utc": 1735639685.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mj7tsn6",
      "author": "zodiacqu33n",
      "body": "Omg thx I already love it here :’)))",
      "created_utc": 1742681802.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l416vij",
      "author": "merrybelletrist",
      "body": "I tired of saying I'm sorry.",
      "created_utc": 1715708423.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kzsnrex",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1713249894.0,
      "score": 0,
      "context": []
    },
    {
      "id": "jlgsiul",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1684956077.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jnzj427",
      "author": "None",
      "body": "You're absolutely right.",
      "created_utc": 1686658475.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jr6ox1v",
      "author": "9a1g3",
      "body": "Thank you! I appreciate this so so much! 🥹😭",
      "created_utc": 1688843151.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jlguaz2",
      "author": "Shadowed-Heart",
      "body": "Ah, our first round or reports! We are participating in pro-ed behaviors here, y'all! I had no idea that accepting people in all stages of recovery or non-recovery was on par with asking how to lose weight or asking for ana buddies. \n\n&#x200B;\n\nAlso... what do people think they're going to accomplish by reporting a moderator?",
      "created_utc": 1684956734.0,
      "score": 28,
      "context": [
        {
          "id": "jlgmqcd",
          "author": "Shadowed-Heart",
          "body": "We aren't a place only for those in recovery, and we will not shame those that come here for non-recovery related support. If you think someone is breaking rule one or any other rules, report it and move on. We accept everyone here, even those without EDs, and we will not shame people.",
          "created_utc": 1684953905.0
        }
      ]
    },
    {
      "id": "jpxbscp",
      "author": "weirdbirdboy0",
      "body": "I was scared I wasn’t allowed here at first because I haven’t been diagnosed and my therapist says I don’t want to do anything about my issues because then they become real to me so I’m kinda denying the thought of me having bulimia. I just want to hear if anyone else have similar thoughts so I can feel less scared of myself and face the truth :,)",
      "created_utc": 1687995258.0,
      "score": 8,
      "context": [
        {
          "id": "jlgmqcd",
          "author": "Shadowed-Heart",
          "body": "We aren't a place only for those in recovery, and we will not shame those that come here for non-recovery related support. If you think someone is breaking rule one or any other rules, report it and move on. We accept everyone here, even those without EDs, and we will not shame people.",
          "created_utc": 1684953905.0
        }
      ]
    },
    {
      "id": "jlhhxyd",
      "author": "Shadowed-Heart",
      "body": "This is an announcement post designed to try and bring the good parts of the community together in aiding to banish the bad. We've gotten tired of the toxic users trying to spread their toxicity here in a safe place, and a couple comments on posts wasn't cutting it and a dedicated post about it was necessary. Nothing is set in stone and this isn't a rule (because rule three already encompasses people trying to be dicks to other people), but our hope is that this will help us band the community together to counteract those that are trying to spread negativity and toxicity.",
      "created_utc": 1684965605.0,
      "score": 12,
      "context": [
        {
          "id": "jlh9vwe",
          "author": "ThrowRA_1010100",
          "body": "I didnt expect this post at all, thats amazing 🩵 Is this a new rule or what kind of announcement is this? What changes will there be if there will be? (⁠ ⁠╹o╹⁠ ⁠)~?",
          "created_utc": 1684962547.0
        }
      ]
    },
    {
      "id": "kzu03wi",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1713277102.0,
      "score": 1,
      "context": [
        {
          "id": "kzsnrex",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1713249894.0
        }
      ]
    },
    {
      "id": "jlgtabw",
      "author": "Shadowed-Heart",
      "body": "Yes it exists, but ir's by far smaller than ours and the moderators all have been inactive for a year+. I don't recommend it really.",
      "created_utc": 1684956355.0,
      "score": 4,
      "context": [
        {
          "id": "jlgsiul",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1684956077.0
        }
      ]
    },
    {
      "id": "jlh3ur7",
      "author": "None",
      "body": "What do they expect? A subreddit to have rules made just for them? They should read the rules beforehand and decide wether they want to be here or not, it's not that hard 🤣 Youre doing this with the best of intentions and I have much respect to see you and other people being vocal about this situation. \n\nPeople reporting: NO, VENTING ABOUT WHAT THEYRE GOING THROUGH WITH ANOREXIA IS WRONG AND IT IS *TOOOOOTALLY* THE SAME AS PRO ANA!!! IT'S ANNOYING!! UGH, EVERYONE SHOULD BE RECOVERING INSINUATING THAT ANOREXIA IS EASY TO RECOVER FROM!!! 😡🤬😤🫨",
      "created_utc": 1684960278.0,
      "score": 18,
      "context": [
        {
          "id": "jlgmqcd",
          "author": "Shadowed-Heart",
          "body": "We aren't a place only for those in recovery, and we will not shame those that come here for non-recovery related support. If you think someone is breaking rule one or any other rules, report it and move on. We accept everyone here, even those without EDs, and we will not shame people.",
          "created_utc": 1684953905.0
        },
        {
          "id": "jlguaz2",
          "author": "Shadowed-Heart",
          "body": "Ah, our first round or reports! We are participating in pro-ed behaviors here, y'all! I had no idea that accepting people in all stages of recovery or non-recovery was on par with asking how to lose weight or asking for ana buddies. \n\n&#x200B;\n\nAlso... what do people think they're going to accomplish by reporting a moderator?",
          "created_utc": 1684956734.0
        }
      ]
    },
    {
      "id": "jytugk1",
      "author": "neopronoun_dropper",
      "body": "You are totally allowed here. It takes a long time for a lot of people to get through the various stages of being ready to recover. I’m a fully recovered anorexic. I’m completely comfortable being here, and waiting for people to get to a stage in recovery that they finally see what they need to do.\n\nWith Bulimia and Binge-Eating Disorder, the problem really comes down to the same core issue, recurrent surges of dopamine that cause you to have out of control episodes of eating a lot in a short period of time. If you binge-eat at least once a week, plain and simple, you definitely have one of these conditions (or night eating syndrome, but that’s similar and not the point). It can be a source of a lot of shame and turmoil to deal with these kinds of episodes, and there are people out there that can help you regain control, if you ever decide you want to. There’s also a variety of antidepressants that can help you. The second issue in Bulimia is that you damage your body, because you have difficulty reconciling with the consequences of your binges, leading to tearing of the digestive organs, swelling around the throat, electrolyte imbalances, blisters on the fingers, hair loss, tooth damage, and all sorts of additional issues related to the compensatory behaviors. Bulimia is in fact an invisible and very dangerous mental health condition that can be treated.",
      "created_utc": 1693673198.0,
      "score": 4,
      "context": [
        {
          "id": "jlgmqcd",
          "author": "Shadowed-Heart",
          "body": "We aren't a place only for those in recovery, and we will not shame those that come here for non-recovery related support. If you think someone is breaking rule one or any other rules, report it and move on. We accept everyone here, even those without EDs, and we will not shame people.",
          "created_utc": 1684953905.0
        },
        {
          "id": "jpxbscp",
          "author": "weirdbirdboy0",
          "body": "I was scared I wasn’t allowed here at first because I haven’t been diagnosed and my therapist says I don’t want to do anything about my issues because then they become real to me so I’m kinda denying the thought of me having bulimia. I just want to hear if anyone else have similar thoughts so I can feel less scared of myself and face the truth :,)",
          "created_utc": 1687995258.0
        }
      ]
    }
  ]
}