{
  "id": "13u01i3",
  "subreddit": "AnorexiaNervosa",
  "author": "anonomomamam",
  "created_utc": 1685279192.0,
  "title": "Why are people with anorexia treated so horribly?",
  "selftext": "I see posts about people struggling with anorexia being treated horribly at ERS, hospitals, wards, like when it comes to recovery or simply just being there for different reasons. They are forced, they are timed, neglected, punished, traumatized. Why is it this way? I am so disgusted. Are they given some kind of contract on how they will be treated? I highly doubt it, it's terrifying and abusive\n\nEdit: I am already disgusted again",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/13u01i3/why_are_people_with_anorexia_treated_so_horribly/",
  "score": 147,
  "num_comments": 54,
  "comments": [
    {
      "id": "jlxtumh",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1685279192.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jlxvggh",
      "author": "moonshadowwww16",
      "body": "I think people don't take us seriously, like - they don't think we're seriously ill. They think we're deliberately choosing to do this for whatever reason. All in all, I think it comes from ignorance on eating disorders",
      "created_utc": 1685280037.0,
      "score": 119,
      "context": []
    },
    {
      "id": "jlykavi",
      "author": "puppyface22",
      "body": "People don’t understand AN. At all.",
      "created_utc": 1685290970.0,
      "score": 37,
      "context": []
    },
    {
      "id": "jly641v",
      "author": "MountainStrategy8390",
      "body": "Inpatient treatment centers are a type of total institution where the staff have absolute control over pretty much every aspect of your life. That both attracts an abusive personality who enjoys having access to that kind of power and it brings out those tendencies in others. Especially when staff are underpaid or have poor work conditions they may turn to “taking it out” on inpatients.\n\n… of course, once this starts to happen the inpatients learn to see staff as an abusive adversary which kicks off a vicious cycle as the staff conform to inpatient expectations.\n\nTotal institutions such as treatment centers, mental wards, homeless shelters, prisons, and the like are almost built from the ground up to encourage and perpetuate abuse.",
      "created_utc": 1685285014.0,
      "score": 49,
      "context": []
    },
    {
      "id": "jlyiqo5",
      "author": "None",
      "body": "Because people think it's choice even if they don't admit it.",
      "created_utc": 1685290322.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jlxw38d",
      "author": "Pixieinthedark",
      "body": "In my country, hospital staff just preys on the weaker, on the ones that won’t be able to speak up or won’t be believed. I was at a kids ward 2.5yrs ago and i was beaten by nurses, dragged out of bed when I couldn’t move due to my hr and bp being extremely low. Yell at me for passing out cus apparently i was faking, which then turned out that i was on the brisk of death since they were also giving me too much medicine (basically drugging me so i sleep, but i was only allowed to sleep on the floor during the day). I was held by 3 nurses whilst a 4th was feeding me. And no one believed me bcs as they said i was hallucinating (which is false, I remember everything) and i was just a child. In adult wards it was no better. Nurses here think they have so much power and r allowed to treat mental patients like shit cus who would believe a mentally ill person?\nThe system is fucked, and i feel sorry for everyone who had to be neglected when all they needed was the right kind of help",
      "created_utc": 1685280361.0,
      "score": 29,
      "context": []
    },
    {
      "id": "jly1j4l",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1685282980.0,
      "score": 21,
      "context": []
    },
    {
      "id": "jm1n8ld",
      "author": "suspiciouseyeballs",
      "body": "Anorexia takes a long time and a lot of patience and struggle to recover from, and people without patience and empathy find it easier to just claim we're lazy or being stubborn. I was in a facility at one point with an ED'd girl who was given twice the normal amount of food as everyone else and expected to finish it. I was young and naïve but even back then i realized thats definitely not helping her.",
      "created_utc": 1685346684.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jlyoe1s",
      "author": "anonomomamam",
      "body": "Someone is shadowbanned and can't see their comment or even their profile if I were to look them up, but on the notification it said\n\n\"people simply don't understand. a lot of people are saying that anorexia isn't a choice, but i feel like in a way it is. i'm choosing not to eat, i'm choosing to want to be \"skinny\" because in my opinion that's pretty. i'm choosing to harm myself by forcin\"\n\nThe rest is cut off but I want to respond that to me this is a grey area. I would compare it to drugs even though they may not be completely the same, it is to explain the similarities of how hard they can be backing out of doing something you repeatedly do. You are making the choice of doing drugs thinking \"oh I can stop whenever I want\", but once you're sucked into it it's so hard to get out, you can't stop. With anorexia nervosa, you just can't seem to stop, even if you want to, it may be because of habit, the fear is still there, you're still obsessed with weight and being in control, it could be many reasons, but it's just so hard it feels near impossible to recover\n\nWhat are your thoughts?",
      "created_utc": 1685292651.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jlzl3mq",
      "author": "Eurydice1224",
      "body": "Ive also seen some misconceptions as well like “they only care when your thin” which is.. so far from the truth. The smaller i got the more hate i got on the daily from people i knew and complete strangers. People downplay my body dysmorphia constantly without even taking a second to TRY to understand. Everything ive seen when it comes to the general understanding of ana is just straight up factually wrong.",
      "created_utc": 1685306263.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jm3vt93",
      "author": "yudyud8",
      "body": "Ignorance breeds the rude behavior. They don’t understand. Just to mention…The people in charge at ED facilities think they understand the disordered mind, yet somehow manage to accomplish the opposite of their goals by causing relapse and competitive behaviors in their patients. That’s what I’ve come to notice in facilities based around recovery.",
      "created_utc": 1685388453.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jlzwynx",
      "author": "username248124",
      "body": "Yup tbh I think anorexics are treated worse in healthcare and society than obese people",
      "created_utc": 1685311607.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jm0ztcb",
      "author": "yaniekitty",
      "body": "People think that we are not sick. They don t understand that we suffer a lot. And I feel so bad, so lonely that I don t know how to express my emotion.",
      "created_utc": 1685330881.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jlzzzp8",
      "author": "cookiecuttershark00",
      "body": "I find that people just don’t understand it. I don’t really blame people for that because before it happened to me I couldn’t understand why someone couldn’t just make themselves eat (of course I never said that to anyone but I thought it). Then when it happened to me I had a lot more insight. But I sometimes wish people would just be kinder even if they don’t or can’t understand.\n\nI get frustrated that some healthcare professionals blame anything you say or do on your eating disorder. I’ve had comments such as “that’s the anorexia”, “that’s your eating disorder talking” and even after making a very rational and logical comment about my care to a medical doctor when I was in the hospital was told that what I was saying was “eating disorder pseudoscience”… But I have also had some lovely healthcare professionals, particularly nurses in medical wards who have helped advocate for me when medical or psychiatric doctors wouldn’t listen to me. \n\nI didn’t have as much luck in the mental health wards as a teenager and young adult before I was diagnosed with an eating disorder though. They clearly didn’t care and I was brushed off all of the times I asked for help even when I specifically asked for help to avoid purging and was told that it’s fine to keep doing it as it’s better than self harming. \n\nI believe that I was treated so poorly there as my BMI was in the obese category and I wasn’t taken seriously. It really took until I started to develop medical problems (then at an overweight BMI) before people started taking it seriously. Now it is taken so seriously that I have been forced into medical hospitals 3 times and I don’t have a choice or any autonomy. \n\nI do think a lot of people think it’s a choice and I don’t think they understand how much it would be nice to just live a normal life without these thoughts taking over and that if we could just change easily, most of us would (especially when the honeymoon period is over and it really starts interfering with your life more and more).",
      "created_utc": 1685313038.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jlznb7v",
      "author": "None",
      "body": "They think we’re just really stupid or borderline retarded. Which is untrue statistically bc anorexic people are actually smarter than the average person.",
      "created_utc": 1685307214.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jly6mgr",
      "author": "thapug2023",
      "body": "I used to get tied up to my bed for the whole day if I scraped off a little bit of butter from my bread, I couldn't talk with any of the other patients for 3 months, was locked up in my room LITERALLY LOCKED for 3 months...:(",
      "created_utc": 1685285240.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jm1qlpx",
      "author": "my-ed-alt",
      "body": "nobody takes anorexia seriously. partially because its mostly teenage girls and nobody takes teenage girls seriously, but mostly because to the average person, its seen as a choice. you choose not to eat for whatever reason. people understand drug addiction because there's a high and a withdrawal and actual medical evidence of your body becoming dependent on the drug. but since anorexia is almost entirely mental (apart from side effects of starvation) nobody sees it as a real illness. it makes me really really sad because people keep dying from complications related to anorexia and its never enough to be taken seriously",
      "created_utc": 1685349450.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jlynfnc",
      "author": "Ku4ancitu",
      "body": "Because you look normal and not insane. L",
      "created_utc": 1685292263.0,
      "score": -5,
      "context": []
    },
    {
      "id": "jm0hzph",
      "author": "Long-Interaction7203",
      "body": "im currently in the hospital right now and the nurses have been extremely nice mostly but i feel realky angry still, they won’t give me food even when i tell them i’m starving (they are only feeding me today on my fifth day) because of refeeding syndrome and they also won’t let me shower or pee by myself even when i was crying because my bladder hurt so bad because i just couldn’t pee because of the people watching me i was begging them to let me go by myself but they just wouldn’t and also they won’t let me walk anywhere or leave the ward even tho i’ve been begging them to let me go for a smoke. idk that’s the only problem i have had and obviously some of that is just how they treat the patients but it’s really frustrating and i can understand how people feel like they are being treated unfairly",
      "created_utc": 1685321798.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jm38dfr",
      "author": "kevmsl1x",
      "body": "I spent roughly six months in an ed facility and it helped me less than anything I tried to heal both before and after. Talking to the doctors, both into the facility and out of it, it seemed that my very low weight was the only problem to be solved, and once I got to a \"normal\" weight I was let go from that place. Mentally I was devastated and their words made me feel like I was just a puppet to be controlled. Not a person with feelings, but a bruised toy that just needed to be stuffed with absorbent cotton, or something like that lol \n\n(note: we did have some very strict rules) \n\nComing out of there, of course, my rituals and coping mechanisms from before (I went into the spiral of anorexia simply because it was the only thing I could control in my life) came out again. And everything went back to the way it was before. So again, I was trying to talk but no one was listening all the way and I felt ridiculed, to the point of almost feeling childish myself and asking myself too many questions. As if everything was just a whim of mine, and everyone else was right about it. \n\nI was never treated terribly, but no one ever seemed to have used appropriate words toward me and to identify the disease, nor did they try to actually understand me (??? so little therapy and for what ???). They literally just wanted me to eat, and once I did they were happy and told me “it wasn’t that hard, right? food is fuel.” I still think of it as a traumatic experience that led me to nothing but refusing help in later years. I’m still struggling very much but if that’s how their help goes… yeah i don’t want it.",
      "created_utc": 1685378943.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jm403pw",
      "author": "606_V1RUS",
      "body": "Something i see often is that people/some medical staff get mad at anorexic people, i guess it's because they see it as \"hey i'm starving myself for attention! Now save my life!\" Basically because they don't really understand the disorder itself and how it works.",
      "created_utc": 1685390211.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jm5vn8g",
      "author": "None",
      "body": "I’m sure some healthcare professionals have good intentions. AN is such a manipulative and deceptive disease. If you give someone an inch they’ll take a mile. Sometimes rigid and strict rules are necessary.\n\nOn the other hand, I think some healthcare professionals think that this disease is all in your head and all you have to do is eat. If only it was that easy. Some people purely don’t understand the mental struggle that goes on inside our heads.",
      "created_utc": 1685420917.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jlyr1dc",
      "author": "throwRAsadd",
      "body": "So, so much. Eating disorders are trivialized so much and seen as a “choice.” I saw this video the other day where this man was complaining (paraphrasing) “Well, first, the person suffering from the eating disorder is told that - since they’re not underweight - they’re ‘not sick enough’ to get treatment and no one really cares. And then, when they are sick enough to need treatment, they’re told they’re ‘too sick’ for anyone to help them, they did this to themselves and they need to figure things out on their own.”   \n\nI think eating disorders will forever be aggressively trivialized as an illness only affecting pretty white rich teenage girls that are “just being dramatic” and “just want to be skinny.” ALL women’s health issues are trivialized in the medical field - seriously, even female practitioners suffer from biases that encourage misogyny and the dismissal of issues largely affecting women.   \n\nThis has done SUCH a disservice to the processing and treatment of eating disorders. It dismisses that men can have eating disorders, overweight people, older people, poor people, POC, anyone can have a severe eating disorder. And no one with an eating disorder is doing it “for attention” and “to be dramatic.” No one chooses this.  \n\nBut I just can’t see it ever getting better.",
      "created_utc": 1685293722.0,
      "score": 46,
      "context": [
        {
          "id": "jlxvggh",
          "author": "moonshadowwww16",
          "body": "I think people don't take us seriously, like - they don't think we're seriously ill. They think we're deliberately choosing to do this for whatever reason. All in all, I think it comes from ignorance on eating disorders",
          "created_utc": 1685280037.0
        }
      ]
    },
    {
      "id": "jlzml5x",
      "author": "Inevitable_Space5175",
      "body": "That reminds me exactly of the Stanford Prison Experiment where they studied how people act when they have authority and when they don't and if you are or anyone is familiar with it you know they had to stop that only after a week because of ethical issues. The \"authority people\" were starting to become so extremely abusive towards the \"prisoners,\" they couldn't continue. I think it was meant to last for a couple of weeks. Also, everyone in that study were just normal people, and the experiment just, I guess, brought it out of them. They did do like screenings to make sure they were healthy in every sense of the word for before and after the study.",
      "created_utc": 1685306903.0,
      "score": 10,
      "context": [
        {
          "id": "jly641v",
          "author": "MountainStrategy8390",
          "body": "Inpatient treatment centers are a type of total institution where the staff have absolute control over pretty much every aspect of your life. That both attracts an abusive personality who enjoys having access to that kind of power and it brings out those tendencies in others. Especially when staff are underpaid or have poor work conditions they may turn to “taking it out” on inpatients.\n\n… of course, once this starts to happen the inpatients learn to see staff as an abusive adversary which kicks off a vicious cycle as the staff conform to inpatient expectations.\n\nTotal institutions such as treatment centers, mental wards, homeless shelters, prisons, and the like are almost built from the ground up to encourage and perpetuate abuse.",
          "created_utc": 1685285014.0
        }
      ]
    },
    {
      "id": "jlzld2n",
      "author": "Eurydice1224",
      "body": "This is exactly why i want to work in an inpatient treatment center in the future. Give them someone who they can actually relate to and wont pray on the fact they’re vulnerable",
      "created_utc": 1685306377.0,
      "score": 10,
      "context": [
        {
          "id": "jly641v",
          "author": "MountainStrategy8390",
          "body": "Inpatient treatment centers are a type of total institution where the staff have absolute control over pretty much every aspect of your life. That both attracts an abusive personality who enjoys having access to that kind of power and it brings out those tendencies in others. Especially when staff are underpaid or have poor work conditions they may turn to “taking it out” on inpatients.\n\n… of course, once this starts to happen the inpatients learn to see staff as an abusive adversary which kicks off a vicious cycle as the staff conform to inpatient expectations.\n\nTotal institutions such as treatment centers, mental wards, homeless shelters, prisons, and the like are almost built from the ground up to encourage and perpetuate abuse.",
          "created_utc": 1685285014.0
        }
      ]
    },
    {
      "id": "jm6tifc",
      "author": "Ok_Actuary_9506",
      "body": "No bc I’ve always thought this but never in a cohesive thought, like you just wrote out like you just wrote out a feeling ive never thought to put into words and I’ve been having my whole life that’s crazy thank you",
      "created_utc": 1685446305.0,
      "score": 2,
      "context": [
        {
          "id": "jly641v",
          "author": "MountainStrategy8390",
          "body": "Inpatient treatment centers are a type of total institution where the staff have absolute control over pretty much every aspect of your life. That both attracts an abusive personality who enjoys having access to that kind of power and it brings out those tendencies in others. Especially when staff are underpaid or have poor work conditions they may turn to “taking it out” on inpatients.\n\n… of course, once this starts to happen the inpatients learn to see staff as an abusive adversary which kicks off a vicious cycle as the staff conform to inpatient expectations.\n\nTotal institutions such as treatment centers, mental wards, homeless shelters, prisons, and the like are almost built from the ground up to encourage and perpetuate abuse.",
          "created_utc": 1685285014.0
        }
      ]
    },
    {
      "id": "jlzbotg",
      "author": "thapug2023",
      "body": "Oh my God..",
      "created_utc": 1685302254.0,
      "score": 7,
      "context": [
        {
          "id": "jlxw38d",
          "author": "Pixieinthedark",
          "body": "In my country, hospital staff just preys on the weaker, on the ones that won’t be able to speak up or won’t be believed. I was at a kids ward 2.5yrs ago and i was beaten by nurses, dragged out of bed when I couldn’t move due to my hr and bp being extremely low. Yell at me for passing out cus apparently i was faking, which then turned out that i was on the brisk of death since they were also giving me too much medicine (basically drugging me so i sleep, but i was only allowed to sleep on the floor during the day). I was held by 3 nurses whilst a 4th was feeding me. And no one believed me bcs as they said i was hallucinating (which is false, I remember everything) and i was just a child. In adult wards it was no better. Nurses here think they have so much power and r allowed to treat mental patients like shit cus who would believe a mentally ill person?\nThe system is fucked, and i feel sorry for everyone who had to be neglected when all they needed was the right kind of help",
          "created_utc": 1685280361.0
        }
      ]
    },
    {
      "id": "jlzmsz7",
      "author": "Inevitable_Space5175",
      "body": "That is just so sick. I'm so sorry you've had to go through that!",
      "created_utc": 1685306997.0,
      "score": 2,
      "context": [
        {
          "id": "jlxw38d",
          "author": "Pixieinthedark",
          "body": "In my country, hospital staff just preys on the weaker, on the ones that won’t be able to speak up or won’t be believed. I was at a kids ward 2.5yrs ago and i was beaten by nurses, dragged out of bed when I couldn’t move due to my hr and bp being extremely low. Yell at me for passing out cus apparently i was faking, which then turned out that i was on the brisk of death since they were also giving me too much medicine (basically drugging me so i sleep, but i was only allowed to sleep on the floor during the day). I was held by 3 nurses whilst a 4th was feeding me. And no one believed me bcs as they said i was hallucinating (which is false, I remember everything) and i was just a child. In adult wards it was no better. Nurses here think they have so much power and r allowed to treat mental patients like shit cus who would believe a mentally ill person?\nThe system is fucked, and i feel sorry for everyone who had to be neglected when all they needed was the right kind of help",
          "created_utc": 1685280361.0
        }
      ]
    },
    {
      "id": "jlzc6zh",
      "author": "Virtual-Nobody-6630",
      "body": "Why lie about some stuff and expect them to believe you with everything else?",
      "created_utc": 1685302469.0,
      "score": -1,
      "context": [
        {
          "id": "jlxw38d",
          "author": "Pixieinthedark",
          "body": "In my country, hospital staff just preys on the weaker, on the ones that won’t be able to speak up or won’t be believed. I was at a kids ward 2.5yrs ago and i was beaten by nurses, dragged out of bed when I couldn’t move due to my hr and bp being extremely low. Yell at me for passing out cus apparently i was faking, which then turned out that i was on the brisk of death since they were also giving me too much medicine (basically drugging me so i sleep, but i was only allowed to sleep on the floor during the day). I was held by 3 nurses whilst a 4th was feeding me. And no one believed me bcs as they said i was hallucinating (which is false, I remember everything) and i was just a child. In adult wards it was no better. Nurses here think they have so much power and r allowed to treat mental patients like shit cus who would believe a mentally ill person?\nThe system is fucked, and i feel sorry for everyone who had to be neglected when all they needed was the right kind of help",
          "created_utc": 1685280361.0
        }
      ]
    },
    {
      "id": "jlyjds6",
      "author": "honeycakies",
      "body": "I’ve had the same thoughts every time I see posts like this but could never word them this well! I completely agree. Abuse is absolutely very real in these environments, but that word also starts getting tossed around incredibly easily in these conversations when the alternative would oftentimes be waiting around for somebody physically incapable of thinking straight to “feel ready for recovery” until they starve themselves to death.",
      "created_utc": 1685290587.0,
      "score": 8,
      "context": [
        {
          "id": "jly1j4l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1685282980.0
        }
      ]
    },
    {
      "id": "jlzcs05",
      "author": "Virtual-Nobody-6630",
      "body": "Most accurate answer. They are actively trying to keep you from *dying* and this disease makes these attempts appear as attacks when we fight it. And naturally we want to fight against being \"forced\" to do anything-mental illness or not.",
      "created_utc": 1685302719.0,
      "score": 5,
      "context": [
        {
          "id": "jly1j4l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1685282980.0
        }
      ]
    },
    {
      "id": "jly40sj",
      "author": "Mobile-Shift-3978",
      "body": "So this may be unrelated but I struggled with this when I was hospitalized for self harm. I felt like they were being cold and invasive and treating me poorly, but I also saw on their faces the pity (which angered me a little because I didn’t want that) and I tried to see if from the perspective of them trying to help but needing to be firm to do so*",
      "created_utc": 1685284091.0,
      "score": 5,
      "context": [
        {
          "id": "jly1j4l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1685282980.0
        }
      ]
    },
    {
      "id": "jlytmzh",
      "author": "ShadowThief87",
      "body": "I'm from EU, and I've visited a few mental wards as a family member/friend. one of them is on a remote island, and the conditions are horrible, roofs falling off, 10 people in the same room, schizophrenics and autistics and demential grannies and anorexic 19y olds and murderers that got sentenced to psych ward all in the same room, food is left outside in the middle of the summer, cats and rats sneak in the food carts (sent the photo evidence to the local authorities, they called me rebellious and dismissed it), me and the older neighbor who drove me there were waiting for an hour in their \"fun room\" that's supposed to be for relaxation and fun activities, it looks like an old classroom, with tiny chairs for kindergartners (how are old people supposed to sit on that?!), no air conditioning, outside it was 42°C and inside even hotter, can't open windows even though there are metal grates (idk what's the word for it rn?) on the outside so no one could get out anyway. and the staff gave me a lot of attitude. like bro, I am a retired army member, been in the barracks, had a lot of idiots with god complex tryna exert power, but those people working there, and the conditions, are just next level of horror.",
      "created_utc": 1685294769.0,
      "score": 2,
      "context": [
        {
          "id": "jly1j4l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1685282980.0
        }
      ]
    },
    {
      "id": "jlzdl5e",
      "author": "Virtual-Nobody-6630",
      "body": "They were being real for that comment because it's true. We strive for perfection and make choices daily to get towards that goal. It doesn't feel like a choice in the mind of AN but realistically it is. I've been in recover in&out and everything is always a result of my choices I made.",
      "created_utc": 1685303063.0,
      "score": 5,
      "context": [
        {
          "id": "jlyoe1s",
          "author": "anonomomamam",
          "body": "Someone is shadowbanned and can't see their comment or even their profile if I were to look them up, but on the notification it said\n\n\"people simply don't understand. a lot of people are saying that anorexia isn't a choice, but i feel like in a way it is. i'm choosing not to eat, i'm choosing to want to be \"skinny\" because in my opinion that's pretty. i'm choosing to harm myself by forcin\"\n\nThe rest is cut off but I want to respond that to me this is a grey area. I would compare it to drugs even though they may not be completely the same, it is to explain the similarities of how hard they can be backing out of doing something you repeatedly do. You are making the choice of doing drugs thinking \"oh I can stop whenever I want\", but once you're sucked into it it's so hard to get out, you can't stop. With anorexia nervosa, you just can't seem to stop, even if you want to, it may be because of habit, the fear is still there, you're still obsessed with weight and being in control, it could be many reasons, but it's just so hard it feels near impossible to recover\n\nWhat are your thoughts?",
          "created_utc": 1685292651.0
        }
      ]
    },
    {
      "id": "jm1icoz",
      "author": "StrangeDocument3571",
      "body": "Disagree",
      "created_utc": 1685342835.0,
      "score": 3,
      "context": [
        {
          "id": "jlzwynx",
          "author": "username248124",
          "body": "Yup tbh I think anorexics are treated worse in healthcare and society than obese people",
          "created_utc": 1685311607.0
        }
      ]
    },
    {
      "id": "jlzp0ke",
      "author": "Inevitable_Space5175",
      "body": "I'm so sorry you've gone through that. That is sick behavior to do to anyone, especially with all the knowledge of how dangerous it can be to be locked up and not have the possibility to socialize with other people. \nThat so much goes against any and all ethical rules and is a violation of your rights, and negligence. If that did happen in the US, I researched it a bit and found out they probably would get a criminal record, definitely a loss of their professional license, etc, and hopefully, they'd go to jail too for that. \nAlso like in high security prisons they do that, not allow them to talk to anyone, to isolate them and the amount of studies have been done about that and the results is crazy, most of the people developed some sort of psychological disorder and started seeing hallucinations, etc because of the lack of socializing and being alone for so long. Definitely not a safe thing to do.",
      "created_utc": 1685307956.0,
      "score": 3,
      "context": [
        {
          "id": "jly6mgr",
          "author": "thapug2023",
          "body": "I used to get tied up to my bed for the whole day if I scraped off a little bit of butter from my bread, I couldn't talk with any of the other patients for 3 months, was locked up in my room LITERALLY LOCKED for 3 months...:(",
          "created_utc": 1685285240.0
        }
      ]
    },
    {
      "id": "jm6vwxp",
      "author": "Ok_Actuary_9506",
      "body": "Very relatable when I was in Ed treatment but like wayyyy back when I was a teen we had a level system and a similar thing happened to me but they put me on a new med (that had a symptom of making u sleepy and wasn’t widely prescribed anymore) so I was constantly asleep in the milieu then told me I had to go on some level (can’t remember the number) which meant I had be locked in a group room- u got off this level by being on “good behavior” (participating in groups/at meals) but then they frequently forgot to come get me for meals or groups lmao so I was on it for like 2 weeks (made up a fun game where I counted how many red (the color would change) cars drove by tho that I still use when I’m bored so one positive right lol)",
      "created_utc": 1685447741.0,
      "score": 2,
      "context": [
        {
          "id": "jly6mgr",
          "author": "thapug2023",
          "body": "I used to get tied up to my bed for the whole day if I scraped off a little bit of butter from my bread, I couldn't talk with any of the other patients for 3 months, was locked up in my room LITERALLY LOCKED for 3 months...:(",
          "created_utc": 1685285240.0
        }
      ]
    },
    {
      "id": "jm2c6w9",
      "author": "anonomomamam",
      "body": "> nobody takes anorexia seriously. partially because its mostly teenage girls and nobody takes teenage girls seriously\n\nI also see posts and comments from males who struggle with anorexia nervosa getting treated the same way. Where did you get this information that this is the reason? Not to be rude, I'm just curious",
      "created_utc": 1685364794.0,
      "score": 2,
      "context": [
        {
          "id": "jm1qlpx",
          "author": "my-ed-alt",
          "body": "nobody takes anorexia seriously. partially because its mostly teenage girls and nobody takes teenage girls seriously, but mostly because to the average person, its seen as a choice. you choose not to eat for whatever reason. people understand drug addiction because there's a high and a withdrawal and actual medical evidence of your body becoming dependent on the drug. but since anorexia is almost entirely mental (apart from side effects of starvation) nobody sees it as a real illness. it makes me really really sad because people keep dying from complications related to anorexia and its never enough to be taken seriously",
          "created_utc": 1685349450.0
        }
      ]
    },
    {
      "id": "jm38ssg",
      "author": "Hammata",
      "body": "🧍🏾‍♂️🧍🏾‍♂️🧍🏻‍♂️🧍🏼‍♂️🧍🏿‍♂️",
      "created_utc": 1685379115.0,
      "score": 2,
      "context": [
        {
          "id": "jm1qlpx",
          "author": "my-ed-alt",
          "body": "nobody takes anorexia seriously. partially because its mostly teenage girls and nobody takes teenage girls seriously, but mostly because to the average person, its seen as a choice. you choose not to eat for whatever reason. people understand drug addiction because there's a high and a withdrawal and actual medical evidence of your body becoming dependent on the drug. but since anorexia is almost entirely mental (apart from side effects of starvation) nobody sees it as a real illness. it makes me really really sad because people keep dying from complications related to anorexia and its never enough to be taken seriously",
          "created_utc": 1685349450.0
        }
      ]
    },
    {
      "id": "jm2e7dx",
      "author": "Low-Project-7957",
      "body": "Being a girl is not the reason at all. If you look at the comments you can see that boys and men are mistreated too. Dont exclude anyone",
      "created_utc": 1685365849.0,
      "score": 1,
      "context": [
        {
          "id": "jm1qlpx",
          "author": "my-ed-alt",
          "body": "nobody takes anorexia seriously. partially because its mostly teenage girls and nobody takes teenage girls seriously, but mostly because to the average person, its seen as a choice. you choose not to eat for whatever reason. people understand drug addiction because there's a high and a withdrawal and actual medical evidence of your body becoming dependent on the drug. but since anorexia is almost entirely mental (apart from side effects of starvation) nobody sees it as a real illness. it makes me really really sad because people keep dying from complications related to anorexia and its never enough to be taken seriously",
          "created_utc": 1685349450.0
        }
      ]
    },
    {
      "id": "jm2g2ec",
      "author": "RiskExtension1183",
      "body": "What does the fact that most people with ana nervosa being females have to do with how we get treated? Us dudes get treated like crap too",
      "created_utc": 1685366795.0,
      "score": 1,
      "context": [
        {
          "id": "jm1qlpx",
          "author": "my-ed-alt",
          "body": "nobody takes anorexia seriously. partially because its mostly teenage girls and nobody takes teenage girls seriously, but mostly because to the average person, its seen as a choice. you choose not to eat for whatever reason. people understand drug addiction because there's a high and a withdrawal and actual medical evidence of your body becoming dependent on the drug. but since anorexia is almost entirely mental (apart from side effects of starvation) nobody sees it as a real illness. it makes me really really sad because people keep dying from complications related to anorexia and its never enough to be taken seriously",
          "created_utc": 1685349450.0
        }
      ]
    },
    {
      "id": "jm0i2l0",
      "author": "Long-Interaction7203",
      "body": "context i have a tube and i’m getting food through that too",
      "created_utc": 1685321837.0,
      "score": 1,
      "context": [
        {
          "id": "jm0hzph",
          "author": "Long-Interaction7203",
          "body": "im currently in the hospital right now and the nurses have been extremely nice mostly but i feel realky angry still, they won’t give me food even when i tell them i’m starving (they are only feeding me today on my fifth day) because of refeeding syndrome and they also won’t let me shower or pee by myself even when i was crying because my bladder hurt so bad because i just couldn’t pee because of the people watching me i was begging them to let me go by myself but they just wouldn’t and also they won’t let me walk anywhere or leave the ward even tho i’ve been begging them to let me go for a smoke. idk that’s the only problem i have had and obviously some of that is just how they treat the patients but it’s really frustrating and i can understand how people feel like they are being treated unfairly",
          "created_utc": 1685321798.0
        }
      ]
    },
    {
      "id": "jm6tt6c",
      "author": "Ok_Actuary_9506",
      "body": "Please do it really makes a difference I have staff I remember from like almost 10 yrs ago now who made a positive impact in psych hospitals",
      "created_utc": 1685446494.0,
      "score": 3,
      "context": [
        {
          "id": "jly641v",
          "author": "MountainStrategy8390",
          "body": "Inpatient treatment centers are a type of total institution where the staff have absolute control over pretty much every aspect of your life. That both attracts an abusive personality who enjoys having access to that kind of power and it brings out those tendencies in others. Especially when staff are underpaid or have poor work conditions they may turn to “taking it out” on inpatients.\n\n… of course, once this starts to happen the inpatients learn to see staff as an abusive adversary which kicks off a vicious cycle as the staff conform to inpatient expectations.\n\nTotal institutions such as treatment centers, mental wards, homeless shelters, prisons, and the like are almost built from the ground up to encourage and perpetuate abuse.",
          "created_utc": 1685285014.0
        },
        {
          "id": "jlzld2n",
          "author": "Eurydice1224",
          "body": "This is exactly why i want to work in an inpatient treatment center in the future. Give them someone who they can actually relate to and wont pray on the fact they’re vulnerable",
          "created_utc": 1685306377.0
        }
      ]
    },
    {
      "id": "jlzyad2",
      "author": "Pixieinthedark",
      "body": "Abt what did i lie exactly? I never lied in there, I wasn’t even in for my eating disorder",
      "created_utc": 1685312225.0,
      "score": 3,
      "context": [
        {
          "id": "jlxw38d",
          "author": "Pixieinthedark",
          "body": "In my country, hospital staff just preys on the weaker, on the ones that won’t be able to speak up or won’t be believed. I was at a kids ward 2.5yrs ago and i was beaten by nurses, dragged out of bed when I couldn’t move due to my hr and bp being extremely low. Yell at me for passing out cus apparently i was faking, which then turned out that i was on the brisk of death since they were also giving me too much medicine (basically drugging me so i sleep, but i was only allowed to sleep on the floor during the day). I was held by 3 nurses whilst a 4th was feeding me. And no one believed me bcs as they said i was hallucinating (which is false, I remember everything) and i was just a child. In adult wards it was no better. Nurses here think they have so much power and r allowed to treat mental patients like shit cus who would believe a mentally ill person?\nThe system is fucked, and i feel sorry for everyone who had to be neglected when all they needed was the right kind of help",
          "created_utc": 1685280361.0
        },
        {
          "id": "jlzc6zh",
          "author": "Virtual-Nobody-6630",
          "body": "Why lie about some stuff and expect them to believe you with everything else?",
          "created_utc": 1685302469.0
        }
      ]
    },
    {
      "id": "jly5obp",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1685284821.0,
      "score": 3,
      "context": [
        {
          "id": "jly1j4l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1685282980.0
        },
        {
          "id": "jly40sj",
          "author": "Mobile-Shift-3978",
          "body": "So this may be unrelated but I struggled with this when I was hospitalized for self harm. I felt like they were being cold and invasive and treating me poorly, but I also saw on their faces the pity (which angered me a little because I didn’t want that) and I tried to see if from the perspective of them trying to help but needing to be firm to do so*",
          "created_utc": 1685284091.0
        }
      ]
    },
    {
      "id": "jlzln1b",
      "author": "Eurydice1224",
      "body": "The thing is its nuisanced, i was never interested in being perfect or ultra thin, i still dont know why i went down the past of restricting. It never felt like an active choice to me, more like sliding into a pit",
      "created_utc": 1685306493.0,
      "score": 2,
      "context": [
        {
          "id": "jlyoe1s",
          "author": "anonomomamam",
          "body": "Someone is shadowbanned and can't see their comment or even their profile if I were to look them up, but on the notification it said\n\n\"people simply don't understand. a lot of people are saying that anorexia isn't a choice, but i feel like in a way it is. i'm choosing not to eat, i'm choosing to want to be \"skinny\" because in my opinion that's pretty. i'm choosing to harm myself by forcin\"\n\nThe rest is cut off but I want to respond that to me this is a grey area. I would compare it to drugs even though they may not be completely the same, it is to explain the similarities of how hard they can be backing out of doing something you repeatedly do. You are making the choice of doing drugs thinking \"oh I can stop whenever I want\", but once you're sucked into it it's so hard to get out, you can't stop. With anorexia nervosa, you just can't seem to stop, even if you want to, it may be because of habit, the fear is still there, you're still obsessed with weight and being in control, it could be many reasons, but it's just so hard it feels near impossible to recover\n\nWhat are your thoughts?",
          "created_utc": 1685292651.0
        },
        {
          "id": "jlzdl5e",
          "author": "Virtual-Nobody-6630",
          "body": "They were being real for that comment because it's true. We strive for perfection and make choices daily to get towards that goal. It doesn't feel like a choice in the mind of AN but realistically it is. I've been in recover in&out and everything is always a result of my choices I made.",
          "created_utc": 1685303063.0
        }
      ]
    },
    {
      "id": "jm2gwjd",
      "author": "ThickMark6996",
      "body": "Rt",
      "created_utc": 1685367212.0,
      "score": 2,
      "context": [
        {
          "id": "jlzwynx",
          "author": "username248124",
          "body": "Yup tbh I think anorexics are treated worse in healthcare and society than obese people",
          "created_utc": 1685311607.0
        },
        {
          "id": "jm1icoz",
          "author": "StrangeDocument3571",
          "body": "Disagree",
          "created_utc": 1685342835.0
        }
      ]
    },
    {
      "id": "jm6vxnq",
      "author": "ghost_of_dongerbot",
      "body": "ヽ༼ ຈل͜ຈ༽ ﾉ Raise ur dongers!\n\n^^Dongers ^^Raised: ^^71673\n\n^^Check ^^Out ^^/r/AyyLmao2DongerBot ^^For ^^More ^^Info",
      "created_utc": 1685447753.0,
      "score": 1,
      "context": [
        {
          "id": "jly6mgr",
          "author": "thapug2023",
          "body": "I used to get tied up to my bed for the whole day if I scraped off a little bit of butter from my bread, I couldn't talk with any of the other patients for 3 months, was locked up in my room LITERALLY LOCKED for 3 months...:(",
          "created_utc": 1685285240.0
        },
        {
          "id": "jm6vwxp",
          "author": "Ok_Actuary_9506",
          "body": "Very relatable when I was in Ed treatment but like wayyyy back when I was a teen we had a level system and a similar thing happened to me but they put me on a new med (that had a symptom of making u sleepy and wasn’t widely prescribed anymore) so I was constantly asleep in the milieu then told me I had to go on some level (can’t remember the number) which meant I had be locked in a group room- u got off this level by being on “good behavior” (participating in groups/at meals) but then they frequently forgot to come get me for meals or groups lmao so I was on it for like 2 weeks (made up a fun game where I counted how many red (the color would change) cars drove by tho that I still use when I’m bored so one positive right lol)",
          "created_utc": 1685447741.0
        }
      ]
    },
    {
      "id": "jm4pozg",
      "author": "ConfidentStrength999",
      "body": "I don't think anyone is denying that men get treated terribly in treatment too, but what is being said is that the \\*perception\\* that AN is an illness that primarily affects women means that many of the biases against women, and the issues with women's healthcare, emerge in treatment of anorexia. And, when its primarily young girls who are getting treatment, the illness as a whole isn't taken as seriously in part because teenage girls and their problems aren't taken seriously.",
      "created_utc": 1685401190.0,
      "score": 2,
      "context": [
        {
          "id": "jm1qlpx",
          "author": "my-ed-alt",
          "body": "nobody takes anorexia seriously. partially because its mostly teenage girls and nobody takes teenage girls seriously, but mostly because to the average person, its seen as a choice. you choose not to eat for whatever reason. people understand drug addiction because there's a high and a withdrawal and actual medical evidence of your body becoming dependent on the drug. but since anorexia is almost entirely mental (apart from side effects of starvation) nobody sees it as a real illness. it makes me really really sad because people keep dying from complications related to anorexia and its never enough to be taken seriously",
          "created_utc": 1685349450.0
        },
        {
          "id": "jm2g2ec",
          "author": "RiskExtension1183",
          "body": "What does the fact that most people with ana nervosa being females have to do with how we get treated? Us dudes get treated like crap too",
          "created_utc": 1685366795.0
        }
      ]
    },
    {
      "id": "jm8gr3r",
      "author": "Eurydice1224",
      "body": "Its my dream job currently enrolled into college so one day ill be there",
      "created_utc": 1685471442.0,
      "score": 3,
      "context": [
        {
          "id": "jly641v",
          "author": "MountainStrategy8390",
          "body": "Inpatient treatment centers are a type of total institution where the staff have absolute control over pretty much every aspect of your life. That both attracts an abusive personality who enjoys having access to that kind of power and it brings out those tendencies in others. Especially when staff are underpaid or have poor work conditions they may turn to “taking it out” on inpatients.\n\n… of course, once this starts to happen the inpatients learn to see staff as an abusive adversary which kicks off a vicious cycle as the staff conform to inpatient expectations.\n\nTotal institutions such as treatment centers, mental wards, homeless shelters, prisons, and the like are almost built from the ground up to encourage and perpetuate abuse.",
          "created_utc": 1685285014.0
        },
        {
          "id": "jlzld2n",
          "author": "Eurydice1224",
          "body": "This is exactly why i want to work in an inpatient treatment center in the future. Give them someone who they can actually relate to and wont pray on the fact they’re vulnerable",
          "created_utc": 1685306377.0
        },
        {
          "id": "jm6tt6c",
          "author": "Ok_Actuary_9506",
          "body": "Please do it really makes a difference I have staff I remember from like almost 10 yrs ago now who made a positive impact in psych hospitals",
          "created_utc": 1685446494.0
        }
      ]
    },
    {
      "id": "jly8grr",
      "author": "Mobile-Shift-3978",
      "body": "Reading your reply meant a lot to me 💜 Thank you for taking the time to write that",
      "created_utc": 1685286041.0,
      "score": 1,
      "context": [
        {
          "id": "jly1j4l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1685282980.0
        },
        {
          "id": "jly40sj",
          "author": "Mobile-Shift-3978",
          "body": "So this may be unrelated but I struggled with this when I was hospitalized for self harm. I felt like they were being cold and invasive and treating me poorly, but I also saw on their faces the pity (which angered me a little because I didn’t want that) and I tried to see if from the perspective of them trying to help but needing to be firm to do so*",
          "created_utc": 1685284091.0
        },
        {
          "id": "jly5obp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1685284821.0
        }
      ]
    },
    {
      "id": "jlzmno2",
      "author": "Virtual-Nobody-6630",
      "body": "A huge characteristic of anorexia is fear of being overweight. If you don't feel you obsess over your weight in an unhealthy manner but still restrict its likely A different type of restrictive eating disorder.",
      "created_utc": 1685306934.0,
      "score": 3,
      "context": [
        {
          "id": "jlyoe1s",
          "author": "anonomomamam",
          "body": "Someone is shadowbanned and can't see their comment or even their profile if I were to look them up, but on the notification it said\n\n\"people simply don't understand. a lot of people are saying that anorexia isn't a choice, but i feel like in a way it is. i'm choosing not to eat, i'm choosing to want to be \"skinny\" because in my opinion that's pretty. i'm choosing to harm myself by forcin\"\n\nThe rest is cut off but I want to respond that to me this is a grey area. I would compare it to drugs even though they may not be completely the same, it is to explain the similarities of how hard they can be backing out of doing something you repeatedly do. You are making the choice of doing drugs thinking \"oh I can stop whenever I want\", but once you're sucked into it it's so hard to get out, you can't stop. With anorexia nervosa, you just can't seem to stop, even if you want to, it may be because of habit, the fear is still there, you're still obsessed with weight and being in control, it could be many reasons, but it's just so hard it feels near impossible to recover\n\nWhat are your thoughts?",
          "created_utc": 1685292651.0
        },
        {
          "id": "jlzdl5e",
          "author": "Virtual-Nobody-6630",
          "body": "They were being real for that comment because it's true. We strive for perfection and make choices daily to get towards that goal. It doesn't feel like a choice in the mind of AN but realistically it is. I've been in recover in&out and everything is always a result of my choices I made.",
          "created_utc": 1685303063.0
        },
        {
          "id": "jlzln1b",
          "author": "Eurydice1224",
          "body": "The thing is its nuisanced, i was never interested in being perfect or ultra thin, i still dont know why i went down the past of restricting. It never felt like an active choice to me, more like sliding into a pit",
          "created_utc": 1685306493.0
        }
      ]
    },
    {
      "id": "jm0t4sf",
      "author": "daisycaulfield",
      "body": "Do not believe anorexia is a choice. I never chose to have anorexia. I never actually wanted to be emactaciated. Anorexia made me want that, and in the early years I wasn’t even sure why I was rapidly loosing weight. I genuinely was in such a denial and being controlled by an invisible illness that I thought I had cancer or a terminal illness.  I never wanted to be so beyond petrified and fearful of weight gain and food that it took my whole entire life from me. Literally. It stripped me of everything and everyone and left me a shell of pure nothingness. I didn’t fall into this tortureous and extreme fearful prison hell by choice. It got me by a myriad of factors that stem from genetics/biological and many other environmental factors. I believe that recovery IS a choice but anorexia sure as hell isn’t.",
      "created_utc": 1685327449.0,
      "score": 2,
      "context": [
        {
          "id": "jlyoe1s",
          "author": "anonomomamam",
          "body": "Someone is shadowbanned and can't see their comment or even their profile if I were to look them up, but on the notification it said\n\n\"people simply don't understand. a lot of people are saying that anorexia isn't a choice, but i feel like in a way it is. i'm choosing not to eat, i'm choosing to want to be \"skinny\" because in my opinion that's pretty. i'm choosing to harm myself by forcin\"\n\nThe rest is cut off but I want to respond that to me this is a grey area. I would compare it to drugs even though they may not be completely the same, it is to explain the similarities of how hard they can be backing out of doing something you repeatedly do. You are making the choice of doing drugs thinking \"oh I can stop whenever I want\", but once you're sucked into it it's so hard to get out, you can't stop. With anorexia nervosa, you just can't seem to stop, even if you want to, it may be because of habit, the fear is still there, you're still obsessed with weight and being in control, it could be many reasons, but it's just so hard it feels near impossible to recover\n\nWhat are your thoughts?",
          "created_utc": 1685292651.0
        },
        {
          "id": "jlzdl5e",
          "author": "Virtual-Nobody-6630",
          "body": "They were being real for that comment because it's true. We strive for perfection and make choices daily to get towards that goal. It doesn't feel like a choice in the mind of AN but realistically it is. I've been in recover in&out and everything is always a result of my choices I made.",
          "created_utc": 1685303063.0
        },
        {
          "id": "jlzln1b",
          "author": "Eurydice1224",
          "body": "The thing is its nuisanced, i was never interested in being perfect or ultra thin, i still dont know why i went down the past of restricting. It never felt like an active choice to me, more like sliding into a pit",
          "created_utc": 1685306493.0
        },
        {
          "id": "jlzmno2",
          "author": "Virtual-Nobody-6630",
          "body": "A huge characteristic of anorexia is fear of being overweight. If you don't feel you obsess over your weight in an unhealthy manner but still restrict its likely A different type of restrictive eating disorder.",
          "created_utc": 1685306934.0
        }
      ]
    },
    {
      "id": "jm0ia7q",
      "author": "Eurydice1224",
      "body": "Yes thats a part of it but that developed later on, im more talking about the start of my disorder, which i theorize was because i had a lack of control in an abusive relationship.",
      "created_utc": 1685321944.0,
      "score": 1,
      "context": [
        {
          "id": "jlyoe1s",
          "author": "anonomomamam",
          "body": "Someone is shadowbanned and can't see their comment or even their profile if I were to look them up, but on the notification it said\n\n\"people simply don't understand. a lot of people are saying that anorexia isn't a choice, but i feel like in a way it is. i'm choosing not to eat, i'm choosing to want to be \"skinny\" because in my opinion that's pretty. i'm choosing to harm myself by forcin\"\n\nThe rest is cut off but I want to respond that to me this is a grey area. I would compare it to drugs even though they may not be completely the same, it is to explain the similarities of how hard they can be backing out of doing something you repeatedly do. You are making the choice of doing drugs thinking \"oh I can stop whenever I want\", but once you're sucked into it it's so hard to get out, you can't stop. With anorexia nervosa, you just can't seem to stop, even if you want to, it may be because of habit, the fear is still there, you're still obsessed with weight and being in control, it could be many reasons, but it's just so hard it feels near impossible to recover\n\nWhat are your thoughts?",
          "created_utc": 1685292651.0
        },
        {
          "id": "jlzdl5e",
          "author": "Virtual-Nobody-6630",
          "body": "They were being real for that comment because it's true. We strive for perfection and make choices daily to get towards that goal. It doesn't feel like a choice in the mind of AN but realistically it is. I've been in recover in&out and everything is always a result of my choices I made.",
          "created_utc": 1685303063.0
        },
        {
          "id": "jlzln1b",
          "author": "Eurydice1224",
          "body": "The thing is its nuisanced, i was never interested in being perfect or ultra thin, i still dont know why i went down the past of restricting. It never felt like an active choice to me, more like sliding into a pit",
          "created_utc": 1685306493.0
        },
        {
          "id": "jlzmno2",
          "author": "Virtual-Nobody-6630",
          "body": "A huge characteristic of anorexia is fear of being overweight. If you don't feel you obsess over your weight in an unhealthy manner but still restrict its likely A different type of restrictive eating disorder.",
          "created_utc": 1685306934.0
        }
      ]
    },
    {
      "id": "jm0id2t",
      "author": "Eurydice1224",
      "body": "Thats my bad for my wording on my original reply",
      "created_utc": 1685321983.0,
      "score": 1,
      "context": [
        {
          "id": "jlyoe1s",
          "author": "anonomomamam",
          "body": "Someone is shadowbanned and can't see their comment or even their profile if I were to look them up, but on the notification it said\n\n\"people simply don't understand. a lot of people are saying that anorexia isn't a choice, but i feel like in a way it is. i'm choosing not to eat, i'm choosing to want to be \"skinny\" because in my opinion that's pretty. i'm choosing to harm myself by forcin\"\n\nThe rest is cut off but I want to respond that to me this is a grey area. I would compare it to drugs even though they may not be completely the same, it is to explain the similarities of how hard they can be backing out of doing something you repeatedly do. You are making the choice of doing drugs thinking \"oh I can stop whenever I want\", but once you're sucked into it it's so hard to get out, you can't stop. With anorexia nervosa, you just can't seem to stop, even if you want to, it may be because of habit, the fear is still there, you're still obsessed with weight and being in control, it could be many reasons, but it's just so hard it feels near impossible to recover\n\nWhat are your thoughts?",
          "created_utc": 1685292651.0
        },
        {
          "id": "jlzdl5e",
          "author": "Virtual-Nobody-6630",
          "body": "They were being real for that comment because it's true. We strive for perfection and make choices daily to get towards that goal. It doesn't feel like a choice in the mind of AN but realistically it is. I've been in recover in&out and everything is always a result of my choices I made.",
          "created_utc": 1685303063.0
        },
        {
          "id": "jlzln1b",
          "author": "Eurydice1224",
          "body": "The thing is its nuisanced, i was never interested in being perfect or ultra thin, i still dont know why i went down the past of restricting. It never felt like an active choice to me, more like sliding into a pit",
          "created_utc": 1685306493.0
        },
        {
          "id": "jlzmno2",
          "author": "Virtual-Nobody-6630",
          "body": "A huge characteristic of anorexia is fear of being overweight. If you don't feel you obsess over your weight in an unhealthy manner but still restrict its likely A different type of restrictive eating disorder.",
          "created_utc": 1685306934.0
        }
      ]
    }
  ]
}