{
  "id": "13wroa4",
  "subreddit": "AnorexiaNervosa",
  "author": "username38120",
  "created_utc": 1685552195.0,
  "title": "Has anybody gone through the “transition” from anorexia to binge eating and struggled with the fact that you know you objectively have the self control to stop and you are failing because you can’t?",
  "selftext": "I know this is not necessarily a healthy outlook, but would love to know if others are going through the same thing. I am so far into the binge eating disorder and know that objectively I have proven I have the self control so why can’t I use it right now",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/13wroa4/has_anybody_gone_through_the_transition_from/",
  "score": 142,
  "num_comments": 56,
  "comments": [
    {
      "id": "jmczjel",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1685552195.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmdh2oc",
      "author": "Elfen8",
      "body": "It’s the extreme hunger, your body’s like “I must eat it all because who knows when we’ll eat again”",
      "created_utc": 1685558754.0,
      "score": 46,
      "context": []
    },
    {
      "id": "jmdvcd3",
      "author": "SpinachMountain7174",
      "body": "i go through this too. my ed was at its peak last summer and i wasn’t eating much due to depression. however when fall started i began to have an increased appetite as i felt less depressed and at this point i would hardly say that i am restricting. When i think of how much less i used to eat and how i could in theory still be doing that i feel like the reason is my frame of mind then vs now, i’m just doing better mentally and my self esteem improving has caused me to urge to starve less. when it’s easy to restrict it’s scary",
      "created_utc": 1685564077.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jme4g5f",
      "author": "Rabbit_Ruler",
      "body": "Yes. I have no middle ground, I either eat literally nothing or I eat at every opportunity. I know at first it’s the extreme hunger, but after a while I just keep eating and eating because I can and my brain says why not. I am suffering an awful stomach ache right now because I overate today, and I found out a few days ago I have gastritis, which I believe is because of the yoyo-ing between those two stages.",
      "created_utc": 1685567430.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jmdtxq4",
      "author": "Hedgehognoodle",
      "body": "Not anorexia to BED, but I went from  more typical AN-R to a cycle of restriction alternating with subjective binges (followed by compensatory restriction) before transitioning to being pretty much recovered. I'm having a bit of a relapse into restricting so I'm on ED Reddit to feel less lonely about it lol. \n\nSo many people seem to go from AN-R to AN-BP or bulimia - idk if going from anorexia to BED is becoming more common, or I just see more people talk about it now? \n\nWith the disclaimer that I'm not super knowledgeable about BED, I don't think looking at your current ED and comparing it to your past diagnosis in terms of 'self control' is super helpful. The way I look at it is this - AN-R isn't about being a person with amazing self control. Imo, that's the disorder talking. If anything, AN-R is a loss of control - if someone was in control, why would they starve to death despite trying to get better, as happens with far too many people?",
      "created_utc": 1685563561.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jmf31hx",
      "author": "Discoglitter27",
      "body": "Yes. Yes. Yes. Absolutely. It's confusing and devastating. What helped for me was getting back to a healthy weight, the binges became less. I've been living with this disorder 20 years, and restricting continues to cause the extreme hunger. \nBelieve me, you are not alone, and this absolutely does not make you weak and most definitely indicates nothing about your self control.",
      "created_utc": 1685582073.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jmg4sni",
      "author": "Gwynnja",
      "body": "I was basically only restricting during my first years with a few bouts of „binging“ in between. I went abroad and as soon as I was out of my usual environment started eating nonstop. I gained a massive amount of weight, going from uw to close to ow in 6 months. That was 10 yrs ago and I feel like my body just started regulating and actually having feelings of “full” or “satisfied” this year. Before that I could eat without end, even though I never felt hunger. \nBut I can’t really restrict anymore. Because I need to function for work. Because my body and mind won’t let me. Even though I now I was extremely restrictive, I just can’t anymore. So I sit at my weight and I try (unsuccessfully) to come to terms that the weight I am at now is the weight my body gravitates towards.",
      "created_utc": 1685603646.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jmhsv9z",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1685636577.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jme2gx2",
      "author": "Maya__naise",
      "body": "I'm not gonna say I can understand what you are going through. But I have a slightly similar situation. I've gone for intense restriction to bingeing so often! I've lost control so I get what you mean! Hope you're doing ok! Xx",
      "created_utc": 1685566687.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jmf13nn",
      "author": "418Sunflower418",
      "body": "Me 🙋🏻‍♀️ gone from R-anorexia to bed and back again three times since childhood. Been in treatment for anorexia which did not a darn thing except remind me I can actually eat packaged snacks without dying. Currently in that limbo you feel after trying to recover but failing at it.",
      "created_utc": 1685581216.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jmfau59",
      "author": "polythenepamo",
      "body": "Most people with eating disorders transition between them, and it's also completely normal to binge eat once you start eating again because your body is in starvation mode and it's desperate to get fed. I know it feels like failure but it's just biology, and it happens to everyone. Although it doesn't feel like it, it's actually your body keeping you alive. The only way to stop the cycle is to work on recovery as a whole, that is targeting restriction. I didn't believe this for a long time, I thought I'd just end up bingeing forever. But it ended up being true. Once you start nourishing and re feeding your body properly you won't end up binge eating. Sending love to you I know this process is really hard.",
      "created_utc": 1685585620.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jmgaxvf",
      "author": "RichApprehensive1116",
      "body": "me me",
      "created_utc": 1685608836.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jmgodtp",
      "author": "Yo3xX",
      "body": "Exactly me these times. You're not alone. I've heard it's pretty common to go from anorexia from binge eating disorder. I was mainly recovered behind the two. I think the recovery allowed me to fall into binge eating",
      "created_utc": 1685618949.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jmdruzd",
      "author": "Pedsgunner789",
      "body": "Not anorexia but bulimia to BED, fell into the severely obese category and required medication to finally get things back on track. Like anything else, only hope is to talk to your healthcare professionals and take their advice. In recovery and never been happier or healthier now!",
      "created_utc": 1685562791.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jmefg07",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1685571721.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jmem0h2",
      "author": "verysociable",
      "body": "yes yes yes yes i feel so heard & seen rn. im starting to control it better after like a month, but this totally happens to me too & it’s the most frustrating thing in my life",
      "created_utc": 1685574507.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jmeweqv",
      "author": "Signal-Average-6630",
      "body": "YES! i have felt SO alone with this exact issue.",
      "created_utc": 1685579088.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jmf164j",
      "author": "418Sunflower418",
      "body": "Me 🙋🏻‍♀️ gone from R-anorexia to bed and back again three times since childhood. Been in treatment for anorexia which did not a darn thing except remind me I can actually eat packaged snacks without dying. Currently in that limbo you feel after trying to recover but failing at it. Open to messages if you wanna talk.",
      "created_utc": 1685581247.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jmf273k",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1685581705.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jmf6bom",
      "author": "Feisty-Bumblebee-782",
      "body": "happened to me because of extreme hunger. I became bulimic for a hot minute, then couldn't do it anymore and switched back to restriction. its a vicious cycle",
      "created_utc": 1685583547.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jmgnqoo",
      "author": "antisocial_moth2",
      "body": "Yes. I battled anorexia for many years as a teenager. Now I’m in my 20s & have gained back so much weight. And I know that I have the ability to lose it, but the way I think about doing it is basically bringing me back to my anorexia. I hate being so extreme",
      "created_utc": 1685618558.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jmscmb2",
      "author": "d_aisy100",
      "body": "Absolutely. Honestly, I think this is worse than when I was at my lowest weight and most heavily restricting. I eat myself sick, and I hate it so much. I'm trying really hard to aim for body neutrality and healthy eating rather than self punishment and extreme restriction, but I want so badly to restrict, and I'm so anrgy with myself that I can't get that control back",
      "created_utc": 1685826706.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jmdxqbx",
      "author": "Excellent-World-476",
      "body": "This isn’t about self control. The body is insisting it needs food.",
      "created_utc": 1685564953.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jmdvswd",
      "author": "Usual-Effect1440",
      "body": "Yeah",
      "created_utc": 1685564246.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmddwu7",
      "author": "chaesikdoujiao",
      "body": "You do not go from anorexia to Binge eating disorder. This is nearly impossible. You are reactive eating and it feels like overeating but it is not a binge and it is DEFINITELY not even remotely close to BED. Bed is entirely void of compensatory behaviors and it's used far too frequently in this sub",
      "created_utc": 1685557569.0,
      "score": -22,
      "context": []
    },
    {
      "id": "jptvr2f",
      "author": "None",
      "body": "No, but over a 1 year period I went from being Bolemic to Anorexic. I started off the year at 230, and ended at 140.",
      "created_utc": 1687937957.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmdich4",
      "author": "username38120",
      "body": "Yes! I always hoard food and need to know more food is around and I wondered why that was the case because thankfully I never have not had access to food in my life. I was told that a certain level of starvation and trauma can literally affect your DNA. My grandmother is a holocaust survivor who dealt with unimaginable starvation and I found the research so fascinating",
      "created_utc": 1685559226.0,
      "score": 21,
      "context": [
        {
          "id": "jmdh2oc",
          "author": "Elfen8",
          "body": "It’s the extreme hunger, your body’s like “I must eat it all because who knows when we’ll eat again”",
          "created_utc": 1685558754.0
        }
      ]
    },
    {
      "id": "jpxam7x",
      "author": "weirdbirdboy0",
      "body": "I have that thought every time I eat and so I store food I’ll rarely eat but I can protect it so I can eventually.",
      "created_utc": 1687994751.0,
      "score": 1,
      "context": [
        {
          "id": "jmdh2oc",
          "author": "Elfen8",
          "body": "It’s the extreme hunger, your body’s like “I must eat it all because who knows when we’ll eat again”",
          "created_utc": 1685558754.0
        }
      ]
    },
    {
      "id": "jmeujqe",
      "author": "username38120",
      "body": "It sounds like you are doing really well, and obviously still dealing with daily challenges, but handling them with rational knowledge and practical experience. Proud of you!",
      "created_utc": 1685578258.0,
      "score": 6,
      "context": [
        {
          "id": "jmdvcd3",
          "author": "SpinachMountain7174",
          "body": "i go through this too. my ed was at its peak last summer and i wasn’t eating much due to depression. however when fall started i began to have an increased appetite as i felt less depressed and at this point i would hardly say that i am restricting. When i think of how much less i used to eat and how i could in theory still be doing that i feel like the reason is my frame of mind then vs now, i’m just doing better mentally and my self esteem improving has caused me to urge to starve less. when it’s easy to restrict it’s scary",
          "created_utc": 1685564077.0
        }
      ]
    },
    {
      "id": "jmeunh8",
      "author": "username38120",
      "body": "I am the same way. I go to extremes in ALL aspects of life, and food is honestly the majority of my life right now.",
      "created_utc": 1685578305.0,
      "score": 3,
      "context": [
        {
          "id": "jme4g5f",
          "author": "Rabbit_Ruler",
          "body": "Yes. I have no middle ground, I either eat literally nothing or I eat at every opportunity. I know at first it’s the extreme hunger, but after a while I just keep eating and eating because I can and my brain says why not. I am suffering an awful stomach ache right now because I overate today, and I found out a few days ago I have gastritis, which I believe is because of the yoyo-ing between those two stages.",
          "created_utc": 1685567430.0
        }
      ]
    },
    {
      "id": "jmeuwcq",
      "author": "username38120",
      "body": "Thank you, I know this logically, but practically it is so hard to accept when I know I have the ability and knowledge to change it",
      "created_utc": 1685578414.0,
      "score": 2,
      "context": [
        {
          "id": "jmdtxq4",
          "author": "Hedgehognoodle",
          "body": "Not anorexia to BED, but I went from  more typical AN-R to a cycle of restriction alternating with subjective binges (followed by compensatory restriction) before transitioning to being pretty much recovered. I'm having a bit of a relapse into restricting so I'm on ED Reddit to feel less lonely about it lol. \n\nSo many people seem to go from AN-R to AN-BP or bulimia - idk if going from anorexia to BED is becoming more common, or I just see more people talk about it now? \n\nWith the disclaimer that I'm not super knowledgeable about BED, I don't think looking at your current ED and comparing it to your past diagnosis in terms of 'self control' is super helpful. The way I look at it is this - AN-R isn't about being a person with amazing self control. Imo, that's the disorder talking. If anything, AN-R is a loss of control - if someone was in control, why would they starve to death despite trying to get better, as happens with far too many people?",
          "created_utc": 1685563561.0
        }
      ]
    },
    {
      "id": "jmi4okn",
      "author": "username38120",
      "body": "This means so much to me! Thank you so much",
      "created_utc": 1685641024.0,
      "score": 2,
      "context": [
        {
          "id": "jmf31hx",
          "author": "Discoglitter27",
          "body": "Yes. Yes. Yes. Absolutely. It's confusing and devastating. What helped for me was getting back to a healthy weight, the binges became less. I've been living with this disorder 20 years, and restricting continues to cause the extreme hunger. \nBelieve me, you are not alone, and this absolutely does not make you weak and most definitely indicates nothing about your self control.",
          "created_utc": 1685582073.0
        }
      ]
    },
    {
      "id": "jmi51oq",
      "author": "username38120",
      "body": "I know it sucks, but even from reading this you can tell you are working so hard at recovery. I am so proud of you and proud you are in a place where you are working, traveling etc, and letting your body enjoy those things and be nourished to keep doing what you love",
      "created_utc": 1685641160.0,
      "score": 1,
      "context": [
        {
          "id": "jmg4sni",
          "author": "Gwynnja",
          "body": "I was basically only restricting during my first years with a few bouts of „binging“ in between. I went abroad and as soon as I was out of my usual environment started eating nonstop. I gained a massive amount of weight, going from uw to close to ow in 6 months. That was 10 yrs ago and I feel like my body just started regulating and actually having feelings of “full” or “satisfied” this year. Before that I could eat without end, even though I never felt hunger. \nBut I can’t really restrict anymore. Because I need to function for work. Because my body and mind won’t let me. Even though I now I was extremely restrictive, I just can’t anymore. So I sit at my weight and I try (unsuccessfully) to come to terms that the weight I am at now is the weight my body gravitates towards.",
          "created_utc": 1685603646.0
        }
      ]
    },
    {
      "id": "jmi5dqb",
      "author": "username38120",
      "body": "Girl, SAME. I try to put logic behind these things that don’t make sense",
      "created_utc": 1685641284.0,
      "score": 2,
      "context": [
        {
          "id": "jmhsv9z",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1685636577.0
        }
      ]
    },
    {
      "id": "jmeuzy0",
      "author": "username38120",
      "body": "Hope you are too!! Thanks for making me feel less alone!",
      "created_utc": 1685578460.0,
      "score": 3,
      "context": [
        {
          "id": "jme2gx2",
          "author": "Maya__naise",
          "body": "I'm not gonna say I can understand what you are going through. But I have a slightly similar situation. I've gone for intense restriction to bingeing so often! I've lost control so I get what you mean! Hope you're doing ok! Xx",
          "created_utc": 1685566687.0
        }
      ]
    },
    {
      "id": "jmi4frn",
      "author": "username38120",
      "body": "I definitely feel the eating packages snacks thing. Glad that is a universal thing. I have also recovered from it before (aka lost the weight which is obviously my definition of recovery) but it feels like I have gained so much more know and knowing how much work it took the first time, I honestly don’t know if I have the energy to do it again",
      "created_utc": 1685640935.0,
      "score": 2,
      "context": [
        {
          "id": "jmf13nn",
          "author": "418Sunflower418",
          "body": "Me 🙋🏻‍♀️ gone from R-anorexia to bed and back again three times since childhood. Been in treatment for anorexia which did not a darn thing except remind me I can actually eat packaged snacks without dying. Currently in that limbo you feel after trying to recover but failing at it.",
          "created_utc": 1685581216.0
        }
      ]
    },
    {
      "id": "jmi4u8w",
      "author": "username38120",
      "body": "I appreciate this. It just feels that I have gone soo far into it and can’t stop with the amount I have gained (not sure if I am allowed to post numbers here)",
      "created_utc": 1685641082.0,
      "score": 2,
      "context": [
        {
          "id": "jmfau59",
          "author": "polythenepamo",
          "body": "Most people with eating disorders transition between them, and it's also completely normal to binge eat once you start eating again because your body is in starvation mode and it's desperate to get fed. I know it feels like failure but it's just biology, and it happens to everyone. Although it doesn't feel like it, it's actually your body keeping you alive. The only way to stop the cycle is to work on recovery as a whole, that is targeting restriction. I didn't believe this for a long time, I thought I'd just end up bingeing forever. But it ended up being true. Once you start nourishing and re feeding your body properly you won't end up binge eating. Sending love to you I know this process is really hard.",
          "created_utc": 1685585620.0
        }
      ]
    },
    {
      "id": "jmi52jj",
      "author": "username38120",
      "body": "Oh heyyy",
      "created_utc": 1685641169.0,
      "score": 2,
      "context": [
        {
          "id": "jmgaxvf",
          "author": "RichApprehensive1116",
          "body": "me me",
          "created_utc": 1685608836.0
        }
      ]
    },
    {
      "id": "jmi5ame",
      "author": "username38120",
      "body": "Thank you! I know it is and have “recovered” brim binge eating before (aka lost the weight). But I feel so far gone this time, and knowing how much work it takes from the first time, I honestly don’t know if I have the energy for that right now",
      "created_utc": 1685641251.0,
      "score": 1,
      "context": [
        {
          "id": "jmgodtp",
          "author": "Yo3xX",
          "body": "Exactly me these times. You're not alone. I've heard it's pretty common to go from anorexia from binge eating disorder. I was mainly recovered behind the two. I think the recovery allowed me to fall into binge eating",
          "created_utc": 1685618949.0
        }
      ]
    },
    {
      "id": "jmeurq3",
      "author": "username38120",
      "body": "If you do not mind sharing I would be very curious to know which meds worked for you/ which didn’t. How you advocated to your Dr. to make sure your needs were taken seriously",
      "created_utc": 1685578356.0,
      "score": 2,
      "context": [
        {
          "id": "jmdruzd",
          "author": "Pedsgunner789",
          "body": "Not anorexia but bulimia to BED, fell into the severely obese category and required medication to finally get things back on track. Like anything else, only hope is to talk to your healthcare professionals and take their advice. In recovery and never been happier or healthier now!",
          "created_utc": 1685562791.0
        }
      ]
    },
    {
      "id": "jmev74b",
      "author": "username38120",
      "body": "I DEEPLY relate to feeling like there is nothing wrong with it. I know that is such a problematic thought and restricting comes with so many struggles, but right now I would take those struggles over the bingeing and weight ones any day. So sorry you are dealing with addiction on top of that, proud of you",
      "created_utc": 1685578548.0,
      "score": 1,
      "context": [
        {
          "id": "jmefg07",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1685571721.0
        }
      ]
    },
    {
      "id": "jmev9hs",
      "author": "username38120",
      "body": "I am so glad I could validate someone! How did you get back on track? Would love some advice",
      "created_utc": 1685578577.0,
      "score": 2,
      "context": [
        {
          "id": "jmem0h2",
          "author": "verysociable",
          "body": "yes yes yes yes i feel so heard & seen rn. im starting to control it better after like a month, but this totally happens to me too & it’s the most frustrating thing in my life",
          "created_utc": 1685574507.0
        }
      ]
    },
    {
      "id": "jmex53p",
      "author": "username38120",
      "body": "So sorry you have to feel like this, but so happy that I can validate this awful struggle. Hopefully we will get some amazing advice here",
      "created_utc": 1685579423.0,
      "score": 1,
      "context": [
        {
          "id": "jmeweqv",
          "author": "Signal-Average-6630",
          "body": "YES! i have felt SO alone with this exact issue.",
          "created_utc": 1685579088.0
        }
      ]
    },
    {
      "id": "jmi4mh6",
      "author": "username38120",
      "body": "Thank you! I am actually at a treatment center and have been bouncing from a few the last year. At this point though, I know I will just restrict to lose the weight when I leave so this is just putting it off in a way which makes me even more anxious",
      "created_utc": 1685641002.0,
      "score": 2,
      "context": [
        {
          "id": "jmf273k",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1685581705.0
        }
      ]
    },
    {
      "id": "jmi4pv0",
      "author": "username38120",
      "body": "SO vicious",
      "created_utc": 1685641037.0,
      "score": 1,
      "context": [
        {
          "id": "jmf6bom",
          "author": "Feisty-Bumblebee-782",
          "body": "happened to me because of extreme hunger. I became bulimic for a hot minute, then couldn't do it anymore and switched back to restriction. its a vicious cycle",
          "created_utc": 1685583547.0
        }
      ]
    },
    {
      "id": "jmi54f5",
      "author": "username38120",
      "body": "S.A.M.E",
      "created_utc": 1685641188.0,
      "score": 1,
      "context": [
        {
          "id": "jmgnqoo",
          "author": "antisocial_moth2",
          "body": "Yes. I battled anorexia for many years as a teenager. Now I’m in my 20s & have gained back so much weight. And I know that I have the ability to lose it, but the way I think about doing it is basically bringing me back to my anorexia. I hate being so extreme",
          "created_utc": 1685618558.0
        }
      ]
    },
    {
      "id": "jnetbx7",
      "author": "username38120",
      "body": "I get this so much",
      "created_utc": 1686240880.0,
      "score": 2,
      "context": [
        {
          "id": "jmscmb2",
          "author": "d_aisy100",
          "body": "Absolutely. Honestly, I think this is worse than when I was at my lowest weight and most heavily restricting. I eat myself sick, and I hate it so much. I'm trying really hard to aim for body neutrality and healthy eating rather than self punishment and extreme restriction, but I want so badly to restrict, and I'm so anrgy with myself that I can't get that control back",
          "created_utc": 1685826706.0
        }
      ]
    },
    {
      "id": "jmdgflb",
      "author": "username38120",
      "body": "I appreciate you advocating for people to not use disordered terms loosely as to not invalidate the struggle of others, but I am literally at a treatment center for binge eating disorder right now.\nI know the clinical difference between when I am over eating verses when I am binging. It is possible to have co-occurring disorders and “yo-yo” between the two. In this current struggle with binge eating disorder I have gained an amount of weight equating to half of my original body weight.",
      "created_utc": 1685558519.0,
      "score": 22,
      "context": [
        {
          "id": "jmddwu7",
          "author": "chaesikdoujiao",
          "body": "You do not go from anorexia to Binge eating disorder. This is nearly impossible. You are reactive eating and it feels like overeating but it is not a binge and it is DEFINITELY not even remotely close to BED. Bed is entirely void of compensatory behaviors and it's used far too frequently in this sub",
          "created_utc": 1685557569.0
        }
      ]
    },
    {
      "id": "jptwoyv",
      "author": "None",
      "body": "Every eating disorder is usually trauma related. You have to remember why you started eating so much. For me, I was just uneducated and loved my food like a cat that loves humans to pet it. It was pretty much the only source of dopamine in the house. I became skinny for too many reasons, but mostly because I just couldn't cook food in a place without being harassed. Reading this now it seems ridiculous anyone has this bs happen to them. Lots happier eating correctly in my own kitchen now though. Weigh about 160 rn.",
      "created_utc": 1687938731.0,
      "score": 1,
      "context": [
        {
          "id": "jptvr2f",
          "author": "None",
          "body": "No, but over a 1 year period I went from being Bolemic to Anorexic. I started off the year at 230, and ended at 140.",
          "created_utc": 1687937957.0
        }
      ]
    },
    {
      "id": "jmi6u1f",
      "author": "Gwynnja",
      "body": "That’s very sweet of you :) I wouldn’t say I am working hard, but sometimes letting go a little does the work for one. Or just being in a position where you have to be productive. Wishing you well and all the best xx",
      "created_utc": 1685641826.0,
      "score": 2,
      "context": [
        {
          "id": "jmg4sni",
          "author": "Gwynnja",
          "body": "I was basically only restricting during my first years with a few bouts of „binging“ in between. I went abroad and as soon as I was out of my usual environment started eating nonstop. I gained a massive amount of weight, going from uw to close to ow in 6 months. That was 10 yrs ago and I feel like my body just started regulating and actually having feelings of “full” or “satisfied” this year. Before that I could eat without end, even though I never felt hunger. \nBut I can’t really restrict anymore. Because I need to function for work. Because my body and mind won’t let me. Even though I now I was extremely restrictive, I just can’t anymore. So I sit at my weight and I try (unsuccessfully) to come to terms that the weight I am at now is the weight my body gravitates towards.",
          "created_utc": 1685603646.0
        },
        {
          "id": "jmi51oq",
          "author": "username38120",
          "body": "I know it sucks, but even from reading this you can tell you are working so hard at recovery. I am so proud of you and proud you are in a place where you are working, traveling etc, and letting your body enjoy those things and be nourished to keep doing what you love",
          "created_utc": 1685641160.0
        }
      ]
    },
    {
      "id": "jmii7xy",
      "author": "418Sunflower418",
      "body": "I few that. I haven’t made it anywhere near my highest weight which was during my last swing into bed. But I’m so far from my lw with anorexia. Trying to get back near there, which was healthy for my height, is so frustrating. I’m fighting every single moment of the day to keep going. My habits are not healthy but at least they aren’t on the bed spectrum rn.",
      "created_utc": 1685646074.0,
      "score": 1,
      "context": [
        {
          "id": "jmf13nn",
          "author": "418Sunflower418",
          "body": "Me 🙋🏻‍♀️ gone from R-anorexia to bed and back again three times since childhood. Been in treatment for anorexia which did not a darn thing except remind me I can actually eat packaged snacks without dying. Currently in that limbo you feel after trying to recover but failing at it.",
          "created_utc": 1685581216.0
        },
        {
          "id": "jmi4frn",
          "author": "username38120",
          "body": "I definitely feel the eating packages snacks thing. Glad that is a universal thing. I have also recovered from it before (aka lost the weight which is obviously my definition of recovery) but it feels like I have gained so much more know and knowing how much work it took the first time, I honestly don’t know if I have the energy to do it again",
          "created_utc": 1685640935.0
        }
      ]
    },
    {
      "id": "jmil1l7",
      "author": "polythenepamo",
      "body": "Yeah I totally get that, I felt the same way. I know it's hard but it actually makes sense to try and see the eating disorder as a whole, rather than anorexia and BED separately. Even though they seem like opposites they're part of the same thing. I know this is a really scary and confronting time though, and it makes is extra hard having to deal with it (mostly) alone",
      "created_utc": 1685647146.0,
      "score": 1,
      "context": [
        {
          "id": "jmfau59",
          "author": "polythenepamo",
          "body": "Most people with eating disorders transition between them, and it's also completely normal to binge eat once you start eating again because your body is in starvation mode and it's desperate to get fed. I know it feels like failure but it's just biology, and it happens to everyone. Although it doesn't feel like it, it's actually your body keeping you alive. The only way to stop the cycle is to work on recovery as a whole, that is targeting restriction. I didn't believe this for a long time, I thought I'd just end up bingeing forever. But it ended up being true. Once you start nourishing and re feeding your body properly you won't end up binge eating. Sending love to you I know this process is really hard.",
          "created_utc": 1685585620.0
        },
        {
          "id": "jmi4u8w",
          "author": "username38120",
          "body": "I appreciate this. It just feels that I have gone soo far into it and can’t stop with the amount I have gained (not sure if I am allowed to post numbers here)",
          "created_utc": 1685641082.0
        }
      ]
    },
    {
      "id": "jmfsj2u",
      "author": "Pedsgunner789",
      "body": "I took Contrave which worked pretty well and then also Ozempic, which worked even better. Still on both though I mostly use Contrave as an antidepressant. You have to not purge while on Contrave though, due to the risk of seizures, which has been very motivating to me to stay on track for recovery. Haven’t had any seizures so far.\n\nThe phone call with my doctor was five minutes long. All I said was “hi I’m obese and need help please.” Doctor asked me how obese and I told her the weight then she started Contrave and referred me to endocrinology immediately. Rest of the call was just her explaining what the side effects were and making me promise that I was going to be purge-free. Endocrinology was the team who started Ozempic. \n\nYou won’t get Ozempic if your BMI is not high enough. You can also request a different antidepressant than Contrave if you don’t think you’ll be able to be purge-free, it might not work as well but that’s better than having a seizure which can cause permanent injury. Therapy is also usually an important part of the strategy for most people, though I personally had more success with just medication.",
      "created_utc": 1685594906.0,
      "score": 5,
      "context": [
        {
          "id": "jmdruzd",
          "author": "Pedsgunner789",
          "body": "Not anorexia but bulimia to BED, fell into the severely obese category and required medication to finally get things back on track. Like anything else, only hope is to talk to your healthcare professionals and take their advice. In recovery and never been happier or healthier now!",
          "created_utc": 1685562791.0
        },
        {
          "id": "jmeurq3",
          "author": "username38120",
          "body": "If you do not mind sharing I would be very curious to know which meds worked for you/ which didn’t. How you advocated to your Dr. to make sure your needs were taken seriously",
          "created_utc": 1685578356.0
        }
      ]
    },
    {
      "id": "jmky1qj",
      "author": "verysociable",
      "body": "tbh it’s been hard, but introducing a lil bit of structure & tryna allow myself to eat “normal”-ish & not self sabotaging by going “today i will restrict super hard.” i think like others have said it has a lot to do w extreme hunger, so what’s helped me is finding a balance between honoring that hunger & not overdoing it. and if i am super super hungry i try to go for something that won’t make my tummy hurt / will make me feel fuller longer.\n\nalso remembering that it’s okay to have “off days” & not beating myself up if / when i do binge. just taking it in stride & taking note of how i feel or what led to it so i can ride out the urge next time. i rlly hope this helps & ur able to come out of this soon!! sending love n healing 🤍🤍",
      "created_utc": 1685686749.0,
      "score": 2,
      "context": [
        {
          "id": "jmem0h2",
          "author": "verysociable",
          "body": "yes yes yes yes i feel so heard & seen rn. im starting to control it better after like a month, but this totally happens to me too & it’s the most frustrating thing in my life",
          "created_utc": 1685574507.0
        },
        {
          "id": "jmev9hs",
          "author": "username38120",
          "body": "I am so glad I could validate someone! How did you get back on track? Would love some advice",
          "created_utc": 1685578577.0
        }
      ]
    },
    {
      "id": "jnet31y",
      "author": "username38120",
      "body": "I appreciate this! Thank you",
      "created_utc": 1686240786.0,
      "score": 2,
      "context": [
        {
          "id": "jmfau59",
          "author": "polythenepamo",
          "body": "Most people with eating disorders transition between them, and it's also completely normal to binge eat once you start eating again because your body is in starvation mode and it's desperate to get fed. I know it feels like failure but it's just biology, and it happens to everyone. Although it doesn't feel like it, it's actually your body keeping you alive. The only way to stop the cycle is to work on recovery as a whole, that is targeting restriction. I didn't believe this for a long time, I thought I'd just end up bingeing forever. But it ended up being true. Once you start nourishing and re feeding your body properly you won't end up binge eating. Sending love to you I know this process is really hard.",
          "created_utc": 1685585620.0
        },
        {
          "id": "jmi4u8w",
          "author": "username38120",
          "body": "I appreciate this. It just feels that I have gone soo far into it and can’t stop with the amount I have gained (not sure if I am allowed to post numbers here)",
          "created_utc": 1685641082.0
        },
        {
          "id": "jmil1l7",
          "author": "polythenepamo",
          "body": "Yeah I totally get that, I felt the same way. I know it's hard but it actually makes sense to try and see the eating disorder as a whole, rather than anorexia and BED separately. Even though they seem like opposites they're part of the same thing. I know this is a really scary and confronting time though, and it makes is extra hard having to deal with it (mostly) alone",
          "created_utc": 1685647146.0
        }
      ]
    },
    {
      "id": "jmi44o6",
      "author": "username38120",
      "body": "Thank you! I just started contrave. But trying to figure out how to get it cheaper the next refill. I really want to try ozempic. Prob is I’ve been bouncing from treatment centers so haven’t been in one place long enough to see someone for it.",
      "created_utc": 1685640819.0,
      "score": 2,
      "context": [
        {
          "id": "jmdruzd",
          "author": "Pedsgunner789",
          "body": "Not anorexia but bulimia to BED, fell into the severely obese category and required medication to finally get things back on track. Like anything else, only hope is to talk to your healthcare professionals and take their advice. In recovery and never been happier or healthier now!",
          "created_utc": 1685562791.0
        },
        {
          "id": "jmeurq3",
          "author": "username38120",
          "body": "If you do not mind sharing I would be very curious to know which meds worked for you/ which didn’t. How you advocated to your Dr. to make sure your needs were taken seriously",
          "created_utc": 1685578356.0
        },
        {
          "id": "jmfsj2u",
          "author": "Pedsgunner789",
          "body": "I took Contrave which worked pretty well and then also Ozempic, which worked even better. Still on both though I mostly use Contrave as an antidepressant. You have to not purge while on Contrave though, due to the risk of seizures, which has been very motivating to me to stay on track for recovery. Haven’t had any seizures so far.\n\nThe phone call with my doctor was five minutes long. All I said was “hi I’m obese and need help please.” Doctor asked me how obese and I told her the weight then she started Contrave and referred me to endocrinology immediately. Rest of the call was just her explaining what the side effects were and making me promise that I was going to be purge-free. Endocrinology was the team who started Ozempic. \n\nYou won’t get Ozempic if your BMI is not high enough. You can also request a different antidepressant than Contrave if you don’t think you’ll be able to be purge-free, it might not work as well but that’s better than having a seizure which can cause permanent injury. Therapy is also usually an important part of the strategy for most people, though I personally had more success with just medication.",
          "created_utc": 1685594906.0
        }
      ]
    },
    {
      "id": "jneta1w",
      "author": "username38120",
      "body": "Appreciate you!",
      "created_utc": 1686240861.0,
      "score": 1,
      "context": [
        {
          "id": "jmem0h2",
          "author": "verysociable",
          "body": "yes yes yes yes i feel so heard & seen rn. im starting to control it better after like a month, but this totally happens to me too & it’s the most frustrating thing in my life",
          "created_utc": 1685574507.0
        },
        {
          "id": "jmev9hs",
          "author": "username38120",
          "body": "I am so glad I could validate someone! How did you get back on track? Would love some advice",
          "created_utc": 1685578577.0
        },
        {
          "id": "jmky1qj",
          "author": "verysociable",
          "body": "tbh it’s been hard, but introducing a lil bit of structure & tryna allow myself to eat “normal”-ish & not self sabotaging by going “today i will restrict super hard.” i think like others have said it has a lot to do w extreme hunger, so what’s helped me is finding a balance between honoring that hunger & not overdoing it. and if i am super super hungry i try to go for something that won’t make my tummy hurt / will make me feel fuller longer.\n\nalso remembering that it’s okay to have “off days” & not beating myself up if / when i do binge. just taking it in stride & taking note of how i feel or what led to it so i can ride out the urge next time. i rlly hope this helps & ur able to come out of this soon!! sending love n healing 🤍🤍",
          "created_utc": 1685686749.0
        }
      ]
    }
  ]
}