{
  "id": "14cdjw8",
  "subreddit": "AnorexiaNervosa",
  "author": "TRKevinSpacey",
  "created_utc": 1687071371.0,
  "title": "“You should try intermittent fasting! You can get skinny and eat!”",
  "selftext": "I am what i would considered “recovered”. I work at the same place I worked at while I was really ill, so a lot of my co workers know my issue. So naturally when new coworkers started, the ones who have been there fill them in on the gossip. The thing about healthcare, a lot of them are females so i know how it goes. I’ve overheard the gossip about me when they think they are whispering and you know fucking what? The fact that they think my ED is something to discuss is fucking disgusting. One of my newer coworkers thought it would be helpful to tell me about intermittent fasting, how she lost some kgs by doing it and how i dont have to starve to be skinny. I was taken aback and she isnt even thin, shes clearly overweight, which i have no problem with but i dont need your fucking weight loss methods. I always ate several times a day. I never went a day without eating even while at my LW. I know how to lose weight while eating. I know a bunch of diet fads and methods and i don’t need your input susan. Why dont you tell one of our other coworkers how to lose weight? Why make me feel like i need to do this to lose weight? What weight should i lose? Are my legs too wide or arms too thick? Do i look fat? Like seriously shut the fuck up about how to lose weight you fat fucking bitch.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/14cdjw8/you_should_try_intermittent_fasting_you_can_get/",
  "score": 161,
  "num_comments": 18,
  "comments": [
    {
      "id": "jok5saw",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1687071371.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jokc27b",
      "author": "EmbarrassedAd777",
      "body": "People are oblivious. I feel your frustration wholeheartedly. Do not listen to the morons.",
      "created_utc": 1687076702.0,
      "score": 40,
      "context": []
    },
    {
      "id": "jolzwcu",
      "author": "None",
      "body": "It’s honestly hilarious when overweight or obese people give unsolicited weight loss advice to thin people whether they have an ED or not",
      "created_utc": 1687111758.0,
      "score": 28,
      "context": []
    },
    {
      "id": "joku80h",
      "author": "None",
      "body": "I actually find myself feeling happy for idiots like this… That have absolutely no clue how easily IF can lead to ED, and how damaging eating disorders are.",
      "created_utc": 1687091295.0,
      "score": 23,
      "context": []
    },
    {
      "id": "joka0x7",
      "author": "salmoon_phoenix",
      "body": "My whole trouble with my ED started because of intermittent fasting. And I first stuck to the plan, then tried to see how long I could go without eating. This shit destroys people.\nAnd the fact that your coworkers tell you that stuff knowing full well that you struggled with this goddamn disorder is just messed up. Women are fucked up. I am so sorry that this is happening to you. I hope you can find a safer environment",
      "created_utc": 1687074949.0,
      "score": 45,
      "context": []
    },
    {
      "id": "jolcrmi",
      "author": "musingsofamdc",
      "body": "I just had to go have a team lunch. My senior manager is well aware of my ED, and even reached out to me personally to check on me when it was at its worst and even shared she had struggles as a teen. Then spent the entire lunch telling us about her having to count calories for her summer body and playing the game of “get this food away from me” and “okay fine one more bite!”",
      "created_utc": 1687101192.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jolpfqk",
      "author": "Honest-Paint4782",
      "body": "Intermittent fasting is how I got my ED. It’s insanely common, too. Knowing you had a history of disordered eating and STILL trying to give you weight loss advice? Fuck her",
      "created_utc": 1687107030.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jolx4rk",
      "author": "Hedgehognoodle",
      "body": "I remember being UW in treatment and literally having a OW staff member both give me tips from when she was thin AND ASK ME FOR THEM ☠️☠️☠️ And yeah, the intermittent fasting advice is especially bonkers imo, it just reminds me of how I ate during a period where I was ridiculously non functional and constantly restricting to compensate for eating. Shocking news Susan but even anorexics eat",
      "created_utc": 1687110516.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jom1khm",
      "author": "None",
      "body": "Don’t know what country you live in, but there needs to a be lot more widespread education on anorexia. My niece has a severe case even though she is recovering. We KNOW to never discuss weight or physical appearance with her. Sounds like your co worker is absolutely ignorant to how to interact with someone who has a eating disorder.",
      "created_utc": 1687112499.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jom7g9v",
      "author": "Kittycakes56",
      "body": "Susan 🙄",
      "created_utc": 1687115096.0,
      "score": 3,
      "context": []
    },
    {
      "id": "joniskg",
      "author": "Avalolo",
      "body": "I don’t care what people say, IF is just a sanctioned starve-feed cycle",
      "created_utc": 1687138030.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jolaabf",
      "author": "shoopuwubeboop",
      "body": "Your diet is none of their concern. People need to stfu, no one needs this.",
      "created_utc": 1687100008.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jomrin9",
      "author": "None",
      "body": "I am so sorry. I don't know your working environment, but hardly anything is worth the expense of your mental health. They ARE disgusting if they think someone else's body and mental illness is an appropriate topic of conversation, and you shouldn't take anything they say to heart because of that. In my experience, when people say that kind of thing about you it's usually insecurity, jealousy, or both. Take care of yourself because you are worth it. <3",
      "created_utc": 1687124002.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jonc8ot",
      "author": "icedcoffee16",
      "body": "Just reading this infuriated me. I’m so sorry.",
      "created_utc": 1687134522.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jom2i4g",
      "author": "None",
      "body": "It doesn’t matter if someone is obese or not, don’t give unsolicited weight advice to anyone. It is no one else’s business.",
      "created_utc": 1687112906.0,
      "score": 12,
      "context": [
        {
          "id": "jolzwcu",
          "author": "None",
          "body": "It’s honestly hilarious when overweight or obese people give unsolicited weight loss advice to thin people whether they have an ED or not",
          "created_utc": 1687111758.0
        }
      ]
    },
    {
      "id": "jokq20c",
      "author": "Mjaguacate",
      "body": "Anytime someone says they’re doing intermittent fasting I warn them to be careful for this reason. I don’t want anyone to develop this disorder. They think it’s so simple, but they don’t understand how easy it is to fall into and how difficult it is to stop once it’s started. They’ll never know without experiencing it and I can only hope they heed my warnings and stay ignorant",
      "created_utc": 1687088474.0,
      "score": 17,
      "context": [
        {
          "id": "joka0x7",
          "author": "salmoon_phoenix",
          "body": "My whole trouble with my ED started because of intermittent fasting. And I first stuck to the plan, then tried to see how long I could go without eating. This shit destroys people.\nAnd the fact that your coworkers tell you that stuff knowing full well that you struggled with this goddamn disorder is just messed up. Women are fucked up. I am so sorry that this is happening to you. I hope you can find a safer environment",
          "created_utc": 1687074949.0
        }
      ]
    },
    {
      "id": "joq7pzk",
      "author": "MommaPrune",
      "body": "I've always thought that, too. IF is a socially- sanctioned ED.",
      "created_utc": 1687195796.0,
      "score": 1,
      "context": [
        {
          "id": "joniskg",
          "author": "Avalolo",
          "body": "I don’t care what people say, IF is just a sanctioned starve-feed cycle",
          "created_utc": 1687138030.0
        }
      ]
    },
    {
      "id": "lkn4x3p",
      "author": "UYRDAD",
      "body": "i know right, my ED started because my mom was big on fasting and started telling me about it. i dont blame her and shes a wonderful mom but i cant say she didn't contribute, the rabbit hole down fasting culture led to an ed in just a few months",
      "created_utc": 1725007533.0,
      "score": 2,
      "context": [
        {
          "id": "joka0x7",
          "author": "salmoon_phoenix",
          "body": "My whole trouble with my ED started because of intermittent fasting. And I first stuck to the plan, then tried to see how long I could go without eating. This shit destroys people.\nAnd the fact that your coworkers tell you that stuff knowing full well that you struggled with this goddamn disorder is just messed up. Women are fucked up. I am so sorry that this is happening to you. I hope you can find a safer environment",
          "created_utc": 1687074949.0
        },
        {
          "id": "jokq20c",
          "author": "Mjaguacate",
          "body": "Anytime someone says they’re doing intermittent fasting I warn them to be careful for this reason. I don’t want anyone to develop this disorder. They think it’s so simple, but they don’t understand how easy it is to fall into and how difficult it is to stop once it’s started. They’ll never know without experiencing it and I can only hope they heed my warnings and stay ignorant",
          "created_utc": 1687088474.0
        }
      ]
    }
  ]
}