{
  "id": "15xidd1",
  "subreddit": "AnorexiaNervosa",
  "author": "peanutbutterchocx",
  "created_utc": 1692648195.0,
  "title": "It doesn’t even feel like a disorder anymore",
  "selftext": "I don’t even know if I’m doing this as a hobby or is this disordered or just a way to lose weight anymore.\n\nI was on vacation and just enjoyed it, ate lots of food everyday without feeling guilty. Just always thinking in the back of my head “I’ll lose it when I go home”. I was literally eating so much and enjoying it. The day after I got home I started restricting just like that, even purging… \n\nLike I don’t even know what this means how can I go from fully normal eating to this in a day and is this even a disorder anymore or am I just doing this because I can? \n\n(I was recovered for 7 years and relapsed last year but am always going back to recovery and relapses keep happening)",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/15xidd1/it_doesnt_even_feel_like_a_disorder_anymore/",
  "score": 124,
  "num_comments": 12,
  "comments": [
    {
      "id": "jx6eexi",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1692648196.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jx6kt0d",
      "author": "418Sunflower418",
      "body": "I have days like this too, op. Days where eating anything is easy and I don’t count it out or measure or anything, followed by days where I can’t take a bite of something without anxiety.",
      "created_utc": 1692650486.0,
      "score": 55,
      "context": []
    },
    {
      "id": "jx6sgkv",
      "author": "Katio_The_Cat",
      "body": "Thank you so much for writing this because I was just on a road trip with my family and I ate completely normal and actually enjoyed food. I did have a thought or two about purging, weight gain and calories, but it was very minimal. Now that I'm home, I want to kms for eating and being so relaxed about it. I feel so fake, like I'm doing it for attention or as a 'trend'.",
      "created_utc": 1692653314.0,
      "score": 41,
      "context": []
    },
    {
      "id": "jx7eo7r",
      "author": "famous_zebra28",
      "body": "This is pretty common, being put in a completely different environment, one that you are otherwise enjoying, it becomes a great distraction and allows you to turn off the nonstop alarms but once you return to your usual environment and routine you return back to your “normal”/baseline. \n\nI have days in general like this, it’s rare not to have these days even if they’re very very rare. Enjoy it. Use it as a reminder that things don’t have to be like this forever. \n\nI’m glad you were able to enjoy yourself during your vacation and I hope that you’re able to use it as a motivator even if it’s only a tiny drop of fresh water into a very deep, dark puddle.",
      "created_utc": 1692662485.0,
      "score": 24,
      "context": []
    },
    {
      "id": "jx6laqi",
      "author": "Kandtwurst",
      "body": "Same here.\nDuring holidays I am more relaxed (! =relaxed) and even was hungry during lunch time. \n\nBack home, restricting again.",
      "created_utc": 1692650667.0,
      "score": 17,
      "context": []
    },
    {
      "id": "jxa5q3e",
      "author": "SadDragon_666",
      "body": "I’m so glad this post was made because I’ve been feeling like such an imposter",
      "created_utc": 1692717512.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jxcjivx",
      "author": "skepticlycorrect",
      "body": "Wow thanks for posting this, means a lot to see someone else understands.\n\nSometimes I’m sure I’m all alone with these thoughts and I’m just f**kedup beyond repair…\n\nJust wanted to say thank you",
      "created_utc": 1692750349.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jxb89v9",
      "author": "Mysterious-Depth3890",
      "body": "are we the same person because we are so scarily similar.. i was just on holiday and i ate so much i dont know if thats because of my meds or because i was more relaxed but i also had those thoughts of “i will lose it later” and stuff. you arent alone and you arent faking this disorder. the way i see it, anorexia is very anxiety based and when im less anxious, i tend to be a bit more relaxed about food. of course the thoughts will still be there, but they tend to lessen. when you were on holiday, the thoughts may have been quieter because there was less stress of everyday life. im not going to speak for you and say thats true, but it could be the case. im rambling on but i hope it makes sense. you are so valid and you arent faking it. everyone suffers differently and it doesnt mean its fake. hope things get better for you<3",
      "created_utc": 1692731744.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jxcureb",
      "author": "surrealgarbage",
      "body": "There’s something about going on vacation that makes the disorder feel distant and unimportant, like I’m in a different world and it’s all fake and none of this is real so I can just eat whatever I want while it lasts. Currently on vacation w the fam and have definitely gained a bit, at least that’s what I think. I’ve thought about it but it hasn’t made me spiral, I am so sure once I get back home tho I will lose my mind",
      "created_utc": 1692755253.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jx8p4ck",
      "author": "peanutbutterchocx",
      "body": "Exactly it feels so fake, like we can switch it on and off. But tbh not eating during holidays sounds pretty sad right, glad you enjoyed it!",
      "created_utc": 1692687134.0,
      "score": 10,
      "context": [
        {
          "id": "jx6sgkv",
          "author": "Katio_The_Cat",
          "body": "Thank you so much for writing this because I was just on a road trip with my family and I ate completely normal and actually enjoyed food. I did have a thought or two about purging, weight gain and calories, but it was very minimal. Now that I'm home, I want to kms for eating and being so relaxed about it. I feel so fake, like I'm doing it for attention or as a 'trend'.",
          "created_utc": 1692653314.0
        }
      ]
    },
    {
      "id": "jx8p7x6",
      "author": "peanutbutterchocx",
      "body": "Thank you!",
      "created_utc": 1692687211.0,
      "score": 3,
      "context": [
        {
          "id": "jx7eo7r",
          "author": "famous_zebra28",
          "body": "This is pretty common, being put in a completely different environment, one that you are otherwise enjoying, it becomes a great distraction and allows you to turn off the nonstop alarms but once you return to your usual environment and routine you return back to your “normal”/baseline. \n\nI have days in general like this, it’s rare not to have these days even if they’re very very rare. Enjoy it. Use it as a reminder that things don’t have to be like this forever. \n\nI’m glad you were able to enjoy yourself during your vacation and I hope that you’re able to use it as a motivator even if it’s only a tiny drop of fresh water into a very deep, dark puddle.",
          "created_utc": 1692662485.0
        }
      ]
    },
    {
      "id": "jx8p5c7",
      "author": "peanutbutterchocx",
      "body": "Same I never ate 3 meals before 😁",
      "created_utc": 1692687156.0,
      "score": 5,
      "context": [
        {
          "id": "jx6laqi",
          "author": "Kandtwurst",
          "body": "Same here.\nDuring holidays I am more relaxed (! =relaxed) and even was hungry during lunch time. \n\nBack home, restricting again.",
          "created_utc": 1692650667.0
        }
      ]
    }
  ]
}