{
  "id": "16bc28a",
  "subreddit": "AnorexiaNervosa",
  "author": "Maartje-1717",
  "created_utc": 1693979534.0,
  "title": "How are some people anorexic for years without someone noticing?",
  "selftext": "I see alot of people on here saying they've had anorexia for years but no one knows, and im just wondering how? When my ed started to get worse my parents noticed within a couple months that i went from the low end of nw to very uw and i was immediatly hospitalised. I get that not everyone is a minor or lives with their parents but how does family / friends / people at work not notice?\nI know it probably sounds so rude but how do you have anorexia and not lose enough in like half a year or less for people to notice? I feel like i sound like such an asshole and like im trying to be \"best anorexic\" but i genuinely don't get it",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/16bc28a/how_are_some_people_anorexic_for_years_without/",
  "score": 115,
  "num_comments": 65,
  "comments": [
    {
      "id": "jzce3av",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1693979534.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzcrmbt",
      "author": "No-Employee2948",
      "body": "Start out at obese... then everyone cheers on your ED 🥳🥳🥳\n\nDon't even have to lie or hide it.  \n\nNow UW and noone bats an eye when I skip meals or freak out because I \"ate too much\" or can't calculate what I've eaten.",
      "created_utc": 1693989773.0,
      "score": 200,
      "context": []
    },
    {
      "id": "jzd4poh",
      "author": "None",
      "body": "You’re ignored as an adult.  If you have family that don’t care and zero friends, you can go your whole adult life without intervention.  This goes for all mental health struggles.  You can be suicidal as adult and get sent home from an ER with zero follow up.",
      "created_utc": 1693999119.0,
      "score": 127,
      "context": []
    },
    {
      "id": "jzcjt2r",
      "author": "yellowwaterbottles",
      "body": "I found out later on that friends were “worried” and would talk about it apparently but I had no idea until well after the fact that they even knew, this was in high school 🤷🏼‍♀️ and more recently, I’m just an adult now and people have less of an influence and reach into my life",
      "created_utc": 1693983558.0,
      "score": 54,
      "context": []
    },
    {
      "id": "jzcf0we",
      "author": "FerdieHeart",
      "body": "Being male, for me. Too naturally muscular from my testosterone for anybody to care at all.",
      "created_utc": 1693980170.0,
      "score": 46,
      "context": []
    },
    {
      "id": "jzcfem1",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1693980428.0,
      "score": 41,
      "context": []
    },
    {
      "id": "jzch54p",
      "author": "Traditional-Milk-467",
      "body": "They encouraged it. I went from obese to slowly climbing my way to uw. My family encouraged my \"healthy weight loss\" until I got too low and couldn't stop. My aunt an hour away called my mom after a family get together and had to point out how sick I really was. That was 8 years of battling my ed and 2 years into that episode. Everyone was blind to my suffering. Now, 10 years later of when i first slipped into my ed, and 2 years into recovery, my family has learned quite a bit and isn't letting any slight sign or setback go unnoticed. It's a learning game for all of them yet but if it wasn't for my aunt, I probably wouldn't be here",
      "created_utc": 1693981634.0,
      "score": 36,
      "context": []
    },
    {
      "id": "jzczpde",
      "author": "hanls",
      "body": "To be fair, mine is mild and has been for years. My family runs small. At worst I just get comments from my mum to “not get to skinny” or “don’t loose any more weight” but she had an ED that I don’t think she is 100% recovered from (does anyone really?) I’m a picky eater and 75% recovered so I just look like I’m really petite naturally. Since I’ve maintained around this weight since I was a kid, no one really noticed expect for my other Ana friend",
      "created_utc": 1693995968.0,
      "score": 37,
      "context": []
    },
    {
      "id": "jzdko0l",
      "author": "None",
      "body": "Start overweight and you'll see everyone congratulate you for it.",
      "created_utc": 1694006835.0,
      "score": 22,
      "context": []
    },
    {
      "id": "jzd2vvn",
      "author": "scrambled-satellite",
      "body": "Depends on the type of anorexia, extent of behaviors, etc.\nI was always underweight or very close to underweight as a child so it was “normal”. When I was younger and my Ed started, I used to chew&spit and would not heavily restrict- instead I would do mostly compulsive exercise. Some of my behaviors like food hoarding were ignored for “just being gross” and turning down sweets, etc were praised for “being healthy”. I was an athlete and that usually edged out my ED. \nIt was only when I became an adult that food restriction became super central to my ED. I mostly just overexercised before, but when I had my recent relapse it was deep restriction & excessive exercise. Honestly my s/o and parents did not know I was struggling with anorexia until nearly 9 months into my relapse when I broke down completely. I was experiencing really bad health consequences and was underweight. I lied often and told everyone my stomach hurt a lot to avoid eating so they thought I had some other kind of condition going on.",
      "created_utc": 1693998047.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jzd3qj9",
      "author": "DNetherdrake",
      "body": "I'm a man, and people just don't consider that men can be anorexic. I'm pretty sure it's as simple as that for me. People have been worried about my eating habits before, but just in the sense of calling them unhealthy rather than assuming/figuring out I had an eating disorder.",
      "created_utc": 1693998550.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jzcttue",
      "author": "Automatic-Will-9154",
      "body": "My Parents simply ignore 😸",
      "created_utc": 1693991558.0,
      "score": 17,
      "context": []
    },
    {
      "id": "jzcrawf",
      "author": "Pigmentvlek420",
      "body": "cos I've always been a weird/picky eater, so they see it as 'typical me' behaviour. 🤷‍♀️",
      "created_utc": 1693989512.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jzebvly",
      "author": "Sufficient-Truth9562",
      "body": "Sometimes people just don't care about you enough to notice. Sometimes people don't want to notice or deal with you. \nSometimes your starting point is not \"skinny\", so people think it's a good thing you are loosing weight. \nSometimes anorexic ppl are just very good at hiding and lying.\nSometimes you just don't have any close people in your life.",
      "created_utc": 1694017072.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jzdffkl",
      "author": "WastingTime1994",
      "body": "I work from home and don’t really have many friends so the only person who would notice is my husband and he’s oblivious. He knows nothing about eating disorders so I make no effort to hide my behaviors and he doesn’t bat an eye. \nI know he would offer me help and be concerned if I just talked to him and explained, but I kinda like living in the dark. It mean I’m the only one who has to worry about me.",
      "created_utc": 1694004527.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jzf3cb3",
      "author": "amborg",
      "body": "People have noticed, but ultimately we’re just coworkers and what are they going to do?",
      "created_utc": 1694026682.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jzdlaq9",
      "author": "Background-Ad-4987",
      "body": "When you're an adult, people definitely notice, but usually they just praise you for the weight loss and how \"good\" you're looking now.",
      "created_utc": 1694007103.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jzeuq7o",
      "author": "Proper-Argument4743",
      "body": "I live alone, I have no friends and I have have a job but no colleagues (and I rarely ever see my boss).\n\nI only have my family and every time I see my grandparents they raise concerns and my mom says I have to eat more, but I convinced her I’m at a healthy weight and she believes me. \n\nBeing this isolated, who would really notice?\n\nI sometimes imagine strangers look at me strange, but I don’t know if that’s all in my head or if it’s true.",
      "created_utc": 1694023672.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jzdu0x7",
      "author": "alexisseffy",
      "body": "We can get very sneaky as to hide ed behaviors and weight loss. Also the weight loss wasn't always consistent. I'd get underweight then gain some back to the low end of normal during a binge phase. This is often the case for those with AN b/p who might not lose as consistently as someone with AN-R and therefore not hit as low of a bmi",
      "created_utc": 1694010573.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jzgmasi",
      "author": "fruitfulfairy",
      "body": "EDs are a mental disorder, not a weight disorder. something like 6% of people with EDs are underweight. even people with anorexia usually end up binging and not able to reach their gw anyway bc the body does everything it can to protest it.",
      "created_utc": 1694047158.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jzfda7e",
      "author": "Anasertia",
      "body": "I am vegan also, it helps people think that my weird eating habits are because im a health freak or something",
      "created_utc": 1694030144.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jzeg2t3",
      "author": "Ok_Cranberry_5050",
      "body": "because anorexia does not mean weight loss and it does not go away once you eat more or gain weight",
      "created_utc": 1694018559.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jze92a5",
      "author": "Allie00124252683",
      "body": "I told everyone I had dietary restrictions, I wore tons of baggy clothes and my parents just wanted me to be pretty so.  They said nothing.",
      "created_utc": 1694016065.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jzf2bo7",
      "author": "uhohspaggyp",
      "body": "i used to be like this but the second i moved away from home, it just got thrown under the bus. i’m not even 21 yet and people just don’t care once you’re an adult unless you’re dead",
      "created_utc": 1694026333.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jzdahkm",
      "author": "cookiethumpthump",
      "body": "I was always either an appropriate (albeit low) weight or drinking, so no could tell I wasn't eating much. Now the habit is so engrained and I'm sober, so...",
      "created_utc": 1694002171.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jzdducv",
      "author": "Penya23",
      "body": "I am (was) a master at knowing how to dress to cover myself up. I was also fantastic at eating very slowly and casually spitting my food out in my napkin or giving it to a pet (if it was safe for them) and of course casually going to the bathroom to get it all out. \n\nWhen people noticed the weight loss, I used stress/anxiety as an excuse for as long as possible...but then there comes a time when you cant hide it anymore.......",
      "created_utc": 1694003783.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jzdlye8",
      "author": "spicychilipowder",
      "body": "I have always been small -but if someone noticed me getting smaller, I blamed it on things such as medication and stomach problems.",
      "created_utc": 1694007375.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jzewvwy",
      "author": "None",
      "body": "i only wore oversized clothing for a long time so the only noticeable weight loss to others was in my face which they could have easily assumed was typical loss of baby fat, and i was already an extremely picky eater so me becoming pickier wasn't that surprising. i will say though that my parents had already emotionally checked out when it came to raising me by the time i had full blown an so i think there's probably a chance that they *did* know but didn't care",
      "created_utc": 1694024434.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jzg5j1l",
      "author": "vtiredsloth",
      "body": "first off people can have anorexia at any weight??? so maybe get that into your head (unless you're a DSM purist and subscribing to that BS). for me when I was in high school I've always been naturally small so no one noticed getting a bit smaller. I hid my weight loss under baggy clothes and the only real meal of a day I'd eat was with my parents. denial is a hell of a drug.",
      "created_utc": 1694040196.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jzhc1cz",
      "author": "thatmilf87",
      "body": "No one notices in my life. I’ve been going at it for the last half year. Lost over 80 pounds super fast and have been steadily losing and everyone is cheering me on. I’m pretty sick. I look a little emaciated. You can see it in my face. But it’s “Good job” and “You look so good” not “Can I help you?” “Are you okay”",
      "created_utc": 1694058515.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jzdljmq",
      "author": "FragileInside",
      "body": "I agree with everyone saying start at a higher weight. I started at a high weight, and when my parents noticed my weight loss, my mom said “whatever you’re doing, keep it up.” That was 15 years ago and I’m still doing it, 5 hospitalizations later.",
      "created_utc": 1694007204.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jzdv1ei",
      "author": "Usual-Effect1440",
      "body": "because I force myself to recover, force myself to eat",
      "created_utc": 1694010954.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jzjn7x8",
      "author": "None",
      "body": "No one gives a fuck except my family. I cryptically joke about my anorexia sometimes with my friends but they don’t give a fuck. They see it as my “lore” and not something I could die of. I get the most compliments on my body when I’m extremely underweight. People are oblivious or just don’t care.",
      "created_utc": 1694102426.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jzk5f8v",
      "author": "Eastern_Success198",
      "body": "I have been underweight ever since i was born. Only time my eating is paid any attention to is when i binge. Then i get the \"wow youre eating all that?!\" comments. Or when i gain to normal weight people are worried that im \"depressed\" simply because im eating with them in situations i wouldnt normally.\n\nSo in short: nobody cares about me that much.",
      "created_utc": 1694109731.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jzu93j1",
      "author": "Vanceisrad97",
      "body": "It's usually us bigger folks that suffer with it for years without anyone noticing. It's been nearly 13 years that I've been like this and nobody has noticed.",
      "created_utc": 1694280407.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jzeqfbs",
      "author": "sewupyourskull",
      "body": "i struggled for around 7 years before anyone noticed or knew. some people have family and friends who aren’t as attentive to that sort of thing. also, not everyone’s body is as easily affected — there were times where no matter how low i res, i didn’t lose. it all depends!",
      "created_utc": 1694022173.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jzevql0",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1694024031.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jzewefa",
      "author": "shakethedisease666",
      "body": "For me it was bc I was generally “fit” my whole life and when I had to go into inpatient and confronted people around me they were surprised and said “I just thought you were a very athletic person”",
      "created_utc": 1694024262.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jzfbzlm",
      "author": "EchoConsistent3858",
      "body": "I did get noticed but parents caused me trauma that caused me to have anorexia so I couldn’t get out of it because of survival mode and having to numb and be very lazy so I had to struggle but now trying to recover",
      "created_utc": 1694029701.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jzicpus",
      "author": "califoruication",
      "body": "My mother was 98 pounds when she got married. I am petite just like her, so when my weight fluctuates between a large range, it usually just gets dismissed. \n\nAlso, the amount of weight you lose does not define your anorexia. Anorexia is defined by thought patterns and behaviors - not weight. People can engage in anorexic behaviors and not lose weight / not lose a LOT of weight. It depends on the person's metabolism and which behaviors they're indulging in.",
      "created_utc": 1694083172.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jzllnri",
      "author": "None",
      "body": "Because diet culture and having an eating disorder are very close in many aspects that many people can't tell the two apart.\n\nSeriously... I see so many Facebook moms posting the calories in every single meal they have and saying how they were \"so good lol\" because they stayed under a certain amount. Imagine how these parents react when their kids start restricting.\n\nEven influencers post recipes that could be qualified as an \"ED meal\" if it were posted on a different forum.\n\nJust some food for thought. Our culture truly does inspire anorexic behaviors if you think about it.",
      "created_utc": 1694130020.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jzp9edt",
      "author": "Consistent_Leather_1",
      "body": "I don’t want to sound rude and ignorant as well but I’ve been wondering. I’ve went from “obese” to “almost underweight” in 6 months and pretty much everyone noticed there was something wrong, while my family was very concerned. I never ended up underweight but I can’t imagine how someone could suffer for a decade right in front of someone’s eyes and they’re so good at hiding it that no one notices it.",
      "created_utc": 1694194414.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l6dx0ni",
      "author": "Efficient_Carpet_589",
      "body": "I've always been skinny, and I think my clothes hide it alot so no one really sees the full extent, anything they do see they probably think is natural",
      "created_utc": 1717105722.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l73grhs",
      "author": "ReadingStoriez",
      "body": "My parents noticed me losing weight but only because my sister used to be deep in anorexia and looked like a skeleton, so they learned from their mistakes and made me eat and talk to a therapist. My friends on the other hand always complimented me on my “hourglass body” and being pretty bcs i was thin",
      "created_utc": 1717523334.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzff3ef",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1694030769.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzgl4g1",
      "author": "Della0w0",
      "body": "Family forcing their own disorder on to me :/",
      "created_utc": 1694046665.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzh7hci",
      "author": "Low-Bit2048",
      "body": "High restricting for years and go from overweight to underweight. People got worried only when my limbs got the shape of a q-tip.",
      "created_utc": 1694056317.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzhikb8",
      "author": "TiredInsomnaic",
      "body": "For me it was just because I had neglectful parents who would take my food away as punishment when I was a kid. My mom always told me that no matter what I do it's my own fault and choice, so I'll have to deal with the consequences myself. Also as for my friends, they more or so congratulated me or called me lucky for being so thin despite being deathly uw. It really just depends on environment, age, and how the people around you act. I'm in a highschool where no matter how bad your health is or even if you're bleeding out (has happened) no teacher or student bats an eye unless they're your friend and care about you. Even then the administrators really don't gaf. As for home, my mom is still too busy now as an adult to focus on how much I'm eating or how much I weigh since she's building her career at the moment.",
      "created_utc": 1694062037.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzilihw",
      "author": "Aggravating-Day-925",
      "body": "Commenting to follow",
      "created_utc": 1694087833.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzez0ku",
      "author": "thrwawy888i",
      "body": "this is the way",
      "created_utc": 1694025182.0,
      "score": 15,
      "context": [
        {
          "id": "jzcrmbt",
          "author": "No-Employee2948",
          "body": "Start out at obese... then everyone cheers on your ED 🥳🥳🥳\n\nDon't even have to lie or hide it.  \n\nNow UW and noone bats an eye when I skip meals or freak out because I \"ate too much\" or can't calculate what I've eaten.",
          "created_utc": 1693989773.0
        }
      ]
    },
    {
      "id": "jzhxaj6",
      "author": "ThaliaLotus",
      "body": "This ^^^^ legit exhibiting many signs of disordered eating and people compliment you on your “discipline” and you get all the “how to you have to motivation to do so much exercise I could never”",
      "created_utc": 1694071996.0,
      "score": 14,
      "context": [
        {
          "id": "jzcrmbt",
          "author": "No-Employee2948",
          "body": "Start out at obese... then everyone cheers on your ED 🥳🥳🥳\n\nDon't even have to lie or hide it.  \n\nNow UW and noone bats an eye when I skip meals or freak out because I \"ate too much\" or can't calculate what I've eaten.",
          "created_utc": 1693989773.0
        }
      ]
    },
    {
      "id": "jzo4t56",
      "author": "Various_Bathroom_241",
      "body": "This is what’s happening to me right now.. I haven’t been eating well at all for two months and everyone is congratulating me for losing weight so fast..",
      "created_utc": 1694179408.0,
      "score": 4,
      "context": [
        {
          "id": "jzcrmbt",
          "author": "No-Employee2948",
          "body": "Start out at obese... then everyone cheers on your ED 🥳🥳🥳\n\nDon't even have to lie or hide it.  \n\nNow UW and noone bats an eye when I skip meals or freak out because I \"ate too much\" or can't calculate what I've eaten.",
          "created_utc": 1693989773.0
        }
      ]
    },
    {
      "id": "jzincf8",
      "author": "sancta-simplicitas",
      "body": "This wasn't my experience. I went from obese to my current weight and I've only been met with at best people being uncomfortable and at worst being ridiculed.",
      "created_utc": 1694088681.0,
      "score": 3,
      "context": [
        {
          "id": "jzcrmbt",
          "author": "No-Employee2948",
          "body": "Start out at obese... then everyone cheers on your ED 🥳🥳🥳\n\nDon't even have to lie or hide it.  \n\nNow UW and noone bats an eye when I skip meals or freak out because I \"ate too much\" or can't calculate what I've eaten.",
          "created_utc": 1693989773.0
        }
      ]
    },
    {
      "id": "lioy145",
      "author": "2481012",
      "body": "i saw my old teacher on a run that used to bully me when i was much bigger….he told me i looked so much better and must be mentally better and then asked to hug me while tearing up????💀💀💀 bro all i did was lose weight and move to online",
      "created_utc": 1723972862.0,
      "score": 3,
      "context": [
        {
          "id": "jzcrmbt",
          "author": "No-Employee2948",
          "body": "Start out at obese... then everyone cheers on your ED 🥳🥳🥳\n\nDon't even have to lie or hide it.  \n\nNow UW and noone bats an eye when I skip meals or freak out because I \"ate too much\" or can't calculate what I've eaten.",
          "created_utc": 1693989773.0
        }
      ]
    },
    {
      "id": "jzdz9u3",
      "author": "lowkeydeadinside",
      "body": "hell even with family that cares, they might genuinely be clueless. my dad doesn’t notice my body, at all really. and my mom just thinks it’s anxiety/stress/whatever because she genuinely doesn’t believe in anorexia in adults. only teen girls have that. she herself struggled with bulimia as a young adult, but she knows i don’t have bulimia, and apparently that’s the only eating disorder. my mom cares, and notices when i lose and tries to feed me, but she can’t imagine it ever being an actual eating disorder or something i’m doing intentionally.",
      "created_utc": 1694012536.0,
      "score": 35,
      "context": [
        {
          "id": "jzd4poh",
          "author": "None",
          "body": "You’re ignored as an adult.  If you have family that don’t care and zero friends, you can go your whole adult life without intervention.  This goes for all mental health struggles.  You can be suicidal as adult and get sent home from an ER with zero follow up.",
          "created_utc": 1693999119.0
        }
      ]
    },
    {
      "id": "jzf94fe",
      "author": "wEirdwFoOd",
      "body": "yes, real emphasis on having no friends / family that doesn’t really care or enables you. you’ll just fly under the radar no matter how thin or unstable you become.",
      "created_utc": 1694028701.0,
      "score": 8,
      "context": [
        {
          "id": "jzd4poh",
          "author": "None",
          "body": "You’re ignored as an adult.  If you have family that don’t care and zero friends, you can go your whole adult life without intervention.  This goes for all mental health struggles.  You can be suicidal as adult and get sent home from an ER with zero follow up.",
          "created_utc": 1693999119.0
        }
      ]
    },
    {
      "id": "jzck3wx",
      "author": "yellowwaterbottles",
      "body": "As for work, I wonder if they may have noticed but not said anything, it was very physically demanding and I am very weak. One manager I think caught on and started to talk to me but he left soon after",
      "created_utc": 1693983786.0,
      "score": 12,
      "context": [
        {
          "id": "jzcjt2r",
          "author": "yellowwaterbottles",
          "body": "I found out later on that friends were “worried” and would talk about it apparently but I had no idea until well after the fact that they even knew, this was in high school 🤷🏼‍♀️ and more recently, I’m just an adult now and people have less of an influence and reach into my life",
          "created_utc": 1693983558.0
        }
      ]
    },
    {
      "id": "jzgaaec",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1694042131.0,
      "score": 1,
      "context": [
        {
          "id": "jzcfem1",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1693980428.0
        }
      ]
    },
    {
      "id": "jzddvot",
      "author": "brown-foxy-dog",
      "body": "this is my situation too. it’s definitely still right under the surface, but now that i’m older and have things like work and bills that take precedence, it’s more mild and doesn’t consume me like it used too. the comments from my mom and sister are the same as your mom, they keep a semi eye out for it, but definitely not pressingly concerned. i prefer it this way - i have a few good days a week that make up for the bad days, but i’m not on the brink of death and i feel much more balanced. i don’t think i’ll ever fully recover, but if i can balance this disorder a bit, i feel like that’s a success for me.",
      "created_utc": 1694003801.0,
      "score": 15,
      "context": [
        {
          "id": "jzczpde",
          "author": "hanls",
          "body": "To be fair, mine is mild and has been for years. My family runs small. At worst I just get comments from my mum to “not get to skinny” or “don’t loose any more weight” but she had an ED that I don’t think she is 100% recovered from (does anyone really?) I’m a picky eater and 75% recovered so I just look like I’m really petite naturally. Since I’ve maintained around this weight since I was a kid, no one really noticed expect for my other Ana friend",
          "created_utc": 1693995968.0
        }
      ]
    },
    {
      "id": "jzg6qgl",
      "author": "jaysbaddecisions",
      "body": "yes thank you!!! like i don’t understand how OP doesn’t understand that having anorexia doesn’t meaning losing weight and being visibly unhleathy??",
      "created_utc": 1694040683.0,
      "score": 12,
      "context": [
        {
          "id": "jzeg2t3",
          "author": "Ok_Cranberry_5050",
          "body": "because anorexia does not mean weight loss and it does not go away once you eat more or gain weight",
          "created_utc": 1694018559.0
        }
      ]
    },
    {
      "id": "jzgaeqj",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1694042179.0,
      "score": 1,
      "context": [
        {
          "id": "jzevql0",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1694024031.0
        }
      ]
    },
    {
      "id": "jzgak68",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1694042241.0,
      "score": 1,
      "context": [
        {
          "id": "jzff3ef",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1694030769.0
        }
      ]
    },
    {
      "id": "kxvzmeu",
      "author": "None",
      "body": "unrelated but happy cake day",
      "created_utc": 1712167542.0,
      "score": 2,
      "context": [
        {
          "id": "jzcrmbt",
          "author": "No-Employee2948",
          "body": "Start out at obese... then everyone cheers on your ED 🥳🥳🥳\n\nDon't even have to lie or hide it.  \n\nNow UW and noone bats an eye when I skip meals or freak out because I \"ate too much\" or can't calculate what I've eaten.",
          "created_utc": 1693989773.0
        },
        {
          "id": "jzo4t56",
          "author": "Various_Bathroom_241",
          "body": "This is what’s happening to me right now.. I haven’t been eating well at all for two months and everyone is congratulating me for losing weight so fast..",
          "created_utc": 1694179408.0
        }
      ]
    },
    {
      "id": "ljaw753",
      "author": "Balljointedbunny",
      "body": "Tearing up is crazy work. He needs to settle his ass down 😭",
      "created_utc": 1724286816.0,
      "score": 5,
      "context": [
        {
          "id": "jzcrmbt",
          "author": "No-Employee2948",
          "body": "Start out at obese... then everyone cheers on your ED 🥳🥳🥳\n\nDon't even have to lie or hide it.  \n\nNow UW and noone bats an eye when I skip meals or freak out because I \"ate too much\" or can't calculate what I've eaten.",
          "created_utc": 1693989773.0
        },
        {
          "id": "lioy145",
          "author": "2481012",
          "body": "i saw my old teacher on a run that used to bully me when i was much bigger….he told me i looked so much better and must be mentally better and then asked to hug me while tearing up????💀💀💀 bro all i did was lose weight and move to online",
          "created_utc": 1723972862.0
        }
      ]
    },
    {
      "id": "jzgcdg0",
      "author": "hanls",
      "body": "I think sometimes as with all things harm reduction. Safety is superior to recovery and if safety means you occasionally relapse and it’s mild versus full blown relapse well a win is a win. \n\nThat’s the principal I use with myself too because if I outright said no I would get way worse way quicker. Many good days outweighs a bad week, and I feel so much better than I did back then. But if I got upset at myself for every time I fumbled I would abandon recovery",
      "created_utc": 1694042993.0,
      "score": 5,
      "context": [
        {
          "id": "jzczpde",
          "author": "hanls",
          "body": "To be fair, mine is mild and has been for years. My family runs small. At worst I just get comments from my mum to “not get to skinny” or “don’t loose any more weight” but she had an ED that I don’t think she is 100% recovered from (does anyone really?) I’m a picky eater and 75% recovered so I just look like I’m really petite naturally. Since I’ve maintained around this weight since I was a kid, no one really noticed expect for my other Ana friend",
          "created_utc": 1693995968.0
        },
        {
          "id": "jzddvot",
          "author": "brown-foxy-dog",
          "body": "this is my situation too. it’s definitely still right under the surface, but now that i’m older and have things like work and bills that take precedence, it’s more mild and doesn’t consume me like it used too. the comments from my mom and sister are the same as your mom, they keep a semi eye out for it, but definitely not pressingly concerned. i prefer it this way - i have a few good days a week that make up for the bad days, but i’m not on the brink of death and i feel much more balanced. i don’t think i’ll ever fully recover, but if i can balance this disorder a bit, i feel like that’s a success for me.",
          "created_utc": 1694003801.0
        }
      ]
    },
    {
      "id": "lldyd0k",
      "author": "2481012",
      "body": "bro i know😭 he went from kindergarten to continuation school with kids on probation… he was so interesting",
      "created_utc": 1725407299.0,
      "score": 1,
      "context": [
        {
          "id": "jzcrmbt",
          "author": "No-Employee2948",
          "body": "Start out at obese... then everyone cheers on your ED 🥳🥳🥳\n\nDon't even have to lie or hide it.  \n\nNow UW and noone bats an eye when I skip meals or freak out because I \"ate too much\" or can't calculate what I've eaten.",
          "created_utc": 1693989773.0
        },
        {
          "id": "lioy145",
          "author": "2481012",
          "body": "i saw my old teacher on a run that used to bully me when i was much bigger….he told me i looked so much better and must be mentally better and then asked to hug me while tearing up????💀💀💀 bro all i did was lose weight and move to online",
          "created_utc": 1723972862.0
        },
        {
          "id": "ljaw753",
          "author": "Balljointedbunny",
          "body": "Tearing up is crazy work. He needs to settle his ass down 😭",
          "created_utc": 1724286816.0
        }
      ]
    }
  ]
}