{
  "id": "16ppgnk",
  "subreddit": "AnorexiaNervosa",
  "author": "califoruication",
  "created_utc": 1695426924.0,
  "title": "Everybody's been noticing my weight gain",
  "selftext": "Everybody is saying now that I look \"so healthy\" and \"so much better\" because it's very obvious I've gained weight since I stopped doing drugs about two months ago... and it's killing me. I'm sure we can all agree that us people with EDs don't like to be told we \"look healthy\" because our goal is to look practically unhealthily skinny, right? Or at least that's my goal...\n\nThis is so triggering. I've been so triggered for weeks now. I feel like I'll never lose this weight and I'll just keep gaining and gaining until I'm what I perceive on myself to be \"fat.\"  I'm so scared. I feel like this is the beginning of the end for me in a way. I feel like I'll never have the body I'm content with again. I'm 23 years old, this is about the age where your body's metabolism slows down. I'll just keep gaining, won't I....",
  "url": "https://i.redd.it/0xy3g4apawpb1.jpg",
  "score": 170,
  "num_comments": 6,
  "comments": [
    {
      "id": "k1scrzs",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1695426924.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k1sm8vg",
      "author": "poisonedminds",
      "body": "Metabolism doesn't slow down at 23. It actually pretty much stays the same from 20 to 60.",
      "created_utc": 1695431070.0,
      "score": 71,
      "context": []
    },
    {
      "id": "k1sfprc",
      "author": "_nachtkalmar_",
      "body": "Where did you ever hear that your metabolism slows down with 23? Facts are that starving slows down your metabolism. I think you are not thinking straight, love. Trapped in anxiety and not seeing clearly. Of course you can stay slim and be fit. The people are trying to be supportive, and unfortunately don't know better. They just mean, you don't look like death anymore.  Congratulations for kicking the drugs, such an achievement. I hope you have support, it seems like you have to fight a lot of fights, and deserve all the help you can get. Best wishes.",
      "created_utc": 1695428209.0,
      "score": 64,
      "context": []
    },
    {
      "id": "k1vrgjh",
      "author": "None",
      "body": "please don't let these stupid comments upset you. i know how it feels and i know that me saying this doesn't mean anything but people can be so insensitive, i hope you take good care of your body, and i hope you find healing. eds are fucking exhausting.",
      "created_utc": 1695491665.0,
      "score": 11,
      "context": []
    },
    {
      "id": "k1xt6j2",
      "author": "Discoglitter27",
      "body": "Oh my goooooodddddd I am SO sorry! I went through this too, it's awful \"you look so much better healthy etc\" it's like, no! No! Not helpful! No one should say anything ever. \n\nI'm 39, still fighting with this stupid disorder. When I was 23, I had also gained weight and ended up hiding inside because I was so worried I would hear these comments. I ended up missing my ex-boyfriend's funeral, and I really regret that I let it stop me from going.\n\nIt is an amazing accomplishment to quit drugs!!!! Please give yourself the credit you deserve 💕 yes, I also want to appear unhealthily skinny, so when I don't it feels like I've failed. I haven't failed. Nor have you. We are absolutely winning. And chances are, the ED perception of yourself is dysmorphia. \n\nOh! And - I should add - no changes in my metabolism since I was 20, only slows when I start restricting. The more frequently I eat, the more I'm able to get nutrition on a regular basis, the faster the metabolism goes.",
      "created_utc": 1695521540.0,
      "score": 9,
      "context": []
    },
    {
      "id": "k1yh1ki",
      "author": "wEirdwFoOd",
      "body": "i know they mean well but i wish people would keep\ncomments like this to themselves. hearing we gained weight even if it “looks good” or worse “healthy” is literally the last thing someone who suffers from\nan eating disorder wants to hear. sending you so much love and support, you’ll get through this. stay strong 💗",
      "created_utc": 1695534608.0,
      "score": 3,
      "context": []
    }
  ]
}