{
  "id": "16wvjz7",
  "subreddit": "AnorexiaNervosa",
  "author": "Losing_lab",
  "created_utc": 1696148546.0,
  "title": "What the fuck",
  "selftext": "",
  "url": "https://i.redd.it/20168pigwjrb1.jpg",
  "score": 202,
  "num_comments": 17,
  "comments": [
    {
      "id": "k2z42xn",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1696148548.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k30elge",
      "author": "rileyyj001",
      "body": "Jesus Christ. People are so misinformed about EDs, it’s unbelievable. \n\nYeah, sure. Let me just *not* develop a debilitating, and deadly mental illness. Because doing so, was *totally* at the top of my to-do list.",
      "created_utc": 1696174954.0,
      "score": 92,
      "context": []
    },
    {
      "id": "k2zgq0z",
      "author": "Katio_The_Cat",
      "body": "What😭😭😭 I have way too many questions",
      "created_utc": 1696158399.0,
      "score": 42,
      "context": []
    },
    {
      "id": "k30nap1",
      "author": "notevenhere344",
      "body": "aw man!! there goes my plan for the weekend, then. /s",
      "created_utc": 1696178291.0,
      "score": 36,
      "context": []
    },
    {
      "id": "k30s4py",
      "author": "wEirdwFoOd",
      "body": "“it’s just dumb” such an embarrassing look for her omg… apparently having a mental illness is dumb now. this makes me sick.. i’m so sorry you have to deal with this.",
      "created_utc": 1696180129.0,
      "score": 32,
      "context": []
    },
    {
      "id": "k305f78",
      "author": "fClary16",
      "body": "Sooo confused??",
      "created_utc": 1696171262.0,
      "score": 13,
      "context": []
    },
    {
      "id": "k30hxza",
      "author": "howtodisappear7",
      "body": "I would reply “no, YOU’RE just dumb”…. 😠 wtf",
      "created_utc": 1696176256.0,
      "score": 9,
      "context": []
    },
    {
      "id": "k32ocok",
      "author": "Fresssshhhhhhh",
      "body": "You dont \"get\" an eating disorder, it isn't a cold. It's a serious mental health issue, normies think we choose this or get it randomly.",
      "created_utc": 1696205527.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k346sd2",
      "author": "runninginbubbles",
      "body": "But you did say \"I'm not hungry\" 😅😅 \n\nJokes aside I'm so sorry 😔",
      "created_utc": 1696235868.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k34hx52",
      "author": "pythonidaae",
      "body": "\"Oh shit you're right. Go get a psychology doctorate and publish a ground breaking paper on that. Maybe you'll save people from the most lethal mental health disorder in existence. Just tell people  \"don't be anorexic\" 👏\" \n\n\n(On a serious note I've been recovering and therapy is literally just me doing all the work and my therapist being like uh ...just eat!! Me talking about disordered impulses and I get a \"don't do that!\". Mind blown. Less than useless but it's a way to hold me accountable.)",
      "created_utc": 1696244431.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k31lyd4",
      "author": "KendallJennersPasta1",
      "body": "Waiting for the day people will stop acting like getting an eating disorder is a choice. We are totally fucking loving it here",
      "created_utc": 1696190491.0,
      "score": 8,
      "context": []
    },
    {
      "id": "k332lly",
      "author": "pathologicalprotest",
      "body": "K, I’ll just kick it then, thanks, mom!",
      "created_utc": 1696211564.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k355owm",
      "author": "chickentittyenjoyer",
      "body": "it is dumb. anorexia is dumb. but YOU are not! the ED is objectively stupid as fuck, which makes me hate having it even more. it feels almost unfair to be plagued with anorexia living in my brain throwing stupid thoughts at me that make no logical sense half of the time.",
      "created_utc": 1696256267.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k39ek47",
      "author": "Throwaway_Z4L",
      "body": "What the actual fuck… I am so sorry OP",
      "created_utc": 1696324895.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k3igrb8",
      "author": "ViolentlyProletarian",
      "body": "You're mom sounds...lovely",
      "created_utc": 1696467521.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k30rlpg",
      "author": "None",
      "body": "It’s amazing people like this just don’t get it. If it was choice and I can just look in the mirror and say I like what I see. I would have done it by now. It’s amazing people thinks that this is a choice! It’s a mental illness! “Don’t get an eating disorder—“ like bitch are you dumb? 😑 That’s almost like saying “Don’t get a life,” but you’re already alive, so how would that make sense? I would have replied back and said \n\n“Mom, it’s amazing for someone that’s lived all these years and had me, that you could be so misinformed alongside having a childlike mentality. What possessed you to say something so misguided and childish? What’s dumb is the way you approached the situation and had the galls to say something so unnecessarily uneducated. And for that, I hope you re-read this message to understand where you went wrong. May you relearn your ways and seek help before trying to help and understand your own daughter. You’re clearly traumatized and don’t know how to talk to people. Ciao.”",
      "created_utc": 1696179931.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k339gsx",
      "author": "MinnieMay9",
      "body": "Mine too!! Whatever will we do now? Guess I'll have to find a new \"fun hobby\" to start",
      "created_utc": 1696214582.0,
      "score": 5,
      "context": [
        {
          "id": "k30nap1",
          "author": "notevenhere344",
          "body": "aw man!! there goes my plan for the weekend, then. /s",
          "created_utc": 1696178291.0
        }
      ]
    }
  ]
}