{
  "id": "170qm5k",
  "subreddit": "AnorexiaNervosa",
  "author": "RevolutionarySmoke22",
  "created_utc": 1696533381.0,
  "title": "opened up about relapsing. this felt invalidating..like I need to “prove” it now and be the sickest..the skinniest. does anyone else struggle with this thought?",
  "selftext": "",
  "url": "https://i.redd.it/3f42ljrrofsb1.jpg",
  "score": 116,
  "num_comments": 21,
  "comments": [
    {
      "id": "k3m75bp",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1696533381.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k3n75i4",
      "author": "ViolentlyProletarian",
      "body": "People with OCD know that they're acting irrationally but still persist with that behavior. They know what's going on but feel like they can't stop. They often relapse back into compulsive or obsessive behaviors. They are still valid with their disorder.",
      "created_utc": 1696546806.0,
      "score": 63,
      "context": []
    },
    {
      "id": "k3ngd8o",
      "author": "havenrayne",
      "body": "This person clearly doesn't know anything about Ed's and made you feel invalidated in your experience. In my opinion, that isn't a friend you should keep around. You're completely valid for wanting to reach out and just because you aren't \"sickly thin\" doesn't mean you aren't mentally sick. Ed's are horrible and they eat away at you for years. Try to reach out to a support network (family, friends, or therapist) that will actually support you, and if that isn't available then be that supportive person for yourself as hard as that sounds. Only you know truly how you feel and how you react, and realizing that you're the only person who can help yourself really saved me in the height of anorexia. You're a strong person and you wanting to open up and be vulnerable about it shows that you want more for yourself. Be safe and know thay you aren't alone <3",
      "created_utc": 1696550799.0,
      "score": 24,
      "context": []
    },
    {
      "id": "k3nb5yz",
      "author": "crymyself2sleep3000",
      "body": "Jeesh , I’m sorry this person you spoke to reacted in that invalidating way… People without EDs don’t understand at all and never will until they go through it themselves . The fact this person had the audacity to say “you’re just balling” when you relayed a vulnerable thing to them shows that they aren’t an empathetic or self aware human - feel bad for them that they can’t meet people where they are . For yourself, your eating disorder and how you feel about it are VALID!!! The only weight you need to lose is this person from your life ! You don’t need to prove your illness to anyone because this illness isn’t about them, it’s about you. Stop seeking external validation and things may get better - I’m saying this because I noticed my ED coincides with wanting people to like me or think I’m skinny as well or approve of me. People don’t matter , YOU DO- anorexia doesn’t define you, it’s not part of you even if it feels like it is. It’s not your friend even when it feels like it’s the only thing that understands . You know what you need to do - be honest with yourself about what you can do to get back on track 🫶",
      "created_utc": 1696548540.0,
      "score": 10,
      "context": []
    },
    {
      "id": "k3ny24t",
      "author": "Pristine-Ad-5375",
      "body": "whoever said that to u is so horrid im so sorry, u dont deserve that :(",
      "created_utc": 1696558427.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k3o4nqm",
      "author": "fClary16",
      "body": "They’re a total idiot! I’m really sorry ❤️",
      "created_utc": 1696561478.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k3qcl22",
      "author": "Sufficient-Truth9562",
      "body": "So I think you know that thats not true...\nTbh seems like you gotta drop this person/set boundaries so they won't say stuff like that.",
      "created_utc": 1696607917.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k3qegkx",
      "author": "surrealgarbage",
      "body": "wow that person just sounds really ignorant like they just do noooot know how eating disorders work at ALL. I know it still hurts to receive any comments on ur ed bc it is a rlly vulnerable subject but pls try not to let this silly person get to you, they clearly don’t know what they’re talking about. Maybe take this opportunity to educate them on the matter, but if you don’t have the patience or emotional energy to do that that is totally fine too, it isn’t ur job to have to teach ppl how to respect you and your struggles.",
      "created_utc": 1696608603.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k3vid01",
      "author": "PJAzv",
      "body": "EDs are disorders of control ahead of anything else. So being in control is not equal to not being sick. It s the contrary",
      "created_utc": 1696698295.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k3rfas2",
      "author": "indiesfilm",
      "body": "clearly doesn’t know anything about ana or EDs in general if he thinks it’s something that just happens to you. im recovered now but of course i remember what it’s like, you’re extremely aware of what you’re doing. food was all i thought about, of course i was in control, that’s what it’s all about— but that’s different from having the control to switch it on and off. screw him, that’s honestly so gross to say",
      "created_utc": 1696622058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k3tkcoo",
      "author": "None",
      "body": "They don't know what they are talking about \n\nBeing aware of your problem doesn't mean it's not that bad sometimes it just means your not delusional you just have a bad mindset and you know it \n\nBut don't focus on what others think because in reality we will never be fully understood by other people\n\nIf your struggling you should find better support groups and focus on yourself\n\nYou and your friend both I feel like have bad mindsets rn but it's okay because there is a part of you that's better than all that you just gotta grow in that yk",
      "created_utc": 1696659188.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k3rxh6u",
      "author": "Me-effy",
      "body": "Ed’s are a mental disorder not a weight disorder so if you are thinking that just because you’re not underweight and that means you’re not sick enough it means you are sick and you all deserve help (only 6% of people with eating disorders are underweight) you all deserve recovery and trust me it’s hard and you’ll have bad days but it’s so worth it <3",
      "created_utc": 1696629013.0,
      "score": 0,
      "context": []
    },
    {
      "id": "k3om279",
      "author": "MrVelocoraptor",
      "body": "I get those thoughts a lot - like I have to prove it.. I go to online ED meetings and I'm constantly judging how I look in the camera, and I often hold my arms in to make my shoulders look more thin, it's.... weird haha... I definitely live my life trying to fit in and so when I'm in groups I am always trying to prove to them that I fit in, that I'm normal. It comes back to having little love for myself and hoping others see something in me that's good, but then when they compliment me, I downplay it because I feel I don't deserve it. EDs YAY!",
      "created_utc": 1696572121.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k532mlj",
      "author": "FindingAlaska13",
      "body": "They may be trying to help so you don't feel so bad... but they may not realize the impact",
      "created_utc": 1697438750.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kbsha93",
      "author": "LyukaInky",
      "body": "People are so misinformed and stupid when it comes to anorexia. Nobody believes I have anorexia either because of the same reason and because I don't look like a skeleton. It's so annoying smh",
      "created_utc": 1701590197.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k3n832k",
      "author": "RevolutionarySmoke22",
      "body": "I know rationally. I know my ed is all about control and so are a lot of others, so of course what he said is not true. It still hits a nerve, though. :(",
      "created_utc": 1696547207.0,
      "score": 8,
      "context": [
        {
          "id": "k3n75i4",
          "author": "ViolentlyProletarian",
          "body": "People with OCD know that they're acting irrationally but still persist with that behavior. They know what's going on but feel like they can't stop. They often relapse back into compulsive or obsessive behaviors. They are still valid with their disorder.",
          "created_utc": 1696546806.0
        }
      ]
    },
    {
      "id": "k3pk3u8",
      "author": "ShadySinner",
      "body": "As a person with OCD, can confirm.",
      "created_utc": 1696596668.0,
      "score": 2,
      "context": [
        {
          "id": "k3n75i4",
          "author": "ViolentlyProletarian",
          "body": "People with OCD know that they're acting irrationally but still persist with that behavior. They know what's going on but feel like they can't stop. They often relapse back into compulsive or obsessive behaviors. They are still valid with their disorder.",
          "created_utc": 1696546806.0
        }
      ]
    },
    {
      "id": "k3qun72",
      "author": "pescemilk",
      "body": "hey, something important to remember here, and maybe even point out to him: it is an eating disorder, because you Arent in control. everyone tries to word it like that, like youre just Choosing to eat less for right now, like its just a diet. but lets put it like this, could you honestly go back to eating like you used to starting tomorrow, with no issue? not counting, stressing, worrying or freaking out about the food/weight? unless your answer is genuinely yes, then the reality is that you are not the one in control; your disorder is. what he said is incredibly misinformed and harmful to say to you, and im so sorry. its not personal though i know it feels like it, so many non-ed people really cant wrap their heads around the base concept of this disorder, hence the \"just eat a burger\" rhetoric being such a common joke now, since a lot of them genuinely dont understand why that isnt a simple solution. im so sorry and i feel for you, please try to value yourself more than his hurtful words.",
      "created_utc": 1696614492.0,
      "score": 7,
      "context": [
        {
          "id": "k3n75i4",
          "author": "ViolentlyProletarian",
          "body": "People with OCD know that they're acting irrationally but still persist with that behavior. They know what's going on but feel like they can't stop. They often relapse back into compulsive or obsessive behaviors. They are still valid with their disorder.",
          "created_utc": 1696546806.0
        },
        {
          "id": "k3n832k",
          "author": "RevolutionarySmoke22",
          "body": "I know rationally. I know my ed is all about control and so are a lot of others, so of course what he said is not true. It still hits a nerve, though. :(",
          "created_utc": 1696547207.0
        }
      ]
    },
    {
      "id": "k3pl99y",
      "author": "kenscrack",
      "body": "x2",
      "created_utc": 1696597198.0,
      "score": 2,
      "context": [
        {
          "id": "k3n75i4",
          "author": "ViolentlyProletarian",
          "body": "People with OCD know that they're acting irrationally but still persist with that behavior. They know what's going on but feel like they can't stop. They often relapse back into compulsive or obsessive behaviors. They are still valid with their disorder.",
          "created_utc": 1696546806.0
        },
        {
          "id": "k3pk3u8",
          "author": "ShadySinner",
          "body": "As a person with OCD, can confirm.",
          "created_utc": 1696596668.0
        }
      ]
    },
    {
      "id": "k3pm78u",
      "author": "Thisladydoesntcare",
      "body": "×3",
      "created_utc": 1696597627.0,
      "score": 1,
      "context": [
        {
          "id": "k3n75i4",
          "author": "ViolentlyProletarian",
          "body": "People with OCD know that they're acting irrationally but still persist with that behavior. They know what's going on but feel like they can't stop. They often relapse back into compulsive or obsessive behaviors. They are still valid with their disorder.",
          "created_utc": 1696546806.0
        },
        {
          "id": "k3pk3u8",
          "author": "ShadySinner",
          "body": "As a person with OCD, can confirm.",
          "created_utc": 1696596668.0
        },
        {
          "id": "k3pl99y",
          "author": "kenscrack",
          "body": "x2",
          "created_utc": 1696597198.0
        }
      ]
    }
  ]
}