{
  "id": "189dnd2",
  "subreddit": "AnorexiaNervosa",
  "author": "cuandocon",
  "created_utc": 1701552633.0,
  "title": "just saw a comment that started with “as a recovering anorexic…” and ended with “eating disorders are a choice”",
  "selftext": "gave me a headache fr\n\nall of the comments were from non disordered people and those who are “a recovering __” saying the same thing. 1k likes on YouTube too\n\nI really need to get off the internet cause it feel like everyone is a trigger",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/189dnd2/just_saw_a_comment_that_started_with_as_a/",
  "score": 117,
  "num_comments": 24,
  "comments": [
    {
      "id": "kbqcfck",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1701552634.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kbqyi5z",
      "author": "sorcerers_apprentice",
      "body": "When I had anorexia, it felt like a choice in some ways.\n\nNow that I’m recovered and can see how warped my brain was…there’s no way it was a choice. You just can’t choose to think like that or act that way.",
      "created_utc": 1701561908.0,
      "score": 56,
      "context": []
    },
    {
      "id": "kbqd9kz",
      "author": "None",
      "body": "This is just so dumb. How the hell would someone choose to be sick? It’s disgusting to even think this. It’s like saying a cancer patient have blame for being sick",
      "created_utc": 1701552973.0,
      "score": 60,
      "context": []
    },
    {
      "id": "kbqfbzv",
      "author": "None",
      "body": "I choose to not have it. \n*waiting for it to disappear*\n\n\nJokes aside, I feel like especially when I’m relapsing, I choose to not recover and have it but, not in a healthily I’m chosen it for myself way. In a delusional sick way. Then, it is a mental distortion and delusions disorder while making this choice.",
      "created_utc": 1701553810.0,
      "score": 20,
      "context": []
    },
    {
      "id": "kbqfdzw",
      "author": "Katttio",
      "body": "It's like the 'you're a girl, why are you hating like a man?' meme",
      "created_utc": 1701553832.0,
      "score": 16,
      "context": []
    },
    {
      "id": "kbqvpil",
      "author": "existentialdread0",
      "body": "Ugh that's such a dangerous statement for anyone to put out there and it makes me ill to hear that it's coming from someone claiming to be a part of our community. It's also just flat out false considering the mountains of scientific research out there about eating disorders (especially the studies with fMRI imaging). \n\nAs a psychology major who has struggled with anorexia for 11 years, don't listen to that garbage.",
      "created_utc": 1701560678.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kbronki",
      "author": "savannahruns",
      "body": "Tbh when I was deepest in my ED I totally believed it was a choice and that I could quit anytime I wanted so I was fine.",
      "created_utc": 1701573554.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kbr6n2e",
      "author": "tamorgzz",
      "body": "Maybe they meant recovery is a choice you have choose every single day? That sentiment I can completely attest to.",
      "created_utc": 1701565460.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kbquq2p",
      "author": "Pro_Ana_Online",
      "body": "I have definitely met at least some people who have recovered who characterize it as a choice and thus dismissing all those who struggle (the \"just pull yourself out of it\" crowd), as well as many from the outside who dismiss those struggling too as just \"seeking attention\", etc.",
      "created_utc": 1701560248.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kbsurfq",
      "author": "YearConsistent2894",
      "body": "That’s so fucking twisted. How would ANYONE chose to suffer like that?! \n\nAs an anorexic and a recovering alcoholic: it’s not a choice. People keep telling me I‘m just to weak willed, that’s why I became an alcoholic, and it hurt. I almost died from withdrawals and in general, being addicted is HELL. Like, really. The same goes for anorexia. So many people act like it’s a choice. It is NOT. Recovery may be a choice, but becoming sick isn’t.\n\nEdit: By saying recovery is a choice, I mean it in a way that it’s ourselves who decide to get better, even when it’s fucking hard. Not saying that we can just chose to be healthy again. Trying to fight against it is a choice, but one needs to be in the right head space to want to recover, and not everyone is. So it’s only KIND OF a choice.",
      "created_utc": 1701601114.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kbrb98w",
      "author": "sallyfacebiitch",
      "body": "I'm in recovery - I chose to try my hardest to recover because of my unborn son. I work hard as fuck to not relapse but I think about it often. I still see the \"benefits\" of anorexia, I still think the same mentally ill things. Except now, my concern is my son and not why I have anorexia. Recovery is a choice and a hard one at that; mental illness is **not.**",
      "created_utc": 1701567505.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kbskq3z",
      "author": "madiigator",
      "body": "Having an ED is not a choice, it’s just as much an uncontrollable disorder as depression, anxiety, bpd etc. However, just like dealing with those disorders, it is a choice to take the necessary steps to getting better.",
      "created_utc": 1701592862.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kbsvzxr",
      "author": "Naohiro-son-Kalak",
      "body": "They’re not anorexic as well; they don’t even have an eating disorder half the time… they’ve just had disordered eating briefly at a point in their life (which is something to got to a therapist for) but can’t truly empathize with the years of struggle anorexia is…",
      "created_utc": 1701602126.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kbseb1i",
      "author": "bohoprincess77",
      "body": "I don't think anyone chooses to be sick, but you can choose to recover.",
      "created_utc": 1701587954.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kbtbnrb",
      "author": "choccycatmilk",
      "body": "Not eating might be a choice, buying food and then purging my meal afterwards are several choices. But I didn’t choose them based on free will. Stealing a gold necklace is a choice too. But what if I did it to pay someone off who is threatening to harm me? \nIt’s obviously not the same, but there are similarities that might help somebody non disordered to understand. I got bed & obese bc if I didn’t use food to somehow manage my emotions in my teens, I would’ve seriously harmed or k*lled myself. Now I have bulimia because I still can’t handle extreme emotions therefore I binge, but I also couldn’t handle going back to being obese. For my brain, purging seems like the ONLY path to survive in that moment, not a fun little option I could just not choose and still be fine..",
      "created_utc": 1701612386.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kbqkw1u",
      "author": "Dry_Cut_9386",
      "body": "as someone w anorexia myself i can say it’s definitely a choice and everyone w it is choosing that path for themselves yall just ain’t ready to face that yet..",
      "created_utc": 1701556089.0,
      "score": -17,
      "context": []
    },
    {
      "id": "kbtos07",
      "author": "lyutichushki",
      "body": "Who the hell would choose to have an eating disorder",
      "created_utc": 1701618380.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kbuckk2",
      "author": "NamazSasz",
      "body": "My therapy team keep telling me this too to be fair and that I just don’t want it enough. It really frustrates me because I want to get healthy but u just don’t know how. They showed me strategies yes but it’s so hard I feel like I don’t have what it takes",
      "created_utc": 1701627372.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kf42267",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1703678079.0,
      "score": 1,
      "context": [
        {
          "id": "kbqyi5z",
          "author": "sorcerers_apprentice",
          "body": "When I had anorexia, it felt like a choice in some ways.\n\nNow that I’m recovered and can see how warped my brain was…there’s no way it was a choice. You just can’t choose to think like that or act that way.",
          "created_utc": 1701561908.0
        }
      ]
    },
    {
      "id": "kbtf2n1",
      "author": "sherbeana",
      "body": "Please don’t compare this to cancer… how is that at ALL the same?\n\nI see people commenting “you can ‘choose’ to recover from ED but you can’t ‘choose’ to be sick”. Well you can’t really “choose” to recover from cancer… therapy is not the same as radiation “therapy”… \n\nI have suffered with anorexia for years but would happily take this over cancer any fucking day.",
      "created_utc": 1701614103.0,
      "score": 7,
      "context": [
        {
          "id": "kbqd9kz",
          "author": "None",
          "body": "This is just so dumb. How the hell would someone choose to be sick? It’s disgusting to even think this. It’s like saying a cancer patient have blame for being sick",
          "created_utc": 1701552973.0
        }
      ]
    },
    {
      "id": "kbqtcuz",
      "author": "VioletSky246",
      "body": "I don't think anyone \"chooses\" to be mentally ill but ok",
      "created_utc": 1701559664.0,
      "score": 13,
      "context": [
        {
          "id": "kbqkw1u",
          "author": "Dry_Cut_9386",
          "body": "as someone w anorexia myself i can say it’s definitely a choice and everyone w it is choosing that path for themselves yall just ain’t ready to face that yet..",
          "created_utc": 1701556089.0
        }
      ]
    },
    {
      "id": "kbrb89w",
      "author": "Kittycakes56",
      "body": "Yes. Totally. \nToday I CHOOSE to be miserable and sick. Absolutely 100 love this lifestyle for myself. Maybe one day I'll CHOOSE to die because I love it sooooo much. \n\nYou're dumb for even suggesting it's a choice.",
      "created_utc": 1701567493.0,
      "score": 5,
      "context": [
        {
          "id": "kbqkw1u",
          "author": "Dry_Cut_9386",
          "body": "as someone w anorexia myself i can say it’s definitely a choice and everyone w it is choosing that path for themselves yall just ain’t ready to face that yet..",
          "created_utc": 1701556089.0
        }
      ]
    },
    {
      "id": "kf7dazg",
      "author": "sorcerers_apprentice",
      "body": "I relapsed over and over again for 10 years before recovering - how much of that was me vs. the illness vs. life circumstances vs. the toxic treatment centers I was in, I dunno. It doesn’t matter.\n\nI think you have to be gentle with yourself. All you can do is move forward and try to focus on recovery.",
      "created_utc": 1703725867.0,
      "score": 1,
      "context": [
        {
          "id": "kbqyi5z",
          "author": "sorcerers_apprentice",
          "body": "When I had anorexia, it felt like a choice in some ways.\n\nNow that I’m recovered and can see how warped my brain was…there’s no way it was a choice. You just can’t choose to think like that or act that way.",
          "created_utc": 1701561908.0
        },
        {
          "id": "kf42267",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1703678079.0
        }
      ]
    },
    {
      "id": "kbtfd8w",
      "author": "None",
      "body": "Sorry that I triggered you. You can’t really “choose” to cure a disease, that’s the whole point of my comment. You can change “cancer” in my comment to ANY OTHER DISEASE.",
      "created_utc": 1701614242.0,
      "score": 13,
      "context": [
        {
          "id": "kbqd9kz",
          "author": "None",
          "body": "This is just so dumb. How the hell would someone choose to be sick? It’s disgusting to even think this. It’s like saying a cancer patient have blame for being sick",
          "created_utc": 1701552973.0
        },
        {
          "id": "kbtf2n1",
          "author": "sherbeana",
          "body": "Please don’t compare this to cancer… how is that at ALL the same?\n\nI see people commenting “you can ‘choose’ to recover from ED but you can’t ‘choose’ to be sick”. Well you can’t really “choose” to recover from cancer… therapy is not the same as radiation “therapy”… \n\nI have suffered with anorexia for years but would happily take this over cancer any fucking day.",
          "created_utc": 1701614103.0
        }
      ]
    },
    {
      "id": "kc05mmr",
      "author": "None",
      "body": "I get where you’re coming from but she didn’t mean that it’s the same as cancer, she meant how you can’t choose to have cancer, you can’t choose to have anorexia.\n\nShe wasn’t comparing them in the slightest just using them as a way to communicate that’s it’s not something you can control, and everyone knows cancer is something you can’t control so that’s why she used it as an example.",
      "created_utc": 1701723239.0,
      "score": 2,
      "context": [
        {
          "id": "kbqd9kz",
          "author": "None",
          "body": "This is just so dumb. How the hell would someone choose to be sick? It’s disgusting to even think this. It’s like saying a cancer patient have blame for being sick",
          "created_utc": 1701552973.0
        },
        {
          "id": "kbtf2n1",
          "author": "sherbeana",
          "body": "Please don’t compare this to cancer… how is that at ALL the same?\n\nI see people commenting “you can ‘choose’ to recover from ED but you can’t ‘choose’ to be sick”. Well you can’t really “choose” to recover from cancer… therapy is not the same as radiation “therapy”… \n\nI have suffered with anorexia for years but would happily take this over cancer any fucking day.",
          "created_utc": 1701614103.0
        }
      ]
    }
  ]
}