{
  "id": "18gb4z1",
  "subreddit": "AnorexiaNervosa",
  "author": "vellichxrr1021",
  "created_utc": 1702347649.0,
  "title": "oats before recovery vs now",
  "selftext": "oats have been my breakfast obsession since this summer when i started “recovery.” i would always have a bowl of oats with blueberries (bc obvi - lowest cal) and no other toppings. i never took pictures of this breakfast because it was so sad that it didn’t even look appealing.\n\n\nthe first picture is from october 15 when i considered myself to be nearly fully recovered. i considered this a “huge” breakfast with absolutely loaded toppings and immediately went to do a workout afterwards to “use the energy.” i only added pb, granola, and banana rarely because i thought it was so much.\n\n\nevery picture is in chronological order before my forced treatment started around november 23 (3rd pic). i started adding pb and granola every day. i had banana instead of blueberries despite the higher caloric content.\n\n\nin the 4th picture, i finally tried caramelized apple on top, which was cooked with maple syrup. i was so scared and didn’t try any other toppings, but it was so good.\n\n\nthen, i started adding a couple small slices of chocolate with some shreddings.\n\n\ni’ve now had apple oats with pb and granola.\n\n\nthe last couple days, ive tried nutella with banana, an entire reese’s christmas tree candy, and granola. nutella is such a big fear food and ive been having it nearly every day on my oats.\n\n\ni know that this is a pretty long post but i was just scrolling through my camera roll and saw these as i realized how much of a change there has been in the past two months, from sad, unpictured, blueberry to nutella and banana-filled oats : ).",
  "url": "https://www.reddit.com/gallery/18gb4z1",
  "score": 121,
  "num_comments": 8,
  "comments": [
    {
      "id": "kczf45e",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1702347650.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kd05imz",
      "author": "LameLoserLauren",
      "body": "This is SUCH a beautiful documentation of your progress. I’ve always thought camera rolls are the enemy of recovery, but you’ve proven that they can be the exact opposite—indicators of just how far we’ve come. Please keep it up, as these look increasingly delicious!",
      "created_utc": 1702359784.0,
      "score": 18,
      "context": []
    },
    {
      "id": "kd0a631",
      "author": "lacroixlite",
      "body": "This is so beautiful it actually made me tear up. I don’t think I’ve ever been so directly confronted with the damage I do to my body and how much I deny it before now.\n\nThe act of caring for yourself and enjoying a meal is so powerful to me. I can identify so much with the fear – your gradual progress and courage is something I feel like really translates through just the pictures. I love the slow progression. I love how I can visualize your growing happiness and bravery with every new addition.\n\nI JUST THINK IT’S NEAT OKAY.\n\nBut no, seriously OP, good job. This is amazing. Thanks for the encouragement.",
      "created_utc": 1702362754.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kd09hbr",
      "author": "helianthus_0",
      "body": "What a delicious way to document your recovery! These bowls look so good! I’m so proud of you for facing your fears at breakfast!",
      "created_utc": 1702362290.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kd1qf0y",
      "author": "musingsofamdc",
      "body": "A real glow-t up (glow + oat) okay bad joke but good job!",
      "created_utc": 1702395241.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kczio3r",
      "author": "emespxme_",
      "body": "That's so exciting!!!",
      "created_utc": 1702349097.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kd2mxlh",
      "author": "Sure_Cut6268",
      "body": "YES I LOVE THIS! Idk why we anorexics all collectively go to oatmeal as a safe food but I get so happy when I see people actually adding a good amount of toppings instead of measured out peanut butter and like two chocolate chips😁",
      "created_utc": 1702407340.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kd6nz2q",
      "author": "shiratakihater",
      "body": "omg i love this. finally a before and after done right !",
      "created_utc": 1702478860.0,
      "score": 1,
      "context": []
    }
  ]
}