{
  "id": "18qlggr",
  "subreddit": "AnorexiaNervosa",
  "author": "PriddyFool",
  "created_utc": 1703520575.0,
  "title": "\"Will I gain weight from Holiday Meals?!!\"",
  "selftext": "Hello good sick people of r/AnorexiaNervosa I'm here with a Christmas Gift of rationality.\n\nWe see this question get asked a lot this time of year in various subs. So, like Jesus, I've come to assuage all of your guilt.\n\n**DISCLAIMER:** I'm not a doctor or medical professional. I'm just a schmuck on reddit who learned a lot from being related to a Registered Dietitian with a masters degree.\n\n**\"Will I gain weight from eating at excess for Holiday Dinners?\"**\n\nIt's unlikely. I'll be staying away from numbers in this post, but you generally need to eat a considerable amount **on top of** your Total Daily Energy Expenditure (TDEE) to gain even a pound of fat. Here is a [study](https://www.mdpi.com/2072-6643/9/8/818) from 2017 wherein 15 men were fed 2x their TDEE for one day out of the week. They \"gained\" only around half a pound, and it didn't stick.\n\n**\"But the scale says-\"**\n\nThe scale is going to be up for a few days after eating more than usual (and, to be honest, it can vary by the day anyway.) Here are some reasons your weight might be fluctuating:\n\n* \\-Food has weight when it's inside you. The scale can pick that up if you haven't had a *massive* BM\n* .-Eating foods with an excess of *sodium* will cause you to [retain water](https://karger.com/anm/article/70/Suppl.%201/51/42521/Relationship-between-Sodium-Intake-and-Water).\n* \\-[Carbohydrate consumption causes you to retain sodium.](https://pubmed.ncbi.nlm.nih.gov/3529916/)\n* \\-If you *have* had a massive BM, you might be dehydrated which also causes you to retain water.\n* \\- [Laxatives ALSO cause dehydration and water retention.](https://barnard.edu/self-help-resources/facts-about-laxatives)\n* \\-Purging also causes water retention- whether it be exercise or eat and yeet.\n\n**\"But what about Starvation Mode??\"**\n\n[Not a real thing.](https://www.sciencedirect.com/science/article/pii/S0002916523137051) When you lose weight, your TDEE adjusts. Less weight (whether it be fat or muscle mass) takes less energy (calories) to move around. So you need less energy to maintain that weight. People mistake this adaption for \"starvation mode.\" **And one or two days above your TDEE isn't gonna be enough to gain any level of significant fat mass.**\n\n**\"I have PCOS though.\"**\n\nFirst of all, I'm sorry. That's a rough illness and my heart goes out to you. The good news is that it doesn't necessarily mean your body gains weight in a different way than someone without PCOS (at least, according to the [research](https://pubmed.ncbi.nlm.nih.gov/34788426/)). So you're not \"more doomed\" than anyone else who needs this post. You're good! :)\n\n**\"Ok, that first study though-  men and women have different metabolisms!\"**  \n[No](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3136178/) they really [don't](https://pressbooks.pub/btugman/chapter/gender-differences-in-metabolism/). Men tend to need less fat mass than women, but the metabolisms work the same. \n\n**PERSONAL ANECDOTE:** Last night I had a lovely Christmas Eve dinner with my family. Many fish as is Catholic Tradition- I'm telling ya it was an aquarium in my uncle's kitchen. Then I ate more sweets than a deprived almond child (And I'm not being disordered there; I just felt like physical garbage after lol). The scale this morning? Even before my BM? No more weight gain than expected for the above factors. \n\n**CONCLUSION:** Enjoy the holiday meals with your families! This disorder is hellish enough as is. Give yourself a break. Drink a lot of water, and stay off the scale for a few days if you need to. You're good. It will all be okay! \n\n**TL;DR:** No. \n\n&#x200B;",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/18qlggr/will_i_gain_weight_from_holiday_meals/",
  "score": 167,
  "num_comments": 14,
  "comments": [
    {
      "id": "kevho88",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1703520576.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kevz6u0",
      "author": "PriddyFool",
      "body": "I just wanted to add in the comments that this is NOT meant to be a pro post. Weight gain isn't bad. It's okay to gain weight. But when I'm very upset and deep in the disorder, I don't need to hear that. I need to hear the above. Because it's not an opinion - it's based in reality. Rationality can be very soothing for those of us experiencing extreme distress from holiday meals. That's all I am trying to do here :)",
      "created_utc": 1703528551.0,
      "score": 78,
      "context": []
    },
    {
      "id": "kew5ngt",
      "author": "EtnaAtsume",
      "body": "Holy shit thank you",
      "created_utc": 1703531363.0,
      "score": 26,
      "context": []
    },
    {
      "id": "kewj12r",
      "author": "None",
      "body": "I needed this thank you",
      "created_utc": 1703537151.0,
      "score": 13,
      "context": []
    },
    {
      "id": "kex2jzh",
      "author": "catye_luna",
      "body": "nah u a godsend for this post rn🥺🥺made me tear up ngl, my ED been telling me hella lies today and yesterday especially. Thanks so much for taking the time to write and post this. Hugs everybody❤️❤️",
      "created_utc": 1703545873.0,
      "score": 13,
      "context": []
    },
    {
      "id": "key0qis",
      "author": "None",
      "body": "I’m basically recovered but still struggle with the ~spicy~ thoughts sometimes and really appreciated this reassurance.",
      "created_utc": 1703561837.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kez8u3r",
      "author": "ambxvalence",
      "body": "So my therapist explained it with an analogy which actually made a LOT of sense to me. \n\nLets say your body is like a sink, wherein food is like waterflow if the tap is open, and your weight is like the water level in the sink. You temporarily increase the flow during christmas (i.e. more food) which causes your water level to perhaps temporarily increase. HOWEVER, if you then decrease the flow again to its original point, over time the water level will return to its baseline. \n\nErgo no need for compensation after christmas.",
      "created_utc": 1703593117.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kex0juq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1703544961.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kewqlmh",
      "author": "Baring-My-Heart",
      "body": "You’re so real and valid for posting this",
      "created_utc": 1703540438.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kf0qwsx",
      "author": "Rabbit_Ruler",
      "body": "Reading this post was hands down the Christmas gift I’ve gotten this year",
      "created_utc": 1703617682.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kewuz6l",
      "author": "None",
      "body": "thank you!!!",
      "created_utc": 1703542408.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kexsx24",
      "author": "cybrcu",
      "body": "thank u :,)",
      "created_utc": 1703558106.0,
      "score": 2,
      "context": []
    },
    {
      "id": "key68tu",
      "author": "RuthMaudeJameison",
      "body": "I love you.",
      "created_utc": 1703564550.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kf5u09j",
      "author": "CarrieHope",
      "body": "I can understand this is hurtful to you, but I do think you should also have some empathy towards your family members. They only meant well and tried to give you gifts which they hoped you enjoyed.\nWhen I was deep into my eating disorder, I got really angry and quite furious at a friend for wanting to bake a cake with me. I still regret not apologizing to her afterwards till today.",
      "created_utc": 1703704954.0,
      "score": 1,
      "context": [
        {
          "id": "kex0juq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1703544961.0
        }
      ]
    }
  ]
}