{
  "id": "18wb48x",
  "subreddit": "AnorexiaNervosa",
  "author": "Adorable-Mine-5497",
  "created_utc": 1704154365.0,
  "title": "parents are letting me die??",
  "selftext": "(Kind of vent??) So for context. I am nearly a week out of hospital for AN, and none of my family have offered or even asked me to eat a single thing and are all aware that i have not eaten since (do not recommend) but they are purposefully avoiding making me eat ect, and i know this because I’ve just heard them ask my brother if he wants to come out for breakfast and they’ve eaten dinner in front of me. Im not sure how to feel about it, they are aware of my habits and ED.. And i do but i don’t want them to ask, because now i feel like they’ve fully given up on me, which is making my ED have a party, but it kinda bums me out to know they don’t care.. i turned to typing it out on here because i couldn’t talk to my friends about it because they’re have their own problems and i feel bad.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/18wb48x/parents_are_letting_me_die/",
  "score": 119,
  "num_comments": 93,
  "comments": [
    {
      "id": "kfwmoys",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1704154365.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kfwsssg",
      "author": "Excellent-World-476",
      "body": "Unfortunately getting better is in your court. It’s nice if you have r support but that is a bonus not a requirement.",
      "created_utc": 1704156707.0,
      "score": 167,
      "context": []
    },
    {
      "id": "kfwss68",
      "author": "Mean-Mood6759",
      "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
      "created_utc": 1704156700.0,
      "score": 275,
      "context": []
    },
    {
      "id": "kfws9bk",
      "author": "FindingAWayThrough",
      "body": "I wonder if it’s less that they have given up & more that they don’t know what is okay/not okay to say or ask. My partner doesn’t necessarily ask about things daily etc, but it’s mainly bc he doesn’t know how to ask and doesn’t want to upset me more. This might be something to talk about with your family because they might be well-intentioned (then again, they might not be..) but still…\n\nJust some perspective\n\nETA: also - context needed. Are you a minor or are you of age? Is this your first time through treatment? If you’re of age and have been through tx before, I can appreciate that family might not feel able to speak up/like they can ‘force’ you to eat.",
      "created_utc": 1704156507.0,
      "score": 59,
      "context": []
    },
    {
      "id": "kfwydg1",
      "author": "disposable_valves",
      "body": "Baby. How long have you been ill? How long have they known?\n\nThey're not letting you die. But they're hurting, too. And likely exhausted.And they can't make you better without you wanting it. I understand the feelings and They're valid, but they're inaccurate.\n\nAsk for help. Try. You can't get better on your own, or without your own help. You need both.",
      "created_utc": 1704158854.0,
      "score": 58,
      "context": []
    },
    {
      "id": "kfx4bu0",
      "author": "None",
      "body": "They’re probably just being cautious or unsure of what to do. My parents were the same after they ran out of techniques. Remember they are most likely also extremely concerned even though it might not show. It could even be shown through fex anger, but theyre not angry theyre worried. I cant imagine what it’s like watching your own kid basically killing themselves in front of your eyes, it’s heartbreaking. My parents weren’t educated enough on the topics of EDs and recovery, which is very understandable bcs its extremely complicated. The parents(or doctors) taking over the control is not the way to go imo. Its gonna be uncomfortable at first but start eating alone mby without even talking about it with ur parents. Dont make food a big deal and eventually hopefully it’ll get more normal. Thats how I got better at least:) giving it attention is just maintaining it. We stopped talking about food in the house, everyone was tired of it since we were constantly arguing. Please dont let it go too long, I feel like I have permanently destroyed my family bcs of how fkked up everything was during that time. Hope ur okay ur so strong and u got this🥹",
      "created_utc": 1704161124.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kfyadzj",
      "author": "probs-hyperfixation",
      "body": "People get tired from begging you to eat. It's stressful and mentally taxing for them as well.",
      "created_utc": 1704182477.0,
      "score": 18,
      "context": []
    },
    {
      "id": "kfxm0pz",
      "author": "xdlol11",
      "body": "Isn't one of the most common takes in here that you hate when others ask you to eat",
      "created_utc": 1704168456.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kfwx7zr",
      "author": "Youngtransgirl18",
      "body": "In my case my mom stopped asking me because I would get so mad and we got into so many arguments to the point where we would scream at each other. I don’t know if this happened in your case but sometimes parents of a anorexic child don’t know how to communicate because it’s kinda like damned if you do and damned if you don’t. They do care I promise but they don’t wanna overwhelm you probably. I think you also correlate their love around them showing affection around your food habits which is not true. They love you and you need to know that them not holding you accountable will happen too. \nYou need to also hold yourself accountable in recovery you can’t recover for someone else. And please try to remember that your parents hopefully wants the best. I regret all my fights with my mom about stupid stuff like food. I thought her wanting me to eat was punishment or even thought she was jealous of me and wanted to ruin me but it’s your disordered mind talking. \nI think if you show more interest that you actually are willing to recover and try to eat and engage with them will help them see. Good luck❤️‍🩹",
      "created_utc": 1704158404.0,
      "score": 13,
      "context": []
    },
    {
      "id": "kfxlu39",
      "author": "Skythebluestars",
      "body": "I am now 15 years dealing with anorexia and ive lost alot of people.. because people dont know how to deal with it. And yes thats valid on their part but also really painful. Eatingdisorders are not a choice. \n\nThere are support groups for parents out there \nIf your parents are up for that. So your parents feel they stand not alone in this. As wel as family therapy is maybe an option. Work through rhis together. Because you dont have an eating disorder alone.. \n\nAnd for now maybe you can talk wirh your parents that you know its your own responsibility if you eat or not. But you would really like to eat with them because that would make it easier to eat. And feel less lonely. Without blaming them for not inviting you. \n\nYou got this!🫂",
      "created_utc": 1704168372.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kfx2umj",
      "author": "ArgumentSad5774",
      "body": "Hospitals in my area give a lot of misdirected/misinformed advice/info to families of discharged patients. I’m not saying that’s the case; but they may have been spoken to or guided to act in this way. If you are really stuck with finding help, you could contact someone in the community? I don’t know what sort of professional that would be, depending on area. Often self directed plans made with the help of professionals can be useful.",
      "created_utc": 1704160545.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kfy3e2f",
      "author": "mirandalsh",
      "body": "Forced recovery rarely works. They’re probably exhausted and sick of fighting you. Fighting a person with an Ed is exhausting. \n\nIf you want to recover, then do it. If you don’t, don’t. No one is letting you die OP, you’re killing yourself.",
      "created_utc": 1704177550.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kfxfhrq",
      "author": "Garden_addict25",
      "body": "I think they just don't want to set you off or pressure you and are letting you do things on your own accord as support. Let them know you want to eat with them and I am sure they will be supportive.",
      "created_utc": 1704165617.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kfxb0xx",
      "author": "disgustangx",
      "body": "I have to say I am honestly quite surprised at the blaming tone of some commentors here. Some people seem to not understand that understanding your parents & feeling upset can co-exist at the same time… But I am really sorry your parents are behaving this way, it’s hard to know the cause without talking to them but they are probably hurting too. I encourage you to ask about it, although I know it’s not easy. I can still imagine why you feel upset though… You have the right to feel this way and your feelings are valid. I am keeping you in my thoughts. I don’t know how to word this, but I really hope things become better for you and that you will gain some joy in your life again… Your existence is important and although I don’t know you, I care about you. I hope you’ll take care of yourself, I am rooting for you🫂❤️",
      "created_utc": 1704163823.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kfx9htm",
      "author": "Obvious_Ad_9641",
      "body": "YEa my parents didnt notice anything for about a year even when i went into inpatient after they were kinda the same like they thought i could do it on my own",
      "created_utc": 1704163206.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kfy2m1v",
      "author": "Prior-Error7519",
      "body": "It’s probably more likely that your family doesn’t know what their supposed to do, they don’t know what’s hurting and what’s helping. There are thousands of reasons why they might not be asking. \n\nYou gotta step away from the self pity mindset. You know there’s an issue. You see what needs to be done. Yet, You’re waiting for it to come to you. I’ve had that same mindset, most of us here have, or have had, AN, and we know where you are. We’ve felt it. Come talk to us when you need someone who truly understands, but remember that your family are people too. And my hope is that right now, the reason they’re not asking is because they see someone they love hurting and they do not know how to properly help you.",
      "created_utc": 1704177054.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kfysemn",
      "author": "None",
      "body": "I'd try to see it more as, \"my parents are giving me the choice\". \n\nI don't know you or your story, but if it's anything like mine, the only strategy that worked was a hands off approach. I kept cycling through engaging in behaviors just to be \"saved\", and it got me stuck. \n\nEventually, my family did have to literally be like \"we can't stop you dude, if its what you want to do like. 🤷\". \n\nWas it absolutely soul crushing? Did I feel like I was abandoned and given up on? 100%. \n\nAnd, when I really realized that I had to sort it out myself this time, I managed to stay alive long enough to actually want to stay alive, and then my family supported me again. \n\nI know it sucks to feel the weight of recovery on you, AND you will realize how strong you are later on. It's slow steps, and you gotta do it for you, not because you're being forced to.",
      "created_utc": 1704196154.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kfxbe4c",
      "author": "savannahruns",
      "body": "Honestly haven’t gotten through all the comments but it feels like lots of people are assuming you’re an adult and need to take full responsibility. I read a comment where you said you’re a minor and it’s bizarre to me that part of your treatment and discharge planning wasn’t around parental involvement, using them as the primary supports who make food and are in charge of your meal plan, etc.",
      "created_utc": 1704163969.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kfwwzvc",
      "author": "dark_humor_to_cope",
      "body": "Some of these responses give off a pretty harsh tone, and that might not be the most helpful thing right now. I don’t know why your family isn’t asking you to eat (like other people said, there could be a variety of reasons), and I’m sorry that they aren’t asking you. I would feel the same way if I were you. \n\nI’m here to say that I’m rooting for you, and I want you to eat. Please be careful, though - you’re almost definitely at risk for refeeding syndrome. I am not a medical professional, but it would be a good idea to go to the emergency department and tell them what’s going on so they can keep you safe. While you’re there, you could also ask to talk to a social worker about the situation with your parents.\n\nSending care 💛",
      "created_utc": 1704158318.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kfww09f",
      "author": "lacroixlite",
      "body": "Fuck em. You don’t need the people you’re related to to give a shit about you to know you matter.\n\nYou matter. If I were there I’d make you some soup. Even one spoonful would be enough. \n\nI say this as someone whose family couldn’t care less about what happens to me. It isn’t wrong to expect or even want a favorable response even if you’re not willing to recover. You don’t have to be eating or to be well to expect others to WANT you to eat. You shouldn’t have to *earn* empathy and compassion with any kind of action on your part. It’s *implict* that the people who claim to love us express that in observable ways. \n\nAnd even if you DID want their attention just for the sake of it? Who *gives* a fuck? Human beings need attention. It isn’t a goddamn crime to want the people we care about to pay us notice. The postmodern aversion to “wanting attention” is fucking absurd and based in a scarcity mindset: “*I* don’t get any attention and I don’t expect any so you shouldn’t either!!” Like, please.\n\nTo prove the point, in my case, it isn’t even just anorexia. I was in the ER a few months ago for unrelated issues and not a single member of my immediate family blinked twice. \n\nIt’s not you. You’re not wrong. You deserve better.\n\nBut the fact that you aren’t getting the love and concern you deserve doesn’t mean you don’t deserve it. It only means that your circumstances suck and that it has nothing to do with you. The “they don’t want to push you or fight you” excuse only goes so far. Maybe they don’t want a conflict, but that’s still about them and not you. It means they’re unable to cope with the emotional consequences of forcing somebody to do something that’s good for them.\n\nSo fuck em. You matter and you don’t need them to believe it for it to be true.\n\nTake care of yourself. I care. I want you to live. I’m not gonna force you to recover, but please don’t die at the very least.",
      "created_utc": 1704157931.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kfyo869",
      "author": "PsychoticFairy",
      "body": "They are probably just insecure. And don't know what to do or say.\n\nI hope you ate some food. Not for them but for you.\n\nYou deserve to eat. You deserve to live and to have fun, to be there and you deserve to be seen and to feel good about yourself",
      "created_utc": 1704193204.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kfz49ao",
      "author": "Apprehensive_Spite97",
      "body": "They do care, they're just afraid of asking you to eat in fear that you'll reject food even more/longer. It's your own responsibility to eat though, you can't know how they feel or what they're thinking. They're literally hostages of your ED, that doesn't mean they've given up. \n\nSince you live at home it's important that the whole family can talk to your* or a therapist, they're not healthcare workers they're your family and they need help as well about how to help you. \n\nGood luck, you can beat this shit but ask for more help. You deserve to get well and have people who support you.",
      "created_utc": 1704202975.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kfztvxa",
      "author": "Bell_a_b",
      "body": "Hey :). This is gonna be a long post just so you know lol. Just wanted to give help from experience!\n\nI agree with the others who are saying some of these responses are harsh. I’ve gone through something similar too when I was struggling with my AN as a teen. And some of these responses, even if they don’t intend to be invalidating, can feel super invalidating right now. \n\nWhen my parents stoped trying, it felt like they were letting me die too. Like they all have given up and now cuz everyone else gave up on me, what’s the point of even trying anymore. And I relate so much to not having any \"consequences\" now for not eating. I felt that way too that now I was free to follow the ED for as long as I wanted without restriction. But you having that push and pull of wanting them to say something and not at the same time is a great start because it shows some part of you wants to get better away from the ED! But there are many reasons why they may be doing this! Especially if they want to support you. And it’s important to maybe try having a convo with them :). I know it can be scary. \n\nHave you and your parents had a conversation about what you need from them? Sometimes they just don’t know how to best approach helping you eat so they think that avoiding confrontation may reduce stress on you and them as a whole. The thing they fail to realize is sometimes, especially when you are fresh out of hospital or starting recovery in general, you need that little nudging to help you eat. \n\nIf you and your parents haven’t had a discussion on what would be helpful for helping you eat, I’d definitely suggest that! Here are some things that I find helped me that they did:\n\n-Giving me permission to eat! \n\nSometimes the ED can make it feel like you don’t have permission to eat. Or if the choice is up to you, it can be hard to do it yourself as the ED never lets you. Making it seem like you don’t \"have\" to makes you not wanna do it cuz of the guilt and torment the ED puts you through for going against it. Having a parent say,\n\n\"Dinners ready, come try to have some with us. We will all eat together\" \nOr \"Hey, I know you are having a difficult time right now but we need to eat to feel better.\" \n\n\"Hey, I can tell the ED is really loud right now, but you are allowed to eat and the ED can blame me for helping you eat.\"\n\nThis can help just relieve you from making it seem like it’s your decision/fault to eat and you can put the blame on your parents instead of you and tell your ED like \"hey my parents or therapist are making me do this.\" You can think of a line(s) that works for you. \n\n-Another thing that helped is them just making my plate for me when I felt like I couldn’t cuz the ED was so strong. It takes that control away from you, which can be scary, but it also can reduce the overthinking your ED does when you are portioning things yourself! \n\n-Reminding me how proud they are of me for trying so hard. This is a hit or miss as sometimes you don’t want to hear someone proud of you.  But if it helps it’s a good thing to point out!\n\n-Providing or helping you think of things to do to distract you after a meal. This can look like watching a movie together to giving you ideas on things you can do for yourself! You can brainstorm ideas to try! \n\nKeeping an openness for reaching out to them for support or for comfort when you are having really hard thoughts. If you have s therapist, you can ask them if they can help you help your parents with supporting you better!!\n\nAnd yes, as previous commenters have said, it is your responsibility to eat. And I completely agree with that. The ball is in your court when it comes to recovery, and no one can do it for you. So you do have to put in the effort required. But I think that support, if your parents want to provide it, can go a long way in helping you recover much better and in a faster way as we all need that sometimes ! \n\nBut you also need to be open to the support! You gotta accept it and not refuse it ! I’m not accusing you of having done that but sometimes it can discourage the people trying to help you the most ! \n\nKeep in mind that they are human too. They will make mistakes. They will not be perfect. Especially not at first. It took a long time for my mom and I to get to a place where she and I knew what I needed to get through my struggles. It takes time and experimenting and perseverance on both parts ! \n\n\nSo to summarize. My suggestions are:\n\n-Brainstorm ideas to distract/cope after eating (make a list somewhere to you can check off what does or doesn’t work)\n\n-Think of lines/things that you think would be helpful for your parents to try doing to support you better and have that conversation with them. If you feel like you can’t initiate it and have a therapist, I’d suggest bringing this ideas to them and getting their advice!\n\n-Making a list of why you should recover! Keep the list close by so when motivation falls and the ED gets super loud, you can look back at the list of reasons why you began to recover in the first place to give you that motivation or nudge! \n\n\nHaving open communication between you and your parents during this time is so important to avoid assumed reasons for why they are acting like they are. \n\nIt is also good to remember that they can’t do this forever. You can't rely on them to always give you permission to eat and get you to do those things. But it’s okay to have that temporarily until you can get into a routine and build coping tools to start slowly trying to do it yourself! \n\nOnce you get to a place of making your own meals or portioning your own food, it can help if your parent supervises just to help you do it on your own before you do it without them there! But for now just focus on what’s going on now :)). \n\nI wish you all the best!! And I really hope this advice was helpful. Even if just a smidge. This hit close to my heart and I really wanted to see if my experiences would help you feel less alone. :)\n\nTake care ! You got this! I know you can recover! \n\nDM’s are always open too if you’d like a little more advice!",
      "created_utc": 1704213595.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kg02b02",
      "author": "Western_Release_9580",
      "body": "Hon, I’m so sorry you’re going through it but the title of this post is wrong. If you die, that’s on you. I know this sounds harsh but I had to accept early on that my recovery and disorder was my problem to deal with. No one has to make you eat, or even care that you do. They might be protecting themselves cause they do care? Anyway, I’m sorry, it’s just the truth.",
      "created_utc": 1704216587.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kg0rkum",
      "author": "Beautiful-Sweet-4355",
      "body": "I know that feels like shit because my parents did it too. But they were never going to make me do something I didn’t want to do. Recovering now. My parents care so much but they just wanted to try anythinf",
      "created_utc": 1704225296.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kfxqiui",
      "author": "Luckypenny4683",
      "body": "It’s not that they don’t care. It’s that it’s your responsibility.",
      "created_utc": 1704170570.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kfxhcij",
      "author": "die4meplzbtch",
      "body": "They have the right to choose to have peace from your disease. They are tired of your shit. Go get help",
      "created_utc": 1704166404.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kfx03gu",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1704159515.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kfwsqd2",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1704156681.0,
      "score": 0,
      "context": []
    },
    {
      "id": "kfx87pc",
      "author": "HelicopterJazzlike73",
      "body": "It's all about control. The only thing you can control right now is your weight. You can control what goes in your mouth but little else that is happening to you. Hood luck",
      "created_utc": 1704162696.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kfypuha",
      "author": "Tajskskskss",
      "body": "Ohhh God okay. Listen. I get that they aren’t telling you to eat because it hasn’t worked in the past. I think that’s valid. It’s also valid to get mad you aren’t eating. It isn’t valid to completely shut you out and give you cold responses when you just got out of hospital. People generally develop EDs for a reason, and that reason clearly has not been addressed. \n\nI’m sorry this is happening. I know you probably feel like you absolutely cannot eat now since no one is forcing you. Yes, you probably miss the attention, because for one reason or another, you felt like you weren’t getting enough of it at some point in your life. Just think about how you want to move forward. Do you want to never eat again because they don’t force you to? You’ll stay locked in your room and become a lot more miserable and likely end up IP again. You *can* change this. Your ED is a part of you. It’s not a separate entity. It’s you. And that’s okay. It’s an illness. It doesn’t make you a horrible person. Anorexia doesn’t inherently make you a bad person, even if it’s a selfish thing to do. That’s fine. We can all be selfish sometimes. That selfishness is also an illness, though, and one you cannot fully control yet. You can choose to follow those habits or to diminish them (I know you cannot discard them right off the bat). It will take time, but you will be able to control it somewhat eventually. You are feeding into it right now by begrudgingly refusing to eat. That’s a decision you’re making. I would’ve most likely made the same one in your place. \n\nConsidering the fact that this is all for you, you should also just think about what you want. Do you want to eat? A part of you is screaming no, but mostly you probably do—especially since you were probably eating more in the hospital, and your hunger signals must be painful. Please just eat a safe food. You will feel guilty. But it will establish a precedent of independence and doing what you want that will be very helpful in the future. \n\nJust take care of yourself. That’s a grand ask, I know, but you deserve it. You aren’t inherently unable to eat or to care for yourself. This could be the first step of discovering that.",
      "created_utc": 1704194366.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kg0w31j",
      "author": "Relevant_Cloud_3592",
      "body": "I’m sorry you’re struggling so much",
      "created_utc": 1704226837.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kg1jj25",
      "author": "KadanteTheKing",
      "body": "Well I care! Theres great recovery blog videos on YouTube that you can watch for Mealspo or support and obviously lots of people you can reach out to on here if needed. Go enjoy a small snack! You got this ❤️",
      "created_utc": 1704234946.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kg2az29",
      "author": "99conrad",
      "body": "Inpatient…. If you feel that bad, go get it.",
      "created_utc": 1704245315.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kg2cliv",
      "author": "SkillIcy3516",
      "body": "They can care for you in other ways. It’s not about the food",
      "created_utc": 1704245941.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kgygove",
      "author": "seasonally_metalhead",
      "body": "They're thinking that insisting you to eat / commenting on your eating habits will trigger you and cause a backlash/relapse. Family learns in time that the best way to approach ana is somehow ignoring it and not telling anything about it even if they burn from inside out to comment on it. Be sure that they actually care about you and try to keep their mouth shut to prevent further damage in the future.  This is a comment from the sister of an ana sufferer. For instance I'm here at the middle of the night on my local time to try to find a way to get my mind around with my sister's last photo she sent, which worries me. I try to get  more informed by reading this sub. I try to understand what she goes through before saying anything that can make her feel hurt, making the situation worse. Probably she thinks out there that nobody cares too,  but in actuality we've seen in past that telling her anything about her looks, weight or eating habits make it much worse, so we try not to intervene.",
      "created_utc": 1704750152.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kfwua3b",
      "author": "Adorable-Mine-5497",
      "body": "yeah i know that and i don’t expect everyone to just carry me. its just more so that they used to try and now they’ve stopped. i get you cant try forever. just makes me upset to think that they’ve stopped is all",
      "created_utc": 1704157269.0,
      "score": 12,
      "context": [
        {
          "id": "kfwsssg",
          "author": "Excellent-World-476",
          "body": "Unfortunately getting better is in your court. It’s nice if you have r support but that is a bonus not a requirement.",
          "created_utc": 1704156707.0
        }
      ]
    },
    {
      "id": "kfyonjk",
      "author": "Tajskskskss",
      "body": "Pity party is harsh. She’s allowed to want people to care. They aren’t mind readers but they have enough common sense to know she wants them to care. Yes, a lot of EDs stem from wanting attention. The reason why people develop them in the first place is that they were starved of that attention. I get that they have this ‘strategy’ to get her to recover, but it clearly isn’t working. Now she probably feels ashamed to eat at all. Sometimes people who literally just got out of IP need a little push, and that’s okay. She isn’t at the stage yet where she can make the decisions completely on her own. She’s a child. I get that the parents are hurting, but this isn’t helping anyone.",
      "created_utc": 1704193512.0,
      "score": 23,
      "context": [
        {
          "id": "kfwss68",
          "author": "Mean-Mood6759",
          "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
          "created_utc": 1704156700.0
        }
      ]
    },
    {
      "id": "kfwvjop",
      "author": "Adorable-Mine-5497",
      "body": "i’m not having a pity party just wondering if either anyone else had this and if it was valid for me to be bummed out is all. i get that its hard to deal with your child going through this and most people wouldn’t know what to do or give up after a while, and i don’t blame them, doesn’t mean i cant be bummed about my family giving up",
      "created_utc": 1704157753.0,
      "score": -43,
      "context": [
        {
          "id": "kfwss68",
          "author": "Mean-Mood6759",
          "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
          "created_utc": 1704156700.0
        }
      ]
    },
    {
      "id": "kfwyzuj",
      "author": "Substantial_Tip_3227",
      "body": "Name tracks",
      "created_utc": 1704159090.0,
      "score": -36,
      "context": [
        {
          "id": "kfwss68",
          "author": "Mean-Mood6759",
          "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
          "created_utc": 1704156700.0
        }
      ]
    },
    {
      "id": "kfwux6o",
      "author": "Adorable-Mine-5497",
      "body": "i am a minor and living at home. I’ve been to hospital in think 4 times for AN now and every other time they’ve tried and this time they stopped. i get that they can feel like that and not everyone always knows what to do. just bummed that they stopped is all because it seems i’m a lost cause and everyone around me has given up. and wanted to know if it was valid to feel as such i guess",
      "created_utc": 1704157516.0,
      "score": 6,
      "context": [
        {
          "id": "kfws9bk",
          "author": "FindingAWayThrough",
          "body": "I wonder if it’s less that they have given up & more that they don’t know what is okay/not okay to say or ask. My partner doesn’t necessarily ask about things daily etc, but it’s mainly bc he doesn’t know how to ask and doesn’t want to upset me more. This might be something to talk about with your family because they might be well-intentioned (then again, they might not be..) but still…\n\nJust some perspective\n\nETA: also - context needed. Are you a minor or are you of age? Is this your first time through treatment? If you’re of age and have been through tx before, I can appreciate that family might not feel able to speak up/like they can ‘force’ you to eat.",
          "created_utc": 1704156507.0
        }
      ]
    },
    {
      "id": "kfwzyzi",
      "author": "Adorable-Mine-5497",
      "body": "only about a year now and but its gone downhill very fast and theyve known for a few months now. and i understand how they feel, 100% and i honestly don’t blame them, at all. and i appreciate your support rather than blaming me for feeling as such, i wish you the best",
      "created_utc": 1704159463.0,
      "score": 12,
      "context": [
        {
          "id": "kfwydg1",
          "author": "disposable_valves",
          "body": "Baby. How long have you been ill? How long have they known?\n\nThey're not letting you die. But they're hurting, too. And likely exhausted.And they can't make you better without you wanting it. I understand the feelings and They're valid, but they're inaccurate.\n\nAsk for help. Try. You can't get better on your own, or without your own help. You need both.",
          "created_utc": 1704158854.0
        }
      ]
    },
    {
      "id": "kg2cv81",
      "author": "SkillIcy3516",
      "body": "Aaaw this is kind to everyone",
      "created_utc": 1704246043.0,
      "score": 2,
      "context": [
        {
          "id": "kfwydg1",
          "author": "disposable_valves",
          "body": "Baby. How long have you been ill? How long have they known?\n\nThey're not letting you die. But they're hurting, too. And likely exhausted.And they can't make you better without you wanting it. I understand the feelings and They're valid, but they're inaccurate.\n\nAsk for help. Try. You can't get better on your own, or without your own help. You need both.",
          "created_utc": 1704158854.0
        }
      ]
    },
    {
      "id": "kfx5xwc",
      "author": "Adorable-Mine-5497",
      "body": "see my ED is so happy that they’ve stopped bc it means i can continue these behaviours “without consequences” so im not sure about the getting better part, and i completely understand that they probably have run out of things to do because nothing was working. and i feel like then leaving it is essentially making it worse in a way? because i only eat when im pressured to do so because im a massive people pleaser so im not sure. sounds messed up but im not mad about that part at all. im not mad about any of it to be honest. its just sad to think about is all",
      "created_utc": 1704161773.0,
      "score": 5,
      "context": [
        {
          "id": "kfx4bu0",
          "author": "None",
          "body": "They’re probably just being cautious or unsure of what to do. My parents were the same after they ran out of techniques. Remember they are most likely also extremely concerned even though it might not show. It could even be shown through fex anger, but theyre not angry theyre worried. I cant imagine what it’s like watching your own kid basically killing themselves in front of your eyes, it’s heartbreaking. My parents weren’t educated enough on the topics of EDs and recovery, which is very understandable bcs its extremely complicated. The parents(or doctors) taking over the control is not the way to go imo. Its gonna be uncomfortable at first but start eating alone mby without even talking about it with ur parents. Dont make food a big deal and eventually hopefully it’ll get more normal. Thats how I got better at least:) giving it attention is just maintaining it. We stopped talking about food in the house, everyone was tired of it since we were constantly arguing. Please dont let it go too long, I feel like I have permanently destroyed my family bcs of how fkked up everything was during that time. Hope ur okay ur so strong and u got this🥹",
          "created_utc": 1704161124.0
        }
      ]
    },
    {
      "id": "kfx7cp9",
      "author": "Adorable-Mine-5497",
      "body": "i also forgot to mention that i completely understand their position and why they’ve stopped, whether that be they think it’d help me or they’ve simply run out of things to do! and i do not blame them whatsoever for any of it :)",
      "created_utc": 1704162344.0,
      "score": 3,
      "context": [
        {
          "id": "kfx4bu0",
          "author": "None",
          "body": "They’re probably just being cautious or unsure of what to do. My parents were the same after they ran out of techniques. Remember they are most likely also extremely concerned even though it might not show. It could even be shown through fex anger, but theyre not angry theyre worried. I cant imagine what it’s like watching your own kid basically killing themselves in front of your eyes, it’s heartbreaking. My parents weren’t educated enough on the topics of EDs and recovery, which is very understandable bcs its extremely complicated. The parents(or doctors) taking over the control is not the way to go imo. Its gonna be uncomfortable at first but start eating alone mby without even talking about it with ur parents. Dont make food a big deal and eventually hopefully it’ll get more normal. Thats how I got better at least:) giving it attention is just maintaining it. We stopped talking about food in the house, everyone was tired of it since we were constantly arguing. Please dont let it go too long, I feel like I have permanently destroyed my family bcs of how fkked up everything was during that time. Hope ur okay ur so strong and u got this🥹",
          "created_utc": 1704161124.0
        }
      ]
    },
    {
      "id": "kfx5zy0",
      "author": "Adorable-Mine-5497",
      "body": "and i wish you the best of luck in every aspect lovely",
      "created_utc": 1704161796.0,
      "score": 2,
      "context": [
        {
          "id": "kfx4bu0",
          "author": "None",
          "body": "They’re probably just being cautious or unsure of what to do. My parents were the same after they ran out of techniques. Remember they are most likely also extremely concerned even though it might not show. It could even be shown through fex anger, but theyre not angry theyre worried. I cant imagine what it’s like watching your own kid basically killing themselves in front of your eyes, it’s heartbreaking. My parents weren’t educated enough on the topics of EDs and recovery, which is very understandable bcs its extremely complicated. The parents(or doctors) taking over the control is not the way to go imo. Its gonna be uncomfortable at first but start eating alone mby without even talking about it with ur parents. Dont make food a big deal and eventually hopefully it’ll get more normal. Thats how I got better at least:) giving it attention is just maintaining it. We stopped talking about food in the house, everyone was tired of it since we were constantly arguing. Please dont let it go too long, I feel like I have permanently destroyed my family bcs of how fkked up everything was during that time. Hope ur okay ur so strong and u got this🥹",
          "created_utc": 1704161124.0
        }
      ]
    },
    {
      "id": "kfych78",
      "author": "Adorable-Mine-5497",
      "body": "i understand that completely, but it doesn’t mean it cant affect me either",
      "created_utc": 1704184063.0,
      "score": 3,
      "context": [
        {
          "id": "kfyadzj",
          "author": "probs-hyperfixation",
          "body": "People get tired from begging you to eat. It's stressful and mentally taxing for them as well.",
          "created_utc": 1704182477.0
        }
      ]
    },
    {
      "id": "kg087hp",
      "author": "verdigrisque",
      "body": "fr, it doesn't mean she can't feel sad because of that, but this whole thread is screaming of just wanting attention \"I have ED, please tell me I should eat even though I will not eat so it's pointless but please\"",
      "created_utc": 1704218635.0,
      "score": 4,
      "context": [
        {
          "id": "kfxm0pz",
          "author": "xdlol11",
          "body": "Isn't one of the most common takes in here that you hate when others ask you to eat",
          "created_utc": 1704168456.0
        }
      ]
    },
    {
      "id": "kfwzcjy",
      "author": "Adorable-Mine-5497",
      "body": "They havent really talked to me since i got out either, and when they did they were short uninterested responses to me talking to them, im not sure if that also has something to do with how i feel about it but i thought that was worth mentioning. and i am so sorry that you had to go through all of the thungs you did. nobody deserves that. sending love and wish you all the best",
      "created_utc": 1704159222.0,
      "score": 7,
      "context": [
        {
          "id": "kfwx7zr",
          "author": "Youngtransgirl18",
          "body": "In my case my mom stopped asking me because I would get so mad and we got into so many arguments to the point where we would scream at each other. I don’t know if this happened in your case but sometimes parents of a anorexic child don’t know how to communicate because it’s kinda like damned if you do and damned if you don’t. They do care I promise but they don’t wanna overwhelm you probably. I think you also correlate their love around them showing affection around your food habits which is not true. They love you and you need to know that them not holding you accountable will happen too. \nYou need to also hold yourself accountable in recovery you can’t recover for someone else. And please try to remember that your parents hopefully wants the best. I regret all my fights with my mom about stupid stuff like food. I thought her wanting me to eat was punishment or even thought she was jealous of me and wanted to ruin me but it’s your disordered mind talking. \nI think if you show more interest that you actually are willing to recover and try to eat and engage with them will help them see. Good luck❤️‍🩹",
          "created_utc": 1704158404.0
        }
      ]
    },
    {
      "id": "kfxmgcm",
      "author": "Adorable-Mine-5497",
      "body": "i dont blame them at all, i was just giving examples of things they have done, they cant deal with it and thats okay, not everyone would, but i will definitely suggest a support group for them or whatever we have available, thank you! and you got this too! i hope the best for you",
      "created_utc": 1704168660.0,
      "score": 1,
      "context": [
        {
          "id": "kfxlu39",
          "author": "Skythebluestars",
          "body": "I am now 15 years dealing with anorexia and ive lost alot of people.. because people dont know how to deal with it. And yes thats valid on their part but also really painful. Eatingdisorders are not a choice. \n\nThere are support groups for parents out there \nIf your parents are up for that. So your parents feel they stand not alone in this. As wel as family therapy is maybe an option. Work through rhis together. Because you dont have an eating disorder alone.. \n\nAnd for now maybe you can talk wirh your parents that you know its your own responsibility if you eat or not. But you would really like to eat with them because that would make it easier to eat. And feel less lonely. Without blaming them for not inviting you. \n\nYou got this!🫂",
          "created_utc": 1704168372.0
        }
      ]
    },
    {
      "id": "kfwyxyx",
      "author": "Adorable-Mine-5497",
      "body": "yeah, getting harsh responses for feeling what i feel is a natural response is making me feel like an asshole and selfish for it, so i really appreciate you and people like you for having empathy and caring about how i feel rather than how focusing on how they feel. and i have an appointment with my case worker tomorrow and my ED and i are fighting each other whether or not to tell her. i dont want to go to hospital again, especially not even a week later but i cant bring myself to eat. but i wish you all the best lovely",
      "created_utc": 1704159070.0,
      "score": 14,
      "context": [
        {
          "id": "kfwwzvc",
          "author": "dark_humor_to_cope",
          "body": "Some of these responses give off a pretty harsh tone, and that might not be the most helpful thing right now. I don’t know why your family isn’t asking you to eat (like other people said, there could be a variety of reasons), and I’m sorry that they aren’t asking you. I would feel the same way if I were you. \n\nI’m here to say that I’m rooting for you, and I want you to eat. Please be careful, though - you’re almost definitely at risk for refeeding syndrome. I am not a medical professional, but it would be a good idea to go to the emergency department and tell them what’s going on so they can keep you safe. While you’re there, you could also ask to talk to a social worker about the situation with your parents.\n\nSending care 💛",
          "created_utc": 1704158318.0
        }
      ]
    },
    {
      "id": "kfwxvih",
      "author": "Adorable-Mine-5497",
      "body": "thank you so much. most people here aren’t very understanding to my situation and instead tell me to understand my family, which i do, but it doesn’t mean i cant be bummed. so thank you so much for understanding, i really appreciate it",
      "created_utc": 1704158661.0,
      "score": 5,
      "context": [
        {
          "id": "kfww09f",
          "author": "lacroixlite",
          "body": "Fuck em. You don’t need the people you’re related to to give a shit about you to know you matter.\n\nYou matter. If I were there I’d make you some soup. Even one spoonful would be enough. \n\nI say this as someone whose family couldn’t care less about what happens to me. It isn’t wrong to expect or even want a favorable response even if you’re not willing to recover. You don’t have to be eating or to be well to expect others to WANT you to eat. You shouldn’t have to *earn* empathy and compassion with any kind of action on your part. It’s *implict* that the people who claim to love us express that in observable ways. \n\nAnd even if you DID want their attention just for the sake of it? Who *gives* a fuck? Human beings need attention. It isn’t a goddamn crime to want the people we care about to pay us notice. The postmodern aversion to “wanting attention” is fucking absurd and based in a scarcity mindset: “*I* don’t get any attention and I don’t expect any so you shouldn’t either!!” Like, please.\n\nTo prove the point, in my case, it isn’t even just anorexia. I was in the ER a few months ago for unrelated issues and not a single member of my immediate family blinked twice. \n\nIt’s not you. You’re not wrong. You deserve better.\n\nBut the fact that you aren’t getting the love and concern you deserve doesn’t mean you don’t deserve it. It only means that your circumstances suck and that it has nothing to do with you. The “they don’t want to push you or fight you” excuse only goes so far. Maybe they don’t want a conflict, but that’s still about them and not you. It means they’re unable to cope with the emotional consequences of forcing somebody to do something that’s good for them.\n\nSo fuck em. You matter and you don’t need them to believe it for it to be true.\n\nTake care of yourself. I care. I want you to live. I’m not gonna force you to recover, but please don’t die at the very least.",
          "created_utc": 1704157931.0
        }
      ]
    },
    {
      "id": "kfxobex",
      "author": "Adorable-Mine-5497",
      "body": "seeing as your response to this post id assume you either have not gone through this or have no empathy towards others that have. i suggest that if you arent going to post supportive or helpful comments you dont comment at all because your comment was not supportive nor helpful and was actually outright rude",
      "created_utc": 1704169513.0,
      "score": 6,
      "context": [
        {
          "id": "kfxhcij",
          "author": "die4meplzbtch",
          "body": "They have the right to choose to have peace from your disease. They are tired of your shit. Go get help",
          "created_utc": 1704166404.0
        }
      ]
    },
    {
      "id": "kfwt7ua",
      "author": "akoishida",
      "body": "this is a really weird response. anorexia isn’t logical, as much as one part of us wants to be left to “starve in peace” it’s also natural to feel like nobody cares for you when they don’t ask you to eat and leave you alone. OP isn’t a bad person for being surprised their family isn’t more attentive",
      "created_utc": 1704156863.0,
      "score": 5,
      "context": [
        {
          "id": "kfwsqd2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1704156681.0
        }
      ]
    },
    {
      "id": "kfwtwq7",
      "author": "Adorable-Mine-5497",
      "body": "i don’t really care for the attention. its mainly more so every other time I’ve come out of the hospital they’ve monitored me and made me eat and then they’ve just stopped that makes me think they’ve given up on me.",
      "created_utc": 1704157124.0,
      "score": -2,
      "context": [
        {
          "id": "kfwsqd2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1704156681.0
        }
      ]
    },
    {
      "id": "kfwvzwx",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1704157927.0,
      "score": 0,
      "context": [
        {
          "id": "kfwsqd2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1704156681.0
        }
      ]
    },
    {
      "id": "kfyr1y6",
      "author": "Adorable-Mine-5497",
      "body": "i understand and appreciate everything youve said. and for the last parti didnt eat any of my meal plan in hospital and they sent me home regardless. and since coming out i havent had any actual hunger cues or actual cravings like i did before. and for the wanting to eat. yes! i do but i dont. different parts are telling me different things. like one part saying i cant eat because then is be a failure and my ed would no longer be valid if i did and itd reverse everything i did and make me fat. and another is saying do eat bc it looks delicious. but then again the hunger cues and cravings arent really there anymore either. and normally the cravings are the only reason id eat because they wouldnt go away and were so strong. i used to be able to have zerosugar flavoured sparkling water and stuff but i cant anymore. i feel like even that is too many calories so i dont know what to do regarding eating.. i dont know why i blurted that out to you. i dont expect you to know what to do or say, i just blurt shit out a lot, my apologies",
      "created_utc": 1704195222.0,
      "score": 3,
      "context": [
        {
          "id": "kfypuha",
          "author": "Tajskskskss",
          "body": "Ohhh God okay. Listen. I get that they aren’t telling you to eat because it hasn’t worked in the past. I think that’s valid. It’s also valid to get mad you aren’t eating. It isn’t valid to completely shut you out and give you cold responses when you just got out of hospital. People generally develop EDs for a reason, and that reason clearly has not been addressed. \n\nI’m sorry this is happening. I know you probably feel like you absolutely cannot eat now since no one is forcing you. Yes, you probably miss the attention, because for one reason or another, you felt like you weren’t getting enough of it at some point in your life. Just think about how you want to move forward. Do you want to never eat again because they don’t force you to? You’ll stay locked in your room and become a lot more miserable and likely end up IP again. You *can* change this. Your ED is a part of you. It’s not a separate entity. It’s you. And that’s okay. It’s an illness. It doesn’t make you a horrible person. Anorexia doesn’t inherently make you a bad person, even if it’s a selfish thing to do. That’s fine. We can all be selfish sometimes. That selfishness is also an illness, though, and one you cannot fully control yet. You can choose to follow those habits or to diminish them (I know you cannot discard them right off the bat). It will take time, but you will be able to control it somewhat eventually. You are feeding into it right now by begrudgingly refusing to eat. That’s a decision you’re making. I would’ve most likely made the same one in your place. \n\nConsidering the fact that this is all for you, you should also just think about what you want. Do you want to eat? A part of you is screaming no, but mostly you probably do—especially since you were probably eating more in the hospital, and your hunger signals must be painful. Please just eat a safe food. You will feel guilty. But it will establish a precedent of independence and doing what you want that will be very helpful in the future. \n\nJust take care of yourself. That’s a grand ask, I know, but you deserve it. You aren’t inherently unable to eat or to care for yourself. This could be the first step of discovering that.",
          "created_utc": 1704194366.0
        }
      ]
    },
    {
      "id": "kfwuo8u",
      "author": "Excellent-World-476",
      "body": "People get tired. Maybe if they see you trying and doing better, they will feel more able to approach versus retreat.",
      "created_utc": 1704157422.0,
      "score": 91,
      "context": [
        {
          "id": "kfwsssg",
          "author": "Excellent-World-476",
          "body": "Unfortunately getting better is in your court. It’s nice if you have r support but that is a bonus not a requirement.",
          "created_utc": 1704156707.0
        },
        {
          "id": "kfwua3b",
          "author": "Adorable-Mine-5497",
          "body": "yeah i know that and i don’t expect everyone to just carry me. its just more so that they used to try and now they’ve stopped. i get you cant try forever. just makes me upset to think that they’ve stopped is all",
          "created_utc": 1704157269.0
        }
      ]
    },
    {
      "id": "kfwwpq0",
      "author": "Mean-Mood6759",
      "body": "How old are you?\n\nYou sound between 14 and 16\n\nDon't you understand that your parents are watching their kid slowly die and have given up trying to fight with you. \n\nThey are letting you do what they think you want. \n\nI will tell you again that if you want to try and eat with them, just tell them. \n\nBut don't be making a big deal about them not wanting to fight with you every mealtime",
      "created_utc": 1704158207.0,
      "score": 85,
      "context": [
        {
          "id": "kfwss68",
          "author": "Mean-Mood6759",
          "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
          "created_utc": 1704156700.0
        },
        {
          "id": "kfwvjop",
          "author": "Adorable-Mine-5497",
          "body": "i’m not having a pity party just wondering if either anyone else had this and if it was valid for me to be bummed out is all. i get that its hard to deal with your child going through this and most people wouldn’t know what to do or give up after a while, and i don’t blame them, doesn’t mean i cant be bummed about my family giving up",
          "created_utc": 1704157753.0
        }
      ]
    },
    {
      "id": "kfx9pn8",
      "author": "Adorable-Mine-5497",
      "body": "??",
      "created_utc": 1704163295.0,
      "score": 7,
      "context": [
        {
          "id": "kfwss68",
          "author": "Mean-Mood6759",
          "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
          "created_utc": 1704156700.0
        },
        {
          "id": "kfwyzuj",
          "author": "Substantial_Tip_3227",
          "body": "Name tracks",
          "created_utc": 1704159090.0
        }
      ]
    },
    {
      "id": "kfxj4sq",
      "author": "None",
      "body": "If they tried every other time and they're behaving differently now, it's probably a deliberate decision they've made in the hopes that it will benefit you. They're in a difficult position when every other time they tried to help, you just ended back up in the hospital. They've probably realized they need to try a different approach or they'll get the same outcome as before. I really don't think they will let you die. They may, however, let you struggle on your own for a while because it might help you.",
      "created_utc": 1704167171.0,
      "score": 43,
      "context": [
        {
          "id": "kfws9bk",
          "author": "FindingAWayThrough",
          "body": "I wonder if it’s less that they have given up & more that they don’t know what is okay/not okay to say or ask. My partner doesn’t necessarily ask about things daily etc, but it’s mainly bc he doesn’t know how to ask and doesn’t want to upset me more. This might be something to talk about with your family because they might be well-intentioned (then again, they might not be..) but still…\n\nJust some perspective\n\nETA: also - context needed. Are you a minor or are you of age? Is this your first time through treatment? If you’re of age and have been through tx before, I can appreciate that family might not feel able to speak up/like they can ‘force’ you to eat.",
          "created_utc": 1704156507.0
        },
        {
          "id": "kfwux6o",
          "author": "Adorable-Mine-5497",
          "body": "i am a minor and living at home. I’ve been to hospital in think 4 times for AN now and every other time they’ve tried and this time they stopped. i get that they can feel like that and not everyone always knows what to do. just bummed that they stopped is all because it seems i’m a lost cause and everyone around me has given up. and wanted to know if it was valid to feel as such i guess",
          "created_utc": 1704157516.0
        }
      ]
    },
    {
      "id": "kfwvf1z",
      "author": "FindingAWayThrough",
      "body": "Hey OP, I can appreciate how the situation would make you feel that way. What you’re feeling is totally valid. Treatment doesn’t fix everything and sometimes loved ones assume that ‘oh they’re home, they’re good’ or ‘i can’t change them, so I’m not going to say anything or try to help’. Caregiver fatigue is real…and it sucks. \n\nSending you lots of love - and hoping that you don’t think that what I said is blaming you or meaning to invalidate. I want to reiterate that what you’re feeling is SO valid💕",
      "created_utc": 1704157705.0,
      "score": 19,
      "context": [
        {
          "id": "kfws9bk",
          "author": "FindingAWayThrough",
          "body": "I wonder if it’s less that they have given up & more that they don’t know what is okay/not okay to say or ask. My partner doesn’t necessarily ask about things daily etc, but it’s mainly bc he doesn’t know how to ask and doesn’t want to upset me more. This might be something to talk about with your family because they might be well-intentioned (then again, they might not be..) but still…\n\nJust some perspective\n\nETA: also - context needed. Are you a minor or are you of age? Is this your first time through treatment? If you’re of age and have been through tx before, I can appreciate that family might not feel able to speak up/like they can ‘force’ you to eat.",
          "created_utc": 1704156507.0
        },
        {
          "id": "kfwux6o",
          "author": "Adorable-Mine-5497",
          "body": "i am a minor and living at home. I’ve been to hospital in think 4 times for AN now and every other time they’ve tried and this time they stopped. i get that they can feel like that and not everyone always knows what to do. just bummed that they stopped is all because it seems i’m a lost cause and everyone around me has given up. and wanted to know if it was valid to feel as such i guess",
          "created_utc": 1704157516.0
        }
      ]
    },
    {
      "id": "kfwv53v",
      "author": "akoishida",
      "body": "I am so sorry you’re going through this ❤️ please keep your head up, you deserve recovery no matter what. maybe do some soul searching and try to find motivations to eat for YOU, not because someone is begging you to. you deserve to eat even if no one is asking you to",
      "created_utc": 1704157600.0,
      "score": 6,
      "context": [
        {
          "id": "kfws9bk",
          "author": "FindingAWayThrough",
          "body": "I wonder if it’s less that they have given up & more that they don’t know what is okay/not okay to say or ask. My partner doesn’t necessarily ask about things daily etc, but it’s mainly bc he doesn’t know how to ask and doesn’t want to upset me more. This might be something to talk about with your family because they might be well-intentioned (then again, they might not be..) but still…\n\nJust some perspective\n\nETA: also - context needed. Are you a minor or are you of age? Is this your first time through treatment? If you’re of age and have been through tx before, I can appreciate that family might not feel able to speak up/like they can ‘force’ you to eat.",
          "created_utc": 1704156507.0
        },
        {
          "id": "kfwux6o",
          "author": "Adorable-Mine-5497",
          "body": "i am a minor and living at home. I’ve been to hospital in think 4 times for AN now and every other time they’ve tried and this time they stopped. i get that they can feel like that and not everyone always knows what to do. just bummed that they stopped is all because it seems i’m a lost cause and everyone around me has given up. and wanted to know if it was valid to feel as such i guess",
          "created_utc": 1704157516.0
        }
      ]
    },
    {
      "id": "kfyhhzn",
      "author": "TurtleKwitty",
      "body": "Sounds like it's your turn to try now",
      "created_utc": 1704188044.0,
      "score": 2,
      "context": [
        {
          "id": "kfws9bk",
          "author": "FindingAWayThrough",
          "body": "I wonder if it’s less that they have given up & more that they don’t know what is okay/not okay to say or ask. My partner doesn’t necessarily ask about things daily etc, but it’s mainly bc he doesn’t know how to ask and doesn’t want to upset me more. This might be something to talk about with your family because they might be well-intentioned (then again, they might not be..) but still…\n\nJust some perspective\n\nETA: also - context needed. Are you a minor or are you of age? Is this your first time through treatment? If you’re of age and have been through tx before, I can appreciate that family might not feel able to speak up/like they can ‘force’ you to eat.",
          "created_utc": 1704156507.0
        },
        {
          "id": "kfwux6o",
          "author": "Adorable-Mine-5497",
          "body": "i am a minor and living at home. I’ve been to hospital in think 4 times for AN now and every other time they’ve tried and this time they stopped. i get that they can feel like that and not everyone always knows what to do. just bummed that they stopped is all because it seems i’m a lost cause and everyone around me has given up. and wanted to know if it was valid to feel as such i guess",
          "created_utc": 1704157516.0
        }
      ]
    },
    {
      "id": "kfx07p0",
      "author": "disposable_valves",
      "body": "Of course. You sound quite young, and at the very least you've confirmed that you're new at this. I've been sick for over 6 years, so I get it. \n\nMy best advice is to remember that you have time. It's a marathon, not a sprint. But it's worth it. The longer you put it off, the less likely you are to get better. It's hard. But you can do it. I promise.",
      "created_utc": 1704159561.0,
      "score": 14,
      "context": [
        {
          "id": "kfwydg1",
          "author": "disposable_valves",
          "body": "Baby. How long have you been ill? How long have they known?\n\nThey're not letting you die. But they're hurting, too. And likely exhausted.And they can't make you better without you wanting it. I understand the feelings and They're valid, but they're inaccurate.\n\nAsk for help. Try. You can't get better on your own, or without your own help. You need both.",
          "created_utc": 1704158854.0
        },
        {
          "id": "kfwzyzi",
          "author": "Adorable-Mine-5497",
          "body": "only about a year now and but its gone downhill very fast and theyve known for a few months now. and i understand how they feel, 100% and i honestly don’t blame them, at all. and i appreciate your support rather than blaming me for feeling as such, i wish you the best",
          "created_utc": 1704159463.0
        }
      ]
    },
    {
      "id": "kfxkmv1",
      "author": "KickProcedure",
      "body": "I would suggest finding a therapist, counselor or other support person in your community. Maybe a school counselor?\n\nFind a professional, and they can help hold you accountable for eating. If you tell them exactly what you said here, which is that eating is easier when other people pressure or hold you accountable for it, I guarantee they will be willing to help hold you accountable while they help you get comfortable and confident in holding yourself accountable. \n\nI very much understand your position- I have had this disorder since I was 13, in recovery since 15, and relapsed this year at 18. I have *always* found it easier to eat when someone else reminds me “hey, you promised yourself that you would eat <X> amount of calories today. Go eat.” \n\nI am lucky now to have a partner that understands and is able to help hold me accountable without putting too much strain on herself to “make” me eat. That’s the part you have to be careful with- when other people feel like they have to be solely responsible for “making” you eat, they burn out *very* quickly and it can make them sad, tired, stressed, frustrated, and even resentful at times.  \n\nMy biggest piece of advice? Create your own plan to eat. Create goals (“I will eat at least two meals today,” “I will eat dinner today,” “I will eat <X> amount of calories today,” etc.) for YOURSELF, and ask your family to help you hold YOURSELF accountable to it. \n\nAnd don’t get frustrated or argue when they do it. Remember, they’re helping you, but you’re the only one who can really choose whether or not you eat, and whether or not you get better. They’re just helping guide you down the path YOU chose. \n\nI hope this helps, and I’m sorry if the tone is a bit harsh- I struggle with tone over text. You can do this<3",
      "created_utc": 1704167838.0,
      "score": 4,
      "context": [
        {
          "id": "kfx4bu0",
          "author": "None",
          "body": "They’re probably just being cautious or unsure of what to do. My parents were the same after they ran out of techniques. Remember they are most likely also extremely concerned even though it might not show. It could even be shown through fex anger, but theyre not angry theyre worried. I cant imagine what it’s like watching your own kid basically killing themselves in front of your eyes, it’s heartbreaking. My parents weren’t educated enough on the topics of EDs and recovery, which is very understandable bcs its extremely complicated. The parents(or doctors) taking over the control is not the way to go imo. Its gonna be uncomfortable at first but start eating alone mby without even talking about it with ur parents. Dont make food a big deal and eventually hopefully it’ll get more normal. Thats how I got better at least:) giving it attention is just maintaining it. We stopped talking about food in the house, everyone was tired of it since we were constantly arguing. Please dont let it go too long, I feel like I have permanently destroyed my family bcs of how fkked up everything was during that time. Hope ur okay ur so strong and u got this🥹",
          "created_utc": 1704161124.0
        },
        {
          "id": "kfx5xwc",
          "author": "Adorable-Mine-5497",
          "body": "see my ED is so happy that they’ve stopped bc it means i can continue these behaviours “without consequences” so im not sure about the getting better part, and i completely understand that they probably have run out of things to do because nothing was working. and i feel like then leaving it is essentially making it worse in a way? because i only eat when im pressured to do so because im a massive people pleaser so im not sure. sounds messed up but im not mad about that part at all. im not mad about any of it to be honest. its just sad to think about is all",
          "created_utc": 1704161773.0
        }
      ]
    },
    {
      "id": "kfycnm6",
      "author": "probs-hyperfixation",
      "body": "It can affect you. Pushing people away hurts. Feeling forgotten hurts. But you lose the right to complain and feel like a victim because they're not obligated to stand by you.\n\nI hope you get better.",
      "created_utc": 1704184206.0,
      "score": 9,
      "context": [
        {
          "id": "kfyadzj",
          "author": "probs-hyperfixation",
          "body": "People get tired from begging you to eat. It's stressful and mentally taxing for them as well.",
          "created_utc": 1704182477.0
        },
        {
          "id": "kfych78",
          "author": "Adorable-Mine-5497",
          "body": "i understand that completely, but it doesn’t mean it cant affect me either",
          "created_utc": 1704184063.0
        }
      ]
    },
    {
      "id": "kfx4ogz",
      "author": "dark_humor_to_cope",
      "body": "Thank you :)\n\nI completely understand why you don’t want to tell her. Trust me, I get it. I also understand why you don’t want to go back to hospital right now. However, you want to live, and that can only happen if you’re honest with your case worker. \n\nNot that you need it, but have my full permission to tell her everything. I really hope you do. \n\nIf you’re comfortable with it, please keep us updated on this thread. Everyone here, even people whose responses weren’t very nice, wants you to be safe.",
      "created_utc": 1704161264.0,
      "score": 4,
      "context": [
        {
          "id": "kfwwzvc",
          "author": "dark_humor_to_cope",
          "body": "Some of these responses give off a pretty harsh tone, and that might not be the most helpful thing right now. I don’t know why your family isn’t asking you to eat (like other people said, there could be a variety of reasons), and I’m sorry that they aren’t asking you. I would feel the same way if I were you. \n\nI’m here to say that I’m rooting for you, and I want you to eat. Please be careful, though - you’re almost definitely at risk for refeeding syndrome. I am not a medical professional, but it would be a good idea to go to the emergency department and tell them what’s going on so they can keep you safe. While you’re there, you could also ask to talk to a social worker about the situation with your parents.\n\nSending care 💛",
          "created_utc": 1704158318.0
        },
        {
          "id": "kfwyxyx",
          "author": "Adorable-Mine-5497",
          "body": "yeah, getting harsh responses for feeling what i feel is a natural response is making me feel like an asshole and selfish for it, so i really appreciate you and people like you for having empathy and caring about how i feel rather than how focusing on how they feel. and i have an appointment with my case worker tomorrow and my ED and i are fighting each other whether or not to tell her. i dont want to go to hospital again, especially not even a week later but i cant bring myself to eat. but i wish you all the best lovely",
          "created_utc": 1704159070.0
        }
      ]
    },
    {
      "id": "kg03h2q",
      "author": "lacroixlite",
      "body": "Yeah, people are quick to pin the blame on those who hold their families accountable. They’re just projecting their own inability to draw boundaries onto other people. Sorry you have to deal with that - good luck!!!!",
      "created_utc": 1704216997.0,
      "score": 3,
      "context": [
        {
          "id": "kfww09f",
          "author": "lacroixlite",
          "body": "Fuck em. You don’t need the people you’re related to to give a shit about you to know you matter.\n\nYou matter. If I were there I’d make you some soup. Even one spoonful would be enough. \n\nI say this as someone whose family couldn’t care less about what happens to me. It isn’t wrong to expect or even want a favorable response even if you’re not willing to recover. You don’t have to be eating or to be well to expect others to WANT you to eat. You shouldn’t have to *earn* empathy and compassion with any kind of action on your part. It’s *implict* that the people who claim to love us express that in observable ways. \n\nAnd even if you DID want their attention just for the sake of it? Who *gives* a fuck? Human beings need attention. It isn’t a goddamn crime to want the people we care about to pay us notice. The postmodern aversion to “wanting attention” is fucking absurd and based in a scarcity mindset: “*I* don’t get any attention and I don’t expect any so you shouldn’t either!!” Like, please.\n\nTo prove the point, in my case, it isn’t even just anorexia. I was in the ER a few months ago for unrelated issues and not a single member of my immediate family blinked twice. \n\nIt’s not you. You’re not wrong. You deserve better.\n\nBut the fact that you aren’t getting the love and concern you deserve doesn’t mean you don’t deserve it. It only means that your circumstances suck and that it has nothing to do with you. The “they don’t want to push you or fight you” excuse only goes so far. Maybe they don’t want a conflict, but that’s still about them and not you. It means they’re unable to cope with the emotional consequences of forcing somebody to do something that’s good for them.\n\nSo fuck em. You matter and you don’t need them to believe it for it to be true.\n\nTake care of yourself. I care. I want you to live. I’m not gonna force you to recover, but please don’t die at the very least.",
          "created_utc": 1704157931.0
        },
        {
          "id": "kfwxvih",
          "author": "Adorable-Mine-5497",
          "body": "thank you so much. most people here aren’t very understanding to my situation and instead tell me to understand my family, which i do, but it doesn’t mean i cant be bummed. so thank you so much for understanding, i really appreciate it",
          "created_utc": 1704158661.0
        }
      ]
    },
    {
      "id": "kfybbsk",
      "author": "probs-hyperfixation",
      "body": "Girl I agree with her and I've been dealing with an for 20 years now.\n\nWe're sick. People have a right to stop caring about us if our shitty habits and reluctance to recover hurt them. They have a right to put themselves first.\n\nEither recover or understand that this crap will make people tired of you. You'll lose a lot of people because of this and even if your family loves you and still want you to get better they have a right to be in peace and you don't get a say in that.",
      "created_utc": 1704183177.0,
      "score": 2,
      "context": [
        {
          "id": "kfxhcij",
          "author": "die4meplzbtch",
          "body": "They have the right to choose to have peace from your disease. They are tired of your shit. Go get help",
          "created_utc": 1704166404.0
        },
        {
          "id": "kfxobex",
          "author": "Adorable-Mine-5497",
          "body": "seeing as your response to this post id assume you either have not gone through this or have no empathy towards others that have. i suggest that if you arent going to post supportive or helpful comments you dont comment at all because your comment was not supportive nor helpful and was actually outright rude",
          "created_utc": 1704169513.0
        }
      ]
    },
    {
      "id": "kfwtqxa",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1704157062.0,
      "score": -1,
      "context": [
        {
          "id": "kfwsqd2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1704156681.0
        },
        {
          "id": "kfwt7ua",
          "author": "akoishida",
          "body": "this is a really weird response. anorexia isn’t logical, as much as one part of us wants to be left to “starve in peace” it’s also natural to feel like nobody cares for you when they don’t ask you to eat and leave you alone. OP isn’t a bad person for being surprised their family isn’t more attentive",
          "created_utc": 1704156863.0
        }
      ]
    },
    {
      "id": "kfyspua",
      "author": "Tajskskskss",
      "body": "No, it’s completely okay to vent. I’ve been there too, although my mother refused to let me go to the hospital despite my dad’s insistence. I used to freak out over seasoning my shiritaki noodles too much. I feel you. \n\nThat being said, your hunger cues going away is a normal symptom of starving for so long. They likely won’t come back on their own, and when they do, they’ll come back with a vengeance (or maybe they won’t! some people don’t experience this). You still need to eat because your ED isn’t the only part of you. Even if it were, not eating forever would kill it. There’s no ED anymore when you’re dying. There’s no anything. You don’t want to face that dread even if you think you do. Dying from an ED is different than a lot of suicidal methods because it’s so slow and will damage you even if you never get to your deathbed. \n\nYour ED is still valid if you eat something. It would most likely be fairly restrictive anyway. Think about how you got here. You were still eating some foods, but you were sick enough to be hospitalized four times. Hell, if it helps, I’ve generally lost more weight while restricting than while fasting. Metabolism and all that (also exercise in my case but that’s separate). I’m not encouraging you to lose btw, just saying lol. \n\nNot eating for even longer will also increase the chances of getting refeeding syndrome. Trust me, you don’t want that at all. You can find a middle ground between dying and feeling like a failure. You will feel very guilty at first, but that will subside eventually. You just have to get over the initial dread.  \n\nYour hospital is shitty btw.",
      "created_utc": 1704196359.0,
      "score": 2,
      "context": [
        {
          "id": "kfypuha",
          "author": "Tajskskskss",
          "body": "Ohhh God okay. Listen. I get that they aren’t telling you to eat because it hasn’t worked in the past. I think that’s valid. It’s also valid to get mad you aren’t eating. It isn’t valid to completely shut you out and give you cold responses when you just got out of hospital. People generally develop EDs for a reason, and that reason clearly has not been addressed. \n\nI’m sorry this is happening. I know you probably feel like you absolutely cannot eat now since no one is forcing you. Yes, you probably miss the attention, because for one reason or another, you felt like you weren’t getting enough of it at some point in your life. Just think about how you want to move forward. Do you want to never eat again because they don’t force you to? You’ll stay locked in your room and become a lot more miserable and likely end up IP again. You *can* change this. Your ED is a part of you. It’s not a separate entity. It’s you. And that’s okay. It’s an illness. It doesn’t make you a horrible person. Anorexia doesn’t inherently make you a bad person, even if it’s a selfish thing to do. That’s fine. We can all be selfish sometimes. That selfishness is also an illness, though, and one you cannot fully control yet. You can choose to follow those habits or to diminish them (I know you cannot discard them right off the bat). It will take time, but you will be able to control it somewhat eventually. You are feeding into it right now by begrudgingly refusing to eat. That’s a decision you’re making. I would’ve most likely made the same one in your place. \n\nConsidering the fact that this is all for you, you should also just think about what you want. Do you want to eat? A part of you is screaming no, but mostly you probably do—especially since you were probably eating more in the hospital, and your hunger signals must be painful. Please just eat a safe food. You will feel guilty. But it will establish a precedent of independence and doing what you want that will be very helpful in the future. \n\nJust take care of yourself. That’s a grand ask, I know, but you deserve it. You aren’t inherently unable to eat or to care for yourself. This could be the first step of discovering that.",
          "created_utc": 1704194366.0
        },
        {
          "id": "kfyr1y6",
          "author": "Adorable-Mine-5497",
          "body": "i understand and appreciate everything youve said. and for the last parti didnt eat any of my meal plan in hospital and they sent me home regardless. and since coming out i havent had any actual hunger cues or actual cravings like i did before. and for the wanting to eat. yes! i do but i dont. different parts are telling me different things. like one part saying i cant eat because then is be a failure and my ed would no longer be valid if i did and itd reverse everything i did and make me fat. and another is saying do eat bc it looks delicious. but then again the hunger cues and cravings arent really there anymore either. and normally the cravings are the only reason id eat because they wouldnt go away and were so strong. i used to be able to have zerosugar flavoured sparkling water and stuff but i cant anymore. i feel like even that is too many calories so i dont know what to do regarding eating.. i dont know why i blurted that out to you. i dont expect you to know what to do or say, i just blurt shit out a lot, my apologies",
          "created_utc": 1704195222.0
        }
      ]
    },
    {
      "id": "kfwx92f",
      "author": "Adorable-Mine-5497",
      "body": "i do understand. i completely understand. doesnt mean i cant be bummed just because i know how they feel. and i am not making a “big deal” out of it I’m simply stating my feelings, I’m not throwing a fit over it or anything as such",
      "created_utc": 1704158415.0,
      "score": -21,
      "context": [
        {
          "id": "kfwss68",
          "author": "Mean-Mood6759",
          "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
          "created_utc": 1704156700.0
        },
        {
          "id": "kfwvjop",
          "author": "Adorable-Mine-5497",
          "body": "i’m not having a pity party just wondering if either anyone else had this and if it was valid for me to be bummed out is all. i get that its hard to deal with your child going through this and most people wouldn’t know what to do or give up after a while, and i don’t blame them, doesn’t mean i cant be bummed about my family giving up",
          "created_utc": 1704157753.0
        },
        {
          "id": "kfwwpq0",
          "author": "Mean-Mood6759",
          "body": "How old are you?\n\nYou sound between 14 and 16\n\nDon't you understand that your parents are watching their kid slowly die and have given up trying to fight with you. \n\nThey are letting you do what they think you want. \n\nI will tell you again that if you want to try and eat with them, just tell them. \n\nBut don't be making a big deal about them not wanting to fight with you every mealtime",
          "created_utc": 1704158207.0
        }
      ]
    },
    {
      "id": "kfxaie2",
      "author": "Substantial_Tip_3227",
      "body": "The comment here is mean. And their name is \"Mean_Mood\"",
      "created_utc": 1704163617.0,
      "score": -25,
      "context": [
        {
          "id": "kfwss68",
          "author": "Mean-Mood6759",
          "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
          "created_utc": 1704156700.0
        },
        {
          "id": "kfwyzuj",
          "author": "Substantial_Tip_3227",
          "body": "Name tracks",
          "created_utc": 1704159090.0
        },
        {
          "id": "kfx9pn8",
          "author": "Adorable-Mine-5497",
          "body": "??",
          "created_utc": 1704163295.0
        }
      ]
    },
    {
      "id": "kfxlz6m",
      "author": "Adorable-Mine-5497",
      "body": "they might let me without knowing it as they havent even been interacting with me unless i engage it. and i do understand why they are acting different, what position they’re in and how they may feel about it",
      "created_utc": 1704168436.0,
      "score": 2,
      "context": [
        {
          "id": "kfws9bk",
          "author": "FindingAWayThrough",
          "body": "I wonder if it’s less that they have given up & more that they don’t know what is okay/not okay to say or ask. My partner doesn’t necessarily ask about things daily etc, but it’s mainly bc he doesn’t know how to ask and doesn’t want to upset me more. This might be something to talk about with your family because they might be well-intentioned (then again, they might not be..) but still…\n\nJust some perspective\n\nETA: also - context needed. Are you a minor or are you of age? Is this your first time through treatment? If you’re of age and have been through tx before, I can appreciate that family might not feel able to speak up/like they can ‘force’ you to eat.",
          "created_utc": 1704156507.0
        },
        {
          "id": "kfwux6o",
          "author": "Adorable-Mine-5497",
          "body": "i am a minor and living at home. I’ve been to hospital in think 4 times for AN now and every other time they’ve tried and this time they stopped. i get that they can feel like that and not everyone always knows what to do. just bummed that they stopped is all because it seems i’m a lost cause and everyone around me has given up. and wanted to know if it was valid to feel as such i guess",
          "created_utc": 1704157516.0
        },
        {
          "id": "kfxj4sq",
          "author": "None",
          "body": "If they tried every other time and they're behaving differently now, it's probably a deliberate decision they've made in the hopes that it will benefit you. They're in a difficult position when every other time they tried to help, you just ended back up in the hospital. They've probably realized they need to try a different approach or they'll get the same outcome as before. I really don't think they will let you die. They may, however, let you struggle on your own for a while because it might help you.",
          "created_utc": 1704167171.0
        }
      ]
    },
    {
      "id": "kfwwbgh",
      "author": "Adorable-Mine-5497",
      "body": "thank you so much, i definitely understand their position and why they would stop or don’t know what to do, and i really appreciate your response to it. makes me feel a bit less selfish. and i wish all the best for you",
      "created_utc": 1704158055.0,
      "score": 13,
      "context": [
        {
          "id": "kfws9bk",
          "author": "FindingAWayThrough",
          "body": "I wonder if it’s less that they have given up & more that they don’t know what is okay/not okay to say or ask. My partner doesn’t necessarily ask about things daily etc, but it’s mainly bc he doesn’t know how to ask and doesn’t want to upset me more. This might be something to talk about with your family because they might be well-intentioned (then again, they might not be..) but still…\n\nJust some perspective\n\nETA: also - context needed. Are you a minor or are you of age? Is this your first time through treatment? If you’re of age and have been through tx before, I can appreciate that family might not feel able to speak up/like they can ‘force’ you to eat.",
          "created_utc": 1704156507.0
        },
        {
          "id": "kfwux6o",
          "author": "Adorable-Mine-5497",
          "body": "i am a minor and living at home. I’ve been to hospital in think 4 times for AN now and every other time they’ve tried and this time they stopped. i get that they can feel like that and not everyone always knows what to do. just bummed that they stopped is all because it seems i’m a lost cause and everyone around me has given up. and wanted to know if it was valid to feel as such i guess",
          "created_utc": 1704157516.0
        },
        {
          "id": "kfwvf1z",
          "author": "FindingAWayThrough",
          "body": "Hey OP, I can appreciate how the situation would make you feel that way. What you’re feeling is totally valid. Treatment doesn’t fix everything and sometimes loved ones assume that ‘oh they’re home, they’re good’ or ‘i can’t change them, so I’m not going to say anything or try to help’. Caregiver fatigue is real…and it sucks. \n\nSending you lots of love - and hoping that you don’t think that what I said is blaming you or meaning to invalidate. I want to reiterate that what you’re feeling is SO valid💕",
          "created_utc": 1704157705.0
        }
      ]
    },
    {
      "id": "kfxlc7d",
      "author": "Adorable-Mine-5497",
      "body": "i dont think it was harsh at all! it was suggestions from someone who has been in a similar boat and i really appreciate it rather than saying “get help.” or “just eat” which i have been told oh so many times, so i really appreciate everything that youve said and will take it all into consideration when im ready for recovery. thank you so much, and i wish you the best both in full recovery and in every other aspect <3",
      "created_utc": 1704168149.0,
      "score": 2,
      "context": [
        {
          "id": "kfx4bu0",
          "author": "None",
          "body": "They’re probably just being cautious or unsure of what to do. My parents were the same after they ran out of techniques. Remember they are most likely also extremely concerned even though it might not show. It could even be shown through fex anger, but theyre not angry theyre worried. I cant imagine what it’s like watching your own kid basically killing themselves in front of your eyes, it’s heartbreaking. My parents weren’t educated enough on the topics of EDs and recovery, which is very understandable bcs its extremely complicated. The parents(or doctors) taking over the control is not the way to go imo. Its gonna be uncomfortable at first but start eating alone mby without even talking about it with ur parents. Dont make food a big deal and eventually hopefully it’ll get more normal. Thats how I got better at least:) giving it attention is just maintaining it. We stopped talking about food in the house, everyone was tired of it since we were constantly arguing. Please dont let it go too long, I feel like I have permanently destroyed my family bcs of how fkked up everything was during that time. Hope ur okay ur so strong and u got this🥹",
          "created_utc": 1704161124.0
        },
        {
          "id": "kfx5xwc",
          "author": "Adorable-Mine-5497",
          "body": "see my ED is so happy that they’ve stopped bc it means i can continue these behaviours “without consequences” so im not sure about the getting better part, and i completely understand that they probably have run out of things to do because nothing was working. and i feel like then leaving it is essentially making it worse in a way? because i only eat when im pressured to do so because im a massive people pleaser so im not sure. sounds messed up but im not mad about that part at all. im not mad about any of it to be honest. its just sad to think about is all",
          "created_utc": 1704161773.0
        },
        {
          "id": "kfxkmv1",
          "author": "KickProcedure",
          "body": "I would suggest finding a therapist, counselor or other support person in your community. Maybe a school counselor?\n\nFind a professional, and they can help hold you accountable for eating. If you tell them exactly what you said here, which is that eating is easier when other people pressure or hold you accountable for it, I guarantee they will be willing to help hold you accountable while they help you get comfortable and confident in holding yourself accountable. \n\nI very much understand your position- I have had this disorder since I was 13, in recovery since 15, and relapsed this year at 18. I have *always* found it easier to eat when someone else reminds me “hey, you promised yourself that you would eat <X> amount of calories today. Go eat.” \n\nI am lucky now to have a partner that understands and is able to help hold me accountable without putting too much strain on herself to “make” me eat. That’s the part you have to be careful with- when other people feel like they have to be solely responsible for “making” you eat, they burn out *very* quickly and it can make them sad, tired, stressed, frustrated, and even resentful at times.  \n\nMy biggest piece of advice? Create your own plan to eat. Create goals (“I will eat at least two meals today,” “I will eat dinner today,” “I will eat <X> amount of calories today,” etc.) for YOURSELF, and ask your family to help you hold YOURSELF accountable to it. \n\nAnd don’t get frustrated or argue when they do it. Remember, they’re helping you, but you’re the only one who can really choose whether or not you eat, and whether or not you get better. They’re just helping guide you down the path YOU chose. \n\nI hope this helps, and I’m sorry if the tone is a bit harsh- I struggle with tone over text. You can do this<3",
          "created_utc": 1704167838.0
        }
      ]
    },
    {
      "id": "kfyownw",
      "author": "Tajskskskss",
      "body": "She doesn’t lose the right to complain lol. Feelings are valid, and you have to work through them by voicing them at least to yourself or to online strangers. I get what her parents are trying to do, and I can’t fault them for it, but acting this cold (not the part where they aren’t asking her to eat) is unnecessary.",
      "created_utc": 1704193698.0,
      "score": 6,
      "context": [
        {
          "id": "kfyadzj",
          "author": "probs-hyperfixation",
          "body": "People get tired from begging you to eat. It's stressful and mentally taxing for them as well.",
          "created_utc": 1704182477.0
        },
        {
          "id": "kfych78",
          "author": "Adorable-Mine-5497",
          "body": "i understand that completely, but it doesn’t mean it cant affect me either",
          "created_utc": 1704184063.0
        },
        {
          "id": "kfycnm6",
          "author": "probs-hyperfixation",
          "body": "It can affect you. Pushing people away hurts. Feeling forgotten hurts. But you lose the right to complain and feel like a victim because they're not obligated to stand by you.\n\nI hope you get better.",
          "created_utc": 1704184206.0
        }
      ]
    },
    {
      "id": "kfyd5ya",
      "author": "Adorable-Mine-5497",
      "body": "i know i am not the victim and i know how much it would hurt them seeing it all. and i wasn’t intending to complain about it but rather to mainly voice my feelings about the situation. i shouldve voiced in the post that i dont blame them and understand it and i apologise for that. but wishing the best for you",
      "created_utc": 1704184603.0,
      "score": 0,
      "context": [
        {
          "id": "kfyadzj",
          "author": "probs-hyperfixation",
          "body": "People get tired from begging you to eat. It's stressful and mentally taxing for them as well.",
          "created_utc": 1704182477.0
        },
        {
          "id": "kfych78",
          "author": "Adorable-Mine-5497",
          "body": "i understand that completely, but it doesn’t mean it cant affect me either",
          "created_utc": 1704184063.0
        },
        {
          "id": "kfycnm6",
          "author": "probs-hyperfixation",
          "body": "It can affect you. Pushing people away hurts. Feeling forgotten hurts. But you lose the right to complain and feel like a victim because they're not obligated to stand by you.\n\nI hope you get better.",
          "created_utc": 1704184206.0
        }
      ]
    },
    {
      "id": "kfx6osf",
      "author": "Adorable-Mine-5497",
      "body": "the tough part is that i do want to die tho, i know it probably sounds stupid but i want it to kill me, and i dont want the help or support, sounds dumb considering i got sad about my family stopping it. but if i do end up reaching out tomorrow, i will update you :)",
      "created_utc": 1704162076.0,
      "score": 6,
      "context": [
        {
          "id": "kfwwzvc",
          "author": "dark_humor_to_cope",
          "body": "Some of these responses give off a pretty harsh tone, and that might not be the most helpful thing right now. I don’t know why your family isn’t asking you to eat (like other people said, there could be a variety of reasons), and I’m sorry that they aren’t asking you. I would feel the same way if I were you. \n\nI’m here to say that I’m rooting for you, and I want you to eat. Please be careful, though - you’re almost definitely at risk for refeeding syndrome. I am not a medical professional, but it would be a good idea to go to the emergency department and tell them what’s going on so they can keep you safe. While you’re there, you could also ask to talk to a social worker about the situation with your parents.\n\nSending care 💛",
          "created_utc": 1704158318.0
        },
        {
          "id": "kfwyxyx",
          "author": "Adorable-Mine-5497",
          "body": "yeah, getting harsh responses for feeling what i feel is a natural response is making me feel like an asshole and selfish for it, so i really appreciate you and people like you for having empathy and caring about how i feel rather than how focusing on how they feel. and i have an appointment with my case worker tomorrow and my ED and i are fighting each other whether or not to tell her. i dont want to go to hospital again, especially not even a week later but i cant bring myself to eat. but i wish you all the best lovely",
          "created_utc": 1704159070.0
        },
        {
          "id": "kfx4ogz",
          "author": "dark_humor_to_cope",
          "body": "Thank you :)\n\nI completely understand why you don’t want to tell her. Trust me, I get it. I also understand why you don’t want to go back to hospital right now. However, you want to live, and that can only happen if you’re honest with your case worker. \n\nNot that you need it, but have my full permission to tell her everything. I really hope you do. \n\nIf you’re comfortable with it, please keep us updated on this thread. Everyone here, even people whose responses weren’t very nice, wants you to be safe.",
          "created_utc": 1704161264.0
        }
      ]
    },
    {
      "id": "kfycal7",
      "author": "Adorable-Mine-5497",
      "body": "im just saying it couldve been said in a nicer way, im not saying theyre wrong at all, just couldve been worded a lot better",
      "created_utc": 1704183918.0,
      "score": 4,
      "context": [
        {
          "id": "kfxhcij",
          "author": "die4meplzbtch",
          "body": "They have the right to choose to have peace from your disease. They are tired of your shit. Go get help",
          "created_utc": 1704166404.0
        },
        {
          "id": "kfxobex",
          "author": "Adorable-Mine-5497",
          "body": "seeing as your response to this post id assume you either have not gone through this or have no empathy towards others that have. i suggest that if you arent going to post supportive or helpful comments you dont comment at all because your comment was not supportive nor helpful and was actually outright rude",
          "created_utc": 1704169513.0
        },
        {
          "id": "kfybbsk",
          "author": "probs-hyperfixation",
          "body": "Girl I agree with her and I've been dealing with an for 20 years now.\n\nWe're sick. People have a right to stop caring about us if our shitty habits and reluctance to recover hurt them. They have a right to put themselves first.\n\nEither recover or understand that this crap will make people tired of you. You'll lose a lot of people because of this and even if your family loves you and still want you to get better they have a right to be in peace and you don't get a say in that.",
          "created_utc": 1704183177.0
        }
      ]
    },
    {
      "id": "kfwuyuz",
      "author": "akoishida",
      "body": "accusing OP of wanting to terrorize their family is pretty fucking mean.\n\nit is 100% natural to feel sad/unloved if your family is leaving you to starve, even if it’s what your ED wants",
      "created_utc": 1704157534.0,
      "score": 2,
      "context": [
        {
          "id": "kfwsqd2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1704156681.0
        },
        {
          "id": "kfwt7ua",
          "author": "akoishida",
          "body": "this is a really weird response. anorexia isn’t logical, as much as one part of us wants to be left to “starve in peace” it’s also natural to feel like nobody cares for you when they don’t ask you to eat and leave you alone. OP isn’t a bad person for being surprised their family isn’t more attentive",
          "created_utc": 1704156863.0
        },
        {
          "id": "kfwtqxa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1704157062.0
        }
      ]
    },
    {
      "id": "kfwvy5k",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1704157908.0,
      "score": 0,
      "context": [
        {
          "id": "kfwsqd2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1704156681.0
        },
        {
          "id": "kfwt7ua",
          "author": "akoishida",
          "body": "this is a really weird response. anorexia isn’t logical, as much as one part of us wants to be left to “starve in peace” it’s also natural to feel like nobody cares for you when they don’t ask you to eat and leave you alone. OP isn’t a bad person for being surprised their family isn’t more attentive",
          "created_utc": 1704156863.0
        },
        {
          "id": "kfwtqxa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1704157062.0
        }
      ]
    },
    {
      "id": "kfx4n0b",
      "author": "Asspieburgers",
      "body": "This is probably going to get me downvoted, but reading between the lines of the OP and some of your comments, it seems like you use your ED to control people in to caring (or to feel like people care about you, or just to feel cared for) and are experiencing some negative feelings about it now that it has stopped working.\n\nPerhaps this is the control aspect of your ED for you? Your ed lets you control people's treatment of you? Which could explain why you are feeling so negative now, because 1. It has always worked, and 2. You can't comprehend people appearing not to care about someone over that.\n\nI know for a fact that that was a reason why my ex's ED manifested even though she swore black and blue that it wasn't. She would let it slip, little hints, when she was fused. It took me ages to connect the dots (I am autistic and have a brain injury that affects my memory (both formation and recall)), but once I saw her doing it I was bewildered — it was so clear that everyone in her life cared about her *a lot*.",
      "created_utc": 1704161248.0,
      "score": 109,
      "context": [
        {
          "id": "kfwss68",
          "author": "Mean-Mood6759",
          "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
          "created_utc": 1704156700.0
        },
        {
          "id": "kfwvjop",
          "author": "Adorable-Mine-5497",
          "body": "i’m not having a pity party just wondering if either anyone else had this and if it was valid for me to be bummed out is all. i get that its hard to deal with your child going through this and most people wouldn’t know what to do or give up after a while, and i don’t blame them, doesn’t mean i cant be bummed about my family giving up",
          "created_utc": 1704157753.0
        },
        {
          "id": "kfwwpq0",
          "author": "Mean-Mood6759",
          "body": "How old are you?\n\nYou sound between 14 and 16\n\nDon't you understand that your parents are watching their kid slowly die and have given up trying to fight with you. \n\nThey are letting you do what they think you want. \n\nI will tell you again that if you want to try and eat with them, just tell them. \n\nBut don't be making a big deal about them not wanting to fight with you every mealtime",
          "created_utc": 1704158207.0
        },
        {
          "id": "kfwx92f",
          "author": "Adorable-Mine-5497",
          "body": "i do understand. i completely understand. doesnt mean i cant be bummed just because i know how they feel. and i am not making a “big deal” out of it I’m simply stating my feelings, I’m not throwing a fit over it or anything as such",
          "created_utc": 1704158415.0
        }
      ]
    },
    {
      "id": "kfwy32x",
      "author": "Mean-Mood6759",
      "body": "With the way they are acting, they are giving you 2 options.\n\n1 - to choose to recover\n\n2 - continue how you are\n\nThey are leaving it up to you and aren't fighting you anymore\n\nYour recovery is your recovery, it is your choice\n\nThey have probably come to terms with the fact that you have chosen option 2",
      "created_utc": 1704158744.0,
      "score": 64,
      "context": [
        {
          "id": "kfwss68",
          "author": "Mean-Mood6759",
          "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
          "created_utc": 1704156700.0
        },
        {
          "id": "kfwvjop",
          "author": "Adorable-Mine-5497",
          "body": "i’m not having a pity party just wondering if either anyone else had this and if it was valid for me to be bummed out is all. i get that its hard to deal with your child going through this and most people wouldn’t know what to do or give up after a while, and i don’t blame them, doesn’t mean i cant be bummed about my family giving up",
          "created_utc": 1704157753.0
        },
        {
          "id": "kfwwpq0",
          "author": "Mean-Mood6759",
          "body": "How old are you?\n\nYou sound between 14 and 16\n\nDon't you understand that your parents are watching their kid slowly die and have given up trying to fight with you. \n\nThey are letting you do what they think you want. \n\nI will tell you again that if you want to try and eat with them, just tell them. \n\nBut don't be making a big deal about them not wanting to fight with you every mealtime",
          "created_utc": 1704158207.0
        },
        {
          "id": "kfwx92f",
          "author": "Adorable-Mine-5497",
          "body": "i do understand. i completely understand. doesnt mean i cant be bummed just because i know how they feel. and i am not making a “big deal” out of it I’m simply stating my feelings, I’m not throwing a fit over it or anything as such",
          "created_utc": 1704158415.0
        }
      ]
    },
    {
      "id": "kfxba60",
      "author": "Adorable-Mine-5497",
      "body": "ohh okay",
      "created_utc": 1704163926.0,
      "score": 0,
      "context": [
        {
          "id": "kfwss68",
          "author": "Mean-Mood6759",
          "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
          "created_utc": 1704156700.0
        },
        {
          "id": "kfwyzuj",
          "author": "Substantial_Tip_3227",
          "body": "Name tracks",
          "created_utc": 1704159090.0
        },
        {
          "id": "kfx9pn8",
          "author": "Adorable-Mine-5497",
          "body": "??",
          "created_utc": 1704163295.0
        },
        {
          "id": "kfxaie2",
          "author": "Substantial_Tip_3227",
          "body": "The comment here is mean. And their name is \"Mean_Mood\"",
          "created_utc": 1704163617.0
        }
      ]
    },
    {
      "id": "kfx9o7v",
      "author": "dark_humor_to_cope",
      "body": "None of that sounds stupid. EDs usually involve a lot of conflicting thoughts and desires.\n\nWhen she was a teenager, my best friend felt just like you do (we’re both 21 now in case you’re curious haha). She had no hope, and she had felt like that for a long time. Now she’s doing much better, and she’s glad that she didn’t let her ED win. And I still have my best friend.",
      "created_utc": 1704163278.0,
      "score": 7,
      "context": [
        {
          "id": "kfwwzvc",
          "author": "dark_humor_to_cope",
          "body": "Some of these responses give off a pretty harsh tone, and that might not be the most helpful thing right now. I don’t know why your family isn’t asking you to eat (like other people said, there could be a variety of reasons), and I’m sorry that they aren’t asking you. I would feel the same way if I were you. \n\nI’m here to say that I’m rooting for you, and I want you to eat. Please be careful, though - you’re almost definitely at risk for refeeding syndrome. I am not a medical professional, but it would be a good idea to go to the emergency department and tell them what’s going on so they can keep you safe. While you’re there, you could also ask to talk to a social worker about the situation with your parents.\n\nSending care 💛",
          "created_utc": 1704158318.0
        },
        {
          "id": "kfwyxyx",
          "author": "Adorable-Mine-5497",
          "body": "yeah, getting harsh responses for feeling what i feel is a natural response is making me feel like an asshole and selfish for it, so i really appreciate you and people like you for having empathy and caring about how i feel rather than how focusing on how they feel. and i have an appointment with my case worker tomorrow and my ED and i are fighting each other whether or not to tell her. i dont want to go to hospital again, especially not even a week later but i cant bring myself to eat. but i wish you all the best lovely",
          "created_utc": 1704159070.0
        },
        {
          "id": "kfx4ogz",
          "author": "dark_humor_to_cope",
          "body": "Thank you :)\n\nI completely understand why you don’t want to tell her. Trust me, I get it. I also understand why you don’t want to go back to hospital right now. However, you want to live, and that can only happen if you’re honest with your case worker. \n\nNot that you need it, but have my full permission to tell her everything. I really hope you do. \n\nIf you’re comfortable with it, please keep us updated on this thread. Everyone here, even people whose responses weren’t very nice, wants you to be safe.",
          "created_utc": 1704161264.0
        },
        {
          "id": "kfx6osf",
          "author": "Adorable-Mine-5497",
          "body": "the tough part is that i do want to die tho, i know it probably sounds stupid but i want it to kill me, and i dont want the help or support, sounds dumb considering i got sad about my family stopping it. but if i do end up reaching out tomorrow, i will update you :)",
          "created_utc": 1704162076.0
        }
      ]
    },
    {
      "id": "kfx530i",
      "author": "Adorable-Mine-5497",
      "body": "honestly my ED is happy that they don’t care, means i can essentially do what I’ve wanted this whole time. but ig the “normal” side of me is upset that my family have given up trying. thats all",
      "created_utc": 1704161430.0,
      "score": -20,
      "context": [
        {
          "id": "kfwss68",
          "author": "Mean-Mood6759",
          "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
          "created_utc": 1704156700.0
        },
        {
          "id": "kfwvjop",
          "author": "Adorable-Mine-5497",
          "body": "i’m not having a pity party just wondering if either anyone else had this and if it was valid for me to be bummed out is all. i get that its hard to deal with your child going through this and most people wouldn’t know what to do or give up after a while, and i don’t blame them, doesn’t mean i cant be bummed about my family giving up",
          "created_utc": 1704157753.0
        },
        {
          "id": "kfwwpq0",
          "author": "Mean-Mood6759",
          "body": "How old are you?\n\nYou sound between 14 and 16\n\nDon't you understand that your parents are watching their kid slowly die and have given up trying to fight with you. \n\nThey are letting you do what they think you want. \n\nI will tell you again that if you want to try and eat with them, just tell them. \n\nBut don't be making a big deal about them not wanting to fight with you every mealtime",
          "created_utc": 1704158207.0
        },
        {
          "id": "kfwx92f",
          "author": "Adorable-Mine-5497",
          "body": "i do understand. i completely understand. doesnt mean i cant be bummed just because i know how they feel. and i am not making a “big deal” out of it I’m simply stating my feelings, I’m not throwing a fit over it or anything as such",
          "created_utc": 1704158415.0
        },
        {
          "id": "kfx4n0b",
          "author": "Asspieburgers",
          "body": "This is probably going to get me downvoted, but reading between the lines of the OP and some of your comments, it seems like you use your ED to control people in to caring (or to feel like people care about you, or just to feel cared for) and are experiencing some negative feelings about it now that it has stopped working.\n\nPerhaps this is the control aspect of your ED for you? Your ed lets you control people's treatment of you? Which could explain why you are feeling so negative now, because 1. It has always worked, and 2. You can't comprehend people appearing not to care about someone over that.\n\nI know for a fact that that was a reason why my ex's ED manifested even though she swore black and blue that it wasn't. She would let it slip, little hints, when she was fused. It took me ages to connect the dots (I am autistic and have a brain injury that affects my memory (both formation and recall)), but once I saw her doing it I was bewildered — it was so clear that everyone in her life cared about her *a lot*.",
          "created_utc": 1704161248.0
        }
      ]
    },
    {
      "id": "kfxb31t",
      "author": "Adorable-Mine-5497",
      "body": "im so so happy for her and you, and im sure to someone who doesnt/didnt have an ED or dont know much about it would think how i think is stupid but im so glad ive found people who dont and support me.",
      "created_utc": 1704163847.0,
      "score": 4,
      "context": [
        {
          "id": "kfwwzvc",
          "author": "dark_humor_to_cope",
          "body": "Some of these responses give off a pretty harsh tone, and that might not be the most helpful thing right now. I don’t know why your family isn’t asking you to eat (like other people said, there could be a variety of reasons), and I’m sorry that they aren’t asking you. I would feel the same way if I were you. \n\nI’m here to say that I’m rooting for you, and I want you to eat. Please be careful, though - you’re almost definitely at risk for refeeding syndrome. I am not a medical professional, but it would be a good idea to go to the emergency department and tell them what’s going on so they can keep you safe. While you’re there, you could also ask to talk to a social worker about the situation with your parents.\n\nSending care 💛",
          "created_utc": 1704158318.0
        },
        {
          "id": "kfwyxyx",
          "author": "Adorable-Mine-5497",
          "body": "yeah, getting harsh responses for feeling what i feel is a natural response is making me feel like an asshole and selfish for it, so i really appreciate you and people like you for having empathy and caring about how i feel rather than how focusing on how they feel. and i have an appointment with my case worker tomorrow and my ED and i are fighting each other whether or not to tell her. i dont want to go to hospital again, especially not even a week later but i cant bring myself to eat. but i wish you all the best lovely",
          "created_utc": 1704159070.0
        },
        {
          "id": "kfx4ogz",
          "author": "dark_humor_to_cope",
          "body": "Thank you :)\n\nI completely understand why you don’t want to tell her. Trust me, I get it. I also understand why you don’t want to go back to hospital right now. However, you want to live, and that can only happen if you’re honest with your case worker. \n\nNot that you need it, but have my full permission to tell her everything. I really hope you do. \n\nIf you’re comfortable with it, please keep us updated on this thread. Everyone here, even people whose responses weren’t very nice, wants you to be safe.",
          "created_utc": 1704161264.0
        },
        {
          "id": "kfx6osf",
          "author": "Adorable-Mine-5497",
          "body": "the tough part is that i do want to die tho, i know it probably sounds stupid but i want it to kill me, and i dont want the help or support, sounds dumb considering i got sad about my family stopping it. but if i do end up reaching out tomorrow, i will update you :)",
          "created_utc": 1704162076.0
        },
        {
          "id": "kfx9o7v",
          "author": "dark_humor_to_cope",
          "body": "None of that sounds stupid. EDs usually involve a lot of conflicting thoughts and desires.\n\nWhen she was a teenager, my best friend felt just like you do (we’re both 21 now in case you’re curious haha). She had no hope, and she had felt like that for a long time. Now she’s doing much better, and she’s glad that she didn’t let her ED win. And I still have my best friend.",
          "created_utc": 1704163278.0
        }
      ]
    },
    {
      "id": "kge0k2b",
      "author": "Adorable-Mine-5497",
      "body": "hey as i promised i will update you, i just got out of hospital after getting rushed to resus, i am okay now and have eaten today x",
      "created_utc": 1704429252.0,
      "score": 2,
      "context": [
        {
          "id": "kfwwzvc",
          "author": "dark_humor_to_cope",
          "body": "Some of these responses give off a pretty harsh tone, and that might not be the most helpful thing right now. I don’t know why your family isn’t asking you to eat (like other people said, there could be a variety of reasons), and I’m sorry that they aren’t asking you. I would feel the same way if I were you. \n\nI’m here to say that I’m rooting for you, and I want you to eat. Please be careful, though - you’re almost definitely at risk for refeeding syndrome. I am not a medical professional, but it would be a good idea to go to the emergency department and tell them what’s going on so they can keep you safe. While you’re there, you could also ask to talk to a social worker about the situation with your parents.\n\nSending care 💛",
          "created_utc": 1704158318.0
        },
        {
          "id": "kfwyxyx",
          "author": "Adorable-Mine-5497",
          "body": "yeah, getting harsh responses for feeling what i feel is a natural response is making me feel like an asshole and selfish for it, so i really appreciate you and people like you for having empathy and caring about how i feel rather than how focusing on how they feel. and i have an appointment with my case worker tomorrow and my ED and i are fighting each other whether or not to tell her. i dont want to go to hospital again, especially not even a week later but i cant bring myself to eat. but i wish you all the best lovely",
          "created_utc": 1704159070.0
        },
        {
          "id": "kfx4ogz",
          "author": "dark_humor_to_cope",
          "body": "Thank you :)\n\nI completely understand why you don’t want to tell her. Trust me, I get it. I also understand why you don’t want to go back to hospital right now. However, you want to live, and that can only happen if you’re honest with your case worker. \n\nNot that you need it, but have my full permission to tell her everything. I really hope you do. \n\nIf you’re comfortable with it, please keep us updated on this thread. Everyone here, even people whose responses weren’t very nice, wants you to be safe.",
          "created_utc": 1704161264.0
        },
        {
          "id": "kfx6osf",
          "author": "Adorable-Mine-5497",
          "body": "the tough part is that i do want to die tho, i know it probably sounds stupid but i want it to kill me, and i dont want the help or support, sounds dumb considering i got sad about my family stopping it. but if i do end up reaching out tomorrow, i will update you :)",
          "created_utc": 1704162076.0
        },
        {
          "id": "kfx9o7v",
          "author": "dark_humor_to_cope",
          "body": "None of that sounds stupid. EDs usually involve a lot of conflicting thoughts and desires.\n\nWhen she was a teenager, my best friend felt just like you do (we’re both 21 now in case you’re curious haha). She had no hope, and she had felt like that for a long time. Now she’s doing much better, and she’s glad that she didn’t let her ED win. And I still have my best friend.",
          "created_utc": 1704163278.0
        }
      ]
    },
    {
      "id": "kfx7dnw",
      "author": "Asspieburgers",
      "body": "The duality of man. You are able to hold 2 conflicting beliefs at once. It proves nothing that you are happy that they don't care on the level of feeling free to slip deeply into your ed. You can still feel a profound abandonment despite that.\n\nShit, they aren't even conflicting beliefs. I was suicidal and was going to attempt suicide (and in fact did end up attempting), I found a note recently and in it I felt like nobody cared, which of course was horrible to feel, but I was also happy they didn't because it would mean they wouldn't be negatively affected by my suicide.\n\nNot exactly the same but same concept.\n\nNote that it was a serious attempt on my life. I did not want to be living. I took a purposeful, exceedingly life threatening overdose of an opiate and somehow survived.",
      "created_utc": 1704162356.0,
      "score": 38,
      "context": [
        {
          "id": "kfwss68",
          "author": "Mean-Mood6759",
          "body": "They don't want to force you to eat anymore because it's a choice that you have to make yourself.\n \nThey probably don't want to fight with you. \n\nIt's up to you if you want to join them or if you want to try to eat on your own. \n\nStop having a pity party because they have stopped trying to force you to do something that you were probably fighting them with. \n\nYou could tell them in advance that you would like to try to eat with them, they aren't mindreaders",
          "created_utc": 1704156700.0
        },
        {
          "id": "kfwvjop",
          "author": "Adorable-Mine-5497",
          "body": "i’m not having a pity party just wondering if either anyone else had this and if it was valid for me to be bummed out is all. i get that its hard to deal with your child going through this and most people wouldn’t know what to do or give up after a while, and i don’t blame them, doesn’t mean i cant be bummed about my family giving up",
          "created_utc": 1704157753.0
        },
        {
          "id": "kfwwpq0",
          "author": "Mean-Mood6759",
          "body": "How old are you?\n\nYou sound between 14 and 16\n\nDon't you understand that your parents are watching their kid slowly die and have given up trying to fight with you. \n\nThey are letting you do what they think you want. \n\nI will tell you again that if you want to try and eat with them, just tell them. \n\nBut don't be making a big deal about them not wanting to fight with you every mealtime",
          "created_utc": 1704158207.0
        },
        {
          "id": "kfwx92f",
          "author": "Adorable-Mine-5497",
          "body": "i do understand. i completely understand. doesnt mean i cant be bummed just because i know how they feel. and i am not making a “big deal” out of it I’m simply stating my feelings, I’m not throwing a fit over it or anything as such",
          "created_utc": 1704158415.0
        },
        {
          "id": "kfx4n0b",
          "author": "Asspieburgers",
          "body": "This is probably going to get me downvoted, but reading between the lines of the OP and some of your comments, it seems like you use your ED to control people in to caring (or to feel like people care about you, or just to feel cared for) and are experiencing some negative feelings about it now that it has stopped working.\n\nPerhaps this is the control aspect of your ED for you? Your ed lets you control people's treatment of you? Which could explain why you are feeling so negative now, because 1. It has always worked, and 2. You can't comprehend people appearing not to care about someone over that.\n\nI know for a fact that that was a reason why my ex's ED manifested even though she swore black and blue that it wasn't. She would let it slip, little hints, when she was fused. It took me ages to connect the dots (I am autistic and have a brain injury that affects my memory (both formation and recall)), but once I saw her doing it I was bewildered — it was so clear that everyone in her life cared about her *a lot*.",
          "created_utc": 1704161248.0
        },
        {
          "id": "kfx530i",
          "author": "Adorable-Mine-5497",
          "body": "honestly my ED is happy that they don’t care, means i can essentially do what I’ve wanted this whole time. but ig the “normal” side of me is upset that my family have given up trying. thats all",
          "created_utc": 1704161430.0
        }
      ]
    },
    {
      "id": "kge82lp",
      "author": "dark_humor_to_cope",
      "body": "Hi! Thank you for the update :) I’m glad you got some help. Do you have a plan for continuing care, like inpatient or outpatient therapy/dietitian appointments?",
      "created_utc": 1704432972.0,
      "score": 1,
      "context": [
        {
          "id": "kfwwzvc",
          "author": "dark_humor_to_cope",
          "body": "Some of these responses give off a pretty harsh tone, and that might not be the most helpful thing right now. I don’t know why your family isn’t asking you to eat (like other people said, there could be a variety of reasons), and I’m sorry that they aren’t asking you. I would feel the same way if I were you. \n\nI’m here to say that I’m rooting for you, and I want you to eat. Please be careful, though - you’re almost definitely at risk for refeeding syndrome. I am not a medical professional, but it would be a good idea to go to the emergency department and tell them what’s going on so they can keep you safe. While you’re there, you could also ask to talk to a social worker about the situation with your parents.\n\nSending care 💛",
          "created_utc": 1704158318.0
        },
        {
          "id": "kfwyxyx",
          "author": "Adorable-Mine-5497",
          "body": "yeah, getting harsh responses for feeling what i feel is a natural response is making me feel like an asshole and selfish for it, so i really appreciate you and people like you for having empathy and caring about how i feel rather than how focusing on how they feel. and i have an appointment with my case worker tomorrow and my ED and i are fighting each other whether or not to tell her. i dont want to go to hospital again, especially not even a week later but i cant bring myself to eat. but i wish you all the best lovely",
          "created_utc": 1704159070.0
        },
        {
          "id": "kfx4ogz",
          "author": "dark_humor_to_cope",
          "body": "Thank you :)\n\nI completely understand why you don’t want to tell her. Trust me, I get it. I also understand why you don’t want to go back to hospital right now. However, you want to live, and that can only happen if you’re honest with your case worker. \n\nNot that you need it, but have my full permission to tell her everything. I really hope you do. \n\nIf you’re comfortable with it, please keep us updated on this thread. Everyone here, even people whose responses weren’t very nice, wants you to be safe.",
          "created_utc": 1704161264.0
        },
        {
          "id": "kfx6osf",
          "author": "Adorable-Mine-5497",
          "body": "the tough part is that i do want to die tho, i know it probably sounds stupid but i want it to kill me, and i dont want the help or support, sounds dumb considering i got sad about my family stopping it. but if i do end up reaching out tomorrow, i will update you :)",
          "created_utc": 1704162076.0
        },
        {
          "id": "kfx9o7v",
          "author": "dark_humor_to_cope",
          "body": "None of that sounds stupid. EDs usually involve a lot of conflicting thoughts and desires.\n\nWhen she was a teenager, my best friend felt just like you do (we’re both 21 now in case you’re curious haha). She had no hope, and she had felt like that for a long time. Now she’s doing much better, and she’s glad that she didn’t let her ED win. And I still have my best friend.",
          "created_utc": 1704163278.0
        },
        {
          "id": "kge0k2b",
          "author": "Adorable-Mine-5497",
          "body": "hey as i promised i will update you, i just got out of hospital after getting rushed to resus, i am okay now and have eaten today x",
          "created_utc": 1704429252.0
        }
      ]
    },
    {
      "id": "kgedre1",
      "author": "Adorable-Mine-5497",
      "body": "i didnt choose to go, my doctor called an ambulance on me :( but im now (sort of) in a mindset that wants to get out of this cycle tho! and im not sure about how id go about that i dont see my case worker for a while",
      "created_utc": 1704436190.0,
      "score": 2,
      "context": [
        {
          "id": "kfwwzvc",
          "author": "dark_humor_to_cope",
          "body": "Some of these responses give off a pretty harsh tone, and that might not be the most helpful thing right now. I don’t know why your family isn’t asking you to eat (like other people said, there could be a variety of reasons), and I’m sorry that they aren’t asking you. I would feel the same way if I were you. \n\nI’m here to say that I’m rooting for you, and I want you to eat. Please be careful, though - you’re almost definitely at risk for refeeding syndrome. I am not a medical professional, but it would be a good idea to go to the emergency department and tell them what’s going on so they can keep you safe. While you’re there, you could also ask to talk to a social worker about the situation with your parents.\n\nSending care 💛",
          "created_utc": 1704158318.0
        },
        {
          "id": "kfwyxyx",
          "author": "Adorable-Mine-5497",
          "body": "yeah, getting harsh responses for feeling what i feel is a natural response is making me feel like an asshole and selfish for it, so i really appreciate you and people like you for having empathy and caring about how i feel rather than how focusing on how they feel. and i have an appointment with my case worker tomorrow and my ED and i are fighting each other whether or not to tell her. i dont want to go to hospital again, especially not even a week later but i cant bring myself to eat. but i wish you all the best lovely",
          "created_utc": 1704159070.0
        },
        {
          "id": "kfx4ogz",
          "author": "dark_humor_to_cope",
          "body": "Thank you :)\n\nI completely understand why you don’t want to tell her. Trust me, I get it. I also understand why you don’t want to go back to hospital right now. However, you want to live, and that can only happen if you’re honest with your case worker. \n\nNot that you need it, but have my full permission to tell her everything. I really hope you do. \n\nIf you’re comfortable with it, please keep us updated on this thread. Everyone here, even people whose responses weren’t very nice, wants you to be safe.",
          "created_utc": 1704161264.0
        },
        {
          "id": "kfx6osf",
          "author": "Adorable-Mine-5497",
          "body": "the tough part is that i do want to die tho, i know it probably sounds stupid but i want it to kill me, and i dont want the help or support, sounds dumb considering i got sad about my family stopping it. but if i do end up reaching out tomorrow, i will update you :)",
          "created_utc": 1704162076.0
        },
        {
          "id": "kfx9o7v",
          "author": "dark_humor_to_cope",
          "body": "None of that sounds stupid. EDs usually involve a lot of conflicting thoughts and desires.\n\nWhen she was a teenager, my best friend felt just like you do (we’re both 21 now in case you’re curious haha). She had no hope, and she had felt like that for a long time. Now she’s doing much better, and she’s glad that she didn’t let her ED win. And I still have my best friend.",
          "created_utc": 1704163278.0
        },
        {
          "id": "kge0k2b",
          "author": "Adorable-Mine-5497",
          "body": "hey as i promised i will update you, i just got out of hospital after getting rushed to resus, i am okay now and have eaten today x",
          "created_utc": 1704429252.0
        },
        {
          "id": "kge82lp",
          "author": "dark_humor_to_cope",
          "body": "Hi! Thank you for the update :) I’m glad you got some help. Do you have a plan for continuing care, like inpatient or outpatient therapy/dietitian appointments?",
          "created_utc": 1704432972.0
        }
      ]
    },
    {
      "id": "kgei6y0",
      "author": "dark_humor_to_cope",
      "body": "I’ve had similar experiences with my doctor and it wasn’t fun but I’m really happy for you that your mindset is shifting! \n\nHmm maybe you could talk to your doctor about options so you don’t have to wait until you meet with your case worker? This would be the best way to get out of this cycle.",
      "created_utc": 1704439008.0,
      "score": 1,
      "context": [
        {
          "id": "kfwwzvc",
          "author": "dark_humor_to_cope",
          "body": "Some of these responses give off a pretty harsh tone, and that might not be the most helpful thing right now. I don’t know why your family isn’t asking you to eat (like other people said, there could be a variety of reasons), and I’m sorry that they aren’t asking you. I would feel the same way if I were you. \n\nI’m here to say that I’m rooting for you, and I want you to eat. Please be careful, though - you’re almost definitely at risk for refeeding syndrome. I am not a medical professional, but it would be a good idea to go to the emergency department and tell them what’s going on so they can keep you safe. While you’re there, you could also ask to talk to a social worker about the situation with your parents.\n\nSending care 💛",
          "created_utc": 1704158318.0
        },
        {
          "id": "kfwyxyx",
          "author": "Adorable-Mine-5497",
          "body": "yeah, getting harsh responses for feeling what i feel is a natural response is making me feel like an asshole and selfish for it, so i really appreciate you and people like you for having empathy and caring about how i feel rather than how focusing on how they feel. and i have an appointment with my case worker tomorrow and my ED and i are fighting each other whether or not to tell her. i dont want to go to hospital again, especially not even a week later but i cant bring myself to eat. but i wish you all the best lovely",
          "created_utc": 1704159070.0
        },
        {
          "id": "kfx4ogz",
          "author": "dark_humor_to_cope",
          "body": "Thank you :)\n\nI completely understand why you don’t want to tell her. Trust me, I get it. I also understand why you don’t want to go back to hospital right now. However, you want to live, and that can only happen if you’re honest with your case worker. \n\nNot that you need it, but have my full permission to tell her everything. I really hope you do. \n\nIf you’re comfortable with it, please keep us updated on this thread. Everyone here, even people whose responses weren’t very nice, wants you to be safe.",
          "created_utc": 1704161264.0
        },
        {
          "id": "kfx6osf",
          "author": "Adorable-Mine-5497",
          "body": "the tough part is that i do want to die tho, i know it probably sounds stupid but i want it to kill me, and i dont want the help or support, sounds dumb considering i got sad about my family stopping it. but if i do end up reaching out tomorrow, i will update you :)",
          "created_utc": 1704162076.0
        },
        {
          "id": "kfx9o7v",
          "author": "dark_humor_to_cope",
          "body": "None of that sounds stupid. EDs usually involve a lot of conflicting thoughts and desires.\n\nWhen she was a teenager, my best friend felt just like you do (we’re both 21 now in case you’re curious haha). She had no hope, and she had felt like that for a long time. Now she’s doing much better, and she’s glad that she didn’t let her ED win. And I still have my best friend.",
          "created_utc": 1704163278.0
        },
        {
          "id": "kge0k2b",
          "author": "Adorable-Mine-5497",
          "body": "hey as i promised i will update you, i just got out of hospital after getting rushed to resus, i am okay now and have eaten today x",
          "created_utc": 1704429252.0
        },
        {
          "id": "kge82lp",
          "author": "dark_humor_to_cope",
          "body": "Hi! Thank you for the update :) I’m glad you got some help. Do you have a plan for continuing care, like inpatient or outpatient therapy/dietitian appointments?",
          "created_utc": 1704432972.0
        },
        {
          "id": "kgedre1",
          "author": "Adorable-Mine-5497",
          "body": "i didnt choose to go, my doctor called an ambulance on me :( but im now (sort of) in a mindset that wants to get out of this cycle tho! and im not sure about how id go about that i dont see my case worker for a while",
          "created_utc": 1704436190.0
        }
      ]
    },
    {
      "id": "kgfpau2",
      "author": "Adorable-Mine-5497",
      "body": "i might have to do this as my dads not letting me see my case worker till im better. thank you so much!",
      "created_utc": 1704465029.0,
      "score": 2,
      "context": [
        {
          "id": "kfwwzvc",
          "author": "dark_humor_to_cope",
          "body": "Some of these responses give off a pretty harsh tone, and that might not be the most helpful thing right now. I don’t know why your family isn’t asking you to eat (like other people said, there could be a variety of reasons), and I’m sorry that they aren’t asking you. I would feel the same way if I were you. \n\nI’m here to say that I’m rooting for you, and I want you to eat. Please be careful, though - you’re almost definitely at risk for refeeding syndrome. I am not a medical professional, but it would be a good idea to go to the emergency department and tell them what’s going on so they can keep you safe. While you’re there, you could also ask to talk to a social worker about the situation with your parents.\n\nSending care 💛",
          "created_utc": 1704158318.0
        },
        {
          "id": "kfwyxyx",
          "author": "Adorable-Mine-5497",
          "body": "yeah, getting harsh responses for feeling what i feel is a natural response is making me feel like an asshole and selfish for it, so i really appreciate you and people like you for having empathy and caring about how i feel rather than how focusing on how they feel. and i have an appointment with my case worker tomorrow and my ED and i are fighting each other whether or not to tell her. i dont want to go to hospital again, especially not even a week later but i cant bring myself to eat. but i wish you all the best lovely",
          "created_utc": 1704159070.0
        },
        {
          "id": "kfx4ogz",
          "author": "dark_humor_to_cope",
          "body": "Thank you :)\n\nI completely understand why you don’t want to tell her. Trust me, I get it. I also understand why you don’t want to go back to hospital right now. However, you want to live, and that can only happen if you’re honest with your case worker. \n\nNot that you need it, but have my full permission to tell her everything. I really hope you do. \n\nIf you’re comfortable with it, please keep us updated on this thread. Everyone here, even people whose responses weren’t very nice, wants you to be safe.",
          "created_utc": 1704161264.0
        },
        {
          "id": "kfx6osf",
          "author": "Adorable-Mine-5497",
          "body": "the tough part is that i do want to die tho, i know it probably sounds stupid but i want it to kill me, and i dont want the help or support, sounds dumb considering i got sad about my family stopping it. but if i do end up reaching out tomorrow, i will update you :)",
          "created_utc": 1704162076.0
        },
        {
          "id": "kfx9o7v",
          "author": "dark_humor_to_cope",
          "body": "None of that sounds stupid. EDs usually involve a lot of conflicting thoughts and desires.\n\nWhen she was a teenager, my best friend felt just like you do (we’re both 21 now in case you’re curious haha). She had no hope, and she had felt like that for a long time. Now she’s doing much better, and she’s glad that she didn’t let her ED win. And I still have my best friend.",
          "created_utc": 1704163278.0
        },
        {
          "id": "kge0k2b",
          "author": "Adorable-Mine-5497",
          "body": "hey as i promised i will update you, i just got out of hospital after getting rushed to resus, i am okay now and have eaten today x",
          "created_utc": 1704429252.0
        },
        {
          "id": "kge82lp",
          "author": "dark_humor_to_cope",
          "body": "Hi! Thank you for the update :) I’m glad you got some help. Do you have a plan for continuing care, like inpatient or outpatient therapy/dietitian appointments?",
          "created_utc": 1704432972.0
        },
        {
          "id": "kgedre1",
          "author": "Adorable-Mine-5497",
          "body": "i didnt choose to go, my doctor called an ambulance on me :( but im now (sort of) in a mindset that wants to get out of this cycle tho! and im not sure about how id go about that i dont see my case worker for a while",
          "created_utc": 1704436190.0
        },
        {
          "id": "kgei6y0",
          "author": "dark_humor_to_cope",
          "body": "I’ve had similar experiences with my doctor and it wasn’t fun but I’m really happy for you that your mindset is shifting! \n\nHmm maybe you could talk to your doctor about options so you don’t have to wait until you meet with your case worker? This would be the best way to get out of this cycle.",
          "created_utc": 1704439008.0
        }
      ]
    },
    {
      "id": "kgfs8bg",
      "author": "dark_humor_to_cope",
      "body": "You’re welcome!",
      "created_utc": 1704466196.0,
      "score": 1,
      "context": [
        {
          "id": "kfwwzvc",
          "author": "dark_humor_to_cope",
          "body": "Some of these responses give off a pretty harsh tone, and that might not be the most helpful thing right now. I don’t know why your family isn’t asking you to eat (like other people said, there could be a variety of reasons), and I’m sorry that they aren’t asking you. I would feel the same way if I were you. \n\nI’m here to say that I’m rooting for you, and I want you to eat. Please be careful, though - you’re almost definitely at risk for refeeding syndrome. I am not a medical professional, but it would be a good idea to go to the emergency department and tell them what’s going on so they can keep you safe. While you’re there, you could also ask to talk to a social worker about the situation with your parents.\n\nSending care 💛",
          "created_utc": 1704158318.0
        },
        {
          "id": "kfwyxyx",
          "author": "Adorable-Mine-5497",
          "body": "yeah, getting harsh responses for feeling what i feel is a natural response is making me feel like an asshole and selfish for it, so i really appreciate you and people like you for having empathy and caring about how i feel rather than how focusing on how they feel. and i have an appointment with my case worker tomorrow and my ED and i are fighting each other whether or not to tell her. i dont want to go to hospital again, especially not even a week later but i cant bring myself to eat. but i wish you all the best lovely",
          "created_utc": 1704159070.0
        },
        {
          "id": "kfx4ogz",
          "author": "dark_humor_to_cope",
          "body": "Thank you :)\n\nI completely understand why you don’t want to tell her. Trust me, I get it. I also understand why you don’t want to go back to hospital right now. However, you want to live, and that can only happen if you’re honest with your case worker. \n\nNot that you need it, but have my full permission to tell her everything. I really hope you do. \n\nIf you’re comfortable with it, please keep us updated on this thread. Everyone here, even people whose responses weren’t very nice, wants you to be safe.",
          "created_utc": 1704161264.0
        },
        {
          "id": "kfx6osf",
          "author": "Adorable-Mine-5497",
          "body": "the tough part is that i do want to die tho, i know it probably sounds stupid but i want it to kill me, and i dont want the help or support, sounds dumb considering i got sad about my family stopping it. but if i do end up reaching out tomorrow, i will update you :)",
          "created_utc": 1704162076.0
        },
        {
          "id": "kfx9o7v",
          "author": "dark_humor_to_cope",
          "body": "None of that sounds stupid. EDs usually involve a lot of conflicting thoughts and desires.\n\nWhen she was a teenager, my best friend felt just like you do (we’re both 21 now in case you’re curious haha). She had no hope, and she had felt like that for a long time. Now she’s doing much better, and she’s glad that she didn’t let her ED win. And I still have my best friend.",
          "created_utc": 1704163278.0
        },
        {
          "id": "kge0k2b",
          "author": "Adorable-Mine-5497",
          "body": "hey as i promised i will update you, i just got out of hospital after getting rushed to resus, i am okay now and have eaten today x",
          "created_utc": 1704429252.0
        },
        {
          "id": "kge82lp",
          "author": "dark_humor_to_cope",
          "body": "Hi! Thank you for the update :) I’m glad you got some help. Do you have a plan for continuing care, like inpatient or outpatient therapy/dietitian appointments?",
          "created_utc": 1704432972.0
        },
        {
          "id": "kgedre1",
          "author": "Adorable-Mine-5497",
          "body": "i didnt choose to go, my doctor called an ambulance on me :( but im now (sort of) in a mindset that wants to get out of this cycle tho! and im not sure about how id go about that i dont see my case worker for a while",
          "created_utc": 1704436190.0
        },
        {
          "id": "kgei6y0",
          "author": "dark_humor_to_cope",
          "body": "I’ve had similar experiences with my doctor and it wasn’t fun but I’m really happy for you that your mindset is shifting! \n\nHmm maybe you could talk to your doctor about options so you don’t have to wait until you meet with your case worker? This would be the best way to get out of this cycle.",
          "created_utc": 1704439008.0
        },
        {
          "id": "kgfpau2",
          "author": "Adorable-Mine-5497",
          "body": "i might have to do this as my dads not letting me see my case worker till im better. thank you so much!",
          "created_utc": 1704465029.0
        }
      ]
    }
  ]
}