{
  "id": "19dmf2y",
  "subreddit": "AnorexiaNervosa",
  "author": "sarcastic_bartender",
  "created_utc": 1706009632.0,
  "title": "I’m worried that a girl in my apartment building will die soon",
  "selftext": "So I’ve (25F) lived in my building for a few years and have seen this girl (25-30F) around for the last couple of years. She’s generally very shy (it comes across as unfriendly) and only really interacted with me when I had my little dog with me. I started to make more of an effort to catch her eye and smile when I’ve seen her in the elevator - I’m almost certain she lives alone and I think she is foreign (we’re in Australia). Possibly her mum visited her once about a year ago. \n\nBased off the times I have seen her around (and this is over two or so years) she doesn’t have a 9-5 or any sort of regular job with colleagues. I have other theories about that but it’s irrelevant to this. I’ve only seen her with her own little dog but actually haven’t seen the dog for the past few months. \n\nThis girl is rail thin. She’s quite tall and striking looking but my housemate and I have noticed her steady decline in weight over the last year, particularly the last six months to the point where it is clear she is suffering from severe anorexia. She has the look - IYKYK. I went away over Christmas for a month and saw her today for the first time in five weeks - I literally stifled a gasp at her emaciated frame. Her skull was protruding from under her skin as was her small and round stomach. Merely walking through the carpark was clearly an effort and looked painful - she was walking very slowly. She is nearly at end-stage anorexia. \n\nI told my housemate and she explained that she’d seen her in our apartment gym on Monday at 11.30am, walking on the treadmill. My housemate returned to the gym at 5.30 and the girl was still. walking. Housemate walked behind her to check and she had been walking for nearly six hours. \nHousemate very rarely uses our gym. I wonder how often she does this. \n\nI’m really worried about this girl. I’m worried she will just die in her apartment one day, that she won’t wake up or something. I don’t think she has a job where colleagues might become concerned about her mental and physical health. She has stopped smiling back at me the last few months and seems completely oblivious to her surroundings. Housemate said she was the same in the gym - people were staring and she was completely unaware. \n\nHas anyone experienced trying to help someone that they don’t know? I don’t feel as though attempting to befriend her right now will be helpful and in my experience with eating disorders, trying to talk to her will be about as helpful as walking a fish. She needs professional help and I don’t think she is getting any. If she was, she’d be an inpatient. \n\nDoes anyone have a suggestion as to how I can help her? Is there some kind of welfare-check I can contact or call for advice?\nI don’t know what floor she lives on or even her name. I am in Queensland, Australia.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/19dmf2y/im_worried_that_a_girl_in_my_apartment_building/",
  "score": 125,
  "num_comments": 26,
  "comments": [
    {
      "id": "kj6jg1y",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1706009632.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kj6muh4",
      "author": "BitterRequirement897",
      "body": "This is so haunting:( maybe call the butterfly foundation and ask them their advice? They are super helpful.\n\nGod this is just so sad and horrible my heart absolutely breaks.",
      "created_utc": 1706011710.0,
      "score": 103,
      "context": []
    },
    {
      "id": "kj6r6rs",
      "author": "None",
      "body": "Hey fellow Aussie. I think you could also call the non-urgent Police Assistance line. You wouldn't have to reveal any location details if you didn't want to, but they might also be able to direct you. This is a health crisis, and sounds like it may well be an emergency, they may be able to organise a welfare check. \n\nAs an Aussie who lives overseas, it would be unbelievably easy to hide an illness when you're not around family/your closest friends who would show up at your door if you stopped replying. Best of luck, and good on ya for caring so much",
      "created_utc": 1706014073.0,
      "score": 68,
      "context": []
    },
    {
      "id": "kj9u8vm",
      "author": "attimhsa",
      "body": "OP: Thank you for caring. Please provide an update if possible. It’s not morbid curiosity; my heart breaks for her.",
      "created_utc": 1706053489.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kjfneyb",
      "author": "sarcastic_bartender",
      "body": "Thank you for your suggestions and supportive comments. It made me feel far less worried about being intrusive or weird. \n\nI called the Butterfly Foundation and although someone wasn’t available immediately, they called me back after a couple of hours. It was very helpful. We discussed sectioning and welfare checks etc but he said that the best thing to do right now is to try and talk with her, and use ‘I’ statements only. Eg: ‘I am worried about you’ and ‘I can see that you aren’t well at the moment. I want to offer you some support - shall we have a coffee/walk?’. I’ll try first to just offer friendship by saying how I’ve seen her around and if she wants to hang out. If she’s not receptive to that then I will try the more direct statements I mentioned.\n\nBy using ‘I’ statements there is less chance that she can easily refute them. If you said ‘you don’t look well’ or ‘are you okay?’ someone could just say they’re fine - it’s a lot harder for someone to refute your personal opinion (if that makes sense!).\n\nI also did some major internet FBI and I now know her name etc. and a little more about her (a good reminder to clean your socials haha - it’s honestly unsettling as to what you can find out about stranger on the internet). Without going into too much detail I can kinda understand how this happened based on her job and it does look like she has cut off a lot of support. \n\nMy housemate, my partner and I are going to spend a bit more time in our apartment gym and pop down to our street during the times where we’ve seen her in the past. If we don’t see her in the next week I will reach out to her on social media. I’d really prefer to approach her in person but a message is better than nothing. :)\n\nI will write another update when one of us makes contact with her. Thanks everyone x",
      "created_utc": 1706144464.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kj79izd",
      "author": "pathologicalprotest",
      "body": "Ouch:(\n\nI don’t know the laws in Australia, so I don’t know anywhere to direct you. But if she is indeed in a mental- and physical health crisis, in many places there are systems put in place to prevent ill people from dying. If a neighbour was having a psychotic break, I wouldn’t hesitate to call an ambulance, you know?\n\nI agree that deterioration is very «easy» if you have no social support system or people who observe you closely. It’s sad, but true. When I moved overseas, I rapidly became worse because nobody knew me and my close ones couldn’t see me. The pharmacy lady where I bought nutridrinks took me by the arm one day and walked me over to the entrance, pointed at a pizzeria across the street and said «they have really good slices». I still think about that lady.\n\nWhatever you decide on doing, it’s touching to see yours and your roomie’s care and concern for this lady. I hope she pulls through and that you aren’t negatively affected by this sad story.",
      "created_utc": 1706021944.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kj828fk",
      "author": "bluebelle08",
      "body": "Just commenting to say you’re a really nice person for caring 💙 and the “walking a fish” metaphor is so true.",
      "created_utc": 1706031913.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kj9n1f8",
      "author": "maisygoatsivy",
      "body": "The next time you see her, invite her out for a coffee just to get to know her. The more social contacts you can provide, the better. When you talk to her, gently probe it, But ultimately if she's at this point, she knows what she's doing and she's purposefully doing so. It's probably not much you can do other than share your own struggles if it comes up and hope that she will get help.",
      "created_utc": 1706050754.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kja01qz",
      "author": "Turbulent-Ability271",
      "body": "Hey, Aussie here.\n\nThis is a tough situation. Some options:\n\nContact the police non emergency line and ask for a wellness check.\n\nContact the butterfly foundation to ask their opinion on what steps to take.\n\nNSW has the Mental Health access line. You can call to discuss people you have concerns for. I do not know whether they accept assessments from neighbours but it's worth a try. If you are in another state, look up on Google to see if they have a MH Triage Line.\n\nThis sounds urgent so I would suggest a wellness check or butterfly foundation for advice.\n\nThank you for caring about this person. She is suffering immensely",
      "created_utc": 1706055701.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kj928pw",
      "author": "BlueEyedGenius1",
      "body": "Perhaps call or drop a message or chat to the safeguarding team at your council or call the police and do welfare check on her.",
      "created_utc": 1706043736.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kjbyrbs",
      "author": "sbrown_13",
      "body": "It’s a difficult situation…\n\nBut honestly out of experience, I think you should just try and talk to her first - before you do anything. \nThe last thing a person with anorexia would want is to feel that they have been stripped from their control.\n\nShe is probably scared and doesn’t realise how “bad” she is.",
      "created_utc": 1706092186.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kja0wq2",
      "author": "_shadesofcool_",
      "body": "You can always call the non emergency police line for a wellness check if you are worried about her. If you don’t see her for a while, then it’s probably in her best interest you call.",
      "created_utc": 1706056029.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kjagck5",
      "author": "c1nnam0on",
      "body": "Keep us updated! I hope she ends up being okay",
      "created_utc": 1706061948.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kjbfcpo",
      "author": "runninginbubbles",
      "body": "Shit, that's awfully sad. I have no idea what to do. It's a hard one, because I'd imagine the last thing she wants is to have someone intervene. \n\nBy the sounds of it you live in an apartment / hotel? Do the owners of the hotel have anything to do with you? Could you talk to them?\n\nI had a similar issue with a friend of mine, I didn't know where he lived, but I knew it was in a motel in another city. I managed to narrow down a couple, and just phoned them asking them to do a welfare check on \"the young man who lives there\" .. they found him dead.",
      "created_utc": 1706078257.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kjboirf",
      "author": "Fold-Low",
      "body": "This may be controversial and ideally, there would be better ways (eg welfare check or getting to know her) but you could call an ambulance, and she could be sectioned as a last resort. \n\nI study paramedicine and in her state, she would likely be put under an ambulance section which would, at the very least get her to the hospital and assessed. However, an ambulance section is quite complicated in the fact that it only is really for that transportation duration. This  has no guarantee that she will be held at the hospital nor if the hospital itself will have the facilities to care for her. Theoretically, once handover is done and the hospital has done their assessment, she could very well self discharge if they deem her competent. However, given her physical state, she is at high risk of deterioration due to her illness, which strengthens the right to section greatly.\n\nThere's also the other issue of ethics and it would mean that she would likely be involuntarily and that can involve things like mechanical restraint. It strips her of total autonomy and while a needed process - it's a violating one nonetheless. \n\nUltimately the choice is up to you. Personally as someone with anorexia, i would loathe being sectioned however, clinically it is warranted as there's no culpable way she is in her right mind. \n\nIf you need access to clinical guidelines about mental health sectioning i can provide them so you can see what will ideally happen from the ambulance perspective.",
      "created_utc": 1706084463.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mmh3cbt",
      "author": "attimhsa",
      "body": "Any updates OP?",
      "created_utc": 1744326895.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kocgwma",
      "author": "attimhsa",
      "body": "OP is there another update? 💜",
      "created_utc": 1706738635.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kjfnlld",
      "author": "sarcastic_bartender",
      "body": "Thank you for that suggestion. I called them yesterday - I’ve written an update just now",
      "created_utc": 1706144534.0,
      "score": 5,
      "context": [
        {
          "id": "kj6muh4",
          "author": "BitterRequirement897",
          "body": "This is so haunting:( maybe call the butterfly foundation and ask them their advice? They are super helpful.\n\nGod this is just so sad and horrible my heart absolutely breaks.",
          "created_utc": 1706011710.0
        }
      ]
    },
    {
      "id": "kjfnuyz",
      "author": "sarcastic_bartender",
      "body": "I’ve written an update just now on where I’m at so far. I haven’t seen her yet but I will speak to her when I do with the advice I got from Butterfly Foundation!",
      "created_utc": 1706144633.0,
      "score": 3,
      "context": [
        {
          "id": "kj9u8vm",
          "author": "attimhsa",
          "body": "OP: Thank you for caring. Please provide an update if possible. It’s not morbid curiosity; my heart breaks for her.",
          "created_utc": 1706053489.0
        }
      ]
    },
    {
      "id": "kjftjty",
      "author": "attimhsa",
      "body": "You’re a good soul",
      "created_utc": 1706146779.0,
      "score": 4,
      "context": [
        {
          "id": "kjfneyb",
          "author": "sarcastic_bartender",
          "body": "Thank you for your suggestions and supportive comments. It made me feel far less worried about being intrusive or weird. \n\nI called the Butterfly Foundation and although someone wasn’t available immediately, they called me back after a couple of hours. It was very helpful. We discussed sectioning and welfare checks etc but he said that the best thing to do right now is to try and talk with her, and use ‘I’ statements only. Eg: ‘I am worried about you’ and ‘I can see that you aren’t well at the moment. I want to offer you some support - shall we have a coffee/walk?’. I’ll try first to just offer friendship by saying how I’ve seen her around and if she wants to hang out. If she’s not receptive to that then I will try the more direct statements I mentioned.\n\nBy using ‘I’ statements there is less chance that she can easily refute them. If you said ‘you don’t look well’ or ‘are you okay?’ someone could just say they’re fine - it’s a lot harder for someone to refute your personal opinion (if that makes sense!).\n\nI also did some major internet FBI and I now know her name etc. and a little more about her (a good reminder to clean your socials haha - it’s honestly unsettling as to what you can find out about stranger on the internet). Without going into too much detail I can kinda understand how this happened based on her job and it does look like she has cut off a lot of support. \n\nMy housemate, my partner and I are going to spend a bit more time in our apartment gym and pop down to our street during the times where we’ve seen her in the past. If we don’t see her in the next week I will reach out to her on social media. I’d really prefer to approach her in person but a message is better than nothing. :)\n\nI will write another update when one of us makes contact with her. Thanks everyone x",
          "created_utc": 1706144464.0
        }
      ]
    },
    {
      "id": "kjggjk8",
      "author": "Turbulent-Ability271",
      "body": "So glad she has someone like you looking out for her x",
      "created_utc": 1706155809.0,
      "score": 3,
      "context": [
        {
          "id": "kjfneyb",
          "author": "sarcastic_bartender",
          "body": "Thank you for your suggestions and supportive comments. It made me feel far less worried about being intrusive or weird. \n\nI called the Butterfly Foundation and although someone wasn’t available immediately, they called me back after a couple of hours. It was very helpful. We discussed sectioning and welfare checks etc but he said that the best thing to do right now is to try and talk with her, and use ‘I’ statements only. Eg: ‘I am worried about you’ and ‘I can see that you aren’t well at the moment. I want to offer you some support - shall we have a coffee/walk?’. I’ll try first to just offer friendship by saying how I’ve seen her around and if she wants to hang out. If she’s not receptive to that then I will try the more direct statements I mentioned.\n\nBy using ‘I’ statements there is less chance that she can easily refute them. If you said ‘you don’t look well’ or ‘are you okay?’ someone could just say they’re fine - it’s a lot harder for someone to refute your personal opinion (if that makes sense!).\n\nI also did some major internet FBI and I now know her name etc. and a little more about her (a good reminder to clean your socials haha - it’s honestly unsettling as to what you can find out about stranger on the internet). Without going into too much detail I can kinda understand how this happened based on her job and it does look like she has cut off a lot of support. \n\nMy housemate, my partner and I are going to spend a bit more time in our apartment gym and pop down to our street during the times where we’ve seen her in the past. If we don’t see her in the next week I will reach out to her on social media. I’d really prefer to approach her in person but a message is better than nothing. :)\n\nI will write another update when one of us makes contact with her. Thanks everyone x",
          "created_utc": 1706144464.0
        }
      ]
    },
    {
      "id": "kjfo545",
      "author": "sarcastic_bartender",
      "body": "The guy on the phone also suggested inviting her out to try and initiate a friendship, and to try bringing up my own experience or that of people close to me. I definitely will. Thank you for your advice xx",
      "created_utc": 1706144740.0,
      "score": 2,
      "context": [
        {
          "id": "kj9n1f8",
          "author": "maisygoatsivy",
          "body": "The next time you see her, invite her out for a coffee just to get to know her. The more social contacts you can provide, the better. When you talk to her, gently probe it, But ultimately if she's at this point, she knows what she's doing and she's purposefully doing so. It's probably not much you can do other than share your own struggles if it comes up and hope that she will get help.",
          "created_utc": 1706050754.0
        }
      ]
    },
    {
      "id": "kjfa6dv",
      "author": "zillabirdblue",
      "body": "Don't call an ambulance. I have had anorexia for over 20 years and I can say being sent to the hospital like that made it worse. It traumatized me so much I pulled away even more. You need a more gentle approach.",
      "created_utc": 1706139509.0,
      "score": 3,
      "context": [
        {
          "id": "kjboirf",
          "author": "Fold-Low",
          "body": "This may be controversial and ideally, there would be better ways (eg welfare check or getting to know her) but you could call an ambulance, and she could be sectioned as a last resort. \n\nI study paramedicine and in her state, she would likely be put under an ambulance section which would, at the very least get her to the hospital and assessed. However, an ambulance section is quite complicated in the fact that it only is really for that transportation duration. This  has no guarantee that she will be held at the hospital nor if the hospital itself will have the facilities to care for her. Theoretically, once handover is done and the hospital has done their assessment, she could very well self discharge if they deem her competent. However, given her physical state, she is at high risk of deterioration due to her illness, which strengthens the right to section greatly.\n\nThere's also the other issue of ethics and it would mean that she would likely be involuntarily and that can involve things like mechanical restraint. It strips her of total autonomy and while a needed process - it's a violating one nonetheless. \n\nUltimately the choice is up to you. Personally as someone with anorexia, i would loathe being sectioned however, clinically it is warranted as there's no culpable way she is in her right mind. \n\nIf you need access to clinical guidelines about mental health sectioning i can provide them so you can see what will ideally happen from the ambulance perspective.",
          "created_utc": 1706084463.0
        }
      ]
    },
    {
      "id": "koev1kr",
      "author": "sarcastic_bartender",
      "body": "Hey, here’s where I’m at:\nI’ve seen her in our gym and in the elevator since I posted. I’ve chatted to her about her hair style and asked about a misplaced weight in the gym and she was really friendly both times. The next time I run into her I’ll ask if she wants to take our dogs out together. \n\nAlternatively, she mentioned she needed a haircut - my housemate is a hairdresser at a very bougie/\n & popular salon sooo I will ask if she wants to get a sneaky free trim from her! \n\nI am really hoping to run into her while she is walking her dog (the dog is still around!) or in the lobby as I don’t feel like the gym is a safe space for her and she seems very uncomfortable there. I say this based on experience but also because when a few more people came in, she immediately left. :(",
      "created_utc": 1706778587.0,
      "score": 2,
      "context": [
        {
          "id": "kocgwma",
          "author": "attimhsa",
          "body": "OP is there another update? 💜",
          "created_utc": 1706738635.0
        }
      ]
    },
    {
      "id": "lfpisr8",
      "author": "InflationSquare2407",
      "body": "This is so kind. Do you have any other updates?",
      "created_utc": 1722372031.0,
      "score": 1,
      "context": [
        {
          "id": "kocgwma",
          "author": "attimhsa",
          "body": "OP is there another update? 💜",
          "created_utc": 1706738635.0
        },
        {
          "id": "koev1kr",
          "author": "sarcastic_bartender",
          "body": "Hey, here’s where I’m at:\nI’ve seen her in our gym and in the elevator since I posted. I’ve chatted to her about her hair style and asked about a misplaced weight in the gym and she was really friendly both times. The next time I run into her I’ll ask if she wants to take our dogs out together. \n\nAlternatively, she mentioned she needed a haircut - my housemate is a hairdresser at a very bougie/\n & popular salon sooo I will ask if she wants to get a sneaky free trim from her! \n\nI am really hoping to run into her while she is walking her dog (the dog is still around!) or in the lobby as I don’t feel like the gym is a safe space for her and she seems very uncomfortable there. I say this based on experience but also because when a few more people came in, she immediately left. :(",
          "created_utc": 1706778587.0
        }
      ]
    },
    {
      "id": "kofyyod",
      "author": "attimhsa",
      "body": "Thanks for the update and thanks again for caring 🥺🥹",
      "created_utc": 1706800317.0,
      "score": 1,
      "context": [
        {
          "id": "kocgwma",
          "author": "attimhsa",
          "body": "OP is there another update? 💜",
          "created_utc": 1706738635.0
        },
        {
          "id": "koev1kr",
          "author": "sarcastic_bartender",
          "body": "Hey, here’s where I’m at:\nI’ve seen her in our gym and in the elevator since I posted. I’ve chatted to her about her hair style and asked about a misplaced weight in the gym and she was really friendly both times. The next time I run into her I’ll ask if she wants to take our dogs out together. \n\nAlternatively, she mentioned she needed a haircut - my housemate is a hairdresser at a very bougie/\n & popular salon sooo I will ask if she wants to get a sneaky free trim from her! \n\nI am really hoping to run into her while she is walking her dog (the dog is still around!) or in the lobby as I don’t feel like the gym is a safe space for her and she seems very uncomfortable there. I say this based on experience but also because when a few more people came in, she immediately left. :(",
          "created_utc": 1706778587.0
        }
      ]
    }
  ]
}