{
  "id": "1aodfze",
  "subreddit": "AnorexiaNervosa",
  "author": "Artistic-External184",
  "created_utc": 1707672800.0,
  "title": "Anorexic male, 30+. Am I alone?",
  "selftext": "Tell me I’m not the only one.  \n I’m a grown man, I’m 30+, and I’ve had anorexia on and off for 15 years. I keep coming back to this disorder.   \n I feel so lost, I’m currently in another relapse.   \n I don’t know what to do anymore, sometimes I wonder if it’s not for the best that I let this disorder end me, I had hoped life would be more than this.   \n \n\nAm I really such an unusual case? Is there anyone else out here that’s either older, male, longtime sufferer, or all of the above? \n\nCan someone like me ever recover fully?   \n I feel tired and hopeless. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1aodfze/anorexic_male_30_am_i_alone/",
  "score": 111,
  "num_comments": 62,
  "comments": [
    {
      "id": "kpyhimr",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1707672800.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kpylvjl",
      "author": "Bbf928",
      "body": "32m, all of the above. You are not alone. \n\nThere is a part of me that believes full recovery is possible. Some days I can resonate with that more than others. \n\nI can’t offer much in the way of advice, but I can say I understand and I hear you.",
      "created_utc": 1707674221.0,
      "score": 57,
      "context": []
    },
    {
      "id": "kpz1084",
      "author": "mkraft418",
      "body": "I’m a 33-year-old male. Been suffering with anorexia since I was 14. Been in and out of treatment a bunch. Recovery never lasts for more than 6 months to a year for me. I have no quality of life as when I relapse, I relapse hard to the edge of death. I get severely underweight to the point where I can barely function. I live at home with my parents because I can’t function on my own and I’m not healthy enough to hold a job. At this point I’ve lost any hope of a normal life. Part of me thinks my condition would have been taken more seriously at a younger age had a been a female, but being a male allowed me to slip through the cracks. My anorexia was viewed as a “phase” when I was younger.",
      "created_utc": 1707679169.0,
      "score": 48,
      "context": []
    },
    {
      "id": "kpzbtfo",
      "author": "justcallmedrzoidberg",
      "body": "36 years old female, you’re not alone. Been dealing with anorexia with purging/binging behaviors since I was 20. Currently in my worst state since it has all began. :(",
      "created_utc": 1707682768.0,
      "score": 18,
      "context": []
    },
    {
      "id": "kq01k69",
      "author": "chempiszl",
      "body": "42 Male ano on and off since high school. It's possible but very difficult! Keep trying. I'm currently in recovery for 6 months. 420 really helps too.",
      "created_utc": 1707691714.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kpz2xtn",
      "author": "NotAThrowAway28",
      "body": "Hey. I'm 31. Trans guy, but still male.\n\nI've had an ED since I was 9. It was BED until 16 and now it's been anorexia since. \n\nCurrently struggling through a relapse too. \n\nIt will take time. And a lot of effort. But we absolutely can recover. \n\nI wish you well, friend. You're not alone. Promise.",
      "created_utc": 1707679811.0,
      "score": 23,
      "context": []
    },
    {
      "id": "kq01ye1",
      "author": "Lonely-Personality98",
      "body": "I’m a 43 male sometime I feel like I’m smashing life but then go 20 steps back especially when I’m restricting heavily.\nIt’s like I’m a different person and can’t think straight or rationally \n\nHad mental health issues since  I was 18 tried lots of things,  but honest I’ve  only just found the correct support you just need to find the right doctors.\n\nSo basically joined  a Facebook group where everyone is in the same position and offers support and currently waiting for a buddy person who has been there before \n\nThere is help but the health services are a real hit and miss just need to be lucky I guess.\nBut  just share with other people who  can relate helps massively \ngood luck",
      "created_utc": 1707691865.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kpzo5g9",
      "author": "Mytintin",
      "body": "I'm only 20, but I feel the same way. It's like I'm being forced to stay for other people. I often wish it would finish me off honestly",
      "created_utc": 1707686904.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kq00s5c",
      "author": "MsKidgie",
      "body": "I have a friend in my SMART meeting on Saturdays that is an adult man with anorexia. Only one I know at the moment, but I have known others. Gentle hugs.",
      "created_utc": 1707691409.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kq0pitm",
      "author": "charmed1995",
      "body": "You are not alone. 28m here and I’ve been dealing with anorexia for over 7 years now. It’s very isolating.",
      "created_utc": 1707701283.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kq24uw8",
      "author": "maf_11",
      "body": "Hey. M27, been in my first (and hopefully last) recovery attempt since 3 months. \n\nIm struggling everyday to keep going. Your not alone. We got this.",
      "created_utc": 1707727162.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kq4t7g3",
      "author": "virtualhistories",
      "body": "hey—22M, and i’ve been dealing with anorexia for four or five years now\n\ni can’t seem to remember what life looked like before this, but i know what it looks like now, and it’s incredibly lonely—especially as a man, which people imagine precludes you from being susceptible to eating disorders altogether\n\nbut you’re not alone, and i hope there’s some comfort to be taken in that; rooting for you\n\nbe kind to yourself; take care of yourself; treat yourself well",
      "created_utc": 1707770257.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lbxckvd",
      "author": "Slowlyfallin",
      "body": "Howdy brother, no are not alone. Eating Disorders are complex and men are frequently underdiagnosed. Your condition and history is notably extreme, but the best thing you can do for yourself is to continue carrying on as you have been. For your reference, I am a 27 year old male.\n\nYou have been in and out of therapy presumably, but it's also important that you get to the root cause of your disorder. There is something somewhere in your life that is psychologically torturing you that you must come to terms with. Not only that, the physiological effects are having a tremendous toll on the longevity and quality of your life.\n\nI am currently on the edge of an eating disorder rn coming out, but I have never been on either side of the extreme spectrums. In fact, my problems were purely environmentally induced I think. Got put in a bad place mentally and I embodied that completely peering into my work and alcohol for comfort. I'd wake up, skip breakfast, morning session of work, workout instead of taking my one hour lunch, come back and worn until everyone had left, then come home to a tall glass of gin and sprite. I had no desire and an aversion to any food even though i would feel so great after forcing myself to eat anything. I would frequently pass out as if i were drunk when i went home almost as soon as i got back from work. This became my routine gradually over time across 3 years, and I am only recently bouncing back from the physiological effects it had on my body.\n\nUnfortunately, my body feels considerably weaker and I eat substantially slower than everyone around me... I first noticed this when a waiter at a restaurant came to me to ask me if I wanted the check or a to go box when I had mostly a full plate still.\n\nWhy do I say this? I want you to know that if my mild struggles had this much effect on my body, you sir will feel that substantially worse and it will be hard...\n\nMy recommendations:\n1) Get to the root of your demons and come to terms with them\n\n2) Start small because your body and mind won't be able to eat like you used to when you were a kid. If you are eating no meals or .5 meals a day on average, shoot for one solid meal with dense macronutrients. Potatoes, broccoli, rice, lean and well seasoned chicken, beans, beets, cod or tilapia, and spinach. Eat clean so your body gets the most out of it, you'll feel so much better.\n\n2A) Next, start incorporating small snacks throughout the day. Nuts, berries, high fat yogurts with fruit in it. Think about this: Bodybuilders don't binge eat to bulk, they eat clean and they eat a lot. Instead of three big meals, they eat 6-8 macro rich small meals. So take small victories.\n\n3) Lastly, don't beat yourself up. You will regress and it will be difficult, but you have to keep trying.\n\nYou are not alone in this, but only you can pull yourself up. Learn to love food again in a healthy way, and show yourself more love brother. It's not your fault whatever started it, but it is your responsibility to fix.\n\nGood Luck",
      "created_utc": 1720289402.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ly67fx6",
      "author": "Neverknowsbest72",
      "body": "I know this post is almost a year old but I’m gonna chime in anyway. I’m 30 about to be 31 male with anorexia. Have had for all my adult life. Just want to say you are not alone. And not unusual.",
      "created_utc": 1732148567.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kq2nsgv",
      "author": "None",
      "body": "Im 17 year old girl with anorexia and I had an uncle who had anorexia. He didn’t develop his ed till he had a stroke one day. He lost most of his mobility. He didn’t have one at first but my uncle is a big ego person so when he realized his body wasn’t going to be the same again, he stopped trying completely. He told me his eating disorder was the only thing that made him feel he had control over. As years went on it got worse, he became very skinny and his colon and kidneys started to fail because he wasn’t eating or drinking water, which eventually caused severe constipation. He also stopped walking permanently (his decision, he could still walk but he chose to use the wheelchair) Before he died he told me “It’s never worth the suffering, you’re stronger than me, do what I couldn’t do” I’m not here to tell you a successful story I’m just here to tell you that you’re not alone. But the first step to recovery is wanting to change. Wanting to change is a strong enough thing to keep you motivated, when you relapse don’t beat yourself up about it. Eat things that aren’t as fulfilling, like nuts, applesauce, popcorn. Drink Gatorade and water. Water keeps ur body slim because it eliminates puffiness from sodium intake. The reasoning for my  anorexia is way different than most people but if you want me to share that with you just let me know.",
      "created_utc": 1707740907.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7svdlf",
      "author": "Zealousideal-Wish178",
      "body": "I'm male in later 30s . Ive struggled on and off since age 16. Currently doing good after a bad 7 years. I have depression problems that go together with my anorexia.\nI tried the therapy and all the natural ways, I just could not put on any weight. I was 47kg ( 104lb ) , which was very low for my frame. I was so tired and depressed and had so many aches and pains all the time. I was lucky that I had alot of good support networks. \n\nI'm currently in recovery and have gained 18kg (40lb). I got tired of all the therapy and decided to go on medication to help. It was this or start being fed through a tube. I now take Prozac (ssri) and olanzapine (antipsychotic) and testosterone therapy. It has saved my life, it not only made me so hungry but it stopped all me fear around food. I now enjoy food and feel alot happier. I know some people don't like the idea of taking medication, but for me it was this or allow anorexia claim my life. I'm happy with my choice and I will likely never come off my medication, I think I would relapse if I did .",
      "created_utc": 1717932837.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mrjcmlm",
      "author": "OwnAccident586",
      "body": "Hi man… I’m in my 30’s too and keep struggling with the same shit. BTW, how have you been ?",
      "created_utc": 1746850369.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq2juvh",
      "author": "Economy_Comparison41",
      "body": "I’m 16 (they/them) who’s struggled with ana for about 3 years now. I live in western europe so it’s pretty heavy societal standards (getting more inclusive tho). Since I learned was ana was, I only ever saw girls and women with it, never men. I thought it was nearly impossible. Then, I think 2 years ago, I saw a video on youtube (in my first language) about a teen boy who had ana and that had opened my eyes a little further, but I still wasn’t really educated on men with EDs cause there’s just so little awareness for that. \n\nI saw this post and decided to open it. This has opened my eyes a lot further. It shows that men don’t suffer from ana any other way than women. I’ve seen multiple stories of adult women on here with the exact same symptoms, situations and views on life and recovery.\n\nI’m really happy you’re strong enough to post this here, cause now you see you’re not alone or weird! And you’ve really helped me learn more about ana in men today. Thank you so much for that, I really needed it. \n\nI really hope you find fresh hope, keep that close and get the help you need and deserve. You seem like a cool guy and you’re more than your ED and more than just a body. \n\nYou’re really not alone. ❤️",
      "created_utc": 1707738519.0,
      "score": 0,
      "context": []
    },
    {
      "id": "kq0v3a3",
      "author": "Slothwhatsloth",
      "body": "I’m not a man, but I have been inpatient with men. One of them I was in touch with for some time, I’m not sure how he’s doing now, hopefully well. You’re not alone, it certainly can feel that way though.",
      "created_utc": 1707703454.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq13jkc",
      "author": "-maru",
      "body": "Adding to the chorus of voices saying that you're not alone. When I was last in IP, there was another pt who was 52 yo male. My understanding is that he'd been struggling on and off since adolescence. Also, AN is a miserable illness, to be sure, but you are *not* a lost cause - nobody is.  If you are feeling particularly low now, know that those feelings will inevitably change (and abate) as time passes, just as those negative feelings have morphed into happier times before. There is good in the world and you will experience it again. <3",
      "created_utc": 1707706744.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq1e0qn",
      "author": "artificalorganlady",
      "body": "31F. I’ve had this for about 21 years. Pretty much my whole life. Nothing has ever been able to keep it away for very long and I feel like this probably will be the thing that kills me. I’m sorry you’re suffering. You’re certainly not alone.",
      "created_utc": 1707711096.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq1uvfb",
      "author": "GeckosSayGecko",
      "body": "I'm a 23 years old trans man I've been dealing since 14",
      "created_utc": 1707719919.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq20jaw",
      "author": "SourCandyBar",
      "body": "I am of the age group you are in and a male who has been dealing with this since I was 16. It’s a constant uphill battle that you feel like you will never win. I always thought too if I was alone in this but to know I am not is a little strange. I am currently on a leave of absence from work due to relapsing and over working my self.",
      "created_utc": 1707723850.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq2398h",
      "author": "Puzzleheaded_Ad550",
      "body": "I'm 35. I think recovery might be possible if you have a great support network. Unfortunately the world doesn't seem to care about eating disorders",
      "created_utc": 1707725907.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq2ebsm",
      "author": "sbrown_13",
      "body": "You’re not alone...And I’m so sorry that you’re struggling too…I hate knowing that someone is in the exact same position as me. All I do is just hope that one day it will get better, things will improve and my time to enjoy life will come.",
      "created_utc": 1707734600.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq2z6hg",
      "author": "Skythebluestars",
      "body": "28 non binary. Def not alone got diagnosed at 14. Struggling since i was 11 . Been in therapy for 14 years now. What helped me is knowing that ED, are coping mechanisms. After my diagnosis i got other  diagnosis. \n\nThe thing i def recommend is think by yourself where do i need my ed for. What am i scared of if i let it all go. Because theres something that you hold on for. \n\nLike we called in therapy the \" amazing solution \" because it feels that way. \n\nYou never alone in your journey. But i also believe and know you can fully recover. \n\nHold on",
      "created_utc": 1707746590.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq31xkp",
      "author": "BenjitheHerd",
      "body": "32M, \n\nI do believe you can recover. We're in this together!",
      "created_utc": 1707747790.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq3qrpg",
      "author": "Extension_Nerve_8233",
      "body": "I’m 34 and non-binary. I have struggled with this since around 14 yo but had a very long recovery. I had a coworker in his late 20s who was a man and anorexic. You’re not alone.",
      "created_utc": 1707757133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kqcvk8s",
      "author": "Throwaway_Z4L",
      "body": "I’m a 19 year old male. Been suffering with it for a couple years, not nearly as long as you have though. But I feel the same honestly, I don’t see any way out of this. I know it feels like it, but you are def not alone in this. Hope things get better for you soon",
      "created_utc": 1707896412.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kpyqo1n",
      "author": "Artistic-External184",
      "body": "Thank you for writing that, just knowing I’m not a unique, lost case feels very calming.",
      "created_utc": 1707675778.0,
      "score": 22,
      "context": [
        {
          "id": "kpylvjl",
          "author": "Bbf928",
          "body": "32m, all of the above. You are not alone. \n\nThere is a part of me that believes full recovery is possible. Some days I can resonate with that more than others. \n\nI can’t offer much in the way of advice, but I can say I understand and I hear you.",
          "created_utc": 1707674221.0
        }
      ]
    },
    {
      "id": "kpz2cl8",
      "author": "Artistic-External184",
      "body": "Thank you for sharing, your story sounds a lot like my own, I’ve never met another guy when I’ve been in for treatments which has lead me to feel alone in all this. ",
      "created_utc": 1707679614.0,
      "score": 18,
      "context": [
        {
          "id": "kpz1084",
          "author": "mkraft418",
          "body": "I’m a 33-year-old male. Been suffering with anorexia since I was 14. Been in and out of treatment a bunch. Recovery never lasts for more than 6 months to a year for me. I have no quality of life as when I relapse, I relapse hard to the edge of death. I get severely underweight to the point where I can barely function. I live at home with my parents because I can’t function on my own and I’m not healthy enough to hold a job. At this point I’ve lost any hope of a normal life. Part of me thinks my condition would have been taken more seriously at a younger age had a been a female, but being a male allowed me to slip through the cracks. My anorexia was viewed as a “phase” when I was younger.",
          "created_utc": 1707679169.0
        }
      ]
    },
    {
      "id": "kq27je2",
      "author": "Artistic-External184",
      "body": "I’m sorry the hear you are struggling too, but it calms me to think there are others my age that ”still” have issues, that I’m not alone. ",
      "created_utc": 1707729281.0,
      "score": 2,
      "context": [
        {
          "id": "kpzbtfo",
          "author": "justcallmedrzoidberg",
          "body": "36 years old female, you’re not alone. Been dealing with anorexia with purging/binging behaviors since I was 20. Currently in my worst state since it has all began. :(",
          "created_utc": 1707682768.0
        }
      ]
    },
    {
      "id": "kq27y78",
      "author": "Artistic-External184",
      "body": "Good to know recovery can be possible even for us! Good luck on your recovery journey, it gives me hope that I too can get there one day. ",
      "created_utc": 1707729606.0,
      "score": 4,
      "context": [
        {
          "id": "kq01k69",
          "author": "chempiszl",
          "body": "42 Male ano on and off since high school. It's possible but very difficult! Keep trying. I'm currently in recovery for 6 months. 420 really helps too.",
          "created_utc": 1707691714.0
        }
      ]
    },
    {
      "id": "kpz4q3l",
      "author": "Artistic-External184",
      "body": "I feel relieved that I got some replies here from other men in the same situation as me, struggling same as me. Thank you for replying.",
      "created_utc": 1707680401.0,
      "score": 13,
      "context": [
        {
          "id": "kpz2xtn",
          "author": "NotAThrowAway28",
          "body": "Hey. I'm 31. Trans guy, but still male.\n\nI've had an ED since I was 9. It was BED until 16 and now it's been anorexia since. \n\nCurrently struggling through a relapse too. \n\nIt will take time. And a lot of effort. But we absolutely can recover. \n\nI wish you well, friend. You're not alone. Promise.",
          "created_utc": 1707679811.0
        }
      ]
    },
    {
      "id": "kq28gbr",
      "author": "Artistic-External184",
      "body": "That’s how I feel too, I don’t recognize myself in the choices I make when I’m deep in my disorder. I’m not an uneducated man, I understand I can’t live a full and happy life without eating but yet….. over and over again I make the same choice to give in to my disorder. \n\nThanks for sharing! Helps massively to know I’m not as alone as how I feel. ",
      "created_utc": 1707729998.0,
      "score": 2,
      "context": [
        {
          "id": "kq01ye1",
          "author": "Lonely-Personality98",
          "body": "I’m a 43 male sometime I feel like I’m smashing life but then go 20 steps back especially when I’m restricting heavily.\nIt’s like I’m a different person and can’t think straight or rationally \n\nHad mental health issues since  I was 18 tried lots of things,  but honest I’ve  only just found the correct support you just need to find the right doctors.\n\nSo basically joined  a Facebook group where everyone is in the same position and offers support and currently waiting for a buddy person who has been there before \n\nThere is help but the health services are a real hit and miss just need to be lucky I guess.\nBut  just share with other people who  can relate helps massively \ngood luck",
          "created_utc": 1707691865.0
        }
      ]
    },
    {
      "id": "kq27nx7",
      "author": "Artistic-External184",
      "body": "Yeah, that is a thought that often comes to me when I’m in yet another relapse like this, it’s so hard. ",
      "created_utc": 1707729382.0,
      "score": 1,
      "context": [
        {
          "id": "kpzo5g9",
          "author": "Mytintin",
          "body": "I'm only 20, but I feel the same way. It's like I'm being forced to stay for other people. I often wish it would finish me off honestly",
          "created_utc": 1707686904.0
        }
      ]
    },
    {
      "id": "kq27rwd",
      "author": "Artistic-External184",
      "body": "Thank you for reminding me that we are out there, that we are seen and noticed. Hugs",
      "created_utc": 1707729470.0,
      "score": 2,
      "context": [
        {
          "id": "kq00s5c",
          "author": "MsKidgie",
          "body": "I have a friend in my SMART meeting on Saturdays that is an adult man with anorexia. Only one I know at the moment, but I have known others. Gentle hugs.",
          "created_utc": 1707691409.0
        }
      ]
    },
    {
      "id": "kq28jrc",
      "author": "Artistic-External184",
      "body": "It definitely is, I’ve felt alone in this for years and years.",
      "created_utc": 1707730075.0,
      "score": 2,
      "context": [
        {
          "id": "kq0pitm",
          "author": "charmed1995",
          "body": "You are not alone. 28m here and I’ve been dealing with anorexia for over 7 years now. It’s very isolating.",
          "created_utc": 1707701283.0
        }
      ]
    },
    {
      "id": "kq2gvnq",
      "author": "Artistic-External184",
      "body": "Yeah, its hard work, I hope you are successful in your recovery, 3 months is really good, I wish you all the best!",
      "created_utc": 1707736478.0,
      "score": 1,
      "context": [
        {
          "id": "kq24uw8",
          "author": "maf_11",
          "body": "Hey. M27, been in my first (and hopefully last) recovery attempt since 3 months. \n\nIm struggling everyday to keep going. Your not alone. We got this.",
          "created_utc": 1707727162.0
        }
      ]
    },
    {
      "id": "lc21yub",
      "author": "Artistic-External184",
      "body": "Thank you for writing this and sharing your struggles, it really means a lot that people have replied and seen this post.  \nAnd that you for giving me a lot of good and concrete advice, I will try and pick up on a few thing you wrote  \n  \nI am doing slightly better now, I’ve started an intensive out patient program at the local ED center and even though I’m just in the beginning of it I already feel… well, at least a bit less hopeless, there is one other guy in the treatment and he’s roughly my age and have also struggled for many years.  \nI’ve been in treatment before but only as an inpatient and that doesn’t seem to be working for me, hospitals seems to trigger me a lot, so I’m glad I got a chance at this out patient treatment instead.  \nI’m really going to try doing my best and work hard  \nHopefully there will be a way to recover and finally be free from this horrible disorder.  \n  \nGood luck to you too, the only good thing that comes from this disorder is the pure understanding and empathy that fellow people who struggle have for each other.",
      "created_utc": 1720368484.0,
      "score": 1,
      "context": [
        {
          "id": "lbxckvd",
          "author": "Slowlyfallin",
          "body": "Howdy brother, no are not alone. Eating Disorders are complex and men are frequently underdiagnosed. Your condition and history is notably extreme, but the best thing you can do for yourself is to continue carrying on as you have been. For your reference, I am a 27 year old male.\n\nYou have been in and out of therapy presumably, but it's also important that you get to the root cause of your disorder. There is something somewhere in your life that is psychologically torturing you that you must come to terms with. Not only that, the physiological effects are having a tremendous toll on the longevity and quality of your life.\n\nI am currently on the edge of an eating disorder rn coming out, but I have never been on either side of the extreme spectrums. In fact, my problems were purely environmentally induced I think. Got put in a bad place mentally and I embodied that completely peering into my work and alcohol for comfort. I'd wake up, skip breakfast, morning session of work, workout instead of taking my one hour lunch, come back and worn until everyone had left, then come home to a tall glass of gin and sprite. I had no desire and an aversion to any food even though i would feel so great after forcing myself to eat anything. I would frequently pass out as if i were drunk when i went home almost as soon as i got back from work. This became my routine gradually over time across 3 years, and I am only recently bouncing back from the physiological effects it had on my body.\n\nUnfortunately, my body feels considerably weaker and I eat substantially slower than everyone around me... I first noticed this when a waiter at a restaurant came to me to ask me if I wanted the check or a to go box when I had mostly a full plate still.\n\nWhy do I say this? I want you to know that if my mild struggles had this much effect on my body, you sir will feel that substantially worse and it will be hard...\n\nMy recommendations:\n1) Get to the root of your demons and come to terms with them\n\n2) Start small because your body and mind won't be able to eat like you used to when you were a kid. If you are eating no meals or .5 meals a day on average, shoot for one solid meal with dense macronutrients. Potatoes, broccoli, rice, lean and well seasoned chicken, beans, beets, cod or tilapia, and spinach. Eat clean so your body gets the most out of it, you'll feel so much better.\n\n2A) Next, start incorporating small snacks throughout the day. Nuts, berries, high fat yogurts with fruit in it. Think about this: Bodybuilders don't binge eat to bulk, they eat clean and they eat a lot. Instead of three big meals, they eat 6-8 macro rich small meals. So take small victories.\n\n3) Lastly, don't beat yourself up. You will regress and it will be difficult, but you have to keep trying.\n\nYou are not alone in this, but only you can pull yourself up. Learn to love food again in a healthy way, and show yourself more love brother. It's not your fault whatever started it, but it is your responsibility to fix.\n\nGood Luck",
          "created_utc": 1720289402.0
        }
      ]
    },
    {
      "id": "kq37cia",
      "author": "Artistic-External184",
      "body": "Wow, thank you so much for sharing that truly heartbreaking story about your uncle.  \nI truly puts into perspective how devastating this disorder is for everyone suffering from it and for others around us.  \nAnd thank you for sharing your tips about recovery, I will cary them with me.  \n  \nFeels like I’m repeating the same words over and over again but I hope you all that are kind enough to write and tell your stories feel seen and heard, I am truly very thankful and moved. It helps knowing there are others. And were others before me, like your uncle.  ",
      "created_utc": 1707750025.0,
      "score": 1,
      "context": [
        {
          "id": "kq2nsgv",
          "author": "None",
          "body": "Im 17 year old girl with anorexia and I had an uncle who had anorexia. He didn’t develop his ed till he had a stroke one day. He lost most of his mobility. He didn’t have one at first but my uncle is a big ego person so when he realized his body wasn’t going to be the same again, he stopped trying completely. He told me his eating disorder was the only thing that made him feel he had control over. As years went on it got worse, he became very skinny and his colon and kidneys started to fail because he wasn’t eating or drinking water, which eventually caused severe constipation. He also stopped walking permanently (his decision, he could still walk but he chose to use the wheelchair) Before he died he told me “It’s never worth the suffering, you’re stronger than me, do what I couldn’t do” I’m not here to tell you a successful story I’m just here to tell you that you’re not alone. But the first step to recovery is wanting to change. Wanting to change is a strong enough thing to keep you motivated, when you relapse don’t beat yourself up about it. Eat things that aren’t as fulfilling, like nuts, applesauce, popcorn. Drink Gatorade and water. Water keeps ur body slim because it eliminates puffiness from sodium intake. The reasoning for my  anorexia is way different than most people but if you want me to share that with you just let me know.",
          "created_utc": 1707740907.0
        }
      ]
    },
    {
      "id": "l8u68mm",
      "author": "Artistic-External184",
      "body": "Nice to read that you are doing better, I’m glad that the meds have worked out for you.  \nI have tried my fair share of meds over the years with varying results  \nIt never seemed to do all that much for me, apart from meds for my ADHD that was really effective and did wonders for my mood too, unfortunately I have been taken of them due to being uw.  \nI’m still open to trying different meds though, definitely.  \n  \nKeep up the good work, your message really made me feel hopeful. ",
      "created_utc": 1718528964.0,
      "score": 1,
      "context": [
        {
          "id": "l7svdlf",
          "author": "Zealousideal-Wish178",
          "body": "I'm male in later 30s . Ive struggled on and off since age 16. Currently doing good after a bad 7 years. I have depression problems that go together with my anorexia.\nI tried the therapy and all the natural ways, I just could not put on any weight. I was 47kg ( 104lb ) , which was very low for my frame. I was so tired and depressed and had so many aches and pains all the time. I was lucky that I had alot of good support networks. \n\nI'm currently in recovery and have gained 18kg (40lb). I got tired of all the therapy and decided to go on medication to help. It was this or start being fed through a tube. I now take Prozac (ssri) and olanzapine (antipsychotic) and testosterone therapy. It has saved my life, it not only made me so hungry but it stopped all me fear around food. I now enjoy food and feel alot happier. I know some people don't like the idea of taking medication, but for me it was this or allow anorexia claim my life. I'm happy with my choice and I will likely never come off my medication, I think I would relapse if I did .",
          "created_utc": 1717932837.0
        }
      ]
    },
    {
      "id": "kq2okmg",
      "author": "Artistic-External184",
      "body": "I live somewhere in Europe too, maybe it’s the doctors I meet in my youth (and now too for that matter) that made me feel weird, alone and somehow unusual for having this disorder as a man.   \nThank you so much for sharing, it really means a lot and I truly warms my heart to read, even though it’s sad to see that others are struggling I rather not be alone in this.  \n\n\nThis thread have made me feel really seen and heard. ",
      "created_utc": 1707741353.0,
      "score": 2,
      "context": [
        {
          "id": "kq2juvh",
          "author": "Economy_Comparison41",
          "body": "I’m 16 (they/them) who’s struggled with ana for about 3 years now. I live in western europe so it’s pretty heavy societal standards (getting more inclusive tho). Since I learned was ana was, I only ever saw girls and women with it, never men. I thought it was nearly impossible. Then, I think 2 years ago, I saw a video on youtube (in my first language) about a teen boy who had ana and that had opened my eyes a little further, but I still wasn’t really educated on men with EDs cause there’s just so little awareness for that. \n\nI saw this post and decided to open it. This has opened my eyes a lot further. It shows that men don’t suffer from ana any other way than women. I’ve seen multiple stories of adult women on here with the exact same symptoms, situations and views on life and recovery.\n\nI’m really happy you’re strong enough to post this here, cause now you see you’re not alone or weird! And you’ve really helped me learn more about ana in men today. Thank you so much for that, I really needed it. \n\nI really hope you find fresh hope, keep that close and get the help you need and deserve. You seem like a cool guy and you’re more than your ED and more than just a body. \n\nYou’re really not alone. ❤️",
          "created_utc": 1707738519.0
        }
      ]
    },
    {
      "id": "kq28ozt",
      "author": "Artistic-External184",
      "body": "It definitely feels like that sometimes, but it calms me to know we are out there, other people notice us and remember us. ",
      "created_utc": 1707730190.0,
      "score": 2,
      "context": [
        {
          "id": "kq0v3a3",
          "author": "Slothwhatsloth",
          "body": "I’m not a man, but I have been inpatient with men. One of them I was in touch with for some time, I’m not sure how he’s doing now, hopefully well. You’re not alone, it certainly can feel that way though.",
          "created_utc": 1707703454.0
        }
      ]
    },
    {
      "id": "kq28zvf",
      "author": "Artistic-External184",
      "body": "Thank you for reminding me that it won’t feel this hard and hopeless forever, that it will pass! It’s very helpful to get reminded of that sometimes.  \nI have, indeed, have times where I haven’t been as consumed by this disorder as I am now, I need to remind myself of that. ",
      "created_utc": 1707730425.0,
      "score": 1,
      "context": [
        {
          "id": "kq13jkc",
          "author": "-maru",
          "body": "Adding to the chorus of voices saying that you're not alone. When I was last in IP, there was another pt who was 52 yo male. My understanding is that he'd been struggling on and off since adolescence. Also, AN is a miserable illness, to be sure, but you are *not* a lost cause - nobody is.  If you are feeling particularly low now, know that those feelings will inevitably change (and abate) as time passes, just as those negative feelings have morphed into happier times before. There is good in the world and you will experience it again. <3",
          "created_utc": 1707706744.0
        }
      ]
    },
    {
      "id": "kq29ikm",
      "author": "Artistic-External184",
      "body": "I’m sorry you are suffering too, I really do hope that there is a way for us both and the others like us to find a successful recovery.  ",
      "created_utc": 1707730833.0,
      "score": 1,
      "context": [
        {
          "id": "kq1e0qn",
          "author": "artificalorganlady",
          "body": "31F. I’ve had this for about 21 years. Pretty much my whole life. Nothing has ever been able to keep it away for very long and I feel like this probably will be the thing that kills me. I’m sorry you’re suffering. You’re certainly not alone.",
          "created_utc": 1707711096.0
        }
      ]
    },
    {
      "id": "kq29lkl",
      "author": "Artistic-External184",
      "body": "Sorry to hear that, it can be such a long journey. ",
      "created_utc": 1707730898.0,
      "score": 1,
      "context": [
        {
          "id": "kq1uvfb",
          "author": "GeckosSayGecko",
          "body": "I'm a 23 years old trans man I've been dealing since 14",
          "created_utc": 1707719919.0
        }
      ]
    },
    {
      "id": "kq2c2tp",
      "author": "Artistic-External184",
      "body": "I’m still working though I’m in active relapse but it’s going downhill fast and I’m not far away from going on sick leave for this again.  \nThank you for writing and showing me I’m not such a strange and unique case, it really calms me to know there are others, many others, like me out there. ",
      "created_utc": 1707732836.0,
      "score": 1,
      "context": [
        {
          "id": "kq20jaw",
          "author": "SourCandyBar",
          "body": "I am of the age group you are in and a male who has been dealing with this since I was 16. It’s a constant uphill battle that you feel like you will never win. I always thought too if I was alone in this but to know I am not is a little strange. I am currently on a leave of absence from work due to relapsing and over working my self.",
          "created_utc": 1707723850.0
        }
      ]
    },
    {
      "id": "kq2c8ww",
      "author": "Artistic-External184",
      "body": "I feel like that too, that everyone I tell about this is surprised and confused that I have this disorder. Even doctors sometimes. ",
      "created_utc": 1707732969.0,
      "score": 2,
      "context": [
        {
          "id": "kq2398h",
          "author": "Puzzleheaded_Ad550",
          "body": "I'm 35. I think recovery might be possible if you have a great support network. Unfortunately the world doesn't seem to care about eating disorders",
          "created_utc": 1707725907.0
        }
      ]
    },
    {
      "id": "kq2hqb9",
      "author": "Artistic-External184",
      "body": "Yeah, I hope so too. I really had hoped life would be more than just a constant anxiety spiral about food and weight. I look at other guys around me, and I’m so different to them, my life looks nothing like theirs and I want desperately for things to improve. For all of us. Thank to your for sharing!",
      "created_utc": 1707737079.0,
      "score": 2,
      "context": [
        {
          "id": "kq2ebsm",
          "author": "sbrown_13",
          "body": "You’re not alone...And I’m so sorry that you’re struggling too…I hate knowing that someone is in the exact same position as me. All I do is just hope that one day it will get better, things will improve and my time to enjoy life will come.",
          "created_utc": 1707734600.0
        }
      ]
    },
    {
      "id": "kq384c4",
      "author": "Artistic-External184",
      "body": "Thank you for writing  \nI sat here thinking and if I’m being completely honest with myself there is probably at least some things that my disorder is ”the amazing solution” for, something that I’m struggling to find other solutions on.  \nI will definitely take that with me when I start my recovery once again, ”the amazing solution”, thank you. Food for thought!",
      "created_utc": 1707750335.0,
      "score": 2,
      "context": [
        {
          "id": "kq2z6hg",
          "author": "Skythebluestars",
          "body": "28 non binary. Def not alone got diagnosed at 14. Struggling since i was 11 . Been in therapy for 14 years now. What helped me is knowing that ED, are coping mechanisms. After my diagnosis i got other  diagnosis. \n\nThe thing i def recommend is think by yourself where do i need my ed for. What am i scared of if i let it all go. Because theres something that you hold on for. \n\nLike we called in therapy the \" amazing solution \" because it feels that way. \n\nYou never alone in your journey. But i also believe and know you can fully recover. \n\nHold on",
          "created_utc": 1707746590.0
        }
      ]
    },
    {
      "id": "kq38dvp",
      "author": "Artistic-External184",
      "body": "Thanks. And yes, we definitely are! Best of luck to you too!",
      "created_utc": 1707750440.0,
      "score": 1,
      "context": [
        {
          "id": "kq31xkp",
          "author": "BenjitheHerd",
          "body": "32M, \n\nI do believe you can recover. We're in this together!",
          "created_utc": 1707747790.0
        }
      ]
    },
    {
      "id": "kq4fsay",
      "author": "Artistic-External184",
      "body": "Thank you for taking the time to write, it truly makes me feel seen. ",
      "created_utc": 1707765691.0,
      "score": 2,
      "context": [
        {
          "id": "kq3qrpg",
          "author": "Extension_Nerve_8233",
          "body": "I’m 34 and non-binary. I have struggled with this since around 14 yo but had a very long recovery. I had a coworker in his late 20s who was a man and anorexic. You’re not alone.",
          "created_utc": 1707757133.0
        }
      ]
    },
    {
      "id": "kqka66b",
      "author": "Artistic-External184",
      "body": "It’s such a terrible disorder, day in and day out it’s just the same nightmare. I’m sorry you are suffering too, I wish we all could find a way out of this. ",
      "created_utc": 1708019343.0,
      "score": 2,
      "context": [
        {
          "id": "kqcvk8s",
          "author": "Throwaway_Z4L",
          "body": "I’m a 19 year old male. Been suffering with it for a couple years, not nearly as long as you have though. But I feel the same honestly, I don’t see any way out of this. I know it feels like it, but you are def not alone in this. Hope things get better for you soon",
          "created_utc": 1707896412.0
        }
      ]
    },
    {
      "id": "kq4unyq",
      "author": "RayRay_46",
      "body": "My ex is a 30 year old cisgender male with an ED. He has never gotten treatment for his eating disorder. \n\nI think treatment/accepting you have an ED is scary and difficult for everyone, but I feel like people raised as males have extra mental barriers around accepting their disorder and seeking treatment just because of the way our society works. That might be part of the reason you don’t see other men in treatment. \n\nYou are definitely not alone and I wish you strength in fighting this battle.",
      "created_utc": 1707770747.0,
      "score": 7,
      "context": [
        {
          "id": "kpz1084",
          "author": "mkraft418",
          "body": "I’m a 33-year-old male. Been suffering with anorexia since I was 14. Been in and out of treatment a bunch. Recovery never lasts for more than 6 months to a year for me. I have no quality of life as when I relapse, I relapse hard to the edge of death. I get severely underweight to the point where I can barely function. I live at home with my parents because I can’t function on my own and I’m not healthy enough to hold a job. At this point I’ve lost any hope of a normal life. Part of me thinks my condition would have been taken more seriously at a younger age had a been a female, but being a male allowed me to slip through the cracks. My anorexia was viewed as a “phase” when I was younger.",
          "created_utc": 1707679169.0
        },
        {
          "id": "kpz2cl8",
          "author": "Artistic-External184",
          "body": "Thank you for sharing, your story sounds a lot like my own, I’ve never met another guy when I’ve been in for treatments which has lead me to feel alone in all this. ",
          "created_utc": 1707679614.0
        }
      ]
    },
    {
      "id": "kq37tt3",
      "author": "justcallmedrzoidberg",
      "body": "I understand the feeling of not wanting to feel alone in this nightmare.",
      "created_utc": 1707750219.0,
      "score": 3,
      "context": [
        {
          "id": "kpzbtfo",
          "author": "justcallmedrzoidberg",
          "body": "36 years old female, you’re not alone. Been dealing with anorexia with purging/binging behaviors since I was 20. Currently in my worst state since it has all began. :(",
          "created_utc": 1707682768.0
        },
        {
          "id": "kq27je2",
          "author": "Artistic-External184",
          "body": "I’m sorry the hear you are struggling too, but it calms me to think there are others my age that ”still” have issues, that I’m not alone. ",
          "created_utc": 1707729281.0
        }
      ]
    },
    {
      "id": "kpzy0jd",
      "author": "NotAThrowAway28",
      "body": "Of course friend. Please be kind to yourself, and also push yourself to keep trying. Recovery is absolutely hard and it's worth it.",
      "created_utc": 1707690341.0,
      "score": 3,
      "context": [
        {
          "id": "kpz2xtn",
          "author": "NotAThrowAway28",
          "body": "Hey. I'm 31. Trans guy, but still male.\n\nI've had an ED since I was 9. It was BED until 16 and now it's been anorexia since. \n\nCurrently struggling through a relapse too. \n\nIt will take time. And a lot of effort. But we absolutely can recover. \n\nI wish you well, friend. You're not alone. Promise.",
          "created_utc": 1707679811.0
        },
        {
          "id": "kpz4q3l",
          "author": "Artistic-External184",
          "body": "I feel relieved that I got some replies here from other men in the same situation as me, struggling same as me. Thank you for replying.",
          "created_utc": 1707680401.0
        }
      ]
    },
    {
      "id": "kq2hjf4",
      "author": "maf_11",
      "body": "you can do it too! i never thought I would come this far.",
      "created_utc": 1707736944.0,
      "score": 1,
      "context": [
        {
          "id": "kq24uw8",
          "author": "maf_11",
          "body": "Hey. M27, been in my first (and hopefully last) recovery attempt since 3 months. \n\nIm struggling everyday to keep going. Your not alone. We got this.",
          "created_utc": 1707727162.0
        },
        {
          "id": "kq2gvnq",
          "author": "Artistic-External184",
          "body": "Yeah, its hard work, I hope you are successful in your recovery, 3 months is really good, I wish you all the best!",
          "created_utc": 1707736478.0
        }
      ]
    },
    {
      "id": "lghgl97",
      "author": "Slowlyfallin",
      "body": "The hospitals can't control your behaviors but with drugs. So I understand your aversion. If they have a rehabilitation center with a dietician or trainer, they'll usually be knowledgeable enough to help evaluate your diet for you. Don't look at as hospital care, it's physical training. You're training your stomach, mind, and body to eat for performance.\n\nThe 1% Rule brother. Slight improvement is where you wanna be with this because at this point you have hard ingrained habits. Slight improvements will inevitably get you to where you need to be, and you'll gain more weight than you're used to so you may need to start a basic training program to get used to your body again. Believe me... 10 pounds significantly made all my other body workouts harder haha.\n\nIt's so crazy what a little weight does, but I got a lot stronger training with my extra weight and I've balanced out to 140 LBS. I used to be 99 LBS...",
      "created_utc": 1722794344.0,
      "score": 1,
      "context": [
        {
          "id": "lbxckvd",
          "author": "Slowlyfallin",
          "body": "Howdy brother, no are not alone. Eating Disorders are complex and men are frequently underdiagnosed. Your condition and history is notably extreme, but the best thing you can do for yourself is to continue carrying on as you have been. For your reference, I am a 27 year old male.\n\nYou have been in and out of therapy presumably, but it's also important that you get to the root cause of your disorder. There is something somewhere in your life that is psychologically torturing you that you must come to terms with. Not only that, the physiological effects are having a tremendous toll on the longevity and quality of your life.\n\nI am currently on the edge of an eating disorder rn coming out, but I have never been on either side of the extreme spectrums. In fact, my problems were purely environmentally induced I think. Got put in a bad place mentally and I embodied that completely peering into my work and alcohol for comfort. I'd wake up, skip breakfast, morning session of work, workout instead of taking my one hour lunch, come back and worn until everyone had left, then come home to a tall glass of gin and sprite. I had no desire and an aversion to any food even though i would feel so great after forcing myself to eat anything. I would frequently pass out as if i were drunk when i went home almost as soon as i got back from work. This became my routine gradually over time across 3 years, and I am only recently bouncing back from the physiological effects it had on my body.\n\nUnfortunately, my body feels considerably weaker and I eat substantially slower than everyone around me... I first noticed this when a waiter at a restaurant came to me to ask me if I wanted the check or a to go box when I had mostly a full plate still.\n\nWhy do I say this? I want you to know that if my mild struggles had this much effect on my body, you sir will feel that substantially worse and it will be hard...\n\nMy recommendations:\n1) Get to the root of your demons and come to terms with them\n\n2) Start small because your body and mind won't be able to eat like you used to when you were a kid. If you are eating no meals or .5 meals a day on average, shoot for one solid meal with dense macronutrients. Potatoes, broccoli, rice, lean and well seasoned chicken, beans, beets, cod or tilapia, and spinach. Eat clean so your body gets the most out of it, you'll feel so much better.\n\n2A) Next, start incorporating small snacks throughout the day. Nuts, berries, high fat yogurts with fruit in it. Think about this: Bodybuilders don't binge eat to bulk, they eat clean and they eat a lot. Instead of three big meals, they eat 6-8 macro rich small meals. So take small victories.\n\n3) Lastly, don't beat yourself up. You will regress and it will be difficult, but you have to keep trying.\n\nYou are not alone in this, but only you can pull yourself up. Learn to love food again in a healthy way, and show yourself more love brother. It's not your fault whatever started it, but it is your responsibility to fix.\n\nGood Luck",
          "created_utc": 1720289402.0
        },
        {
          "id": "lc21yub",
          "author": "Artistic-External184",
          "body": "Thank you for writing this and sharing your struggles, it really means a lot that people have replied and seen this post.  \nAnd that you for giving me a lot of good and concrete advice, I will try and pick up on a few thing you wrote  \n  \nI am doing slightly better now, I’ve started an intensive out patient program at the local ED center and even though I’m just in the beginning of it I already feel… well, at least a bit less hopeless, there is one other guy in the treatment and he’s roughly my age and have also struggled for many years.  \nI’ve been in treatment before but only as an inpatient and that doesn’t seem to be working for me, hospitals seems to trigger me a lot, so I’m glad I got a chance at this out patient treatment instead.  \nI’m really going to try doing my best and work hard  \nHopefully there will be a way to recover and finally be free from this horrible disorder.  \n  \nGood luck to you too, the only good thing that comes from this disorder is the pure understanding and empathy that fellow people who struggle have for each other.",
          "created_utc": 1720368484.0
        }
      ]
    },
    {
      "id": "kq5q5fz",
      "author": "Economy_Comparison41",
      "body": "I’m so glad this made you feel better. And I truly understand not wanting to be alone in your experience. A human needs relatability, everyone searches for it all the time. But I’m so happy you’ve found others who are alike, I know how much that can help. \n\nThank you for being you, I really appreciate you and I’m sure a lot of people here and irl do too. You’re amazing <3",
      "created_utc": 1707781892.0,
      "score": 1,
      "context": [
        {
          "id": "kq2juvh",
          "author": "Economy_Comparison41",
          "body": "I’m 16 (they/them) who’s struggled with ana for about 3 years now. I live in western europe so it’s pretty heavy societal standards (getting more inclusive tho). Since I learned was ana was, I only ever saw girls and women with it, never men. I thought it was nearly impossible. Then, I think 2 years ago, I saw a video on youtube (in my first language) about a teen boy who had ana and that had opened my eyes a little further, but I still wasn’t really educated on men with EDs cause there’s just so little awareness for that. \n\nI saw this post and decided to open it. This has opened my eyes a lot further. It shows that men don’t suffer from ana any other way than women. I’ve seen multiple stories of adult women on here with the exact same symptoms, situations and views on life and recovery.\n\nI’m really happy you’re strong enough to post this here, cause now you see you’re not alone or weird! And you’ve really helped me learn more about ana in men today. Thank you so much for that, I really needed it. \n\nI really hope you find fresh hope, keep that close and get the help you need and deserve. You seem like a cool guy and you’re more than your ED and more than just a body. \n\nYou’re really not alone. ❤️",
          "created_utc": 1707738519.0
        },
        {
          "id": "kq2okmg",
          "author": "Artistic-External184",
          "body": "I live somewhere in Europe too, maybe it’s the doctors I meet in my youth (and now too for that matter) that made me feel weird, alone and somehow unusual for having this disorder as a man.   \nThank you so much for sharing, it really means a lot and I truly warms my heart to read, even though it’s sad to see that others are struggling I rather not be alone in this.  \n\n\nThis thread have made me feel really seen and heard. ",
          "created_utc": 1707741353.0
        }
      ]
    },
    {
      "id": "kq2dtpz",
      "author": "Slothwhatsloth",
      "body": "We certainly do, I remember him frequently, and worry and hope his life has improved, finally seperate from this terrible disease. I have no doubt people you think have long forgotten you also remember you as well.",
      "created_utc": 1707734212.0,
      "score": 1,
      "context": [
        {
          "id": "kq0v3a3",
          "author": "Slothwhatsloth",
          "body": "I’m not a man, but I have been inpatient with men. One of them I was in touch with for some time, I’m not sure how he’s doing now, hopefully well. You’re not alone, it certainly can feel that way though.",
          "created_utc": 1707703454.0
        },
        {
          "id": "kq28ozt",
          "author": "Artistic-External184",
          "body": "It definitely feels like that sometimes, but it calms me to know we are out there, other people notice us and remember us. ",
          "created_utc": 1707730190.0
        }
      ]
    },
    {
      "id": "kq51xbh",
      "author": "Skythebluestars",
      "body": "Iknow that feeling. And i struggling with the same. I need the coping. Because \"the amazing solution \" and i have other copings but it doesnt work like my ed works. Its not the same. Its hard bumping into that . But maybe nothing will be ever the same. Maybe nothing will ever be \"the amazing solution \" and its just lil tiny solutions and the rest we need to learn to cope with? Just some midnight thoughts",
      "created_utc": 1707773198.0,
      "score": 1,
      "context": [
        {
          "id": "kq2z6hg",
          "author": "Skythebluestars",
          "body": "28 non binary. Def not alone got diagnosed at 14. Struggling since i was 11 . Been in therapy for 14 years now. What helped me is knowing that ED, are coping mechanisms. After my diagnosis i got other  diagnosis. \n\nThe thing i def recommend is think by yourself where do i need my ed for. What am i scared of if i let it all go. Because theres something that you hold on for. \n\nLike we called in therapy the \" amazing solution \" because it feels that way. \n\nYou never alone in your journey. But i also believe and know you can fully recover. \n\nHold on",
          "created_utc": 1707746590.0
        },
        {
          "id": "kq384c4",
          "author": "Artistic-External184",
          "body": "Thank you for writing  \nI sat here thinking and if I’m being completely honest with myself there is probably at least some things that my disorder is ”the amazing solution” for, something that I’m struggling to find other solutions on.  \nI will definitely take that with me when I start my recovery once again, ”the amazing solution”, thank you. Food for thought!",
          "created_utc": 1707750335.0
        }
      ]
    }
  ]
}