{
  "id": "1ayg09n",
  "subreddit": "AnorexiaNervosa",
  "author": "dfintlynoturgirlfrnd",
  "created_utc": 1708732892.0,
  "title": "What made you anorexic?",
  "selftext": "I know this sounds like a crazy question, but if you could pinpoint it, what was it?\n",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ayg09n/what_made_you_anorexic/",
  "score": 115,
  "num_comments": 211,
  "comments": [
    {
      "id": "kruhs3i",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1708732892.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krukcse",
      "author": "SecondaryPosts",
      "body": "Feeling a lack of control in my life, combined with a traumatic event and sustained extreme stress. Body image never played into it for me.",
      "created_utc": 1708733896.0,
      "score": 193,
      "context": []
    },
    {
      "id": "kruiwxi",
      "author": "htesssl",
      "body": "To simplify it drastically, chronic internalization of trauma coupled with the thin ideal that is perpetuated in western culture. Also as a means to have control over something in my life. I could probably think of a few more things too.",
      "created_utc": 1708733337.0,
      "score": 89,
      "context": []
    },
    {
      "id": "krukd81",
      "author": "Decent-Efficiency-21",
      "body": "To be completely honest it started out as just a dare to challenge myself to see if i could really do it as much as i thought i could, but then i was suprised when i found out i actually could and did and started liking it alot, but then it became addicting and i started losing control and it no longer became a dare but a manifestation of all my negative emotions and a way of having control and the worse i feel the more weight i lose, i didn't expect to lose this much weight i didn't think i could but now that i did it feels almost impossible to let this \"high\" go to let everything I've ever wanted go even if it kills me",
      "created_utc": 1708733901.0,
      "score": 62,
      "context": []
    },
    {
      "id": "krup1s8",
      "author": "None",
      "body": "Was alr skinny since forever. People only ever just complimented me on my skinnyness. So i felt like I had to stay skinny :) lowkey drove me nuts but im better than ever now",
      "created_utc": 1708735712.0,
      "score": 96,
      "context": []
    },
    {
      "id": "krur7rw",
      "author": "None",
      "body": "Being bullied at school and as a pre-teen finding out generally in society being skinny is praised. I was already skinny and got compliments for it from family members and strangers so I figured if everything else about me was bad then at least I could be skinny. Then it spiraled into me loving the feeling of self control and later on being sick",
      "created_utc": 1708736571.0,
      "score": 33,
      "context": []
    },
    {
      "id": "krv7xbi",
      "author": "crescentmoon_n",
      "body": "Honestly I'm using it as a self harm, a slow suicide. And it makes me relaxed\n\nAnd need of control in my life ofc",
      "created_utc": 1708743453.0,
      "score": 31,
      "context": []
    },
    {
      "id": "kruo8q3",
      "author": "xxkuromi",
      "body": "trauma + ocd + autism = crazy need for control",
      "created_utc": 1708735398.0,
      "score": 60,
      "context": []
    },
    {
      "id": "kruqp5e",
      "author": "K8_15",
      "body": "Pro ana websites in 2014",
      "created_utc": 1708736362.0,
      "score": 45,
      "context": []
    },
    {
      "id": "kruwlxp",
      "author": "Front-Ad-5210",
      "body": "it’s another crutch for me just like drugs and self harm and it makes me feel like i have self control",
      "created_utc": 1708738743.0,
      "score": 22,
      "context": []
    },
    {
      "id": "krv7hhi",
      "author": "thatonlinestudent",
      "body": "my parents main priority was looks didnt help we had to be w/eighed weekly as kid and were rewarded/punished based on that",
      "created_utc": 1708743266.0,
      "score": 22,
      "context": []
    },
    {
      "id": "krw7vq0",
      "author": "autumnfire1414",
      "body": "So many things. Mostly my personality.  I internalize things. I'm a perfectionist. I don't have an appetite when I'm stressed. Weightloss happened and the positive feedback I got was reinforcing. It was something i was good at when my world felt out of control.",
      "created_utc": 1708763119.0,
      "score": 19,
      "context": []
    },
    {
      "id": "krv9gxe",
      "author": "SaxWeeb23",
      "body": "Running out of negative coping skills and this was last on the list...",
      "created_utc": 1708744117.0,
      "score": 16,
      "context": []
    },
    {
      "id": "krun7ck",
      "author": "throwthetulipsaway",
      "body": "A head injury",
      "created_utc": 1708734997.0,
      "score": 16,
      "context": []
    },
    {
      "id": "krupluv",
      "author": "damaged_bloodline",
      "body": "My mom/family",
      "created_utc": 1708735930.0,
      "score": 16,
      "context": []
    },
    {
      "id": "krw68uy",
      "author": "jaehatesyou",
      "body": "damn everyone here is saying really deep reasons but mine is just that i wanted to be skinny 😭 i’m embarrassed now",
      "created_utc": 1708761965.0,
      "score": 17,
      "context": []
    },
    {
      "id": "krvnpe2",
      "author": "DNetherdrake",
      "body": "Me. I read somewhere that depressed people are more likely to under-eat than to over-eat. I was severely depressed and slightly overweight, and since those were apparently in conflict,I stopped eating. And then I became obsessed with losing weight and ended up developing proper anorexia, more or less on purpose, out of some combination of self-hate and a need for validation.",
      "created_utc": 1708750695.0,
      "score": 15,
      "context": []
    },
    {
      "id": "krun6th",
      "author": "cheesles",
      "body": "A means to control something in my life (at the time, I was spiraling due to a lot of factors) and the ideality of thinness that I never really had growing up. The attention I got from it (I didn't get any attention from men until I was well in my ed) only solidified it in my mind.",
      "created_utc": 1708734991.0,
      "score": 12,
      "context": []
    },
    {
      "id": "krv7bjm",
      "author": "SpaghettiWesternHead",
      "body": "Domestic violence + my aunts suicide (she raised me) I wanted to die.",
      "created_utc": 1708743196.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kruvs98",
      "author": "LunarScorpio_",
      "body": "I’ve always had bad body image but Drvg abuse worsened it due to the weight loss that comes with it. Also made it harder for me to get sober because I loved getting smaller and smaller. I’m sober and fully recovered now.",
      "created_utc": 1708738411.0,
      "score": 9,
      "context": []
    },
    {
      "id": "krvwzdv",
      "author": "chillin_in_my_onesie",
      "body": "Dysphoria",
      "created_utc": 1708755826.0,
      "score": 9,
      "context": []
    },
    {
      "id": "krvgmhu",
      "author": "Low-Application6241",
      "body": "Being suicidal.",
      "created_utc": 1708747281.0,
      "score": 8,
      "context": []
    },
    {
      "id": "krxklku",
      "author": "DieNecroKatze",
      "body": "Tbh seeing my overweight family struggle made me feel like I can never let myself become that way",
      "created_utc": 1708789932.0,
      "score": 7,
      "context": []
    },
    {
      "id": "krunxdw",
      "author": "quisqueyane",
      "body": "My stepmom suffering from an ed and making comments about my body, being a poc in a white area, struggles at home that made me need something I could be in control of",
      "created_utc": 1708735276.0,
      "score": 15,
      "context": []
    },
    {
      "id": "kruiw9w",
      "author": "None",
      "body": "Getting cheated on",
      "created_utc": 1708733330.0,
      "score": 9,
      "context": []
    },
    {
      "id": "krv44ve",
      "author": "Luckypenny4683",
      "body": "My mom.",
      "created_utc": 1708741858.0,
      "score": 8,
      "context": []
    },
    {
      "id": "krwlcrg",
      "author": "Artistic-External184",
      "body": "From the very beginning, probably internalized homophobia, bullying, and a need to control my life as a teenager.  \nAs an adult relapses happen during times of great change, so it’s about control, still.  ",
      "created_utc": 1708772849.0,
      "score": 7,
      "context": []
    },
    {
      "id": "krumo7g",
      "author": "kasialis721",
      "body": "friend suggested dieting together. got braces, had covid, blamed it on long covid, spiraled into AN",
      "created_utc": 1708734795.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kruoijr",
      "author": "Alyx_M11",
      "body": "Cos it felt like smth I could control. My life was full of sad/depressing moments and thoughts, being able to control what I ate gave me hope ig",
      "created_utc": 1708735503.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kruwvww",
      "author": "ItsYoshi64251",
      "body": "Lack of control after a traumatic experience",
      "created_utc": 1708738857.0,
      "score": 6,
      "context": []
    },
    {
      "id": "krv78ys",
      "author": "what-is-noah",
      "body": "My dad would make us watch those starving African kids on tv, telling us to never waste, while being given adult sized portions from a young age ((before 10))\n\nSpent all my childhood and teen years fat, being bullied by peers and family for it. Around 12/13 I discovered pro ana and have pretty consistently dealt with ednos since, however after losing and gaining and then relosing a large amount of weight I'd definitely say within the past two years I have learned more into the anorexia criteria ((I am not gaining that fuckin weight back this time lol))",
      "created_utc": 1708743167.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kry6wqm",
      "author": "viemarirctta",
      "body": "The way I've heard multiple adults in my life talk negative about food and promote weight loss and glorify being skinny since I was a child.",
      "created_utc": 1708797812.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kruytg2",
      "author": "z0mbiiib0y",
      "body": "i thought i was too big always even though i was below average in my age group. i wish i could hug 11yr old me",
      "created_utc": 1708739644.0,
      "score": 10,
      "context": []
    },
    {
      "id": "krukw0n",
      "author": "Consistent-Claim5203",
      "body": "Trauma and mom’s idea of thin. Im getting better though and eating enough so her past words no longer affect how I view my food. Some days are struggles but I just persist through them because once you’re better, you realize how hellish anorexia was and you never want to go back to that.",
      "created_utc": 1708734103.0,
      "score": 12,
      "context": []
    },
    {
      "id": "krunsc7",
      "author": "Stenuhhh_",
      "body": "I needed something to control, buying my wedding dress (it’s a longer story) & much trauma and abuse in my life",
      "created_utc": 1708735222.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kruqfpu",
      "author": "Namenamehihi",
      "body": "my friends started talking about their past eds and their lowest weights and i felt like shit for being the fattest one there",
      "created_utc": 1708736257.0,
      "score": 4,
      "context": []
    },
    {
      "id": "krus4h0",
      "author": "TooManyTongues",
      "body": "A combination of my mother’s eating issues and fat shaming of family members and being in the entertainment industry as a child/teenager.",
      "created_utc": 1708736934.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kruywhh",
      "author": "riverswood",
      "body": "family, ptsd, popularity of thigh gaps…. those animal videos/documentaries scaring people into going vegan (and the people guilt tripping too) certainly didn’t help either.",
      "created_utc": 1708739679.0,
      "score": 7,
      "context": []
    },
    {
      "id": "krv0ep5",
      "author": "acidwxrld",
      "body": "honestly for me i severly fear becoming fat. iv always had this fear since a child and its caused me to have a realllyyy bad relationship w food",
      "created_utc": 1708740300.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kruprlr",
      "author": "NoisyTurnip",
      "body": "Child abuse",
      "created_utc": 1708735993.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kruwmme",
      "author": "Dependent_Shower_584",
      "body": "Comments from people in my life comparing or judging my body. That combined with being a perfectionist screwed me over.",
      "created_utc": 1708738751.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krv4czi",
      "author": "tintedpink",
      "body": "Was feeling like a failure, I missed getting an A average on my report card by 1%, I auditioned for a film and didn't get it so I started thinking \"well I'm not smart, and I'm not talented so if I'm ever going to be successful it's going to have to be based on my looks... and if that's the case I need to lose weight.\"  Now I know how flawed my thinking was but my 14 year old brain definitely didn't. It might have just stayed an unhealthy crash diet for a summer but I started having extreme anxiety from other stuff, my home life wasn't safe, I had some issues with my friends, and I discovered how well restricting and over exercising reduced my anxiety and how it made me feel in control when everything else in my world was spinning and I was hooked.",
      "created_utc": 1708741953.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krvfe2y",
      "author": "Negative-Brick2508",
      "body": "My foster dad used to starve me, force me to purge and over exercise. That combined with the sexual abuse he perpetrated against me has given me a pretty strong desire to be in control of my body.",
      "created_utc": 1708746718.0,
      "score": 4,
      "context": []
    },
    {
      "id": "krvvzoh",
      "author": "EchoConsistent3858",
      "body": "Child abuse/Bullying for being fat",
      "created_utc": 1708755219.0,
      "score": 4,
      "context": []
    },
    {
      "id": "krvc8f0",
      "author": "jjfyi_35",
      "body": "puberty",
      "created_utc": 1708745316.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krvdspn",
      "author": "hornyheadoflettuce",
      "body": "one day in school, i felt super energized. i tried to run off the energy in PE and barely made it 200 feet before my legs gave out. after that, i had a panic attack in the bathroom and ended up going to the counselor. she literally told me \"maybe eat less\" and i spiraled. i went home early and just looked at pictures of myself. i eventually realized i had been fat since i was probably 6. i think seeing myself next to all my skinny friends was the final straw",
      "created_utc": 1708746000.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krvi00w",
      "author": "helianthus_0",
      "body": "I was bulimic but doing really well after 3 months in treatment. About a year after discharging, my grandma died. I stopped caring about recovery. I was dating an amazing man at the time who didn’t know I had an ED. I needed to tell him but didn’t know how. I thought “I’ll eat less, get really thin and he’ll figure it out” so my BN turned to AN-BP. That was 12 years ago and I’m still struggling.",
      "created_utc": 1708747913.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krvlrkf",
      "author": "Netgagagoogoo",
      "body": "Never being enough.i need to control myself",
      "created_utc": 1708749724.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krvmqxj",
      "author": "winter-comet",
      "body": "It was nothing to do with body image. It was wanting to find a sense of control due to childhood trauma, specifically CSA.",
      "created_utc": 1708750216.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krvo78a",
      "author": "iamg0rl",
      "body": "I was always thin and then I had a baby and despite being a lower weight than pre pregnancy now my stomach is irreparably disfigured as a result of the pregnancy and I spiraled.",
      "created_utc": 1708750950.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krvu7ye",
      "author": "None",
      "body": "My inability to ask for help, assert my needs and communicate. I feel that unless I look like I'm on the brink of death, I'm not worth helping.",
      "created_utc": 1708754174.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krvvucy",
      "author": "Allison-Ghost",
      "body": "My family was poor, I was always skinny, but then my sister was in the hospital for some months when I was in middle school. Suddenly I was alone at home most nights while my mom went and checked on her, I just kinda developed a habit of not eating a lot. Saved on money and time and effort, which went a long way on food stamps.\n\nAlways liked the aesthetic of ghosts and skeletons and scene and emo girls. Wanted to be one but I was a \"guy\". Told nobody this not even myself... When I found out that being underweight could interfere with puberty those habits were set in stone for me. Not that it helped even in that regard, ofc...\n\nControl. Body image. Obsessed with maintaining a look that separated me from other people without having to reveal what I actually liked. Something that could look accidental or unintentional. A desire to hurt and punish myself, whom I hated. Numbing the pain. Increasing the pain. Chasing a societal feminine ideal in the only ways I could.\n\nWhile I had it I never considered myself to have it and never sought medical attention. Now that I have it under better control I wouldn't qualify for it. Feel like a faker, and back to punishing myself with a starve day I go.\nI still associate abstaining from eating with moral and financial positivity.",
      "created_utc": 1708755129.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krvwvc0",
      "author": "vexingfrog",
      "body": "It was a way to have some control as a child during abuse. Restricting what I ate gave me that control, changing how my body looked gave me that control, it was the only thing I had control over. I would also restrict as a form of punishment. As I got older those same reasons stayed but so did the desire to get as thin as possible. It was never to look skinny because I thought that was attractive, I wanted to look as dead on the outside as I felt on the inside. I wanted to horrify people. I didn’t want people to be attracted to me. After years of sexual abuse I wanted people to not want my body.",
      "created_utc": 1708755756.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krvzsch",
      "author": "Exotic_Lengthiness32",
      "body": "getting put on a medication and having a chronic gi disease. when i started loosing weight from the disease i loved it and then i was forced to be put on a med that causes severe weight gain(prednisone) on top of tpn. i go a HUGEEE moon face even tho i barely gained any weight and that made me feel a gained weight and needed to look better so i was like i need to loose weight. and i lost a lotttaaa weight instead maintaining it to the point it was dangerous",
      "created_utc": 1708757589.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krw6wsn",
      "author": "SnooRevelations7103",
      "body": "By the time i was diagnosed with ana at 26 it was after my bf of 10yrs told me he'd been cheating on and off for most of our relationship and that he needed me to move out of the house i co-owned. That threw me into a tailspin and it was all about running and gym and severe control.\nOtherwise I'd been suffering from restrictive eating disorders on and off since i was 8. A wonderful gift of body dismorphia given to me by my mother 😂 and a father that only ever saw my physical flaws",
      "created_utc": 1708762431.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krwc1vo",
      "author": "That_Agent1983",
      "body": "abuse lol",
      "created_utc": 1708766147.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krwe1f6",
      "author": "looneybin-inc",
      "body": "Was always overweight in childhood and extremely adverse to exercise. I always wanted to lose weight and was just waiting for the moment my food cravings ended so I could begin lessening my food intake. After a short period of drug use, I completely lost my appetite. I took the opportunity, unfortunately. What really solidified it was realizing I really could lose weight while avoiding exercise. Seeing the rapid weight loss without exercise was my absolute dream.",
      "created_utc": 1708767588.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krwnnyf",
      "author": "None",
      "body": "Had a lot of other mental issues but no one really noticed so I figured if I would become very skinny they would notice how terrible I was doing. Also connected to performance pressure and a way to control sth In my life, but I only recently learned this in therapy",
      "created_utc": 1708774437.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krwtzuz",
      "author": "OkStock9839",
      "body": "Early 2000 tabloids",
      "created_utc": 1708778301.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kry8ssy",
      "author": "CriticalTell7156",
      "body": "I got an autoimmune disease that affects my stomach- i lost a ton of weight at 11, experienced a lot of medical trauma, and was put on iv prednisone which caused rapid weight gain. After experiencing so many horrible body changes and the bullying that came with it, i had an uncontrollable desire to control my body myself, and to control any pain i experienced. If my body was going to fall apart, I was going to cause it rather than letting something else take the reins.",
      "created_utc": 1708798471.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krul2kt",
      "author": "dfintlynoturgirlfrnd",
      "body": "For me personally, so my clothes would look cuter. That was my only inspiration lol",
      "created_utc": 1708734173.0,
      "score": 9,
      "context": []
    },
    {
      "id": "krutd15",
      "author": "ThePinkSkitty",
      "body": "Skinny is prettier",
      "created_utc": 1708737433.0,
      "score": 11,
      "context": []
    },
    {
      "id": "krvbd9x",
      "author": "SecretAd9899",
      "body": "doctor telling me i was obese and telling me i had to lose weight",
      "created_utc": 1708744939.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krvog9u",
      "author": "jarosunshine",
      "body": "I’m still not entirely sure. I assume the things that make my ACES score an 8, narcissistic abuse (parent), a first degree relative with an ED (parent), being the chubby kid, and the absolute rush/high I get from being empty.",
      "created_utc": 1708751079.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krvqfrl",
      "author": "HelicopterJazzlike73",
      "body": "Lack of control (I was 18 when it started) and my first love broke up with me.",
      "created_utc": 1708752108.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krvqwu6",
      "author": "None",
      "body": "Genetic predisposition.",
      "created_utc": 1708752355.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krvsixo",
      "author": "Sharonmaria_12",
      "body": "Grief… and a heartbreak that happened at the same time… this was my way of coping while self harming",
      "created_utc": 1708753221.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krvu16e",
      "author": "Closet_rat0",
      "body": "Trauma + being made fun of my entire life from being overweight since I can very first remember",
      "created_utc": 1708754066.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krvu7rj",
      "author": "charlotteloveshorror",
      "body": "My dad",
      "created_utc": 1708754171.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krw1opc",
      "author": "None",
      "body": "My parents drugged me as a kid with hella prescription pills because they blamed me for their issues they still haven’t healed, and it made me gain a lot of weight. Also a need for control over SOMETHING.",
      "created_utc": 1708758850.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krw3oxe",
      "author": "Unusual-Egg-98",
      "body": "I got put on adhd medication that killed my appetite at the same time I got braces which made me terrified of having food stuck in my teeth. I basically realized that I could lose a ton on weight if I stopped eating and ran with that for a year until it became an ed.",
      "created_utc": 1708760207.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krw42u5",
      "author": "spaghettify",
      "body": "Rape :(",
      "created_utc": 1708760472.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krw4kyv",
      "author": "slavette6",
      "body": "CSA",
      "created_utc": 1708760822.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krw5l2d",
      "author": "cluelessin",
      "body": "A piece about Victoria Beckham in People magazine, it was about how she'd snapped back to 45kg weeks after giving birth. I became obsessed with weighing 45kg. The funny thing is I never really cared for Victoria Beckham. I was aware of her existence but she wasn't a celebrity I was interested in. I was 15/16",
      "created_utc": 1708761508.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krw5o5i",
      "author": "cluelessin",
      "body": "A piece about Victoria Beckham in People magazine, it was about how she'd snapped back to 45kg weeks after giving birth. I became obsessed with weighing 45kg. The funny thing is I never really cared for Victoria Beckham. I was aware of her existence but she wasn't a celebrity I was interested in. I was 15/16",
      "created_utc": 1708761567.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krw6j48",
      "author": "livv3ss",
      "body": "After quitting drugs I didn't have control of anything anymore (I was always the one evryone trusted w their drugs so I'd have control of my and everyone else's drugs usually) so drove myself to the brink of death w anorexia. Was also in an abusive relationship at that time too. I'm okay now tho",
      "created_utc": 1708762162.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krw75dg",
      "author": "slothscanbeslow",
      "body": "In 5th grade, I started at a new school and I was the 2nd tallest kid in the ENTIRE school. One day we were in this inflatable thing and one kid passed down by telephone to me that I’m fat and when he saw my reaction he started laughing. There was a lot of other things, but when I start restricting, I think of that.",
      "created_utc": 1708762600.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krw8z42",
      "author": "pinkienewbie",
      "body": "Superficially body image. But since being in treatment life long self esteem issues, childhood trauma, current relationships and a need for control is what is really fuelling it. It’s such a complicated illness 😔",
      "created_utc": 1708763903.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krw9f1q",
      "author": "Yuri_lolz",
      "body": "Once, me and my parents where going shopping, trying to find me nice jeans.I have an hourglass body shape, so its quite hard to find pants that are wide in the hips but tight in the waist.So me and my mom went back to the car with nothing.When in the car my dad asked if we bought anything.When I said no,he repla with \"Maybe if you ate less,and got your ass of the couch,those jeans would fit you\".I was crying Like crazy on the way back.I soon started eating less and excercising more.I wasnt even fat or anything.After some time i was 162-163cm tall and nearly 40kg.For a teen that already hit puberty at 9yo that was very dangerous bc my body already was a few years into puberty and now my body was in the fast growing era.My hair fell out and i couldnt have long nails.I had the body of a child living in the  famine in ireland.My heart could have stopped any minute honestly.The doctor said if i loose half a kg more she will put me in a psych ward.Now im healthy and accepting myself more.I just wanted to say this so anyone that is strugling.I will be here for you and you have the right to be healthy once again.I know how you guys feel.Its not rlly not worth it,to be a living skeleton,we one day will be one so for now lets live a little :') I wish everyone to have the courage to fight this killing ed. Keep fighting🫶🏻",
      "created_utc": 1708764215.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krwa3tt",
      "author": "brbrbrbruises",
      "body": "mainly feeling out of control from back to back traumatic events, developing ibs and drug induced appetite loss. \n\nif I’m losing weight hey atleast I’m doing something fucking well in my life.",
      "created_utc": 1708764715.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krwb9po",
      "author": "wittttykitttty",
      "body": "All the above",
      "created_utc": 1708765577.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krwf5ap",
      "author": "AwkwardShrimp0",
      "body": "My best friend, whom I absolutely idolised, was promoting an ed",
      "created_utc": 1708768400.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krwjt31",
      "author": "A888yra",
      "body": "Trauma plus the need to control something in my life, growing up with undiagnosed autism, hardcore bullying, being a perfectionist and only being complimented for my grades, etc.\n\nI kinda liked my body and I was a dedicated athlete, body image issues in my case actually appeared after my ED started (2019)",
      "created_utc": 1708771770.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krwoc0v",
      "author": "None",
      "body": "life + reading that book chic diet by kit olsen",
      "created_utc": 1708774884.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krwr6vs",
      "author": "heartshapedmoon",
      "body": "My desire to be thin and my OCD that didn’t let me eat even if I wanted to",
      "created_utc": 1708776685.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krwvpwd",
      "author": "Skhuko",
      "body": "Not sure if I have anorexia but it would be very severe depression “episode” after SA and massive cyberbullying. Was depressed for years but these particular events did it for me. I stopped eating for a few weeks to months (don’t remember) and everybody was so concerned about me. More than ever. My parents who always thought I was acting up, making things up, being a brat etc finally started being worried about me, and seeing that something’s wrong with me and that I’m **suffering**. I knew and I know it’s unhealthy but people pay more attention to me and I love fitting into XS or Chinese sized clothes.",
      "created_utc": 1708779231.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krwwad1",
      "author": "None",
      "body": "growing up fat",
      "created_utc": 1708779527.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krwzfqj",
      "author": "its_panda--",
      "body": "Being chubby in a country where most boys are skinny and fit. I hated it. Then I got ill and lost a lot of weight and people treated me so much better. I couldn’t allow myself to go back to default. Granted I slowly learned to get over it and just work out to maintain my weight. But I still obsess over it a little, though I don’t starve myself anymore.",
      "created_utc": 1708781104.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krx2hvn",
      "author": "impossiblegirl-97",
      "body": "I think it was wanting to be liked. And wanting to have control over that.",
      "created_utc": 1708782545.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krx4zhc",
      "author": "Speedyboi_6969",
      "body": "A really awful breakup. The lack of control and the stress was too much and the breakup made me feel insecure about myself as well so combined together it caused me to spiral.",
      "created_utc": 1708783670.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krx6bqs",
      "author": "None",
      "body": "loads of things. stress on stress on stress surrounded by diet culture and being told i’m fat and no one will love me as i’m fat and being out on diets at the same time covid followed by a traumatic breakup all together",
      "created_utc": 1708784260.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krx6urd",
      "author": "PatientEquivalent432",
      "body": "My mom being a narcissist and targeting my weight and then ocd and depression kept it fed",
      "created_utc": 1708784489.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krx8f5m",
      "author": "None",
      "body": "My last relapse was about needing control in at least one thing in my life, since I was starting uni. And when it started as a child was for self-harm purposes. In a way it was “I need to be sick so it shows that I’m mentally struggling” and it’s all related to my undiagnosed autism.",
      "created_utc": 1708785167.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxaod8",
      "author": "Aggressive-Piglet763",
      "body": "it's a cry for help. hoping someone notices because i can't ask for help myself, but then again, i dont want help, so it drives me crazy. Also, my sister is slightly chubby and very lazy so ive always felt the need to be better than her in every aspect of my life: Skinner,  not lazy, better job, and so much more hoping for my family to notice me since they've always loved her and treated her so well and I'm just nothing to them. No matter what i do, i will always be nothing to them. I'm the second child and my family's biggest regret. I feel like I have to make myself worse, hoping for one of them to notice I'm suffering. I've tried speaking up about it, and it always gets swept under the rug.This is how it's been my entire life. Only one of my family members have ever showed me love and that is my great grandmother and now she is suffering from dementia and won't let anyone over to see her and I'm scared she is going to forget about me. I've done so much harm to myself trying to make my family love me, and they won't even look in my direction. They all see me as nothing but a crazy druggie. The point is i became anorexic for an attempt to be loved by any of my family members. Nothing will ever be enough. i don't exist to them.",
      "created_utc": 1708786103.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxczot",
      "author": "Peanut2ur_Tostito",
      "body": "I was constantly made fun of by both of my parents for my weight & called names. They'd even try to give me certain things to make me gain since I was little. That & trauma.",
      "created_utc": 1708787029.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxdso3",
      "author": "iampurechaos",
      "body": "idk its been on and off since i was a kid and i dont think its been anything specific it just kind of happens",
      "created_utc": 1708787347.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxedu4",
      "author": "Wolfiexox20",
      "body": "I was always on the heavier side in my teens but and went back and forth on eating too much or too little. My mother and I never had a good relationship and would comment constantly on my body. Often when she saw me eating she would make snarky comments on my weight and then when I was dieting: “why are you doing that you are not fat. The mind games were real. When I got my first boyfriend I was 130 at 4’11 and he struggled to pick me up and would make comments on how I should lose weight. I had zero self-esteem and listened. Went really hardcore with it for 3 years till I was literally fucking dying. Looking back now I think they were narcissists because it was just the mind games that something was always wrong with my physical appearance no matter what I did.",
      "created_utc": 1708787577.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxff6k",
      "author": "Yourstrulycorina",
      "body": "Trauma and no one really caring- I noticed if you put weight on… everyone is fine with it because you are “healthy”- even though binge eating is a terrifying coping skill- but when your weight plummets- THEN people/ family/ friends realize “something isn’t right”… and at least pretend to care or ask what is wrong…",
      "created_utc": 1708787982.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxfkw9",
      "author": "qiarafontana",
      "body": "My mom was obsessed with controlling my weight since I was a child. So it was normal for me, I was already in a downhill and then something very traumatic happened to me when I was 15, which just made it worse, I’m 28 years old now and still unable to live a life with no worries over my weight.",
      "created_utc": 1708788043.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxfkyi",
      "author": "Yourstrulycorina",
      "body": "It’s also a free form of self-harm and when I feel suicidal and really want to just end it- it’s a reason to keep going and get up in the morning.",
      "created_utc": 1708788043.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxh84m",
      "author": "None",
      "body": "It’s genetic for me, my mom had it (deceased). A FUCK TON of other reasons.",
      "created_utc": 1708788673.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxhyf8",
      "author": "coleisw4ck",
      "body": "Fucking every person I hate people",
      "created_utc": 1708788949.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxip5p",
      "author": "just-be-original",
      "body": "Being an overweight kid",
      "created_utc": 1708789228.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxk1gr",
      "author": "DragonflyLullaby",
      "body": "my mom told me to suck in my stomach and after that i focused on my weight more than i should and a few years later it developed into anorexia",
      "created_utc": 1708789727.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxla52",
      "author": "RileyDick3",
      "body": "i have a hard time feeling hungry and i kinda forget about the whole stop to eat something and that snowballs",
      "created_utc": 1708790183.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxrdg5",
      "author": "Individual_Resort_38",
      "body": "Always thin, never had normal periods, extremely fatphobobic, yes I admit it. Terrified I will lose control and all social status of being thin because I am also aging. Getting a facelift just to keep my social currency of looks …   TRUTH",
      "created_utc": 1708792387.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krxs8c8",
      "author": "Warm_Journalist_5566",
      "body": "TW ABUSE\n\nI was raped at 8 years old and I was an overweight kid too. So as a every overweight kid I growed up listening coments about my body from family, friends, classmates... So I wanted to lose weight, but I never think that the idea of lose \"just some weight\" will become turbious for me with time. But because of trauma I had a strong inner hate and wanted to \"disconnect\" from my body, basically destroy the past version of myself that was abused. I never saw me \"fat\" when I was underweight, I just wanted to be another person, feeling like I was living in another different body rather that one that I had as a abused child. So yeah, basically trauma that lead to a enormous self hate and self-destructive attitude. The feeling of having control over my body, feeling like I was the only one who decided what and how much (food) goes in and out (purging) in my body, even if was in a self destructive way, played a big rol in my anorexia too!",
      "created_utc": 1708792690.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kry1a42",
      "author": "Consistent_Mode425",
      "body": "I don’t know to be honest. I feel there’s a lot of culminating factors that in the end led to it.",
      "created_utc": 1708795838.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kry1xhz",
      "author": "Miss_paris_22",
      "body": "Hate for myself. I felt couldn’t get anything right in my life , I’ve lacked in social skills and always had the desire to remove myself from any situation. The internalized hate fueled me to destroy my body , at some point I’ve started restricting and barely eating sort of a like a punishment.",
      "created_utc": 1708796068.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kry3s8z",
      "author": "markthehorizon",
      "body": "I felt like most of what was happening in my life was out of my control and I started dating someone who was a lot thinner than me and used to suffer from anorexia. I was unintentionally losing weight and liked the way it felt, so I ramped it up and started intentionally losing weight. Then I started intentionally losing weight in the form of an eating disorder.",
      "created_utc": 1708796722.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kry5amz",
      "author": "themfdancingqueen",
      "body": "MEEEEE",
      "created_utc": 1708797250.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kry8qyp",
      "author": "blaanncro",
      "body": "i was always bigger growing up because of inflammation from eating foods i was allergic to, i can’t remember a time where i wasn’t worried about my weight or how i looked. it was always a body image thing, and then when i began to lose weight and learn about calories i began controlling things, it got so bad in high school i remember at one point i wrote down (and felt guilty) about eating 10 skittles because my blood sugar was low and i have chronic migraine. it was body image and standards of beauty",
      "created_utc": 1708798453.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krycewv",
      "author": "Sea_Nature9500",
      "body": "My mom is anorexic. She rigidly controlled my food intake for my entire life and I was forced to have weekly weigh-ins to determine what my weekly meals would be. I would eat 800 calories a day, if that. There was nothing in our fridge but a lettuce bag at all times. There was a fridge in the basement too in a locked closet and it was filled with food for my dad I wasn’t allowed to have. I would try to stick things in the lock to jimmy it open. I was never, never anything but anorexic. I don’t know how to eat even today. Sigh.",
      "created_utc": 1708799732.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kryfrz2",
      "author": "melaniemuffin",
      "body": "My dad leaving on Christmas and COVID 19 😁😁 also bullying 😆😆😆",
      "created_utc": 1708800902.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krvvb6u",
      "author": "QueenAlana2001",
      "body": "Victoria Secret Models",
      "created_utc": 1708754809.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kw98hbd",
      "author": "kilili_76",
      "body": "TW\n\nA big amount of weight I already lost because of an unrelated topic, and all the \"positive\" backlash for it from everyone. Ex: omg you look so better now or you look so prettyyy... . peoples comment on my new body and how they were proud of me for the weight loss (i could've fucking died) + My mother that started a diet.",
      "created_utc": 1711231147.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kzn3o6w",
      "author": "Currently-crying-sh",
      "body": "I was always pretty skinny and never really gained weight until 8th grade and I started having stretch marks all over and didn’t fit into my smaller clothes so I needed to stop eating so much bc I don’t know why I was getting bigger so I stoped",
      "created_utc": 1713160184.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l0m2kyl",
      "author": "NoDistribution1757",
      "body": "I was always a bit bigger then the other people in my class and I wanted to be thin like them so I could fit in.",
      "created_utc": 1713716196.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcybfzq",
      "author": "chayton1234",
      "body": "Ocd, SA and low self esteem",
      "created_utc": 1720849881.0,
      "score": 1,
      "context": []
    },
    {
      "id": "linlp3y",
      "author": "isahhhhh33",
      "body": "Genuinely? A bunch of reasons (this is gonna be super SUPER long, IM SO SORRY)\n\nI was a very naturally skinny kid when I was about 6-8 everything was great, I ate a TON of shit I didn’t need, everything was fine, I did a lot of exercise too and I loved it. And btw my family has always been a very looks judging family. Till I went into elementary school and found myself victim of like kids bullying me just because I was different and I did different things that them (I’m autistic, it’s not that noticeable now but as a kid apparently it was), then when I turned 9 I decided I was too lazy to do sports and I actually wanted to do more interesting stuff for me like drawing or whatever, and so I did.  I naturally gained  weight since I still ate like shit (like almost every kid does), but I couldn’t care I didn’t even notice. However when I was about ten i remember going to my grandmothers house (who Is sadly a terrible person for no reason) and I remember her telling me how I had gotten sm fatter and how I looked like a bad and unfemenine, how I needed to be more like my cousin, who was a tall skinny girl, and I did wanna be her so bad. Anyways. When I turned about 11 we got sent to quarantine, I felt very anxious all the time, I was young however I did understand that the pandemic was smth huge and I was scared of it being like that forever. I used to eat A LOT. During online classes, at night, morning, noon, anytime of the day I was eating. I got very much so fatter, but this time I actually did feel disgusted with how I looked. Then in 2020-2021 I made a small friend school group. Then that same 2021, the first year of middle school, a few weeks after starting school I got “outed” because our group chat leaked. All my friends dumped me, all of them, I was completely alone. I remember me trying to understand why and me trying to stay being friends, them telling me I was a freak and how my personality was un likable. \n\nThen I got into depressive episode, I was completely devastated, so I stopped eating, not even noticing it, just because of stress my appetite was gone. Then about a month after i remember ppl telling me how good I looked and asking me what o was doing, I was so confused until I realized I was no longer “fat”. That for some reason made me realize that ppl “liked” me if I was skinny, but also made me like myself when I wasn’t eating. Then, that exact week I decided to do it on purpose I wanted to see myself being “perfect”, I started skipping lunch and stuff, but it never was like actual fasting.\n\nOver time it turned more obsessive and more and more and I actually started fasting and purging when accidentally eating what I considered was “too much”. Then my life got a lil better, I made more friends, this was in 8th grade. I was better I even got a gf and all and I was hyped that someone could love me.\n\nEverything turned upside down when that same person tried to SA while we hanged out in her bedroom. I remember it took me about a month to speak up to my mother about it, I felt so guilty, even tho it wasn’t my fault. Then right before summer I broke it up with her. And that summer I just went into the worse place my mental health had ever been, I was starving for so long on purpose and at the same time pushing myself to the brim playing tennis about 6 hours per day, fueled by absolutely no food, only gum. But after that summer and like 3 suicide attempts and a GOOD fucking long time in therapy i feel a lot better and igs my body is recovered, even tho now i sorta feel disgusted by it slightly, idk i feel a lil off by it.",
      "created_utc": 1723946219.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkhyq3n",
      "author": "chloe_xo-11",
      "body": "never feeling pretty, i also ride horses a lot and i fear being to heavy for my pony as i couldn’t want anything less than to hurt him",
      "created_utc": 1724937635.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ll9oezo",
      "author": "ninaaaaws",
      "body": "A variety of bullying and borderline SA events in my childhood and early teens absolutely destroyed my self-esteem. My friend-group consisted of extremely intelligent over-achievers; while I was by no means stupid, I felt like the 'dumb smart-person' in the group. I felt that I had no value to anyone and the only thing I could do well and get praise for was losing weight.\n\nSo I did. God damn, did I ever.",
      "created_utc": 1725345549.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ls43kst",
      "author": "ChicaRota",
      "body": "Whole childhood was nothing but trauma and abuse from lots of people. Finally pulled myself out and chose a partner, but that person repeatedly broke my heart. He lusted & chased “real anorexics” to the point there was a main problematic girl who’s number I had to block. Several years later and states away & god knows how many times I’ve cried hard for days without eating & he unblocked her number because he missed her. Tried to defend their connection & that’s the nail in the coffin for me. He has chosen her repeatedly and I have chosen slow suicide.",
      "created_utc": 1729031926.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1wc8m8",
      "author": "Leather_Penalty_5123",
      "body": "Feeling out of place and hating the skin on my body. Started off with desperately wanting to have clear skin so I started to cut out saturated fats, sugars, carbs and gluten. \nThen it lead to feeding into wanting to look fit/lean and I felt as if I had no control over anything that was going on in my life, everything was spiralling and the only thing I could control was the calorie counting and the weight on the scale. \nI’ve always been very disciplined (I did ballet for 10 years which definitely had a huge impact) and I almost couldn’t believe how easy it was to keep up with my new routine and to restrict heavily, but it’s since developed into orthorexia and now I’m currently in IP.. and terrified to eat any ultra processed food and can only eat clean/organic foods/salad variations. I can’t allow myself to eat anything else because I’m terrified I’m going to get sick from it since my body can’t handle the food we have to eat in EDU, everytime I get home leave I fall back into my old habits. \nPart of me wants to change but I have only ever known this life and to imagine life without it is terrifying, even when working with my therapist I always feel like I’m fighting a losing game.",
      "created_utc": 1734115027.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krvfwzo",
      "author": "Ready_Savings_4656",
      "body": "Getting covid and my grandma dying",
      "created_utc": 1708746958.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kryi907",
      "author": "lojolovi",
      "body": "OCD, Comments from family and social pressure",
      "created_utc": 1708801778.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kryip5u",
      "author": "None",
      "body": "Lack of control, childhood trauma, and I was too scared to leave my room so I went without food a lot as a kid and it set up a bad pattern.",
      "created_utc": 1708801937.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kryj9f1",
      "author": "angelcults",
      "body": "I was severely abused at home when I was 16, and based my self worth on my “perfection” as it was the safest thing to do and the only time I didn’t get devalued or degraded at home. once I got out, I was determined to have a “perfect pretty life.” I had been neglected, and deeply craved outside validation. I was also malnourished as a kid due to being starved, so when I put on a healthy amount of weight, my self image was skewed. I didn’t feel good enough unless I was the “best” person in the room. There was always the next thing I thought would make my life magically perfect and better if i achieved it, and being skinny became one of them. I was deeply, deeply insecure and scared. When I did receive compliments and validation from my disordered ways, it really locked it in and spurred me forward, all the way to today, where I still require that external validation, attention, and “perfection.” \n\nIt didn’t help my teen mother was severely insecure as well despite being gorgeous, and I always saw her fussing in the mirror, putting herself down, getting plastic surgery and going in crazy diets. She also put me downif I didn’t meet her aesthetic standards, saying we were supposed to be an “attractive” family.",
      "created_utc": 1708802134.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krypibk",
      "author": "Crafty_ClosetMonster",
      "body": "I don't remember an actual trigger. I did, however, find an old diary several years ago that I kept in middle school,  maybe 7th grade-ish, where there was an entry about how I had \"been gaining weight like crazy lately\" and was now triple-digit pounds. I've struggled with anxiety since toddler years (I have proof) but depression didn't hit until sophomore year in high school. I never had more than a few close friends, and was picked on and bullied from 5th grade on for being a \"too smart for my own good\"  a \"goody-goody\",  \"tattle-tale\"  and \"by-the-book\" kind of kid with (at the time) undiagnosed ADHD. Teachers said I always tested well, but often daydreamed in class and had to be in control of any group assignments. Looking back on this 25-ish year old entry, seems like a wide combination of factors. I don't think an eating disorder ever has one 'specific' trigger, more like a culmination of mental, physical, and emotional factors that result in a higher percentage of risk to develop one, with one or more small factors that tip the metaphorical scales.",
      "created_utc": 1708804366.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kryqgln",
      "author": "KommunistAllosaurus",
      "body": "Fear of rejection and not being able to attract people with the standards that I like, and then the aesthetics",
      "created_utc": 1708804712.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kryx9lr",
      "author": "TRKevinSpacey",
      "body": "I got sober from alcohol after being an alcoholic for a decade but ive always had self image issues. I got ana at 27. With alcohol i was able to drown out all my bad thoughts of myself. Once i got sober i felt like i had no way of dealing with emotions i was just sad all the time. Then suddenly i just said to myself “i want to lose weight and fast” and i did and then i got high from not eating. I felt powerful. I just never want that to go away",
      "created_utc": 1708807151.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kryxnqk",
      "author": "cxless",
      "body": "failed math for the first time ever in middle school. it started out as giving myself “rewards” like candy bars or something for studying, but when my grades didnt improve i went overboard and refused to let myself eat at all until i met a certain expectation. as i got older my reason for restricting evolved into something else, but ultimately a 64 on my report card was the start of my downfall.",
      "created_utc": 1708807294.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kryzgbx",
      "author": "Ok_You1594",
      "body": "S**ual ab*e. \nI wanted to look as un-feminine as possible and shrink myself to look undesirable and unattractive. It was also a way of coping with things out of my control",
      "created_utc": 1708807939.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kryzwu9",
      "author": "No-Manager4052",
      "body": "im not even into kpop, but watching the kpop girlies be that skinny on twitter threads, i couldn't believe they didn't have any fat visible even when moving, i was so ???\nEventually i ended up having a body like theirs and worst, then i understood it wasn't that difficult.\nAlways been skinny and i had the pressure of keeping with that because i was growing up and gaining a little weight, my family always making comments about it even though it was normal and still an underweight.",
      "created_utc": 1708808105.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krz2plk",
      "author": "X_Kate_",
      "body": "I was also tall and skinny as a child. My family ways said I needed fattened up. While nearly every single female family member was following fad diets and slimming world/weight watchers. Re enforcing that being fat was bad. I became terrified of gaining weight. I do think my childhood sexual abuse plays a part. I was diagnosed at 16 I’m now 27. It started as bulimia but I’ve been diagnosed anorexia b/p or purging subtype for 8+ years. \nI’m autistic too which means I thrive with routines and rules so it’s just became a massive part of my life.",
      "created_utc": 1708809124.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krz5290",
      "author": "mybrainisfr1ed",
      "body": "i’ve always struggled with negative body image, even when i was a child. puberty was also a huge trigger as i started gaining weight and after dieting gained even more than i lost. however, the biggest turning point was lockdown and being terrified of gaining even more due to staying home. started with “innocent” calorie counting and tracking my steps and spiralled into nasty shit.\nedit: in recovery for 2 years already",
      "created_utc": 1708809967.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krz5m40",
      "author": "Thisladydoesntcare",
      "body": "My mom freaking out about her weight, calling herself a \"whale\" if she gained any weight, eventually when I was 11, she started calling me fat, I just hadn't hit my growth spurt.  But ana plus growth spurt made her mad angry at me for a while and I never understood it all till now, much later looking back",
      "created_utc": 1708810163.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzb1wl",
      "author": "chl03xk",
      "body": "i was 200 pounds at 13 and fell on pro ana tumblr. lost weight and loved the control i could have. then everytime i needed some control, some self serving goals, i’d fall back. nearly 10 years later it still consumes me",
      "created_utc": 1708812136.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzbx8d",
      "author": "lexsealeann",
      "body": "I was 11 years old sitting on a pool ladder with my childhood bestfriend watching a video of an emaciated woman and I told her “I’m gonna start”. Just like that",
      "created_utc": 1708812463.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzco48",
      "author": "luvcatk",
      "body": "saw that my bmi was overweight so i starved myself so here i am and now i’m underweight",
      "created_utc": 1708812740.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzcz22",
      "author": "k1rts",
      "body": "maybe a cliche but i think it was a mix of pro ana websites and a bunch of childhood-teenage trauma… like had i not gone on the websites im sure i would be using something else as a crutch. they were kinda like finding gold at the time if that makes sense, was the only thing that ever made me feel good about myself – even if it was temporary",
      "created_utc": 1708812852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzdsmt",
      "author": "Un-Happy_Lil-Lady_94",
      "body": "Dukan Diet!",
      "created_utc": 1708813155.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzdvtb",
      "author": "Godblessmeitssummah",
      "body": "Being bullied by my siblings and kids at school when i was younger",
      "created_utc": 1708813187.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzlbcd",
      "author": "Keep_moving77",
      "body": "Ever since my Gymnast days I’ve always known I had a problem with under eating & when time in my personal life would get really tough to deal with & couldn’t control I would stop eating however mostly managing to keep a lock on it, that was until COVID hit & as a ex nurse & someone who was travelling heard about it in late December 2019, by January my doctors were telling me to be careful ( I have blood & bone cancer called Multiple Myeloma ) They were telling me to limit my travels & try not to come into contact with people who have just got back from travelling. That scared me & when it was everywhere in the news, online & everyone talking about that I really started to loose it mentally,.. I didn’t trust any food that didn’t already come wrapped - like bananas & nuts - that was pretty much my diet ( even really now ) Because of my other health issues my immune system was highly compromised so was told by my team of Drs that I had to self isolate - I had just finished with a partner of 7yrs & lived on my own, this combination has led me to today where I am now on a 2wk watch & wait Referal for upper GI Cancer ( Tummy cancer ) I know I have caused a lot of damage from my eating habits or lack of but COVID , living on my own, isolation & having OCD around germs & some foods anyway sent me down this path! I still haven’t fully got any help but just this wk finally my local Eating disorder clinic has been in contact after being on its list mostly throughout COVID & up until now. At present I feel out of control with my health & eating is the one thing I have control over. I have everything crossed that these tests coming up prove my bad thoughts wrong. I want a better relationship with food & to get better. Am a newly joined member so hopefully I can find some support here. Sorry for the ramble guys🙋🏼‍♀️",
      "created_utc": 1708816020.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzmpv2",
      "author": "Trexgym",
      "body": "Not one thing but many . Parents , toxic diet culture, trauma , ocd , brain hormones messed up, bullying, depression, Covid , grief , need for control, and etc",
      "created_utc": 1708816576.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzrh2m",
      "author": "CryptographerOk1210",
      "body": "honestly being body shamed younger and then being surrounded by diet talk and society standards on social media.\nit began to break me down and i felt i needed a sense of control in my life",
      "created_utc": 1708818486.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzrp6z",
      "author": "Constant_Truth671",
      "body": "Modeling , social media thinspo and adderall abuse",
      "created_utc": 1708818577.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzubq6",
      "author": "Aliceisdead1234",
      "body": "Apple shape body. Tired of crying and hating how I looked around my midsection. Turned from highly restrictive diet to nothing lost ever being enough, ever looking enough. Also, skinny mom who doesn’t stop with body comments",
      "created_utc": 1708819634.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzwugl",
      "author": "Snoo-99235",
      "body": "I gained about 12 pounds graduallyand didnt notice till all of a sudden. On my 5'3\" frame, it's a lot. I had been eating big meals a day with no excersise.  I started feeling self conscious of my double chin and thigh gap disappeared. I got super depressed all of a sudden. Cut down to 1 meal a day. Gradually got worse when I lost all 12 pounds plus more. Started to become obsessed with my weight and body checking. Also another factor is that my endometriosis got worse and I would (and still do) get severe abdominal/ovarian pain when I ate a big meal.",
      "created_utc": 1708820640.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krzy4th",
      "author": "artpopblondie",
      "body": "lack of control in my day to day life, trying to find my spot in life, never being good at anything other than being an excellent student and as well as a perfectionist, maybe my ocd and anxiety too, growing up in an almond household, always hard on myself and always saying i have no excuse to be anything but the best at what i want in life, always very disciplined. cautious and observant of every part of myself and others, fear of change, fear of growing up. fear of not needing to be nurtured. fear of my pain going unnoticed, like it didn’t hurt bad enough if it didn’t cause a scene yet i’m so secretive.",
      "created_utc": 1708821152.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks03kgc",
      "author": "None",
      "body": "I was a gay child. So if I were like a woman I should be thin to be at least beautiful.",
      "created_utc": 1708823356.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks05i2f",
      "author": "2timepartytopper",
      "body": "Boys.",
      "created_utc": 1708824144.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks0ctu3",
      "author": "Gaylordalleigh",
      "body": "Social media.",
      "created_utc": 1708827180.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks1fcvm",
      "author": "Entire-Prompt-7087",
      "body": "Being morbidly obese my whole life and then not knowing when to stop losing weight paired with a toxic relationship thrown in at some point :)",
      "created_utc": 1708846835.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks1lli1",
      "author": "Maven-Square",
      "body": "Falling out of love with my job and this was compounded by an ankle injury from running that sent me into reducing what I was eating",
      "created_utc": 1708851135.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks2176l",
      "author": "dank_birb",
      "body": "Used to be a skinny teen. Body doesnt stay like that of course. People start to notice/mention it.\n\nI always felt it was a good thing about me, being in crop tops casually, people always telling you ur thin, felt good. So when that stopped, i felt like i had nothing going for me, it was the only good thing about me. So it slowly just, i dont know what happened between then and now, but my desire to be \"skinny and pretty\" began to fill my life slowly.",
      "created_utc": 1708862285.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks26ao3",
      "author": "Lalalalasnoopy",
      "body": "Kpop.",
      "created_utc": 1708865336.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks2plvy",
      "author": "None",
      "body": "i thought it was vain reasons, wanting to get abs and be liked by boys. it's been almost a decade now and i've done a lot of self work and i can confidently say it's how my mother was extremely emotionally distant and neglectful, she totally rejected any idea that her daughter was struggling. i was also always ignored, put down and starving myself (or binging) was a sense of control i tried to take back.",
      "created_utc": 1708874029.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks3a4fd",
      "author": "4st7",
      "body": "I fell into restricting off and on as a kid and teenager and I think it stemmed from growing up very poor and feeling shame around my family’s class status. Being anorexic made me the opposite of what everyone pictures poor Americans as. I had “self control”. I wasn’t a “slob”. It was quintessential shame based behavior. \n\nIn 2021, when I was 24, I had been pretty much recovered for about 4 years when I was assaulted by someone I considered a close friend after he had put something in my drink to make me black out. After this, I developed a very toxic fixation on dignity that I am still working on. I saw bodily functions as undignified (this is bc I was very ill. Bodily functions simply mean you’re alive!) and thought that if I didn’t eat, I wouldn’t smell or sweat or need the restroom or anything I considered “undignified” in my sick mind. This escalated to a hospitalization and eventually suicidal thoughts. I’m recovering now but I damaged my organs really badly and wasted so much time I can’t get back.",
      "created_utc": 1708881284.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks3iq4v",
      "author": "pgkitten",
      "body": "i was a very obese kid. bullied and had no friends, very little self esteem. depressed. freshman year of high school, decided i was done with being miserable and wanted to be noticed. i told myself i'd get down to a normal weight. once i got there, i wanted more. restricted. used to love myself when i was only slightly underweight, now all i know is ana. i'm never happy. i'm also in a binge-restrict cycle, so there is no climbing out of this hole i've dug for myself.",
      "created_utc": 1708884197.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks4vkm0",
      "author": "lemonfarmercircus",
      "body": "My dad giving me a lecture when I was a teenager, every time I had mcdonalds or chocolate etc. Just kinda stuck to me, and ya know it was just the time my puberty started so naturally, my body also started to change",
      "created_utc": 1708901204.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks5i9iz",
      "author": "Lady-Madrid",
      "body": "I struggle with socializing and interpersonal relationships in general. I always feel like there is something wrong with me, so I try to compensate with other things like being as thin as possible. \n\nI think I also have genetic predisposition and the typical anxious, rigid personality.",
      "created_utc": 1708909979.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks7wcll",
      "author": "on-cue",
      "body": "mostly a hatred for how people perceive me. i started puberty at 7 and had double d’s by the 4th grade. couple the hormones, school teasing and a history of sexual assault and it’s pretty obvious why im like this. people like somewhat thin girls with a fat ass and tits. if i can be disgustingly thin to the point where men aren’t just not interested in me, but are actively grossed out by me, i might be able to breathe for once. \n\ni love my body. i have moments of hatred towards it, obviously, but at the end of the day i don’t want to do this to myself. but men are men and they’ll stick their dick in anything. it’s about survival.",
      "created_utc": 1708956644.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks8umbh",
      "author": "Clementiiiiny",
      "body": "Diet culture + trauma, I grew up with my mom and sisters always doing some kind of diet along with my granddads wife calling my family fat whenever they would visit due to hearing about diets and 'acceptable' sized from such a young age it definitely affected me.",
      "created_utc": 1708968693.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ksb5om0",
      "author": "Responsible_Item9277",
      "body": "Good ole gymnastics and horrible coaches who had very strict food monitoring at a very young age (about 6) was the start of it all- I was homeschool until 8th grade to do gymnastics full time and my parents gave complete control to my coaches. I also developed really bad OCD. then it just became my identity.",
      "created_utc": 1708997235.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ksdzofs",
      "author": "petitetendresse",
      "body": "Losing 80 pounds and getting addicted to the feeling. The more I lost the more powerful I was.",
      "created_utc": 1709048509.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ksecy2j",
      "author": "ajjanaajjana",
      "body": "Almond mom :((",
      "created_utc": 1709052960.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ksk8j4j",
      "author": "Actual_Ad_5373",
      "body": "intitally mine was just wanting to be skinny and the thigh gap trend etc. I then started dieting together with my ex which actually spiralled us both into am ed.\n I now think that it was/is also a need to control something (which became my weight) when I couldn't control external stressful factors",
      "created_utc": 1709140742.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krxq79d",
      "author": "Extension-Lychee-296",
      "body": "Living with an abusive person’s abusive family and feeling guilty for eating their food since they were already doing so much for me by letting me live with them. I became skinnier than I had been my entire life and then made the choice to become vegetarian to grasp at some sort of control that I lacked. Those were the roots.\n\nThe most recent relapses I feel like stemmed from a lack of satisfaction with my body but I was told it could have been because I didn’t have any other problems going on so I created them.",
      "created_utc": 1708791966.0,
      "score": 1,
      "context": [
        {
          "id": "kruhs3i",
          "author": "AutoModerator",
          "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
          "created_utc": 1708732892.0
        }
      ]
    },
    {
      "id": "krzcznj",
      "author": "Dr_DG_Darkness-MDM",
      "body": "Being overweight all of my childhood and watching my friends get asked out and have boyfriends and get asked to dances and never getting asked myself. \n\nThe straw that broke the camel's back was prom. Size eighteen, all of my friends had dates to prom and/or were a part of a group... I spent the entire day by myself, got ready by myself, went and danced the choreographed dance with my friend, hung out for a bit, didn't get asked to dance, all of my friends bailed to go have sex with their dates, and I drove myself home.\n\nI finally had my first ever kiss when I was 18, about 60 lbs lighter, and heavily disordered. But at least someone finally noticed me and wanted to be with me.",
      "created_utc": 1708812858.0,
      "score": 1,
      "context": [
        {
          "id": "kruhs3i",
          "author": "AutoModerator",
          "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
          "created_utc": 1708732892.0
        }
      ]
    },
    {
      "id": "krunp9r",
      "author": "lizzy-grantluvr",
      "body": "same",
      "created_utc": 1708735189.0,
      "score": 9,
      "context": [
        {
          "id": "krukcse",
          "author": "SecondaryPosts",
          "body": "Feeling a lack of control in my life, combined with a traumatic event and sustained extreme stress. Body image never played into it for me.",
          "created_utc": 1708733896.0
        }
      ]
    },
    {
      "id": "krw9xi7",
      "author": "brbrbrbruises",
      "body": "same",
      "created_utc": 1708764587.0,
      "score": 7,
      "context": [
        {
          "id": "krukcse",
          "author": "SecondaryPosts",
          "body": "Feeling a lack of control in my life, combined with a traumatic event and sustained extreme stress. Body image never played into it for me.",
          "created_utc": 1708733896.0
        }
      ]
    },
    {
      "id": "krw6csd",
      "author": "SnooRevelations7103",
      "body": "Same",
      "created_utc": 1708762040.0,
      "score": 7,
      "context": [
        {
          "id": "krukcse",
          "author": "SecondaryPosts",
          "body": "Feeling a lack of control in my life, combined with a traumatic event and sustained extreme stress. Body image never played into it for me.",
          "created_utc": 1708733896.0
        }
      ]
    },
    {
      "id": "krus2uo",
      "author": "rebeclectic",
      "body": "Same",
      "created_utc": 1708736916.0,
      "score": 4,
      "context": [
        {
          "id": "krukcse",
          "author": "SecondaryPosts",
          "body": "Feeling a lack of control in my life, combined with a traumatic event and sustained extreme stress. Body image never played into it for me.",
          "created_utc": 1708733896.0
        }
      ]
    },
    {
      "id": "krv7bi3",
      "author": "crescentmoon_n",
      "body": "Same",
      "created_utc": 1708743196.0,
      "score": 6,
      "context": [
        {
          "id": "krukcse",
          "author": "SecondaryPosts",
          "body": "Feeling a lack of control in my life, combined with a traumatic event and sustained extreme stress. Body image never played into it for me.",
          "created_utc": 1708733896.0
        }
      ]
    },
    {
      "id": "krw5orf",
      "author": "robson__girl",
      "body": "same",
      "created_utc": 1708761580.0,
      "score": 6,
      "context": [
        {
          "id": "krukcse",
          "author": "SecondaryPosts",
          "body": "Feeling a lack of control in my life, combined with a traumatic event and sustained extreme stress. Body image never played into it for me.",
          "created_utc": 1708733896.0
        }
      ]
    },
    {
      "id": "krx6iml",
      "author": "None",
      "body": "Exactly this",
      "created_utc": 1708784344.0,
      "score": 6,
      "context": [
        {
          "id": "krukcse",
          "author": "SecondaryPosts",
          "body": "Feeling a lack of control in my life, combined with a traumatic event and sustained extreme stress. Body image never played into it for me.",
          "created_utc": 1708733896.0
        }
      ]
    },
    {
      "id": "kryjk0c",
      "author": "TheGingerGiraffe68",
      "body": "Same",
      "created_utc": 1708802240.0,
      "score": 3,
      "context": [
        {
          "id": "krukcse",
          "author": "SecondaryPosts",
          "body": "Feeling a lack of control in my life, combined with a traumatic event and sustained extreme stress. Body image never played into it for me.",
          "created_utc": 1708733896.0
        }
      ]
    },
    {
      "id": "krzyjxr",
      "author": "nihilist_fox",
      "body": "SAME",
      "created_utc": 1708821324.0,
      "score": 2,
      "context": [
        {
          "id": "krukcse",
          "author": "SecondaryPosts",
          "body": "Feeling a lack of control in my life, combined with a traumatic event and sustained extreme stress. Body image never played into it for me.",
          "created_utc": 1708733896.0
        }
      ]
    },
    {
      "id": "kruzkuj",
      "author": "octoteach17",
      "body": "This, absolutely 100%. Same girl, same. When I developed anorexia at 15, I thought \"I can't control my fucking family, I can't control these mean girls/teachers/etc., but I CAN control food and if anyone gets in my way, fuck 'em!\"",
      "created_utc": 1708739960.0,
      "score": 28,
      "context": [
        {
          "id": "kruiwxi",
          "author": "htesssl",
          "body": "To simplify it drastically, chronic internalization of trauma coupled with the thin ideal that is perpetuated in western culture. Also as a means to have control over something in my life. I could probably think of a few more things too.",
          "created_utc": 1708733337.0
        }
      ]
    },
    {
      "id": "krwfssz",
      "author": "NoHope8406",
      "body": "bro this is the best explanation ever",
      "created_utc": 1708768884.0,
      "score": 7,
      "context": [
        {
          "id": "krukd81",
          "author": "Decent-Efficiency-21",
          "body": "To be completely honest it started out as just a dare to challenge myself to see if i could really do it as much as i thought i could, but then i was suprised when i found out i actually could and did and started liking it alot, but then it became addicting and i started losing control and it no longer became a dare but a manifestation of all my negative emotions and a way of having control and the worse i feel the more weight i lose, i didn't expect to lose this much weight i didn't think i could but now that i did it feels almost impossible to let this \"high\" go to let everything I've ever wanted go even if it kills me",
          "created_utc": 1708733901.0
        }
      ]
    },
    {
      "id": "kryjuom",
      "author": "TheGingerGiraffe68",
      "body": "I was thinking this but afraid to comment it. Like I said it as a joke like Oo look at me I could develop an ED and then it just manifested in denial and keep on laughing my way through it until I was hospitalized 3 times",
      "created_utc": 1708802344.0,
      "score": 6,
      "context": [
        {
          "id": "krukd81",
          "author": "Decent-Efficiency-21",
          "body": "To be completely honest it started out as just a dare to challenge myself to see if i could really do it as much as i thought i could, but then i was suprised when i found out i actually could and did and started liking it alot, but then it became addicting and i started losing control and it no longer became a dare but a manifestation of all my negative emotions and a way of having control and the worse i feel the more weight i lose, i didn't expect to lose this much weight i didn't think i could but now that i did it feels almost impossible to let this \"high\" go to let everything I've ever wanted go even if it kills me",
          "created_utc": 1708733901.0
        }
      ]
    },
    {
      "id": "krwcizr",
      "author": "lesbianrelstionships",
      "body": "omg the same happened to me! also a traumatic event happened in my life and I lost my appetite, after that combined with what you just said I stopped eating all together",
      "created_utc": 1708766489.0,
      "score": 7,
      "context": [
        {
          "id": "krup1s8",
          "author": "None",
          "body": "Was alr skinny since forever. People only ever just complimented me on my skinnyness. So i felt like I had to stay skinny :) lowkey drove me nuts but im better than ever now",
          "created_utc": 1708735712.0
        }
      ]
    },
    {
      "id": "krvskqd",
      "author": "carseatheadass",
      "body": "me too!",
      "created_utc": 1708753249.0,
      "score": 5,
      "context": [
        {
          "id": "krup1s8",
          "author": "None",
          "body": "Was alr skinny since forever. People only ever just complimented me on my skinnyness. So i felt like I had to stay skinny :) lowkey drove me nuts but im better than ever now",
          "created_utc": 1708735712.0
        }
      ]
    },
    {
      "id": "krxu4gl",
      "author": "InfiniteBrainMelt",
      "body": "Same here...I felt like my naturally small/slim physique was all I had going for me. There were other things that probably contributed to the start of my eating disorder (growing up in an unstable environment therefore feeling a lack of control, having super strict parents that tried to control everything about me and my life, an impending move across the Atlantic, my first sexual assault), but this definitely played into it. Kids at school would accuse me of being anorexic or bulimic when I wasn't at the time, so I think part of me was like \"I'll fucking show you what anorexia/bulimia really looks like.\"",
      "created_utc": 1708793356.0,
      "score": 6,
      "context": [
        {
          "id": "krup1s8",
          "author": "None",
          "body": "Was alr skinny since forever. People only ever just complimented me on my skinnyness. So i felt like I had to stay skinny :) lowkey drove me nuts but im better than ever now",
          "created_utc": 1708735712.0
        }
      ]
    },
    {
      "id": "krygbc7",
      "author": "None",
      "body": "Me to a tea. Glad you’re doing better!!",
      "created_utc": 1708801094.0,
      "score": 2,
      "context": [
        {
          "id": "krup1s8",
          "author": "None",
          "body": "Was alr skinny since forever. People only ever just complimented me on my skinnyness. So i felt like I had to stay skinny :) lowkey drove me nuts but im better than ever now",
          "created_utc": 1708735712.0
        }
      ]
    },
    {
      "id": "krypjii",
      "author": "EpicCreeper111",
      "body": "Same",
      "created_utc": 1708804378.0,
      "score": 4,
      "context": [
        {
          "id": "krv7xbi",
          "author": "crescentmoon_n",
          "body": "Honestly I'm using it as a self harm, a slow suicide. And it makes me relaxed\n\nAnd need of control in my life ofc",
          "created_utc": 1708743453.0
        }
      ]
    },
    {
      "id": "ks51gvt",
      "author": "nobalognababy",
      "body": "Yep. I feel you",
      "created_utc": 1708903408.0,
      "score": 2,
      "context": [
        {
          "id": "krv7xbi",
          "author": "crescentmoon_n",
          "body": "Honestly I'm using it as a self harm, a slow suicide. And it makes me relaxed\n\nAnd need of control in my life ofc",
          "created_utc": 1708743453.0
        }
      ]
    },
    {
      "id": "krv5f31",
      "author": "Chantel_Lusciana",
      "body": "This is me",
      "created_utc": 1708742399.0,
      "score": 6,
      "context": [
        {
          "id": "kruo8q3",
          "author": "xxkuromi",
          "body": "trauma + ocd + autism = crazy need for control",
          "created_utc": 1708735398.0
        }
      ]
    },
    {
      "id": "krvd652",
      "author": "narcissisticmartyr",
      "body": "Same. Throw in straight up genetics (blood relative with AN) and you have the perfect storm.",
      "created_utc": 1708745726.0,
      "score": 5,
      "context": [
        {
          "id": "kruo8q3",
          "author": "xxkuromi",
          "body": "trauma + ocd + autism = crazy need for control",
          "created_utc": 1708735398.0
        }
      ]
    },
    {
      "id": "krxvbpw",
      "author": "InfiniteBrainMelt",
      "body": "Also Livejournal right around 2001-2002, which was wildly unregulated. Tumblr replaced Livejournal and oldschool pro-ana sites for me around 2012-2013.",
      "created_utc": 1708793773.0,
      "score": 4,
      "context": [
        {
          "id": "kruqp5e",
          "author": "K8_15",
          "body": "Pro ana websites in 2014",
          "created_utc": 1708736362.0
        }
      ]
    },
    {
      "id": "ks51q2q",
      "author": "nobalognababy",
      "body": "I completely agree with you",
      "created_utc": 1708903508.0,
      "score": 2,
      "context": [
        {
          "id": "kruwlxp",
          "author": "Front-Ad-5210",
          "body": "it’s another crutch for me just like drugs and self harm and it makes me feel like i have self control",
          "created_utc": 1708738743.0
        }
      ]
    },
    {
      "id": "krus6qq",
      "author": "rebeclectic",
      "body": "Is there a link between this?? I had a TBI and became anorexic after",
      "created_utc": 1708736959.0,
      "score": 12,
      "context": [
        {
          "id": "krun7ck",
          "author": "throwthetulipsaway",
          "body": "A head injury",
          "created_utc": 1708734997.0
        }
      ]
    },
    {
      "id": "krvgkol",
      "author": "Burner_account224667",
      "body": "I’m really curious to know more about this, if you’re comfortable sharing more!",
      "created_utc": 1708747257.0,
      "score": 6,
      "context": [
        {
          "id": "krun7ck",
          "author": "throwthetulipsaway",
          "body": "A head injury",
          "created_utc": 1708734997.0
        }
      ]
    },
    {
      "id": "kvuhdej",
      "author": "-Tricky-Vixen-",
      "body": "No but same",
      "created_utc": 1710996292.0,
      "score": 1,
      "context": [
        {
          "id": "krw68uy",
          "author": "jaehatesyou",
          "body": "damn everyone here is saying really deep reasons but mine is just that i wanted to be skinny 😭 i’m embarrassed now",
          "created_utc": 1708761965.0
        }
      ]
    },
    {
      "id": "lxzim8j",
      "author": "Sudden_Parking104",
      "body": "same",
      "created_utc": 1732048385.0,
      "score": 1,
      "context": [
        {
          "id": "krw68uy",
          "author": "jaehatesyou",
          "body": "damn everyone here is saying really deep reasons but mine is just that i wanted to be skinny 😭 i’m embarrassed now",
          "created_utc": 1708761965.0
        }
      ]
    },
    {
      "id": "krvgmqp",
      "author": "Gray_Street_",
      "body": "I'm very smilier too. Also sober and in recovery now.",
      "created_utc": 1708747284.0,
      "score": 5,
      "context": [
        {
          "id": "kruvs98",
          "author": "LunarScorpio_",
          "body": "I’ve always had bad body image but Drvg abuse worsened it due to the weight loss that comes with it. Also made it harder for me to get sober because I loved getting smaller and smaller. I’m sober and fully recovered now.",
          "created_utc": 1708738411.0
        }
      ]
    },
    {
      "id": "ks51z3w",
      "author": "nobalognababy",
      "body": "I'm right there with you.",
      "created_utc": 1708903606.0,
      "score": 2,
      "context": [
        {
          "id": "kruoijr",
          "author": "Alyx_M11",
          "body": "Cos it felt like smth I could control. My life was full of sad/depressing moments and thoughts, being able to control what I ate gave me hope ig",
          "created_utc": 1708735503.0
        }
      ]
    },
    {
      "id": "ks0fkcg",
      "author": "fuhuuuck",
      "body": "I sincerely wish the worst on adults who attempt to guilt a child who doesn't want to eat for whatever reason, with 'there's starving children in Africa!'\n\nLiterally shut the fuck up unless YOU ~personally~ are willing to mail my unfinished portion of food TO said starving children. If you care so much, why aren't you feeding them? Fuck you, Kathy. \n\nI'm sorry you had to deal with this.",
      "created_utc": 1708828354.0,
      "score": 5,
      "context": [
        {
          "id": "krv78ys",
          "author": "what-is-noah",
          "body": "My dad would make us watch those starving African kids on tv, telling us to never waste, while being given adult sized portions from a young age ((before 10))\n\nSpent all my childhood and teen years fat, being bullied by peers and family for it. Around 12/13 I discovered pro ana and have pretty consistently dealt with ednos since, however after losing and gaining and then relosing a large amount of weight I'd definitely say within the past two years I have learned more into the anorexia criteria ((I am not gaining that fuckin weight back this time lol))",
          "created_utc": 1708743167.0
        }
      ]
    },
    {
      "id": "krzanes",
      "author": "Maleficent-Court1239",
      "body": "I would appreciate the wedding dress story if you don’t mind sharing. I suffered from anorexia in my early 20s and was pretty much “recovered” until recently with my wedding being in two weeks from now.",
      "created_utc": 1708811988.0,
      "score": 1,
      "context": [
        {
          "id": "krunsc7",
          "author": "Stenuhhh_",
          "body": "I needed something to control, buying my wedding dress (it’s a longer story) & much trauma and abuse in my life",
          "created_utc": 1708735222.0
        }
      ]
    },
    {
      "id": "krw9581",
      "author": "Creepy_Cantaloupe873",
      "body": "same",
      "created_utc": 1708764021.0,
      "score": 5,
      "context": [
        {
          "id": "krukcse",
          "author": "SecondaryPosts",
          "body": "Feeling a lack of control in my life, combined with a traumatic event and sustained extreme stress. Body image never played into it for me.",
          "created_utc": 1708733896.0
        },
        {
          "id": "krw6csd",
          "author": "SnooRevelations7103",
          "body": "Same",
          "created_utc": 1708762040.0
        }
      ]
    },
    {
      "id": "krv01ur",
      "author": "htesssl",
      "body": "For me it was like something I didn’t notice was happening until it was too entrenched to stop easily, if that makes sense! When I step back and analyze reasoning though, I definitely relate to that. It has a strong “protest” and “fuck you, then!” quality to it.",
      "created_utc": 1708740155.0,
      "score": 16,
      "context": [
        {
          "id": "kruiwxi",
          "author": "htesssl",
          "body": "To simplify it drastically, chronic internalization of trauma coupled with the thin ideal that is perpetuated in western culture. Also as a means to have control over something in my life. I could probably think of a few more things too.",
          "created_utc": 1708733337.0
        },
        {
          "id": "kruzkuj",
          "author": "octoteach17",
          "body": "This, absolutely 100%. Same girl, same. When I developed anorexia at 15, I thought \"I can't control my fucking family, I can't control these mean girls/teachers/etc., but I CAN control food and if anyone gets in my way, fuck 'em!\"",
          "created_utc": 1708739960.0
        }
      ]
    },
    {
      "id": "ksbahl1",
      "author": "Positive-Court",
      "body": "Yeahhh I think this is how it would've happened fir me cause I butterflies around for a good 5 months before it developed- but a traumatic event kick-started it from butterflying to 'shit, this may actually be a problem' in the span of 5 days.\n\n\nLooking back, I think it was inevitable though. Cause genetics and my attitude toward weight was so damned unhealthy.",
      "created_utc": 1708999035.0,
      "score": 1,
      "context": [
        {
          "id": "krukd81",
          "author": "Decent-Efficiency-21",
          "body": "To be completely honest it started out as just a dare to challenge myself to see if i could really do it as much as i thought i could, but then i was suprised when i found out i actually could and did and started liking it alot, but then it became addicting and i started losing control and it no longer became a dare but a manifestation of all my negative emotions and a way of having control and the worse i feel the more weight i lose, i didn't expect to lose this much weight i didn't think i could but now that i did it feels almost impossible to let this \"high\" go to let everything I've ever wanted go even if it kills me",
          "created_utc": 1708733901.0
        },
        {
          "id": "kryjuom",
          "author": "TheGingerGiraffe68",
          "body": "I was thinking this but afraid to comment it. Like I said it as a joke like Oo look at me I could develop an ED and then it just manifested in denial and keep on laughing my way through it until I was hospitalized 3 times",
          "created_utc": 1708802344.0
        }
      ]
    },
    {
      "id": "krwq1vh",
      "author": "throwthetulipsaway",
      "body": "I personally think so based on experience and speaking with some other people in treatment whose ED's started about a TBI or mTBI/concussion. There is some research out there but its not extensive. They need to do more studies...",
      "created_utc": 1708775986.0,
      "score": 5,
      "context": [
        {
          "id": "krun7ck",
          "author": "throwthetulipsaway",
          "body": "A head injury",
          "created_utc": 1708734997.0
        },
        {
          "id": "krus6qq",
          "author": "rebeclectic",
          "body": "Is there a link between this?? I had a TBI and became anorexic after",
          "created_utc": 1708736959.0
        }
      ]
    },
    {
      "id": "krx62iy",
      "author": "firecat321",
      "body": "I had a severe ED relapse shortly following my TBI. First time in almost 10 years.",
      "created_utc": 1708784148.0,
      "score": 3,
      "context": [
        {
          "id": "krun7ck",
          "author": "throwthetulipsaway",
          "body": "A head injury",
          "created_utc": 1708734997.0
        },
        {
          "id": "krus6qq",
          "author": "rebeclectic",
          "body": "Is there a link between this?? I had a TBI and became anorexic after",
          "created_utc": 1708736959.0
        }
      ]
    },
    {
      "id": "krwpwtb",
      "author": "throwthetulipsaway",
      "body": "Yes! I am very open about it. I got kicked in the frontal lobe region of my head during a soccer game. A few days after I noticed a stark change in my mood. I was irritable, angry, and depressed. I had experienced a mild bout of tween moodiness/angst/depression in middle school but nothing to this extent. From there I just cold turkey stopped eating and anything I did eat I >!purged!<. It was not a gradual development, and it was quite sudden. This happened in October 2014 and then I was hospitalized less than 3 months later for AN b/p subtype. I hadn't even had an eating disorder for 3 months before I was put into treatment. Which is ironic because they say the earlier you intervene the better the outcome... now 10+ years later I STILL struggle and have been in and out of treatment and hospitals since that injury. No doctor has ever gave me a solid and concise answer as to why... but I think that getting the sport that was supposed to be my career ripped away from me in just a singular second really fucked with me mentally and there was a lack of control around recovering from the head injury too (I couldn't do ANYTHING and was quite limited in my activity).",
      "created_utc": 1708775896.0,
      "score": 9,
      "context": [
        {
          "id": "krun7ck",
          "author": "throwthetulipsaway",
          "body": "A head injury",
          "created_utc": 1708734997.0
        },
        {
          "id": "krvgkol",
          "author": "Burner_account224667",
          "body": "I’m really curious to know more about this, if you’re comfortable sharing more!",
          "created_utc": 1708747257.0
        }
      ]
    },
    {
      "id": "ks05ysi",
      "author": "Stenuhhh_",
      "body": "I tried on my dress and absolutely loved it, but as I was looking back I was having bad body dysmorphia. My fiance had made the comment that after we said our vows he’d carry me back down the aisle. And seeing how heavy I’d gotten, the highest weight I’d ever been, I was immediately NO. Thinking the only way I’d be a beautiful bride was if I was a helllll of a lot skinnier, and there was also no way I’d let him carry me back down at that size.",
      "created_utc": 1708824336.0,
      "score": 2,
      "context": [
        {
          "id": "krunsc7",
          "author": "Stenuhhh_",
          "body": "I needed something to control, buying my wedding dress (it’s a longer story) & much trauma and abuse in my life",
          "created_utc": 1708735222.0
        },
        {
          "id": "krzanes",
          "author": "Maleficent-Court1239",
          "body": "I would appreciate the wedding dress story if you don’t mind sharing. I suffered from anorexia in my early 20s and was pretty much “recovered” until recently with my wedding being in two weeks from now.",
          "created_utc": 1708811988.0
        }
      ]
    },
    {
      "id": "krv518r",
      "author": "bobcatcharlie",
      "body": "Would it be fair to say it’s similar to a hunger strike? I feel like with me it was kinda like that, just very fuck you I won’t eat then, see what happens.",
      "created_utc": 1708742235.0,
      "score": 10,
      "context": [
        {
          "id": "kruiwxi",
          "author": "htesssl",
          "body": "To simplify it drastically, chronic internalization of trauma coupled with the thin ideal that is perpetuated in western culture. Also as a means to have control over something in my life. I could probably think of a few more things too.",
          "created_utc": 1708733337.0
        },
        {
          "id": "kruzkuj",
          "author": "octoteach17",
          "body": "This, absolutely 100%. Same girl, same. When I developed anorexia at 15, I thought \"I can't control my fucking family, I can't control these mean girls/teachers/etc., but I CAN control food and if anyone gets in my way, fuck 'em!\"",
          "created_utc": 1708739960.0
        },
        {
          "id": "krv01ur",
          "author": "htesssl",
          "body": "For me it was like something I didn’t notice was happening until it was too entrenched to stop easily, if that makes sense! When I step back and analyze reasoning though, I definitely relate to that. It has a strong “protest” and “fuck you, then!” quality to it.",
          "created_utc": 1708740155.0
        }
      ]
    },
    {
      "id": "krv26vf",
      "author": "octoteach17",
      "body": "I felt that, too! *Solidarity!*",
      "created_utc": 1708741039.0,
      "score": 7,
      "context": [
        {
          "id": "kruiwxi",
          "author": "htesssl",
          "body": "To simplify it drastically, chronic internalization of trauma coupled with the thin ideal that is perpetuated in western culture. Also as a means to have control over something in my life. I could probably think of a few more things too.",
          "created_utc": 1708733337.0
        },
        {
          "id": "kruzkuj",
          "author": "octoteach17",
          "body": "This, absolutely 100%. Same girl, same. When I developed anorexia at 15, I thought \"I can't control my fucking family, I can't control these mean girls/teachers/etc., but I CAN control food and if anyone gets in my way, fuck 'em!\"",
          "created_utc": 1708739960.0
        },
        {
          "id": "krv01ur",
          "author": "htesssl",
          "body": "For me it was like something I didn’t notice was happening until it was too entrenched to stop easily, if that makes sense! When I step back and analyze reasoning though, I definitely relate to that. It has a strong “protest” and “fuck you, then!” quality to it.",
          "created_utc": 1708740155.0
        }
      ]
    },
    {
      "id": "krxzzwe",
      "author": "InfiniteBrainMelt",
      "body": "Ugh I am so sorry that you had to go through such a traumatic event, and because of that, you were no longer able to participate in something you loved and were counting on to bring you success. I'm sure you have become successful in other areas of your life outside of your eating disorder, please do try to recognize how far you have come since your TBI and everything you have survived! \n\nI love animals, and really need contact with them for self-soothing...I truly fall apart without that contact. When I was 10, my family moved to a country in Europe that required all outside animals to be quarantined for 4 months. So our family dog was under lockdown during my most difficult period of adjustment ever, dealing with culture-shock and struggling to make friends. This isn't when my eating disorder really started, but I did start obsessively tracking caloric intake/output, exercising in my bedroom in the middle of the night, and I became a vegetarian (not that this is a bad thing, 26 years later I am still proud to be a vegetarian). This is also the first time I experienced depression -- 26 years later it is still ruining my life. We got our precious pup back after 4 months, but my personality and behaviors had already changed for the worse. Like you, I had already become depressed, angry, irritable, and anxious. While our dog still provided me comfort and allowed me to self-soothe, my new personality and behaviors were set in stone.\n\nI'm so sorry, I didn't mean to make this about *me me me*, I just felt compelled to share my story. I can relate to your feelings of loss, confusion, anger, and depression, and the personality changes that came with that. I can also relate to ED early intervention not working, and still struggling many years later. I feel for you -- please do take care of yourself, and know that I'm rooting for your recovery, even though I'm just a Reddit stranger! 💕",
      "created_utc": 1708795397.0,
      "score": 4,
      "context": [
        {
          "id": "krun7ck",
          "author": "throwthetulipsaway",
          "body": "A head injury",
          "created_utc": 1708734997.0
        },
        {
          "id": "krvgkol",
          "author": "Burner_account224667",
          "body": "I’m really curious to know more about this, if you’re comfortable sharing more!",
          "created_utc": 1708747257.0
        },
        {
          "id": "krwpwtb",
          "author": "throwthetulipsaway",
          "body": "Yes! I am very open about it. I got kicked in the frontal lobe region of my head during a soccer game. A few days after I noticed a stark change in my mood. I was irritable, angry, and depressed. I had experienced a mild bout of tween moodiness/angst/depression in middle school but nothing to this extent. From there I just cold turkey stopped eating and anything I did eat I >!purged!<. It was not a gradual development, and it was quite sudden. This happened in October 2014 and then I was hospitalized less than 3 months later for AN b/p subtype. I hadn't even had an eating disorder for 3 months before I was put into treatment. Which is ironic because they say the earlier you intervene the better the outcome... now 10+ years later I STILL struggle and have been in and out of treatment and hospitals since that injury. No doctor has ever gave me a solid and concise answer as to why... but I think that getting the sport that was supposed to be my career ripped away from me in just a singular second really fucked with me mentally and there was a lack of control around recovering from the head injury too (I couldn't do ANYTHING and was quite limited in my activity).",
          "created_utc": 1708775896.0
        }
      ]
    },
    {
      "id": "ks2v9h8",
      "author": "Maleficent-Court1239",
      "body": "Thank you so much for sharing this with me. I am sorry this happened. — Sending you warm wishes. :)",
      "created_utc": 1708876123.0,
      "score": 1,
      "context": [
        {
          "id": "krunsc7",
          "author": "Stenuhhh_",
          "body": "I needed something to control, buying my wedding dress (it’s a longer story) & much trauma and abuse in my life",
          "created_utc": 1708735222.0
        },
        {
          "id": "krzanes",
          "author": "Maleficent-Court1239",
          "body": "I would appreciate the wedding dress story if you don’t mind sharing. I suffered from anorexia in my early 20s and was pretty much “recovered” until recently with my wedding being in two weeks from now.",
          "created_utc": 1708811988.0
        },
        {
          "id": "ks05ysi",
          "author": "Stenuhhh_",
          "body": "I tried on my dress and absolutely loved it, but as I was looking back I was having bad body dysmorphia. My fiance had made the comment that after we said our vows he’d carry me back down the aisle. And seeing how heavy I’d gotten, the highest weight I’d ever been, I was immediately NO. Thinking the only way I’d be a beautiful bride was if I was a helllll of a lot skinnier, and there was also no way I’d let him carry me back down at that size.",
          "created_utc": 1708824336.0
        }
      ]
    }
  ]
}