{
  "id": "1b01kyy",
  "subreddit": "AnorexiaNervosa",
  "author": "Throwaway55557783",
  "created_utc": 1708901454.0,
  "title": "Collapsed last week and had to be rushed to ER. So, I did something about it after 6 hellish years. This weekend:",
  "selftext": "Friday: sushi buffet with my fiancé for the first date night dinner since we started dating, massive fear cause of unknown ingredients. Was the most stressful night of my life but it was great.\n\nSaturday: went out with the parents for breakfast, got myself a black coffee like normal and watched everyone else finish. On a whim ordered a banana cream waffle. Also last minute shared a milkshake with the fiance. 10/10 \n\nSunday: brunch buffet at a restaurant my best friend has been begging me to try for years, so we went and went for whatever I wanted and however much. Panic and 2 cigarette cry sessions got me through 4 plates of some of my favourite childhood breakfast items. 100000/10\n\nSunday /afternoon evening : on a whim went to get a black coffee from a drive through to get out late, not only took down the best dessert donut puffs ever. \n\nThen I stopped on the way home again. Because I saw something, something I hadn’t seen since I was a kid. My stomach was full but I completely on impulse and my brain telling me “go, do it, you need it.”\n\nThat’s right. The shamrock shake is back. And it. Is. Everything. \nTrust me, I type this as I enjoy mine.\n\nGo get one and give it a go while they’re here ;)\n\nYou deserve it.",
  "url": "https://www.reddit.com/gallery/1b01kyy",
  "score": 131,
  "num_comments": 54,
  "comments": [
    {
      "id": "ks4w90f",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1708901454.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks52m58",
      "author": "Far_Blueberry383",
      "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
      "created_utc": 1708903852.0,
      "score": 31,
      "context": []
    },
    {
      "id": "ks5g9n4",
      "author": "z0mbiiib0y",
      "body": "looks so freakin good, hope u enjoyed🥰🙏🏼❤️",
      "created_utc": 1708909184.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ks5nf43",
      "author": "fredpilled",
      "body": "Everything looks absolutely delicious!!! I hope you enjoyed and had a lovely time, and continue to enjoy. 💗",
      "created_utc": 1708912027.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ks712d1",
      "author": "Consistent_Lack8865",
      "body": "Honey, I am so proud of you. \n\nI don't know how to explain how genuinely happy I am. You did this! Please, please keep it up!",
      "created_utc": 1708938525.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ks5qgim",
      "author": "LocalTo0thJar",
      "body": "Shrimp jumpscare at the end!!! But this looks absolutely amazing. Great job.",
      "created_utc": 1708913236.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ks712sh",
      "author": "seventeeneternal",
      "body": "sending so much love 🩷 recovery is worth it",
      "created_utc": 1708938534.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ks6r3dj",
      "author": "Limp-Coconut3740",
      "body": "I’m so proud of you and wish you happiness and health 🙏💙",
      "created_utc": 1708931499.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ks8c7ez",
      "author": "htesssl",
      "body": "You’re worth it! Looks delicious! Happy for you 💞",
      "created_utc": 1708962561.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kv2jkhs",
      "author": "No_Philosophy7921",
      "body": "Late to the party but im crazy proud of you OP. Like seriously. This made me so so happy. I hope you’re kicking ass and taking names and you leave this shit behind and never look back. Sending you love❤️",
      "created_utc": 1710547023.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kv2n8ql",
      "author": "Ancient-System23",
      "body": "Dude tbh, i’m in recovery and i still wouldn’t be 100% able to try all things you got. Thats fucking awesome man!!! Kick this shit in the ass, you fucking deserve it",
      "created_utc": 1710548478.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks7adyb",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1708945353.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ksa83lt",
      "author": "Openfire75340",
      "body": "Proud of you 😊",
      "created_utc": 1708985030.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ksdo2ux",
      "author": "Ill_Caterpillar_7616",
      "body": "So proud of you but that last picture will be seared into my nightmares. \nTHE EYES!!!",
      "created_utc": 1709044383.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ksdwskp",
      "author": "Throwaway55557783",
      "body": "Edit: just wanna say thank you to everybody and the comments, this is the hardest thing I’ve ever done in my life yet also the most important so this subreddit, and lurking in it for years, has really pushed me and continues. I still struggle every waking minute. No longer having MyFitnessPal as my #1 used app on my phone and having to stare at that screen like a robot for hours, planning, has allowed me to disregard the thought of rules around eating and what I eat, is incredibly freeing yet stressful. I panic, I freak out, I get angry and anxious more then I don’t.\n\nBUT\nI feel clear. I feel good. I’ve done more things in 4 days that I have in years only because I had the energy to. All because of fuel. “Scary fuel” we all need to see and breathe and walk. I get it. I was it. I lived it and told myself I loved the skeletal body and the feeling of hunger constantly. But I hated it. I hated the cold constantly stabbing every part of my body no matter how many sweaters and heated blankets I had on. I hated pretending like I didn’t like ice cream to avoid uncomfortable situations. I avoided social events with those I loved because they may have involved food. I sunk my finances buying all these “miracle foods” (gum, konjac noodles, Walden’s farms *ahem go fuck yourself waldens farms peanut butter* etc. the list goes on). And what better was I? What better are you for it? Are you happy? Do you feel good? \n\nAs anorexics, we are the most stubborn motherfuckers around. We don’t do anything we don’t want. Fuck we will even convince ourselves we don’t want what we want, and don’t need what we need. So flip that. Use that mentality to destroy itself. Be stubborn. Shove the fucking fuel in you. If you doubt it, fuck it, pretend like you’re at McDonald’s and someone’s trying to get you a double Quarter pounder with extra everything instead of a bag of apple slices and a black coffee for the first meal in 3 days. Would you do that? Would you be like “ok, let’s eat this Big Mac?” FUCK NO YOU WOULDNT AND NEITHER WOULD I, I woulda died in that McDonald’s before even looking at a quarter pounder in the heat of the moment, without planning and all this and that. So do that. Fight. Die on that hill. Be stubborn against that gut feeling to restrict. Cause once you just do, you realize “fuck I’m okay”. I am aren’t I? And you saw all these things I got to enjoy that I told myself for years would make me lose control of everything I had worked for and suffered towards would be gone. I’m fine. I’m great. I am better than I have been in years. I took a proper shit yesterday for the first time in years and IT FELT GREAT!!!!! Why? I gave my body and my brain what it needs to fuel my bony ass for a little bit longer. And that’s a win. \n\nLook, it’s a battle, a slow, shitty battle that no one can relate to unless they’re balls deep in it. I’m still balls deep in it, and most of you are too, whether you wanna admit it or not, we all need to change and quite honestly I know we all do. Do it. Do it. Do it. Fuck it all. Fuck em, fuck em, fuck it!!!!!!!!! We are all gonna die someday, and none of us wanna die like this. No one deserves to die like this. \n\nGood luck, I’m proud of you and I trust that everyone here will give themselves what they need today and for the rest of your life. You are beautiful, you will be beautiful until you die, and no food you eat or aspect of life you love will take that from you. Only continuing to disregard them will. ❤️",
      "created_utc": 1709047521.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kshro7b",
      "author": "Cloud-Nine-94",
      "body": "so proud of you",
      "created_utc": 1709096537.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ks9iu2k",
      "author": "Throwaway55557783",
      "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
      "created_utc": 1708976809.0,
      "score": 8,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        }
      ]
    },
    {
      "id": "ks9k1uv",
      "author": "Throwaway55557783",
      "body": "Oh did I ever, straight up mucked that shit (been waiting to use that lingo since I’ve heard it haha)",
      "created_utc": 1708977207.0,
      "score": 3,
      "context": [
        {
          "id": "ks5g9n4",
          "author": "z0mbiiib0y",
          "body": "looks so freakin good, hope u enjoyed🥰🙏🏼❤️",
          "created_utc": 1708909184.0
        }
      ]
    },
    {
      "id": "ks9juem",
      "author": "Throwaway55557783",
      "body": "It was omg literally my dream meals. Can’t wait for another spicy tuna roll 🤤🤤🤤",
      "created_utc": 1708977139.0,
      "score": 3,
      "context": [
        {
          "id": "ks5nf43",
          "author": "fredpilled",
          "body": "Everything looks absolutely delicious!!! I hope you enjoyed and had a lovely time, and continue to enjoy. 💗",
          "created_utc": 1708912027.0
        }
      ]
    },
    {
      "id": "ks9j3x7",
      "author": "Throwaway55557783",
      "body": "Thank you so much. I’m done letting this shit run my life and take everything I love from me. Everything mentally and physically is 1000000x better feeling already \n\nNo going back to that EVER :):):):)",
      "created_utc": 1708976900.0,
      "score": 4,
      "context": [
        {
          "id": "ks712d1",
          "author": "Consistent_Lack8865",
          "body": "Honey, I am so proud of you. \n\nI don't know how to explain how genuinely happy I am. You did this! Please, please keep it up!",
          "created_utc": 1708938525.0
        }
      ]
    },
    {
      "id": "ks9j92w",
      "author": "Throwaway55557783",
      "body": "I FORGOT ABOUT MY LITTLE SHRIMPY FRIEND AHHHHHH MY PARTNER AND I COULDNT STOP LAUGHING AT HIS EYES",
      "created_utc": 1708976946.0,
      "score": 2,
      "context": [
        {
          "id": "ks5qgim",
          "author": "LocalTo0thJar",
          "body": "Shrimp jumpscare at the end!!! But this looks absolutely amazing. Great job.",
          "created_utc": 1708913236.0
        }
      ]
    },
    {
      "id": "ks9jlfq",
      "author": "Throwaway55557783",
      "body": "❤️❤️ is it ever. Fuck being scared of good good body fuel.",
      "created_utc": 1708977058.0,
      "score": 1,
      "context": [
        {
          "id": "ks712sh",
          "author": "seventeeneternal",
          "body": "sending so much love 🩷 recovery is worth it",
          "created_utc": 1708938534.0
        }
      ]
    },
    {
      "id": "ks9jenr",
      "author": "Throwaway55557783",
      "body": "Right back at you! We all deserve to be happy and health and all need to be happy and healthy❤️",
      "created_utc": 1708976997.0,
      "score": 2,
      "context": [
        {
          "id": "ks6r3dj",
          "author": "Limp-Coconut3740",
          "body": "I’m so proud of you and wish you happiness and health 🙏💙",
          "created_utc": 1708931499.0
        }
      ]
    },
    {
      "id": "ksaa72c",
      "author": "Throwaway55557783",
      "body": "Thank you so much!! And damn straight so are you!! 💗",
      "created_utc": 1708985732.0,
      "score": 2,
      "context": [
        {
          "id": "ks8c7ez",
          "author": "htesssl",
          "body": "You’re worth it! Looks delicious! Happy for you 💞",
          "created_utc": 1708962561.0
        }
      ]
    },
    {
      "id": "ks7lv25",
      "author": "Augustwannabethin",
      "body": "Rage bait",
      "created_utc": 1708951978.0,
      "score": 1,
      "context": [
        {
          "id": "ks7adyb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1708945353.0
        }
      ]
    },
    {
      "id": "ksaa8lx",
      "author": "Throwaway55557783",
      "body": "Thank you so much !!💗",
      "created_utc": 1708985747.0,
      "score": 1,
      "context": [
        {
          "id": "ksa83lt",
          "author": "Openfire75340",
          "body": "Proud of you 😊",
          "created_utc": 1708985030.0
        }
      ]
    },
    {
      "id": "ksdpyqp",
      "author": "Throwaway55557783",
      "body": "Ok ok hear me out \n\nhttps://imgur.com/a/TfR7iTD",
      "created_utc": 1709045081.0,
      "score": 2,
      "context": [
        {
          "id": "ksdo2ux",
          "author": "Ill_Caterpillar_7616",
          "body": "So proud of you but that last picture will be seared into my nightmares. \nTHE EYES!!!",
          "created_utc": 1709044383.0
        }
      ]
    },
    {
      "id": "ksa3k0y",
      "author": "Far_Blueberry383",
      "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
      "created_utc": 1708983535.0,
      "score": 1,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        }
      ]
    },
    {
      "id": "ksmaex9",
      "author": "None",
      "body": "I needed to hear this today. I'm so close to where you are. I'm just about done; I can feel it coming. I'm so tired of denying myself the foods that I love. My husband and my children have an intervention planned this weekend; and while I don't want to do it, I'm hoping it provides the incentive I need.\n\n\nI'm so, so proud of you! I know how hard it was.",
      "created_utc": 1709165020.0,
      "score": 1,
      "context": [
        {
          "id": "ks712d1",
          "author": "Consistent_Lack8865",
          "body": "Honey, I am so proud of you. \n\nI don't know how to explain how genuinely happy I am. You did this! Please, please keep it up!",
          "created_utc": 1708938525.0
        },
        {
          "id": "ks9j3x7",
          "author": "Throwaway55557783",
          "body": "Thank you so much. I’m done letting this shit run my life and take everything I love from me. Everything mentally and physically is 1000000x better feeling already \n\nNo going back to that EVER :):):):)",
          "created_utc": 1708976900.0
        }
      ]
    },
    {
      "id": "ksdqyv9",
      "author": "Ill_Caterpillar_7616",
      "body": "🤣🤣🤣 you right",
      "created_utc": 1709045449.0,
      "score": 1,
      "context": [
        {
          "id": "ksdo2ux",
          "author": "Ill_Caterpillar_7616",
          "body": "So proud of you but that last picture will be seared into my nightmares. \nTHE EYES!!!",
          "created_utc": 1709044383.0
        },
        {
          "id": "ksdpyqp",
          "author": "Throwaway55557783",
          "body": "Ok ok hear me out \n\nhttps://imgur.com/a/TfR7iTD",
          "created_utc": 1709045081.0
        }
      ]
    },
    {
      "id": "ksaqfev",
      "author": "Throwaway55557783",
      "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
      "created_utc": 1708991517.0,
      "score": 1,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        }
      ]
    },
    {
      "id": "kuzi4jm",
      "author": "Throwaway55557783",
      "body": "I never got around to replying to this (missed it my bad, been too busy just enjoying things!) but I hope more then anything that you did and are taking those steps, because if you can type it to a stranger on the internet, then you can make it happen. You have the incentive or else you wouldn’t have expressed those things; being done, hoping for intervention. \n\nI’m proud of YOU, because you just told yourself that you can’t do it anymore. And that’s all it took for me to make that change. Remember, our brain is only one part of us, don’t let it control everything else that makes us human. Not even physical, or mental. Just living life to its fullest. \n\nI hope that you’re doing great :)",
      "created_utc": 1710508202.0,
      "score": 2,
      "context": [
        {
          "id": "ks712d1",
          "author": "Consistent_Lack8865",
          "body": "Honey, I am so proud of you. \n\nI don't know how to explain how genuinely happy I am. You did this! Please, please keep it up!",
          "created_utc": 1708938525.0
        },
        {
          "id": "ks9j3x7",
          "author": "Throwaway55557783",
          "body": "Thank you so much. I’m done letting this shit run my life and take everything I love from me. Everything mentally and physically is 1000000x better feeling already \n\nNo going back to that EVER :):):):)",
          "created_utc": 1708976900.0
        },
        {
          "id": "ksmaex9",
          "author": "None",
          "body": "I needed to hear this today. I'm so close to where you are. I'm just about done; I can feel it coming. I'm so tired of denying myself the foods that I love. My husband and my children have an intervention planned this weekend; and while I don't want to do it, I'm hoping it provides the incentive I need.\n\n\nI'm so, so proud of you! I know how hard it was.",
          "created_utc": 1709165020.0
        }
      ]
    },
    {
      "id": "ksasn05",
      "author": "Far_Blueberry383",
      "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
      "created_utc": 1708992346.0,
      "score": 1,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        }
      ]
    },
    {
      "id": "kv04o56",
      "author": "None",
      "body": "Thank you so much for such a kind and thoughtful response! I am working hard, and I'm going to keep this for inspiration on the hardest days.❤️",
      "created_utc": 1710516369.0,
      "score": 1,
      "context": [
        {
          "id": "ks712d1",
          "author": "Consistent_Lack8865",
          "body": "Honey, I am so proud of you. \n\nI don't know how to explain how genuinely happy I am. You did this! Please, please keep it up!",
          "created_utc": 1708938525.0
        },
        {
          "id": "ks9j3x7",
          "author": "Throwaway55557783",
          "body": "Thank you so much. I’m done letting this shit run my life and take everything I love from me. Everything mentally and physically is 1000000x better feeling already \n\nNo going back to that EVER :):):):)",
          "created_utc": 1708976900.0
        },
        {
          "id": "ksmaex9",
          "author": "None",
          "body": "I needed to hear this today. I'm so close to where you are. I'm just about done; I can feel it coming. I'm so tired of denying myself the foods that I love. My husband and my children have an intervention planned this weekend; and while I don't want to do it, I'm hoping it provides the incentive I need.\n\n\nI'm so, so proud of you! I know how hard it was.",
          "created_utc": 1709165020.0
        },
        {
          "id": "kuzi4jm",
          "author": "Throwaway55557783",
          "body": "I never got around to replying to this (missed it my bad, been too busy just enjoying things!) but I hope more then anything that you did and are taking those steps, because if you can type it to a stranger on the internet, then you can make it happen. You have the incentive or else you wouldn’t have expressed those things; being done, hoping for intervention. \n\nI’m proud of YOU, because you just told yourself that you can’t do it anymore. And that’s all it took for me to make that change. Remember, our brain is only one part of us, don’t let it control everything else that makes us human. Not even physical, or mental. Just living life to its fullest. \n\nI hope that you’re doing great :)",
          "created_utc": 1710508202.0
        }
      ]
    },
    {
      "id": "ksau8gm",
      "author": "Throwaway55557783",
      "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
      "created_utc": 1708992949.0,
      "score": 2,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        }
      ]
    },
    {
      "id": "kv0zsvw",
      "author": "Throwaway55557783",
      "body": "15 days later, that put a smile on my face reading that, if you still give a shit after 15 days, then you really do give a shit!!!!! Best of luck, YOU WILL BEAT THIS NON NEGOTIABLE!!!!!!!! OR ELSE!!!! ;)",
      "created_utc": 1710526845.0,
      "score": 2,
      "context": [
        {
          "id": "ks712d1",
          "author": "Consistent_Lack8865",
          "body": "Honey, I am so proud of you. \n\nI don't know how to explain how genuinely happy I am. You did this! Please, please keep it up!",
          "created_utc": 1708938525.0
        },
        {
          "id": "ks9j3x7",
          "author": "Throwaway55557783",
          "body": "Thank you so much. I’m done letting this shit run my life and take everything I love from me. Everything mentally and physically is 1000000x better feeling already \n\nNo going back to that EVER :):):):)",
          "created_utc": 1708976900.0
        },
        {
          "id": "ksmaex9",
          "author": "None",
          "body": "I needed to hear this today. I'm so close to where you are. I'm just about done; I can feel it coming. I'm so tired of denying myself the foods that I love. My husband and my children have an intervention planned this weekend; and while I don't want to do it, I'm hoping it provides the incentive I need.\n\n\nI'm so, so proud of you! I know how hard it was.",
          "created_utc": 1709165020.0
        },
        {
          "id": "kuzi4jm",
          "author": "Throwaway55557783",
          "body": "I never got around to replying to this (missed it my bad, been too busy just enjoying things!) but I hope more then anything that you did and are taking those steps, because if you can type it to a stranger on the internet, then you can make it happen. You have the incentive or else you wouldn’t have expressed those things; being done, hoping for intervention. \n\nI’m proud of YOU, because you just told yourself that you can’t do it anymore. And that’s all it took for me to make that change. Remember, our brain is only one part of us, don’t let it control everything else that makes us human. Not even physical, or mental. Just living life to its fullest. \n\nI hope that you’re doing great :)",
          "created_utc": 1710508202.0
        },
        {
          "id": "kv04o56",
          "author": "None",
          "body": "Thank you so much for such a kind and thoughtful response! I am working hard, and I'm going to keep this for inspiration on the hardest days.❤️",
          "created_utc": 1710516369.0
        }
      ]
    },
    {
      "id": "ksb1bun",
      "author": "Far_Blueberry383",
      "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
      "created_utc": 1708995601.0,
      "score": 1,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        }
      ]
    },
    {
      "id": "kv3k46d",
      "author": "None",
      "body": "Right back at you! 15 days and you're still kicking ass! THAT. TAKES. GUTS.",
      "created_utc": 1710563259.0,
      "score": 1,
      "context": [
        {
          "id": "ks712d1",
          "author": "Consistent_Lack8865",
          "body": "Honey, I am so proud of you. \n\nI don't know how to explain how genuinely happy I am. You did this! Please, please keep it up!",
          "created_utc": 1708938525.0
        },
        {
          "id": "ks9j3x7",
          "author": "Throwaway55557783",
          "body": "Thank you so much. I’m done letting this shit run my life and take everything I love from me. Everything mentally and physically is 1000000x better feeling already \n\nNo going back to that EVER :):):):)",
          "created_utc": 1708976900.0
        },
        {
          "id": "ksmaex9",
          "author": "None",
          "body": "I needed to hear this today. I'm so close to where you are. I'm just about done; I can feel it coming. I'm so tired of denying myself the foods that I love. My husband and my children have an intervention planned this weekend; and while I don't want to do it, I'm hoping it provides the incentive I need.\n\n\nI'm so, so proud of you! I know how hard it was.",
          "created_utc": 1709165020.0
        },
        {
          "id": "kuzi4jm",
          "author": "Throwaway55557783",
          "body": "I never got around to replying to this (missed it my bad, been too busy just enjoying things!) but I hope more then anything that you did and are taking those steps, because if you can type it to a stranger on the internet, then you can make it happen. You have the incentive or else you wouldn’t have expressed those things; being done, hoping for intervention. \n\nI’m proud of YOU, because you just told yourself that you can’t do it anymore. And that’s all it took for me to make that change. Remember, our brain is only one part of us, don’t let it control everything else that makes us human. Not even physical, or mental. Just living life to its fullest. \n\nI hope that you’re doing great :)",
          "created_utc": 1710508202.0
        },
        {
          "id": "kv04o56",
          "author": "None",
          "body": "Thank you so much for such a kind and thoughtful response! I am working hard, and I'm going to keep this for inspiration on the hardest days.❤️",
          "created_utc": 1710516369.0
        },
        {
          "id": "kv0zsvw",
          "author": "Throwaway55557783",
          "body": "15 days later, that put a smile on my face reading that, if you still give a shit after 15 days, then you really do give a shit!!!!! Best of luck, YOU WILL BEAT THIS NON NEGOTIABLE!!!!!!!! OR ELSE!!!! ;)",
          "created_utc": 1710526845.0
        }
      ]
    },
    {
      "id": "kscgah9",
      "author": "Throwaway55557783",
      "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
      "created_utc": 1709019079.0,
      "score": 2,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        }
      ]
    },
    {
      "id": "kscqtu7",
      "author": "Far_Blueberry383",
      "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
      "created_utc": 1709026671.0,
      "score": 2,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        }
      ]
    },
    {
      "id": "ksdpb7l",
      "author": "Throwaway55557783",
      "body": "Reading that brought some tears and smiles, thank you really. Thank you for even thinking about it. You are so much stronger than you will ever know. Deep down it tells me that, like myself, you too don’t want to die this way, and you KNOW that there’s a way out and a light to run to. And that way isn’t death. It’s life.\nI’m so proud of you❤️ \nthank you again random internet person, you are the reason I am going to force. \n\nNo. \n\nEnjoy.\n\nI am going to enjoy a bowl of Frosted Flakes after a night of crying and panic over the food in me.\n\n❤️:)",
      "created_utc": 1709044841.0,
      "score": 2,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        }
      ]
    },
    {
      "id": "kv2nnxc",
      "author": "Ancient-System23",
      "body": "You’re awesome too. Just remind yourself that the ability to even come here and share these thoughts is a GOOD SIGN that you are making progress. Keep being open, and take it day by day. I kicked it in the ass and so can you. I even see the scale going up as something to be proud of now :’)",
      "created_utc": 1710548642.0,
      "score": 2,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        }
      ]
    },
    {
      "id": "kwr9b2x",
      "author": "unsolicited_flattery",
      "body": "I'm not even anorexic and not sure how I happrned on this post but this thread made me smile:) love the supportive loving vibes",
      "created_utc": 1711515428.0,
      "score": 1,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        }
      ]
    },
    {
      "id": "ksecsv8",
      "author": "Far_Blueberry383",
      "body": "Have those damn Frosted Flakes!!! And then remind me how tasty they are and I might just have a bowl. ☺️",
      "created_utc": 1709052913.0,
      "score": 1,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        },
        {
          "id": "ksdpb7l",
          "author": "Throwaway55557783",
          "body": "Reading that brought some tears and smiles, thank you really. Thank you for even thinking about it. You are so much stronger than you will ever know. Deep down it tells me that, like myself, you too don’t want to die this way, and you KNOW that there’s a way out and a light to run to. And that way isn’t death. It’s life.\nI’m so proud of you❤️ \nthank you again random internet person, you are the reason I am going to force. \n\nNo. \n\nEnjoy.\n\nI am going to enjoy a bowl of Frosted Flakes after a night of crying and panic over the food in me.\n\n❤️:)",
          "created_utc": 1709044841.0
        }
      ]
    },
    {
      "id": "kv3rjwe",
      "author": "Far_Blueberry383",
      "body": "I’m just so obsessed with my weight, counting every calorie I eat and getting down to that number on the scale that I long to see. But what happens when I get there? Am I gonna even be happy? Will it ever be enough? Then what do I do? I’m already petrified of gaining weight, so how do I get over that and realize that life is more than just a number on a scale? 😔",
      "created_utc": 1710567771.0,
      "score": 1,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        },
        {
          "id": "kv2nnxc",
          "author": "Ancient-System23",
          "body": "You’re awesome too. Just remind yourself that the ability to even come here and share these thoughts is a GOOD SIGN that you are making progress. Keep being open, and take it day by day. I kicked it in the ass and so can you. I even see the scale going up as something to be proud of now :’)",
          "created_utc": 1710548642.0
        }
      ]
    },
    {
      "id": "ksejq4e",
      "author": "Throwaway55557783",
      "body": "2 words: fucking phenomenal 🤤🤤🤤",
      "created_utc": 1709055180.0,
      "score": 2,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        },
        {
          "id": "ksdpb7l",
          "author": "Throwaway55557783",
          "body": "Reading that brought some tears and smiles, thank you really. Thank you for even thinking about it. You are so much stronger than you will ever know. Deep down it tells me that, like myself, you too don’t want to die this way, and you KNOW that there’s a way out and a light to run to. And that way isn’t death. It’s life.\nI’m so proud of you❤️ \nthank you again random internet person, you are the reason I am going to force. \n\nNo. \n\nEnjoy.\n\nI am going to enjoy a bowl of Frosted Flakes after a night of crying and panic over the food in me.\n\n❤️:)",
          "created_utc": 1709044841.0
        },
        {
          "id": "ksecsv8",
          "author": "Far_Blueberry383",
          "body": "Have those damn Frosted Flakes!!! And then remind me how tasty they are and I might just have a bowl. ☺️",
          "created_utc": 1709052913.0
        }
      ]
    },
    {
      "id": "kv3sg8k",
      "author": "Ancient-System23",
      "body": "Here’s what I did. First, I refused to have mirrors. No full body mirrors nothing, just the one above my sink. Another thing was no scales. Never weighed myself for half a year while i was gaining weight. I set my mind to this mindset: “i’m gaining weight because it’s the healthy thing to do for my mind and body. I NEED to gain weight and eat MORE calories, because if I don’t, i cant lead a happy life if i’m dead”. Seems like you already realize this; you wont actually ever BE happy trying to chase an unrealistic goal weight because you ultimately know this isn’t a healthy way to live, so try to use that! Use that as a way to sort of CBT-yourself into being okay with seeing your body change. \n\nAlso, I just let myself have some fat tbh. I started seeing my skinny body as ugly, actually i just always thought i was ugly, so i used that to transition into “well whatever. Lemme just be a bit fat LOL”. Its a bit awkward and i DEFINITELY felt really ugly at first and wanted to quit. But i stuck it out. I started exercising and soon enough, my body evened out and im BLOWN AWAY by the way i actually look “normal” now. Many compliments from healthy people motivated me to keep continuing. Its slow and you may even relapse, but it really DOES change.",
      "created_utc": 1710568368.0,
      "score": 1,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        },
        {
          "id": "kv2nnxc",
          "author": "Ancient-System23",
          "body": "You’re awesome too. Just remind yourself that the ability to even come here and share these thoughts is a GOOD SIGN that you are making progress. Keep being open, and take it day by day. I kicked it in the ass and so can you. I even see the scale going up as something to be proud of now :’)",
          "created_utc": 1710548642.0
        },
        {
          "id": "kv3rjwe",
          "author": "Far_Blueberry383",
          "body": "I’m just so obsessed with my weight, counting every calorie I eat and getting down to that number on the scale that I long to see. But what happens when I get there? Am I gonna even be happy? Will it ever be enough? Then what do I do? I’m already petrified of gaining weight, so how do I get over that and realize that life is more than just a number on a scale? 😔",
          "created_utc": 1710567771.0
        }
      ]
    },
    {
      "id": "ksfcaaw",
      "author": "Far_Blueberry383",
      "body": "Good for you!!! I truly hope you continue to nourish your body the way it needs and enjoy your life the way you’re meant to. ❤️",
      "created_utc": 1709064439.0,
      "score": 1,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        },
        {
          "id": "ksdpb7l",
          "author": "Throwaway55557783",
          "body": "Reading that brought some tears and smiles, thank you really. Thank you for even thinking about it. You are so much stronger than you will ever know. Deep down it tells me that, like myself, you too don’t want to die this way, and you KNOW that there’s a way out and a light to run to. And that way isn’t death. It’s life.\nI’m so proud of you❤️ \nthank you again random internet person, you are the reason I am going to force. \n\nNo. \n\nEnjoy.\n\nI am going to enjoy a bowl of Frosted Flakes after a night of crying and panic over the food in me.\n\n❤️:)",
          "created_utc": 1709044841.0
        },
        {
          "id": "ksecsv8",
          "author": "Far_Blueberry383",
          "body": "Have those damn Frosted Flakes!!! And then remind me how tasty they are and I might just have a bowl. ☺️",
          "created_utc": 1709052913.0
        },
        {
          "id": "ksejq4e",
          "author": "Throwaway55557783",
          "body": "2 words: fucking phenomenal 🤤🤤🤤",
          "created_utc": 1709055180.0
        }
      ]
    },
    {
      "id": "kv4me24",
      "author": "Far_Blueberry383",
      "body": "It’s just different for me cuz I’m not UW and haven’t been for over 10 years, but then I literally doubled my weight in a year. I’d never been heavy in my life and the weird thing is, I didn’t even realize it was happening. So I’ve spent the last 10 years or so being technically obese, and over the last 8ish months I’ve gotten myself back down to a healthy weight, through changing old unhealthy habits into healthy lifestyle changes. But then I hit a plateau and realized that the only way I could guarantee I’d lose the rest of the weight I wanted was to start counting calories. This started a few months ago. Now I’m obsessed with counting every calorie, weight myself at least twice a day (and being totally destroyed when the number doesn’t go down every day, no matter how unrealistic that is) and tracking all my exercise and calories expended. I’m teetering on the edge of it being a real problem but I still wanna reach my goal so badly even though that number is UW and unhealthy for me. But I just don’t know what’ll happen once I get there (and I am determined to do so). Will I be happy or keep up these obsessive behaviors? So rn I’m a NW but long to be UW. I’m jealous of everyone I see that’s thinner than me and I wish I could look like them, especially people who are really thin, you know the ones I’m talking about. I am scared to death to gain any weight cuz I don’t ever wanna go back to being OW again, and refuse to let that happen, no matter what I have to do to prevent it. Get what I’m saying? I hope I made some sense here. Sometimes my thoughts are all over the place.",
      "created_utc": 1710590511.0,
      "score": 1,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        },
        {
          "id": "kv2nnxc",
          "author": "Ancient-System23",
          "body": "You’re awesome too. Just remind yourself that the ability to even come here and share these thoughts is a GOOD SIGN that you are making progress. Keep being open, and take it day by day. I kicked it in the ass and so can you. I even see the scale going up as something to be proud of now :’)",
          "created_utc": 1710548642.0
        },
        {
          "id": "kv3rjwe",
          "author": "Far_Blueberry383",
          "body": "I’m just so obsessed with my weight, counting every calorie I eat and getting down to that number on the scale that I long to see. But what happens when I get there? Am I gonna even be happy? Will it ever be enough? Then what do I do? I’m already petrified of gaining weight, so how do I get over that and realize that life is more than just a number on a scale? 😔",
          "created_utc": 1710567771.0
        },
        {
          "id": "kv3sg8k",
          "author": "Ancient-System23",
          "body": "Here’s what I did. First, I refused to have mirrors. No full body mirrors nothing, just the one above my sink. Another thing was no scales. Never weighed myself for half a year while i was gaining weight. I set my mind to this mindset: “i’m gaining weight because it’s the healthy thing to do for my mind and body. I NEED to gain weight and eat MORE calories, because if I don’t, i cant lead a happy life if i’m dead”. Seems like you already realize this; you wont actually ever BE happy trying to chase an unrealistic goal weight because you ultimately know this isn’t a healthy way to live, so try to use that! Use that as a way to sort of CBT-yourself into being okay with seeing your body change. \n\nAlso, I just let myself have some fat tbh. I started seeing my skinny body as ugly, actually i just always thought i was ugly, so i used that to transition into “well whatever. Lemme just be a bit fat LOL”. Its a bit awkward and i DEFINITELY felt really ugly at first and wanted to quit. But i stuck it out. I started exercising and soon enough, my body evened out and im BLOWN AWAY by the way i actually look “normal” now. Many compliments from healthy people motivated me to keep continuing. Its slow and you may even relapse, but it really DOES change.",
          "created_utc": 1710568368.0
        }
      ]
    },
    {
      "id": "kv5m8m4",
      "author": "Ancient-System23",
      "body": "Oh im so sorry youre dealing with this. This is a bit different from my story, so i apologize if i made u feel weird or made any assumptions! What i can say though is: it’s really good you understand that the way you are loosing weight is not necessarily the healthy way to do it. Thats a great step. Maybe instead of setting goal weights, you can set visual goals. Thats kinda what i’ve been doing (i am a dude who’s following the bulk-cut gym thing) and im about to approach the “cut”. Instead of seeing the weight go down, i would rather see my body toned. Maybe the weight stays stagnant, but i’m replacing fat with muscle mass (muscle weighs almost twice as much as bodyfat, so its very tricky for us suffering/in recovery!!). Counting calories for weight loss is not at all a bad thing, but has it become obsessive? If it’s controlling your life, i think its safe to say that once you reach your “goal” you will probably not be happy. It’s a weird disease that makes you constantly compare yourself. My best advice is listen to your body, NOT your mind.",
      "created_utc": 1710605961.0,
      "score": 2,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        },
        {
          "id": "kv2nnxc",
          "author": "Ancient-System23",
          "body": "You’re awesome too. Just remind yourself that the ability to even come here and share these thoughts is a GOOD SIGN that you are making progress. Keep being open, and take it day by day. I kicked it in the ass and so can you. I even see the scale going up as something to be proud of now :’)",
          "created_utc": 1710548642.0
        },
        {
          "id": "kv3rjwe",
          "author": "Far_Blueberry383",
          "body": "I’m just so obsessed with my weight, counting every calorie I eat and getting down to that number on the scale that I long to see. But what happens when I get there? Am I gonna even be happy? Will it ever be enough? Then what do I do? I’m already petrified of gaining weight, so how do I get over that and realize that life is more than just a number on a scale? 😔",
          "created_utc": 1710567771.0
        },
        {
          "id": "kv3sg8k",
          "author": "Ancient-System23",
          "body": "Here’s what I did. First, I refused to have mirrors. No full body mirrors nothing, just the one above my sink. Another thing was no scales. Never weighed myself for half a year while i was gaining weight. I set my mind to this mindset: “i’m gaining weight because it’s the healthy thing to do for my mind and body. I NEED to gain weight and eat MORE calories, because if I don’t, i cant lead a happy life if i’m dead”. Seems like you already realize this; you wont actually ever BE happy trying to chase an unrealistic goal weight because you ultimately know this isn’t a healthy way to live, so try to use that! Use that as a way to sort of CBT-yourself into being okay with seeing your body change. \n\nAlso, I just let myself have some fat tbh. I started seeing my skinny body as ugly, actually i just always thought i was ugly, so i used that to transition into “well whatever. Lemme just be a bit fat LOL”. Its a bit awkward and i DEFINITELY felt really ugly at first and wanted to quit. But i stuck it out. I started exercising and soon enough, my body evened out and im BLOWN AWAY by the way i actually look “normal” now. Many compliments from healthy people motivated me to keep continuing. Its slow and you may even relapse, but it really DOES change.",
          "created_utc": 1710568368.0
        },
        {
          "id": "kv4me24",
          "author": "Far_Blueberry383",
          "body": "It’s just different for me cuz I’m not UW and haven’t been for over 10 years, but then I literally doubled my weight in a year. I’d never been heavy in my life and the weird thing is, I didn’t even realize it was happening. So I’ve spent the last 10 years or so being technically obese, and over the last 8ish months I’ve gotten myself back down to a healthy weight, through changing old unhealthy habits into healthy lifestyle changes. But then I hit a plateau and realized that the only way I could guarantee I’d lose the rest of the weight I wanted was to start counting calories. This started a few months ago. Now I’m obsessed with counting every calorie, weight myself at least twice a day (and being totally destroyed when the number doesn’t go down every day, no matter how unrealistic that is) and tracking all my exercise and calories expended. I’m teetering on the edge of it being a real problem but I still wanna reach my goal so badly even though that number is UW and unhealthy for me. But I just don’t know what’ll happen once I get there (and I am determined to do so). Will I be happy or keep up these obsessive behaviors? So rn I’m a NW but long to be UW. I’m jealous of everyone I see that’s thinner than me and I wish I could look like them, especially people who are really thin, you know the ones I’m talking about. I am scared to death to gain any weight cuz I don’t ever wanna go back to being OW again, and refuse to let that happen, no matter what I have to do to prevent it. Get what I’m saying? I hope I made some sense here. Sometimes my thoughts are all over the place.",
          "created_utc": 1710590511.0
        }
      ]
    },
    {
      "id": "kv5mf9p",
      "author": "Ancient-System23",
      "body": "You totally made sense too!! :) i both sympathize and empathize with you.",
      "created_utc": 1710606029.0,
      "score": 2,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        },
        {
          "id": "kv2nnxc",
          "author": "Ancient-System23",
          "body": "You’re awesome too. Just remind yourself that the ability to even come here and share these thoughts is a GOOD SIGN that you are making progress. Keep being open, and take it day by day. I kicked it in the ass and so can you. I even see the scale going up as something to be proud of now :’)",
          "created_utc": 1710548642.0
        },
        {
          "id": "kv3rjwe",
          "author": "Far_Blueberry383",
          "body": "I’m just so obsessed with my weight, counting every calorie I eat and getting down to that number on the scale that I long to see. But what happens when I get there? Am I gonna even be happy? Will it ever be enough? Then what do I do? I’m already petrified of gaining weight, so how do I get over that and realize that life is more than just a number on a scale? 😔",
          "created_utc": 1710567771.0
        },
        {
          "id": "kv3sg8k",
          "author": "Ancient-System23",
          "body": "Here’s what I did. First, I refused to have mirrors. No full body mirrors nothing, just the one above my sink. Another thing was no scales. Never weighed myself for half a year while i was gaining weight. I set my mind to this mindset: “i’m gaining weight because it’s the healthy thing to do for my mind and body. I NEED to gain weight and eat MORE calories, because if I don’t, i cant lead a happy life if i’m dead”. Seems like you already realize this; you wont actually ever BE happy trying to chase an unrealistic goal weight because you ultimately know this isn’t a healthy way to live, so try to use that! Use that as a way to sort of CBT-yourself into being okay with seeing your body change. \n\nAlso, I just let myself have some fat tbh. I started seeing my skinny body as ugly, actually i just always thought i was ugly, so i used that to transition into “well whatever. Lemme just be a bit fat LOL”. Its a bit awkward and i DEFINITELY felt really ugly at first and wanted to quit. But i stuck it out. I started exercising and soon enough, my body evened out and im BLOWN AWAY by the way i actually look “normal” now. Many compliments from healthy people motivated me to keep continuing. Its slow and you may even relapse, but it really DOES change.",
          "created_utc": 1710568368.0
        },
        {
          "id": "kv4me24",
          "author": "Far_Blueberry383",
          "body": "It’s just different for me cuz I’m not UW and haven’t been for over 10 years, but then I literally doubled my weight in a year. I’d never been heavy in my life and the weird thing is, I didn’t even realize it was happening. So I’ve spent the last 10 years or so being technically obese, and over the last 8ish months I’ve gotten myself back down to a healthy weight, through changing old unhealthy habits into healthy lifestyle changes. But then I hit a plateau and realized that the only way I could guarantee I’d lose the rest of the weight I wanted was to start counting calories. This started a few months ago. Now I’m obsessed with counting every calorie, weight myself at least twice a day (and being totally destroyed when the number doesn’t go down every day, no matter how unrealistic that is) and tracking all my exercise and calories expended. I’m teetering on the edge of it being a real problem but I still wanna reach my goal so badly even though that number is UW and unhealthy for me. But I just don’t know what’ll happen once I get there (and I am determined to do so). Will I be happy or keep up these obsessive behaviors? So rn I’m a NW but long to be UW. I’m jealous of everyone I see that’s thinner than me and I wish I could look like them, especially people who are really thin, you know the ones I’m talking about. I am scared to death to gain any weight cuz I don’t ever wanna go back to being OW again, and refuse to let that happen, no matter what I have to do to prevent it. Get what I’m saying? I hope I made some sense here. Sometimes my thoughts are all over the place.",
          "created_utc": 1710590511.0
        }
      ]
    },
    {
      "id": "kv7coyx",
      "author": "Far_Blueberry383",
      "body": "Gosh, I really am hesitant to say that I even have an ED….but yes, I have become obsessed with counting calories and losing weight. I look at every label and get scared if I cook cuz I don’t know exactly how many calories are in it. I’ve really not been cooking lately and I used to enjoy it and enjoy giving my husband something healthy and good to eat….so I feel so bad…..I’m just stuck in this headspace where I HAVE to lose this weight and I’m absolutely TERRIFIED of gaining all my weight back and being obese again….but I think you’re right, I don’t think I’d be happy once I reached my goal weight but be ecstatic at the same time. I’m really kinda confused rn.",
      "created_utc": 1710629770.0,
      "score": 1,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        },
        {
          "id": "kv2nnxc",
          "author": "Ancient-System23",
          "body": "You’re awesome too. Just remind yourself that the ability to even come here and share these thoughts is a GOOD SIGN that you are making progress. Keep being open, and take it day by day. I kicked it in the ass and so can you. I even see the scale going up as something to be proud of now :’)",
          "created_utc": 1710548642.0
        },
        {
          "id": "kv3rjwe",
          "author": "Far_Blueberry383",
          "body": "I’m just so obsessed with my weight, counting every calorie I eat and getting down to that number on the scale that I long to see. But what happens when I get there? Am I gonna even be happy? Will it ever be enough? Then what do I do? I’m already petrified of gaining weight, so how do I get over that and realize that life is more than just a number on a scale? 😔",
          "created_utc": 1710567771.0
        },
        {
          "id": "kv3sg8k",
          "author": "Ancient-System23",
          "body": "Here’s what I did. First, I refused to have mirrors. No full body mirrors nothing, just the one above my sink. Another thing was no scales. Never weighed myself for half a year while i was gaining weight. I set my mind to this mindset: “i’m gaining weight because it’s the healthy thing to do for my mind and body. I NEED to gain weight and eat MORE calories, because if I don’t, i cant lead a happy life if i’m dead”. Seems like you already realize this; you wont actually ever BE happy trying to chase an unrealistic goal weight because you ultimately know this isn’t a healthy way to live, so try to use that! Use that as a way to sort of CBT-yourself into being okay with seeing your body change. \n\nAlso, I just let myself have some fat tbh. I started seeing my skinny body as ugly, actually i just always thought i was ugly, so i used that to transition into “well whatever. Lemme just be a bit fat LOL”. Its a bit awkward and i DEFINITELY felt really ugly at first and wanted to quit. But i stuck it out. I started exercising and soon enough, my body evened out and im BLOWN AWAY by the way i actually look “normal” now. Many compliments from healthy people motivated me to keep continuing. Its slow and you may even relapse, but it really DOES change.",
          "created_utc": 1710568368.0
        },
        {
          "id": "kv4me24",
          "author": "Far_Blueberry383",
          "body": "It’s just different for me cuz I’m not UW and haven’t been for over 10 years, but then I literally doubled my weight in a year. I’d never been heavy in my life and the weird thing is, I didn’t even realize it was happening. So I’ve spent the last 10 years or so being technically obese, and over the last 8ish months I’ve gotten myself back down to a healthy weight, through changing old unhealthy habits into healthy lifestyle changes. But then I hit a plateau and realized that the only way I could guarantee I’d lose the rest of the weight I wanted was to start counting calories. This started a few months ago. Now I’m obsessed with counting every calorie, weight myself at least twice a day (and being totally destroyed when the number doesn’t go down every day, no matter how unrealistic that is) and tracking all my exercise and calories expended. I’m teetering on the edge of it being a real problem but I still wanna reach my goal so badly even though that number is UW and unhealthy for me. But I just don’t know what’ll happen once I get there (and I am determined to do so). Will I be happy or keep up these obsessive behaviors? So rn I’m a NW but long to be UW. I’m jealous of everyone I see that’s thinner than me and I wish I could look like them, especially people who are really thin, you know the ones I’m talking about. I am scared to death to gain any weight cuz I don’t ever wanna go back to being OW again, and refuse to let that happen, no matter what I have to do to prevent it. Get what I’m saying? I hope I made some sense here. Sometimes my thoughts are all over the place.",
          "created_utc": 1710590511.0
        },
        {
          "id": "kv5m8m4",
          "author": "Ancient-System23",
          "body": "Oh im so sorry youre dealing with this. This is a bit different from my story, so i apologize if i made u feel weird or made any assumptions! What i can say though is: it’s really good you understand that the way you are loosing weight is not necessarily the healthy way to do it. Thats a great step. Maybe instead of setting goal weights, you can set visual goals. Thats kinda what i’ve been doing (i am a dude who’s following the bulk-cut gym thing) and im about to approach the “cut”. Instead of seeing the weight go down, i would rather see my body toned. Maybe the weight stays stagnant, but i’m replacing fat with muscle mass (muscle weighs almost twice as much as bodyfat, so its very tricky for us suffering/in recovery!!). Counting calories for weight loss is not at all a bad thing, but has it become obsessive? If it’s controlling your life, i think its safe to say that once you reach your “goal” you will probably not be happy. It’s a weird disease that makes you constantly compare yourself. My best advice is listen to your body, NOT your mind.",
          "created_utc": 1710605961.0
        }
      ]
    },
    {
      "id": "kv6l1hb",
      "author": "Far_Blueberry383",
      "body": "Thank you so much for listening, offering great advice and trying to help. I really appreciate it. 🥹",
      "created_utc": 1710618896.0,
      "score": 2,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        },
        {
          "id": "kv2nnxc",
          "author": "Ancient-System23",
          "body": "You’re awesome too. Just remind yourself that the ability to even come here and share these thoughts is a GOOD SIGN that you are making progress. Keep being open, and take it day by day. I kicked it in the ass and so can you. I even see the scale going up as something to be proud of now :’)",
          "created_utc": 1710548642.0
        },
        {
          "id": "kv3rjwe",
          "author": "Far_Blueberry383",
          "body": "I’m just so obsessed with my weight, counting every calorie I eat and getting down to that number on the scale that I long to see. But what happens when I get there? Am I gonna even be happy? Will it ever be enough? Then what do I do? I’m already petrified of gaining weight, so how do I get over that and realize that life is more than just a number on a scale? 😔",
          "created_utc": 1710567771.0
        },
        {
          "id": "kv3sg8k",
          "author": "Ancient-System23",
          "body": "Here’s what I did. First, I refused to have mirrors. No full body mirrors nothing, just the one above my sink. Another thing was no scales. Never weighed myself for half a year while i was gaining weight. I set my mind to this mindset: “i’m gaining weight because it’s the healthy thing to do for my mind and body. I NEED to gain weight and eat MORE calories, because if I don’t, i cant lead a happy life if i’m dead”. Seems like you already realize this; you wont actually ever BE happy trying to chase an unrealistic goal weight because you ultimately know this isn’t a healthy way to live, so try to use that! Use that as a way to sort of CBT-yourself into being okay with seeing your body change. \n\nAlso, I just let myself have some fat tbh. I started seeing my skinny body as ugly, actually i just always thought i was ugly, so i used that to transition into “well whatever. Lemme just be a bit fat LOL”. Its a bit awkward and i DEFINITELY felt really ugly at first and wanted to quit. But i stuck it out. I started exercising and soon enough, my body evened out and im BLOWN AWAY by the way i actually look “normal” now. Many compliments from healthy people motivated me to keep continuing. Its slow and you may even relapse, but it really DOES change.",
          "created_utc": 1710568368.0
        },
        {
          "id": "kv4me24",
          "author": "Far_Blueberry383",
          "body": "It’s just different for me cuz I’m not UW and haven’t been for over 10 years, but then I literally doubled my weight in a year. I’d never been heavy in my life and the weird thing is, I didn’t even realize it was happening. So I’ve spent the last 10 years or so being technically obese, and over the last 8ish months I’ve gotten myself back down to a healthy weight, through changing old unhealthy habits into healthy lifestyle changes. But then I hit a plateau and realized that the only way I could guarantee I’d lose the rest of the weight I wanted was to start counting calories. This started a few months ago. Now I’m obsessed with counting every calorie, weight myself at least twice a day (and being totally destroyed when the number doesn’t go down every day, no matter how unrealistic that is) and tracking all my exercise and calories expended. I’m teetering on the edge of it being a real problem but I still wanna reach my goal so badly even though that number is UW and unhealthy for me. But I just don’t know what’ll happen once I get there (and I am determined to do so). Will I be happy or keep up these obsessive behaviors? So rn I’m a NW but long to be UW. I’m jealous of everyone I see that’s thinner than me and I wish I could look like them, especially people who are really thin, you know the ones I’m talking about. I am scared to death to gain any weight cuz I don’t ever wanna go back to being OW again, and refuse to let that happen, no matter what I have to do to prevent it. Get what I’m saying? I hope I made some sense here. Sometimes my thoughts are all over the place.",
          "created_utc": 1710590511.0
        },
        {
          "id": "kv5mf9p",
          "author": "Ancient-System23",
          "body": "You totally made sense too!! :) i both sympathize and empathize with you.",
          "created_utc": 1710606029.0
        }
      ]
    },
    {
      "id": "kv83hau",
      "author": "Far_Blueberry383",
      "body": "I’m at work rn and am on my luch break. I brought a protein shake for my dinner and I couldn’t even bring myself to drink it cuz I bought a Reese’s take 5 and ate one piece and gave the other 2 away. So now I don’t wanna drink it cuz it’ll put me over my “limit” of calories that I’ve set for myself. 🤦‍♀️ But I weighed myself today and lost some more weight so that reinforces the fact that if I restrict, I’ll lose more weight. I don’t know what to do. Should I be worried about all this?? I don’t even know if what I’m doing would classify me as having an ED or if I’m just dieting to lose weight.\n\nAnd I guess you could say I abuse laxatives too, but I get away with it because I suffer from chronic constipation. I think that helps me to lose weight too. What is actually happening to me?",
      "created_utc": 1710640832.0,
      "score": 1,
      "context": [
        {
          "id": "ks52m58",
          "author": "Far_Blueberry383",
          "body": "Good for you! That sounds like the best weekend in heaven EVER!!! So proud of you for taking this important step!!!",
          "created_utc": 1708903852.0
        },
        {
          "id": "ks9iu2k",
          "author": "Throwaway55557783",
          "body": "Not just a weekend, this mornings breakfast was an apple fritter ;) heavennnnnnnnnnnnnnnn!!\n\nThank you so much :)",
          "created_utc": 1708976809.0
        },
        {
          "id": "ksa3k0y",
          "author": "Far_Blueberry383",
          "body": "Mmmmm, haven’t had one of those in a LONG time!!!",
          "created_utc": 1708983535.0
        },
        {
          "id": "ksaqfev",
          "author": "Throwaway55557783",
          "body": "Have one dude!! Trust me!!!!!!!! Why the hell not",
          "created_utc": 1708991517.0
        },
        {
          "id": "ksasn05",
          "author": "Far_Blueberry383",
          "body": "It’s sooooo hard to eat something like that when you’ve been restricting for so long ya know?",
          "created_utc": 1708992346.0
        },
        {
          "id": "ksau8gm",
          "author": "Throwaway55557783",
          "body": "Trust me, I know. But if you just do it for the first time, you win. I stared at that fritter for at least half an hour after getting it, what got me to down it was repeating “bruh it’s just food”. You’ve got this",
          "created_utc": 1708992949.0
        },
        {
          "id": "ksb1bun",
          "author": "Far_Blueberry383",
          "body": "Man, I know I should just shut up and treat myself once in a while, I’m just petrified of gaining even a little weight and then having that destroy my day, week, month, you know the drill. Then you just go back to fasting/restricting and start the cycle all over again. 😞",
          "created_utc": 1708995601.0
        },
        {
          "id": "kscgah9",
          "author": "Throwaway55557783",
          "body": "That’s what held me for so long too. But I realized that if I do nothing, it’s the same as trying to at least listen to all the people I have watched uproot their lives for me, just based on this fixation I had on control over what I put in my mouth and how it effected my body. Because at the end of the day, I’ve wasted so much time being miserable about this disorder and the things it has taken from me that I will never get back. And you know what? Not for a second was I happy in that six years. I missed every birthday. Every holiday. Every little treat or silly moment with anything that made me slightly uncomfortable around everyone I love. Well, if being scared of discomfort and change took all that from me, then I wanna be the most uncomfortable person possible. \n\nAll I’m saying is these made up “rules” are just that. It’s not even funny. Once you actually register to your brain, push that you have an apple fritter in your mouth and there isn’t a reason you shouldn’t. Or you wanna go out for dinner cause you’re a human and you like eating dinner when you’re hungry. Or maybe you don’t. But you know you need to no? Like we all aren’t dumb; we all know how the body works. We know every detail of everything involving food and gaining and little tricks and all that shit. Can you imagine how much happier you’d be if you spent that time on anything else? Just feeling normal, like a human, like you did as a young kid, just doing what you want, regrets not even existing.\n\nPlease, just once, from a stranger on the internet, I’m asking you. Just go and get whatever you want. Not what you think you want. Not a cop out or a compromise. What do you want for breakfast? Fuck bigger than that. What do you wanna do with your life? You get to choose. Are you going to be a statistic of a disorder that has taken everything from you, myself and everyone who suffers, or are you going to be a new statistic, or not one at all, and not care about it whatsoever. You get to decide. I got my life back because my own father had to sit, crying at 3am at the kitchen table about losing me,because even after I collapsed last week, I still came home and went right back to the same bullshit that would have had me dead by my 21st birthday in April. And you know what. I knew that. And I think that was what scared me the most. \n\nDo something about it\n\nShove. The. Fritter. In. Your. Fritter. Hole. And. Go. To. Disney. On. Ice.\n\n(What I did yesterday :))",
          "created_utc": 1709019079.0
        },
        {
          "id": "kscqtu7",
          "author": "Far_Blueberry383",
          "body": "I know you’re right…..about all of it. You just live your life that way for so long, you forget that there’s another way, a happy existence. I will definitely think long and hard about what you said, and what I should be doing with my life and all my energy (if I had any left) instead of what I have been doing, which is not only destroying my life but the lives of the people around me who genuinely care about me. Thank you for caring. And I can’t tell you how happy I am for you, for taking these important first steps toward a new life that you should’ve been living all along. ❤️",
          "created_utc": 1709026671.0
        },
        {
          "id": "kv2nnxc",
          "author": "Ancient-System23",
          "body": "You’re awesome too. Just remind yourself that the ability to even come here and share these thoughts is a GOOD SIGN that you are making progress. Keep being open, and take it day by day. I kicked it in the ass and so can you. I even see the scale going up as something to be proud of now :’)",
          "created_utc": 1710548642.0
        },
        {
          "id": "kv3rjwe",
          "author": "Far_Blueberry383",
          "body": "I’m just so obsessed with my weight, counting every calorie I eat and getting down to that number on the scale that I long to see. But what happens when I get there? Am I gonna even be happy? Will it ever be enough? Then what do I do? I’m already petrified of gaining weight, so how do I get over that and realize that life is more than just a number on a scale? 😔",
          "created_utc": 1710567771.0
        },
        {
          "id": "kv3sg8k",
          "author": "Ancient-System23",
          "body": "Here’s what I did. First, I refused to have mirrors. No full body mirrors nothing, just the one above my sink. Another thing was no scales. Never weighed myself for half a year while i was gaining weight. I set my mind to this mindset: “i’m gaining weight because it’s the healthy thing to do for my mind and body. I NEED to gain weight and eat MORE calories, because if I don’t, i cant lead a happy life if i’m dead”. Seems like you already realize this; you wont actually ever BE happy trying to chase an unrealistic goal weight because you ultimately know this isn’t a healthy way to live, so try to use that! Use that as a way to sort of CBT-yourself into being okay with seeing your body change. \n\nAlso, I just let myself have some fat tbh. I started seeing my skinny body as ugly, actually i just always thought i was ugly, so i used that to transition into “well whatever. Lemme just be a bit fat LOL”. Its a bit awkward and i DEFINITELY felt really ugly at first and wanted to quit. But i stuck it out. I started exercising and soon enough, my body evened out and im BLOWN AWAY by the way i actually look “normal” now. Many compliments from healthy people motivated me to keep continuing. Its slow and you may even relapse, but it really DOES change.",
          "created_utc": 1710568368.0
        },
        {
          "id": "kv4me24",
          "author": "Far_Blueberry383",
          "body": "It’s just different for me cuz I’m not UW and haven’t been for over 10 years, but then I literally doubled my weight in a year. I’d never been heavy in my life and the weird thing is, I didn’t even realize it was happening. So I’ve spent the last 10 years or so being technically obese, and over the last 8ish months I’ve gotten myself back down to a healthy weight, through changing old unhealthy habits into healthy lifestyle changes. But then I hit a plateau and realized that the only way I could guarantee I’d lose the rest of the weight I wanted was to start counting calories. This started a few months ago. Now I’m obsessed with counting every calorie, weight myself at least twice a day (and being totally destroyed when the number doesn’t go down every day, no matter how unrealistic that is) and tracking all my exercise and calories expended. I’m teetering on the edge of it being a real problem but I still wanna reach my goal so badly even though that number is UW and unhealthy for me. But I just don’t know what’ll happen once I get there (and I am determined to do so). Will I be happy or keep up these obsessive behaviors? So rn I’m a NW but long to be UW. I’m jealous of everyone I see that’s thinner than me and I wish I could look like them, especially people who are really thin, you know the ones I’m talking about. I am scared to death to gain any weight cuz I don’t ever wanna go back to being OW again, and refuse to let that happen, no matter what I have to do to prevent it. Get what I’m saying? I hope I made some sense here. Sometimes my thoughts are all over the place.",
          "created_utc": 1710590511.0
        },
        {
          "id": "kv5mf9p",
          "author": "Ancient-System23",
          "body": "You totally made sense too!! :) i both sympathize and empathize with you.",
          "created_utc": 1710606029.0
        }
      ]
    }
  ]
}