{
  "id": "1b4bh8z",
  "subreddit": "AnorexiaNervosa",
  "author": "Thereal_Ben",
  "created_utc": 1709341884.0,
  "title": "Does ed give you a sort of purpose?",
  "selftext": "Hi if I’m being completely honest I have been going through a really tough time lately and I have been recovered for almost a year, but I’m starting to feel like I did at my lowest, suffering every last calorie I in-jest but completely letting go of ed wrecked the little confidence I had, I know it is not true confidence but without it I truly feel dead inside. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1b4bh8z/does_ed_give_you_a_sort_of_purpose/",
  "score": 112,
  "num_comments": 41,
  "comments": [
    {
      "id": "ksxted2",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1709341884.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ksxvyu8",
      "author": "BulkyThing1363",
      "body": "Yep this is literally me. Recovering ruined my self esteem and tiny amount of confidence I did have. I feel like engaging in the ED gives me something to do bc I am often bored a lot due to my meds and lifestyle.",
      "created_utc": 1709342920.0,
      "score": 60,
      "context": []
    },
    {
      "id": "ksxwmg6",
      "author": "sarelijelly",
      "body": "I recently relapsed because I realized that even in recovery, my quality of life was very poor (due to poverty, mostly) and I felt even more miserable in a larger, recovered body. My ED is the only reason I wake up in the morning.",
      "created_utc": 1709343185.0,
      "score": 28,
      "context": []
    },
    {
      "id": "ksye3td",
      "author": "Vegetable-Try9263",
      "body": "I feel like when EDs start to take up most of your mental space, they basically start to rob you of every other source of purpose or fulfillment. Everything becomes secondary to the ED. \n\nI think some people’s brains latch onto ED behaviors in order to emotionally self-regulate, but when your brain starts to become increasingly reliant on your ED as your main coping mechanism it literally alienates you from most other sources of fulfillment or purpose. EDs are often so, SO isolating. When you’re that deep in it, the idea of finding another purpose in your day to day life feels genuinely unfathomable - living a life that *isnt* dictated by your ED will seem totally alien when that is your entire reality right now. \n\nI really feel like this is one of the biggest reasons why ED recovery can be so insanely difficult a lot of the time. Finding another purpose/motivation to replace the role your ED currently has in your life is ridiculously hard and often inaccessible to many people. And to make matters worse, the fact that EDs can drain so much of your mental AND physical energy due to malnourishment makes finding motivation for anything incredibly difficult. BUT that obviously doesn’t mean it’s impossible. Anger/spite can honestly be one of the best motivators - rage at how much your illness has taken from you, at how much it CONTINUES to demand from you. It’s hard to recover with low self worth but when I feel worthless I can at least still feel motivated by anger.\n\nRecovery is truly a massively life-altering process, the sheer amount of change that you have to deal with can feel immense and scary - even more so for someone with a nutritionally deprived brain (starved brains often have very black-and-white thought processes). I swear EDs are so fucking evil, they’re like an insidious death trap with the way they can completely take over both your brain and your life.",
      "created_utc": 1709350760.0,
      "score": 27,
      "context": []
    },
    {
      "id": "kszue3a",
      "author": "None",
      "body": "it does. anorexia made me feel like i was on some secret mission where i was in full control, i loved being sneaky about food etc until it started to literally fucking break my body apart",
      "created_utc": 1709384322.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ksyhaza",
      "author": "ajjanaajjana",
      "body": "You finally put it into words for me. My ed is like a whole full time job, but it honestly gives me a reason to wake up in the morning, to exercise, to reach a goal etc, idk if i'll ever recover",
      "created_utc": 1709352273.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ksygimw",
      "author": "denahom-chikn",
      "body": "i struggle with somewhat frequent relapses because i can’t led ed go",
      "created_utc": 1709351888.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ksylk1v",
      "author": "LifeguardForeign6479",
      "body": "The hardest part of my early recovery was legit what to do with my time and, more so, my life focus",
      "created_utc": 1709354423.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kt05h8p",
      "author": "None",
      "body": "Bulimia made me feel like I had no purpose. Lost teeth, puffy face. Anorexia makes me feel more valuable as a human being. People around  me stupidly encouraged it because I lost weight. Now I'm being told to eat and I can't do it. It helps with stress... I don't remember making the leap from one to another. Bulimia is so physical and anorexia is so cerebral.",
      "created_utc": 1709389603.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ksyjje0",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1709353385.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ksyo7vr",
      "author": "Remarkable-Alarm7428",
      "body": "I feel like you summarized how I've been feeling for the last few months. I feel so lonely when I'm not starving to death.",
      "created_utc": 1709355827.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kt2ksrs",
      "author": "Only-Bodybuilder5636",
      "body": "Yeah especially when you’re depressed, it’s like “life sucks but at least I didn’t eat more than (x) calories today”",
      "created_utc": 1709421482.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kt0od0p",
      "author": "BlueEyedGenius1",
      "body": "For me it makes me feel like I got some self worth and purpose. I have thing to concentrate on that is easy and simple and at times quite effortless. For me it’s less thinking.",
      "created_utc": 1709396830.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ksxz9ek",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1709344256.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ksyl4no",
      "author": "None",
      "body": "Absolutely. It gives my days meaning and it makes my days brighter all the time. Whether I'm isolated or not. I'm happier and feel healthier with thinness in my life.",
      "created_utc": 1709354204.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kt2jnrd",
      "author": "rissaro0o",
      "body": "I feel like it’s become part of my identity and without it, I feel unsafe.",
      "created_utc": 1709421045.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kt85adw",
      "author": "Little_Astronaut5641",
      "body": "totally. it makes you feel something  and have something to do and pay attention to. when i’m eating healthily i feel like i have less of a purpose and im not working towards anything",
      "created_utc": 1709511700.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ksxw8tw",
      "author": "Thereal_Ben",
      "body": "Yeah its really hard, it does not help that I’m at one of the lowest points in my life and I had some of the best moments when I had ed, but hopefully you do better",
      "created_utc": 1709343032.0,
      "score": 9,
      "context": [
        {
          "id": "ksxvyu8",
          "author": "BulkyThing1363",
          "body": "Yep this is literally me. Recovering ruined my self esteem and tiny amount of confidence I did have. I feel like engaging in the ED gives me something to do bc I am often bored a lot due to my meds and lifestyle.",
          "created_utc": 1709342920.0
        }
      ]
    },
    {
      "id": "ksxwowr",
      "author": "sarelijelly",
      "body": "Sans the meds, we are the EXACT same person. I’m sending you lots of hugs rn.<3",
      "created_utc": 1709343212.0,
      "score": 4,
      "context": [
        {
          "id": "ksxvyu8",
          "author": "BulkyThing1363",
          "body": "Yep this is literally me. Recovering ruined my self esteem and tiny amount of confidence I did have. I feel like engaging in the ED gives me something to do bc I am often bored a lot due to my meds and lifestyle.",
          "created_utc": 1709342920.0
        }
      ]
    },
    {
      "id": "ksxx179",
      "author": "Thereal_Ben",
      "body": "Man I can’t even fathom how hard that must be in my case it is not money related, in fact I don’t know about you but feeling the pain of an empty stomach for hours upon hours makes me forget about a-lot of external pain. I hope you get through this rough patch. I’m really sorry to hear that",
      "created_utc": 1709343348.0,
      "score": 8,
      "context": [
        {
          "id": "ksxwmg6",
          "author": "sarelijelly",
          "body": "I recently relapsed because I realized that even in recovery, my quality of life was very poor (due to poverty, mostly) and I felt even more miserable in a larger, recovered body. My ED is the only reason I wake up in the morning.",
          "created_utc": 1709343185.0
        }
      ]
    },
    {
      "id": "ksz7qz9",
      "author": "Dirty_Commie_Jesus",
      "body": "Totally understand. I quasi recovered but I still have my safe foods. Being so poor that one can't afford Fairlife milk and name brand cottage cheese makes me feel so out of control in life. Hmm, how can I take back control? It was hard not to relapse, but I somehow managed.",
      "created_utc": 1709368520.0,
      "score": 7,
      "context": [
        {
          "id": "ksxwmg6",
          "author": "sarelijelly",
          "body": "I recently relapsed because I realized that even in recovery, my quality of life was very poor (due to poverty, mostly) and I felt even more miserable in a larger, recovered body. My ED is the only reason I wake up in the morning.",
          "created_utc": 1709343185.0
        }
      ]
    },
    {
      "id": "ksylt1q",
      "author": "None",
      "body": "That logically makes no sense. Are you suggesting that we're unable to derive meaning or happiness from other sources of fulfillment, like graduating, getting a job, falling in love? Eating disorders make life tolerable as one goes through the motions. They don't stop life from happening and they don't rob you of your prior happiness nor do they steal your future happiness. They numb you out just enough to keep going. This couldn't be more false. Unfortunately some lose their lives and that's the only time that they're robbed of future happiness. You can't be happy if you're dead. You can absolutely be happy now or 5 seconds from now as you were yesterday for a few moments. An eating disorder doesn't take that away from anyone. The idea of pure bliss all the time is false and sets people up to fail.\n\nEdit: People have every right to use crutches as they see fit. We all do it. Every single person in this world has one. Anger is useless when you have nothing to pour it into. The best revenge is success. Subtle anger can help you achieve long term success, only when subtle. An eating disorder is like self protection by hibernating. We come out when we're ready, when we're more confident, when we're recharged, when we love being thin etc. The depletion is the hibernation and the emotional rest we require. Numbness is a prolonged state of rest and healing. I'm already in my revenge era after suffering from bulimia, epilepsy...after gaining all that weight back and craving thinness everyday of my life. I'm getting my life back and I'm getting the body that I love back. That's where I'm channeling a piece of my anger and to me, to us, this is worthwhile. Especially when you know it will work...This is how we choose to live and it works.",
      "created_utc": 1709354552.0,
      "score": -10,
      "context": [
        {
          "id": "ksye3td",
          "author": "Vegetable-Try9263",
          "body": "I feel like when EDs start to take up most of your mental space, they basically start to rob you of every other source of purpose or fulfillment. Everything becomes secondary to the ED. \n\nI think some people’s brains latch onto ED behaviors in order to emotionally self-regulate, but when your brain starts to become increasingly reliant on your ED as your main coping mechanism it literally alienates you from most other sources of fulfillment or purpose. EDs are often so, SO isolating. When you’re that deep in it, the idea of finding another purpose in your day to day life feels genuinely unfathomable - living a life that *isnt* dictated by your ED will seem totally alien when that is your entire reality right now. \n\nI really feel like this is one of the biggest reasons why ED recovery can be so insanely difficult a lot of the time. Finding another purpose/motivation to replace the role your ED currently has in your life is ridiculously hard and often inaccessible to many people. And to make matters worse, the fact that EDs can drain so much of your mental AND physical energy due to malnourishment makes finding motivation for anything incredibly difficult. BUT that obviously doesn’t mean it’s impossible. Anger/spite can honestly be one of the best motivators - rage at how much your illness has taken from you, at how much it CONTINUES to demand from you. It’s hard to recover with low self worth but when I feel worthless I can at least still feel motivated by anger.\n\nRecovery is truly a massively life-altering process, the sheer amount of change that you have to deal with can feel immense and scary - even more so for someone with a nutritionally deprived brain (starved brains often have very black-and-white thought processes). I swear EDs are so fucking evil, they’re like an insidious death trap with the way they can completely take over both your brain and your life.",
          "created_utc": 1709350760.0
        }
      ]
    },
    {
      "id": "ksykyts",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1709354120.0,
      "score": -11,
      "context": [
        {
          "id": "ksyjje0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1709353385.0
        }
      ]
    },
    {
      "id": "kt2si2i",
      "author": "Thereal_Ben",
      "body": "Yeah 100% I don’t know if it is the same for you but going over my calorie goal for a day feels like physical pain and torture",
      "created_utc": 1709424545.0,
      "score": 1,
      "context": [
        {
          "id": "kt2ksrs",
          "author": "Only-Bodybuilder5636",
          "body": "Yeah especially when you’re depressed, it’s like “life sucks but at least I didn’t eat more than (x) calories today”",
          "created_utc": 1709421482.0
        }
      ]
    },
    {
      "id": "kt1jvtw",
      "author": "None",
      "body": "Yes! The less thinking is so on point. Especially during hardship, my eating disorder actually gives me the ability to focus on the present moment instead of the capacity to think and feel endlessly about the hardship I’m experiencing. It’s like going through life with rose coloured glasses. Everything is effortless and the world is open to you with endless possibilities. Who wouldn’t want that? The truth is, everyone has their own method, and this is ours. \n\nThe sad truth is that if I weren’t energy deficient, I’d be so unbelievably stuck in my hardship that I’d spend hours cussing in my head instead of taking the stroll I just took today and watched the little ducks swimming in the pond. It was so lovely and I was able to do that without all that noise in my head. Of course it’s still there, but with starvation, it’s lessened tenfold. I can’t even remember the last time I physically shook of anger and when I have, it was because I had eaten enough to muster the energy to make that physically possible.",
      "created_utc": 1709408021.0,
      "score": 2,
      "context": [
        {
          "id": "kt0od0p",
          "author": "BlueEyedGenius1",
          "body": "For me it makes me feel like I got some self worth and purpose. I have thing to concentrate on that is easy and simple and at times quite effortless. For me it’s less thinking.",
          "created_utc": 1709396830.0
        }
      ]
    },
    {
      "id": "ksy5xtp",
      "author": "Thereal_Ben",
      "body": "Thanks, for you too, it kind of becomes your whole life",
      "created_utc": 1709347086.0,
      "score": 1,
      "context": [
        {
          "id": "ksxz9ek",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1709344256.0
        }
      ]
    },
    {
      "id": "ksxwjpt",
      "author": "BulkyThing1363",
      "body": "Same here. Thanks and I hope things start to get better for you too. EDs are very complex things.",
      "created_utc": 1709343154.0,
      "score": 5,
      "context": [
        {
          "id": "ksxvyu8",
          "author": "BulkyThing1363",
          "body": "Yep this is literally me. Recovering ruined my self esteem and tiny amount of confidence I did have. I feel like engaging in the ED gives me something to do bc I am often bored a lot due to my meds and lifestyle.",
          "created_utc": 1709342920.0
        },
        {
          "id": "ksxw8tw",
          "author": "Thereal_Ben",
          "body": "Yeah its really hard, it does not help that I’m at one of the lowest points in my life and I had some of the best moments when I had ed, but hopefully you do better",
          "created_utc": 1709343032.0
        }
      ]
    },
    {
      "id": "ksxwwex",
      "author": "BulkyThing1363",
      "body": "Yay! Hugs to you as well 🥰",
      "created_utc": 1709343296.0,
      "score": 4,
      "context": [
        {
          "id": "ksxvyu8",
          "author": "BulkyThing1363",
          "body": "Yep this is literally me. Recovering ruined my self esteem and tiny amount of confidence I did have. I feel like engaging in the ED gives me something to do bc I am often bored a lot due to my meds and lifestyle.",
          "created_utc": 1709342920.0
        },
        {
          "id": "ksxwowr",
          "author": "sarelijelly",
          "body": "Sans the meds, we are the EXACT same person. I’m sending you lots of hugs rn.<3",
          "created_utc": 1709343212.0
        }
      ]
    },
    {
      "id": "kt1ms8m",
      "author": "livelaughvomit",
      "body": "Same. I'm depressed and very anxious throughout the whole day, feels like I have nothing to live for except for this ed. I feel completely hopeless so my ed gives me a sense of purpose and control, which I don't have otherwise.",
      "created_utc": 1709409063.0,
      "score": 1,
      "context": [
        {
          "id": "ksxwmg6",
          "author": "sarelijelly",
          "body": "I recently relapsed because I realized that even in recovery, my quality of life was very poor (due to poverty, mostly) and I felt even more miserable in a larger, recovered body. My ED is the only reason I wake up in the morning.",
          "created_utc": 1709343185.0
        },
        {
          "id": "ksxx179",
          "author": "Thereal_Ben",
          "body": "Man I can’t even fathom how hard that must be in my case it is not money related, in fact I don’t know about you but feeling the pain of an empty stomach for hours upon hours makes me forget about a-lot of external pain. I hope you get through this rough patch. I’m really sorry to hear that",
          "created_utc": 1709343348.0
        }
      ]
    },
    {
      "id": "ksytbk8",
      "author": "Vegetable-Try9263",
      "body": "“numbing you out” IS stealing your happiness. EDs can absolutely stop you from living/engaging with your life fully, purely because of how much focus they take away from other aspects of your life. Especially when they escalate to a point where they dominate your routines and affect your ability to engage with other people. Life only “works” with AN or bulimia until it doesn’t anymore. Some people may never recover, but those people ALSO face long term consequences and miss out on major life experiences precisely because of their disorder.\n\nI never said you couldn’t experience happiness or brief moments of fulfillment while living with an ED, but the ED is there as a coping mechanism for a reason. You cannot be mentally healthy while having AN. I’m sorry what I said rubbed you the wrong the way, but I still stand by what I said.",
      "created_utc": 1709358693.0,
      "score": 15,
      "context": [
        {
          "id": "ksye3td",
          "author": "Vegetable-Try9263",
          "body": "I feel like when EDs start to take up most of your mental space, they basically start to rob you of every other source of purpose or fulfillment. Everything becomes secondary to the ED. \n\nI think some people’s brains latch onto ED behaviors in order to emotionally self-regulate, but when your brain starts to become increasingly reliant on your ED as your main coping mechanism it literally alienates you from most other sources of fulfillment or purpose. EDs are often so, SO isolating. When you’re that deep in it, the idea of finding another purpose in your day to day life feels genuinely unfathomable - living a life that *isnt* dictated by your ED will seem totally alien when that is your entire reality right now. \n\nI really feel like this is one of the biggest reasons why ED recovery can be so insanely difficult a lot of the time. Finding another purpose/motivation to replace the role your ED currently has in your life is ridiculously hard and often inaccessible to many people. And to make matters worse, the fact that EDs can drain so much of your mental AND physical energy due to malnourishment makes finding motivation for anything incredibly difficult. BUT that obviously doesn’t mean it’s impossible. Anger/spite can honestly be one of the best motivators - rage at how much your illness has taken from you, at how much it CONTINUES to demand from you. It’s hard to recover with low self worth but when I feel worthless I can at least still feel motivated by anger.\n\nRecovery is truly a massively life-altering process, the sheer amount of change that you have to deal with can feel immense and scary - even more so for someone with a nutritionally deprived brain (starved brains often have very black-and-white thought processes). I swear EDs are so fucking evil, they’re like an insidious death trap with the way they can completely take over both your brain and your life.",
          "created_utc": 1709350760.0
        },
        {
          "id": "ksylt1q",
          "author": "None",
          "body": "That logically makes no sense. Are you suggesting that we're unable to derive meaning or happiness from other sources of fulfillment, like graduating, getting a job, falling in love? Eating disorders make life tolerable as one goes through the motions. They don't stop life from happening and they don't rob you of your prior happiness nor do they steal your future happiness. They numb you out just enough to keep going. This couldn't be more false. Unfortunately some lose their lives and that's the only time that they're robbed of future happiness. You can't be happy if you're dead. You can absolutely be happy now or 5 seconds from now as you were yesterday for a few moments. An eating disorder doesn't take that away from anyone. The idea of pure bliss all the time is false and sets people up to fail.\n\nEdit: People have every right to use crutches as they see fit. We all do it. Every single person in this world has one. Anger is useless when you have nothing to pour it into. The best revenge is success. Subtle anger can help you achieve long term success, only when subtle. An eating disorder is like self protection by hibernating. We come out when we're ready, when we're more confident, when we're recharged, when we love being thin etc. The depletion is the hibernation and the emotional rest we require. Numbness is a prolonged state of rest and healing. I'm already in my revenge era after suffering from bulimia, epilepsy...after gaining all that weight back and craving thinness everyday of my life. I'm getting my life back and I'm getting the body that I love back. That's where I'm channeling a piece of my anger and to me, to us, this is worthwhile. Especially when you know it will work...This is how we choose to live and it works.",
          "created_utc": 1709354552.0
        }
      ]
    },
    {
      "id": "kt3bx5p",
      "author": "NotAThrowAway28",
      "body": "This is seriously romanticizing eating disorders and completely proves what the comment that you're replying to correct.\n\nIt makes absolute logical sense. Eating disorders numb your emotions, and the only consistent emotion that comes out when most are restricting heavily? Anger. \n\nI got fucking married and while I was happy as hell, I didn't feel the full extent of my emotions. And that hurts because I had just gotten out of res too. \n\nEDs aren't a blanket of protecting ourselves. They are killing us. Blatantly killing all of us. They are insidious and continue to try making us sicker. No \"goals\" that we have are ever enough. It's always that we have to go more extreme and harder. That removes more emotions, that adds paranoia, delusions, insomnia, anxiety and depression.\n\nEating disorders don't heal anything. They are not healthy coping mechanisms and many use them as such- I do it too I'm not being a hypocrite. But they're not healing anything they're making emotional regulation worse and damaging our bodies and brains. \n\nPlease talk to someone about your outlook on this. It's not okay, it's not safe, and expressing it like this in this subreddit is just pro-ana bullshit.",
      "created_utc": 1709432502.0,
      "score": 5,
      "context": [
        {
          "id": "ksye3td",
          "author": "Vegetable-Try9263",
          "body": "I feel like when EDs start to take up most of your mental space, they basically start to rob you of every other source of purpose or fulfillment. Everything becomes secondary to the ED. \n\nI think some people’s brains latch onto ED behaviors in order to emotionally self-regulate, but when your brain starts to become increasingly reliant on your ED as your main coping mechanism it literally alienates you from most other sources of fulfillment or purpose. EDs are often so, SO isolating. When you’re that deep in it, the idea of finding another purpose in your day to day life feels genuinely unfathomable - living a life that *isnt* dictated by your ED will seem totally alien when that is your entire reality right now. \n\nI really feel like this is one of the biggest reasons why ED recovery can be so insanely difficult a lot of the time. Finding another purpose/motivation to replace the role your ED currently has in your life is ridiculously hard and often inaccessible to many people. And to make matters worse, the fact that EDs can drain so much of your mental AND physical energy due to malnourishment makes finding motivation for anything incredibly difficult. BUT that obviously doesn’t mean it’s impossible. Anger/spite can honestly be one of the best motivators - rage at how much your illness has taken from you, at how much it CONTINUES to demand from you. It’s hard to recover with low self worth but when I feel worthless I can at least still feel motivated by anger.\n\nRecovery is truly a massively life-altering process, the sheer amount of change that you have to deal with can feel immense and scary - even more so for someone with a nutritionally deprived brain (starved brains often have very black-and-white thought processes). I swear EDs are so fucking evil, they’re like an insidious death trap with the way they can completely take over both your brain and your life.",
          "created_utc": 1709350760.0
        },
        {
          "id": "ksylt1q",
          "author": "None",
          "body": "That logically makes no sense. Are you suggesting that we're unable to derive meaning or happiness from other sources of fulfillment, like graduating, getting a job, falling in love? Eating disorders make life tolerable as one goes through the motions. They don't stop life from happening and they don't rob you of your prior happiness nor do they steal your future happiness. They numb you out just enough to keep going. This couldn't be more false. Unfortunately some lose their lives and that's the only time that they're robbed of future happiness. You can't be happy if you're dead. You can absolutely be happy now or 5 seconds from now as you were yesterday for a few moments. An eating disorder doesn't take that away from anyone. The idea of pure bliss all the time is false and sets people up to fail.\n\nEdit: People have every right to use crutches as they see fit. We all do it. Every single person in this world has one. Anger is useless when you have nothing to pour it into. The best revenge is success. Subtle anger can help you achieve long term success, only when subtle. An eating disorder is like self protection by hibernating. We come out when we're ready, when we're more confident, when we're recharged, when we love being thin etc. The depletion is the hibernation and the emotional rest we require. Numbness is a prolonged state of rest and healing. I'm already in my revenge era after suffering from bulimia, epilepsy...after gaining all that weight back and craving thinness everyday of my life. I'm getting my life back and I'm getting the body that I love back. That's where I'm channeling a piece of my anger and to me, to us, this is worthwhile. Especially when you know it will work...This is how we choose to live and it works.",
          "created_utc": 1709354552.0
        }
      ]
    },
    {
      "id": "ksyuhz2",
      "author": "Vegetable-Try9263",
      "body": "so by your logic, someone in the midst of full blown psychosis (fully unable to distinguish reality from hallucinations/delusions), or someone whose organs are literally shutting down from starvation (aka poor eating habits..), should have no problem acquiring/working a full-time job or getting a degree? you’ve gotta be a troll",
      "created_utc": 1709359411.0,
      "score": 7,
      "context": [
        {
          "id": "ksyjje0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1709353385.0
        },
        {
          "id": "ksykyts",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1709354120.0
        }
      ]
    },
    {
      "id": "ksz385m",
      "author": "anitacina",
      "body": "Hahahahahahahah",
      "created_utc": 1709365225.0,
      "score": 3,
      "context": [
        {
          "id": "ksyjje0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1709353385.0
        },
        {
          "id": "ksykyts",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1709354120.0
        }
      ]
    },
    {
      "id": "kt2lgwz",
      "author": "BlueEyedGenius1",
      "body": "I am the total reverse, for me I have gained more energy now have done in years previously when my emotions were bad okay I used to over eat and not move off the couch for days weeks at time. Now I am the reverse all I wanna do is move is move off the couch I don’t wanna sit still and or eat. \n\nLess thinking about food, not having to thinking about it during the day has freed my time up to do other things and better brain power.",
      "created_utc": 1709421741.0,
      "score": 1,
      "context": [
        {
          "id": "kt0od0p",
          "author": "BlueEyedGenius1",
          "body": "For me it makes me feel like I got some self worth and purpose. I have thing to concentrate on that is easy and simple and at times quite effortless. For me it’s less thinking.",
          "created_utc": 1709396830.0
        },
        {
          "id": "kt1jvtw",
          "author": "None",
          "body": "Yes! The less thinking is so on point. Especially during hardship, my eating disorder actually gives me the ability to focus on the present moment instead of the capacity to think and feel endlessly about the hardship I’m experiencing. It’s like going through life with rose coloured glasses. Everything is effortless and the world is open to you with endless possibilities. Who wouldn’t want that? The truth is, everyone has their own method, and this is ours. \n\nThe sad truth is that if I weren’t energy deficient, I’d be so unbelievably stuck in my hardship that I’d spend hours cussing in my head instead of taking the stroll I just took today and watched the little ducks swimming in the pond. It was so lovely and I was able to do that without all that noise in my head. Of course it’s still there, but with starvation, it’s lessened tenfold. I can’t even remember the last time I physically shook of anger and when I have, it was because I had eaten enough to muster the energy to make that physically possible.",
          "created_utc": 1709408021.0
        }
      ]
    },
    {
      "id": "kt3cta7",
      "author": "None",
      "body": "Lol don't call me pro ana for expressing what I think and feel. You have no right to judge me going on about not feeling your emotions at your own wedding despite contradicting yourself to say you felt enough emotion to feel \"happy as hell.\" That's your problem, not mine.",
      "created_utc": 1709432879.0,
      "score": 0,
      "context": [
        {
          "id": "ksye3td",
          "author": "Vegetable-Try9263",
          "body": "I feel like when EDs start to take up most of your mental space, they basically start to rob you of every other source of purpose or fulfillment. Everything becomes secondary to the ED. \n\nI think some people’s brains latch onto ED behaviors in order to emotionally self-regulate, but when your brain starts to become increasingly reliant on your ED as your main coping mechanism it literally alienates you from most other sources of fulfillment or purpose. EDs are often so, SO isolating. When you’re that deep in it, the idea of finding another purpose in your day to day life feels genuinely unfathomable - living a life that *isnt* dictated by your ED will seem totally alien when that is your entire reality right now. \n\nI really feel like this is one of the biggest reasons why ED recovery can be so insanely difficult a lot of the time. Finding another purpose/motivation to replace the role your ED currently has in your life is ridiculously hard and often inaccessible to many people. And to make matters worse, the fact that EDs can drain so much of your mental AND physical energy due to malnourishment makes finding motivation for anything incredibly difficult. BUT that obviously doesn’t mean it’s impossible. Anger/spite can honestly be one of the best motivators - rage at how much your illness has taken from you, at how much it CONTINUES to demand from you. It’s hard to recover with low self worth but when I feel worthless I can at least still feel motivated by anger.\n\nRecovery is truly a massively life-altering process, the sheer amount of change that you have to deal with can feel immense and scary - even more so for someone with a nutritionally deprived brain (starved brains often have very black-and-white thought processes). I swear EDs are so fucking evil, they’re like an insidious death trap with the way they can completely take over both your brain and your life.",
          "created_utc": 1709350760.0
        },
        {
          "id": "ksylt1q",
          "author": "None",
          "body": "That logically makes no sense. Are you suggesting that we're unable to derive meaning or happiness from other sources of fulfillment, like graduating, getting a job, falling in love? Eating disorders make life tolerable as one goes through the motions. They don't stop life from happening and they don't rob you of your prior happiness nor do they steal your future happiness. They numb you out just enough to keep going. This couldn't be more false. Unfortunately some lose their lives and that's the only time that they're robbed of future happiness. You can't be happy if you're dead. You can absolutely be happy now or 5 seconds from now as you were yesterday for a few moments. An eating disorder doesn't take that away from anyone. The idea of pure bliss all the time is false and sets people up to fail.\n\nEdit: People have every right to use crutches as they see fit. We all do it. Every single person in this world has one. Anger is useless when you have nothing to pour it into. The best revenge is success. Subtle anger can help you achieve long term success, only when subtle. An eating disorder is like self protection by hibernating. We come out when we're ready, when we're more confident, when we're recharged, when we love being thin etc. The depletion is the hibernation and the emotional rest we require. Numbness is a prolonged state of rest and healing. I'm already in my revenge era after suffering from bulimia, epilepsy...after gaining all that weight back and craving thinness everyday of my life. I'm getting my life back and I'm getting the body that I love back. That's where I'm channeling a piece of my anger and to me, to us, this is worthwhile. Especially when you know it will work...This is how we choose to live and it works.",
          "created_utc": 1709354552.0
        },
        {
          "id": "kt3bx5p",
          "author": "NotAThrowAway28",
          "body": "This is seriously romanticizing eating disorders and completely proves what the comment that you're replying to correct.\n\nIt makes absolute logical sense. Eating disorders numb your emotions, and the only consistent emotion that comes out when most are restricting heavily? Anger. \n\nI got fucking married and while I was happy as hell, I didn't feel the full extent of my emotions. And that hurts because I had just gotten out of res too. \n\nEDs aren't a blanket of protecting ourselves. They are killing us. Blatantly killing all of us. They are insidious and continue to try making us sicker. No \"goals\" that we have are ever enough. It's always that we have to go more extreme and harder. That removes more emotions, that adds paranoia, delusions, insomnia, anxiety and depression.\n\nEating disorders don't heal anything. They are not healthy coping mechanisms and many use them as such- I do it too I'm not being a hypocrite. But they're not healing anything they're making emotional regulation worse and damaging our bodies and brains. \n\nPlease talk to someone about your outlook on this. It's not okay, it's not safe, and expressing it like this in this subreddit is just pro-ana bullshit.",
          "created_utc": 1709432502.0
        }
      ]
    },
    {
      "id": "kt1fog6",
      "author": "None",
      "body": "Lol we’re not talking about psychosis. We’re on an AN forum and historically AN hardly stops anyone from living unless they’re out to kill themselves or have done extreme damage to which the “overachievers” learn to get by just enough. Occasionally you meet the severely mentally ill who happen to be insanely privileged and can get away with having little to no goals in life. What you’re describing is the anomaly. It almost happened to me, but that wasn’t an eating disorder. That was decades of undetected and untreated epilepsy that nearly killed me. I’m happily motivated to prove that eating disorders don’t have to kill you or ruin your life but epilepsy and other neurological conditions does and will.\n\nEdit: It’s not the eating disorder that prevents someone from living. It’s usually their depression and anxiety which is often the backbone of their eating disorder to begin with. We’ll never make progress in medicine and research unless we accept and come to the conclusion that people can absolutely live with active eating disorders and people are doing it every damn day. A little nutritional guidance is all one needs, but then some people wouldn’t have jobs, would they?",
      "created_utc": 1709406513.0,
      "score": -4,
      "context": [
        {
          "id": "ksyjje0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1709353385.0
        },
        {
          "id": "ksykyts",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1709354120.0
        },
        {
          "id": "ksyuhz2",
          "author": "Vegetable-Try9263",
          "body": "so by your logic, someone in the midst of full blown psychosis (fully unable to distinguish reality from hallucinations/delusions), or someone whose organs are literally shutting down from starvation (aka poor eating habits..), should have no problem acquiring/working a full-time job or getting a degree? you’ve gotta be a troll",
          "created_utc": 1709359411.0
        }
      ]
    },
    {
      "id": "kt2r360",
      "author": "None",
      "body": "Yeah I always have excess movement in one way or another where restriction is involved, but more precisely at low weights. I’ll have to wait and see if hyperactivity happens again. It’s too soon to tell right now. I predict there will be a lot more balance or stability with my energy levels and that’s just because I don’t use any substances. \n\nI definitely think about food more but it feels productive and it’s a type of planning that I genuinely enjoy. It doesn’t feel like a deprivation or a longing type of thing. I don’t have much else going for me at the time to judge where my brain capacity lies the most. I’m sure I’ll be able to answer that question when I start school and work.",
      "created_utc": 1709423974.0,
      "score": 1,
      "context": [
        {
          "id": "kt0od0p",
          "author": "BlueEyedGenius1",
          "body": "For me it makes me feel like I got some self worth and purpose. I have thing to concentrate on that is easy and simple and at times quite effortless. For me it’s less thinking.",
          "created_utc": 1709396830.0
        },
        {
          "id": "kt1jvtw",
          "author": "None",
          "body": "Yes! The less thinking is so on point. Especially during hardship, my eating disorder actually gives me the ability to focus on the present moment instead of the capacity to think and feel endlessly about the hardship I’m experiencing. It’s like going through life with rose coloured glasses. Everything is effortless and the world is open to you with endless possibilities. Who wouldn’t want that? The truth is, everyone has their own method, and this is ours. \n\nThe sad truth is that if I weren’t energy deficient, I’d be so unbelievably stuck in my hardship that I’d spend hours cussing in my head instead of taking the stroll I just took today and watched the little ducks swimming in the pond. It was so lovely and I was able to do that without all that noise in my head. Of course it’s still there, but with starvation, it’s lessened tenfold. I can’t even remember the last time I physically shook of anger and when I have, it was because I had eaten enough to muster the energy to make that physically possible.",
          "created_utc": 1709408021.0
        },
        {
          "id": "kt2lgwz",
          "author": "BlueEyedGenius1",
          "body": "I am the total reverse, for me I have gained more energy now have done in years previously when my emotions were bad okay I used to over eat and not move off the couch for days weeks at time. Now I am the reverse all I wanna do is move is move off the couch I don’t wanna sit still and or eat. \n\nLess thinking about food, not having to thinking about it during the day has freed my time up to do other things and better brain power.",
          "created_utc": 1709421741.0
        }
      ]
    },
    {
      "id": "kt3cfvt",
      "author": "NotAThrowAway28",
      "body": "Eating disorders can cause psychosis...",
      "created_utc": 1709432724.0,
      "score": 2,
      "context": [
        {
          "id": "ksyjje0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1709353385.0
        },
        {
          "id": "ksykyts",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1709354120.0
        },
        {
          "id": "ksyuhz2",
          "author": "Vegetable-Try9263",
          "body": "so by your logic, someone in the midst of full blown psychosis (fully unable to distinguish reality from hallucinations/delusions), or someone whose organs are literally shutting down from starvation (aka poor eating habits..), should have no problem acquiring/working a full-time job or getting a degree? you’ve gotta be a troll",
          "created_utc": 1709359411.0
        },
        {
          "id": "kt1fog6",
          "author": "None",
          "body": "Lol we’re not talking about psychosis. We’re on an AN forum and historically AN hardly stops anyone from living unless they’re out to kill themselves or have done extreme damage to which the “overachievers” learn to get by just enough. Occasionally you meet the severely mentally ill who happen to be insanely privileged and can get away with having little to no goals in life. What you’re describing is the anomaly. It almost happened to me, but that wasn’t an eating disorder. That was decades of undetected and untreated epilepsy that nearly killed me. I’m happily motivated to prove that eating disorders don’t have to kill you or ruin your life but epilepsy and other neurological conditions does and will.\n\nEdit: It’s not the eating disorder that prevents someone from living. It’s usually their depression and anxiety which is often the backbone of their eating disorder to begin with. We’ll never make progress in medicine and research unless we accept and come to the conclusion that people can absolutely live with active eating disorders and people are doing it every damn day. A little nutritional guidance is all one needs, but then some people wouldn’t have jobs, would they?",
          "created_utc": 1709406513.0
        }
      ]
    },
    {
      "id": "kt2s8mj",
      "author": "BlueEyedGenius1",
      "body": "Sometimes you gotta think fuck it you live once and live a bit different than most “normal people” that what tells me every day to say “fuck recovery bollocks lol” some times we gotta live big dangerously in the fast line to experience life for real",
      "created_utc": 1709424437.0,
      "score": 1,
      "context": [
        {
          "id": "kt0od0p",
          "author": "BlueEyedGenius1",
          "body": "For me it makes me feel like I got some self worth and purpose. I have thing to concentrate on that is easy and simple and at times quite effortless. For me it’s less thinking.",
          "created_utc": 1709396830.0
        },
        {
          "id": "kt1jvtw",
          "author": "None",
          "body": "Yes! The less thinking is so on point. Especially during hardship, my eating disorder actually gives me the ability to focus on the present moment instead of the capacity to think and feel endlessly about the hardship I’m experiencing. It’s like going through life with rose coloured glasses. Everything is effortless and the world is open to you with endless possibilities. Who wouldn’t want that? The truth is, everyone has their own method, and this is ours. \n\nThe sad truth is that if I weren’t energy deficient, I’d be so unbelievably stuck in my hardship that I’d spend hours cussing in my head instead of taking the stroll I just took today and watched the little ducks swimming in the pond. It was so lovely and I was able to do that without all that noise in my head. Of course it’s still there, but with starvation, it’s lessened tenfold. I can’t even remember the last time I physically shook of anger and when I have, it was because I had eaten enough to muster the energy to make that physically possible.",
          "created_utc": 1709408021.0
        },
        {
          "id": "kt2lgwz",
          "author": "BlueEyedGenius1",
          "body": "I am the total reverse, for me I have gained more energy now have done in years previously when my emotions were bad okay I used to over eat and not move off the couch for days weeks at time. Now I am the reverse all I wanna do is move is move off the couch I don’t wanna sit still and or eat. \n\nLess thinking about food, not having to thinking about it during the day has freed my time up to do other things and better brain power.",
          "created_utc": 1709421741.0
        },
        {
          "id": "kt2r360",
          "author": "None",
          "body": "Yeah I always have excess movement in one way or another where restriction is involved, but more precisely at low weights. I’ll have to wait and see if hyperactivity happens again. It’s too soon to tell right now. I predict there will be a lot more balance or stability with my energy levels and that’s just because I don’t use any substances. \n\nI definitely think about food more but it feels productive and it’s a type of planning that I genuinely enjoy. It doesn’t feel like a deprivation or a longing type of thing. I don’t have much else going for me at the time to judge where my brain capacity lies the most. I’m sure I’ll be able to answer that question when I start school and work.",
          "created_utc": 1709423974.0
        }
      ]
    },
    {
      "id": "kt3d31e",
      "author": "None",
      "body": "Good thing I've never experienced that and never will, but since you're so adamant about eating disorders killing all of us, blatantly killing us all, why don't you go experience psychosis and then share your experience with the rest of us? Leave me alone.",
      "created_utc": 1709432993.0,
      "score": -1,
      "context": [
        {
          "id": "ksyjje0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1709353385.0
        },
        {
          "id": "ksykyts",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1709354120.0
        },
        {
          "id": "ksyuhz2",
          "author": "Vegetable-Try9263",
          "body": "so by your logic, someone in the midst of full blown psychosis (fully unable to distinguish reality from hallucinations/delusions), or someone whose organs are literally shutting down from starvation (aka poor eating habits..), should have no problem acquiring/working a full-time job or getting a degree? you’ve gotta be a troll",
          "created_utc": 1709359411.0
        },
        {
          "id": "kt1fog6",
          "author": "None",
          "body": "Lol we’re not talking about psychosis. We’re on an AN forum and historically AN hardly stops anyone from living unless they’re out to kill themselves or have done extreme damage to which the “overachievers” learn to get by just enough. Occasionally you meet the severely mentally ill who happen to be insanely privileged and can get away with having little to no goals in life. What you’re describing is the anomaly. It almost happened to me, but that wasn’t an eating disorder. That was decades of undetected and untreated epilepsy that nearly killed me. I’m happily motivated to prove that eating disorders don’t have to kill you or ruin your life but epilepsy and other neurological conditions does and will.\n\nEdit: It’s not the eating disorder that prevents someone from living. It’s usually their depression and anxiety which is often the backbone of their eating disorder to begin with. We’ll never make progress in medicine and research unless we accept and come to the conclusion that people can absolutely live with active eating disorders and people are doing it every damn day. A little nutritional guidance is all one needs, but then some people wouldn’t have jobs, would they?",
          "created_utc": 1709406513.0
        },
        {
          "id": "kt3cfvt",
          "author": "NotAThrowAway28",
          "body": "Eating disorders can cause psychosis...",
          "created_utc": 1709432724.0
        }
      ]
    },
    {
      "id": "kt2triq",
      "author": "None",
      "body": "Lol yeah I definitely wouldn’t describe this as living big dangerously in the fast lane. I’ve done that and risk of death and complications are so much greater than this. Death by AN is rare and takes a ridiculous amount of suffering over the span of decades to achieve. This can be anything but careless if you allow that.",
      "created_utc": 1709425050.0,
      "score": 1,
      "context": [
        {
          "id": "kt0od0p",
          "author": "BlueEyedGenius1",
          "body": "For me it makes me feel like I got some self worth and purpose. I have thing to concentrate on that is easy and simple and at times quite effortless. For me it’s less thinking.",
          "created_utc": 1709396830.0
        },
        {
          "id": "kt1jvtw",
          "author": "None",
          "body": "Yes! The less thinking is so on point. Especially during hardship, my eating disorder actually gives me the ability to focus on the present moment instead of the capacity to think and feel endlessly about the hardship I’m experiencing. It’s like going through life with rose coloured glasses. Everything is effortless and the world is open to you with endless possibilities. Who wouldn’t want that? The truth is, everyone has their own method, and this is ours. \n\nThe sad truth is that if I weren’t energy deficient, I’d be so unbelievably stuck in my hardship that I’d spend hours cussing in my head instead of taking the stroll I just took today and watched the little ducks swimming in the pond. It was so lovely and I was able to do that without all that noise in my head. Of course it’s still there, but with starvation, it’s lessened tenfold. I can’t even remember the last time I physically shook of anger and when I have, it was because I had eaten enough to muster the energy to make that physically possible.",
          "created_utc": 1709408021.0
        },
        {
          "id": "kt2lgwz",
          "author": "BlueEyedGenius1",
          "body": "I am the total reverse, for me I have gained more energy now have done in years previously when my emotions were bad okay I used to over eat and not move off the couch for days weeks at time. Now I am the reverse all I wanna do is move is move off the couch I don’t wanna sit still and or eat. \n\nLess thinking about food, not having to thinking about it during the day has freed my time up to do other things and better brain power.",
          "created_utc": 1709421741.0
        },
        {
          "id": "kt2r360",
          "author": "None",
          "body": "Yeah I always have excess movement in one way or another where restriction is involved, but more precisely at low weights. I’ll have to wait and see if hyperactivity happens again. It’s too soon to tell right now. I predict there will be a lot more balance or stability with my energy levels and that’s just because I don’t use any substances. \n\nI definitely think about food more but it feels productive and it’s a type of planning that I genuinely enjoy. It doesn’t feel like a deprivation or a longing type of thing. I don’t have much else going for me at the time to judge where my brain capacity lies the most. I’m sure I’ll be able to answer that question when I start school and work.",
          "created_utc": 1709423974.0
        },
        {
          "id": "kt2s8mj",
          "author": "BlueEyedGenius1",
          "body": "Sometimes you gotta think fuck it you live once and live a bit different than most “normal people” that what tells me every day to say “fuck recovery bollocks lol” some times we gotta live big dangerously in the fast line to experience life for real",
          "created_utc": 1709424437.0
        }
      ]
    },
    {
      "id": "kt2w39u",
      "author": "BlueEyedGenius1",
      "body": "I am not at that point yet weight, I am much more of exercise junkie than anything else. That’s what takes over. But because I don’t have boyfriend/girlfriends/, a job, a full time course (practical) or friends at the moment I haven’t got to worry about or give a shit if the exercise takes up my entire day and excessive/extreme. I don’t have friends to worry about that care about, my mate died of cancer a few years ago and my other mate lives too far away from home that I can’t be bothered to go and see anymore. I am depressed, so how on earth realistically am I gonna move my ass 30 miles on 2 trains 3 buses to go and see him for 12 hours I don’t think so. He’s not worth my time and energy when I have FaceTime. I don’t have lift finger lol.  I could justify the exercising and lots of walking of travelling but it would be along day.  I don’t like humans for that much effort. Depression has gotta be effortless. Plus I would spend the day at the gym!",
      "created_utc": 1709425979.0,
      "score": 1,
      "context": [
        {
          "id": "kt0od0p",
          "author": "BlueEyedGenius1",
          "body": "For me it makes me feel like I got some self worth and purpose. I have thing to concentrate on that is easy and simple and at times quite effortless. For me it’s less thinking.",
          "created_utc": 1709396830.0
        },
        {
          "id": "kt1jvtw",
          "author": "None",
          "body": "Yes! The less thinking is so on point. Especially during hardship, my eating disorder actually gives me the ability to focus on the present moment instead of the capacity to think and feel endlessly about the hardship I’m experiencing. It’s like going through life with rose coloured glasses. Everything is effortless and the world is open to you with endless possibilities. Who wouldn’t want that? The truth is, everyone has their own method, and this is ours. \n\nThe sad truth is that if I weren’t energy deficient, I’d be so unbelievably stuck in my hardship that I’d spend hours cussing in my head instead of taking the stroll I just took today and watched the little ducks swimming in the pond. It was so lovely and I was able to do that without all that noise in my head. Of course it’s still there, but with starvation, it’s lessened tenfold. I can’t even remember the last time I physically shook of anger and when I have, it was because I had eaten enough to muster the energy to make that physically possible.",
          "created_utc": 1709408021.0
        },
        {
          "id": "kt2lgwz",
          "author": "BlueEyedGenius1",
          "body": "I am the total reverse, for me I have gained more energy now have done in years previously when my emotions were bad okay I used to over eat and not move off the couch for days weeks at time. Now I am the reverse all I wanna do is move is move off the couch I don’t wanna sit still and or eat. \n\nLess thinking about food, not having to thinking about it during the day has freed my time up to do other things and better brain power.",
          "created_utc": 1709421741.0
        },
        {
          "id": "kt2r360",
          "author": "None",
          "body": "Yeah I always have excess movement in one way or another where restriction is involved, but more precisely at low weights. I’ll have to wait and see if hyperactivity happens again. It’s too soon to tell right now. I predict there will be a lot more balance or stability with my energy levels and that’s just because I don’t use any substances. \n\nI definitely think about food more but it feels productive and it’s a type of planning that I genuinely enjoy. It doesn’t feel like a deprivation or a longing type of thing. I don’t have much else going for me at the time to judge where my brain capacity lies the most. I’m sure I’ll be able to answer that question when I start school and work.",
          "created_utc": 1709423974.0
        },
        {
          "id": "kt2s8mj",
          "author": "BlueEyedGenius1",
          "body": "Sometimes you gotta think fuck it you live once and live a bit different than most “normal people” that what tells me every day to say “fuck recovery bollocks lol” some times we gotta live big dangerously in the fast line to experience life for real",
          "created_utc": 1709424437.0
        },
        {
          "id": "kt2triq",
          "author": "None",
          "body": "Lol yeah I definitely wouldn’t describe this as living big dangerously in the fast lane. I’ve done that and risk of death and complications are so much greater than this. Death by AN is rare and takes a ridiculous amount of suffering over the span of decades to achieve. This can be anything but careless if you allow that.",
          "created_utc": 1709425050.0
        }
      ]
    },
    {
      "id": "kt2xig1",
      "author": "None",
      "body": "I’m specifically exercising less as to prioritize restriction so that when I am ready to go all out with exercise, I’ve permanently reshaped and remodelled my body to my liking. I’m focusing more on strength training and body exercises to actually change my body. Cardio only burns calories and sheds fat but it doesn’t build muscle in place of fat. So the more energy I have to focus on body strength, the more I’ll reshape my body. I can still run but no long distance yet. Plus I walk a lot anyway. So my goal is yoga and strength training until I learn enough sustainability to get back into endurance training.\n\nI’ve got a whole plan lol. It’ll take years and it can potentially look like near death at one point, but that's part of the plan. It'll end with me running a marathon in the body I’ve always wanted. The long distance training won’t be in effect until I’ve maintained a low body weight for at least 3 years because then that weight maintenance is basically muscle memory at that point. That’s the goal. It doesn’t really make sense to others, but it makes perfect sense to me because this is how you manipulate your body to do what you want it to/ to be how you want it to be.",
      "created_utc": 1709426548.0,
      "score": 1,
      "context": [
        {
          "id": "kt0od0p",
          "author": "BlueEyedGenius1",
          "body": "For me it makes me feel like I got some self worth and purpose. I have thing to concentrate on that is easy and simple and at times quite effortless. For me it’s less thinking.",
          "created_utc": 1709396830.0
        },
        {
          "id": "kt1jvtw",
          "author": "None",
          "body": "Yes! The less thinking is so on point. Especially during hardship, my eating disorder actually gives me the ability to focus on the present moment instead of the capacity to think and feel endlessly about the hardship I’m experiencing. It’s like going through life with rose coloured glasses. Everything is effortless and the world is open to you with endless possibilities. Who wouldn’t want that? The truth is, everyone has their own method, and this is ours. \n\nThe sad truth is that if I weren’t energy deficient, I’d be so unbelievably stuck in my hardship that I’d spend hours cussing in my head instead of taking the stroll I just took today and watched the little ducks swimming in the pond. It was so lovely and I was able to do that without all that noise in my head. Of course it’s still there, but with starvation, it’s lessened tenfold. I can’t even remember the last time I physically shook of anger and when I have, it was because I had eaten enough to muster the energy to make that physically possible.",
          "created_utc": 1709408021.0
        },
        {
          "id": "kt2lgwz",
          "author": "BlueEyedGenius1",
          "body": "I am the total reverse, for me I have gained more energy now have done in years previously when my emotions were bad okay I used to over eat and not move off the couch for days weeks at time. Now I am the reverse all I wanna do is move is move off the couch I don’t wanna sit still and or eat. \n\nLess thinking about food, not having to thinking about it during the day has freed my time up to do other things and better brain power.",
          "created_utc": 1709421741.0
        },
        {
          "id": "kt2r360",
          "author": "None",
          "body": "Yeah I always have excess movement in one way or another where restriction is involved, but more precisely at low weights. I’ll have to wait and see if hyperactivity happens again. It’s too soon to tell right now. I predict there will be a lot more balance or stability with my energy levels and that’s just because I don’t use any substances. \n\nI definitely think about food more but it feels productive and it’s a type of planning that I genuinely enjoy. It doesn’t feel like a deprivation or a longing type of thing. I don’t have much else going for me at the time to judge where my brain capacity lies the most. I’m sure I’ll be able to answer that question when I start school and work.",
          "created_utc": 1709423974.0
        },
        {
          "id": "kt2s8mj",
          "author": "BlueEyedGenius1",
          "body": "Sometimes you gotta think fuck it you live once and live a bit different than most “normal people” that what tells me every day to say “fuck recovery bollocks lol” some times we gotta live big dangerously in the fast line to experience life for real",
          "created_utc": 1709424437.0
        },
        {
          "id": "kt2triq",
          "author": "None",
          "body": "Lol yeah I definitely wouldn’t describe this as living big dangerously in the fast lane. I’ve done that and risk of death and complications are so much greater than this. Death by AN is rare and takes a ridiculous amount of suffering over the span of decades to achieve. This can be anything but careless if you allow that.",
          "created_utc": 1709425050.0
        },
        {
          "id": "kt2w39u",
          "author": "BlueEyedGenius1",
          "body": "I am not at that point yet weight, I am much more of exercise junkie than anything else. That’s what takes over. But because I don’t have boyfriend/girlfriends/, a job, a full time course (practical) or friends at the moment I haven’t got to worry about or give a shit if the exercise takes up my entire day and excessive/extreme. I don’t have friends to worry about that care about, my mate died of cancer a few years ago and my other mate lives too far away from home that I can’t be bothered to go and see anymore. I am depressed, so how on earth realistically am I gonna move my ass 30 miles on 2 trains 3 buses to go and see him for 12 hours I don’t think so. He’s not worth my time and energy when I have FaceTime. I don’t have lift finger lol.  I could justify the exercising and lots of walking of travelling but it would be along day.  I don’t like humans for that much effort. Depression has gotta be effortless. Plus I would spend the day at the gym!",
          "created_utc": 1709425979.0
        }
      ]
    }
  ]
}