{
  "id": "1binsis",
  "subreddit": "AnorexiaNervosa",
  "author": "internetcatalliance",
  "created_utc": 1710864179.0,
  "title": "Anorexia is genuinely my norm",
  "selftext": "This will so get deleted ....\n\nMy anorexia... It's been years and shit, I'm like 23...\n\nIt's normal, it feels natural, and although I talk about it a lot, in reality I genuinely barely think about anything ED related in a day, it's all so mundane that my mind barely registers it Al\n\nIts comfortable, I benefit to some degree from the routine, the rules, all that shit, it brings me some degree of comfort, which I likewise barely perceive \n\nI guess at this point, this is kinda just how I live?\n\nYes I'm making the lifestyle comparison, and no not any of that pro ana cringe, no I don't mean it like that... it's just, it feels so much like just a way of being, it's crazy how something so serious and deadly can become normal to someone\n\nHonestly if I'm gonna be honest, I even get some amount of joy from behaviours, hitting goals, I am actually not fat for the first time in 12 years, how can I not be happy? How the fuck am I ever supposed to get better when...\n\nIt all feels so normal? Like nothings wrong...\n\nI'm disabled, my muscles are non existent..  I need to at times ask strangers in the street to help me carry bags onto the tram\n\nYet I feel normal, like nothings wrong, like I'm meant to be this way\n\nWhat the hell...",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1binsis/anorexia_is_genuinely_my_norm/",
  "score": 133,
  "num_comments": 49,
  "comments": [
    {
      "id": "kvlfyaj",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1710864179.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvlh4j7",
      "author": "TheMadHatterWasHere",
      "body": "Honestly Ana has felt so normal to me the last two years that I genuinely thought I had recovered xD",
      "created_utc": 1710864577.0,
      "score": 75,
      "context": []
    },
    {
      "id": "kvlot2h",
      "author": "Sad_Knee7",
      "body": "**\"I am actually not fat for the first time in 12 years, how can I not be happy?\"\nAaah god I can relate 100%\n\nI'm going through what you're going through, I got used to it to a point that now it's part of myself and everything thing in my life, and I don't have many issues with it but the random headaches and wanting to sleep but can't sleep 🤣\nSometimes I feel like I don't have ED at all",
      "created_utc": 1710867241.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kvmtdvl",
      "author": "MeteorIntrovert",
      "body": "this is so true. my ed is basically part of my life now and my days to the point where its my new normal now",
      "created_utc": 1710880769.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kvoeq53",
      "author": "Automatic_Ad5097",
      "body": "I do understand this mentality. And I can say that I accepted it for a long time, but then I'll realise just how much the ed stops me. I don't say yes to trips, i find it hard and anxiety inducing to adjust my routine for anything that it becomes an ordeal. I refuse every opportunity to socially eat, I have had multiple attempts at having relationships/a sex life that fail. Yes I'm functioning, but I know that I function despite the anorexia. It can feel like it's okay to live the 80% half life, but I also have been in that place and it's a terrifying prospect that people spend decades living that life. You deserve more. You might not think it, but you do  ",
      "created_utc": 1710901814.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kvoiyad",
      "author": "LifeguardForeign6479",
      "body": "I’ve been a  managed anorexic for @ 20 years after 6 deep dive years of brink of death ed behavior. Not a recommendation but a sustainable version of life for me.\n\nYes, in ongoing therapy, individual and group, my challenges are real, my behavior odd, but also my life full and content.\n\nAs best I can complicated yet honest.",
      "created_utc": 1710903605.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kvlkmgw",
      "author": "creditpro99",
      "body": "Are you in therapy?",
      "created_utc": 1710865832.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kvmbxl6",
      "author": "hellobud1236",
      "body": "Relatable",
      "created_utc": 1710874940.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kvo1945",
      "author": "Fruit-Please",
      "body": "This^ I’ve never been able to put it into words but this is exactly how I feel",
      "created_utc": 1710896480.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvvzg8i",
      "author": "Realistic_Distance33",
      "body": "you writing this is showing that you yourself know that you shouldn’t think it’s not normal, your ed is tricking you babe",
      "created_utc": 1711029051.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvlzkwd",
      "author": "Mammoth_Exam1354",
      "body": "Explain I am actually not fat part???",
      "created_utc": 1710870821.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvpy9e8",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710936320.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvrpo4n",
      "author": "Condemned2Be",
      "body": "This is how I felt for years. Like anorexia was just my natural state. Recently was diagnosed with OCD & it makes so much sense. Anorexia is my compulsion for safety & comfort. I don’t have to think about it because I’m actually too busy thinking about my obsessions.\n\nI am NOT trying to diagnose you with anything. But the two disorders are frequently comorbid. If you’ve never really researched mental OCD or “pure” OCD. Even if it doesn’t click for you, it’s an interesting psychology to learn about.",
      "created_utc": 1710958884.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvs7uzs",
      "author": "Sea-Fix-3520",
      "body": "I can't lose weight no matter what I do.it sucks.i want to lose all this extra weight and I am so tired because of methadone,and so depressed.",
      "created_utc": 1710964827.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvseaz3",
      "author": "Emotional-Wear-2527",
      "body": "I thought I was recovered after being ‘ok’ for a few years but I never was- to the point that I didn’t even realised I had relapsed and have been fighting with everyone for being so ridiculous- but this feels normal to me and the more I think about the more I feel like my ‘ok I’m all better’ thing was not normal - I put on weight but we’re all the old routines and rituals and abnormal stuff there- yes. I finally feel ok again, albeit a few weeks ago I took a knock,and have been forced to go back to hospital every week and see an ed therapist again starting on Tuesday- but I feel safe and comfortable in myself. I am\nAngry at the refeeding, I am angry that because I am in refeeding that the doctor told me I wasn’t even worth therapy. Now I’m maintaining and I know for them they want me a lot higher but if I’m doing what I can and I’m not losing and I feel stronger- why can’t they leave me be? \n\nI’m nearly 40 and this has been there since I was 12. I feel like screaming leave me be- there are way bigger issues happening right now than you banning me from therapy until I am at a target bmi.",
      "created_utc": 1710966995.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvvrq6e",
      "author": "Sea-Fix-3520",
      "body": "I got weighed yesterday and even though I was anorexic and bulimic and now eat 3 meals a day,no sugar, except a slip of ice cream with chocolate sauce ,a few tablespoons of ice cream at night.And I am 171lbs. or more, at 5'6\",I am obese and I have been trying to not binge every day like I used to asva teenager I binged and purged everyday and night and drank and took amphetamines everyday since a girl told me to try diet pills and throwing up when I want to stay home from school,and this girl was absent a lot,and boys teased her terribly and I was suicidal and depressed and a mess and I didn't want to be alive even . now I am fat.Even though I don't drink alcohol or do drugs like I used to.I am gross 🤢 and 😡 mad at God for giving me bad genes",
      "created_utc": 1711025972.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvlhqhe",
      "author": "internetcatalliance",
      "body": "I never felt like that, but its scary how much it resembles any other way of being, almost as if its just a quirky little lifestyle choice\n\nI think, I for the first time truly understand why some anorexics so insist on it being a lifestyle, I honestly do, I get it\n\nAnd its strange because I have several mental disorders \n\nAnorexia is the only one that feels so deeply normal, as if I'm perfectly fine and nothings wrong \n\nI'm even happy? I smile and laugh, chill with friends \n\nAll while eating so little, with all these anorexic thoughts",
      "created_utc": 1710864781.0,
      "score": 24,
      "context": [
        {
          "id": "kvlh4j7",
          "author": "TheMadHatterWasHere",
          "body": "Honestly Ana has felt so normal to me the last two years that I genuinely thought I had recovered xD",
          "created_utc": 1710864577.0
        }
      ]
    },
    {
      "id": "kvlpei9",
      "author": "internetcatalliance",
      "body": "My ED feels integral to my identity \n\nIt feels like... the most interesting thing about me\n\nI feel like I would be losing a part of who I am if I recovered\n\nTHAT Is why I never got better no matter how many times I tried...\n\nI simply don't want to lose the lifestyle, the sickness, the identity it gives, all this insane shit, online communities...\n\nI don't want to lose who I am",
      "created_utc": 1710867437.0,
      "score": 14,
      "context": [
        {
          "id": "kvlot2h",
          "author": "Sad_Knee7",
          "body": "**\"I am actually not fat for the first time in 12 years, how can I not be happy?\"\nAaah god I can relate 100%\n\nI'm going through what you're going through, I got used to it to a point that now it's part of myself and everything thing in my life, and I don't have many issues with it but the random headaches and wanting to sleep but can't sleep 🤣\nSometimes I feel like I don't have ED at all",
          "created_utc": 1710867241.0
        }
      ]
    },
    {
      "id": "kw12j8n",
      "author": "Agile_Cash_4249",
      "body": "Same. I'm still able to function normally. Don't think I've missed out on much in life because of it, maybe some things, but that would require me to engage in imaginary, hypothetical thinking about an alternate life. Ironically, I feel less mental ED distress when I just stick to my ED routine. It's when I start trying to challenge it and recover that my ED gets worse.",
      "created_utc": 1711106405.0,
      "score": 1,
      "context": [
        {
          "id": "kvmtdvl",
          "author": "MeteorIntrovert",
          "body": "this is so true. my ed is basically part of my life now and my days to the point where its my new normal now",
          "created_utc": 1710880769.0
        }
      ]
    },
    {
      "id": "kvllfn1",
      "author": "internetcatalliance",
      "body": "No\n\nI wouldn't mind being in therapy\n\nBut no psych wants to see me, I've been told (by medical professionals) that there's no point trying to find a new one",
      "created_utc": 1710866110.0,
      "score": 3,
      "context": [
        {
          "id": "kvlkmgw",
          "author": "creditpro99",
          "body": "Are you in therapy?",
          "created_utc": 1710865832.0
        }
      ]
    },
    {
      "id": "kvm0f9i",
      "author": "internetcatalliance",
      "body": "well I meant it literally.... Im in the healthy bmi range for the first time since I was a young teenager\n\nAnd I sure as hell look like it too, I dont really have body dysmorphia, and i am absolutely losing it over how good i actually look, I look like any other average girl, and I love it\n\nFinally... I dont feel fat",
      "created_utc": 1710871099.0,
      "score": 8,
      "context": [
        {
          "id": "kvlzkwd",
          "author": "Mammoth_Exam1354",
          "body": "Explain I am actually not fat part???",
          "created_utc": 1710870821.0
        }
      ]
    },
    {
      "id": "kvq712f",
      "author": "internetcatalliance",
      "body": "Weird dump, I really didn't need all the tiny details about your intake...\n\nI eat little, very little, but I think telling everyone here the exact details would be uncalled for",
      "created_utc": 1710940259.0,
      "score": 3,
      "context": [
        {
          "id": "kvpy9e8",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710936320.0
        }
      ]
    },
    {
      "id": "kvqxk96",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1710949722.0,
      "score": 1,
      "context": [
        {
          "id": "kvpy9e8",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710936320.0
        }
      ]
    },
    {
      "id": "kvlo8zm",
      "author": "TheMadHatterWasHere",
      "body": "I get that. That's what Ana felt like to me before I \"recovered\" two years ago. Except I didn't actually recover. I just thought I did. I was so sick that I thought that what I was eating was normal. And these last two months I have had to count calories to be sure I wasn't grossly undereating, bc I have no feeling of what is normal anymore :S",
      "created_utc": 1710867057.0,
      "score": 9,
      "context": [
        {
          "id": "kvlh4j7",
          "author": "TheMadHatterWasHere",
          "body": "Honestly Ana has felt so normal to me the last two years that I genuinely thought I had recovered xD",
          "created_utc": 1710864577.0
        },
        {
          "id": "kvlhqhe",
          "author": "internetcatalliance",
          "body": "I never felt like that, but its scary how much it resembles any other way of being, almost as if its just a quirky little lifestyle choice\n\nI think, I for the first time truly understand why some anorexics so insist on it being a lifestyle, I honestly do, I get it\n\nAnd its strange because I have several mental disorders \n\nAnorexia is the only one that feels so deeply normal, as if I'm perfectly fine and nothings wrong \n\nI'm even happy? I smile and laugh, chill with friends \n\nAll while eating so little, with all these anorexic thoughts",
          "created_utc": 1710864781.0
        }
      ]
    },
    {
      "id": "kvlr9js",
      "author": "Sad_Knee7",
      "body": "ED play a large role in my interests and lifestyle, it's something part of me, but it's not my whole identity\n\nAlso I'm afraid to recover, cause I don't wanna lose the biggest part of me, what am I gonna do if lost it? How life feels without being fucked up with food and so much rules?🤣",
      "created_utc": 1710868059.0,
      "score": 5,
      "context": [
        {
          "id": "kvlot2h",
          "author": "Sad_Knee7",
          "body": "**\"I am actually not fat for the first time in 12 years, how can I not be happy?\"\nAaah god I can relate 100%\n\nI'm going through what you're going through, I got used to it to a point that now it's part of myself and everything thing in my life, and I don't have many issues with it but the random headaches and wanting to sleep but can't sleep 🤣\nSometimes I feel like I don't have ED at all",
          "created_utc": 1710867241.0
        },
        {
          "id": "kvlpei9",
          "author": "internetcatalliance",
          "body": "My ED feels integral to my identity \n\nIt feels like... the most interesting thing about me\n\nI feel like I would be losing a part of who I am if I recovered\n\nTHAT Is why I never got better no matter how many times I tried...\n\nI simply don't want to lose the lifestyle, the sickness, the identity it gives, all this insane shit, online communities...\n\nI don't want to lose who I am",
          "created_utc": 1710867437.0
        }
      ]
    },
    {
      "id": "kvlnvwi",
      "author": "SieBanhus",
      "body": "Have they told you why?",
      "created_utc": 1710866936.0,
      "score": 4,
      "context": [
        {
          "id": "kvlkmgw",
          "author": "creditpro99",
          "body": "Are you in therapy?",
          "created_utc": 1710865832.0
        },
        {
          "id": "kvllfn1",
          "author": "internetcatalliance",
          "body": "No\n\nI wouldn't mind being in therapy\n\nBut no psych wants to see me, I've been told (by medical professionals) that there's no point trying to find a new one",
          "created_utc": 1710866110.0
        }
      ]
    },
    {
      "id": "kvmbw36",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710874925.0,
      "score": 0,
      "context": [
        {
          "id": "kvlzkwd",
          "author": "Mammoth_Exam1354",
          "body": "Explain I am actually not fat part???",
          "created_utc": 1710870821.0
        },
        {
          "id": "kvm0f9i",
          "author": "internetcatalliance",
          "body": "well I meant it literally.... Im in the healthy bmi range for the first time since I was a young teenager\n\nAnd I sure as hell look like it too, I dont really have body dysmorphia, and i am absolutely losing it over how good i actually look, I look like any other average girl, and I love it\n\nFinally... I dont feel fat",
          "created_utc": 1710871099.0
        }
      ]
    },
    {
      "id": "kvlp3gz",
      "author": "internetcatalliance",
      "body": "Same actually\n\nI never stuck to recovery for long\n\nBut every time I did, I found intuitive eating fucking useless \n\nMy default is literally starving, I had to count cals so I don't undereat \n\nWhich ofc eventually just made me relapse in like 2 weeks and there, \"eat of the apple, so young, I'm crawling back to start\"\n\nTo quote a song...",
      "created_utc": 1710867337.0,
      "score": 6,
      "context": [
        {
          "id": "kvlh4j7",
          "author": "TheMadHatterWasHere",
          "body": "Honestly Ana has felt so normal to me the last two years that I genuinely thought I had recovered xD",
          "created_utc": 1710864577.0
        },
        {
          "id": "kvlhqhe",
          "author": "internetcatalliance",
          "body": "I never felt like that, but its scary how much it resembles any other way of being, almost as if its just a quirky little lifestyle choice\n\nI think, I for the first time truly understand why some anorexics so insist on it being a lifestyle, I honestly do, I get it\n\nAnd its strange because I have several mental disorders \n\nAnorexia is the only one that feels so deeply normal, as if I'm perfectly fine and nothings wrong \n\nI'm even happy? I smile and laugh, chill with friends \n\nAll while eating so little, with all these anorexic thoughts",
          "created_utc": 1710864781.0
        },
        {
          "id": "kvlo8zm",
          "author": "TheMadHatterWasHere",
          "body": "I get that. That's what Ana felt like to me before I \"recovered\" two years ago. Except I didn't actually recover. I just thought I did. I was so sick that I thought that what I was eating was normal. And these last two months I have had to count calories to be sure I wasn't grossly undereating, bc I have no feeling of what is normal anymore :S",
          "created_utc": 1710867057.0
        }
      ]
    },
    {
      "id": "kvlrwjb",
      "author": "internetcatalliance",
      "body": "Ikr... How can I live without weight loss?\n\nI need that spike of serotonin in the morning man :/",
      "created_utc": 1710868275.0,
      "score": 7,
      "context": [
        {
          "id": "kvlot2h",
          "author": "Sad_Knee7",
          "body": "**\"I am actually not fat for the first time in 12 years, how can I not be happy?\"\nAaah god I can relate 100%\n\nI'm going through what you're going through, I got used to it to a point that now it's part of myself and everything thing in my life, and I don't have many issues with it but the random headaches and wanting to sleep but can't sleep 🤣\nSometimes I feel like I don't have ED at all",
          "created_utc": 1710867241.0
        },
        {
          "id": "kvlpei9",
          "author": "internetcatalliance",
          "body": "My ED feels integral to my identity \n\nIt feels like... the most interesting thing about me\n\nI feel like I would be losing a part of who I am if I recovered\n\nTHAT Is why I never got better no matter how many times I tried...\n\nI simply don't want to lose the lifestyle, the sickness, the identity it gives, all this insane shit, online communities...\n\nI don't want to lose who I am",
          "created_utc": 1710867437.0
        },
        {
          "id": "kvlr9js",
          "author": "Sad_Knee7",
          "body": "ED play a large role in my interests and lifestyle, it's something part of me, but it's not my whole identity\n\nAlso I'm afraid to recover, cause I don't wanna lose the biggest part of me, what am I gonna do if lost it? How life feels without being fucked up with food and so much rules?🤣",
          "created_utc": 1710868059.0
        }
      ]
    },
    {
      "id": "kvlof0s",
      "author": "internetcatalliance",
      "body": "\"There has to be something new to refer you for, you have already been treated for everything\"\n\nIDK If you consider being tube fed twice and two psychs, both eventually telling me to fuck off adequate treatment\n\nLook I have the right to a second opinion... and I could do it over and over and over again\n\nBut I'm tired, honestly I am, last psych gave me medical trauma and now I'm scared of doctors \n\nI just want someone to fucking talk to me, but no they all kick me out for \"non compliance\" like for fucks sake....\n\nI gave up on the medical system \n\nI'm planning to look into unaffiliated organisations that can offer me talk therapy, clearly the healthcare system is more occupied with \"results\" than helping a fucking chick cope with life",
      "created_utc": 1710867113.0,
      "score": 5,
      "context": [
        {
          "id": "kvlkmgw",
          "author": "creditpro99",
          "body": "Are you in therapy?",
          "created_utc": 1710865832.0
        },
        {
          "id": "kvllfn1",
          "author": "internetcatalliance",
          "body": "No\n\nI wouldn't mind being in therapy\n\nBut no psych wants to see me, I've been told (by medical professionals) that there's no point trying to find a new one",
          "created_utc": 1710866110.0
        },
        {
          "id": "kvlnvwi",
          "author": "SieBanhus",
          "body": "Have they told you why?",
          "created_utc": 1710866936.0
        }
      ]
    },
    {
      "id": "kvmgao3",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710876404.0,
      "score": 6,
      "context": [
        {
          "id": "kvlzkwd",
          "author": "Mammoth_Exam1354",
          "body": "Explain I am actually not fat part???",
          "created_utc": 1710870821.0
        },
        {
          "id": "kvm0f9i",
          "author": "internetcatalliance",
          "body": "well I meant it literally.... Im in the healthy bmi range for the first time since I was a young teenager\n\nAnd I sure as hell look like it too, I dont really have body dysmorphia, and i am absolutely losing it over how good i actually look, I look like any other average girl, and I love it\n\nFinally... I dont feel fat",
          "created_utc": 1710871099.0
        },
        {
          "id": "kvmbw36",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710874925.0
        }
      ]
    },
    {
      "id": "kvntwdh",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1710893692.0,
      "score": 2,
      "context": [
        {
          "id": "kvlzkwd",
          "author": "Mammoth_Exam1354",
          "body": "Explain I am actually not fat part???",
          "created_utc": 1710870821.0
        },
        {
          "id": "kvm0f9i",
          "author": "internetcatalliance",
          "body": "well I meant it literally.... Im in the healthy bmi range for the first time since I was a young teenager\n\nAnd I sure as hell look like it too, I dont really have body dysmorphia, and i am absolutely losing it over how good i actually look, I look like any other average girl, and I love it\n\nFinally... I dont feel fat",
          "created_utc": 1710871099.0
        },
        {
          "id": "kvmbw36",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710874925.0
        }
      ]
    },
    {
      "id": "kvqn452",
      "author": "helianthus_0",
      "body": "In defense of intuitive eating, you can’t start it while malnourished. Of course you’ll be ruled by your AN. You need to get to a point where you’ve been adequately nourished for several months, and ideally working with a professional if possible, when your brain is healthier, before you can incorporate IE. \n\nIn response to another comment you made here, we all think there’s some magic weight we’ll achieve, look down at the scale, and our lives and mood will change for the better. We’ll finally be happy. It’s smoke and mirrors, it’s bullshit. The happiness is very fleeting and then, we’re back to being miserable again. We realize the only thing that’s changed is that we’re sicker, with more medical complications, and deeper into this shithole that’s now even harder to crawl out of. Getting to underweight didn’t make you happy, neither will being severely underweight.",
      "created_utc": 1710946201.0,
      "score": 2,
      "context": [
        {
          "id": "kvlh4j7",
          "author": "TheMadHatterWasHere",
          "body": "Honestly Ana has felt so normal to me the last two years that I genuinely thought I had recovered xD",
          "created_utc": 1710864577.0
        },
        {
          "id": "kvlhqhe",
          "author": "internetcatalliance",
          "body": "I never felt like that, but its scary how much it resembles any other way of being, almost as if its just a quirky little lifestyle choice\n\nI think, I for the first time truly understand why some anorexics so insist on it being a lifestyle, I honestly do, I get it\n\nAnd its strange because I have several mental disorders \n\nAnorexia is the only one that feels so deeply normal, as if I'm perfectly fine and nothings wrong \n\nI'm even happy? I smile and laugh, chill with friends \n\nAll while eating so little, with all these anorexic thoughts",
          "created_utc": 1710864781.0
        },
        {
          "id": "kvlo8zm",
          "author": "TheMadHatterWasHere",
          "body": "I get that. That's what Ana felt like to me before I \"recovered\" two years ago. Except I didn't actually recover. I just thought I did. I was so sick that I thought that what I was eating was normal. And these last two months I have had to count calories to be sure I wasn't grossly undereating, bc I have no feeling of what is normal anymore :S",
          "created_utc": 1710867057.0
        },
        {
          "id": "kvlp3gz",
          "author": "internetcatalliance",
          "body": "Same actually\n\nI never stuck to recovery for long\n\nBut every time I did, I found intuitive eating fucking useless \n\nMy default is literally starving, I had to count cals so I don't undereat \n\nWhich ofc eventually just made me relapse in like 2 weeks and there, \"eat of the apple, so young, I'm crawling back to start\"\n\nTo quote a song...",
          "created_utc": 1710867337.0
        }
      ]
    },
    {
      "id": "kvlrcpb",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710868088.0,
      "score": 1,
      "context": [
        {
          "id": "kvlh4j7",
          "author": "TheMadHatterWasHere",
          "body": "Honestly Ana has felt so normal to me the last two years that I genuinely thought I had recovered xD",
          "created_utc": 1710864577.0
        },
        {
          "id": "kvlhqhe",
          "author": "internetcatalliance",
          "body": "I never felt like that, but its scary how much it resembles any other way of being, almost as if its just a quirky little lifestyle choice\n\nI think, I for the first time truly understand why some anorexics so insist on it being a lifestyle, I honestly do, I get it\n\nAnd its strange because I have several mental disorders \n\nAnorexia is the only one that feels so deeply normal, as if I'm perfectly fine and nothings wrong \n\nI'm even happy? I smile and laugh, chill with friends \n\nAll while eating so little, with all these anorexic thoughts",
          "created_utc": 1710864781.0
        },
        {
          "id": "kvlo8zm",
          "author": "TheMadHatterWasHere",
          "body": "I get that. That's what Ana felt like to me before I \"recovered\" two years ago. Except I didn't actually recover. I just thought I did. I was so sick that I thought that what I was eating was normal. And these last two months I have had to count calories to be sure I wasn't grossly undereating, bc I have no feeling of what is normal anymore :S",
          "created_utc": 1710867057.0
        },
        {
          "id": "kvlp3gz",
          "author": "internetcatalliance",
          "body": "Same actually\n\nI never stuck to recovery for long\n\nBut every time I did, I found intuitive eating fucking useless \n\nMy default is literally starving, I had to count cals so I don't undereat \n\nWhich ofc eventually just made me relapse in like 2 weeks and there, \"eat of the apple, so young, I'm crawling back to start\"\n\nTo quote a song...",
          "created_utc": 1710867337.0
        }
      ]
    },
    {
      "id": "kvlt4v2",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710868685.0,
      "score": 2,
      "context": [
        {
          "id": "kvlot2h",
          "author": "Sad_Knee7",
          "body": "**\"I am actually not fat for the first time in 12 years, how can I not be happy?\"\nAaah god I can relate 100%\n\nI'm going through what you're going through, I got used to it to a point that now it's part of myself and everything thing in my life, and I don't have many issues with it but the random headaches and wanting to sleep but can't sleep 🤣\nSometimes I feel like I don't have ED at all",
          "created_utc": 1710867241.0
        },
        {
          "id": "kvlpei9",
          "author": "internetcatalliance",
          "body": "My ED feels integral to my identity \n\nIt feels like... the most interesting thing about me\n\nI feel like I would be losing a part of who I am if I recovered\n\nTHAT Is why I never got better no matter how many times I tried...\n\nI simply don't want to lose the lifestyle, the sickness, the identity it gives, all this insane shit, online communities...\n\nI don't want to lose who I am",
          "created_utc": 1710867437.0
        },
        {
          "id": "kvlr9js",
          "author": "Sad_Knee7",
          "body": "ED play a large role in my interests and lifestyle, it's something part of me, but it's not my whole identity\n\nAlso I'm afraid to recover, cause I don't wanna lose the biggest part of me, what am I gonna do if lost it? How life feels without being fucked up with food and so much rules?🤣",
          "created_utc": 1710868059.0
        },
        {
          "id": "kvlrwjb",
          "author": "internetcatalliance",
          "body": "Ikr... How can I live without weight loss?\n\nI need that spike of serotonin in the morning man :/",
          "created_utc": 1710868275.0
        }
      ]
    },
    {
      "id": "kvlualt",
      "author": "creditpro99",
      "body": "Please find a therapist that specializes in eating disorders. Even if via zoom. If one isn't a good fit, keep trying new ones. Insurance covers it, it's a mental illness and a good therapist should refer you to a nutritionist, which you need. Consistency is the key. \n\nNot everyone has someone to advocate for them, so you will just have to do it yourself.  Don't give up on yourself! Hang in there and be tough!! xoxo",
      "created_utc": 1710869068.0,
      "score": 4,
      "context": [
        {
          "id": "kvlkmgw",
          "author": "creditpro99",
          "body": "Are you in therapy?",
          "created_utc": 1710865832.0
        },
        {
          "id": "kvllfn1",
          "author": "internetcatalliance",
          "body": "No\n\nI wouldn't mind being in therapy\n\nBut no psych wants to see me, I've been told (by medical professionals) that there's no point trying to find a new one",
          "created_utc": 1710866110.0
        },
        {
          "id": "kvlnvwi",
          "author": "SieBanhus",
          "body": "Have they told you why?",
          "created_utc": 1710866936.0
        },
        {
          "id": "kvlof0s",
          "author": "internetcatalliance",
          "body": "\"There has to be something new to refer you for, you have already been treated for everything\"\n\nIDK If you consider being tube fed twice and two psychs, both eventually telling me to fuck off adequate treatment\n\nLook I have the right to a second opinion... and I could do it over and over and over again\n\nBut I'm tired, honestly I am, last psych gave me medical trauma and now I'm scared of doctors \n\nI just want someone to fucking talk to me, but no they all kick me out for \"non compliance\" like for fucks sake....\n\nI gave up on the medical system \n\nI'm planning to look into unaffiliated organisations that can offer me talk therapy, clearly the healthcare system is more occupied with \"results\" than helping a fucking chick cope with life",
          "created_utc": 1710867113.0
        }
      ]
    },
    {
      "id": "kvrs0e1",
      "author": "Condemned2Be",
      "body": "Hey. I am so sorry you’ve had these experiences. I went through this same stuff for YEARS, & it was hell having doctors put “treatment noncompliant” on my records. \n\nI’m not sure your age but I am 30. I took several years off from seeking help after experiences like yours, & no judgement if you need to do that to reach a stable place again. Two years ago I finally found a therapist (not a psychiatrist) who specialized in ED. I’ve been seeing her two years & she has opened up so many doors for me with her referrals & stuff. Really advocating for me to get to a psych & get some meds for my other mental issues.\n\nStating goals was also helpful. Two years ago I was being cheated on etc & I told my therapist upfront that recovery wasn’t on my radar yet, that I was drowning & really just needed her to listen. It took over a year but once I got some sense of safety, I felt ok to make some appointments because I knew I had her to run back to if the psychiatrist disregarded me.\n\nI’m wishing you the best, recovery or not ❤️ if you ever need people to listen, I’m here & so is the rest of this group. We get you!",
      "created_utc": 1710959676.0,
      "score": 3,
      "context": [
        {
          "id": "kvlkmgw",
          "author": "creditpro99",
          "body": "Are you in therapy?",
          "created_utc": 1710865832.0
        },
        {
          "id": "kvllfn1",
          "author": "internetcatalliance",
          "body": "No\n\nI wouldn't mind being in therapy\n\nBut no psych wants to see me, I've been told (by medical professionals) that there's no point trying to find a new one",
          "created_utc": 1710866110.0
        },
        {
          "id": "kvlnvwi",
          "author": "SieBanhus",
          "body": "Have they told you why?",
          "created_utc": 1710866936.0
        },
        {
          "id": "kvlof0s",
          "author": "internetcatalliance",
          "body": "\"There has to be something new to refer you for, you have already been treated for everything\"\n\nIDK If you consider being tube fed twice and two psychs, both eventually telling me to fuck off adequate treatment\n\nLook I have the right to a second opinion... and I could do it over and over and over again\n\nBut I'm tired, honestly I am, last psych gave me medical trauma and now I'm scared of doctors \n\nI just want someone to fucking talk to me, but no they all kick me out for \"non compliance\" like for fucks sake....\n\nI gave up on the medical system \n\nI'm planning to look into unaffiliated organisations that can offer me talk therapy, clearly the healthcare system is more occupied with \"results\" than helping a fucking chick cope with life",
          "created_utc": 1710867113.0
        }
      ]
    },
    {
      "id": "kvrv925",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 6: Don't glorify the eating disorder. \n\nr/AnorexiaNervosa is not a pro-ED subreddit, but we also do not force people to recover if they do not want to recover. \n\nGlorifying something harmful and potentially life-threatening and making it seem like something less bad is harmful to the community of r/AnorexiaNervosa. Glorification will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1710960769.0,
      "score": 1,
      "context": [
        {
          "id": "kvlzkwd",
          "author": "Mammoth_Exam1354",
          "body": "Explain I am actually not fat part???",
          "created_utc": 1710870821.0
        },
        {
          "id": "kvm0f9i",
          "author": "internetcatalliance",
          "body": "well I meant it literally.... Im in the healthy bmi range for the first time since I was a young teenager\n\nAnd I sure as hell look like it too, I dont really have body dysmorphia, and i am absolutely losing it over how good i actually look, I look like any other average girl, and I love it\n\nFinally... I dont feel fat",
          "created_utc": 1710871099.0
        },
        {
          "id": "kvmbw36",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710874925.0
        },
        {
          "id": "kvmgao3",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710876404.0
        }
      ]
    },
    {
      "id": "kvmkfmz",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710877795.0,
      "score": -1,
      "context": [
        {
          "id": "kvlzkwd",
          "author": "Mammoth_Exam1354",
          "body": "Explain I am actually not fat part???",
          "created_utc": 1710870821.0
        },
        {
          "id": "kvm0f9i",
          "author": "internetcatalliance",
          "body": "well I meant it literally.... Im in the healthy bmi range for the first time since I was a young teenager\n\nAnd I sure as hell look like it too, I dont really have body dysmorphia, and i am absolutely losing it over how good i actually look, I look like any other average girl, and I love it\n\nFinally... I dont feel fat",
          "created_utc": 1710871099.0
        },
        {
          "id": "kvmbw36",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710874925.0
        },
        {
          "id": "kvmgao3",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710876404.0
        }
      ]
    },
    {
      "id": "kvqts2e",
      "author": "internetcatalliance",
      "body": "But...\n\nI'm not unhappy? I'm not miserable\n\nI'm actually very happy with my life, I have a lot of good things going on, the idea of being skinny as fuck is just gonna put a lil cherry on the top of it all\n\nHow can I go back to being miserable if I never was to begin with?\n\nI'm not even underweight and never was, I just want to know how it's like to be so skinny that people think ur too thin, I want to be extraordinary at something for the first time in my life",
      "created_utc": 1710948467.0,
      "score": 3,
      "context": [
        {
          "id": "kvlh4j7",
          "author": "TheMadHatterWasHere",
          "body": "Honestly Ana has felt so normal to me the last two years that I genuinely thought I had recovered xD",
          "created_utc": 1710864577.0
        },
        {
          "id": "kvlhqhe",
          "author": "internetcatalliance",
          "body": "I never felt like that, but its scary how much it resembles any other way of being, almost as if its just a quirky little lifestyle choice\n\nI think, I for the first time truly understand why some anorexics so insist on it being a lifestyle, I honestly do, I get it\n\nAnd its strange because I have several mental disorders \n\nAnorexia is the only one that feels so deeply normal, as if I'm perfectly fine and nothings wrong \n\nI'm even happy? I smile and laugh, chill with friends \n\nAll while eating so little, with all these anorexic thoughts",
          "created_utc": 1710864781.0
        },
        {
          "id": "kvlo8zm",
          "author": "TheMadHatterWasHere",
          "body": "I get that. That's what Ana felt like to me before I \"recovered\" two years ago. Except I didn't actually recover. I just thought I did. I was so sick that I thought that what I was eating was normal. And these last two months I have had to count calories to be sure I wasn't grossly undereating, bc I have no feeling of what is normal anymore :S",
          "created_utc": 1710867057.0
        },
        {
          "id": "kvlp3gz",
          "author": "internetcatalliance",
          "body": "Same actually\n\nI never stuck to recovery for long\n\nBut every time I did, I found intuitive eating fucking useless \n\nMy default is literally starving, I had to count cals so I don't undereat \n\nWhich ofc eventually just made me relapse in like 2 weeks and there, \"eat of the apple, so young, I'm crawling back to start\"\n\nTo quote a song...",
          "created_utc": 1710867337.0
        },
        {
          "id": "kvqn452",
          "author": "helianthus_0",
          "body": "In defense of intuitive eating, you can’t start it while malnourished. Of course you’ll be ruled by your AN. You need to get to a point where you’ve been adequately nourished for several months, and ideally working with a professional if possible, when your brain is healthier, before you can incorporate IE. \n\nIn response to another comment you made here, we all think there’s some magic weight we’ll achieve, look down at the scale, and our lives and mood will change for the better. We’ll finally be happy. It’s smoke and mirrors, it’s bullshit. The happiness is very fleeting and then, we’re back to being miserable again. We realize the only thing that’s changed is that we’re sicker, with more medical complications, and deeper into this shithole that’s now even harder to crawl out of. Getting to underweight didn’t make you happy, neither will being severely underweight.",
          "created_utc": 1710946201.0
        }
      ]
    },
    {
      "id": "kvlsjqi",
      "author": "internetcatalliance",
      "body": "I honestly relate\n\nI don't think I'll try to recover again anytime soon\n\nI'm really close to my goal, and it seems like I'd be giving up right before the finish line\n\nI guess I want to see if being severely underweight is actually gonna make me happy\n\nIf not then... I guess at that point I can try to quit, but I know recovering at that point would be pretty hard \n\nIf not potentially deadly, I already had a refeeding syndrome scare when I was tube fed for the first time, and u was fucking obese \n\nYeah no carb and anorexia... not a good mix",
      "created_utc": 1710868490.0,
      "score": 3,
      "context": [
        {
          "id": "kvlh4j7",
          "author": "TheMadHatterWasHere",
          "body": "Honestly Ana has felt so normal to me the last two years that I genuinely thought I had recovered xD",
          "created_utc": 1710864577.0
        },
        {
          "id": "kvlhqhe",
          "author": "internetcatalliance",
          "body": "I never felt like that, but its scary how much it resembles any other way of being, almost as if its just a quirky little lifestyle choice\n\nI think, I for the first time truly understand why some anorexics so insist on it being a lifestyle, I honestly do, I get it\n\nAnd its strange because I have several mental disorders \n\nAnorexia is the only one that feels so deeply normal, as if I'm perfectly fine and nothings wrong \n\nI'm even happy? I smile and laugh, chill with friends \n\nAll while eating so little, with all these anorexic thoughts",
          "created_utc": 1710864781.0
        },
        {
          "id": "kvlo8zm",
          "author": "TheMadHatterWasHere",
          "body": "I get that. That's what Ana felt like to me before I \"recovered\" two years ago. Except I didn't actually recover. I just thought I did. I was so sick that I thought that what I was eating was normal. And these last two months I have had to count calories to be sure I wasn't grossly undereating, bc I have no feeling of what is normal anymore :S",
          "created_utc": 1710867057.0
        },
        {
          "id": "kvlp3gz",
          "author": "internetcatalliance",
          "body": "Same actually\n\nI never stuck to recovery for long\n\nBut every time I did, I found intuitive eating fucking useless \n\nMy default is literally starving, I had to count cals so I don't undereat \n\nWhich ofc eventually just made me relapse in like 2 weeks and there, \"eat of the apple, so young, I'm crawling back to start\"\n\nTo quote a song...",
          "created_utc": 1710867337.0
        },
        {
          "id": "kvlrcpb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710868088.0
        }
      ]
    },
    {
      "id": "kvo1rqu",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1710896679.0,
      "score": 2,
      "context": [
        {
          "id": "kvlh4j7",
          "author": "TheMadHatterWasHere",
          "body": "Honestly Ana has felt so normal to me the last two years that I genuinely thought I had recovered xD",
          "created_utc": 1710864577.0
        },
        {
          "id": "kvlhqhe",
          "author": "internetcatalliance",
          "body": "I never felt like that, but its scary how much it resembles any other way of being, almost as if its just a quirky little lifestyle choice\n\nI think, I for the first time truly understand why some anorexics so insist on it being a lifestyle, I honestly do, I get it\n\nAnd its strange because I have several mental disorders \n\nAnorexia is the only one that feels so deeply normal, as if I'm perfectly fine and nothings wrong \n\nI'm even happy? I smile and laugh, chill with friends \n\nAll while eating so little, with all these anorexic thoughts",
          "created_utc": 1710864781.0
        },
        {
          "id": "kvlo8zm",
          "author": "TheMadHatterWasHere",
          "body": "I get that. That's what Ana felt like to me before I \"recovered\" two years ago. Except I didn't actually recover. I just thought I did. I was so sick that I thought that what I was eating was normal. And these last two months I have had to count calories to be sure I wasn't grossly undereating, bc I have no feeling of what is normal anymore :S",
          "created_utc": 1710867057.0
        },
        {
          "id": "kvlp3gz",
          "author": "internetcatalliance",
          "body": "Same actually\n\nI never stuck to recovery for long\n\nBut every time I did, I found intuitive eating fucking useless \n\nMy default is literally starving, I had to count cals so I don't undereat \n\nWhich ofc eventually just made me relapse in like 2 weeks and there, \"eat of the apple, so young, I'm crawling back to start\"\n\nTo quote a song...",
          "created_utc": 1710867337.0
        },
        {
          "id": "kvlrcpb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710868088.0
        }
      ]
    },
    {
      "id": "kvmmllp",
      "author": "internetcatalliance",
      "body": "Haha lmao not with me, I'm the opposite! Summer means exercise fuckerssss, it's skinny bitch season XD\n\nOK cringe aside....\n\nIt's all so comfortable you know?",
      "created_utc": 1710878504.0,
      "score": 5,
      "context": [
        {
          "id": "kvlot2h",
          "author": "Sad_Knee7",
          "body": "**\"I am actually not fat for the first time in 12 years, how can I not be happy?\"\nAaah god I can relate 100%\n\nI'm going through what you're going through, I got used to it to a point that now it's part of myself and everything thing in my life, and I don't have many issues with it but the random headaches and wanting to sleep but can't sleep 🤣\nSometimes I feel like I don't have ED at all",
          "created_utc": 1710867241.0
        },
        {
          "id": "kvlpei9",
          "author": "internetcatalliance",
          "body": "My ED feels integral to my identity \n\nIt feels like... the most interesting thing about me\n\nI feel like I would be losing a part of who I am if I recovered\n\nTHAT Is why I never got better no matter how many times I tried...\n\nI simply don't want to lose the lifestyle, the sickness, the identity it gives, all this insane shit, online communities...\n\nI don't want to lose who I am",
          "created_utc": 1710867437.0
        },
        {
          "id": "kvlr9js",
          "author": "Sad_Knee7",
          "body": "ED play a large role in my interests and lifestyle, it's something part of me, but it's not my whole identity\n\nAlso I'm afraid to recover, cause I don't wanna lose the biggest part of me, what am I gonna do if lost it? How life feels without being fucked up with food and so much rules?🤣",
          "created_utc": 1710868059.0
        },
        {
          "id": "kvlrwjb",
          "author": "internetcatalliance",
          "body": "Ikr... How can I live without weight loss?\n\nI need that spike of serotonin in the morning man :/",
          "created_utc": 1710868275.0
        },
        {
          "id": "kvlt4v2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710868685.0
        }
      ]
    },
    {
      "id": "kvo1tgh",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1710896698.0,
      "score": 2,
      "context": [
        {
          "id": "kvlot2h",
          "author": "Sad_Knee7",
          "body": "**\"I am actually not fat for the first time in 12 years, how can I not be happy?\"\nAaah god I can relate 100%\n\nI'm going through what you're going through, I got used to it to a point that now it's part of myself and everything thing in my life, and I don't have many issues with it but the random headaches and wanting to sleep but can't sleep 🤣\nSometimes I feel like I don't have ED at all",
          "created_utc": 1710867241.0
        },
        {
          "id": "kvlpei9",
          "author": "internetcatalliance",
          "body": "My ED feels integral to my identity \n\nIt feels like... the most interesting thing about me\n\nI feel like I would be losing a part of who I am if I recovered\n\nTHAT Is why I never got better no matter how many times I tried...\n\nI simply don't want to lose the lifestyle, the sickness, the identity it gives, all this insane shit, online communities...\n\nI don't want to lose who I am",
          "created_utc": 1710867437.0
        },
        {
          "id": "kvlr9js",
          "author": "Sad_Knee7",
          "body": "ED play a large role in my interests and lifestyle, it's something part of me, but it's not my whole identity\n\nAlso I'm afraid to recover, cause I don't wanna lose the biggest part of me, what am I gonna do if lost it? How life feels without being fucked up with food and so much rules?🤣",
          "created_utc": 1710868059.0
        },
        {
          "id": "kvlrwjb",
          "author": "internetcatalliance",
          "body": "Ikr... How can I live without weight loss?\n\nI need that spike of serotonin in the morning man :/",
          "created_utc": 1710868275.0
        },
        {
          "id": "kvlt4v2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710868685.0
        }
      ]
    },
    {
      "id": "kvlvae0",
      "author": "internetcatalliance",
      "body": "thats not really how it works here in Norway.... U dont really \"find\" a therapist, you get given one, and if they suck it takes months to get another one, and eventually unfortunately if they deem it that they cant help you anymore u just get kicked out :/\n\nI COULD go private, but im not on disability yet and im poor as FUCK, there is no way I can afford it\n\nWell...... I could also be referred to a treatment centre, but honestly my local one sounds like the kind of place that would force hospitalise me and torment me, im so fucking scared of doctors man.... Feel like they interrogate me",
      "created_utc": 1710869398.0,
      "score": 5,
      "context": [
        {
          "id": "kvlkmgw",
          "author": "creditpro99",
          "body": "Are you in therapy?",
          "created_utc": 1710865832.0
        },
        {
          "id": "kvllfn1",
          "author": "internetcatalliance",
          "body": "No\n\nI wouldn't mind being in therapy\n\nBut no psych wants to see me, I've been told (by medical professionals) that there's no point trying to find a new one",
          "created_utc": 1710866110.0
        },
        {
          "id": "kvlnvwi",
          "author": "SieBanhus",
          "body": "Have they told you why?",
          "created_utc": 1710866936.0
        },
        {
          "id": "kvlof0s",
          "author": "internetcatalliance",
          "body": "\"There has to be something new to refer you for, you have already been treated for everything\"\n\nIDK If you consider being tube fed twice and two psychs, both eventually telling me to fuck off adequate treatment\n\nLook I have the right to a second opinion... and I could do it over and over and over again\n\nBut I'm tired, honestly I am, last psych gave me medical trauma and now I'm scared of doctors \n\nI just want someone to fucking talk to me, but no they all kick me out for \"non compliance\" like for fucks sake....\n\nI gave up on the medical system \n\nI'm planning to look into unaffiliated organisations that can offer me talk therapy, clearly the healthcare system is more occupied with \"results\" than helping a fucking chick cope with life",
          "created_utc": 1710867113.0
        },
        {
          "id": "kvlualt",
          "author": "creditpro99",
          "body": "Please find a therapist that specializes in eating disorders. Even if via zoom. If one isn't a good fit, keep trying new ones. Insurance covers it, it's a mental illness and a good therapist should refer you to a nutritionist, which you need. Consistency is the key. \n\nNot everyone has someone to advocate for them, so you will just have to do it yourself.  Don't give up on yourself! Hang in there and be tough!! xoxo",
          "created_utc": 1710869068.0
        }
      ]
    },
    {
      "id": "kvml0jb",
      "author": "internetcatalliance",
      "body": "Yeah!\n\nTho we both know there's no way I'm stopping here, my specific weight goal would put me in like, severe anorexia category by bmi alone (tho my medical files mention \"severe eating disorder\" everywhere so???)\n\nIDK i just\n\nI want to be an overachiever \n\nI feel like, why should I settle for anything but the most extreme expression of the most fucked up body standard imaginable?\n\nIDK man I need help... if only I could genuinely talk to someone about this shit",
      "created_utc": 1710877983.0,
      "score": 5,
      "context": [
        {
          "id": "kvlzkwd",
          "author": "Mammoth_Exam1354",
          "body": "Explain I am actually not fat part???",
          "created_utc": 1710870821.0
        },
        {
          "id": "kvm0f9i",
          "author": "internetcatalliance",
          "body": "well I meant it literally.... Im in the healthy bmi range for the first time since I was a young teenager\n\nAnd I sure as hell look like it too, I dont really have body dysmorphia, and i am absolutely losing it over how good i actually look, I look like any other average girl, and I love it\n\nFinally... I dont feel fat",
          "created_utc": 1710871099.0
        },
        {
          "id": "kvmbw36",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710874925.0
        },
        {
          "id": "kvmgao3",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710876404.0
        },
        {
          "id": "kvmkfmz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710877795.0
        }
      ]
    },
    {
      "id": "kvo1ze7",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 6: Don't glorify the eating disorder. \n\nr/AnorexiaNervosa is not a pro-ED subreddit, but we also do not force people to recover if they do not want to recover. \n\nGlorifying something harmful and potentially life-threatening and making it seem like something less bad is harmful to the community of r/AnorexiaNervosa. Glorification will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1710896762.0,
      "score": 3,
      "context": [
        {
          "id": "kvlzkwd",
          "author": "Mammoth_Exam1354",
          "body": "Explain I am actually not fat part???",
          "created_utc": 1710870821.0
        },
        {
          "id": "kvm0f9i",
          "author": "internetcatalliance",
          "body": "well I meant it literally.... Im in the healthy bmi range for the first time since I was a young teenager\n\nAnd I sure as hell look like it too, I dont really have body dysmorphia, and i am absolutely losing it over how good i actually look, I look like any other average girl, and I love it\n\nFinally... I dont feel fat",
          "created_utc": 1710871099.0
        },
        {
          "id": "kvmbw36",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710874925.0
        },
        {
          "id": "kvmgao3",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710876404.0
        },
        {
          "id": "kvmkfmz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710877795.0
        }
      ]
    },
    {
      "id": "kvmo0rb",
      "author": "Sad_Knee7",
      "body": "I get super lazy at summer and I get binge eating for days🤣, but in winter it's easy for me to not have binge eating and exercise like crazy heheh\n\nYeah I know hahaha",
      "created_utc": 1710878981.0,
      "score": 2,
      "context": [
        {
          "id": "kvlot2h",
          "author": "Sad_Knee7",
          "body": "**\"I am actually not fat for the first time in 12 years, how can I not be happy?\"\nAaah god I can relate 100%\n\nI'm going through what you're going through, I got used to it to a point that now it's part of myself and everything thing in my life, and I don't have many issues with it but the random headaches and wanting to sleep but can't sleep 🤣\nSometimes I feel like I don't have ED at all",
          "created_utc": 1710867241.0
        },
        {
          "id": "kvlpei9",
          "author": "internetcatalliance",
          "body": "My ED feels integral to my identity \n\nIt feels like... the most interesting thing about me\n\nI feel like I would be losing a part of who I am if I recovered\n\nTHAT Is why I never got better no matter how many times I tried...\n\nI simply don't want to lose the lifestyle, the sickness, the identity it gives, all this insane shit, online communities...\n\nI don't want to lose who I am",
          "created_utc": 1710867437.0
        },
        {
          "id": "kvlr9js",
          "author": "Sad_Knee7",
          "body": "ED play a large role in my interests and lifestyle, it's something part of me, but it's not my whole identity\n\nAlso I'm afraid to recover, cause I don't wanna lose the biggest part of me, what am I gonna do if lost it? How life feels without being fucked up with food and so much rules?🤣",
          "created_utc": 1710868059.0
        },
        {
          "id": "kvlrwjb",
          "author": "internetcatalliance",
          "body": "Ikr... How can I live without weight loss?\n\nI need that spike of serotonin in the morning man :/",
          "created_utc": 1710868275.0
        },
        {
          "id": "kvlt4v2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710868685.0
        },
        {
          "id": "kvmmllp",
          "author": "internetcatalliance",
          "body": "Haha lmao not with me, I'm the opposite! Summer means exercise fuckerssss, it's skinny bitch season XD\n\nOK cringe aside....\n\nIt's all so comfortable you know?",
          "created_utc": 1710878504.0
        }
      ]
    },
    {
      "id": "kvmoopn",
      "author": "internetcatalliance",
      "body": "Gosh for me it's like\n\nThe only form of exercise I genuinely like is just walking aimlessly around the city?\n\nThe problem is that late autumn - mid spring temperatures for mid-Norway range from 0 to maybe 8 degrees C\n\nSo yeah ur fucked, winter coat, double layering everything, and u better carry nose spray and pray for that eyeshadow, hope those tears don't ruin it!",
      "created_utc": 1710879201.0,
      "score": 3,
      "context": [
        {
          "id": "kvlot2h",
          "author": "Sad_Knee7",
          "body": "**\"I am actually not fat for the first time in 12 years, how can I not be happy?\"\nAaah god I can relate 100%\n\nI'm going through what you're going through, I got used to it to a point that now it's part of myself and everything thing in my life, and I don't have many issues with it but the random headaches and wanting to sleep but can't sleep 🤣\nSometimes I feel like I don't have ED at all",
          "created_utc": 1710867241.0
        },
        {
          "id": "kvlpei9",
          "author": "internetcatalliance",
          "body": "My ED feels integral to my identity \n\nIt feels like... the most interesting thing about me\n\nI feel like I would be losing a part of who I am if I recovered\n\nTHAT Is why I never got better no matter how many times I tried...\n\nI simply don't want to lose the lifestyle, the sickness, the identity it gives, all this insane shit, online communities...\n\nI don't want to lose who I am",
          "created_utc": 1710867437.0
        },
        {
          "id": "kvlr9js",
          "author": "Sad_Knee7",
          "body": "ED play a large role in my interests and lifestyle, it's something part of me, but it's not my whole identity\n\nAlso I'm afraid to recover, cause I don't wanna lose the biggest part of me, what am I gonna do if lost it? How life feels without being fucked up with food and so much rules?🤣",
          "created_utc": 1710868059.0
        },
        {
          "id": "kvlrwjb",
          "author": "internetcatalliance",
          "body": "Ikr... How can I live without weight loss?\n\nI need that spike of serotonin in the morning man :/",
          "created_utc": 1710868275.0
        },
        {
          "id": "kvlt4v2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710868685.0
        },
        {
          "id": "kvmmllp",
          "author": "internetcatalliance",
          "body": "Haha lmao not with me, I'm the opposite! Summer means exercise fuckerssss, it's skinny bitch season XD\n\nOK cringe aside....\n\nIt's all so comfortable you know?",
          "created_utc": 1710878504.0
        },
        {
          "id": "kvmo0rb",
          "author": "Sad_Knee7",
          "body": "I get super lazy at summer and I get binge eating for days🤣, but in winter it's easy for me to not have binge eating and exercise like crazy heheh\n\nYeah I know hahaha",
          "created_utc": 1710878981.0
        }
      ]
    }
  ]
}