{
  "id": "1bumo4b",
  "subreddit": "AnorexiaNervosa",
  "author": "pessimistic_witch",
  "created_utc": 1712129719.0,
  "title": "What was your weirdest ed thought?",
  "selftext": "Mine was “I wish I could go to jail bc they probably wouldn’t notice for a while or wouldn’t care” 💀 idk if anyone else has these thoughts but it makes me giggle because what person would want that😭",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1bumo4b/what_was_your_weirdest_ed_thought/",
  "score": 135,
  "num_comments": 70,
  "comments": [
    {
      "id": "kxtlty3",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1712129719.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kxtohfz",
      "author": "tartagliax",
      "body": "fantasizing about being kidnapped and abused and neglected for months so i would become emaciated",
      "created_utc": 1712131731.0,
      "score": 139,
      "context": []
    },
    {
      "id": "kxuaxa8",
      "author": "sweetbaeunleashed",
      "body": "*desiring* to reach hospital status because that means I *made it* 🥴 like tf.",
      "created_utc": 1712146070.0,
      "score": 99,
      "context": []
    },
    {
      "id": "kxtzmmt",
      "author": "FruitSalad_24",
      "body": "My weirdest was probably hoping to get food poisoning",
      "created_utc": 1712139895.0,
      "score": 73,
      "context": []
    },
    {
      "id": "kxuxpw8",
      "author": "-aquapixie-",
      "body": "I considered a tapeworm because I'd get skinny AND have a pet who lives in my skin",
      "created_utc": 1712155187.0,
      "score": 47,
      "context": []
    },
    {
      "id": "kxuxsvi",
      "author": "LiminalDeer",
      "body": "“I should cut my hair, maybe I’ll weigh less” it was fleeting, cuz then I realized im dumb as shit. I also thought that touching something greasy would cause me to absorb calories through my skin. Yes I also have OCD why do you ask",
      "created_utc": 1712155216.0,
      "score": 50,
      "context": []
    },
    {
      "id": "kxuii87",
      "author": "Glittering_goat25",
      "body": "We have a lot of poverty in my country… A beggar had a board stating that he is hungry. I drove past and thought: “Same brotha. Same” 😭 I feel like a horrible person",
      "created_utc": 1712149414.0,
      "score": 26,
      "context": []
    },
    {
      "id": "kxu792b",
      "author": "None",
      "body": "wanting to look like a zombie from the walking dead where their ribs stick out and stuff. idk how it got there -_-",
      "created_utc": 1712144275.0,
      "score": 24,
      "context": []
    },
    {
      "id": "kxujrdy",
      "author": "SergeantPotatoChip1",
      "body": "I used to (and still do) imagine how if I was in the zombie apocalypse how much weight I would lose from all of the running and exercising 😭\n\nI used to also imagine myself in h20 just add water and think about how if I was a mermaid and had a job I could never eat and lose weight...I know 😔 but I was 12-14",
      "created_utc": 1712149930.0,
      "score": 24,
      "context": []
    },
    {
      "id": "kxvijbv",
      "author": "False_Look_1212",
      "body": "One of my coworkers said she \"must've lost 10 pounds when she had COVID\". So I kept hoping to have it, or some other sickness, and lose weight from that.",
      "created_utc": 1712162051.0,
      "score": 18,
      "context": []
    },
    {
      "id": "kxtyh7r",
      "author": "Remarkable-Pirate214",
      "body": "I’d probably call it an ed intrusive thought, but worried breathing the same air as larger people will make me fat - I am not this type of person. You gotta laugh at yourself sometimes.",
      "created_utc": 1712139126.0,
      "score": 36,
      "context": []
    },
    {
      "id": "kxv5wa0",
      "author": "squidkyd",
      "body": "I experienced the loss of a family member I was extremely close to and I thought to myself \"ooh I hope this becomes fuel for me to restrict!\"\n\nI've compared my body to like actual children before. That makes me feel gross \n\nI've thought about my country collapsing into civil war resulting in a famine that causes me to become an emaciated refugee like in Yemen and Syria\n\nBasically my ED makes me a bad person. I'd like to not have those thoughts lol",
      "created_utc": 1712157949.0,
      "score": 15,
      "context": []
    },
    {
      "id": "kxv47pg",
      "author": "None",
      "body": "People thinking I was as sick-looking as I felt",
      "created_utc": 1712157395.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kxvq6bl",
      "author": "K0MAEDA",
      "body": "tmi, but being constipated was validating to me. on one hand i hated it, but on the other hand i was like “oooh this means i’m doing good!!”",
      "created_utc": 1712164513.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kxvbri9",
      "author": "XxMrCoolGuyxX",
      "body": "For a while I started wishing I had cancer, I had a specific one I wanted too, so I could lose weight\n\nI know that cancer is a horrible disease, I have lost family to it, but the ED doesn’t care about that I guess",
      "created_utc": 1712159852.0,
      "score": 26,
      "context": []
    },
    {
      "id": "kxveqx5",
      "author": "Late-Original-5056",
      "body": "hoping i’d get some horrible GI conditions so i’d loose rapid amounts of weight and could only eat through a tube. ashamed to even say it",
      "created_utc": 1712160826.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kxw23gu",
      "author": "Sao_118",
      "body": "I remember once during my junior year of high school I had my teacher say to me worried: “You’re so thin it looks like you might disappear” and I felt so happy when she said that.",
      "created_utc": 1712168331.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kxw93jz",
      "author": "None",
      "body": "I literally faked suicidal ideation so that I could be sent to a psych ward and starve and not deal with my family begging me to eat. Funnily enough, they shipped me off to a ED facility where I temporarily recovered, ha ha….ha….ha.",
      "created_utc": 1712170522.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kxx33zn",
      "author": "Few_Bell_8166",
      "body": "wish i could become a hard drug addict so i could get skinny like my friend who was struggling with addiction, not my proudest moment :/",
      "created_utc": 1712180102.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kxw92iu",
      "author": "meyuh666",
      "body": "wanting a stomach virus/the flu so i wouldnt want food for a week, wanting to need jaw surgery so i wouldnt be able to eat anything besides having fluids for awhile",
      "created_utc": 1712170513.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kxvuz9p",
      "author": "babyswinub",
      "body": "I currently have inflamed intestines from a medical condition we’re still trying to figure out. I can’t hold down anything besides rice. When the doctor told me I lost 15 pounds in the course of a month I thought “yo what if I just didn’t do anything abt this and kept it going” 😭",
      "created_utc": 1712166051.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kxw1a40",
      "author": "PseudonymBallerina",
      "body": "Intentionally hurting my gums so it would hurt to eat🤣🤣",
      "created_utc": 1712168073.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kxzvtcp",
      "author": "lilbabyhoneyy",
      "body": "wishing I would pass out at work so somebody would actually know that I need help :))))",
      "created_utc": 1712229493.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kxxbrr4",
      "author": "-u-dont-know-me-",
      "body": "I can't wait until I get skinny enough that people are concerned for my wellbeing. I wanna be small and fragile so if someone bumps into me or something they get worried that they hurt me. I want to be skinny enough that it sends me to the hospital, that it causes irreversible damage, so maybe I'll feel like I've done enough. Like I want to get worse, maybe it will make me lose weight faster.\n\nI also think that if I got back with my ex(who hurt me physically and emotionally) maybe it would trigger me enough to restrict more",
      "created_utc": 1712183072.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kxxrxhu",
      "author": "BoringNameBoringLife",
      "body": "One time I almost convinced my dad to kick me out of the house when I was 18. I legit got so excited because I didn't have a job and wouldn't be able to afford food...",
      "created_utc": 1712188993.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kxy08rk",
      "author": "tisiphxne",
      "body": "debating begging my psychiatrist for adderall or ritalin (to help kill my appetite but they don’t need to know that 🤐)",
      "created_utc": 1712192118.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kxymhj1",
      "author": "voultron",
      "body": "Thought about doing cocaine again so I could get back down to that weight",
      "created_utc": 1712201116.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kxzbk14",
      "author": "58740452",
      "body": "I wanted to chop off my arm just to make the number of the scale go down, got help after the thought",
      "created_utc": 1712215769.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kxzcm10",
      "author": "Downtown_King_9983",
      "body": "i cried after taking my dog to the vet cause i was jealous of her weight and thought it was unfair that if my dog skipped a meal my mum wouldn't shout at her but would shout at me to eat. (shes a small cockapoo who is a healthy weight btw idk what i was on abt)",
      "created_utc": 1712216548.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ky1cs4s",
      "author": "ShotPrune6395",
      "body": "That if I loved alone I would padlock the cupboards and glue the fridge doors shut and flush the keys! 🤷‍♀️",
      "created_utc": 1712249678.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kybstfa",
      "author": "im-n0t-hungry",
      "body": "Wanting to be on the survival show “Lost” because then I wouldn’t be forced to eat.",
      "created_utc": 1712414266.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kxxs9ys",
      "author": "Remarkable-Profit821",
      "body": "Wishing I had a food allergy or intolerance",
      "created_utc": 1712189122.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kxzck5n",
      "author": "kingkurtiss",
      "body": "i remember catching myself looking at the nutritional information on the back of my dog’s food once. i realised and was like wtf am i doing here and went on with my day but to think that it was just such a habit",
      "created_utc": 1712216508.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kxzzdup",
      "author": "aquarivmr",
      "body": "I had a bad case of c diff(life threatening gut infection that makes you have intense diarrhea and pain) once and thought “ atleast it’s helping me lose weight” and when it went away I felt guilty about wanting it again to lose weight 💀💀💀💀let’s just say I got it again and it didn’t make me lose any more🥴",
      "created_utc": 1712231357.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky0gttn",
      "author": "Constant_Truth671",
      "body": "I have celiac disease so I would purposely eat gluten to \n1. Throw up \n2. My body wouldn’t absorb any nutrients and therefore I thought I’d be skinnier 💀\n\nDefinitely just increased my colon cancer probabilities but in my head being skinnier was more important 😭",
      "created_utc": 1712238786.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky253qy",
      "author": "Miss_paris_22",
      "body": "I couldn’t wait to turn 18 because then I couldn’t be forced to recover because I’m legally an adult and I could restrict to my heats desire since no one could do anything about it .",
      "created_utc": 1712258819.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky50fsv",
      "author": "notparkinglot",
      "body": "\"I miss starving myself because I used to get so many compliments back then\" ...but then I remembered people were actually insulting me for looking too thin and my ED was taking it as a compliment lol",
      "created_utc": 1712302066.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky81dd2",
      "author": "severelysmart",
      "body": "I wished to get a chronic illness or other type of difficult diseases so it would make me loose more weight. Looking back at this, i feel sick.",
      "created_utc": 1712347897.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky10nk6",
      "author": "Harl-3y",
      "body": "if i die i will reach my weight?? likehuh",
      "created_utc": 1712245695.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ky26gs8",
      "author": "None",
      "body": "Running away from my family and living in a fucking forest so i could starve myself😭😭oh and also I remember cutting two calorie gums in two pieces and only chewing a one piece and throwing the otger away so that i could ‘save calories’",
      "created_utc": 1712259253.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ky37utd",
      "author": "None",
      "body": "I compared my body and wanted to be as small as a child. I was my happiest when I could shop in the children’s section",
      "created_utc": 1712271651.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ky4h0r0",
      "author": "Pink_Bread_76",
      "body": "I think they would care actually! I think if you don’t eat they punish you (at least what I see on tv)",
      "created_utc": 1712290216.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kyk71iq",
      "author": "pgkitten",
      "body": "what if my contact lenses hold water",
      "created_utc": 1712541869.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kyo6wcx",
      "author": "Skythebluestars",
      "body": "I was convinced i was holding water weight with every sip i took. So i barely drank water. 🤦🏽‍♀️ i ended up dehydrated. \n\n\n\nHoping to be kidnapped, and be starved . \nI feel so bad for thinking that.\nBecause i really feel sorry for those people who been through that. \n\nGetting plastic surgery. \nNot that i have the money.",
      "created_utc": 1712609025.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l0xmx69",
      "author": "luv_ana_",
      "body": "When my rabbit died, I was so thankfull for him because that give me a \"good\" reason to starving myself. I feel awfull for this because I loved him si much.",
      "created_utc": 1713900093.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kxuds4p",
      "author": "Katttio",
      "body": "Omg I remember seeing a documentary about a poor girl being kidnapped, abused and starved and how UW she had gotten when they saved her and the whole time I was just thinking : mannn, what if I-",
      "created_utc": 1712147378.0,
      "score": 48,
      "context": [
        {
          "id": "kxtohfz",
          "author": "tartagliax",
          "body": "fantasizing about being kidnapped and abused and neglected for months so i would become emaciated",
          "created_utc": 1712131731.0
        }
      ]
    },
    {
      "id": "kxuxmi1",
      "author": "LiminalDeer",
      "body": "I haven’t had a single original thought",
      "created_utc": 1712155154.0,
      "score": 30,
      "context": [
        {
          "id": "kxtohfz",
          "author": "tartagliax",
          "body": "fantasizing about being kidnapped and abused and neglected for months so i would become emaciated",
          "created_utc": 1712131731.0
        }
      ]
    },
    {
      "id": "kxv0y5e",
      "author": "None",
      "body": "same and then i had to be force fed. not fun i'm tellin u",
      "created_utc": 1712156298.0,
      "score": 23,
      "context": [
        {
          "id": "kxuaxa8",
          "author": "sweetbaeunleashed",
          "body": "*desiring* to reach hospital status because that means I *made it* 🥴 like tf.",
          "created_utc": 1712146070.0
        }
      ]
    },
    {
      "id": "ky4gw4y",
      "author": "Pink_Bread_76",
      "body": "me rn. tube and all. it’s a weird love hate being taken care of and so sick and all the things idk",
      "created_utc": 1712290149.0,
      "score": 3,
      "context": [
        {
          "id": "kxuaxa8",
          "author": "sweetbaeunleashed",
          "body": "*desiring* to reach hospital status because that means I *made it* 🥴 like tf.",
          "created_utc": 1712146070.0
        }
      ]
    },
    {
      "id": "kxudey8",
      "author": "Remarkable-Pirate214",
      "body": "Yup, same.\n\nIn The Devil Wears Prada, Emily says “I’m just one stomach flu away from my goal weight” this world is so toxic sometimes",
      "created_utc": 1712147210.0,
      "score": 40,
      "context": [
        {
          "id": "kxtzmmt",
          "author": "FruitSalad_24",
          "body": "My weirdest was probably hoping to get food poisoning",
          "created_utc": 1712139895.0
        }
      ]
    },
    {
      "id": "kxudwbt",
      "author": "Katttio",
      "body": "I once thought about purposefully eating expired yoghurt to get food poisoning 😭",
      "created_utc": 1712147430.0,
      "score": 14,
      "context": [
        {
          "id": "kxtzmmt",
          "author": "FruitSalad_24",
          "body": "My weirdest was probably hoping to get food poisoning",
          "created_utc": 1712139895.0
        }
      ]
    },
    {
      "id": "kxwfvi9",
      "author": "tvbee876",
      "body": "Same!!",
      "created_utc": 1712172647.0,
      "score": 3,
      "context": [
        {
          "id": "kxtzmmt",
          "author": "FruitSalad_24",
          "body": "My weirdest was probably hoping to get food poisoning",
          "created_utc": 1712139895.0
        }
      ]
    },
    {
      "id": "kxv0v34",
      "author": "Ok-Maximum2228",
      "body": "I thought lotion would make me absorb calories and gain weight same with chapstick. I still sometimes get these thoughts.",
      "created_utc": 1712156269.0,
      "score": 16,
      "context": [
        {
          "id": "kxuxsvi",
          "author": "LiminalDeer",
          "body": "“I should cut my hair, maybe I’ll weigh less” it was fleeting, cuz then I realized im dumb as shit. I also thought that touching something greasy would cause me to absorb calories through my skin. Yes I also have OCD why do you ask",
          "created_utc": 1712155216.0
        }
      ]
    },
    {
      "id": "kxymbdx",
      "author": "slither36912",
      "body": "Oml me too",
      "created_utc": 1712201040.0,
      "score": 3,
      "context": [
        {
          "id": "kxvbri9",
          "author": "XxMrCoolGuyxX",
          "body": "For a while I started wishing I had cancer, I had a specific one I wanted too, so I could lose weight\n\nI know that cancer is a horrible disease, I have lost family to it, but the ED doesn’t care about that I guess",
          "created_utc": 1712159852.0
        }
      ]
    },
    {
      "id": "ky36bw0",
      "author": "hellomate242",
      "body": "I had cancer, with an ED. When I was getting treatment and still now I would wish to go back to when I had it so I could be skinnier because even though I was in pain I still looked good. It’s weird because cancer is my worst nightmare and if I had to go through again idk what I would do but I feel like I’m more scared of gaining weight.",
      "created_utc": 1712271080.0,
      "score": 3,
      "context": [
        {
          "id": "kxvbri9",
          "author": "XxMrCoolGuyxX",
          "body": "For a while I started wishing I had cancer, I had a specific one I wanted too, so I could lose weight\n\nI know that cancer is a horrible disease, I have lost family to it, but the ED doesn’t care about that I guess",
          "created_utc": 1712159852.0
        }
      ]
    },
    {
      "id": "ky1dc76",
      "author": "ShotPrune6395",
      "body": "Was just about to write this. Sad.",
      "created_utc": 1712249860.0,
      "score": 2,
      "context": [
        {
          "id": "kxvbri9",
          "author": "XxMrCoolGuyxX",
          "body": "For a while I started wishing I had cancer, I had a specific one I wanted too, so I could lose weight\n\nI know that cancer is a horrible disease, I have lost family to it, but the ED doesn’t care about that I guess",
          "created_utc": 1712159852.0
        }
      ]
    },
    {
      "id": "kxx22zw",
      "author": "pessimistic_witch",
      "body": "I ended up with this and can say it is a 0/10 experience",
      "created_utc": 1712179757.0,
      "score": 5,
      "context": [
        {
          "id": "kxveqx5",
          "author": "Late-Original-5056",
          "body": "hoping i’d get some horrible GI conditions so i’d loose rapid amounts of weight and could only eat through a tube. ashamed to even say it",
          "created_utc": 1712160826.0
        }
      ]
    },
    {
      "id": "kxx2932",
      "author": "pessimistic_witch",
      "body": "Omg I used to do this or go to ed treatment just so I could starve without my family stopping me",
      "created_utc": 1712179813.0,
      "score": 4,
      "context": [
        {
          "id": "kxw93jz",
          "author": "None",
          "body": "I literally faked suicidal ideation so that I could be sent to a psych ward and starve and not deal with my family begging me to eat. Funnily enough, they shipped me off to a ED facility where I temporarily recovered, ha ha….ha….ha.",
          "created_utc": 1712170522.0
        }
      ]
    },
    {
      "id": "kxxd3vj",
      "author": "Remarkable-Pirate214",
      "body": "It’s okay ♡ this is a safe space",
      "created_utc": 1712183546.0,
      "score": 3,
      "context": [
        {
          "id": "kxx33zn",
          "author": "Few_Bell_8166",
          "body": "wish i could become a hard drug addict so i could get skinny like my friend who was struggling with addiction, not my proudest moment :/",
          "created_utc": 1712180102.0
        }
      ]
    },
    {
      "id": "kxxddp5",
      "author": "Remarkable-Pirate214",
      "body": "Dude I get you. I 100% get you. Thankyou for sharing and I know you’re smarter than that ♡ \n\nMe, I don’t want irreversible damage, just the fragility and worry. Big time tho",
      "created_utc": 1712183643.0,
      "score": 2,
      "context": [
        {
          "id": "kxxbrr4",
          "author": "-u-dont-know-me-",
          "body": "I can't wait until I get skinny enough that people are concerned for my wellbeing. I wanna be small and fragile so if someone bumps into me or something they get worried that they hurt me. I want to be skinny enough that it sends me to the hospital, that it causes irreversible damage, so maybe I'll feel like I've done enough. Like I want to get worse, maybe it will make me lose weight faster.\n\nI also think that if I got back with my ex(who hurt me physically and emotionally) maybe it would trigger me enough to restrict more",
          "created_utc": 1712183072.0
        }
      ]
    },
    {
      "id": "ky63bol",
      "author": "pessimistic_witch",
      "body": "I have adhd so I’m slaying over here 🕺",
      "created_utc": 1712324222.0,
      "score": 2,
      "context": [
        {
          "id": "kxy08rk",
          "author": "tisiphxne",
          "body": "debating begging my psychiatrist for adderall or ritalin (to help kill my appetite but they don’t need to know that 🤐)",
          "created_utc": 1712192118.0
        }
      ]
    },
    {
      "id": "ky634zg",
      "author": "pessimistic_witch",
      "body": "I did this and it backfired so hard, my Dr tried to send me to palliative care 😭",
      "created_utc": 1712324151.0,
      "score": 1,
      "context": [
        {
          "id": "ky253qy",
          "author": "Miss_paris_22",
          "body": "I couldn’t wait to turn 18 because then I couldn’t be forced to recover because I’m legally an adult and I could restrict to my heats desire since no one could do anything about it .",
          "created_utc": 1712258819.0
        }
      ]
    },
    {
      "id": "ky62wl3",
      "author": "pessimistic_witch",
      "body": "I’ve done a lot of research and it sounds like they do something if you stop eating completely but apparently they just let you do it because they assume it’s a protest and you’ll eventually give in bc you’re hungry and if you don’t they wait until it’s so bad that you need medical attention. I feel like I could away with it for a while tho-they don’t know the ed tricks like a treatment center does 👀",
      "created_utc": 1712324060.0,
      "score": 1,
      "context": [
        {
          "id": "ky4h0r0",
          "author": "Pink_Bread_76",
          "body": "I think they would care actually! I think if you don’t eat they punish you (at least what I see on tv)",
          "created_utc": 1712290216.0
        }
      ]
    },
    {
      "id": "kxy5428",
      "author": "grace--t",
      "body": "FR 💀",
      "created_utc": 1712194003.0,
      "score": 6,
      "context": [
        {
          "id": "kxtohfz",
          "author": "tartagliax",
          "body": "fantasizing about being kidnapped and abused and neglected for months so i would become emaciated",
          "created_utc": 1712131731.0
        },
        {
          "id": "kxuxmi1",
          "author": "LiminalDeer",
          "body": "I haven’t had a single original thought",
          "created_utc": 1712155154.0
        }
      ]
    },
    {
      "id": "kxv475v",
      "author": "sweetbaeunleashed",
      "body": "ugh I'm so sorry... there's a definite abnormal disconnect for me, from what my imagination thinks being hospitalized looks like and what it actually entails 🫤 I was absolutely horrified seeing my dad tubed for his ALS, so idfk why the horror feels so stagnant now. I have a 4 hour mental health evaluation on Friday that has been long overdue. Wish me luck 🫶🏼💓 sending all the strength and love to you all",
      "created_utc": 1712157391.0,
      "score": 14,
      "context": [
        {
          "id": "kxuaxa8",
          "author": "sweetbaeunleashed",
          "body": "*desiring* to reach hospital status because that means I *made it* 🥴 like tf.",
          "created_utc": 1712146070.0
        },
        {
          "id": "kxv0y5e",
          "author": "None",
          "body": "same and then i had to be force fed. not fun i'm tellin u",
          "created_utc": 1712156298.0
        }
      ]
    },
    {
      "id": "ky47ki5",
      "author": "LiminalDeer",
      "body": "Ugh so real. Im glad the thoughts are sparing atp tho :)",
      "created_utc": 1712285760.0,
      "score": 1,
      "context": [
        {
          "id": "kxuxsvi",
          "author": "LiminalDeer",
          "body": "“I should cut my hair, maybe I’ll weigh less” it was fleeting, cuz then I realized im dumb as shit. I also thought that touching something greasy would cause me to absorb calories through my skin. Yes I also have OCD why do you ask",
          "created_utc": 1712155216.0
        },
        {
          "id": "kxv0v34",
          "author": "Ok-Maximum2228",
          "body": "I thought lotion would make me absorb calories and gain weight same with chapstick. I still sometimes get these thoughts.",
          "created_utc": 1712156269.0
        }
      ]
    },
    {
      "id": "ky3ovo4",
      "author": "XxMrCoolGuyxX",
      "body": "I’m so sorry. That’s what I’m afraid of. That I’ll actually get what I want but I won’t be able to recover from my ED so I’ll just be suffering in two different extreme ways. I wish you all the best health <3",
      "created_utc": 1712278159.0,
      "score": 3,
      "context": [
        {
          "id": "kxvbri9",
          "author": "XxMrCoolGuyxX",
          "body": "For a while I started wishing I had cancer, I had a specific one I wanted too, so I could lose weight\n\nI know that cancer is a horrible disease, I have lost family to it, but the ED doesn’t care about that I guess",
          "created_utc": 1712159852.0
        },
        {
          "id": "ky36bw0",
          "author": "hellomate242",
          "body": "I had cancer, with an ED. When I was getting treatment and still now I would wish to go back to when I had it so I could be skinnier because even though I was in pain I still looked good. It’s weird because cancer is my worst nightmare and if I had to go through again idk what I would do but I feel like I’m more scared of gaining weight.",
          "created_utc": 1712271080.0
        }
      ]
    },
    {
      "id": "ky636xu",
      "author": "pessimistic_witch",
      "body": "And my whole team threatened to fire me (some of them did)",
      "created_utc": 1712324172.0,
      "score": 1,
      "context": [
        {
          "id": "ky253qy",
          "author": "Miss_paris_22",
          "body": "I couldn’t wait to turn 18 because then I couldn’t be forced to recover because I’m legally an adult and I could restrict to my heats desire since no one could do anything about it .",
          "created_utc": 1712258819.0
        },
        {
          "id": "ky634zg",
          "author": "pessimistic_witch",
          "body": "I did this and it backfired so hard, my Dr tried to send me to palliative care 😭",
          "created_utc": 1712324151.0
        }
      ]
    },
    {
      "id": "kxx1uud",
      "author": "Remarkable-Pirate214",
      "body": "I getchu. Don’t be too hard on yourself. Good luck loves x",
      "created_utc": 1712179682.0,
      "score": 6,
      "context": [
        {
          "id": "kxuaxa8",
          "author": "sweetbaeunleashed",
          "body": "*desiring* to reach hospital status because that means I *made it* 🥴 like tf.",
          "created_utc": 1712146070.0
        },
        {
          "id": "kxv0y5e",
          "author": "None",
          "body": "same and then i had to be force fed. not fun i'm tellin u",
          "created_utc": 1712156298.0
        },
        {
          "id": "kxv475v",
          "author": "sweetbaeunleashed",
          "body": "ugh I'm so sorry... there's a definite abnormal disconnect for me, from what my imagination thinks being hospitalized looks like and what it actually entails 🫤 I was absolutely horrified seeing my dad tubed for his ALS, so idfk why the horror feels so stagnant now. I have a 4 hour mental health evaluation on Friday that has been long overdue. Wish me luck 🫶🏼💓 sending all the strength and love to you all",
          "created_utc": 1712157391.0
        }
      ]
    },
    {
      "id": "ky6fcsd",
      "author": "hellomate242",
      "body": "Thanks, I wish the same to you!",
      "created_utc": 1712328506.0,
      "score": 2,
      "context": [
        {
          "id": "kxvbri9",
          "author": "XxMrCoolGuyxX",
          "body": "For a while I started wishing I had cancer, I had a specific one I wanted too, so I could lose weight\n\nI know that cancer is a horrible disease, I have lost family to it, but the ED doesn’t care about that I guess",
          "created_utc": 1712159852.0
        },
        {
          "id": "ky36bw0",
          "author": "hellomate242",
          "body": "I had cancer, with an ED. When I was getting treatment and still now I would wish to go back to when I had it so I could be skinnier because even though I was in pain I still looked good. It’s weird because cancer is my worst nightmare and if I had to go through again idk what I would do but I feel like I’m more scared of gaining weight.",
          "created_utc": 1712271080.0
        },
        {
          "id": "ky3ovo4",
          "author": "XxMrCoolGuyxX",
          "body": "I’m so sorry. That’s what I’m afraid of. That I’ll actually get what I want but I won’t be able to recover from my ED so I’ll just be suffering in two different extreme ways. I wish you all the best health <3",
          "created_utc": 1712278159.0
        }
      ]
    }
  ]
}