{
  "id": "1c45ipa",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1713131979.0,
  "title": "Does anyone else feel like their ed isn't valid ? ",
  "selftext": "I've had anorexia for over a year now, but I feel like it isn't valid and that im just faking it, because I've never been hospitalised, never lost my period, at my lowest weight rn but not underweight. Have a slight double chin. Dont exercise much either other than walking for hours. I look at other people's stories and i feel like a failure and a poser compared to them cuz i lose weight so slow even though im restricting almost everyday. \n\nDoes anyone else constantly feel like their ed just isn't valid? ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1c45ipa/does_anyone_else_feel_like_their_ed_isnt_valid/",
  "score": 159,
  "num_comments": 58,
  "comments": [
    {
      "id": "kzlf2b4",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1713131979.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kzlp1jx",
      "author": "AGoodKnave",
      "body": "Yup, you're not alone. We've all been fed (pardon the pun) the image of what an ED or anorexia 'should' look like that it stops us from getting help because we don't look the part. Worse yet, it pushes us even further TO look the part.",
      "created_utc": 1713135974.0,
      "score": 31,
      "context": []
    },
    {
      "id": "kzlko9c",
      "author": "thatwhichresembles",
      "body": "Absolutely. Honestly, I suspect most people with EDs feel this way at some point. It’s kind of characteristic of the disease.\n\nAll those things that we tell ourselves, about how “I’ll feel sick enough when [fill in the blank]?”\nOftentimes, even once we reach those arbitrary goals, it still doesn’t feel like enough. The goal posts are always shifting. That’s what’s so bonkers about EDs — from the outside, it can be painfully obvious that a person is sick and struggling, but they’ll still find ways to deny it.\n\nThere’s a term for this: anosognosia. It basically means “lack of insight into one’s condition,” and it’s common among people with EDs. It’s a real mindfuck.",
      "created_utc": 1713134189.0,
      "score": 20,
      "context": []
    },
    {
      "id": "kzlzk0p",
      "author": "Kangaroo_9904",
      "body": "I feel this way all the time. You aren’t faking it!! That crushing feeling of “it’s not enough” is the disorder. I’ve never been hospitalized or passed out. I eat everyday, especially a decent breakfast before work. Still disordered according to my primary, but the comparison makes me feel like eating anything at all invalidates the disorder. NOT true. \n\nAs for the tactless outlining of diagnoses in these comments, I will leave you with this insight: my disorder was the same with the thoughts but 10 times worse with actions when I was diagnosed with AAN than when I crossed the “threshold” into AN. That weight distinction is crap.",
      "created_utc": 1713140416.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kznqu75",
      "author": "AtmosphereNo7004",
      "body": "Even though I am quite underweight and have lost my period I still feel like I can’t have anorexia because I am able to eat candy and chips. Yes I heavily restrict at the same time, but I feel like I shouldn’t be able to eat those things if I actually had anorexia. I am also not scared of eating - I actually look forward to when I am finally allowed to eat something.",
      "created_utc": 1713176997.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kzm23fm",
      "author": "None",
      "body": "i feel like my ed is very invalid because it’s never been officially diagnosed and i have been binging a lot/eating fairly normally lately. i’m not underweight, i have a bit of a belly and don’t really exercise. i’ve never lost my period and never been hospitalized so yes i completely understand this. i feel like my ed is not valid",
      "created_utc": 1713141500.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kzmkwym",
      "author": "None",
      "body": "YES!! And my boyfriend doesn’t take my ED seriously either… it’s like I’m not skinny enough to have an ED in his mind… it hurts so much!!",
      "created_utc": 1713149849.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kzmremf",
      "author": "turnipkitty112",
      "body": "You’re absolutely not alone. The VAST majority of people with anorexia and other EDs feel like their illness isn’t valid. It’s kind of a hallmark symptom. Even people on their deathbed will still express this feeling - it will NEVER be enough.",
      "created_utc": 1713153056.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kzqd3qw",
      "author": "boopydoopy2102",
      "body": "i feel like ive lied to get diagnosed.  i know that makes no logical sense but i got out of hospital 3 years ago and ive not been as small as that since.  every single day i feel like i lose more control and its destroying me.  im sorry u dont feel valid, many of us dont.  as much as it feels like it u are not alone in these horrible feelings",
      "created_utc": 1713212697.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kzn2uc0",
      "author": "Agreeable-Pick-3650",
      "body": "Yes, I’ve been tempted to post before & after picture of my journey because I desire to be praised. But, when I look at my before picture I felt like I actually looked better but still not skinny enough. :(",
      "created_utc": 1713159656.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kzohnrq",
      "author": "Visual_Future3089",
      "body": "I feel like my ed isn't valid because while I'm shrinking (albeit slowly), my legs and my chest are still far too massive for my liking. It's so invalidating to be starving this much and still be too fat for my liking when I'm walking down the street.",
      "created_utc": 1713189830.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kznbsfp",
      "author": "Remarkable-Pirate214",
      "body": "Yup, I’m only just uw, suffering for over 3 years but never diagnosed or treated, and I don’t think I’ve really ever felt valid in this. Nothing is enough, the scale number, how little I eat, if other people tell me I lost weight etc nothing makes me feel like “damn, I do have AN.” It feels like I’m faking it/choosing it to be stupid.\n\nYou’re so valid hun. You’d be shocked to find out how many of us feel this way. Don’t let it add to the hell you’re already going through. But remember you have to choose to get better, it’s not up to anyone else it’s your life. I hope this helps x",
      "created_utc": 1713165786.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kznewuv",
      "author": "None",
      "body": "thing is; you'll always feel that way. i felt that way when i was forced to fed in the hospital. just don't listen to that feeling cuz it's rlly stupid and nothing ur ed brain is telling u is true.",
      "created_utc": 1713168142.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kznesxx",
      "author": "TrackConnect8709",
      "body": "YES, I feel like that feeling invalidad is one of the hardest things for recovery, but like everything is fucking hard so I don’t even know. \nI do think that those who have lost their period, been hospitalized, tubed and all that still feel valid, but they do feel some validation and therefore put it all over social media and so the rest of us see see that soo much online that it doesn’t make it easier for us and we feel just more invalid. Very shit!",
      "created_utc": 1713168060.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzo1n0n",
      "author": "elyu0000",
      "body": "Yes absolutely. I was hospitalized years ago during my previous relapse and back then I thought, okay, I'm finally sick enough to deserve help and start recovering. But now my ED makes me think that I still wasn't sick enough, because I was hospitalized due to lab and ECG abnormalities and not my weight.",
      "created_utc": 1713183050.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzosy4z",
      "author": "None",
      "body": "100%. Add a very blurred recovery (trying my best to heal but just can’t make it stick) means people talk about it to my face and then i feel way more invalid",
      "created_utc": 1713193878.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzp2uya",
      "author": "None",
      "body": "Yes. I personally follow a very strict diet of intermittent fasting. I use the 23:1 ratio with the exception of having a protein shake in the morning so I can take my medications. Because of this, and because I always consume around the same amount every day, I feel like it's not as bad as other peoples EDs.",
      "created_utc": 1713197224.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzp6was",
      "author": "None",
      "body": "I feel you 🫂 I keep losing and gaining back the same kgs, and I'm not even UW yet. But my hair is thinning, my hands are always cold, and I get dizzy when I stand up.",
      "created_utc": 1713198585.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzx6e2w",
      "author": "No_Pipe1952",
      "body": "i go through this sm. for me these thoughts even go as far as to say that i’m just “bad at it”. like i suck at my eating disorder because i think other people are better at restricting than me, or other people are smaller than me. idk. it creates a constant cycle. but you are definitely valid. 🫶🏻",
      "created_utc": 1713316823.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l01z980",
      "author": "PineapplePlant1234",
      "body": "I feel the exact same way. I count every calorie I eat, am always in at least 1000 deficit, am still considered over weight, and I lost 39 pounds but I still feel like I’m not actually anorexic. I’m not sure if I’m lying to myself or what.",
      "created_utc": 1713391195.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l08ajj5",
      "author": "FestivePlague",
      "body": "I absolutely don’t feel like mine is valid because I lost 110lbs but I’m not thin. I’m still overweight but I can’t get out of the mindset that I’m the best looking I’ve ever been. I lost the weight the worst way I could have, and coupled with having lupus, I’m playing a dangerous game with my health. I simply do not eat, and when I do, I restrict it heavily and it’s not even nutritionally sound. \n\nOf course, because I was once huge, my doctors believe the weight loss is a positive sign because I’m not using food as a crutch anymore. Even my psychiatrist didn’t seem bothered. I guess it doesn’t matter when you’re already fat.",
      "created_utc": 1713487553.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzotmjy",
      "author": "Sassy_-Babe",
      "body": "I have gotten told that before actually",
      "created_utc": 1713194112.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kzqjblk",
      "author": "catboylesbo",
      "body": "of course omfg imposter syndrome is real!! i’ve been dealing with this for 7 years now and still feel this way",
      "created_utc": 1713214780.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kzrilkt",
      "author": "existantcrab",
      "body": "totally. even when i was clinically underweight, had no period, felt like shit health wise, i still didn't feel valid enough. and now that i've lost those things, i feel even less valid. i don't know any anorexic that ever felt \"sick enough\".",
      "created_utc": 1713229233.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kzrpkgc",
      "author": "None",
      "body": "there is no such thing as an invalid eating disorder. that's the competitive nature of the disorder talking (which should validate you!). anorexia exists AT ALL SIZES. let me repeat: YOU DONT HAVE TO BE A CERTAIN WEIGHT TO BE ANOREXIC. you can still die/be hospitalized from anorexia complications at any weight.\n\nof herbs and altars on youtube has a comforting video on this topic (“Your Eating Disorder is Valid) if you have some time to kill: https://m.youtube.com/watch?v=LysCmLXCewU&pp=ygUmb2ZoZXJic2FuZGFsdGFycyBlYXRpbmcgZGlzb3JkZXIgdmFsaWQ%3D",
      "created_utc": 1713232022.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kzswwtz",
      "author": "coeurporcelaine",
      "body": "oh yea definitely, especially because i also struggle with lots n lots of binging so when i starve i feel like it isnt enough (and im also not progressing because i keep binging to ruin any possible progress, im stuck in a really terrible binge cycle since many many months)",
      "created_utc": 1713256693.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kzywv8e",
      "author": "Hokey1508",
      "body": "Yes I feel that every day and I feel like I am such an imposter - especially when I eat",
      "created_utc": 1713352225.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l08mxap",
      "author": "Separate-Branch8101",
      "body": "100% feel this, people keep telling me how thin and \"healthy\" I look now and (I know i shouldn't) but It feels like shit that I'm not even thin enough to make people worry abt why I'm thin. they just unknowingly congratulate me for being an incredibly malnourished midsized person.",
      "created_utc": 1713492855.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lrxjb1p",
      "author": "Present_Wealth1894",
      "body": "\nTW : I feel the same way my thing is that sense I haven’t been diagnose with an ED it makes me feel like I am doing this for attention and i know that I need help and I want it but a little part of me doesn’t want help or to get better it’s like I feel safe in a weird way knowing that I have some control in they way I eat or don’t  and senes I am not unweight it Just makes me feel crazy and it has been getting worse and my boyfriend has been trying to help me but it like I feel he is only going to see me as this thing who can’t eat “normal” I really don’t know what normal is though I have been trying to get better but every time I trying I just keep falling right back into the same cycle again and I know it’s getting bad because every time jt try and eat I throw up at the taste and the fact that I am full and it’s really embarrassing and it’s causing me really bad pain and saying this out loud is the first time I don’t really feel alone in this but I really don’t know what to do any more I just hope I can get better and stay better",
      "created_utc": 1728937058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ltaqqgt",
      "author": "PlanktonKey9623",
      "body": "I feel you. It seems like when i get underweight ill finally be sick enough yknow. But what really opened my eyes was “atypical anorexia nervosa” it is EXACTLY me and i feel better knowing im not fake because im not underweight",
      "created_utc": 1729661029.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1evhe8",
      "author": "JustAd39",
      "body": "i’ve never felt like it was valid, i’ve always felt like an attention seeker to the people around me. even though it wasn’t the case. i told myself i could just stop if i wanted to, and it was never that bad and i was just doing to because i craved an ed, and then i realised that i can’t look at food the same way i used to, and i can’t go a day without restricting, binging and repeating. it’s constantly on my mind",
      "created_utc": 1733861835.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1mc3gr",
      "author": "PenBeneficial8924",
      "body": "I am 110 lbs and a female (16) can somebody PLEASE tell me if this is a bad weight?! I'm 5'1 I dont have a ED (i think) but all i do is obsess about how much i eat i restrict then overeat and repeat, and then hate myself I used to be 100 lbs when i was smoking weed, and other thing when i was about 13-14 then after getting admitted into a mental hospital at 16 (earlier in january) i got out, and was still 100 lbs but then i started gaining weight SO rapidly. I am stuck at 110 HELP.",
      "created_utc": 1733965236.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m45jh97",
      "author": "St4rry_N1ghtm4r3",
      "body": "i often feel really invalid. im 5’2 and 115lbs which isnt overweight but its not low enough to be considered typical anorexia. i hate having the feeling that im not sick enough to need help hanging over my head. deep down i know i do need help, but no matter what i just feel like im not bad enough. ive been hospitalized, and have passed out countless times from not eating, but it feels like its not real until im underweight.",
      "created_utc": 1735364315.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m8zkw3m",
      "author": "BigFigure7271",
      "body": "This is the problem with ed. You dont feel valid until your dead. And it might make it worse. ",
      "created_utc": 1737755854.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kznf6t4",
      "author": "MrVelocoraptor",
      "body": "I think what you have is more like \"eating disorder behaviour,\" because anorexia does require a lower than normal BMI. Of course this doesn't lessen the severity of what's going on though. A label or diagnosis is only helpful in so far as it helps the person. I'm a guy and to admit I had anorexia is not helpful for me. I believe that it was eating disorder behaviour secondary to depression and the need for control, and body image issues, etc. But the point being that if what you are struggling with is affecting your health, it is an issue. Don't let anyone tell you you aren't struggling if you are. An official diagnosis may be different than what you think or expect but that doesn't change your worth or your need for help. Do try and find out what's at the root though. Wishing you all the love :)",
      "created_utc": 1713168356.0,
      "score": -2,
      "context": []
    },
    {
      "id": "kzrqqml",
      "author": "planetstardust",
      "body": "If anyone can reply to this comment that would be awesome. But my experience is when I'm tired I don't eat. It's not on purpose but I rather sleep or I'm too lazy to eat. I've never felt fat because I'm actually quite skinny. But I've gotten the questions on if I'm anorexic? My weight fluctuates depending on my mental health or memory to remind myself to eat. But my question is, has anyone dealt with this and been diagnosed? Am I in denial or just need better eating habits?\n\nSorry this is so unrelated to the post 🤦🏾‍♀️ but to answer that question I need advice haha",
      "created_utc": 1713232492.0,
      "score": 0,
      "context": []
    },
    {
      "id": "kzls6is",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1713137271.0,
      "score": -5,
      "context": []
    },
    {
      "id": "kznftmb",
      "author": "MrVelocoraptor",
      "body": "I mentioned this above but the weight thing is for an official diagnosis of AN. The diagnosis of AN matters medically but for an individual who is struggling, the struggle is what matters a whole lot more. I would classify anyone other than AN as having eating disorder behaviour or BN. It doesn't lessen their need and eating disorder behaviours can end up leading to AN but a normal or above normal BMI is not AN. On a personal note, when I looked in the mirror I really did see fat on my abdomen and my mom told me later on that friends were asking if I had cancer. This is really hard to type but it's the truth. That's the AN. And it's not any better or more special than ED behaviours or BN or anything else. Everyone's struggle is their own struggle period. And deserves recognition and help. But AN is a particular beast in that you actually think and believe that you are fat looking while others think you are about to die from being underweight. While I've increased weight, I still struggle with this every day, every hour, and still haven't gotten back to \"normal\" weight. Cheers",
      "created_utc": 1713168847.0,
      "score": -2,
      "context": [
        {
          "id": "kzlzk0p",
          "author": "Kangaroo_9904",
          "body": "I feel this way all the time. You aren’t faking it!! That crushing feeling of “it’s not enough” is the disorder. I’ve never been hospitalized or passed out. I eat everyday, especially a decent breakfast before work. Still disordered according to my primary, but the comparison makes me feel like eating anything at all invalidates the disorder. NOT true. \n\nAs for the tactless outlining of diagnoses in these comments, I will leave you with this insight: my disorder was the same with the thoughts but 10 times worse with actions when I was diagnosed with AAN than when I crossed the “threshold” into AN. That weight distinction is crap.",
          "created_utc": 1713140416.0
        }
      ]
    },
    {
      "id": "kzp4kpe",
      "author": "tinyteena888",
      "body": "Omg I’m the exact same",
      "created_utc": 1713197808.0,
      "score": 2,
      "context": [
        {
          "id": "kzm23fm",
          "author": "None",
          "body": "i feel like my ed is very invalid because it’s never been officially diagnosed and i have been binging a lot/eating fairly normally lately. i’m not underweight, i have a bit of a belly and don’t really exercise. i’ve never lost my period and never been hospitalized so yes i completely understand this. i feel like my ed is not valid",
          "created_utc": 1713141500.0
        }
      ]
    },
    {
      "id": "kznge31",
      "author": "MrVelocoraptor",
      "body": "I'll be honest, having AN or eating disorder behaviours for me meant that I denied it for a long time and honestly, still struggle with this, That's the hallmark, is the denial. And still losing weight (for AN). It took me a year to admit it to my counselor and I haven't admitted to anyone else, even when I heard that people thought I had cancer... This is just my own experience of course. But the diagnoses are to help medically treat AN or BN. Other psych issues should be treated appropriately as well. Someone who doesn't technically have AN or BN but has eating disorder behaviours +/- other mental health issues isn't less valid or less worthy of help if they are struggling. I feel like there's this culture of \"a skinny person suffering is more worthy than an overweight person who is suffering\" and this is total BS. And I'm so sad that this is the culture we live in. Everyone deserves love and help. Everyone. <3",
      "created_utc": 1713169285.0,
      "score": 2,
      "context": [
        {
          "id": "kzmremf",
          "author": "turnipkitty112",
          "body": "You’re absolutely not alone. The VAST majority of people with anorexia and other EDs feel like their illness isn’t valid. It’s kind of a hallmark symptom. Even people on their deathbed will still express this feeling - it will NEVER be enough.",
          "created_utc": 1713153056.0
        }
      ]
    },
    {
      "id": "kzqvtgd",
      "author": "TRKevinSpacey",
      "body": "Idk why youre being downvoted. Youre right and trying to be as supportive as possible. I hate it when people say they have ana when they are not underweight. Its a medical thing not just a label. Its very concerning that a lot of people on this sub arent actually anorexic and they make posts like this and everyone who wants the dX will come and give each other ass pats. And god forbid you tell them this or they get angy",
      "created_utc": 1713219208.0,
      "score": -4,
      "context": [
        {
          "id": "kznf6t4",
          "author": "MrVelocoraptor",
          "body": "I think what you have is more like \"eating disorder behaviour,\" because anorexia does require a lower than normal BMI. Of course this doesn't lessen the severity of what's going on though. A label or diagnosis is only helpful in so far as it helps the person. I'm a guy and to admit I had anorexia is not helpful for me. I believe that it was eating disorder behaviour secondary to depression and the need for control, and body image issues, etc. But the point being that if what you are struggling with is affecting your health, it is an issue. Don't let anyone tell you you aren't struggling if you are. An official diagnosis may be different than what you think or expect but that doesn't change your worth or your need for help. Do try and find out what's at the root though. Wishing you all the love :)",
          "created_utc": 1713168356.0
        }
      ]
    },
    {
      "id": "kzmfoml",
      "author": "smohno",
      "body": "Not in the DSM5. It changed between IV and 5 - the weight requirement was removed",
      "created_utc": 1713147463.0,
      "score": 3,
      "context": [
        {
          "id": "kzls6is",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1713137271.0
        }
      ]
    },
    {
      "id": "kzmul7j",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 14: spreading misinformation is disallowed. \n\nMisinformation runs rampant in mental health communities and we are not the exception. In an effort to stop the spread, this rule has been implemented: Users are encouraged to add sources to their posts and comments if they include little-known facts or any statistics. Adding these sources not only adds proof to what you are saying, but also encourages others to do research on their own about the topic. \n\nHowever, spreading blatant misinformation or dirty data isn't allowed here. We strive to remain factual and truthful, which this rule is meant to encourage and reinforce. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1713154768.0,
      "score": 1,
      "context": [
        {
          "id": "kzls6is",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1713137271.0
        }
      ]
    },
    {
      "id": "kznwl84",
      "author": "Kangaroo_9904",
      "body": "I understand that you’re trying to be factual but your comments were a bit insensitive and presumptuous.  You don’t really have the power to diagnose and debate someone else’s disorder. This person is expressing some difficult struggles with feeling not sick enough (a COMMON symptom of an eating disorder) and it comes across as you kind of supporting that distortion because of their weight. That’s not helpful and can be really damaging.\n\nI have been diagnosed with AAN in treatment and then a year later AN by my doctor.  Both are restrictive eating disorders. Not bulimia or “behavior.” They felt the exact same mentally and honestly I felt physically sicker when I was bigger.  OP may also have a diagnosis (including AN — I got the diagnosis at one point without being underweight!)\n\nI am aware of the body dysmorphia?  I’m sorry for that interaction. I’m confused why it was emphasized so much when people with restrictive eating disorders often experience body dysmorphia.  Are you saying yours was worse because somebody thought you had cancer??\n\nI appreciate that you are trying to engage in the conversation and provide reference points, and the times you stated the worthiness of help, but I don’t think this was the post to get into this. Sorry OP :(",
      "created_utc": 1713180467.0,
      "score": 11,
      "context": [
        {
          "id": "kzlzk0p",
          "author": "Kangaroo_9904",
          "body": "I feel this way all the time. You aren’t faking it!! That crushing feeling of “it’s not enough” is the disorder. I’ve never been hospitalized or passed out. I eat everyday, especially a decent breakfast before work. Still disordered according to my primary, but the comparison makes me feel like eating anything at all invalidates the disorder. NOT true. \n\nAs for the tactless outlining of diagnoses in these comments, I will leave you with this insight: my disorder was the same with the thoughts but 10 times worse with actions when I was diagnosed with AAN than when I crossed the “threshold” into AN. That weight distinction is crap.",
          "created_utc": 1713140416.0
        },
        {
          "id": "kznftmb",
          "author": "MrVelocoraptor",
          "body": "I mentioned this above but the weight thing is for an official diagnosis of AN. The diagnosis of AN matters medically but for an individual who is struggling, the struggle is what matters a whole lot more. I would classify anyone other than AN as having eating disorder behaviour or BN. It doesn't lessen their need and eating disorder behaviours can end up leading to AN but a normal or above normal BMI is not AN. On a personal note, when I looked in the mirror I really did see fat on my abdomen and my mom told me later on that friends were asking if I had cancer. This is really hard to type but it's the truth. That's the AN. And it's not any better or more special than ED behaviours or BN or anything else. Everyone's struggle is their own struggle period. And deserves recognition and help. But AN is a particular beast in that you actually think and believe that you are fat looking while others think you are about to die from being underweight. While I've increased weight, I still struggle with this every day, every hour, and still haven't gotten back to \"normal\" weight. Cheers",
          "created_utc": 1713168847.0
        }
      ]
    },
    {
      "id": "mdfqtbu",
      "author": "thestonedjellyfish",
      "body": "I know this is old but as someone currently in school soon to graduate, I can, in fact, diagnose someone with AN regardless of their BMI. It is no longer on the DSM (since 2022 I believe) that they must be underweight to meet criteria for AN. It was damaging to individuals who were never underweight but still had AN and needed help.",
      "created_utc": 1739890461.0,
      "score": 1,
      "context": [
        {
          "id": "kzlzk0p",
          "author": "Kangaroo_9904",
          "body": "I feel this way all the time. You aren’t faking it!! That crushing feeling of “it’s not enough” is the disorder. I’ve never been hospitalized or passed out. I eat everyday, especially a decent breakfast before work. Still disordered according to my primary, but the comparison makes me feel like eating anything at all invalidates the disorder. NOT true. \n\nAs for the tactless outlining of diagnoses in these comments, I will leave you with this insight: my disorder was the same with the thoughts but 10 times worse with actions when I was diagnosed with AAN than when I crossed the “threshold” into AN. That weight distinction is crap.",
          "created_utc": 1713140416.0
        },
        {
          "id": "kznftmb",
          "author": "MrVelocoraptor",
          "body": "I mentioned this above but the weight thing is for an official diagnosis of AN. The diagnosis of AN matters medically but for an individual who is struggling, the struggle is what matters a whole lot more. I would classify anyone other than AN as having eating disorder behaviour or BN. It doesn't lessen their need and eating disorder behaviours can end up leading to AN but a normal or above normal BMI is not AN. On a personal note, when I looked in the mirror I really did see fat on my abdomen and my mom told me later on that friends were asking if I had cancer. This is really hard to type but it's the truth. That's the AN. And it's not any better or more special than ED behaviours or BN or anything else. Everyone's struggle is their own struggle period. And deserves recognition and help. But AN is a particular beast in that you actually think and believe that you are fat looking while others think you are about to die from being underweight. While I've increased weight, I still struggle with this every day, every hour, and still haven't gotten back to \"normal\" weight. Cheers",
          "created_utc": 1713168847.0
        }
      ]
    },
    {
      "id": "kzoefxq",
      "author": "turnipkitty112",
      "body": "Totally agree! Well said",
      "created_utc": 1713188583.0,
      "score": 3,
      "context": [
        {
          "id": "kzmremf",
          "author": "turnipkitty112",
          "body": "You’re absolutely not alone. The VAST majority of people with anorexia and other EDs feel like their illness isn’t valid. It’s kind of a hallmark symptom. Even people on their deathbed will still express this feeling - it will NEVER be enough.",
          "created_utc": 1713153056.0
        },
        {
          "id": "kznge31",
          "author": "MrVelocoraptor",
          "body": "I'll be honest, having AN or eating disorder behaviours for me meant that I denied it for a long time and honestly, still struggle with this, That's the hallmark, is the denial. And still losing weight (for AN). It took me a year to admit it to my counselor and I haven't admitted to anyone else, even when I heard that people thought I had cancer... This is just my own experience of course. But the diagnoses are to help medically treat AN or BN. Other psych issues should be treated appropriately as well. Someone who doesn't technically have AN or BN but has eating disorder behaviours +/- other mental health issues isn't less valid or less worthy of help if they are struggling. I feel like there's this culture of \"a skinny person suffering is more worthy than an overweight person who is suffering\" and this is total BS. And I'm so sad that this is the culture we live in. Everyone deserves love and help. Everyone. <3",
          "created_utc": 1713169285.0
        }
      ]
    },
    {
      "id": "kzogy84",
      "author": "Visual_Future3089",
      "body": "I'm going to challenge this and say that the denial sometimes stems from not wanting others to have a tainted perception of you. It's also a way to perpetuate behaviours. Not everyone *wants* to boast about how sick they are and act like they *want* feeding tubes or to be hospitalized. Most of us *enjoy* our disorder. That's part of the shock value, when someone is sick and underweight and their brains *like* it enough to continue to deny food. \n\nWhen I was underweight, I was suffering from undiagnosed and untreated epilepsy, which was honestly the main cause for wanting to recover and feeling like I even needed to be hospitalized at all. It had quite literally very little to do with my weight, my 'look', or my eating disorder behaviours.",
      "created_utc": 1713189556.0,
      "score": 1,
      "context": [
        {
          "id": "kzmremf",
          "author": "turnipkitty112",
          "body": "You’re absolutely not alone. The VAST majority of people with anorexia and other EDs feel like their illness isn’t valid. It’s kind of a hallmark symptom. Even people on their deathbed will still express this feeling - it will NEVER be enough.",
          "created_utc": 1713153056.0
        },
        {
          "id": "kznge31",
          "author": "MrVelocoraptor",
          "body": "I'll be honest, having AN or eating disorder behaviours for me meant that I denied it for a long time and honestly, still struggle with this, That's the hallmark, is the denial. And still losing weight (for AN). It took me a year to admit it to my counselor and I haven't admitted to anyone else, even when I heard that people thought I had cancer... This is just my own experience of course. But the diagnoses are to help medically treat AN or BN. Other psych issues should be treated appropriately as well. Someone who doesn't technically have AN or BN but has eating disorder behaviours +/- other mental health issues isn't less valid or less worthy of help if they are struggling. I feel like there's this culture of \"a skinny person suffering is more worthy than an overweight person who is suffering\" and this is total BS. And I'm so sad that this is the culture we live in. Everyone deserves love and help. Everyone. <3",
          "created_utc": 1713169285.0
        }
      ]
    },
    {
      "id": "kzsnl6r",
      "author": "MrVelocoraptor",
      "body": "Because our society is too woke, honestly. People want to feel validated and our culture allows and encourages people to believe they have handicaps or weaknesses and cancels those who point out the truth. I have been close to being hospitalized from bneing underweight and I THOUGHT I WAS HEALTHY AF... Anyone who thimks they have what I have but have never been underweight can honestly go \\_\\_\\_ themselves because it's so disrespectful to me AND it isn't helping you with whatever you're struggling with, W/e if you want to be a black person but you're white because you want to be a victim, go ahead, you want to be disabled, go ahead, w/e I'm done with this s\\*\\*\\*, just know that while you downvote me, there are those of us who literally see an underweight number and look at ourselves and SEE F\\*\\*\\*ING FAT!! I AM F\\*\\*\\*ING FAT even though I am underweight.. I could DIE and I think I am going insane but sure, you have what I have, w/e I don't give AF anymore, have fun with your echo chamber subreddit",
      "created_utc": 1713249771.0,
      "score": 1,
      "context": [
        {
          "id": "kznf6t4",
          "author": "MrVelocoraptor",
          "body": "I think what you have is more like \"eating disorder behaviour,\" because anorexia does require a lower than normal BMI. Of course this doesn't lessen the severity of what's going on though. A label or diagnosis is only helpful in so far as it helps the person. I'm a guy and to admit I had anorexia is not helpful for me. I believe that it was eating disorder behaviour secondary to depression and the need for control, and body image issues, etc. But the point being that if what you are struggling with is affecting your health, it is an issue. Don't let anyone tell you you aren't struggling if you are. An official diagnosis may be different than what you think or expect but that doesn't change your worth or your need for help. Do try and find out what's at the root though. Wishing you all the love :)",
          "created_utc": 1713168356.0
        },
        {
          "id": "kzqvtgd",
          "author": "TRKevinSpacey",
          "body": "Idk why youre being downvoted. Youre right and trying to be as supportive as possible. I hate it when people say they have ana when they are not underweight. Its a medical thing not just a label. Its very concerning that a lot of people on this sub arent actually anorexic and they make posts like this and everyone who wants the dX will come and give each other ass pats. And god forbid you tell them this or they get angy",
          "created_utc": 1713219208.0
        }
      ]
    },
    {
      "id": "kznh18m",
      "author": "MrVelocoraptor",
      "body": "DSM 5 AN: \"Restriction of energy intake relative to requirements, leading to a significant low body weight in the context of the age, sex, developmental trajectory, and physical health (less than minimally normal/expected1)\" \n\nI don't post this to be offensive or anything. It's because it matters for medical treatment of AN. If someone doesn't have AN but they are struggling, they still need help and are just as worthy of help, but the help needed is different. We do need to properly diagnose people so they can get the help that they personally need. I don't like this \"I need help for an eating disorder\" when they don't have an eating disorder. It may be eating disorder behaviours but it's not an eating disorder. The ED is when you look in the mirror and see fat but your mom tells you that others think you have cancer and you argue with her because you feel great and just need to get out to go for a long bikeride and only have a banana and return to fight with your parents about being admitted to the hospital because they think you're dying and you think they are crazy. I'm sorry but that is AN. And I'm still suffering and struggling with it and it deserves to be diagnosed properly for those who need it. Sorry if I was rude...",
      "created_utc": 1713169782.0,
      "score": 1,
      "context": [
        {
          "id": "kzls6is",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1713137271.0
        },
        {
          "id": "kzmfoml",
          "author": "smohno",
          "body": "Not in the DSM5. It changed between IV and 5 - the weight requirement was removed",
          "created_utc": 1713147463.0
        }
      ]
    },
    {
      "id": "kzofyvh",
      "author": "Visual_Future3089",
      "body": "I completely agree. I'm also mentally worse when I'm bigger than I want to be......I'm so tired of the BDD trope..... No, we don't literally see a fat person in the mirror when we're underweight. Of course there is *some* distortion, that is perfectly normal. When I was underweight, I saw skinny in the mirror. I just didn't see an image that was *skinny enough,* especially if I was gaining unwanted weight or retaining water....\n\nAlso, a cancerous look is completely different than an anorexic one, unless you're maybe like in your 40s, with an extremely low BMI...... I'm sure nobody asked if they had cancer. What a ridiculous statement. People may think and know you look sick, but cancer? Come on. That's a bit excessive, especially from friends in proximity.",
      "created_utc": 1713189183.0,
      "score": 5,
      "context": [
        {
          "id": "kzlzk0p",
          "author": "Kangaroo_9904",
          "body": "I feel this way all the time. You aren’t faking it!! That crushing feeling of “it’s not enough” is the disorder. I’ve never been hospitalized or passed out. I eat everyday, especially a decent breakfast before work. Still disordered according to my primary, but the comparison makes me feel like eating anything at all invalidates the disorder. NOT true. \n\nAs for the tactless outlining of diagnoses in these comments, I will leave you with this insight: my disorder was the same with the thoughts but 10 times worse with actions when I was diagnosed with AAN than when I crossed the “threshold” into AN. That weight distinction is crap.",
          "created_utc": 1713140416.0
        },
        {
          "id": "kznftmb",
          "author": "MrVelocoraptor",
          "body": "I mentioned this above but the weight thing is for an official diagnosis of AN. The diagnosis of AN matters medically but for an individual who is struggling, the struggle is what matters a whole lot more. I would classify anyone other than AN as having eating disorder behaviour or BN. It doesn't lessen their need and eating disorder behaviours can end up leading to AN but a normal or above normal BMI is not AN. On a personal note, when I looked in the mirror I really did see fat on my abdomen and my mom told me later on that friends were asking if I had cancer. This is really hard to type but it's the truth. That's the AN. And it's not any better or more special than ED behaviours or BN or anything else. Everyone's struggle is their own struggle period. And deserves recognition and help. But AN is a particular beast in that you actually think and believe that you are fat looking while others think you are about to die from being underweight. While I've increased weight, I still struggle with this every day, every hour, and still haven't gotten back to \"normal\" weight. Cheers",
          "created_utc": 1713168847.0
        },
        {
          "id": "kznwl84",
          "author": "Kangaroo_9904",
          "body": "I understand that you’re trying to be factual but your comments were a bit insensitive and presumptuous.  You don’t really have the power to diagnose and debate someone else’s disorder. This person is expressing some difficult struggles with feeling not sick enough (a COMMON symptom of an eating disorder) and it comes across as you kind of supporting that distortion because of their weight. That’s not helpful and can be really damaging.\n\nI have been diagnosed with AAN in treatment and then a year later AN by my doctor.  Both are restrictive eating disorders. Not bulimia or “behavior.” They felt the exact same mentally and honestly I felt physically sicker when I was bigger.  OP may also have a diagnosis (including AN — I got the diagnosis at one point without being underweight!)\n\nI am aware of the body dysmorphia?  I’m sorry for that interaction. I’m confused why it was emphasized so much when people with restrictive eating disorders often experience body dysmorphia.  Are you saying yours was worse because somebody thought you had cancer??\n\nI appreciate that you are trying to engage in the conversation and provide reference points, and the times you stated the worthiness of help, but I don’t think this was the post to get into this. Sorry OP :(",
          "created_utc": 1713180467.0
        }
      ]
    },
    {
      "id": "kzsohxq",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1713250403.0,
      "score": 0,
      "context": [
        {
          "id": "kzlzk0p",
          "author": "Kangaroo_9904",
          "body": "I feel this way all the time. You aren’t faking it!! That crushing feeling of “it’s not enough” is the disorder. I’ve never been hospitalized or passed out. I eat everyday, especially a decent breakfast before work. Still disordered according to my primary, but the comparison makes me feel like eating anything at all invalidates the disorder. NOT true. \n\nAs for the tactless outlining of diagnoses in these comments, I will leave you with this insight: my disorder was the same with the thoughts but 10 times worse with actions when I was diagnosed with AAN than when I crossed the “threshold” into AN. That weight distinction is crap.",
          "created_utc": 1713140416.0
        },
        {
          "id": "kznftmb",
          "author": "MrVelocoraptor",
          "body": "I mentioned this above but the weight thing is for an official diagnosis of AN. The diagnosis of AN matters medically but for an individual who is struggling, the struggle is what matters a whole lot more. I would classify anyone other than AN as having eating disorder behaviour or BN. It doesn't lessen their need and eating disorder behaviours can end up leading to AN but a normal or above normal BMI is not AN. On a personal note, when I looked in the mirror I really did see fat on my abdomen and my mom told me later on that friends were asking if I had cancer. This is really hard to type but it's the truth. That's the AN. And it's not any better or more special than ED behaviours or BN or anything else. Everyone's struggle is their own struggle period. And deserves recognition and help. But AN is a particular beast in that you actually think and believe that you are fat looking while others think you are about to die from being underweight. While I've increased weight, I still struggle with this every day, every hour, and still haven't gotten back to \"normal\" weight. Cheers",
          "created_utc": 1713168847.0
        },
        {
          "id": "kznwl84",
          "author": "Kangaroo_9904",
          "body": "I understand that you’re trying to be factual but your comments were a bit insensitive and presumptuous.  You don’t really have the power to diagnose and debate someone else’s disorder. This person is expressing some difficult struggles with feeling not sick enough (a COMMON symptom of an eating disorder) and it comes across as you kind of supporting that distortion because of their weight. That’s not helpful and can be really damaging.\n\nI have been diagnosed with AAN in treatment and then a year later AN by my doctor.  Both are restrictive eating disorders. Not bulimia or “behavior.” They felt the exact same mentally and honestly I felt physically sicker when I was bigger.  OP may also have a diagnosis (including AN — I got the diagnosis at one point without being underweight!)\n\nI am aware of the body dysmorphia?  I’m sorry for that interaction. I’m confused why it was emphasized so much when people with restrictive eating disorders often experience body dysmorphia.  Are you saying yours was worse because somebody thought you had cancer??\n\nI appreciate that you are trying to engage in the conversation and provide reference points, and the times you stated the worthiness of help, but I don’t think this was the post to get into this. Sorry OP :(",
          "created_utc": 1713180467.0
        }
      ]
    },
    {
      "id": "mdhwfmr",
      "author": "MrVelocoraptor",
      "body": "That's fair and since my post I've learned about the change in diagnosis, I believe it's called atypical anorexia, as well as realizing my insensitivity and rudeness back then. I was frustrated by feeling like a lot of people were claiming to be anorexic while normal/overweight and I felt like I was being crowded out by people who didn't understand how horrible it is to be very underweight and unable to stop losing weight and the terrible nightmare after you have a wakeup call and are fighting a horrible mental and physical battle trying to recover your weight, something I'm still trying to do. I didn't know how to respectfully share my feelings about that and I probably still don't but I think I'm improving, anyways, cheers :)",
      "created_utc": 1739912331.0,
      "score": 1,
      "context": [
        {
          "id": "kzlzk0p",
          "author": "Kangaroo_9904",
          "body": "I feel this way all the time. You aren’t faking it!! That crushing feeling of “it’s not enough” is the disorder. I’ve never been hospitalized or passed out. I eat everyday, especially a decent breakfast before work. Still disordered according to my primary, but the comparison makes me feel like eating anything at all invalidates the disorder. NOT true. \n\nAs for the tactless outlining of diagnoses in these comments, I will leave you with this insight: my disorder was the same with the thoughts but 10 times worse with actions when I was diagnosed with AAN than when I crossed the “threshold” into AN. That weight distinction is crap.",
          "created_utc": 1713140416.0
        },
        {
          "id": "kznftmb",
          "author": "MrVelocoraptor",
          "body": "I mentioned this above but the weight thing is for an official diagnosis of AN. The diagnosis of AN matters medically but for an individual who is struggling, the struggle is what matters a whole lot more. I would classify anyone other than AN as having eating disorder behaviour or BN. It doesn't lessen their need and eating disorder behaviours can end up leading to AN but a normal or above normal BMI is not AN. On a personal note, when I looked in the mirror I really did see fat on my abdomen and my mom told me later on that friends were asking if I had cancer. This is really hard to type but it's the truth. That's the AN. And it's not any better or more special than ED behaviours or BN or anything else. Everyone's struggle is their own struggle period. And deserves recognition and help. But AN is a particular beast in that you actually think and believe that you are fat looking while others think you are about to die from being underweight. While I've increased weight, I still struggle with this every day, every hour, and still haven't gotten back to \"normal\" weight. Cheers",
          "created_utc": 1713168847.0
        },
        {
          "id": "mdfqtbu",
          "author": "thestonedjellyfish",
          "body": "I know this is old but as someone currently in school soon to graduate, I can, in fact, diagnose someone with AN regardless of their BMI. It is no longer on the DSM (since 2022 I believe) that they must be underweight to meet criteria for AN. It was damaging to individuals who were never underweight but still had AN and needed help.",
          "created_utc": 1739890461.0
        }
      ]
    },
    {
      "id": "kzso2cs",
      "author": "MrVelocoraptor",
      "body": "No I'm sorry but that's not the disorder. You don't enjoy BEING SICK, if you truly have AN, you enjoy BEING SKINNY and underweight. I literally thought I WAS HEALTHY when others thought I was dying. I don't know why I have to explain the truth and have people \"feel\" differently and so they are right. Go get f\\*\\*\\*ing diagnosed and then come speak with me. W/e",
      "created_utc": 1713250102.0,
      "score": -2,
      "context": [
        {
          "id": "kzmremf",
          "author": "turnipkitty112",
          "body": "You’re absolutely not alone. The VAST majority of people with anorexia and other EDs feel like their illness isn’t valid. It’s kind of a hallmark symptom. Even people on their deathbed will still express this feeling - it will NEVER be enough.",
          "created_utc": 1713153056.0
        },
        {
          "id": "kznge31",
          "author": "MrVelocoraptor",
          "body": "I'll be honest, having AN or eating disorder behaviours for me meant that I denied it for a long time and honestly, still struggle with this, That's the hallmark, is the denial. And still losing weight (for AN). It took me a year to admit it to my counselor and I haven't admitted to anyone else, even when I heard that people thought I had cancer... This is just my own experience of course. But the diagnoses are to help medically treat AN or BN. Other psych issues should be treated appropriately as well. Someone who doesn't technically have AN or BN but has eating disorder behaviours +/- other mental health issues isn't less valid or less worthy of help if they are struggling. I feel like there's this culture of \"a skinny person suffering is more worthy than an overweight person who is suffering\" and this is total BS. And I'm so sad that this is the culture we live in. Everyone deserves love and help. Everyone. <3",
          "created_utc": 1713169285.0
        },
        {
          "id": "kzogy84",
          "author": "Visual_Future3089",
          "body": "I'm going to challenge this and say that the denial sometimes stems from not wanting others to have a tainted perception of you. It's also a way to perpetuate behaviours. Not everyone *wants* to boast about how sick they are and act like they *want* feeding tubes or to be hospitalized. Most of us *enjoy* our disorder. That's part of the shock value, when someone is sick and underweight and their brains *like* it enough to continue to deny food. \n\nWhen I was underweight, I was suffering from undiagnosed and untreated epilepsy, which was honestly the main cause for wanting to recover and feeling like I even needed to be hospitalized at all. It had quite literally very little to do with my weight, my 'look', or my eating disorder behaviours.",
          "created_utc": 1713189556.0
        }
      ]
    },
    {
      "id": "kzo5bnb",
      "author": "choccycatmilk",
      "body": "Looking in the mirror and seeing fat even though you are thin is not anorexia lmao that’s body dysmorphia. It’s part of anorexia but not at all exclusive to it. I have it too, even diagnosed as well as bulimia nervosa. \nThere is also the diagnosis of Atypical Anorexia Nervosa where the symptoms are EXACTLY the same, just not underweight. \nAre you aware of people starting at different weights? I was morbidly obese a year ago and my therapist now warned me about becoming anorexic bc I’m moving closer to underweight and have lost my period. Crossing that bmi category is going to change my diagnosis even tho my behaviors have been the same for almost 2 years.",
      "created_utc": 1713184772.0,
      "score": 3,
      "context": [
        {
          "id": "kzls6is",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1713137271.0
        },
        {
          "id": "kzmfoml",
          "author": "smohno",
          "body": "Not in the DSM5. It changed between IV and 5 - the weight requirement was removed",
          "created_utc": 1713147463.0
        },
        {
          "id": "kznh18m",
          "author": "MrVelocoraptor",
          "body": "DSM 5 AN: \"Restriction of energy intake relative to requirements, leading to a significant low body weight in the context of the age, sex, developmental trajectory, and physical health (less than minimally normal/expected1)\" \n\nI don't post this to be offensive or anything. It's because it matters for medical treatment of AN. If someone doesn't have AN but they are struggling, they still need help and are just as worthy of help, but the help needed is different. We do need to properly diagnose people so they can get the help that they personally need. I don't like this \"I need help for an eating disorder\" when they don't have an eating disorder. It may be eating disorder behaviours but it's not an eating disorder. The ED is when you look in the mirror and see fat but your mom tells you that others think you have cancer and you argue with her because you feel great and just need to get out to go for a long bikeride and only have a banana and return to fight with your parents about being admitted to the hospital because they think you're dying and you think they are crazy. I'm sorry but that is AN. And I'm still suffering and struggling with it and it deserves to be diagnosed properly for those who need it. Sorry if I was rude...",
          "created_utc": 1713169782.0
        }
      ]
    },
    {
      "id": "kzt8d3n",
      "author": "Kangaroo_9904",
      "body": "how dare you claim someone doesn’t have something when you don’t know their experience??? and to contradict legitimate diagnoses that were given?? you literally are assuming people haven’t suffered. this is wildly rude lmao I promise other people having life-threatening eating disorders without being underweight *gasp* doesn’t take away any of your experience",
      "created_utc": 1713264771.0,
      "score": 4,
      "context": [
        {
          "id": "kzlzk0p",
          "author": "Kangaroo_9904",
          "body": "I feel this way all the time. You aren’t faking it!! That crushing feeling of “it’s not enough” is the disorder. I’ve never been hospitalized or passed out. I eat everyday, especially a decent breakfast before work. Still disordered according to my primary, but the comparison makes me feel like eating anything at all invalidates the disorder. NOT true. \n\nAs for the tactless outlining of diagnoses in these comments, I will leave you with this insight: my disorder was the same with the thoughts but 10 times worse with actions when I was diagnosed with AAN than when I crossed the “threshold” into AN. That weight distinction is crap.",
          "created_utc": 1713140416.0
        },
        {
          "id": "kznftmb",
          "author": "MrVelocoraptor",
          "body": "I mentioned this above but the weight thing is for an official diagnosis of AN. The diagnosis of AN matters medically but for an individual who is struggling, the struggle is what matters a whole lot more. I would classify anyone other than AN as having eating disorder behaviour or BN. It doesn't lessen their need and eating disorder behaviours can end up leading to AN but a normal or above normal BMI is not AN. On a personal note, when I looked in the mirror I really did see fat on my abdomen and my mom told me later on that friends were asking if I had cancer. This is really hard to type but it's the truth. That's the AN. And it's not any better or more special than ED behaviours or BN or anything else. Everyone's struggle is their own struggle period. And deserves recognition and help. But AN is a particular beast in that you actually think and believe that you are fat looking while others think you are about to die from being underweight. While I've increased weight, I still struggle with this every day, every hour, and still haven't gotten back to \"normal\" weight. Cheers",
          "created_utc": 1713168847.0
        },
        {
          "id": "kznwl84",
          "author": "Kangaroo_9904",
          "body": "I understand that you’re trying to be factual but your comments were a bit insensitive and presumptuous.  You don’t really have the power to diagnose and debate someone else’s disorder. This person is expressing some difficult struggles with feeling not sick enough (a COMMON symptom of an eating disorder) and it comes across as you kind of supporting that distortion because of their weight. That’s not helpful and can be really damaging.\n\nI have been diagnosed with AAN in treatment and then a year later AN by my doctor.  Both are restrictive eating disorders. Not bulimia or “behavior.” They felt the exact same mentally and honestly I felt physically sicker when I was bigger.  OP may also have a diagnosis (including AN — I got the diagnosis at one point without being underweight!)\n\nI am aware of the body dysmorphia?  I’m sorry for that interaction. I’m confused why it was emphasized so much when people with restrictive eating disorders often experience body dysmorphia.  Are you saying yours was worse because somebody thought you had cancer??\n\nI appreciate that you are trying to engage in the conversation and provide reference points, and the times you stated the worthiness of help, but I don’t think this was the post to get into this. Sorry OP :(",
          "created_utc": 1713180467.0
        },
        {
          "id": "kzsohxq",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1713250403.0
        }
      ]
    },
    {
      "id": "kztb4wp",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1713266356.0,
      "score": 1,
      "context": [
        {
          "id": "kzlzk0p",
          "author": "Kangaroo_9904",
          "body": "I feel this way all the time. You aren’t faking it!! That crushing feeling of “it’s not enough” is the disorder. I’ve never been hospitalized or passed out. I eat everyday, especially a decent breakfast before work. Still disordered according to my primary, but the comparison makes me feel like eating anything at all invalidates the disorder. NOT true. \n\nAs for the tactless outlining of diagnoses in these comments, I will leave you with this insight: my disorder was the same with the thoughts but 10 times worse with actions when I was diagnosed with AAN than when I crossed the “threshold” into AN. That weight distinction is crap.",
          "created_utc": 1713140416.0
        },
        {
          "id": "kznftmb",
          "author": "MrVelocoraptor",
          "body": "I mentioned this above but the weight thing is for an official diagnosis of AN. The diagnosis of AN matters medically but for an individual who is struggling, the struggle is what matters a whole lot more. I would classify anyone other than AN as having eating disorder behaviour or BN. It doesn't lessen their need and eating disorder behaviours can end up leading to AN but a normal or above normal BMI is not AN. On a personal note, when I looked in the mirror I really did see fat on my abdomen and my mom told me later on that friends were asking if I had cancer. This is really hard to type but it's the truth. That's the AN. And it's not any better or more special than ED behaviours or BN or anything else. Everyone's struggle is their own struggle period. And deserves recognition and help. But AN is a particular beast in that you actually think and believe that you are fat looking while others think you are about to die from being underweight. While I've increased weight, I still struggle with this every day, every hour, and still haven't gotten back to \"normal\" weight. Cheers",
          "created_utc": 1713168847.0
        },
        {
          "id": "kznwl84",
          "author": "Kangaroo_9904",
          "body": "I understand that you’re trying to be factual but your comments were a bit insensitive and presumptuous.  You don’t really have the power to diagnose and debate someone else’s disorder. This person is expressing some difficult struggles with feeling not sick enough (a COMMON symptom of an eating disorder) and it comes across as you kind of supporting that distortion because of their weight. That’s not helpful and can be really damaging.\n\nI have been diagnosed with AAN in treatment and then a year later AN by my doctor.  Both are restrictive eating disorders. Not bulimia or “behavior.” They felt the exact same mentally and honestly I felt physically sicker when I was bigger.  OP may also have a diagnosis (including AN — I got the diagnosis at one point without being underweight!)\n\nI am aware of the body dysmorphia?  I’m sorry for that interaction. I’m confused why it was emphasized so much when people with restrictive eating disorders often experience body dysmorphia.  Are you saying yours was worse because somebody thought you had cancer??\n\nI appreciate that you are trying to engage in the conversation and provide reference points, and the times you stated the worthiness of help, but I don’t think this was the post to get into this. Sorry OP :(",
          "created_utc": 1713180467.0
        },
        {
          "id": "kzsohxq",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1713250403.0
        }
      ]
    },
    {
      "id": "mdi16n4",
      "author": "thestonedjellyfish",
      "body": "Hey, it’s just anorexia nervosa now. Not atypical. Atypical anorexia was under OSFED. They found a large number of individuals were being diagnosed with OSFED/AAN despite meeting the criteria for AN, which ended up becoming harmful and invalidating to people who did still lose a significant amount of weight and met every other criterion for AN. Even the eating disorder center I worked at most adults were of normal weight and very very sick (no period, refeeding syndrome, heart issues, electrolyte imbalances, hair loss, decreased bone density, etc) \n\nI understand where you are coming from. After all, we (because I also struggle with anorexia nervosa since I was 12 years old and now as a 25 year old in recovery) are a disease of never being enough. And yes, there are serious physical manifestations to being underweight. The DSM now uses BMI to categorize severity, which isn’t perfect either, but it’s something. But there are also very serious physical and physiological effects to being normal weight/overweight and struggling with anorexia. \n\nI don’t mean to be rude! Just an educating moment haha. I hope you are taking care of yourself💕 it’s rough out here",
      "created_utc": 1739913615.0,
      "score": 1,
      "context": [
        {
          "id": "kzlzk0p",
          "author": "Kangaroo_9904",
          "body": "I feel this way all the time. You aren’t faking it!! That crushing feeling of “it’s not enough” is the disorder. I’ve never been hospitalized or passed out. I eat everyday, especially a decent breakfast before work. Still disordered according to my primary, but the comparison makes me feel like eating anything at all invalidates the disorder. NOT true. \n\nAs for the tactless outlining of diagnoses in these comments, I will leave you with this insight: my disorder was the same with the thoughts but 10 times worse with actions when I was diagnosed with AAN than when I crossed the “threshold” into AN. That weight distinction is crap.",
          "created_utc": 1713140416.0
        },
        {
          "id": "kznftmb",
          "author": "MrVelocoraptor",
          "body": "I mentioned this above but the weight thing is for an official diagnosis of AN. The diagnosis of AN matters medically but for an individual who is struggling, the struggle is what matters a whole lot more. I would classify anyone other than AN as having eating disorder behaviour or BN. It doesn't lessen their need and eating disorder behaviours can end up leading to AN but a normal or above normal BMI is not AN. On a personal note, when I looked in the mirror I really did see fat on my abdomen and my mom told me later on that friends were asking if I had cancer. This is really hard to type but it's the truth. That's the AN. And it's not any better or more special than ED behaviours or BN or anything else. Everyone's struggle is their own struggle period. And deserves recognition and help. But AN is a particular beast in that you actually think and believe that you are fat looking while others think you are about to die from being underweight. While I've increased weight, I still struggle with this every day, every hour, and still haven't gotten back to \"normal\" weight. Cheers",
          "created_utc": 1713168847.0
        },
        {
          "id": "mdfqtbu",
          "author": "thestonedjellyfish",
          "body": "I know this is old but as someone currently in school soon to graduate, I can, in fact, diagnose someone with AN regardless of their BMI. It is no longer on the DSM (since 2022 I believe) that they must be underweight to meet criteria for AN. It was damaging to individuals who were never underweight but still had AN and needed help.",
          "created_utc": 1739890461.0
        },
        {
          "id": "mdhwfmr",
          "author": "MrVelocoraptor",
          "body": "That's fair and since my post I've learned about the change in diagnosis, I believe it's called atypical anorexia, as well as realizing my insensitivity and rudeness back then. I was frustrated by feeling like a lot of people were claiming to be anorexic while normal/overweight and I felt like I was being crowded out by people who didn't understand how horrible it is to be very underweight and unable to stop losing weight and the terrible nightmare after you have a wakeup call and are fighting a horrible mental and physical battle trying to recover your weight, something I'm still trying to do. I didn't know how to respectfully share my feelings about that and I probably still don't but I think I'm improving, anyways, cheers :)",
          "created_utc": 1739912331.0
        }
      ]
    },
    {
      "id": "kzt1uwj",
      "author": "Visual_Future3089",
      "body": "There's a difference between feeling healthy and being healthy. We don't like healthy slim, we like rail thin. How could you think you were healthy when underweight? That makes no sense. I knew I was sick, but that didn't mean I didn't feel good about it. I felt good and I felt better regardless of how I looked to others. That makes no sense to say you don't enjoy being sick but that you thought you were healthy??? What??? If you truly thought you were healthy, then you wouldn't have felt sick at all, let alone have anything to enjoy or not. Yeah, IDK, I'm confused. I definitely didn't think I was healthy though lol, I just didn't feel as sick as others were saying. It was mostly my neurological condition that made me feel really sick and not knowing how to implement basic self care methods, not the starving or throwing up part. But yeah starving and throwing up isn't *healthy.* But if you are a healthy weight, then you are *healthier* than if you're underweight, like that's just common sense.",
      "created_utc": 1713260438.0,
      "score": 2,
      "context": [
        {
          "id": "kzmremf",
          "author": "turnipkitty112",
          "body": "You’re absolutely not alone. The VAST majority of people with anorexia and other EDs feel like their illness isn’t valid. It’s kind of a hallmark symptom. Even people on their deathbed will still express this feeling - it will NEVER be enough.",
          "created_utc": 1713153056.0
        },
        {
          "id": "kznge31",
          "author": "MrVelocoraptor",
          "body": "I'll be honest, having AN or eating disorder behaviours for me meant that I denied it for a long time and honestly, still struggle with this, That's the hallmark, is the denial. And still losing weight (for AN). It took me a year to admit it to my counselor and I haven't admitted to anyone else, even when I heard that people thought I had cancer... This is just my own experience of course. But the diagnoses are to help medically treat AN or BN. Other psych issues should be treated appropriately as well. Someone who doesn't technically have AN or BN but has eating disorder behaviours +/- other mental health issues isn't less valid or less worthy of help if they are struggling. I feel like there's this culture of \"a skinny person suffering is more worthy than an overweight person who is suffering\" and this is total BS. And I'm so sad that this is the culture we live in. Everyone deserves love and help. Everyone. <3",
          "created_utc": 1713169285.0
        },
        {
          "id": "kzogy84",
          "author": "Visual_Future3089",
          "body": "I'm going to challenge this and say that the denial sometimes stems from not wanting others to have a tainted perception of you. It's also a way to perpetuate behaviours. Not everyone *wants* to boast about how sick they are and act like they *want* feeding tubes or to be hospitalized. Most of us *enjoy* our disorder. That's part of the shock value, when someone is sick and underweight and their brains *like* it enough to continue to deny food. \n\nWhen I was underweight, I was suffering from undiagnosed and untreated epilepsy, which was honestly the main cause for wanting to recover and feeling like I even needed to be hospitalized at all. It had quite literally very little to do with my weight, my 'look', or my eating disorder behaviours.",
          "created_utc": 1713189556.0
        },
        {
          "id": "kzso2cs",
          "author": "MrVelocoraptor",
          "body": "No I'm sorry but that's not the disorder. You don't enjoy BEING SICK, if you truly have AN, you enjoy BEING SKINNY and underweight. I literally thought I WAS HEALTHY when others thought I was dying. I don't know why I have to explain the truth and have people \"feel\" differently and so they are right. Go get f\\*\\*\\*ing diagnosed and then come speak with me. W/e",
          "created_utc": 1713250102.0
        }
      ]
    }
  ]
}