{
  "id": "1c92wcx",
  "subreddit": "AnorexiaNervosa",
  "author": "5aminNYC",
  "created_utc": 1713653573.0,
  "title": "My friend died of anorexia today... And on her birthday ",
  "selftext": "I feel so empty, she died of chest infection and previously complicated by pancreatitis all because of Anorexia and its complications\n\nI know she's at a better place and I hope she rests in peace, but everytime she gets hospitalized, I always used to have that feeling that she will be okay, except this time, I felt that I'm dreading that the next update will be her death and it was real, it happened 2 days later after her admission, to hear her death news\n\nI can't help but wonder why... I myself was an anorexia survivor for 3 years and a bulimic for 5 years... I can't say I'm completely recovered but at least I'm past the stage of having to face the dreadful and horrendous complications, so when I think about it... I just wish she was able to win that battle like many others do\n\nI hope every single person dealing with that strenuous battle of Anorexia, would be able to win it against their own thoughts and inner voice... Death is real and it's serious\nLife is too short and were too young to be wasting our energy and years on achieving sth that's only gonna cause our death not even success or triumph \n\nI'm wishing all the warriors and survivors of Anorexia and bulimia on this subreddit all the best and all the luck, and showers of bliss and love ... God chose you to face this battle for a reason, you're extraordinary, you're beyond perfect... Please, don't let Anorexia take ur life away, you deserve much better than that",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1c92wcx/my_friend_died_of_anorexia_today_and_on_her/",
  "score": 287,
  "num_comments": 21,
  "comments": [
    {
      "id": "l0ios7n",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1713653573.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l0iw6b1",
      "author": "emilykerley",
      "body": "I’m so sorry for your loss 🩷 sending love & prayers",
      "created_utc": 1713656555.0,
      "score": 54,
      "context": []
    },
    {
      "id": "l0it0x5",
      "author": "Livdonna",
      "body": "Fuck man.  First of all I am sending all of my love and condolences to you.  I’ve lost many to ED over the years and it never gets any easier hearing that another lost their battle.  I know the pain well and I wish I could give you the biggest freaking hug.  Eating disorders are monsters and no one deserves to have to deal with them.\n\nSometimes I ask myself why I survived but so many haven’t, and it’s a horrible reality — the reality that these illnesses DO kill.",
      "created_utc": 1713655287.0,
      "score": 40,
      "context": []
    },
    {
      "id": "l0ivaef",
      "author": "Nikayayy",
      "body": "Im so deeply sorry… i am sending all my love",
      "created_utc": 1713656196.0,
      "score": 17,
      "context": []
    },
    {
      "id": "l0j2ixj",
      "author": "MethodOfYeetus",
      "body": "I'm so, so sorry for your loss. it's sounds like both of you have been through a lot and suffered the unforgiving consequences. I'm praying for you and your friends. please, take care of yourself.",
      "created_utc": 1713659163.0,
      "score": 15,
      "context": []
    },
    {
      "id": "l0jyg3v",
      "author": "None",
      "body": "this was like a punch to the gut. i am so, so sorry for your loss. unfortunately though, you posting this is such a necessary reminder about the real, devastating consequences of the disorder. i appreciate you sharing and i hope your friend is finally getting to rest in peace. sending so much love. please stay safe 💕",
      "created_utc": 1713674153.0,
      "score": 11,
      "context": []
    },
    {
      "id": "l0mxuk2",
      "author": "bigoldsunglasses",
      "body": "My aunt died from anorexia 13 years ago. It caused so much damage to her body, by the time she recovered it was too late. I remember my last hug with her, she was literally skin and bones, and she said, “wow you’ve gotten so tall and skinny” I was probably 8 or 9 and I remember thinking “ *youre saying that to me!?* “\nTowards the end of her life she looked completely different from how she used to. She used to have beautiful brown hair, always in a ponytail, beautiful freckles… before she passed, she looked like a ghost. Dull grey skin, hair thinning out so much you could see her scalp.. she was dead long before she died. It kills me, and it scares me since I struggle with an ED, I don’t want my nephews and niece to go through the same pain of losing an aunt like I did. It’s a hard battle in my head..\nI’m so sorry you’re going through this, it’s so devastating, and also scary if you have an ED. \nMay she rest in well deserved peace",
      "created_utc": 1713727227.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l0j09jd",
      "author": "Inevitable-Island255",
      "body": "i’m so sorry for your loss",
      "created_utc": 1713658231.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l0kg3qr",
      "author": "severelysmart",
      "body": "Im so sorry for your loss. sending prayers ❤️‍🩹",
      "created_utc": 1713685657.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l0n8jw1",
      "author": "Ok_Tomatillo1379",
      "body": "My heart goes out to you🩷 don’t let this be a trigger for you. Hang in there🩷",
      "created_utc": 1713731027.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l0ow81h",
      "author": "Psychopathic_sadness",
      "body": "That’s one way to get out of birthday cake",
      "created_utc": 1713755490.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l12fs58",
      "author": "toohardontheknees",
      "body": "she was so lucky to have such a wonderful friend, i wish peace to all of you 🤍",
      "created_utc": 1713976895.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l588qvz",
      "author": "HereRightNowNDY",
      "body": "My friend died sometime yesterday, alone in her bed. She was found after she had not answered her phone for two days and the police were called. She had anorexia for 16 years. She was 28. She had gallstones, pancreatitis, kidney stones, horrific gastroparesis, she had lost a bunch of teeth, had more broken bones than I could count, she’d shaved her head because her hair was so thin and had bald patches, she was a skeleton with skin, skin so thin you could see right threw it…. She had been in and out of treatment many times, it just traumatized her. The last time she actually decided to go get help, she had to be flown to a specialist center in Colorado after being hospitalized and the hospital staff couldn’t hardly stabilize her. She had to sign something to even get admitted there saying that she wouldn’t leave. She was there 3 months, but then somehow was able to check herself out. She didn’t look any better. I spoke to her just a few days before she died and she was still sharp as a tack. I don’t understand, I knew she was too sick to live much longer, but she had been living like this for so long… I’m not shocked but I think I’m in shock. She had seemed to finally have some things going in lifer that gave her purpose (beyond this heinous disease), her animals were her life, she took fabulous care of them, I just wish she could have done the same for herself. I’m so heartbroken because she was an amazing human and anorexia destroyed her … it is so maddening. She was herself to the very end but there was this other horrific thing she couldn’t logically control. I have so many questions I never asked.",
      "created_utc": 1716411756.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l0p0icx",
      "author": "None",
      "body": "I’m sorry for your loss ❤️ I am praying for your recovery as well as peace. You can message me if you need anything.",
      "created_utc": 1713757590.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l0p8de0",
      "author": "Tajskskskss",
      "body": "I’m so sorry. Sending you love and prayers.",
      "created_utc": 1713761799.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l14rmy2",
      "author": "Spirited_Priority_24",
      "body": "I am so sorry for your loss. I can’t imagine what you’re going through, but I feel empathy for you regardless. ♥️",
      "created_utc": 1714006255.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l17mdic",
      "author": "mangotime_03",
      "body": "Heart just broke as soon as a saw this pop up on my feed. Sending prayers, tons of love, and my condolences ❤️❤️I am so sorry for your loss. Rest in peace",
      "created_utc": 1714057940.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbuht55",
      "author": "Fuzzy-Vacation8513",
      "body": "So tragic to have lives lost. ROOT CAUSES of brain disorders like anorexia, depression, anxiety and even dementia can be from infections, toxins, brain nutrient deficiencies from genetics, etc. Yet that is not being taught. See Dr Bock's you tubes and book Brain Inflamed, [NeuroImmune.org](http://NeuroImmune.org), [AlzPi.org](http://AlzPi.org), PsychologyReDefined.org.",
      "created_utc": 1739114081.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l0jbrhx",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1713663023.0,
      "score": -14,
      "context": []
    },
    {
      "id": "l0jnv8h",
      "author": "5aminNYC",
      "body": "👍",
      "created_utc": 1713668473.0,
      "score": 1,
      "context": [
        {
          "id": "l0jbrhx",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1713663023.0
        }
      ]
    }
  ]
}