{
  "id": "1ckij88",
  "subreddit": "AnorexiaNervosa",
  "author": "Appropriate_Wall_663",
  "created_utc": 1714881349.0,
  "title": "I need to admit something fucked up",
  "selftext": "Obviously all of us know how competitive this disorder is and how it can severely mess with our perspective on bodies/eating. But I just need to admit something cause I feel so fucked up feeling this way.\n\n\nI struggle with anorexia, binge eating and bulimia. I have never recovered- only continued switching between each disorder throughout each phase of my life. \n\nThis year I have been binging and purging for the past few months due to uni stress and just eating my stress away- later purging because of the disgusting full feeling. \n\nI have relapsed back into ana- for a myriad of reasons, but one of them is because I’ll be headed to Europe in a month. \n\nI am at a healthy weight right now, but I want to look slimmer. And one of the fucked up things is- I’ll be meeting up with my cousin at one of my destinations and I know she’s on the heavier side. And theres a sick part of me that wants to look good because I want her to envy me. \n\nI feel so fucking disgusting, because she’s my cousin and I love her to death. Does anyone else go through this?? I just feel like I want to shower over and over again because I’m so disgusted with myself. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ckij88/i_need_to_admit_something_fucked_up/",
  "score": 131,
  "num_comments": 25,
  "comments": [
    {
      "id": "l2n62xh",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1714881349.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l2na82q",
      "author": "None",
      "body": "the fact that you hate the thoughts you're having about your cousin says enough about you as a person. it's the disorder's voice, not yours",
      "created_utc": 1714883609.0,
      "score": 138,
      "context": []
    },
    {
      "id": "l2o23pi",
      "author": "mustardmitt_",
      "body": "You’re not the only one, being disordered makes you competitive in games no one signed up for; not you, definitely not your cousin. The difference is you can win or lose this game, whereas your cousin doesn’t even know they’re playing. Don’t feel guilty, you didn’t sign up for this. The fact you recognise all this is a good sign that it’s not *you* talking, it’s just a piece of you that is unwell. Be kind to yourself and your cousin.",
      "created_utc": 1714903089.0,
      "score": 17,
      "context": []
    },
    {
      "id": "l2nfz4n",
      "author": "Responsible_Item9277",
      "body": "Yes. I completely understand. I am 1 of 4 sisters and have always been the smallest (even though I’m the oldest) and it became part of my identity. Now I feel sometimes upset if a sister looks thin bc of my own battles. Do not be disappointed in yourself it’s yourself attacking. The comparison is not toward them it’s towards yourself.",
      "created_utc": 1714887034.0,
      "score": 27,
      "context": []
    },
    {
      "id": "l2o8qy7",
      "author": "scathed_and_confused",
      "body": "I like to visualise thoughts that really don't align with my understanding of myself, like a scribble or a tangle of wires sitting next to me on a bench. This helps to create some space. You weren't born with these thoughts, they are a symptom of a powerful voice so strong it leads to your own demise unless you stop it. Things get louder when they are dying, and when it knows it can't work on you, it will spit venom at things you love or anything it can get to. Just like any antagonist. I look at my disorder as a parasite when it says these things to me – remember it thrives on keeping you alone and away from anything that threatens it. Opposite actions, distance from beliefs.",
      "created_utc": 1714907828.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l2oe9ry",
      "author": "Pennyroyalteax3",
      "body": "I also go through this. Its like I get off on the idea of being the most disciplined and thinnest in the room - it almost feels powerful but makes me feel icky too.",
      "created_utc": 1714911050.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l2ovngp",
      "author": "ariariariarii",
      "body": "I get this. I’m obsessed with being the “hot friend” especially around girls I don’t like as much. Which kills me because all of my friends are absolutely beautiful women.",
      "created_utc": 1714919119.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l2ntv3c",
      "author": "MeFloatingDoor",
      "body": "I’m on your same boat. I too have a cousin who’s bigger and she’s coming here in the summer, and as much as I hate to admit it i want her to feel jealous of my weight loss. Don’t worry, you’re not alone in this",
      "created_utc": 1714896799.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l2ogq1m",
      "author": "Altruistic_Door8859",
      "body": "Yes. I feel this. If I’m with one of my friends ( none of them know about my disorder ) and they less than I do I immediately get mad at them and get disappointed in myself. I’ve almost lost friends because of it",
      "created_utc": 1714912352.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l2ooott",
      "author": "EErigeron",
      "body": "I do this all the time. I want people to either envy how small I am or be worried for me, but I recognize that these thoughts doesn't have to do with me as a person but are there because I'm mentally ill. We're not bad people for having disordered thoughts that we didn't choose to have, and you do say that you feel bad for having those thoughts which says a lot about you as a person. You can seperate Thise two and free yourself from guilt since you already held yourself responsible",
      "created_utc": 1714916176.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l2prchg",
      "author": "Saphxmoon",
      "body": "I get this so much. I'm sort of in the opposite situation, I have three younger cousins (they're all siblings) with anorexia. they've all been incredibly severely underweight and in hospital. And it makes me so competitive it's horrible. I want to be worse than they ever were. Every time I see them I feel so pressured to restrict even more so that I can be skinner than them. and it's even more horrible that one of them is recovered and another is weight restored. What if me being smaller triggers them and they relapse? Yet I still feel this drive to be skinnier than them. They're all younger than me too and it makes me feel like such a failure because it's like they beat me to it? \n\nIt's really sad because including me, that makes 4 out of the 5 girls in this generation of my mum's family with AN. The only female cousin who doesn't have an ED is the youngest whose only 10. It terrifies me that she could pick up an ED too. It would hurt so much to see her go through that pain. It's not too long until she's a teenager as well and that seems to have been the age where the ED gene kicked in for me and the others. \n\nSorry for hijacking your post with a vent, but I just want you to know you're not alone. I wish I had better advice, but I hope you can take comfort in the fact that it doesn't mean you're a bad person at all. It's this horrible disease, it affects how we see everyone around us. It says nothing about you. Best wishes <3",
      "created_utc": 1714930940.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l2ow4t7",
      "author": "TestGlum9575",
      "body": "100% i feel that w my friends and family (causins, mom, etc)",
      "created_utc": 1714919316.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l2pzt52",
      "author": "moon-was-taken",
      "body": "it’s an intrusive thought! it’s not your fault and you’re not disgusting for it. I get them about my ED too & feel incredibly guilty anytime it happens. What helps me is to make sure I correct the thought & then remind myself i can’t control my intrusive thoughts, but i can definitely control what i do and say. we just can’t ever cross the line between thinking these things, and actually saying/doing anything that would hurt the other person’s feelings or self image",
      "created_utc": 1714934061.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l33z6bd",
      "author": "_Plague_Dr",
      "body": "You are not your thoughts. It's the disorder speaking, not you. Your thoughts don't define you. You don't have to feel disgusted in yourself, it's just a symptom of a disorder, not your actual opinion. \nWish you all the best!",
      "created_utc": 1715163480.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l2s97s9",
      "author": "Infinite-Elk-7363",
      "body": "Please if you ever need someone to talk too Jesus listens to our prayers. God bless you.",
      "created_utc": 1714967756.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l2nbebn",
      "author": "Appropriate_Wall_663",
      "body": "Thank you so much for your comment. I can’t explain how much peace you have given me. It’s so hard to discern who you are when this disorder is so loud, and sometimes hearing the rational side from others really helps.",
      "created_utc": 1714884273.0,
      "score": 36,
      "context": [
        {
          "id": "l2na82q",
          "author": "None",
          "body": "the fact that you hate the thoughts you're having about your cousin says enough about you as a person. it's the disorder's voice, not yours",
          "created_utc": 1714883609.0
        }
      ]
    },
    {
      "id": "l2o2mzv",
      "author": "Appropriate_Wall_663",
      "body": "Thank you so much for your kindness🥺",
      "created_utc": 1714903494.0,
      "score": 3,
      "context": [
        {
          "id": "l2o23pi",
          "author": "mustardmitt_",
          "body": "You’re not the only one, being disordered makes you competitive in games no one signed up for; not you, definitely not your cousin. The difference is you can win or lose this game, whereas your cousin doesn’t even know they’re playing. Don’t feel guilty, you didn’t sign up for this. The fact you recognise all this is a good sign that it’s not *you* talking, it’s just a piece of you that is unwell. Be kind to yourself and your cousin.",
          "created_utc": 1714903089.0
        }
      ]
    },
    {
      "id": "l2nh4uw",
      "author": "Appropriate_Wall_663",
      "body": "Thank you for helping me feel less alone 🩷",
      "created_utc": 1714887783.0,
      "score": 7,
      "context": [
        {
          "id": "l2nfz4n",
          "author": "Responsible_Item9277",
          "body": "Yes. I completely understand. I am 1 of 4 sisters and have always been the smallest (even though I’m the oldest) and it became part of my identity. Now I feel sometimes upset if a sister looks thin bc of my own battles. Do not be disappointed in yourself it’s yourself attacking. The comparison is not toward them it’s towards yourself.",
          "created_utc": 1714887034.0
        }
      ]
    },
    {
      "id": "l2o8ygy",
      "author": "Appropriate_Wall_663",
      "body": "I like that perspective- thank you 🫶🏼",
      "created_utc": 1714907963.0,
      "score": 3,
      "context": [
        {
          "id": "l2o8qy7",
          "author": "scathed_and_confused",
          "body": "I like to visualise thoughts that really don't align with my understanding of myself, like a scribble or a tangle of wires sitting next to me on a bench. This helps to create some space. You weren't born with these thoughts, they are a symptom of a powerful voice so strong it leads to your own demise unless you stop it. Things get louder when they are dying, and when it knows it can't work on you, it will spit venom at things you love or anything it can get to. Just like any antagonist. I look at my disorder as a parasite when it says these things to me – remember it thrives on keeping you alone and away from anything that threatens it. Opposite actions, distance from beliefs.",
          "created_utc": 1714907828.0
        }
      ]
    },
    {
      "id": "l2ofww5",
      "author": "Appropriate_Wall_663",
      "body": "Yes exactly!!! You see everyone else reaching for the dessert after dinner and you’re ecstatic to be the only one holding off. This illness is crazy.",
      "created_utc": 1714911930.0,
      "score": 2,
      "context": [
        {
          "id": "l2oe9ry",
          "author": "Pennyroyalteax3",
          "body": "I also go through this. Its like I get off on the idea of being the most disciplined and thinnest in the room - it almost feels powerful but makes me feel icky too.",
          "created_utc": 1714911050.0
        }
      ]
    },
    {
      "id": "l2qpsrg",
      "author": "Appropriate_Wall_663",
      "body": "Thissss 😭😭😭 like I love them so muchhhh it’s so sick",
      "created_utc": 1714943728.0,
      "score": 1,
      "context": [
        {
          "id": "l2ovngp",
          "author": "ariariariarii",
          "body": "I get this. I’m obsessed with being the “hot friend” especially around girls I don’t like as much. Which kills me because all of my friends are absolutely beautiful women.",
          "created_utc": 1714919119.0
        }
      ]
    },
    {
      "id": "l2nweyj",
      "author": "Appropriate_Wall_663",
      "body": "It’s so terrible. But it’s like you feel this sense of accomplishment because you’re the one with “discipline”😩",
      "created_utc": 1714898719.0,
      "score": 3,
      "context": [
        {
          "id": "l2ntv3c",
          "author": "MeFloatingDoor",
          "body": "I’m on your same boat. I too have a cousin who’s bigger and she’s coming here in the summer, and as much as I hate to admit it i want her to feel jealous of my weight loss. Don’t worry, you’re not alone in this",
          "created_utc": 1714896799.0
        }
      ]
    },
    {
      "id": "l33z9lr",
      "author": "Appropriate_Wall_663",
      "body": "Thank you 🥹🫶🏼🩵",
      "created_utc": 1715163543.0,
      "score": 1,
      "context": [
        {
          "id": "l33z6bd",
          "author": "_Plague_Dr",
          "body": "You are not your thoughts. It's the disorder speaking, not you. Your thoughts don't define you. You don't have to feel disgusted in yourself, it's just a symptom of a disorder, not your actual opinion. \nWish you all the best!",
          "created_utc": 1715163480.0
        }
      ]
    },
    {
      "id": "l2nuit3",
      "author": "LanBanan3000",
      "body": "Their comment is on point. You cannot help the intrusive thoughts you have; they’re not you, your reaction to them is. \n\nI’ve never heard it framed that it’s the disorder’s voice but I like that a lot.",
      "created_utc": 1714897291.0,
      "score": 15,
      "context": [
        {
          "id": "l2na82q",
          "author": "None",
          "body": "the fact that you hate the thoughts you're having about your cousin says enough about you as a person. it's the disorder's voice, not yours",
          "created_utc": 1714883609.0
        },
        {
          "id": "l2nbebn",
          "author": "Appropriate_Wall_663",
          "body": "Thank you so much for your comment. I can’t explain how much peace you have given me. It’s so hard to discern who you are when this disorder is so loud, and sometimes hearing the rational side from others really helps.",
          "created_utc": 1714884273.0
        }
      ]
    },
    {
      "id": "l2nwbf8",
      "author": "Appropriate_Wall_663",
      "body": "Yes me either! That’s why I appreciated their comment so much!",
      "created_utc": 1714898645.0,
      "score": 5,
      "context": [
        {
          "id": "l2na82q",
          "author": "None",
          "body": "the fact that you hate the thoughts you're having about your cousin says enough about you as a person. it's the disorder's voice, not yours",
          "created_utc": 1714883609.0
        },
        {
          "id": "l2nbebn",
          "author": "Appropriate_Wall_663",
          "body": "Thank you so much for your comment. I can’t explain how much peace you have given me. It’s so hard to discern who you are when this disorder is so loud, and sometimes hearing the rational side from others really helps.",
          "created_utc": 1714884273.0
        },
        {
          "id": "l2nuit3",
          "author": "LanBanan3000",
          "body": "Their comment is on point. You cannot help the intrusive thoughts you have; they’re not you, your reaction to them is. \n\nI’ve never heard it framed that it’s the disorder’s voice but I like that a lot.",
          "created_utc": 1714897291.0
        }
      ]
    }
  ]
}