{
  "id": "1cno425",
  "subreddit": "AnorexiaNervosa",
  "author": "unremarkable_sapien",
  "created_utc": 1715227001.0,
  "title": "Do you KNOW that you’re underweight?",
  "selftext": "For context, I’m very underweight but see myself as slim/normal. I can see bones but also too much fat. But even though I don’t see myself as underweight, I know that I am because I know what my BMI is.\n\nMost professionals that I speak to seem surprised at my level of insight because I don’t insist that I’m healthy and don’t need to gain weight. I know cognitively that I need to gain, I just don’t SEE it. Do you guys have similar experiences, or do you genuinely believe that you’re healthy when your BMI is underweight?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1cno425/do_you_know_that_youre_underweight/",
  "score": 137,
  "num_comments": 44,
  "comments": [
    {
      "id": "l38hxvt",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1715227002.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l38lxb3",
      "author": "embarassedcoochie",
      "body": "Tbh I love how my body looks sometimes, but it terrifies me at the same time. Also the combo of high bf % loose skin and not a lot of muscle makes me want to rip my skin off. I don’t like the bones anymore I wish I just looked normal and toned :/",
      "created_utc": 1715229173.0,
      "score": 75,
      "context": []
    },
    {
      "id": "l38r0ki",
      "author": "pinkienewbie",
      "body": "I knew I was underweight due to bmi but no I didn’t think I was really thin. I was adamant when I went in-patient that I was the biggest one there and didn’t need to be there.",
      "created_utc": 1715232132.0,
      "score": 47,
      "context": []
    },
    {
      "id": "l38obkx",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1715230515.0,
      "score": 45,
      "context": []
    },
    {
      "id": "l38ph1v",
      "author": "None",
      "body": "Yeah I know my bmi is severe and I know I can see some bones but I also see way too much fat and feel like there's so much left to lose/see myself as normal/slightly bigger than in some spots idk especially when comparing to other people's photos with the same BMI on twitter etc.",
      "created_utc": 1715231192.0,
      "score": 22,
      "context": []
    },
    {
      "id": "l38y3v2",
      "author": "lytkiniki",
      "body": "i know im underweight but i cant feel skinny, i look too normal and it pisses me off",
      "created_utc": 1715236896.0,
      "score": 21,
      "context": []
    },
    {
      "id": "l395k9a",
      "author": "Fun-Position7652",
      "body": "It’s so frustrating that professionals just don’t know anything about this. \n\nOf course I knew I was underweight. It’s just not enough despite the fact that I absolutely marvelled at my look. So it didn’t really matter what I knew. I wanted to be thinner than I was, though I was only slightly underweight. I doubt this is universal for those who are severely underweight and quite happily maintain it. If you’re only mildly underweight, it’s way too easy to not be underweight anymore, which is its own pain.",
      "created_utc": 1715242562.0,
      "score": 16,
      "context": []
    },
    {
      "id": "l395cjf",
      "author": "gardenfaiiri",
      "body": "Similarly to you, most of the professionals I meet are surprised by my level of insight. I am very UW, and I know I don’t look healthy, although I am sure as to the accuracy at which I do see myself. \n\nI understand that what I am doing isn’t healthy, I know I don’t look healthy, most of the time I hate the way I look due to being UW, and I very much aware of the consequences of my actions. But despite this I have never been able to make any change which is why I am let go from treatment most of the time.",
      "created_utc": 1715242392.0,
      "score": 16,
      "context": []
    },
    {
      "id": "l39kzgs",
      "author": "n7shepart",
      "body": "I can see that Im bony and underweight, and know I need to gain it, but at the same time freak out that I have to gain it and really do not want to because I freak out I will gain too much, think that I like my body the way it is etc. I have dysmorphia but it affects my face more than anything else and I have the type of face that doesnt change much when I gain or lose weight. I know Im not healthy. Medical professionals have been baffled at my \"self awareness\", but Ive met so so many people with anorexia like me.",
      "created_utc": 1715253445.0,
      "score": 15,
      "context": []
    },
    {
      "id": "l39tys1",
      "author": "turnipkitty112",
      "body": "Oh, yeah, I know for sure I’m dangerously underweight. Sometimes I can even look at myself and see “wow, I look really sick”. I know I’m not healthy, I don’t feel healthy, I know I need to gain weight. The problem is I’m terrified, and I feel safe this way. I don’t have to deal with all the scary, difficult things about a normal life. I can withdraw, I can control, I can remain safe in my little cocoon of disorder. It’s all I’ve known for so long. And sometimes when I look at my body I still think, oh this bone could be more prominent. This part could be smaller. There’s still some fat here, even if I know I’m not fat. It doesn’t feel like enough. I could still be smaller.",
      "created_utc": 1715257906.0,
      "score": 12,
      "context": []
    },
    {
      "id": "l3b43o0",
      "author": "Lonely-Iron-1038",
      "body": "I genuinely believe that I'm healthiest at a slightly underweight bmi. I don't see myself as too thin then. right now I'm ~8 pounds away from that, in the lowest end of normal. I feel like i look... okay, but still fat in specific areas that i think look *absolutely awful* and bordering on unhealthy ?? (but I truly know it's not). Anywhere I don't have that extra fat, i feel it looks healthy and strong. It's sort of a mixed bag i guess",
      "created_utc": 1715275079.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l3a0cry",
      "author": "Hot-Resource-5496",
      "body": "Yeah I know I’m underweight but I think I just look slim… \n\nWhen I was really uw I knew it and I knew it was dangerous, but I didn’t care.",
      "created_utc": 1715260672.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l3adrxe",
      "author": "BooksMirth",
      "body": "I have recovered now, but when I was at my worst a year ago, I definitely did not see it. I’d look at myself and see a perfectly healthy individual, even if I was medically speaking, not, was a low BMI and struck concern in everyone who met me. My brain just couldn’t comprehend it. Now that I’ve regained healthy weight and look back at my pictures… I genuinely shocked. It feels like something was almost clouding my vision and judgement (the ED voice). It’s so strange to remember.",
      "created_utc": 1715265762.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l39l4gt",
      "author": "AtmosphereNo7004",
      "body": "I know I am really underweight right now due to my BMI and I am aware I can see my bones and it hurts to sit on wooden chairs and even the toilet seat is uncomfortable. I feel my clothes being too big yet I still see places where I should loose weight. I hate my legs and I still have dresses I don’t feel like wearing because I think I look fat in them 😕",
      "created_utc": 1715253523.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l3a8zmw",
      "author": "K8_15",
      "body": "I always thought I was pretty average. Even with BMI 14 my legs looked fat to me, and they were my least favorite part of my body so I always focused on them. :/",
      "created_utc": 1715264027.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l392qze",
      "author": "pathologicalprotest",
      "body": "I’m pretty much normal weight now (huzzah, take that stupid anorexia), but when I am underweight, I know. I also never perceived myself as overweight because I never have been. I am aware of my situation. I know it’s bad for me to dip below a certain weight. I’m not labouring under the delusion that I do this because it’s good for me. My kidneys will attest to the fact that it’s not.",
      "created_utc": 1715240354.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l39dnvh",
      "author": "mouse-bites",
      "body": "Logically yes, I know I look terrifying. But I’m still bigger than I want to be, and that’s what people don’t understand.",
      "created_utc": 1715248797.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l3akqds",
      "author": "urcutedad",
      "body": "I’m very aware that I’m underweight, but I still feel like I’m huge and could be smaller 🥲",
      "created_utc": 1715268242.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l3bqvjs",
      "author": "Desperate_Purpose419",
      "body": "I don’t know. Sometimes I look at myself and think I look completely ‘normal’ and just like a regular slim person and that I look pretty good. Other time I see bones a bit more and think hmm do I look unhealthy to someone else? \nIt’s weird because it can be on the exact same day. Or I’ll be looking at the exact same pictures of my body and I think differently every time. I flip flop between if I’m really even ‘sick’ or not. Even though I know I have technically disorders behaviours. It’s one of the most confusing things I’ve experienced",
      "created_utc": 1715282930.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l3d6hh3",
      "author": "-aquapixie-",
      "body": "Yup, this. I know medically and logically, I just can't see it. I do know I'm very skinny, way thinner than the average person, and I do flaunt it off. I've never been one to wear baggy clothes to hide my eating disorder, only if I'm arse numbingly cold LOL and thus yes, people do remark HOW thin I am. Doctors all the way down to family/friends.\n\nBut I still think I look too fat because I can see the areas of skinnyfat on my bones, where they aren't prominent bones",
      "created_utc": 1715302151.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l3degma",
      "author": "SieBanhus",
      "body": "Yup. I know I’m underweight, I just think I’m somehow the exception to reality and I don’t *look* underweight. 🙄",
      "created_utc": 1715305521.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l396n9r",
      "author": "Usual-Effect1440",
      "body": "I know that I am not",
      "created_utc": 1715243426.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l3aip3k",
      "author": "pebblesandmarbless",
      "body": "I could have written this post myself word for word a couple years ago! I'm weight restored now but when I was at a low BMI I saw myself the same way you're describing. I knew I was thin but I didn't see myself as dangerously thin (even though I was), I saw myself as slightly underweight overall but with areas of fat that I needed to \"work on\".  I knew that I needed to gain weight but I was also terrified because I was so fixated on the areas of my body I already didn't like, and I kept thinking about how much \"worse\" those areas were going to get.\n\n  \nFWIW I'm happier with my body now that I'm weight restored than I ever was at a low weight. Not every moment of every day is perfect but a huge difference I've noticed is that clothes look so much better on me now that they actually fit and aren't hanging off of me! Interestingly, I can also look back at pictures of myself from a couple years ago and I actually see myself as underweight now when I didn't back then.",
      "created_utc": 1715267516.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l3bap40",
      "author": "pinkrynnn",
      "body": "I think I look similar to my 14 year old self, just with higher body fat and different proportions. This is the longest I’ve stayed stable-ish in a weight bracket that I feel so much bigger than my uw bmi that would’ve made me feel so good a couple months ago. I feel most myself when I’m moderately uw but being slightly under healthy has my body image being weird as I still have anorexic thoughts about myself and food but I’m trying not to go back fully and so my brain is convincing me that I look healthy bc I’m doing better with eating when I am still very much disordered lmaoo",
      "created_utc": 1715277354.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l3jtc9m",
      "author": "Capital-Turn9367",
      "body": "I don’t notice how skinny I am until I take a good look in the mirror, it’s honestly sad to see how much my body has deteriorated, loose skin also sucks too",
      "created_utc": 1715416024.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l53sh0y",
      "author": "None",
      "body": " im underweight and feel fucking huge",
      "created_utc": 1716339785.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l39bf3s",
      "author": "Acedia_spark",
      "body": "Some days, yes! \n\nSome days, I absolutely delight in the feeling of my own structure under my hands.\n\nAnd then other days I can't feel anything but excess and frustration.\n\nThe biggest time I notice it is when I put on a form fitting tshirt, I think I look like a bobblehead, so I tend to wear really thick oversized clothes.",
      "created_utc": 1715247137.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3a41p2",
      "author": "FoxGirl-NotFurry-03",
      "body": "I'm just a little above underweight but I see myself as obese. My eating disorder started because I was obese. Even though I'm no where close to that weight I still see myself as obese. \n\nI remember about a few years ago my therapist had me do a \"string test\" it's where you lay out a thing of strung and cut it where you think it would go perfectly around a body part. We did stomach first and where I cut it the string was taller than me (for context I'm around 5 foot) which means in my twisted brain I think I'm wider than I am tall.\n\nI still see what I saw that day but I'm at least aware it's an insane perception of my body.",
      "created_utc": 1715262157.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3b56mj",
      "author": "honeydewbean",
      "body": "I could’ve written this myself that’s how much I relate to/ how accurate this feels",
      "created_utc": 1715275451.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3bflqc",
      "author": "SourCandyBar",
      "body": "I know my bmi is really bad, I can see my bones, I have a lot of extra skin that makes me think I’m fat but I know I’m not fat. I know I need to gain weight but for some reason in my head the amount I eat is okay even though my bmi is severely low. I just want to be able to eat and fill out where I want to when I do eat but it doesn’t work like that and so I end up in a deeper hole with my ED. I wish I didn’t have to do the eating or consuming and just have the ideal weight. Ughhh",
      "created_utc": 1715279062.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3c10u2",
      "author": "Sweetbella44",
      "body": "I was underweight at BMI lower than 17 and when the doctors/psychologists in patient seemed suprised by me knowing i was not at a healthy weight (BECAUSE i had been told that so many times by the therapist who sent me there??? I was obvlivious at first, but then i learned) it really just sent me in a spiral down… I felt like i wasn’t anorexic enough in my behaviour to be taken seriously so i felt like i had to lose weight. \n\nWHY is it almost a criteria that you’re oblivious to your low weight? At some point most have to understand it to want to recover, right??? So why is it when i understand it and feel motivated to get better that i’m suddenly not meeting enough criteria for anorexia that i can recieve help? Makes NO sense",
      "created_utc": 1715286371.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3dq6pn",
      "author": "neopronoun_dropper",
      "body": "No, that’s a step towards recovery. Most people have to reach that at some point. I was a child when I had anorexia. I was able to figure out that I wasn’t actually fat, and I asked my doctor why they’d consistently called me underweight, and it was all CBT from there.",
      "created_utc": 1715310648.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3ilefp",
      "author": "None",
      "body": "i’m not underweight. i’ll forever hate myself.",
      "created_utc": 1715390637.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3m6vlr",
      "author": "Souichis_mouth_nails",
      "body": "I knew I was technically underweight,, especially at my lowest,, but I lost a lot of weight so the combo of loose skin and my body composition I could not see it at all. Sometimes our bodies don’t reflect the struggle they’re under and it’s all down to composition (and some body dysmorphia)",
      "created_utc": 1715457110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l397h4s",
      "author": "Queenofwands1212",
      "body": "I logically know that I’m underweight but I don’t consider myself to be scary underweight because my body is super low body fat so my muscle is very prominent. No one around me seems to be that concerned either so I don’t think it’s an issue. My body fluctuates with water retention and inflammation because of my auto immune issues so 90% of the time I don’t even feel underweight because of how swollen I feel in my body. So I’m always trying to lose weight, I recently feel like I’ve gained and it’s making me spiral. I like the way I feel and look when I am close to my lowest bmi. I don’t look deathly since I have a lot of muslce. So no matter how skinny I get I won’t have that anorexic look I don’t think.",
      "created_utc": 1715244079.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l39nna0",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1715254866.0,
      "score": -2,
      "context": []
    },
    {
      "id": "l38o44m",
      "author": "Exotic_Lengthiness32",
      "body": "ME TOO",
      "created_utc": 1715230399.0,
      "score": 7,
      "context": [
        {
          "id": "l38lxb3",
          "author": "embarassedcoochie",
          "body": "Tbh I love how my body looks sometimes, but it terrifies me at the same time. Also the combo of high bf % loose skin and not a lot of muscle makes me want to rip my skin off. I don’t like the bones anymore I wish I just looked normal and toned :/",
          "created_utc": 1715229173.0
        }
      ]
    },
    {
      "id": "l38q2rn",
      "author": "Agreeable-Pick-3650",
      "body": "It’s highly inappropriate for someone who isn’t a very close friend or family member to comment on your body. I’m sorry you’ve dealt with that. Family or friends shouldn’t necessarily either but definitely not an employer or teacher. \n\nAlso interesting viewpoint, most of those with an ed find beauty in everyone except themselves. Sad you see many of those around you that way. However, I know it’s not in your control. I hope you’re able to heal soon.",
      "created_utc": 1715231556.0,
      "score": 10,
      "context": [
        {
          "id": "l38obkx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1715230515.0
        }
      ]
    },
    {
      "id": "l3b4dqv",
      "author": "Lonely-Iron-1038",
      "body": "this is a WAY better way of putting it than i did lol",
      "created_utc": 1715275177.0,
      "score": 1,
      "context": [
        {
          "id": "l38obkx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1715230515.0
        }
      ]
    },
    {
      "id": "l3xn55l",
      "author": "BoringRelationship91",
      "body": "i understand this and am going through the same thing. i've mastered being self-aware regarding my body and eating habits. that doesn't change how i feel when i look in the mirror and know that deep down i always wanted to look this way. when i developed the disorder at 12, the goal was to look like this. i know i need to be better and help myself but i'm tired. it's been so long.",
      "created_utc": 1715647382.0,
      "score": 1,
      "context": [
        {
          "id": "l39kzgs",
          "author": "n7shepart",
          "body": "I can see that Im bony and underweight, and know I need to gain it, but at the same time freak out that I have to gain it and really do not want to because I freak out I will gain too much, think that I like my body the way it is etc. I have dysmorphia but it affects my face more than anything else and I have the type of face that doesnt change much when I gain or lose weight. I know Im not healthy. Medical professionals have been baffled at my \"self awareness\", but Ive met so so many people with anorexia like me.",
          "created_utc": 1715253445.0
        }
      ]
    },
    {
      "id": "l3b48rc",
      "author": "Lonely-Iron-1038",
      "body": "but like i said, when im underweight i logically *know* that i am, but i dont think i look like it, unless my bmi goes below 16 or so. that’s usually when i can see that im too small",
      "created_utc": 1715275127.0,
      "score": 2,
      "context": [
        {
          "id": "l3b43o0",
          "author": "Lonely-Iron-1038",
          "body": "I genuinely believe that I'm healthiest at a slightly underweight bmi. I don't see myself as too thin then. right now I'm ~8 pounds away from that, in the lowest end of normal. I feel like i look... okay, but still fat in specific areas that i think look *absolutely awful* and bordering on unhealthy ?? (but I truly know it's not). Anywhere I don't have that extra fat, i feel it looks healthy and strong. It's sort of a mixed bag i guess",
          "created_utc": 1715275079.0
        }
      ]
    },
    {
      "id": "l3ilfs8",
      "author": "None",
      "body": "when i was i couldn’t tell. Nobody could. I looked normal.",
      "created_utc": 1715390653.0,
      "score": 1,
      "context": [
        {
          "id": "l3ilefp",
          "author": "None",
          "body": "i’m not underweight. i’ll forever hate myself.",
          "created_utc": 1715390637.0
        }
      ]
    },
    {
      "id": "l3aln7u",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1715268567.0,
      "score": 1,
      "context": [
        {
          "id": "l39nna0",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1715254866.0
        }
      ]
    },
    {
      "id": "l38rr6z",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1715232597.0,
      "score": 12,
      "context": [
        {
          "id": "l38obkx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1715230515.0
        },
        {
          "id": "l38q2rn",
          "author": "Agreeable-Pick-3650",
          "body": "It’s highly inappropriate for someone who isn’t a very close friend or family member to comment on your body. I’m sorry you’ve dealt with that. Family or friends shouldn’t necessarily either but definitely not an employer or teacher. \n\nAlso interesting viewpoint, most of those with an ed find beauty in everyone except themselves. Sad you see many of those around you that way. However, I know it’s not in your control. I hope you’re able to heal soon.",
          "created_utc": 1715231556.0
        }
      ]
    },
    {
      "id": "l38rx0y",
      "author": "Agreeable-Pick-3650",
      "body": "Exactly! I always felt the same way. That’s why it’s never okay to make comments. But we can’t control what others around us say or do. It’s a sad reality. But again, I hope you heal soon. Take care and reach out if you ever need anything.",
      "created_utc": 1715232698.0,
      "score": 6,
      "context": [
        {
          "id": "l38obkx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1715230515.0
        },
        {
          "id": "l38q2rn",
          "author": "Agreeable-Pick-3650",
          "body": "It’s highly inappropriate for someone who isn’t a very close friend or family member to comment on your body. I’m sorry you’ve dealt with that. Family or friends shouldn’t necessarily either but definitely not an employer or teacher. \n\nAlso interesting viewpoint, most of those with an ed find beauty in everyone except themselves. Sad you see many of those around you that way. However, I know it’s not in your control. I hope you’re able to heal soon.",
          "created_utc": 1715231556.0
        },
        {
          "id": "l38rr6z",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1715232597.0
        }
      ]
    },
    {
      "id": "l3d6t1p",
      "author": "-aquapixie-",
      "body": "You're definitely not the only one <3 I think it's a shame/pride thing. Those who feel shame and guilt in their ED are more likely to rip into themselves but praise everyone else. Those who feel pride are more likely to flaunt how small they are whilst being smaller than others.\n\nSo the motivational desires and ego behind it (to take language out of the Enneagram) can absolutely alter the psychopathology of an eating disorder.",
      "created_utc": 1715302284.0,
      "score": 3,
      "context": [
        {
          "id": "l38obkx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1715230515.0
        },
        {
          "id": "l38q2rn",
          "author": "Agreeable-Pick-3650",
          "body": "It’s highly inappropriate for someone who isn’t a very close friend or family member to comment on your body. I’m sorry you’ve dealt with that. Family or friends shouldn’t necessarily either but definitely not an employer or teacher. \n\nAlso interesting viewpoint, most of those with an ed find beauty in everyone except themselves. Sad you see many of those around you that way. However, I know it’s not in your control. I hope you’re able to heal soon.",
          "created_utc": 1715231556.0
        },
        {
          "id": "l38rr6z",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1715232597.0
        }
      ]
    }
  ]
}