{
  "id": "1cpfykh",
  "subreddit": "AnorexiaNervosa",
  "author": "anonymous_xi",
  "created_utc": 1715428999.0,
  "title": "Genuinely jealous of ppl who were born skinny",
  "selftext": "There are ppl who are absolutely underweight and only eating a little ever since they were born, but their body can function perfectly. They don’t have ed. \n\nWhy do I need to do so much to reach the same weight and I have to barely eat nothing and my body is failing. \n\nI’m just jealous…",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1cpfykh/genuinely_jealous_of_ppl_who_were_born_skinny/",
  "score": 283,
  "num_comments": 27,
  "comments": [
    {
      "id": "l3kbtwx",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1715428999.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3kf2am",
      "author": "None",
      "body": "I know a girl like this and she haaaaates it. Hates being super thin, hates people commenting on it. Crazy how some of us kill ourselves to get that thin and others have it naturally and loathe it.",
      "created_utc": 1715430720.0,
      "score": 132,
      "context": []
    },
    {
      "id": "l3kvc1a",
      "author": "MeFloatingDoor",
      "body": "It’s even worse when they’re super skinny but eat a shit load of food. The jealousy is insane",
      "created_utc": 1715438142.0,
      "score": 111,
      "context": []
    },
    {
      "id": "l3m9pch",
      "author": "CupcakeAdditional354",
      "body": "I used to feel like this, but honestly being naturally thin and acquiring thinness via restriction are two very distinct looks. You *will* end up with protruding bones when you starve yourself. \n\nSomeone who is naturally skinny does not look malnourished in any sense of the word. Even if they are a bit bony, it's simply just not the same look, or feel.",
      "created_utc": 1715458216.0,
      "score": 30,
      "context": []
    },
    {
      "id": "l3ln0dy",
      "author": "Lonely-Iron-1038",
      "body": "I was one of those people, still ended up with an eating disorder 🫠 and now that I'm older, I'm in the same boat, like I'm naturally probably smaller, but bc of my ed I literally have to try to stay thin or else I'm bingeing out of control.. so I just restrict instead to stay borderline uw",
      "created_utc": 1715449165.0,
      "score": 28,
      "context": []
    },
    {
      "id": "l3m90pl",
      "author": "igimhere",
      "body": "Having been underweight all my life didn't stop my brain from developing an ed anyway",
      "created_utc": 1715457945.0,
      "score": 16,
      "context": []
    },
    {
      "id": "l3kuhgb",
      "author": "throwawayfishplanet",
      "body": "my siblings…i was always the fat one being put on diets while they were getting extra servings",
      "created_utc": 1715437796.0,
      "score": 34,
      "context": []
    },
    {
      "id": "l3ne2ay",
      "author": "OverlordSheepie",
      "body": "People who think I am naturally skinny don't realize that I intentionally restrict. I feel you 😔",
      "created_utc": 1715474881.0,
      "score": 15,
      "context": []
    },
    {
      "id": "l3l9u8t",
      "author": "alexisseffy",
      "body": "One of my sisters is like this. Always been super tiny naturally and eats whatever she wants. But I only stay at a weight that low via restriction",
      "created_utc": 1715443986.0,
      "score": 25,
      "context": []
    },
    {
      "id": "l3nh0us",
      "author": "U-suck-i-rule-420",
      "body": "I actually used to be like this… everyone around me always commented on how jealous they were of my body and I never tried to keep it a certain way, I ate when I wanted or whatever and I stayed super thin. \n\nthen I got on anxiety medication that made me gain weight and that’s where my ed (AN) all started.",
      "created_utc": 1715476241.0,
      "score": 9,
      "context": []
    },
    {
      "id": "l3np6tf",
      "author": "MechanicBrief7943",
      "body": "I understand the jealousy; but we have to remember that we’re worth more than our body. Our body doesn’t show our personality; people love us for who we are, not for what we look like.",
      "created_utc": 1715480038.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l3llt0y",
      "author": "None",
      "body": "I am like that and never really liked it… ever since i was a child adult commented on my body, judging it, saying i should eat more while i was eating normal even 40 year olds telling 8 year old me they wanted to look like me… that’s confusing as hell\n\nEarly teenage years everyone’s body changed, ass, boobs, hips… i stayed skinny and flat, never outgrew my training bras \n\nAN has always been about control for me, not weight… the losing weight was just a side effect for me but also made me feel good, like if i can’t be like other girls having curves i am gonna do everything to keep any fat off my tummy and legs",
      "created_utc": 1715448678.0,
      "score": 10,
      "context": []
    },
    {
      "id": "l3qxyb5",
      "author": "Sa_Sa_La11",
      "body": " I starve myself I suffer I get ill, I get edema, diarrhea, no energy I can barely stand up and have to take breaks while walking, workout like crazy but still I don’t lose any weight",
      "created_utc": 1715541025.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l3kn6og",
      "author": "2noserings",
      "body": "they can function perfectly for now, but everyone faces the same eventual consequences of malnutrition. hugs 🤍",
      "created_utc": 1715434632.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l3oaar2",
      "author": "lennonbennie",
      "body": "No because my mother is the skinniest mini I know. Always has been. Could not be further from an almond mom, she snacks all day and eats all three meals sometimes even seconds, has dessert too. Never had a gym membership during my lifetime. Any physical activity she does is because she genuinely enjoys it. She’s so petite other woman have asked my moms friends if she’s anorexic like a lot. It’s so hard not to be pissed watching her be so skinny because that’s just how her body is.",
      "created_utc": 1715491550.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l3olzlm",
      "author": "ScottishWidow64",
      "body": "My sister was skinny, could eat 6 meals a day and never put on weight. I was always jealous. Now her metabolism has slowed down and she is quite chubby. She said when she was young the food she ate gave her energy and she was ALWAYS moving around and doing stuff. She is now older and hates that she can’t move as quickly. Vicious circle",
      "created_utc": 1715499887.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l3kinop",
      "author": "None",
      "body": "me too 😕",
      "created_utc": 1715432522.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l3kybnz",
      "author": "starmoonsunSHINE",
      "body": "I agree",
      "created_utc": 1715439363.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l3lgdac",
      "author": "Stitchess__",
      "body": "I was like this up until I was about 12. But my sister is still like this and she’s almost 14 and I’m always like fuckin stfu I hate you 😤",
      "created_utc": 1715446590.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l3ofniz",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1715495211.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l4489cc",
      "author": "None",
      "body": "When I was very active in my ED, my goal was to be less than my little sister. She’s a few years younger than me is a bit taller but much smaller. When I reached that goal I felt better, but only for a short time before I felt like I needed to go even lower.",
      "created_utc": 1715751074.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3l6rft",
      "author": "anonymous_xi",
      "body": "Honestly wanna know what makes their body to be able to function while only eating a little and at a such a low weight… I know there are genetic factors but specially what machaniem is causing this diff :((((",
      "created_utc": 1715442761.0,
      "score": 41,
      "context": [
        {
          "id": "l3kf2am",
          "author": "None",
          "body": "I know a girl like this and she haaaaates it. Hates being super thin, hates people commenting on it. Crazy how some of us kill ourselves to get that thin and others have it naturally and loathe it.",
          "created_utc": 1715430720.0
        }
      ]
    },
    {
      "id": "l3l68xk",
      "author": "anonymous_xi",
      "body": "Exactly, I know they might have poor absorption or sth like that, but medically they are perfectly fine with such a low weight….",
      "created_utc": 1715442558.0,
      "score": 28,
      "context": [
        {
          "id": "l3kvc1a",
          "author": "MeFloatingDoor",
          "body": "It’s even worse when they’re super skinny but eat a shit load of food. The jealousy is insane",
          "created_utc": 1715438142.0
        }
      ]
    },
    {
      "id": "l3l6g4p",
      "author": "anonymous_xi",
      "body": "Hating genes …",
      "created_utc": 1715442638.0,
      "score": 15,
      "context": [
        {
          "id": "l3kuhgb",
          "author": "throwawayfishplanet",
          "body": "my siblings…i was always the fat one being put on diets while they were getting extra servings",
          "created_utc": 1715437796.0
        }
      ]
    },
    {
      "id": "l3oo0pp",
      "author": "gnmpnsi",
      "body": "So real, you described my life with one sentence",
      "created_utc": 1715501445.0,
      "score": 3,
      "context": [
        {
          "id": "l3kuhgb",
          "author": "throwawayfishplanet",
          "body": "my siblings…i was always the fat one being put on diets while they were getting extra servings",
          "created_utc": 1715437796.0
        }
      ]
    },
    {
      "id": "l3ohkpp",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1715496592.0,
      "score": 1,
      "context": [
        {
          "id": "l3ofniz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1715495211.0
        }
      ]
    },
    {
      "id": "l3lwame",
      "author": "throwawayfishplanet",
      "body": "i hate my hater genes",
      "created_utc": 1715452878.0,
      "score": 6,
      "context": [
        {
          "id": "l3kuhgb",
          "author": "throwawayfishplanet",
          "body": "my siblings…i was always the fat one being put on diets while they were getting extra servings",
          "created_utc": 1715437796.0
        },
        {
          "id": "l3l6g4p",
          "author": "anonymous_xi",
          "body": "Hating genes …",
          "created_utc": 1715442638.0
        }
      ]
    }
  ]
}