{
  "id": "1cprj1c",
  "subreddit": "AnorexiaNervosa",
  "author": "AppropriateComplex73",
  "created_utc": 1715462444.0,
  "title": "Drawing Anorexia",
  "selftext": "Hey everyone. I’m an Artist and I’m currently doing a series of drawing disorders.\nFor the next one I want to portray Anorexia.\nBut I want to do it in a way, that doesn’t include lazy cliches like mirrors, scales, apples. And I also don’t want to portray any specific body types because I do not want to add to the misconception that only underweight people have anorexia. Also extreme bodies specifically might be triggering to those who are affected. And the last thing I want to do is to hurt or worsen anyone’s condition. The health of my followers (and people in general) comes first.\n\nSo here is my solution:\nI want to draw a Beautiful, glowing tree that gets chopped down by its dryade. \nAnd I want the dryade to be possessed by some sort of shadowy monster. (I’ll add a picture of the rough sketch.) \n\nBut I want to hear your opinion. Is this a okay way of doing it? Am I missing important aspects? \n\nI would be more than thankful for your help.\n",
  "url": "https://i.redd.it/hcnbfaal6vzc1.jpeg",
  "score": 173,
  "num_comments": 9,
  "comments": [
    {
      "id": "l3mkhb8",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1715462446.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3nb3qw",
      "author": "NutcaseInANutshell",
      "body": "This is such a hauntingly beautiful way to depict anorexia, and I think you did it really well without using any clichés. Oftentimes, I think artists depict anorexia as a mix of wanting to lose weight and extreme body dysmorphia, but I think they don’t understand the aspects of wanting to have control over something in your life, etc. \n\nI think the ‘possession’ part of your drawing perfectly illustrates how our bodies are, in a way, addicted to control, even if it harms us in the end.\n\nThank you for the art.",
      "created_utc": 1715473542.0,
      "score": 27,
      "context": []
    },
    {
      "id": "l3nbe6y",
      "author": "ippopotamusontheroof",
      "body": "This is absolutely amazing! I wonder if the dryade could be growing out of the base of the tree to depict that this destruction ultimately comes from within? I love that it looks afraid and a little possessed, like it is afraid of itself and the harm it’s causing itself… but doesn’t know how to stop.",
      "created_utc": 1715473673.0,
      "score": 15,
      "context": []
    },
    {
      "id": "l3np27l",
      "author": "Little_Messiah",
      "body": "This is making me cry. I desperately need to see the finished picture",
      "created_utc": 1715479977.0,
      "score": 10,
      "context": []
    },
    {
      "id": "l3nxhof",
      "author": "None",
      "body": "I really love how you tried to use unique symbolism instead of tired old tropes! I love it",
      "created_utc": 1715484141.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l3oqdg1",
      "author": "uhhhj_what",
      "body": "Can I use this sketch for inspiration? It's So good",
      "created_utc": 1715503254.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3pr0vz",
      "author": "AGoodKnave",
      "body": "I like this take and creativity. \n\nCould the dryad be covered in a reflective material? Mirrors and reflections are so deeply ingrained in the disorder, both from a literal and metaphorical point. Literal because, obviously, but metaphorical because everything you see, do, hear or experience is somehow a reflection of your worth and ability, which turned inward becomes an extension of the war against yourself: 'If I were X then Y wouldn't happen' etc.",
      "created_utc": 1715524538.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3qok1w",
      "author": "Leaky_Umbrella",
      "body": "I wish I could upvote this more than once",
      "created_utc": 1715537403.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3q3smm",
      "author": "crsstst",
      "body": "I was going to ask the same thing!! it's such gorgeous art I'd love to recreate it in my own style",
      "created_utc": 1715529524.0,
      "score": 1,
      "context": [
        {
          "id": "l3oqdg1",
          "author": "uhhhj_what",
          "body": "Can I use this sketch for inspiration? It's So good",
          "created_utc": 1715503254.0
        }
      ]
    }
  ]
}