{
  "id": "1cxlffa",
  "subreddit": "AnorexiaNervosa",
  "author": "SmallCuriousGirl",
  "created_utc": 1716332393.0,
  "title": "My therapist that specializes in EDs is very noticeably underweight",
  "selftext": "Cannot even explain how flatly suicidal it makes me. I really like her otherwise, but this is the thing that is making me want to drop therapy. She’s supposed to be the best in this field for miles around and if I quit I won’t get any other help. We are the same height, so I KNOW for a fact that she is underweight, to the point that I can make an educated guess on her weight. It is extremely unambiguous. Weight distribution, muscle mass, it’s all moot here. She wears skin tight, body hugging dresses and there’s no question about it. I’m not underweight and I don’t want to talk about my food stuff with her because I can’t get past how she obviously restricts too but isn’t allowed to confirm that. She isn’t battling any other illness that would cause her to lose weight, cancer treatments, insulin resistance, etc. I hate the thought of her privately gloating over her tiny size while I’ve been binging for months following a wave of reactive eating and extreme hunger. She’s seeing me in real time put on dozens of pounds while she daintily perches her tiny body on a sofa across from me. \n\n\nI just feel like an idiot. I hate this. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1cxlffa/my_therapist_that_specializes_in_eds_is_very/",
  "score": 234,
  "num_comments": 51,
  "comments": [
    {
      "id": "l53asyz",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1716332393.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l543w0k",
      "author": "Informal-Ad-7356",
      "body": "I would get another provider.  It's really about what's good for your Recovery.   Do what makes it easier to heal.",
      "created_utc": 1716344599.0,
      "score": 130,
      "context": []
    },
    {
      "id": "l53wox6",
      "author": "rzpc0717",
      "body": "I know an ED therapist who actively engages in restriction and also the flaunting behavior you describe, with the tight clothes and showing off her size. I know it’s best to give grace and the benefit of the doubt, but I do think there comes a point where it’s just not ethical for someone with an active ED to hold themselves out as a therapist. Your post makes it clear that such behavior can be damaging. Please find yourself a different provider!",
      "created_utc": 1716341562.0,
      "score": 205,
      "context": []
    },
    {
      "id": "l55jmu8",
      "author": "None",
      "body": "my ED therapist in hospital was also like this, all the patients hated their 1-1 therapy because she was triggering af",
      "created_utc": 1716376222.0,
      "score": 33,
      "context": []
    },
    {
      "id": "l54a63d",
      "author": "ReflectionThin5574",
      "body": "I definitely have feelings towards my therapist. She is bordering the underweight category. But we have had discussions about it and she is very open about it; she had her own disorder in the past and it gave her complications (she is fully recovered now.) Address the elephant in the room.",
      "created_utc": 1716347248.0,
      "score": 41,
      "context": []
    },
    {
      "id": "l55mqjp",
      "author": "nnushk",
      "body": "This reminds me of those two twin sisters from uk,  who are both doctors, but also both have instagram accounts, and tiktok accounts, where they show off how severely underweight they are, body checking to extremes but imagine that person showing up at your appt to discuss your ed...\nI would literally get up and leave...but they claim they are trying to ,,recover,, \nIt's beyond disturbing ...",
      "created_utc": 1716377887.0,
      "score": 14,
      "context": []
    },
    {
      "id": "l54uz31",
      "author": "Excellent-World-476",
      "body": "You need to say this to her. She is trained to have such discussions.",
      "created_utc": 1716358799.0,
      "score": 37,
      "context": []
    },
    {
      "id": "l549p64",
      "author": "Queenofwands1212",
      "body": "Did you say anything to her about it? I would totally tell her that her underweight body is triggering me.\nI’d love to know her response to that. She’s working in a field full of very impressionable fragile people. It’s very bizarre to be noticely underweight and have an Ed and work with anorexic patients. It’s just not right",
      "created_utc": 1716347039.0,
      "score": 53,
      "context": []
    },
    {
      "id": "l58vfc3",
      "author": "1008261",
      "body": "How do you know she isn’t battling any other illness? I have a friend with severe GI issues. No matter how hard she tries, she can’t bring herself to a healthy weight. She wants more than anything to be a normal, healthy weight but her health condition doesn’t allow that. \n\nDoes your therapist talk about her GI patterns with you? Probably not. I wouldn’t assume anything here. Talk to your therapist about it, maybe do zoom sessions instead.",
      "created_utc": 1716420320.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l54dnyp",
      "author": "slynne28",
      "body": "You are not an idiot, it is ok that these thoughts have come up, comparison and pre-occupation with body image/size, and the size/habits of others are natural points for us to focus on when we have an ed. So forgive yourself first for having these thoughts.\n\nI'd say you have 2 options; either share with her that you feel uncomfortable discussing food with her or find another therapist.  If she asks why? let her know that it is because you find it difficult to get past the fact that she is very petite herself. If you want a respectful way to frame this, go in with \"I\" statements, and explain why you are feeling uncomfortable.. make it about your thoughts/feelings about your recovery and the therapy process, that is not overstepping, that is what you are there for.--- and if she really is a good therapist, she should be able to talk through this with you in a positive manner for your recovery and will help you move forward with the process. You don't have to ask about her weight or habits, and she is not obligated to share them with you, but you can tell her you notice she is small for her frame and that brings up negative feelings about your own recovery and body changes.\n\nIts possible shes naturally that slim, its also possible she is not. I honestly wouldn't be wholly shocked if she has had her own issues with food, people in health care and therapists are not immune to having their own issues, and it may even be an asset for her- she has a unique insight into eds if she has suffered with one herself.\n\nIf you really don't see this as something you can reframe or work through with her, then find someone else. She might be the best or most perfect therapist for someone else, but maybe she isn't the right practitioner for you. That's not a terrible thing, but just be sure you line up some possibilities first, and test them out, don't let the ed win by allowing you to stop when you're getting through some of the most difficult parts of recovery.",
      "created_utc": 1716348896.0,
      "score": 10,
      "context": []
    },
    {
      "id": "l53k5mm",
      "author": "Old-Friendship9613",
      "body": "I'm so sorry you're struggling. You have the right to feel upset and it makes sense this would stir up lots of feelings for you. But I want to gently remind you that her appearance alone doesn't necessarily mean she has an ED herself, there could be other explanations even if it doesn't seem that way. Either way though, projecting feelings onto her private experiences is ultimately unproductive for your recovery. I think you should try to express these concerns to her! \n\nNo matter what you decide to do though, your recovery has to remain the top priority. Please don't give up on getting the support you need and deserve, even if it means exploring other routes of care!! Hang in there.",
      "created_utc": 1716336275.0,
      "score": 21,
      "context": []
    },
    {
      "id": "l544tpq",
      "author": "thisisnotawar",
      "body": "It’s possible that your perception of her is accurate, but it’s also possible that there’s more going on than you realize - while I do have anorexia, the primary reason I’m underweight is that I have cancer and IBD. But if you didn’t know that, you’d assume I was just restricting. Point being, you assuming that she has an ED and is gloating etc. is entirely projection, and not based in fact. \n\nI think your two main options here are to find a new therapist or, if possible and if you think it would be better, continue to see this one by telehealth where you don’t have to see her body.",
      "created_utc": 1716344997.0,
      "score": 23,
      "context": []
    },
    {
      "id": "l55vt4v",
      "author": "leeleechron",
      "body": "How can you be sure that she doesn’t have any issues that affect her weight? Did you speak to her about this? \n\nIf time with her is hurting you more than helping you, in the end it would be better to find a different provider.",
      "created_utc": 1716382175.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l580hlt",
      "author": "User564368",
      "body": "Most ED specific nutritionists and therapists that I’ve met have history of EDs.",
      "created_utc": 1716408922.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l55e1ry",
      "author": "mirandalsh",
      "body": "Can I very gently suggest that your ed may be influencing your view of your therapist? She may truely be uw, but ed can play tricks on the mind too.",
      "created_utc": 1716372796.0,
      "score": 9,
      "context": []
    },
    {
      "id": "l53hcam",
      "author": "Melodramatic-anon876",
      "body": "It sounds like you are really struggling with your body image and you are directing your emotional response at your therapist. I can imagine it’s very hard to not compare yourself to someone in this heightened body image distress and that is leading to these negative opinions of yourself and your therapist. \n\nUltimately, therapy only helps if you can be open with your therapist so it could be good to share these feelings to see if you can work through them or if another provider is more appropriate. Please reach out to someone immediately for your suicidality.",
      "created_utc": 1716335066.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l56465m",
      "author": "felixfoxbody",
      "body": "you don’t have to have therapy that is restricted to your area! there are therapists online through places like better help or grow therapy where you can find providers who specialize in eating disorders as well as other conditions. if you can access reddit, you can access online therapy! if you have insurance, it can be a low or free copay. i pay about $35 a session. my therapist lives 8 hours away from me, but she also specializes in eating disorders and has experience in ED inpatient and outpatient. \n\ni hope you don’t feel like you have to be stuck with this therapist. i 100% understand why you don’t want therapy for your eating disorder from someone who is underweight and visibly disordered themselves, especially if you struggle with binging. hell i see people in real life who are underweight and i get triggered (but that’s my problem).",
      "created_utc": 1716385601.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l56bqgr",
      "author": "musingsofamdc",
      "body": "So I had a very similar experience in treatment. My first therapist and psych were very slim, and a few of the other staff were, tho the rest were a variety of bodies. It bothered me at first, but it wore off pretty quickly for me. I’d say maybe give it a shot, but if that feeling doesn’t go away, then maybe it’s time to look for another",
      "created_utc": 1716388410.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l57qek0",
      "author": "QuietObsessions",
      "body": "Wow this is so similar to something I experienced inpatient. A new social worker that joined the team was noticeably underweight and would actually refuse to eat with us at meal times and it really upset most of the patients. I was discharged pretty shortly after she joined the team so I don’t know what happened or if she still works there but yeah",
      "created_utc": 1716405510.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l57wwmw",
      "author": "Typical_Towel_3102",
      "body": "Hey! I’m really sorry you are going through this. I am in a similar situation as I am struggling with an ED and my therapist is noticeably underweight. The difference is she does not flaunt her body and wears baggy clothing so during our sessions I often forget about it. I fully believe that you need to find a new therapist in order to support your journey. You do not need to be like her. The truth is, if she is purposely wearing clothing that exposes her sick body, she is not really the best in the field. I am sorry that you have been made to believe that that is okay. It is not. You deserve better. You deserve recovery. And you deserve to not be feel insecure or reminded of your sickness during therapy sessions. Please take care of yourself, and I hope you find the help you need.",
      "created_utc": 1716407695.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l560xn8",
      "author": "savannahruns",
      "body": "Honestly I think you should find a new therapist but have a termination session with her (or at least a good email) and let her know explicitly what is so obvious to you and how it’s hurt you and hindered your work. Then go process this mind fuck with a different therapist. That’s honestly kind of traumatic.. it’s like growing up with a mom who has anorexia while you also have anorexia and the mom participating in planning your care while the rest of the treatment team is like “obviously mom has a problem, but daughter is the patient, so…”",
      "created_utc": 1716384319.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l5547p4",
      "author": "That_Agent1983",
      "body": "I understand you. And it's not good. I mean if you feel like she has an eating disorder herself and she doesnt help you then please switch.",
      "created_utc": 1716365449.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l57n9v7",
      "author": "amski_gp",
      "body": "Change providers babe. 💕 I also have trouble finding local ED therapists, telehealth into the largest city in your staye.  There’s tons of postings on psychology today.\n\nIt’s not appropriate.  She should be not wearing clothing like that, she knows what she’s doing.",
      "created_utc": 1716404448.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l58q3ax",
      "author": "ScubaGurrl00",
      "body": "I had kind of the opposite problem when I was trying to find a good therapist for my own ED. I was dealing with a restrictive eating disorder, and I started seeing a new therapist, who must have been upwards of 400 pounds. Not only was I honestly terrified that I would end up looking like her if I recovered from my ED, but I also didn’t feel comfortable talking to a person of her stature about my restrictive eating disorder, especially since I was underweight. She ended up dropping me as a client after I ended up in the hospital for an attempt on my life, but I moved on and tried other therapists and eventually found one that I really connect with and feel comfortable confiding in and talking to.\n\nYour relationship with your therapist should be one in which you’re comfortable talking, and you are able to get the help you need. Ultimately you are in therapy for your own benefit, and if you have a problem with your therapist or simply don’t connect, there’s plenty of therapists out there. I think it would be worth a try to switch therapists, and see if working with someone else is better for your mental health.\n\nBest of luck and I hope you find a provider that is able to better fit your needs! 💗",
      "created_utc": 1716418158.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l5c1k1e",
      "author": "clementineshats",
      "body": "when i was in inpatient my dietician would lecture me on my weight and tell me my ‘normal’ weight was too low and she put a lot of extra weight on me. both the dieticians in the inpatient ward i was in were skinny and it used to piss me off so bad because how are you telling me that my weights too low and that i need to gain weight whenever your thin yourself? like what? hypocrisy mhch?",
      "created_utc": 1716477605.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l5hytgs",
      "author": "MeaningNew133",
      "body": "this is exactly how the therapist/runner of my ed residential was. she was eat “ed foods” in front of us and then watch us eat while she wasn’t eating. it was so bad. a few months later the rtc was closed tho due to malpractice",
      "created_utc": 1716571502.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l5jket0",
      "author": "Graciebell_UwU",
      "body": "She most likely got in the field of this specific study because it’s something she relates to and doesn’t realize she’s hurting people, I completely understand how triggering engaging with someone who struggles with the same thing can be and best thing to do is be honest with her and get a different therapist because you need to do what helps you at the end of the day",
      "created_utc": 1716593595.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lso1bg7",
      "author": "LeastPay0",
      "body": "How do you know what she has or hasn't got? How do you know what kind of medical history she has?. You don't. So don't assume anything of others. I'm sure if she was suffering from anything they wouldn't allow her to continue practicing especially with the field of work she's in!!!! Some folks are naturally petite and thin. It's called genetics. If she triggers you then seek alternative help from elsewhere or voice your complaints to the higher ups!!.",
      "created_utc": 1729335144.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l54mzuj",
      "author": "None",
      "body": "i’ve been in the same boat before. had an assigned dietician in my php program who was pretty thin and even though she was nice i hated her for being thin and making me (a freshly weight restored anorexic) eat as much as i had to while she got to stay small. it made it extremely difficult to talk to her because i know for a fact she’s never had to live overweight like i had and i felt had no business trying to tell me what to do. for the time being, find a different provider and one that you feel comfortable talking to first. that’s the most important part",
      "created_utc": 1716353843.0,
      "score": 0,
      "context": []
    },
    {
      "id": "l54ws8v",
      "author": "lilac_rainfall10",
      "body": "In this situation, you're completely valid for feeling this way especially since it's so blatant even reading it. In the end, you have to do what you feel is best for recovery.\n\nAnother thing I have to add to that and I tell everyone and my friends is that you never really know or have an understanding to make you feel better unless you confront them. Yes, it can be scary, but you truly never know till you speak up. It's something to practice- speaking up, but it gets easier and you'll find that the way they react will say a lot about them, so long as you approach it appropriately and in a calm manner. \n\nYou deserve to have understanding and you deserve what's good for you. I hope you find a better provider, it seems like people with eating disorders want to specialize in eating disorders because it's the thing they know best. I wish you the best.\n✨💞💕",
      "created_utc": 1716360035.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l59efk4",
      "author": "dogsandcatslol",
      "body": "honestly it could just be your ed being like omg she is so skinny but if it is actually causing a problem just get another therapist or try to bring it up with her",
      "created_utc": 1716428129.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l55qu3v",
      "author": "Replacement98765",
      "body": "She could have a running disorder.\nAsk her about it. She might be the best person to help you.",
      "created_utc": 1716379919.0,
      "score": -1,
      "context": []
    },
    {
      "id": "l54x5z6",
      "author": "None",
      "body": "Maybe she knows how tough it is and wants to be there for people who are going through the same thing or maybe she got into this profession to have more knowledge on herself",
      "created_utc": 1716360297.0,
      "score": -8,
      "context": []
    },
    {
      "id": "l5a3omj",
      "author": "I_hate_me_lol",
      "body": "i don't mean this in an accusatory way at all: how do you know she's not battling any other illness? she very could be not self-disclosing as she is a therapist.",
      "created_utc": 1716439540.0,
      "score": 0,
      "context": []
    },
    {
      "id": "l57acfu",
      "author": "norishhhh",
      "body": "oh my gosh same. do they get satisfaction working in the field when they know they still restrict or what?",
      "created_utc": 1716400130.0,
      "score": -3,
      "context": []
    },
    {
      "id": "l53xfq4",
      "author": "SmallCuriousGirl",
      "body": "I really appreciate this. I want to give the benefit of the doubt to her so badly, but it seems so blatant that I can’t ignore it if I wanted to.",
      "created_utc": 1716341880.0,
      "score": 44,
      "context": [
        {
          "id": "l53wox6",
          "author": "rzpc0717",
          "body": "I know an ED therapist who actively engages in restriction and also the flaunting behavior you describe, with the tight clothes and showing off her size. I know it’s best to give grace and the benefit of the doubt, but I do think there comes a point where it’s just not ethical for someone with an active ED to hold themselves out as a therapist. Your post makes it clear that such behavior can be damaging. Please find yourself a different provider!",
          "created_utc": 1716341562.0
        }
      ]
    },
    {
      "id": "mgzbs1g",
      "author": "HarkSaidHarold",
      "body": "I know I'm super late to the thread, but did anyone else on the medical team acknowledge this?! I can't imagine how damaging she would be to me at my worst point.",
      "created_utc": 1741586392.0,
      "score": 1,
      "context": [
        {
          "id": "l55jmu8",
          "author": "None",
          "body": "my ED therapist in hospital was also like this, all the patients hated their 1-1 therapy because she was triggering af",
          "created_utc": 1716376222.0
        }
      ]
    },
    {
      "id": "l5a7w03",
      "author": "helianthus_0",
      "body": "I think I know whore you’re talking about. One posts a lot of selfies of her face? I know they have MDs but do they actually *work* as doctors? They seem too sick to hold down jobs.",
      "created_utc": 1716442007.0,
      "score": 1,
      "context": [
        {
          "id": "l55mqjp",
          "author": "nnushk",
          "body": "This reminds me of those two twin sisters from uk,  who are both doctors, but also both have instagram accounts, and tiktok accounts, where they show off how severely underweight they are, body checking to extremes but imagine that person showing up at your appt to discuss your ed...\nI would literally get up and leave...but they claim they are trying to ,,recover,, \nIt's beyond disturbing ...",
          "created_utc": 1716377887.0
        }
      ]
    },
    {
      "id": "l55fsyg",
      "author": "None",
      "body": "While yes, we are trained to have those discussions, we are also trained to help patients seek the most appropriate form of help for them, and sometimes it's just not you! \n\nI don't think OP needs to try to resolve this necessarily, it's enough that it's made them feel uncomfortable. It is an interesting choice to wear such body-hugging clothes, considering her field. I personally would very much appreciate kind, constructive feedback if one of my patients felt similarly. \n\nIt's perfectly appropriate to discuss it in person, but an email after you change therapists is also a great option.",
      "created_utc": 1716373954.0,
      "score": 17,
      "context": [
        {
          "id": "l54uz31",
          "author": "Excellent-World-476",
          "body": "You need to say this to her. She is trained to have such discussions.",
          "created_utc": 1716358799.0
        }
      ]
    },
    {
      "id": "l54ayqs",
      "author": "SmallCuriousGirl",
      "body": "What’s a way you recommend I can ask her without overstepping? It’s definitely not a case where I’m distorting her based off my own insecurities, she is rail thin and the smallest waist and I feel so mean for fixating on it but even my mom who met her had remarked beforehand that she’s the tiniest person she’s ever met. Do I bluntly ask if she has an ED? I think I may have asked in a roundabout way, like “If you have such a healthy relationship with food, how do you maintain your figure?” We’re both four foot ten and there is no part of me that can believe that she doesn’t restrict. She was vague in replying and redirected the conversation to me after a generic, “I eat all of the time, I love food teehee!” Ugh I’m so fake idk.",
      "created_utc": 1716347610.0,
      "score": 28,
      "context": [
        {
          "id": "l549p64",
          "author": "Queenofwands1212",
          "body": "Did you say anything to her about it? I would totally tell her that her underweight body is triggering me.\nI’d love to know her response to that. She’s working in a field full of very impressionable fragile people. It’s very bizarre to be noticely underweight and have an Ed and work with anorexic patients. It’s just not right",
          "created_utc": 1716347039.0
        }
      ]
    },
    {
      "id": "l54t98y",
      "author": "Agreeable-Pick-3650",
      "body": "This!!! Assumptions based on someone’s body is ignorant & disrespectful even if OP didn’t have ill intentions. Being skinny doesn’t mean someone under-eats just like how someone overweight doesn’t mean they can’t struggle with an eating disorder.  Anyway good advice. 👍",
      "created_utc": 1716357679.0,
      "score": 4,
      "context": [
        {
          "id": "l544tpq",
          "author": "thisisnotawar",
          "body": "It’s possible that your perception of her is accurate, but it’s also possible that there’s more going on than you realize - while I do have anorexia, the primary reason I’m underweight is that I have cancer and IBD. But if you didn’t know that, you’d assume I was just restricting. Point being, you assuming that she has an ED and is gloating etc. is entirely projection, and not based in fact. \n\nI think your two main options here are to find a new therapist or, if possible and if you think it would be better, continue to see this one by telehealth where you don’t have to see her body.",
          "created_utc": 1716344997.0
        }
      ]
    },
    {
      "id": "mxtcivp",
      "author": "Marryyourcat",
      "body": "Exactly. That's how they get into it. So I assume that they are recovered?",
      "created_utc": 1749940018.0,
      "score": 1,
      "context": [
        {
          "id": "l580hlt",
          "author": "User564368",
          "body": "Most ED specific nutritionists and therapists that I’ve met have history of EDs.",
          "created_utc": 1716408922.0
        }
      ]
    },
    {
      "id": "mxtcll9",
      "author": "Marryyourcat",
      "body": "Actually not so people with EDS can spot each other even an unconscious level and Trigger each other",
      "created_utc": 1749940045.0,
      "score": 0,
      "context": [
        {
          "id": "l55e1ry",
          "author": "mirandalsh",
          "body": "Can I very gently suggest that your ed may be influencing your view of your therapist? She may truely be uw, but ed can play tricks on the mind too.",
          "created_utc": 1716372796.0
        }
      ]
    },
    {
      "id": "mxtcorg",
      "author": "Marryyourcat",
      "body": "I agree",
      "created_utc": 1749940077.0,
      "score": 1,
      "context": [
        {
          "id": "l560xn8",
          "author": "savannahruns",
          "body": "Honestly I think you should find a new therapist but have a termination session with her (or at least a good email) and let her know explicitly what is so obvious to you and how it’s hurt you and hindered your work. Then go process this mind fuck with a different therapist. That’s honestly kind of traumatic.. it’s like growing up with a mom who has anorexia while you also have anorexia and the mom participating in planning your care while the rest of the treatment team is like “obviously mom has a problem, but daughter is the patient, so…”",
          "created_utc": 1716384319.0
        }
      ]
    },
    {
      "id": "l550xya",
      "author": "SignificanceDizzy674",
      "body": "Ethically I don’t think that’s a thing a therapist should do though. If it is an ED, the therapist needs to be well enough and recovered enough to support others or she needs to take some time off because being a therapist shouldn’t be about learning about yourself and your issues when you’re a professional paid to support other people. By the time you’re taking on clients, you should have done the majority of that mental work and though things can come up and be triggering along the way, it should always be something you’re actively aware of and working on in supervision. I think the main focus should be supporting clients.\n\nI’m not saying that isn’t what OP’s therapist is already doing btw but I think they need to have a frank conversation because regardless of the reason for the therapist being UW, it’s a trigger for OP and they have to be able to discuss it.",
      "created_utc": 1716362991.0,
      "score": 8,
      "context": [
        {
          "id": "l54x5z6",
          "author": "None",
          "body": "Maybe she knows how tough it is and wants to be there for people who are going through the same thing or maybe she got into this profession to have more knowledge on herself",
          "created_utc": 1716360297.0
        }
      ]
    },
    {
      "id": "l5bp2ne",
      "author": "Sick_Nuggets_69",
      "body": "You can empathize with someone while also being realistic and understanding that your needs have to come first. If this is an issue to the point that you’re feeling uncomfortable disclosing things to your therapist, then you need to figure something out. Either by bringing this up to her directly and/or finding a new therapist. Your recovery is what’s important here. And it’s okay to find a new therapist when the one you’re seeing isn’t helping you anymore.",
      "created_utc": 1716473139.0,
      "score": 6,
      "context": [
        {
          "id": "l53wox6",
          "author": "rzpc0717",
          "body": "I know an ED therapist who actively engages in restriction and also the flaunting behavior you describe, with the tight clothes and showing off her size. I know it’s best to give grace and the benefit of the doubt, but I do think there comes a point where it’s just not ethical for someone with an active ED to hold themselves out as a therapist. Your post makes it clear that such behavior can be damaging. Please find yourself a different provider!",
          "created_utc": 1716341562.0
        },
        {
          "id": "l53xfq4",
          "author": "SmallCuriousGirl",
          "body": "I really appreciate this. I want to give the benefit of the doubt to her so badly, but it seems so blatant that I can’t ignore it if I wanted to.",
          "created_utc": 1716341880.0
        }
      ]
    },
    {
      "id": "l54ww57",
      "author": "Queenofwands1212",
      "body": "Nothing is over stepping in my opinion. I would literally tell her that the fact that she looks like she has anoreixa herself is really triggering to you. It’s confusing and it’s affecting you. I told my Ed primary care dr that she is underweight and it’s kind of triggering to have a dr who is also underweight and working with anorexic patients. They need to be called out. If it affects you I’m sure there are 20 others it affectd as well",
      "created_utc": 1716360109.0,
      "score": 52,
      "context": [
        {
          "id": "l549p64",
          "author": "Queenofwands1212",
          "body": "Did you say anything to her about it? I would totally tell her that her underweight body is triggering me.\nI’d love to know her response to that. She’s working in a field full of very impressionable fragile people. It’s very bizarre to be noticely underweight and have an Ed and work with anorexic patients. It’s just not right",
          "created_utc": 1716347039.0
        },
        {
          "id": "l54ayqs",
          "author": "SmallCuriousGirl",
          "body": "What’s a way you recommend I can ask her without overstepping? It’s definitely not a case where I’m distorting her based off my own insecurities, she is rail thin and the smallest waist and I feel so mean for fixating on it but even my mom who met her had remarked beforehand that she’s the tiniest person she’s ever met. Do I bluntly ask if she has an ED? I think I may have asked in a roundabout way, like “If you have such a healthy relationship with food, how do you maintain your figure?” We’re both four foot ten and there is no part of me that can believe that she doesn’t restrict. She was vague in replying and redirected the conversation to me after a generic, “I eat all of the time, I love food teehee!” Ugh I’m so fake idk.",
          "created_utc": 1716347610.0
        }
      ]
    },
    {
      "id": "l55hjsi",
      "author": "None",
      "body": "Queenofwands is right - your therapists job is to focus on you. If you try to ask her in this way, she will always redirect, and it's her job to. \n\nI think you need to figure out what you want here. If you want to just get a new therapist go for it, you can email her later or let her know in your last session. If you want to talk to her about it, it's perfectly appropriate to say \"Hey, I don't want to make you uncomfortable, but your figure is obviously very tiny and I'm finding it really triggering.\" \n\nObviously it's not appropriate to expect her to change, that's really an issue for her to consider separately. But you make her sound like she is highly recommended so if  you think you can work past the discomfort it may be worth having the conversation. Definitely do not just say nothing and try to deal with it! What you're feeling is totally valid, and most people would think twice if their therapist looked chronically unwell.",
      "created_utc": 1716375017.0,
      "score": 14,
      "context": [
        {
          "id": "l549p64",
          "author": "Queenofwands1212",
          "body": "Did you say anything to her about it? I would totally tell her that her underweight body is triggering me.\nI’d love to know her response to that. She’s working in a field full of very impressionable fragile people. It’s very bizarre to be noticely underweight and have an Ed and work with anorexic patients. It’s just not right",
          "created_utc": 1716347039.0
        },
        {
          "id": "l54ayqs",
          "author": "SmallCuriousGirl",
          "body": "What’s a way you recommend I can ask her without overstepping? It’s definitely not a case where I’m distorting her based off my own insecurities, she is rail thin and the smallest waist and I feel so mean for fixating on it but even my mom who met her had remarked beforehand that she’s the tiniest person she’s ever met. Do I bluntly ask if she has an ED? I think I may have asked in a roundabout way, like “If you have such a healthy relationship with food, how do you maintain your figure?” We’re both four foot ten and there is no part of me that can believe that she doesn’t restrict. She was vague in replying and redirected the conversation to me after a generic, “I eat all of the time, I love food teehee!” Ugh I’m so fake idk.",
          "created_utc": 1716347610.0
        }
      ]
    },
    {
      "id": "l56owr4",
      "author": "choccycatmilk",
      "body": "She doesn’t owe anyone an explanation of her weight BUT she is a therapist specializing in eating disorders and therefore well aware of the disordered and obsessive thought patterns and the competitiveness of theses disorders. It is her responsibility as the professional to consider how her behavior might affect her clients. Choosing to wear very tight clothes when being visibly underweight is questionable at least.",
      "created_utc": 1716392959.0,
      "score": 6,
      "context": [
        {
          "id": "l544tpq",
          "author": "thisisnotawar",
          "body": "It’s possible that your perception of her is accurate, but it’s also possible that there’s more going on than you realize - while I do have anorexia, the primary reason I’m underweight is that I have cancer and IBD. But if you didn’t know that, you’d assume I was just restricting. Point being, you assuming that she has an ED and is gloating etc. is entirely projection, and not based in fact. \n\nI think your two main options here are to find a new therapist or, if possible and if you think it would be better, continue to see this one by telehealth where you don’t have to see her body.",
          "created_utc": 1716344997.0
        },
        {
          "id": "l54t98y",
          "author": "Agreeable-Pick-3650",
          "body": "This!!! Assumptions based on someone’s body is ignorant & disrespectful even if OP didn’t have ill intentions. Being skinny doesn’t mean someone under-eats just like how someone overweight doesn’t mean they can’t struggle with an eating disorder.  Anyway good advice. 👍",
          "created_utc": 1716357679.0
        }
      ]
    },
    {
      "id": "l57ijt4",
      "author": "-maru",
      "body": "How did your GP respond to you pointing out that their visibly underweight body is triggering for AN pts? I'm finding myself in a similar position with nurse practitioner in the IOP program that I'm in; she looks unhealthy and wears clothes that emphasize her thinness (skinny jeans, tight tees with exposed collarbones...). It drives me nuts when she *pontificates* about regular eating, \"appropriate\" body mass, and how I need to \"do better and increase volume\" lol.",
      "created_utc": 1716402869.0,
      "score": 8,
      "context": [
        {
          "id": "l549p64",
          "author": "Queenofwands1212",
          "body": "Did you say anything to her about it? I would totally tell her that her underweight body is triggering me.\nI’d love to know her response to that. She’s working in a field full of very impressionable fragile people. It’s very bizarre to be noticely underweight and have an Ed and work with anorexic patients. It’s just not right",
          "created_utc": 1716347039.0
        },
        {
          "id": "l54ayqs",
          "author": "SmallCuriousGirl",
          "body": "What’s a way you recommend I can ask her without overstepping? It’s definitely not a case where I’m distorting her based off my own insecurities, she is rail thin and the smallest waist and I feel so mean for fixating on it but even my mom who met her had remarked beforehand that she’s the tiniest person she’s ever met. Do I bluntly ask if she has an ED? I think I may have asked in a roundabout way, like “If you have such a healthy relationship with food, how do you maintain your figure?” We’re both four foot ten and there is no part of me that can believe that she doesn’t restrict. She was vague in replying and redirected the conversation to me after a generic, “I eat all of the time, I love food teehee!” Ugh I’m so fake idk.",
          "created_utc": 1716347610.0
        },
        {
          "id": "l54ww57",
          "author": "Queenofwands1212",
          "body": "Nothing is over stepping in my opinion. I would literally tell her that the fact that she looks like she has anoreixa herself is really triggering to you. It’s confusing and it’s affecting you. I told my Ed primary care dr that she is underweight and it’s kind of triggering to have a dr who is also underweight and working with anorexic patients. They need to be called out. If it affects you I’m sure there are 20 others it affectd as well",
          "created_utc": 1716360109.0
        }
      ]
    },
    {
      "id": "l56uadv",
      "author": "Agreeable-Pick-3650",
      "body": "Regardless, I was uncomfortable with OP stating it’s “obvious” she has an eating disorder. Sounds like jealousy that she happens to be thinner than them. We don’t know if she has one. \n\nAlso the “she isn’t battling any other illness” made me uncomfortable. Idk how op would know that. \n\nBut, yeah that is fair! It is odd to wear tight clothing as a skinny woman working within that field.",
      "created_utc": 1716394780.0,
      "score": 9,
      "context": [
        {
          "id": "l544tpq",
          "author": "thisisnotawar",
          "body": "It’s possible that your perception of her is accurate, but it’s also possible that there’s more going on than you realize - while I do have anorexia, the primary reason I’m underweight is that I have cancer and IBD. But if you didn’t know that, you’d assume I was just restricting. Point being, you assuming that she has an ED and is gloating etc. is entirely projection, and not based in fact. \n\nI think your two main options here are to find a new therapist or, if possible and if you think it would be better, continue to see this one by telehealth where you don’t have to see her body.",
          "created_utc": 1716344997.0
        },
        {
          "id": "l54t98y",
          "author": "Agreeable-Pick-3650",
          "body": "This!!! Assumptions based on someone’s body is ignorant & disrespectful even if OP didn’t have ill intentions. Being skinny doesn’t mean someone under-eats just like how someone overweight doesn’t mean they can’t struggle with an eating disorder.  Anyway good advice. 👍",
          "created_utc": 1716357679.0
        },
        {
          "id": "l56owr4",
          "author": "choccycatmilk",
          "body": "She doesn’t owe anyone an explanation of her weight BUT she is a therapist specializing in eating disorders and therefore well aware of the disordered and obsessive thought patterns and the competitiveness of theses disorders. It is her responsibility as the professional to consider how her behavior might affect her clients. Choosing to wear very tight clothes when being visibly underweight is questionable at least.",
          "created_utc": 1716392959.0
        }
      ]
    }
  ]
}