{
  "id": "1d68t0d",
  "subreddit": "AnorexiaNervosa",
  "author": "ThrowRAtays",
  "created_utc": 1717317458.0,
  "title": "opening up about ana and suddenly everyone’s anorexic",
  "selftext": "I hate hate hate when I build up the courage to tell someone I am struggling with anorexia and suddenly they are anorexic too because of that one time they went on a diet for a month. People throw around the term anorexia so loosely, it might’ve been disordered eating but that ≠ anorexia and it feels so invalidating when everyone reckons they had an ed.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1d68t0d/opening_up_about_ana_and_suddenly_everyones/",
  "score": 455,
  "num_comments": 97,
  "comments": [
    {
      "id": "l6qqqgc",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1717317458.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6rzlph",
      "author": "catsTXn420",
      "body": "I have OCD, it's like when I tell somebody about it all the sudden they too have it. 🙄 I feel your posting.",
      "created_utc": 1717341838.0,
      "score": 92,
      "context": []
    },
    {
      "id": "l6r94t5",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1717330159.0,
      "score": 85,
      "context": []
    },
    {
      "id": "l6rcv0m",
      "author": "CinnamonToast_7",
      "body": "Same. Im not anorexic but i have a binge eating disorder and no one takes that seriously either. They always bring up that one time they ate too much at thanksgiving or how they had a few more snacks than usual the other week and no attempt of me trying to explain why it’s considered an actual eating disorder makes them realize.",
      "created_utc": 1717332149.0,
      "score": 126,
      "context": []
    },
    {
      "id": "l6scj5g",
      "author": "None",
      "body": "This is why I hate Meghan Trainor who bragged about “trying anorexia” and it not being for her. Like ok you dumb bitch.",
      "created_utc": 1717346734.0,
      "score": 120,
      "context": []
    },
    {
      "id": "l6sr4cv",
      "author": "musictakemeawayy",
      "body": "OMG also when people say they “wish” they had anorexia/ED or something i’m like… am i in upside down clown town?! you WANT the most fatal mental illness that ruins your body forever. um, why?!?!",
      "created_utc": 1717352105.0,
      "score": 35,
      "context": []
    },
    {
      "id": "l6sl5vz",
      "author": "ThrowRAtays",
      "body": "may have worded this badly but this is a vent post about some very specific people in my life 😭🙏 I wouldn’t ever want to invalidate someone’s struggles and a lot of yall are taking this the wrong way, it’s a vent post about people I personally know, not about you \n\nalso i’m 15 it’s a bit weird that some of you have taken this personally and dmd me nasty stuff, im not gonna respond 😭",
      "created_utc": 1717349934.0,
      "score": 20,
      "context": []
    },
    {
      "id": "l6r2xgn",
      "author": "adumbledorablee",
      "body": "Big time this. I opened up to some of my close coworkers and all of a sudden one had an eating disorder and the other “downplayed” symptoms like dizziness and heart rate issues to “oh haha I have those too” (which, she does bc she has POTS). But they alle treated it like “what you’re doing is TOTALLY normal” instead of one of the most deadly mental illnesses so I guess 🤷🏻‍♀️ never doing that again and stay 🫠weird with food🫠",
      "created_utc": 1717326429.0,
      "score": 57,
      "context": []
    },
    {
      "id": "l6sk2z8",
      "author": "twiggykeely",
      "body": "I feel like the casual use and massive promoting of Ozempic has made this SO MUCH WORSE. Yesterday I literally had a girl tell me \"Oh my God. I've always wished I could be anorexic, but I just wasn't disciplined enough until I got on Ozempic... now we can be skinny twinsies!!!\" Um no babes, I'm on dialysis for kidney failure and have gastropareais after surgery from ripping my esophagus open, I keep having to have tube's dropped and I hate my life and want to die every day, so unless she wants to join me....ugh I never want to see her again. I relapsed after 11 years (I got ahold of it myself) because of these \"omg I'm anorexic now too!\" attitudes and the way everyone suddenly gets to be on ozempic and use eating disordered/anoreixic behaviors like it's nothing any more.",
      "created_utc": 1717349541.0,
      "score": 12,
      "context": []
    },
    {
      "id": "l6smefn",
      "author": "None",
      "body": "Yeah. Yes. This. People in my life have done this with other mental illnesses / issues as well. Ana is one of the ones that pisses me off the most- like, holy fuck, this is exactly what makes me NOT want to open up anymore. Why does me trusting you have to turn into you wanting to one up me! What is that!",
      "created_utc": 1717350380.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l6tal78",
      "author": "savannahruns",
      "body": "I agree I hate this, but more often than someone tells me about their 1 month diet they tell me about a legitimate eating disorder that they never felt brave enough to talk about because they were afraid everyone would perceive them as faking or not really being sick, so I would tread lightly and err on the side of believing people.",
      "created_utc": 1717359336.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l6rsm6l",
      "author": "ProgramSad9561",
      "body": "The same thing just happened to me. I told my friend and then suddenly he becomes ana and lies about having it in the past. His mother called out his bs",
      "created_utc": 1717339103.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l6tl6nb",
      "author": "Muted_Caterpillar655",
      "body": "i haven';t opened up to anyone about ana but when i told people i had OCD they would immediately say they thought they had ocd and would say its because they liked to clean",
      "created_utc": 1717363319.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l6v1wtj",
      "author": "unknownuser2239",
      "body": "Have a bigger friend like this, never showed any issues w food, body, self talk etc, as soon as she found out I was anorexic (by going through my mums fb) she was like I’m anorexic too and all this shit, she proceeded to show me a pic of her at her lw but it looked like it coulda been taken a week ago (not jus from her body but hair colour, glasses, what she’s wearing and since she found out she’s been so triggering to be around and once I had a punnet of blueberries that I was gonna omad at hers and she said ‘anorexics don’t eat, well I don’t so you shouldn’t either’ I go to the bathroom go back to her room and she’s not in there so I go to the kitchen and she had what looked like a pb and j sandwich jammed in her mouth, and jammed in isn’t an exaggeration at all  \nI’ve had many friends like this, and they’ve all had a negative impact on my mh and physical health, I don’t understand why tf they do but deep down I hope it’s jus cause their jealous frfr",
      "created_utc": 1717385684.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l6si5mo",
      "author": "Lonely-Iron-1038",
      "body": "ugh yeah. the first person I ever told about my purging (in high school) - she was like \"I used to be bulimic too, but then I just realized I'm beautiful, and you're beautiful too, so just stop ok?\" (I wasn't even bulimic lmao, that shit was triggering)",
      "created_utc": 1717348825.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l6sval1",
      "author": "Starlight-Edith",
      "body": "I tried to explain why ED spaces online need to exist to a friend of mine and he used the “well I used to throw up in middle school” card to invalidate what I was saying and I’m like bestie. Bestie. So frustrating. \n(He even implied he knew more about EDs than me because he did a school report on anorexia??)",
      "created_utc": 1717353644.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l6t7o22",
      "author": "jesscubby",
      "body": "I have the opposite, people in my life who definitely have disordered eating that just act like they are fine but comment on me. This is a generational issue in my family, my mother and brother have suffered for years but they don’t speak of it.",
      "created_utc": 1717358242.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l6tn05m",
      "author": "twodokai",
      "body": "yess!!!??!!!??!!!!!! it happens a lot and i don't understand!",
      "created_utc": 1717364027.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l6ve31f",
      "author": "Simulationth3ry",
      "body": "Oh yeah I’ve noticed they do this with so many different disorders/neurodivergence. They always try to relate even though they don’t have it!!!! It feels so invalidating.",
      "created_utc": 1717392425.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l6toka5",
      "author": "NeedsVacation1",
      "body": "same",
      "created_utc": 1717364633.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l6uwc6w",
      "author": "KickProcedure",
      "body": "\nMy ex did this, and then started literally bragging to me about how hers was worse than mine because she weighed less than me. Like wow ok, sorry I didn’t know that being in recovery and having a different body type made my disorder less valid?? Like I’m physically disabled and also cannot exercise much, so of course I weigh more than her!\n\nAnd then I had a big relapse and had to work really hard to pull myself out of it, and once I finally did, she told me that “it wasn’t that bad,” since I only fasted for three days before I pulled myself out of it and started working towards recovery again. \n\nOnce I was in healthier eating habits again, she started bragging about how she eats less than me. It started feeling like she was TRYING to trigger a relapse.\n\nSo glad I left.",
      "created_utc": 1717383023.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l6r3cjj",
      "author": "YoullNeverWalkAl0ne",
      "body": "How do you know they haven't struggled with it? It's not an uncommon thing\n\nGatekeeping a mental health illness is crazy",
      "created_utc": 1717326704.0,
      "score": 23,
      "context": []
    },
    {
      "id": "l6qxlu1",
      "author": "gyro1312",
      "body": "this !!! i’m aware a lot of people can have an ed, but i hate it that they think its comparable to someone who’s life revolve around food 24/7. Makes me feel like having an ed is just ‘common’",
      "created_utc": 1717322645.0,
      "score": 10,
      "context": []
    },
    {
      "id": "l6ueccs",
      "author": "worriedgirl03",
      "body": "Swear",
      "created_utc": 1717375266.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l6x3ph3",
      "author": "dumbratbitch",
      "body": "it makes me feel better to know that they don’t actually know what they’re talking ab",
      "created_utc": 1717426734.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l6xxm36",
      "author": "QuietObsessions",
      "body": "People love to use others struggles as an excuse to talk about their own.   I think sometimes people have never been given the space to talk about their own issues around food (whether a full blown ED or not) so when someone else opens up, some people may take that as permission to talk about themselves and use the wrong/inflated language. It’s super frustrating and something I’ve had to deal with too ❣️❣️",
      "created_utc": 1717436879.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l6s3egb",
      "author": "uselesstrash3",
      "body": "right like i wouldnt have dared to even think i was anorexic before i was diagnosed. even tho I was severely under weight and had all the symptoms and had barely ate in months. it took getting hospitalized in an ed unit and i still denied that i had an ed to the doctors when they diagnosed me lol",
      "created_utc": 1717343292.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l6rw8y0",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1717340536.0,
      "score": 0,
      "context": []
    },
    {
      "id": "l6spqbj",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1717351599.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6ytvo9",
      "author": "rightsideofmyheart",
      "body": "real because i have both ana and bulimia so as soon as i tell anyone, they immediately start saying that they haven’t it and try to invalidate my disorders because i’m not skinny.",
      "created_utc": 1717447587.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l78p163",
      "author": "myemosoul03",
      "body": "so real that’s why i never tell anyone. and same w bpd, everyone seems to have it, its trendy atm and i don’t think i can live with being told by one more person “yeah i have bpd too not professionally diagnosed tho”",
      "created_utc": 1717605818.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7fl7s2",
      "author": "kirathecucumber",
      "body": "THISSSS or all the sudden their talking about how they hate being skinny",
      "created_utc": 1717707977.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l9gzpwm",
      "author": "-PatkaLopikju-",
      "body": "I opened up about my (still under diagnosis) ADHD and my friend keeps saying \"this helps for my ADHD!!!\". Does he think it's fun? It really ain't. He's trying to be quirky and relatable...",
      "created_utc": 1718895940.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l77tt8n",
      "author": "PlatypusNo9259",
      "body": "Not the anorexia gatekeeping",
      "created_utc": 1717595030.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6sbch7",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1717346293.0,
      "score": -2,
      "context": []
    },
    {
      "id": "l6re7uf",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1717332823.0,
      "score": -17,
      "context": []
    },
    {
      "id": "l6v1t96",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717385636.0,
      "score": 0,
      "context": []
    },
    {
      "id": "l6sq2xx",
      "author": "kasialis721",
      "body": "or when they agree and say me too and use it as an adjective to describe one single thing “oh yeah i’m so ocd when i put my pens in my pen pot or organise my desk” girl stfu i can’t go to sleep until i have counted to 721 and said i love you to every person in my life. bffr",
      "created_utc": 1717351727.0,
      "score": 32,
      "context": [
        {
          "id": "l6rzlph",
          "author": "catsTXn420",
          "body": "I have OCD, it's like when I tell somebody about it all the sudden they too have it. 🙄 I feel your posting.",
          "created_utc": 1717341838.0
        }
      ]
    },
    {
      "id": "l6uv5en",
      "author": "Wild_Travel_8292",
      "body": "When they say they have OCD because they “have to be organized” 💀",
      "created_utc": 1717382492.0,
      "score": 8,
      "context": [
        {
          "id": "l6rzlph",
          "author": "catsTXn420",
          "body": "I have OCD, it's like when I tell somebody about it all the sudden they too have it. 🙄 I feel your posting.",
          "created_utc": 1717341838.0
        }
      ]
    },
    {
      "id": "l6u5ibr",
      "author": "brookleiaway",
      "body": "they always say they need their markers to be in color order",
      "created_utc": 1717371568.0,
      "score": 3,
      "context": [
        {
          "id": "l6rzlph",
          "author": "catsTXn420",
          "body": "I have OCD, it's like when I tell somebody about it all the sudden they too have it. 🙄 I feel your posting.",
          "created_utc": 1717341838.0
        }
      ]
    },
    {
      "id": "l6wbzah",
      "author": "Rubberducky10-4",
      "body": "The \"OMG that triggers my OCD\" ones, I can't stand🥴",
      "created_utc": 1717415328.0,
      "score": 1,
      "context": [
        {
          "id": "l6rzlph",
          "author": "catsTXn420",
          "body": "I have OCD, it's like when I tell somebody about it all the sudden they too have it. 🙄 I feel your posting.",
          "created_utc": 1717341838.0
        }
      ]
    },
    {
      "id": "l6xxpx8",
      "author": "QuietObsessions",
      "body": "This exact thing happened to me omg",
      "created_utc": 1717436914.0,
      "score": 1,
      "context": [
        {
          "id": "l6rzlph",
          "author": "catsTXn420",
          "body": "I have OCD, it's like when I tell somebody about it all the sudden they too have it. 🙄 I feel your posting.",
          "created_utc": 1717341838.0
        }
      ]
    },
    {
      "id": "l6rd3sa",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1717332271.0,
      "score": 36,
      "context": [
        {
          "id": "l6r94t5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717330159.0
        }
      ]
    },
    {
      "id": "l6sx969",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1717354367.0,
      "score": -3,
      "context": [
        {
          "id": "l6r94t5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717330159.0
        }
      ]
    },
    {
      "id": "l6spo93",
      "author": "kasialis721",
      "body": "like girlie there’s a reason it’s called a disorder because we can’t just turn it off after trying it for a day.",
      "created_utc": 1717351578.0,
      "score": 45,
      "context": [
        {
          "id": "l6scj5g",
          "author": "None",
          "body": "This is why I hate Meghan Trainor who bragged about “trying anorexia” and it not being for her. Like ok you dumb bitch.",
          "created_utc": 1717346734.0
        }
      ]
    },
    {
      "id": "l6w97bz",
      "author": "alcoholruinedmylife",
      "body": "I know a girl who said something similar, but with bisexuality and I literally lost my mind. The fuck do these motherfuckers mean when they say they tried.💀",
      "created_utc": 1717413862.0,
      "score": 5,
      "context": [
        {
          "id": "l6scj5g",
          "author": "None",
          "body": "This is why I hate Meghan Trainor who bragged about “trying anorexia” and it not being for her. Like ok you dumb bitch.",
          "created_utc": 1717346734.0
        }
      ]
    },
    {
      "id": "l6wq5oa",
      "author": "EErigeron",
      "body": "This is exactly the words I used in my head when I watched that",
      "created_utc": 1717421725.0,
      "score": 5,
      "context": [
        {
          "id": "l6scj5g",
          "author": "None",
          "body": "This is why I hate Meghan Trainor who bragged about “trying anorexia” and it not being for her. Like ok you dumb bitch.",
          "created_utc": 1717346734.0
        }
      ]
    },
    {
      "id": "l6uvez9",
      "author": "Wild_Travel_8292",
      "body": "One of my friends told me she could “probably benefit” from having an ED after I opened up about mine. As if my ED was just a fun little way to lose weight that definitely didn’t affect every other aspect of my life….",
      "created_utc": 1717382608.0,
      "score": 18,
      "context": [
        {
          "id": "l6sr4cv",
          "author": "musictakemeawayy",
          "body": "OMG also when people say they “wish” they had anorexia/ED or something i’m like… am i in upside down clown town?! you WANT the most fatal mental illness that ruins your body forever. um, why?!?!",
          "created_utc": 1717352105.0
        }
      ]
    },
    {
      "id": "l6unbrg",
      "author": "ThrowRAtays",
      "body": "they seem to mistake it as a quick way to lose a few pounds but that’s not at all how it works 😭",
      "created_utc": 1717379074.0,
      "score": 6,
      "context": [
        {
          "id": "l6sr4cv",
          "author": "musictakemeawayy",
          "body": "OMG also when people say they “wish” they had anorexia/ED or something i’m like… am i in upside down clown town?! you WANT the most fatal mental illness that ruins your body forever. um, why?!?!",
          "created_utc": 1717352105.0
        }
      ]
    },
    {
      "id": "l75x0hc",
      "author": "DiorRoses",
      "body": "idk how to describe it but i used to have anorexia where i was super dizzy and fainted a couple times sometimes i wouldn’t eat for 2 days. apparently i was so “emaciated” that i looked like a boy. even tho now im at a “healthier weight” and still considered slim i hate the way that i look so much. i don’t even have the motivation to have anorexia anymore bc it drained all my energy and i have so much schoolwork so idk but i feel like i looked so much better back then than now. ig i still have some type of disordered eating i usually only eat dinner",
      "created_utc": 1717555861.0,
      "score": 2,
      "context": [
        {
          "id": "l6sr4cv",
          "author": "musictakemeawayy",
          "body": "OMG also when people say they “wish” they had anorexia/ED or something i’m like… am i in upside down clown town?! you WANT the most fatal mental illness that ruins your body forever. um, why?!?!",
          "created_utc": 1717352105.0
        }
      ]
    },
    {
      "id": "l6sikas",
      "author": "Lonely-Iron-1038",
      "body": "that’s wild.. like I have pots and an ed, and tbh the feelings are similar except pots feels worse but is more manageable and you can feel it coming, ed fainting is a LOT more terrifying and comes out of nowhere. But anyway, yeah... to downplay **someone else's** ed is one hundred percent entirely fucked up.",
      "created_utc": 1717348978.0,
      "score": 10,
      "context": [
        {
          "id": "l6r2xgn",
          "author": "adumbledorablee",
          "body": "Big time this. I opened up to some of my close coworkers and all of a sudden one had an eating disorder and the other “downplayed” symptoms like dizziness and heart rate issues to “oh haha I have those too” (which, she does bc she has POTS). But they alle treated it like “what you’re doing is TOTALLY normal” instead of one of the most deadly mental illnesses so I guess 🤷🏻‍♀️ never doing that again and stay 🫠weird with food🫠",
          "created_utc": 1717326429.0
        }
      ]
    },
    {
      "id": "l6r3iuf",
      "author": "ThrowRAtays",
      "body": "omg the downplaying symptoms, my biggest ick like i get you might feel dizzy but do t just brush it off yk",
      "created_utc": 1717326817.0,
      "score": 23,
      "context": [
        {
          "id": "l6r2xgn",
          "author": "adumbledorablee",
          "body": "Big time this. I opened up to some of my close coworkers and all of a sudden one had an eating disorder and the other “downplayed” symptoms like dizziness and heart rate issues to “oh haha I have those too” (which, she does bc she has POTS). But they alle treated it like “what you’re doing is TOTALLY normal” instead of one of the most deadly mental illnesses so I guess 🤷🏻‍♀️ never doing that again and stay 🫠weird with food🫠",
          "created_utc": 1717326429.0
        }
      ]
    },
    {
      "id": "l6slqjr",
      "author": "ThrowRAtays",
      "body": "I hate people who mistake anorexia for discipline, if only it was that simple 😭 but omg I wouldn’t want to ever speak to her again that’s so fucked up for her to say to you ?! also i’m so sorry for what you’re going through and I wish you all the best",
      "created_utc": 1717350142.0,
      "score": 8,
      "context": [
        {
          "id": "l6sk2z8",
          "author": "twiggykeely",
          "body": "I feel like the casual use and massive promoting of Ozempic has made this SO MUCH WORSE. Yesterday I literally had a girl tell me \"Oh my God. I've always wished I could be anorexic, but I just wasn't disciplined enough until I got on Ozempic... now we can be skinny twinsies!!!\" Um no babes, I'm on dialysis for kidney failure and have gastropareais after surgery from ripping my esophagus open, I keep having to have tube's dropped and I hate my life and want to die every day, so unless she wants to join me....ugh I never want to see her again. I relapsed after 11 years (I got ahold of it myself) because of these \"omg I'm anorexic now too!\" attitudes and the way everyone suddenly gets to be on ozempic and use eating disordered/anoreixic behaviors like it's nothing any more.",
          "created_utc": 1717349541.0
        }
      ]
    },
    {
      "id": "l76z83j",
      "author": "None",
      "body": "My birthgiver did this shit. We're women, she sees me as competition. She is literally jealous of her own child. It is embarrassing. Sometimes one-uppers need to feel better than you in order to feel better about themselves. Or they have no idea how to care about you (seriously a real thing.) Sometimes both or something else entirely. But no matter what, one upping is always rude behavior. 'Me me me me me!!'",
      "created_utc": 1717579223.0,
      "score": 2,
      "context": [
        {
          "id": "l6smefn",
          "author": "None",
          "body": "Yeah. Yes. This. People in my life have done this with other mental illnesses / issues as well. Ana is one of the ones that pisses me off the most- like, holy fuck, this is exactly what makes me NOT want to open up anymore. Why does me trusting you have to turn into you wanting to one up me! What is that!",
          "created_utc": 1717350380.0
        }
      ]
    },
    {
      "id": "l6unjv2",
      "author": "ThrowRAtays",
      "body": "of course, i’m not talking about just anyone i’m talking about some specific people I know personally",
      "created_utc": 1717379170.0,
      "score": 2,
      "context": [
        {
          "id": "l6tal78",
          "author": "savannahruns",
          "body": "I agree I hate this, but more often than someone tells me about their 1 month diet they tell me about a legitimate eating disorder that they never felt brave enough to talk about because they were afraid everyone would perceive them as faking or not really being sick, so I would tread lightly and err on the side of believing people.",
          "created_utc": 1717359336.0
        }
      ]
    },
    {
      "id": "l76zms2",
      "author": "None",
      "body": "Your friend who stalks your mom on Facebook needs to leave you alone. If someone isn't lifting you up or at least making you feel good about yourself, what is the point in having them in your life. Literally put her in the dumpster or something",
      "created_utc": 1717579523.0,
      "score": 1,
      "context": [
        {
          "id": "l6v1wtj",
          "author": "unknownuser2239",
          "body": "Have a bigger friend like this, never showed any issues w food, body, self talk etc, as soon as she found out I was anorexic (by going through my mums fb) she was like I’m anorexic too and all this shit, she proceeded to show me a pic of her at her lw but it looked like it coulda been taken a week ago (not jus from her body but hair colour, glasses, what she’s wearing and since she found out she’s been so triggering to be around and once I had a punnet of blueberries that I was gonna omad at hers and she said ‘anorexics don’t eat, well I don’t so you shouldn’t either’ I go to the bathroom go back to her room and she’s not in there so I go to the kitchen and she had what looked like a pb and j sandwich jammed in her mouth, and jammed in isn’t an exaggeration at all  \nI’ve had many friends like this, and they’ve all had a negative impact on my mh and physical health, I don’t understand why tf they do but deep down I hope it’s jus cause their jealous frfr",
          "created_utc": 1717385684.0
        }
      ]
    },
    {
      "id": "l6r3f5w",
      "author": "ThrowRAtays",
      "body": "of course I know that i’m talking about people who consider normal dieting anorexia",
      "created_utc": 1717326752.0,
      "score": 44,
      "context": [
        {
          "id": "l6r3cjj",
          "author": "YoullNeverWalkAl0ne",
          "body": "How do you know they haven't struggled with it? It's not an uncommon thing\n\nGatekeeping a mental health illness is crazy",
          "created_utc": 1717326704.0
        }
      ]
    },
    {
      "id": "l6rkyck",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717335928.0,
      "score": 29,
      "context": [
        {
          "id": "l6r3cjj",
          "author": "YoullNeverWalkAl0ne",
          "body": "How do you know they haven't struggled with it? It's not an uncommon thing\n\nGatekeeping a mental health illness is crazy",
          "created_utc": 1717326704.0
        }
      ]
    },
    {
      "id": "l6r3m0v",
      "author": "Augustwannabethin",
      "body": "What you just said is a big symptom of an ed😭",
      "created_utc": 1717326873.0,
      "score": 28,
      "context": [
        {
          "id": "l6qxlu1",
          "author": "gyro1312",
          "body": "this !!! i’m aware a lot of people can have an ed, but i hate it that they think its comparable to someone who’s life revolve around food 24/7. Makes me feel like having an ed is just ‘common’",
          "created_utc": 1717322645.0
        }
      ]
    },
    {
      "id": "l6swy00",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1717354253.0,
      "score": 2,
      "context": [
        {
          "id": "l6rw8y0",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717340536.0
        }
      ]
    },
    {
      "id": "l6swz0l",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1717354264.0,
      "score": 1,
      "context": [
        {
          "id": "l6spqbj",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717351599.0
        }
      ]
    },
    {
      "id": "l783wn3",
      "author": "ThrowRAtays",
      "body": "you’ve clearly not read my replies/misunderstood what i’m trying to say",
      "created_utc": 1717598676.0,
      "score": 2,
      "context": [
        {
          "id": "l77tt8n",
          "author": "PlatypusNo9259",
          "body": "Not the anorexia gatekeeping",
          "created_utc": 1717595030.0
        }
      ]
    },
    {
      "id": "l6siq5x",
      "author": "Lonely-Iron-1038",
      "body": "...what the fuck dude ?????",
      "created_utc": 1717349038.0,
      "score": 6,
      "context": [
        {
          "id": "l6sbch7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717346293.0
        }
      ]
    },
    {
      "id": "l6siufk",
      "author": "r0adtojoy",
      "body": "okay, first of all, she’s 15. second of all, each condition comes with its own struggles, that are shared with, but not the same as other EDs. \n\nmany people have this illness. many people open up to me about their illness after i share my illness. it’s how you make connection, but it sounds like the people she’s talking about aren’t being genuine or are seeing it as a way to get attention or put her down.\n\nanorexia is not cool. it’s destroyed my current and prior relationships with partners and friends. it’s destroyed my teeth, my hair, my skin and my bank account. you become so isolated and depressed and lonely. it’s worth recovering from. OP, you have time to recover before the real damage starts to sink in. i have faith in you.",
      "created_utc": 1717349082.0,
      "score": 6,
      "context": [
        {
          "id": "l6sbch7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717346293.0
        }
      ]
    },
    {
      "id": "l6sd835",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1717346992.0,
      "score": 7,
      "context": [
        {
          "id": "l6sbch7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717346293.0
        }
      ]
    },
    {
      "id": "l6sx1uy",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1717354292.0,
      "score": 1,
      "context": [
        {
          "id": "l6sbch7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717346293.0
        }
      ]
    },
    {
      "id": "l6rectf",
      "author": "ThrowRAtays",
      "body": "not gatekeeping shit, just saying people shouldn’t pretend to understand a disorder they do not have",
      "created_utc": 1717332890.0,
      "score": 19,
      "context": [
        {
          "id": "l6re7uf",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332823.0
        }
      ]
    },
    {
      "id": "l6sx75n",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1717354346.0,
      "score": 2,
      "context": [
        {
          "id": "l6re7uf",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332823.0
        }
      ]
    },
    {
      "id": "l6v2lqs",
      "author": "ThrowRAtays",
      "body": "i fear you’ve completely miundertsood the situation, for one friend I told her I was in hospital with refeeding and she replied saying ‘yeah I completely understand I lowkey was anorexic for a week and a bit last month and getting back into the rhythm of eating was tough, but I did it so i’m sure you can bounce back too!’ That kind of comment is what i’m referring too because she didn’t have anorexia, she dabbled with disordered eating. Mind you i’ve known this girl forever and she’s never shown any problems with weight food etc. \n\nI obviously am glad she snapped out of it but I hate the loose use of the word anorexia which is mainly what this post is about because it waters down how serious the illness is when people use it so often to describe periods of dieting or short periods of restriction, because that is NOT what anorexia is!!",
      "created_utc": 1717386032.0,
      "score": 1,
      "context": [
        {
          "id": "l6v1t96",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717385636.0
        }
      ]
    },
    {
      "id": "l6srolo",
      "author": "catsTXn420",
      "body": "Truth!",
      "created_utc": 1717352310.0,
      "score": 3,
      "context": [
        {
          "id": "l6rzlph",
          "author": "catsTXn420",
          "body": "I have OCD, it's like when I tell somebody about it all the sudden they too have it. 🙄 I feel your posting.",
          "created_utc": 1717341838.0
        },
        {
          "id": "l6sq2xx",
          "author": "kasialis721",
          "body": "or when they agree and say me too and use it as an adjective to describe one single thing “oh yeah i’m so ocd when i put my pens in my pen pot or organise my desk” girl stfu i can’t go to sleep until i have counted to 721 and said i love you to every person in my life. bffr",
          "created_utc": 1717351727.0
        }
      ]
    },
    {
      "id": "l6veucw",
      "author": "catsTXn420",
      "body": "I wish it was only an organization issue, id love to see some of these fakers live with the intrusive thoughts and compulsive behaviors for one week. Its not all clorox wipes and rainbows. 🫣",
      "created_utc": 1717392891.0,
      "score": 9,
      "context": [
        {
          "id": "l6rzlph",
          "author": "catsTXn420",
          "body": "I have OCD, it's like when I tell somebody about it all the sudden they too have it. 🙄 I feel your posting.",
          "created_utc": 1717341838.0
        },
        {
          "id": "l6uv5en",
          "author": "Wild_Travel_8292",
          "body": "When they say they have OCD because they “have to be organized” 💀",
          "created_utc": 1717382492.0
        }
      ]
    },
    {
      "id": "l6rft7s",
      "author": "mouse-bites",
      "body": "When Meghan Trainor said that, it made me hate her more than I already did 🙄",
      "created_utc": 1717333592.0,
      "score": 60,
      "context": [
        {
          "id": "l6r94t5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717330159.0
        },
        {
          "id": "l6rd3sa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332271.0
        }
      ]
    },
    {
      "id": "l6sxa2x",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1717354376.0,
      "score": -5,
      "context": [
        {
          "id": "l6r94t5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717330159.0
        },
        {
          "id": "l6rd3sa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332271.0
        }
      ]
    },
    {
      "id": "l6uxf5e",
      "author": "musictakemeawayy",
      "body": "omfg i would cry and be mad at the same time😭 sorry ahh",
      "created_utc": 1717383519.0,
      "score": 5,
      "context": [
        {
          "id": "l6sr4cv",
          "author": "musictakemeawayy",
          "body": "OMG also when people say they “wish” they had anorexia/ED or something i’m like… am i in upside down clown town?! you WANT the most fatal mental illness that ruins your body forever. um, why?!?!",
          "created_utc": 1717352105.0
        },
        {
          "id": "l6uvez9",
          "author": "Wild_Travel_8292",
          "body": "One of my friends told me she could “probably benefit” from having an ED after I opened up about mine. As if my ED was just a fun little way to lose weight that definitely didn’t affect every other aspect of my life….",
          "created_utc": 1717382608.0
        }
      ]
    },
    {
      "id": "l6uodag",
      "author": "musictakemeawayy",
      "body": "right like uhhhh we literally all wish😭😭",
      "created_utc": 1717379521.0,
      "score": 4,
      "context": [
        {
          "id": "l6sr4cv",
          "author": "musictakemeawayy",
          "body": "OMG also when people say they “wish” they had anorexia/ED or something i’m like… am i in upside down clown town?! you WANT the most fatal mental illness that ruins your body forever. um, why?!?!",
          "created_utc": 1717352105.0
        },
        {
          "id": "l6unbrg",
          "author": "ThrowRAtays",
          "body": "they seem to mistake it as a quick way to lose a few pounds but that’s not at all how it works 😭",
          "created_utc": 1717379074.0
        }
      ]
    },
    {
      "id": "l6zo87s",
      "author": "twiggykeely",
      "body": "Thank you!!  Yeah I don't know what she wag thinking,  she was one of those friends who couldn't be happy for other people for anything ever,  she was just a huge hater lmfao and I do too!! I'm like the most undisciplined person ever I have horrible ADHD 😂 and I think people simplifying it to just being a discipline or self drive thing really negates the deadly mental illness par t. Like it's not a choice!!!! Recovery is a choice, but not the getting sick part. I tried to explain it to her but she acted like she didn't care so I was like k bye bitch 😂✌️",
      "created_utc": 1717458847.0,
      "score": 2,
      "context": [
        {
          "id": "l6sk2z8",
          "author": "twiggykeely",
          "body": "I feel like the casual use and massive promoting of Ozempic has made this SO MUCH WORSE. Yesterday I literally had a girl tell me \"Oh my God. I've always wished I could be anorexic, but I just wasn't disciplined enough until I got on Ozempic... now we can be skinny twinsies!!!\" Um no babes, I'm on dialysis for kidney failure and have gastropareais after surgery from ripping my esophagus open, I keep having to have tube's dropped and I hate my life and want to die every day, so unless she wants to join me....ugh I never want to see her again. I relapsed after 11 years (I got ahold of it myself) because of these \"omg I'm anorexic now too!\" attitudes and the way everyone suddenly gets to be on ozempic and use eating disordered/anoreixic behaviors like it's nothing any more.",
          "created_utc": 1717349541.0
        },
        {
          "id": "l6slqjr",
          "author": "ThrowRAtays",
          "body": "I hate people who mistake anorexia for discipline, if only it was that simple 😭 but omg I wouldn’t want to ever speak to her again that’s so fucked up for her to say to you ?! also i’m so sorry for what you’re going through and I wish you all the best",
          "created_utc": 1717350142.0
        }
      ]
    },
    {
      "id": "l788slt",
      "author": "None",
      "body": "It's so fucking odd to me, especially with it's family. I have an older female family member who, when I would try to open up, would also open up to me and tell me about her struggles- she definitely dumped way too much of her trauma on me when I was too young, stuff she admitted that she had never told anyone else. But even THEN she didn't do THIS. She wasn't trying to compete with me, she was trying to *connect* with me, like you said. There was such an obvious difference between her and someone like my aunt who just straight up hated me for being a thin child (back when I was naturally thin because I was like SEVEN YEARS OLD, not even struggling with an ED yet) and literally celebrated / would constantly remind me as I got older and puberty made me naturally gain weight. Honestly that aunt probably contributed a lot to me developing AN in the first place which is so fucked up to think about. (And her husband was a creep toward me no matter what I weighed so you know what maybe there was a reason that she \"acted jealous\". Not a good reason by any means but certainly a reason.) TLDR adults in the family who act this way with malicious intent are the fucking worst and I hope they all step on glass.",
      "created_utc": 1717600371.0,
      "score": 1,
      "context": [
        {
          "id": "l6smefn",
          "author": "None",
          "body": "Yeah. Yes. This. People in my life have done this with other mental illnesses / issues as well. Ana is one of the ones that pisses me off the most- like, holy fuck, this is exactly what makes me NOT want to open up anymore. Why does me trusting you have to turn into you wanting to one up me! What is that!",
          "created_utc": 1717350380.0
        },
        {
          "id": "l76z83j",
          "author": "None",
          "body": "My birthgiver did this shit. We're women, she sees me as competition. She is literally jealous of her own child. It is embarrassing. Sometimes one-uppers need to feel better than you in order to feel better about themselves. Or they have no idea how to care about you (seriously a real thing.) Sometimes both or something else entirely. But no matter what, one upping is always rude behavior. 'Me me me me me!!'",
          "created_utc": 1717579223.0
        }
      ]
    },
    {
      "id": "l6rs0cd",
      "author": "bennettschmennett",
      "body": "I think it's because AN presents in quite a few different ways, along with atypical AN being a diagnosis that few people are aware of (or care about). If you're restricting intake, whether it be extreme over a short period or less extreme over a long period (resulting in weight loss), have body image issues, refuse and prevent weight gain, then it's typical AN for those who are underweight and atypical AN for those who are not. The psychological and physical impacts of typical vs atypical AN are identical, so they are equally as serious and deadly.",
      "created_utc": 1717338863.0,
      "score": 20,
      "context": [
        {
          "id": "l6r3cjj",
          "author": "YoullNeverWalkAl0ne",
          "body": "How do you know they haven't struggled with it? It's not an uncommon thing\n\nGatekeeping a mental health illness is crazy",
          "created_utc": 1717326704.0
        },
        {
          "id": "l6rkyck",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717335928.0
        }
      ]
    },
    {
      "id": "l796erx",
      "author": "PlatypusNo9259",
      "body": "Disordered eating is all on a spectrum…it’s not uncommon for people with EDs to flip from binge eating to anorexia to bulimia and back and forth again. There’s this elitist view of anorexia where it somehow ranks above other manifestations of ED and quite frankly I think it’s a dangerous attitude that deters people from getting help because they aren’t sick enough. Chances are if somebody “wishes they were anorexic” or claims to be anorexic they probably fall somewhere on the spectrum of ED. I once “wished I was anorexic” and ended up in ED treatment for bulimia because I was purging 8-15 times a day to the point of vomiting blood and needed weekly dental appointments for the better part of a year because I had essentially eroded all my teeth away. And I never felt like I was sick enough. I had periods of anorexia and of binge eating and of cycling through the two but I wasn’t emaciated and therefore not deserving of help. If people throwing around the terms loosely is triggering to you, maybe just only discuss your ED with people you know/ trust.",
      "created_utc": 1717611653.0,
      "score": 0,
      "context": [
        {
          "id": "l77tt8n",
          "author": "PlatypusNo9259",
          "body": "Not the anorexia gatekeeping",
          "created_utc": 1717595030.0
        },
        {
          "id": "l783wn3",
          "author": "ThrowRAtays",
          "body": "you’ve clearly not read my replies/misunderstood what i’m trying to say",
          "created_utc": 1717598676.0
        }
      ]
    },
    {
      "id": "l6slerb",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1717350023.0,
      "score": -2,
      "context": [
        {
          "id": "l6sbch7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717346293.0
        },
        {
          "id": "l6siufk",
          "author": "r0adtojoy",
          "body": "okay, first of all, she’s 15. second of all, each condition comes with its own struggles, that are shared with, but not the same as other EDs. \n\nmany people have this illness. many people open up to me about their illness after i share my illness. it’s how you make connection, but it sounds like the people she’s talking about aren’t being genuine or are seeing it as a way to get attention or put her down.\n\nanorexia is not cool. it’s destroyed my current and prior relationships with partners and friends. it’s destroyed my teeth, my hair, my skin and my bank account. you become so isolated and depressed and lonely. it’s worth recovering from. OP, you have time to recover before the real damage starts to sink in. i have faith in you.",
          "created_utc": 1717349082.0
        }
      ]
    },
    {
      "id": "l6sx67k",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1717354337.0,
      "score": 1,
      "context": [
        {
          "id": "l6sbch7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717346293.0
        },
        {
          "id": "l6sd835",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717346992.0
        }
      ]
    },
    {
      "id": "l6regwn",
      "author": "EatsPeanutButter",
      "body": "You don’t know their medical history. Some people don’t appear to be anorexic, or they downplay it. Worry about yourself and not what other people are struggling with.",
      "created_utc": 1717332945.0,
      "score": -12,
      "context": [
        {
          "id": "l6re7uf",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332823.0
        },
        {
          "id": "l6rectf",
          "author": "ThrowRAtays",
          "body": "not gatekeeping shit, just saying people shouldn’t pretend to understand a disorder they do not have",
          "created_utc": 1717332890.0
        }
      ]
    },
    {
      "id": "l6v3d4v",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717386419.0,
      "score": 1,
      "context": [
        {
          "id": "l6v1t96",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717385636.0
        },
        {
          "id": "l6v2lqs",
          "author": "ThrowRAtays",
          "body": "i fear you’ve completely miundertsood the situation, for one friend I told her I was in hospital with refeeding and she replied saying ‘yeah I completely understand I lowkey was anorexic for a week and a bit last month and getting back into the rhythm of eating was tough, but I did it so i’m sure you can bounce back too!’ That kind of comment is what i’m referring too because she didn’t have anorexia, she dabbled with disordered eating. Mind you i’ve known this girl forever and she’s never shown any problems with weight food etc. \n\nI obviously am glad she snapped out of it but I hate the loose use of the word anorexia which is mainly what this post is about because it waters down how serious the illness is when people use it so often to describe periods of dieting or short periods of restriction, because that is NOT what anorexia is!!",
          "created_utc": 1717386032.0
        }
      ]
    },
    {
      "id": "l6x5a4h",
      "author": "dumbratbitch",
      "body": "THIS like it’s not so cute when im pulling my hair out for hours now is it",
      "created_utc": 1717427283.0,
      "score": 3,
      "context": [
        {
          "id": "l6rzlph",
          "author": "catsTXn420",
          "body": "I have OCD, it's like when I tell somebody about it all the sudden they too have it. 🙄 I feel your posting.",
          "created_utc": 1717341838.0
        },
        {
          "id": "l6uv5en",
          "author": "Wild_Travel_8292",
          "body": "When they say they have OCD because they “have to be organized” 💀",
          "created_utc": 1717382492.0
        },
        {
          "id": "l6veucw",
          "author": "catsTXn420",
          "body": "I wish it was only an organization issue, id love to see some of these fakers live with the intrusive thoughts and compulsive behaviors for one week. Its not all clorox wipes and rainbows. 🫣",
          "created_utc": 1717392891.0
        }
      ]
    },
    {
      "id": "l6udg27",
      "author": "yarn-and-sad-poems",
      "body": "Wait I'm curious now. What did the original comment say before it was removed? (Minus the numbers ofc)",
      "created_utc": 1717374894.0,
      "score": 7,
      "context": [
        {
          "id": "l6r94t5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717330159.0
        },
        {
          "id": "l6rd3sa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332271.0
        },
        {
          "id": "l6rft7s",
          "author": "mouse-bites",
          "body": "When Meghan Trainor said that, it made me hate her more than I already did 🙄",
          "created_utc": 1717333592.0
        }
      ]
    },
    {
      "id": "l6rpkaq",
      "author": "LoveyDoveySkills",
      "body": "Wait what? Am I missing something?? Sorry, I don't keep up with her a lot but I'm definitely curious now",
      "created_utc": 1717337877.0,
      "score": 10,
      "context": [
        {
          "id": "l6r94t5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717330159.0
        },
        {
          "id": "l6rd3sa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332271.0
        },
        {
          "id": "l6rft7s",
          "author": "mouse-bites",
          "body": "When Meghan Trainor said that, it made me hate her more than I already did 🙄",
          "created_utc": 1717333592.0
        }
      ]
    },
    {
      "id": "l76b1et",
      "author": "Wild_Travel_8292",
      "body": "I was so mad omg. I tried to get through to her but istg she never listened. She’s also spoken poorly about other mental disorders, because in her book you can just “overcome” something like that if you’re “smart enough”. Told me she isn’t dumb enough to actually starve herself, unlike me. Long story short we aren’t friends anymore 💀",
      "created_utc": 1717562884.0,
      "score": 5,
      "context": [
        {
          "id": "l6sr4cv",
          "author": "musictakemeawayy",
          "body": "OMG also when people say they “wish” they had anorexia/ED or something i’m like… am i in upside down clown town?! you WANT the most fatal mental illness that ruins your body forever. um, why?!?!",
          "created_utc": 1717352105.0
        },
        {
          "id": "l6uvez9",
          "author": "Wild_Travel_8292",
          "body": "One of my friends told me she could “probably benefit” from having an ED after I opened up about mine. As if my ED was just a fun little way to lose weight that definitely didn’t affect every other aspect of my life….",
          "created_utc": 1717382608.0
        },
        {
          "id": "l6uxf5e",
          "author": "musictakemeawayy",
          "body": "omfg i would cry and be mad at the same time😭 sorry ahh",
          "created_utc": 1717383519.0
        }
      ]
    },
    {
      "id": "l7app78",
      "author": "None",
      "body": "I love hearing about the different flavors of chaos we grew up with. Adds character if nothing else. May their glass wounds be infected with yeast ahahah",
      "created_utc": 1717631064.0,
      "score": 2,
      "context": [
        {
          "id": "l6smefn",
          "author": "None",
          "body": "Yeah. Yes. This. People in my life have done this with other mental illnesses / issues as well. Ana is one of the ones that pisses me off the most- like, holy fuck, this is exactly what makes me NOT want to open up anymore. Why does me trusting you have to turn into you wanting to one up me! What is that!",
          "created_utc": 1717350380.0
        },
        {
          "id": "l76z83j",
          "author": "None",
          "body": "My birthgiver did this shit. We're women, she sees me as competition. She is literally jealous of her own child. It is embarrassing. Sometimes one-uppers need to feel better than you in order to feel better about themselves. Or they have no idea how to care about you (seriously a real thing.) Sometimes both or something else entirely. But no matter what, one upping is always rude behavior. 'Me me me me me!!'",
          "created_utc": 1717579223.0
        },
        {
          "id": "l788slt",
          "author": "None",
          "body": "It's so fucking odd to me, especially with it's family. I have an older female family member who, when I would try to open up, would also open up to me and tell me about her struggles- she definitely dumped way too much of her trauma on me when I was too young, stuff she admitted that she had never told anyone else. But even THEN she didn't do THIS. She wasn't trying to compete with me, she was trying to *connect* with me, like you said. There was such an obvious difference between her and someone like my aunt who just straight up hated me for being a thin child (back when I was naturally thin because I was like SEVEN YEARS OLD, not even struggling with an ED yet) and literally celebrated / would constantly remind me as I got older and puberty made me naturally gain weight. Honestly that aunt probably contributed a lot to me developing AN in the first place which is so fucked up to think about. (And her husband was a creep toward me no matter what I weighed so you know what maybe there was a reason that she \"acted jealous\". Not a good reason by any means but certainly a reason.) TLDR adults in the family who act this way with malicious intent are the fucking worst and I hope they all step on glass.",
          "created_utc": 1717600371.0
        }
      ]
    },
    {
      "id": "l6sx4f4",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1717354319.0,
      "score": 1,
      "context": [
        {
          "id": "l6sbch7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717346293.0
        },
        {
          "id": "l6siufk",
          "author": "r0adtojoy",
          "body": "okay, first of all, she’s 15. second of all, each condition comes with its own struggles, that are shared with, but not the same as other EDs. \n\nmany people have this illness. many people open up to me about their illness after i share my illness. it’s how you make connection, but it sounds like the people she’s talking about aren’t being genuine or are seeing it as a way to get attention or put her down.\n\nanorexia is not cool. it’s destroyed my current and prior relationships with partners and friends. it’s destroyed my teeth, my hair, my skin and my bank account. you become so isolated and depressed and lonely. it’s worth recovering from. OP, you have time to recover before the real damage starts to sink in. i have faith in you.",
          "created_utc": 1717349082.0
        },
        {
          "id": "l6slerb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717350023.0
        }
      ]
    },
    {
      "id": "l6renwf",
      "author": "ThrowRAtays",
      "body": "i know this? 😭 i’m talking about when you tell someone you trust that you have ana, and they hit you with ‘yeah I get you I was on a diet so I can relate’. I’m talking about people who can’t grasp the difference between diets and disorders",
      "created_utc": 1717333040.0,
      "score": 26,
      "context": [
        {
          "id": "l6re7uf",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332823.0
        },
        {
          "id": "l6rectf",
          "author": "ThrowRAtays",
          "body": "not gatekeeping shit, just saying people shouldn’t pretend to understand a disorder they do not have",
          "created_utc": 1717332890.0
        },
        {
          "id": "l6regwn",
          "author": "EatsPeanutButter",
          "body": "You don’t know their medical history. Some people don’t appear to be anorexic, or they downplay it. Worry about yourself and not what other people are struggling with.",
          "created_utc": 1717332945.0
        }
      ]
    },
    {
      "id": "l6v3ho0",
      "author": "ThrowRAtays",
      "body": "yeah and valid criticism is fine , you assumed you knew the situation so I told you what I meant, what’s the problem?",
      "created_utc": 1717386482.0,
      "score": 1,
      "context": [
        {
          "id": "l6v1t96",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717385636.0
        },
        {
          "id": "l6v2lqs",
          "author": "ThrowRAtays",
          "body": "i fear you’ve completely miundertsood the situation, for one friend I told her I was in hospital with refeeding and she replied saying ‘yeah I completely understand I lowkey was anorexic for a week and a bit last month and getting back into the rhythm of eating was tough, but I did it so i’m sure you can bounce back too!’ That kind of comment is what i’m referring too because she didn’t have anorexia, she dabbled with disordered eating. Mind you i’ve known this girl forever and she’s never shown any problems with weight food etc. \n\nI obviously am glad she snapped out of it but I hate the loose use of the word anorexia which is mainly what this post is about because it waters down how serious the illness is when people use it so often to describe periods of dieting or short periods of restriction, because that is NOT what anorexia is!!",
          "created_utc": 1717386032.0
        },
        {
          "id": "l6v3d4v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717386419.0
        }
      ]
    },
    {
      "id": "l6ue02t",
      "author": "mouse-bites",
      "body": "The numbers were time related? Idk why the mods removed it. She claimed to have “went anorexic” for a certain amount of hours one time and gave up.",
      "created_utc": 1717375125.0,
      "score": 12,
      "context": [
        {
          "id": "l6r94t5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717330159.0
        },
        {
          "id": "l6rd3sa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332271.0
        },
        {
          "id": "l6rft7s",
          "author": "mouse-bites",
          "body": "When Meghan Trainor said that, it made me hate her more than I already did 🙄",
          "created_utc": 1717333592.0
        },
        {
          "id": "l6udg27",
          "author": "yarn-and-sad-poems",
          "body": "Wait I'm curious now. What did the original comment say before it was removed? (Minus the numbers ofc)",
          "created_utc": 1717374894.0
        }
      ]
    },
    {
      "id": "l6rtcoa",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1717339394.0,
      "score": 16,
      "context": [
        {
          "id": "l6r94t5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717330159.0
        },
        {
          "id": "l6rd3sa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332271.0
        },
        {
          "id": "l6rft7s",
          "author": "mouse-bites",
          "body": "When Meghan Trainor said that, it made me hate her more than I already did 🙄",
          "created_utc": 1717333592.0
        },
        {
          "id": "l6rpkaq",
          "author": "LoveyDoveySkills",
          "body": "Wait what? Am I missing something?? Sorry, I don't keep up with her a lot but I'm definitely curious now",
          "created_utc": 1717337877.0
        }
      ]
    },
    {
      "id": "l7aqgmm",
      "author": "None",
      "body": "God, right? LMAO the stories we hear in the ED groups and group therapy... all very colourful. \"I'll put this in a novel and make it all worth it,\" I tell myself every day thru gritted teeth",
      "created_utc": 1717631370.0,
      "score": 2,
      "context": [
        {
          "id": "l6smefn",
          "author": "None",
          "body": "Yeah. Yes. This. People in my life have done this with other mental illnesses / issues as well. Ana is one of the ones that pisses me off the most- like, holy fuck, this is exactly what makes me NOT want to open up anymore. Why does me trusting you have to turn into you wanting to one up me! What is that!",
          "created_utc": 1717350380.0
        },
        {
          "id": "l76z83j",
          "author": "None",
          "body": "My birthgiver did this shit. We're women, she sees me as competition. She is literally jealous of her own child. It is embarrassing. Sometimes one-uppers need to feel better than you in order to feel better about themselves. Or they have no idea how to care about you (seriously a real thing.) Sometimes both or something else entirely. But no matter what, one upping is always rude behavior. 'Me me me me me!!'",
          "created_utc": 1717579223.0
        },
        {
          "id": "l788slt",
          "author": "None",
          "body": "It's so fucking odd to me, especially with it's family. I have an older female family member who, when I would try to open up, would also open up to me and tell me about her struggles- she definitely dumped way too much of her trauma on me when I was too young, stuff she admitted that she had never told anyone else. But even THEN she didn't do THIS. She wasn't trying to compete with me, she was trying to *connect* with me, like you said. There was such an obvious difference between her and someone like my aunt who just straight up hated me for being a thin child (back when I was naturally thin because I was like SEVEN YEARS OLD, not even struggling with an ED yet) and literally celebrated / would constantly remind me as I got older and puberty made me naturally gain weight. Honestly that aunt probably contributed a lot to me developing AN in the first place which is so fucked up to think about. (And her husband was a creep toward me no matter what I weighed so you know what maybe there was a reason that she \"acted jealous\". Not a good reason by any means but certainly a reason.) TLDR adults in the family who act this way with malicious intent are the fucking worst and I hope they all step on glass.",
          "created_utc": 1717600371.0
        },
        {
          "id": "l7app78",
          "author": "None",
          "body": "I love hearing about the different flavors of chaos we grew up with. Adds character if nothing else. May their glass wounds be infected with yeast ahahah",
          "created_utc": 1717631064.0
        }
      ]
    },
    {
      "id": "l719umb",
      "author": "yarn-and-sad-poems",
      "body": "Oh OK, ty",
      "created_utc": 1717488320.0,
      "score": 2,
      "context": [
        {
          "id": "l6r94t5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717330159.0
        },
        {
          "id": "l6rd3sa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332271.0
        },
        {
          "id": "l6rft7s",
          "author": "mouse-bites",
          "body": "When Meghan Trainor said that, it made me hate her more than I already did 🙄",
          "created_utc": 1717333592.0
        },
        {
          "id": "l6udg27",
          "author": "yarn-and-sad-poems",
          "body": "Wait I'm curious now. What did the original comment say before it was removed? (Minus the numbers ofc)",
          "created_utc": 1717374894.0
        },
        {
          "id": "l6ue02t",
          "author": "mouse-bites",
          "body": "The numbers were time related? Idk why the mods removed it. She claimed to have “went anorexic” for a certain amount of hours one time and gave up.",
          "created_utc": 1717375125.0
        }
      ]
    },
    {
      "id": "l6rtj6c",
      "author": "LoveyDoveySkills",
      "body": "Oh, yeah, no",
      "created_utc": 1717339467.0,
      "score": 8,
      "context": [
        {
          "id": "l6r94t5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717330159.0
        },
        {
          "id": "l6rd3sa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332271.0
        },
        {
          "id": "l6rft7s",
          "author": "mouse-bites",
          "body": "When Meghan Trainor said that, it made me hate her more than I already did 🙄",
          "created_utc": 1717333592.0
        },
        {
          "id": "l6rpkaq",
          "author": "LoveyDoveySkills",
          "body": "Wait what? Am I missing something?? Sorry, I don't keep up with her a lot but I'm definitely curious now",
          "created_utc": 1717337877.0
        },
        {
          "id": "l6rtcoa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717339394.0
        }
      ]
    },
    {
      "id": "l6srae6",
      "author": "musictakemeawayy",
      "body": "wow and if i already didn’t think her body shaming song was weird and annoying as fuck… jeeze! what a disaster of a human. i think she married a spy kid too lmao",
      "created_utc": 1717352166.0,
      "score": 5,
      "context": [
        {
          "id": "l6r94t5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717330159.0
        },
        {
          "id": "l6rd3sa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332271.0
        },
        {
          "id": "l6rft7s",
          "author": "mouse-bites",
          "body": "When Meghan Trainor said that, it made me hate her more than I already did 🙄",
          "created_utc": 1717333592.0
        },
        {
          "id": "l6rpkaq",
          "author": "LoveyDoveySkills",
          "body": "Wait what? Am I missing something?? Sorry, I don't keep up with her a lot but I'm definitely curious now",
          "created_utc": 1717337877.0
        },
        {
          "id": "l6rtcoa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717339394.0
        }
      ]
    },
    {
      "id": "l6sxb1h",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1717354386.0,
      "score": -4,
      "context": [
        {
          "id": "l6r94t5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717330159.0
        },
        {
          "id": "l6rd3sa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717332271.0
        },
        {
          "id": "l6rft7s",
          "author": "mouse-bites",
          "body": "When Meghan Trainor said that, it made me hate her more than I already did 🙄",
          "created_utc": 1717333592.0
        },
        {
          "id": "l6rpkaq",
          "author": "LoveyDoveySkills",
          "body": "Wait what? Am I missing something?? Sorry, I don't keep up with her a lot but I'm definitely curious now",
          "created_utc": 1717337877.0
        },
        {
          "id": "l6rtcoa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717339394.0
        }
      ]
    },
    {
      "id": "l7ar2cv",
      "author": "None",
      "body": "I promise I will buy your book if you are published but only if you will actually sign it. Cheers to seeing you alive next year 💀 damn that actually sounds interesting!! With changed/made up names of course.",
      "created_utc": 1717631613.0,
      "score": 2,
      "context": [
        {
          "id": "l6smefn",
          "author": "None",
          "body": "Yeah. Yes. This. People in my life have done this with other mental illnesses / issues as well. Ana is one of the ones that pisses me off the most- like, holy fuck, this is exactly what makes me NOT want to open up anymore. Why does me trusting you have to turn into you wanting to one up me! What is that!",
          "created_utc": 1717350380.0
        },
        {
          "id": "l76z83j",
          "author": "None",
          "body": "My birthgiver did this shit. We're women, she sees me as competition. She is literally jealous of her own child. It is embarrassing. Sometimes one-uppers need to feel better than you in order to feel better about themselves. Or they have no idea how to care about you (seriously a real thing.) Sometimes both or something else entirely. But no matter what, one upping is always rude behavior. 'Me me me me me!!'",
          "created_utc": 1717579223.0
        },
        {
          "id": "l788slt",
          "author": "None",
          "body": "It's so fucking odd to me, especially with it's family. I have an older female family member who, when I would try to open up, would also open up to me and tell me about her struggles- she definitely dumped way too much of her trauma on me when I was too young, stuff she admitted that she had never told anyone else. But even THEN she didn't do THIS. She wasn't trying to compete with me, she was trying to *connect* with me, like you said. There was such an obvious difference between her and someone like my aunt who just straight up hated me for being a thin child (back when I was naturally thin because I was like SEVEN YEARS OLD, not even struggling with an ED yet) and literally celebrated / would constantly remind me as I got older and puberty made me naturally gain weight. Honestly that aunt probably contributed a lot to me developing AN in the first place which is so fucked up to think about. (And her husband was a creep toward me no matter what I weighed so you know what maybe there was a reason that she \"acted jealous\". Not a good reason by any means but certainly a reason.) TLDR adults in the family who act this way with malicious intent are the fucking worst and I hope they all step on glass.",
          "created_utc": 1717600371.0
        },
        {
          "id": "l7app78",
          "author": "None",
          "body": "I love hearing about the different flavors of chaos we grew up with. Adds character if nothing else. May their glass wounds be infected with yeast ahahah",
          "created_utc": 1717631064.0
        },
        {
          "id": "l7aqgmm",
          "author": "None",
          "body": "God, right? LMAO the stories we hear in the ED groups and group therapy... all very colourful. \"I'll put this in a novel and make it all worth it,\" I tell myself every day thru gritted teeth",
          "created_utc": 1717631370.0
        }
      ]
    }
  ]
}