{
  "id": "1d6xdrk",
  "subreddit": "AnorexiaNervosa",
  "author": "Bluebutterfliesemoji",
  "created_utc": 1717393887.0,
  "title": "Anorexic rage?",
  "selftext": "Anyone else feel angry at everyone around them all the time? I’m constantly frustrated with the ppl i love for almost no reason. Where has all my patience gone??",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1d6xdrk/anorexic_rage/",
  "score": 114,
  "num_comments": 16,
  "comments": [
    {
      "id": "l6vgfpc",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1717393887.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6vmkh4",
      "author": "Fitkratomgirl",
      "body": "It’s constant hanger",
      "created_utc": 1717398005.0,
      "score": 51,
      "context": []
    },
    {
      "id": "l6vz523",
      "author": "TyrannosaurusAnorex",
      "body": "Starvation slows thyroid functioning significantly, and a depressed/angry mood is part of the fun package of issues that comes with developing an underactive thyroid (we can ignore weight gain since most of us cancel that out with the caloric deficit):\n\nTiredness.\nMore sensitivity to cold.\nConstipation.\nDry skin.\nWeight gain.\nPuffy face.\nHoarse voice.\nCoarse hair and skin.\nMuscle weakness.\nMuscle aches, tenderness and stiffness.\nMenstrual cycles that are heavier than usual or irregular.\nThinning hair.\nSlowed heart rate.\nDepression.\nMemory problems.\n\nIf you can tick a lot of these boxes, theoretically it would help to up your intake. Just a suggestion though, because I know increasing your calories is a mental battle. 🫂",
      "created_utc": 1717407456.0,
      "score": 35,
      "context": []
    },
    {
      "id": "l6vu48l",
      "author": "abby-anderson-",
      "body": "It's emotional instability and irritability due to lack of nutrients and energy! Central Nervous System Dysregulation due to lack of electrolytes is super common unfortunately-- your body is struggling to keep up with everything going on, leaving you (whether you realize it or not), constantly overwhelmed and angry. :(",
      "created_utc": 1717403613.0,
      "score": 11,
      "context": []
    },
    {
      "id": "l6w3prx",
      "author": "Dirty_Commie_Jesus",
      "body": "Idk about your gender but as a woman, when my body fat is too low my estrogen and progesterone are tanked. Low progesterone makes me ideate bad stuff and low estrogen makes me want to cuss everyone out, maybe slap them around a bit.",
      "created_utc": 1717410614.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l6ww2iy",
      "author": "WebAny8568",
      "body": "I found this to be the case too! When I started therapy they told me this is a common side affect of starvation syndrome! Some days I would wake up and the whole day I would feel just slightly on the edge of violence. Things seem to be getting better for me week by week with recovery",
      "created_utc": 1717424005.0,
      "score": 9,
      "context": []
    },
    {
      "id": "l6wr8yv",
      "author": "Itchy_Mycologist_853",
      "body": "I find that it’s “hangry” but to a whole new level. \n\nThe feeling also that people don’t understand what’s going on too and don’t understand you.",
      "created_utc": 1717422160.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l6whucu",
      "author": "newgirleden",
      "body": "this goes away once you recover, fortunately. but yes, i dealt with it for months before recovering, i was a hanger mess with the kid i was babysitting as well as my partner. so thankful that went away",
      "created_utc": 1717418174.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l6zzda0",
      "author": "Chaerin_Sistas",
      "body": "I get less witty and funny when I'm restricting. I'm just at a loss for words or what to say and I distance myself from people and friends at school cuz I'm just exhausted. Not really my whole body (yet) but it's mostly like my head is tired from thinking about food and my body.\n\nI treat my mom like shit because she's the main reason why I developed an ED and even tho she knows I had anorexia, she has no problem telling me I'm fat now. She's just slow, like can you use your brain to figure out that my smaller body was NOT healthy? There I go again, raging.",
      "created_utc": 1717463417.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l6wc6po",
      "author": "lavender-dyke",
      "body": "i‘m so hangry all the time",
      "created_utc": 1717415432.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l706v29",
      "author": "my-ed-alt",
      "body": "i feel like this is something that should be explicitly highlighted more- you need food for *everything.* your body uses calories to do *everything* it does to keep you alive. not eating means all your natural biological processes are happening *slower* and *worse* than before. your brain uses calories to think and to regulate your emotions. no calories means poor emotional regulation, aka “anorexic rage” or mood swings.",
      "created_utc": 1717466529.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l6xjz0u",
      "author": "Low-Bit2048",
      "body": "I was a beast filled with uncomprehensible rage in recovery, but a passive, depressed person before.",
      "created_utc": 1717432299.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6y4ay7",
      "author": "strbbb",
      "body": "You are hangry, it is normal",
      "created_utc": 1717439110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6zrtqc",
      "author": "SadHeron101",
      "body": "I dunno but i seem to get awfully bad when i lose my period. Depressed, anxious, tired, emotionally volatile. I always wanted to lose my period but I’d honestly rather have cramps every month than go through hardcore depression and anxiety again",
      "created_utc": 1717460306.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7h66ey",
      "author": "Ferngully34",
      "body": "Same here",
      "created_utc": 1717730635.0,
      "score": 2,
      "context": [
        {
          "id": "l6w3prx",
          "author": "Dirty_Commie_Jesus",
          "body": "Idk about your gender but as a woman, when my body fat is too low my estrogen and progesterone are tanked. Low progesterone makes me ideate bad stuff and low estrogen makes me want to cuss everyone out, maybe slap them around a bit.",
          "created_utc": 1717410614.0
        }
      ]
    }
  ]
}