{
  "id": "1d797sy",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1717433443.0,
  "title": "i miss being underweight and everything it meant",
  "selftext": "i never felt more like myself than when i was underweight, hospitalized, on a restraining bed and on 1:1. I miss being called gross, skelly, disgusting.\nI miss not being able to do anything, not being able to go to school, to go outside, just laying in bed all day. I miss when the only thing that was expected from me was to eat once a day, that was a “a feat” to my mum, now she expects me to go to school, get a job, get my drivers license, make friends, help her in the house, pass my classes, eat 5 times a day, etc. I miss feeling all my bones poking out. I miss seeing the low number on the scale and watching it go lower and lower each day. I miss being sick. I miss being underweight.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1d797sy/i_miss_being_underweight_and_everything_it_meant/",
  "score": 151,
  "num_comments": 12,
  "comments": [
    {
      "id": "l6xnd63",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1717433444.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6yg53n",
      "author": "No_Demand9388",
      "body": "I feel like I’m not supposed to understand this, yet I do. You are depressed and overwhelmed with life. It’s easier to feel like and be treated as a little girl.",
      "created_utc": 1717443022.0,
      "score": 81,
      "context": []
    },
    {
      "id": "l6z5yun",
      "author": "JuggaloEnlightment",
      "body": "This is what motivates the vast majority of women with AN",
      "created_utc": 1717451810.0,
      "score": 26,
      "context": []
    },
    {
      "id": "l6yg6is",
      "author": "5aminNYC",
      "body": "I guess all of us who were forced into recovery or didn't fully recover yet, feel that... I always feel that way, and I keep telling myself that I'm gonna get back to it later when I finish my last year at university...\n\nAnd then, I keep thinking of how I wish my life would turn out, and how I wish I have energy to travel, drive a super car, live in a big house which will be prevented by anorexia and the lack of energy, and ofc I won't reach that level of success if I'm prioritizing my body over my future and success...\n\nIt's a difficult equation, I'm not saying change ur mindset, quite the opposite, I keep fluctuating with those thoughts all the time, and it's hard to have control over them but I try to talk to myself in a way that won't hurt me, let me down, or push me to do sth that I can't take responsibility for which is waste my future",
      "created_utc": 1717443035.0,
      "score": 14,
      "context": []
    },
    {
      "id": "l6zouy2",
      "author": "None",
      "body": "I understand and I am very conflicted about this exact feeling. while I found a certain relief in forced recovery in that I felt it was only direct inducement I've had for a very long time of the belief that maybe I am capable of more than I expect, I debate heavily with myself about wanting to be capable. I reiterated several times at the hospital when asked to describe my motives that I am desperate to be frozen in a helpless girlhood, to the point that they were curious about my attachment to the phrasing itself",
      "created_utc": 1717459103.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l75dfi6",
      "author": "sorcerers_apprentice",
      "body": "Yeah, I hear you. When you’re underweight and “fragile,” the expectations are low. It’s almost like that by focusing obsessively on food and your body, you earn permission to only focus on food and your body. It feels so safe.",
      "created_utc": 1717547633.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l6zohk6",
      "author": "Visual-Novel6448",
      "body": "I feel this so much :( Hugs, op, it will get better <33",
      "created_utc": 1717458954.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l71gka4",
      "author": "W3r3w0lf2003",
      "body": "though i never technically got to underweight, i completely sympathise/empathise (not sure which word is right lol). i was on the cusp of underweight before i started to gain again a few months back, and that was because of a new medication that im on. i’m still on the lower end of a healthy bmi, but the fact that im further away from underweight stresses me out a lot, and im too afraid to tell my doctor about having an ed. as far as he’s concerned he’s treating depression and a case of essentially fixing malpractice from my last doc and what she put me through regarding my mental health, and even she didn’t know about my ed. no one does, except my best friend who’s also dealing with one, so i’ve basically got no one to talk to. i won’t go to my friend because i don’t want to trigger her, but i still need to vent somewhere and it gets overwhelming sometimes",
      "created_utc": 1717493374.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7d13zi",
      "author": "Warm_Journalist_5566",
      "body": "I know what you mean and feel that. I feel overwhelmed of life and very unmotivatied/depressed/hopelessness. Most of us struggle with undiagnosed autism and/or trauma/C-PTSD. AN give us comfort and feeling of \"safety\" and predictibility.",
      "created_utc": 1717676221.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6z634y",
      "author": "JuggaloEnlightment",
      "body": "You really said the quiet part out loud. Most won’t admit it, but that’s exactly what it is",
      "created_utc": 1717451854.0,
      "score": 36,
      "context": [
        {
          "id": "l6yg53n",
          "author": "No_Demand9388",
          "body": "I feel like I’m not supposed to understand this, yet I do. You are depressed and overwhelmed with life. It’s easier to feel like and be treated as a little girl.",
          "created_utc": 1717443022.0
        }
      ]
    },
    {
      "id": "l71tclh",
      "author": "MercurialChickadee",
      "body": "I always feel like “mindset” as a term is a bit too simplified. Human minds are complicated, natural, dynamic. It means we are often not as “stable” as we tend to think ourselves, but it also means we are usually not as “locked” as we sometimes might feel. Life has many sides to it. Even in the tough, seemingly simple, periods.",
      "created_utc": 1717501298.0,
      "score": 2,
      "context": [
        {
          "id": "l6yg6is",
          "author": "5aminNYC",
          "body": "I guess all of us who were forced into recovery or didn't fully recover yet, feel that... I always feel that way, and I keep telling myself that I'm gonna get back to it later when I finish my last year at university...\n\nAnd then, I keep thinking of how I wish my life would turn out, and how I wish I have energy to travel, drive a super car, live in a big house which will be prevented by anorexia and the lack of energy, and ofc I won't reach that level of success if I'm prioritizing my body over my future and success...\n\nIt's a difficult equation, I'm not saying change ur mindset, quite the opposite, I keep fluctuating with those thoughts all the time, and it's hard to have control over them but I try to talk to myself in a way that won't hurt me, let me down, or push me to do sth that I can't take responsibility for which is waste my future",
          "created_utc": 1717443035.0
        }
      ]
    }
  ]
}