{
  "id": "1d7cyab",
  "subreddit": "AnorexiaNervosa",
  "author": "MarkAcin0",
  "created_utc": 1717442505.0,
  "title": "I'm sick of other people being disgusted by EDs",
  "selftext": "So many people scoff at people with EDs like we're trying to promote a toxic mindset or something. I've had close friends complain about coworkers and people they know \"doing eating disorder things\" and they'll complain with the utmost disgust in their voice. It sucks not being able to open up to anyone about this because they'll think I'm just trying to get an influencer's body or that I'm just trying to make THEM feel ashamed about themselves for being heavier. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1d7cyab/im_sick_of_other_people_being_disgusted_by_eds/",
  "score": 128,
  "num_comments": 25,
  "comments": [
    {
      "id": "l6yeljk",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1717442506.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6ygp39",
      "author": "uselesstrash3",
      "body": "so real. ppl dont scoff at ppl with other disorders doing certain behaviours as if theyre trying to promote it, but for eds its ok??",
      "created_utc": 1717443209.0,
      "score": 35,
      "context": []
    },
    {
      "id": "l6yqjzb",
      "author": "BookLover1888",
      "body": "They assume it's driven by physical appearance (vanity) and not by psychological illness. I chalk it up to ignorance. \n\nHonestly, it's hard to fully blame them in a culture that embraces stabbing oneself in the stomach solely to achieve thinness. As the means to lose weight become more drastic, our behavior appears more normal.",
      "created_utc": 1717446472.0,
      "score": 42,
      "context": []
    },
    {
      "id": "l6zf7zg",
      "author": "CucumberVyvanse",
      "body": "Honestly, I hate that just existing in my body is seen as “promoting” it. It makes me want to disappear even further because just being perceived means I’m doing something wrong.",
      "created_utc": 1717455297.0,
      "score": 14,
      "context": []
    },
    {
      "id": "l6zwvex",
      "author": "Equivalent-Act-2739",
      "body": "I haven't gotten this much tbh. Most people I've told growing up have been super supportive. Occasionally you get the ignorant comment, but for the most part, all my friends and family have responded well. Our perception can be kinda skewed though. I'm sure I didn't always feel like that.",
      "created_utc": 1717462373.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l702lvv",
      "author": "anonymous0271",
      "body": "I’ve never gotten this personally, but I think the social image of what it is, IS the issue. They’re glorified, and it’s disgusting that they are. That’s what’s disgusting, the women and men online posting to their millions of fans how they need to do xyz, look xyz, and so on. I’ve never met someone in person who genuinely suffered and felt negatively about them. I have seen many “influencers” flaunting it and felt negative towards them.",
      "created_utc": 1717464770.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l72zzw4",
      "author": "earthlingsideas",
      "body": "it really feels like they think not actively recovering = proana. people really think they have the right to comment on people when they’re uw or struggle with restriction; i literally saw a random girl dancing and people telling her ‘eat a burger’ when she DIDNT EVEN HAVE AN ED she had a severe digestive disease and was in hospital multiple days a week for it. \n\nthe way they see it, having an ED is being proana and actively trying to indoctrinate people into also having an ED. it drives me fucking wild tbh, half the reason i never got help when i did meet nhs weight requirements was because i felt people would see it as a normal failing. \n\nthen my abusive gf forced me to ‘recover’ and now i feel like i’ll never meet nhs requirements so i’m stuck like this forever 💖",
      "created_utc": 1717517709.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l711ocw",
      "author": "intothecosm000s",
      "body": "i won’t lie i used to be one of those people. after going through my own struggle with anorexia, all i have for y’all now is empathy. i know what its like to only think about food and weight and numbers, it literally changes every part of how you think and act. if anything, seeing people go through what i went through just makes me want to help them in any way that i possibly can",
      "created_utc": 1717482744.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l72ykm8",
      "author": "Expert-Switch-769",
      "body": "literally. they don’t seem to understand that ppl with eating disorders literally can’t help it bc they have a mental illness that needs to be treated by professionals. they always seem to think we’re doing it for attention but no like im starting to relapse and i hate it i wanna do everything to not relapse but its so hard bc its a mental illness and many of us want to stop but just can’t bc its too powerful and not a choice. ik i didnt choose to be anorexic, it was a coping mechanism to not eat but it consumed me and became a huge issue that i so badly wish i didnt deal with. i think they talk like that bc people without eating disorders dont understand that we dont choose to do this, but our minds and ed thoughts are too powerful sometimes to stop. i remember in hs when my best friend developed her eating disorder and looking back i so wish i did things differently but i never understood what it was like or the power eating disorders hold until i struggled with anorexia myself years later. but bc of that, i can somewhat understand the things “normal” ppl say bc they don’t understand that yes i want to eat, but my brain wont let me bc its telling me this one piece of food will make me gain 5 lbs even tho ik it’s not true. no one truly understands eating disorders unless they experience it themselves or do extensive research",
      "created_utc": 1717517232.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l749n7k",
      "author": "notalotofsubstance",
      "body": "Yet *fat acceptance* and public promotion of obesity is streamlined into the public consciousness and media on a constant, it’s disgusting.",
      "created_utc": 1717532908.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l6zq7mr",
      "author": "dsp000",
      "body": "I prefer people who are honest about having an ED, than people who have it and pretend it’s body positivity tbh. Usually these people are just delusional, at least people knowing they have an ED, try to get better. I never heard of a completely healthy person physically and mentally to make fun or be disgusted by eating disorders. Usually the other extreme side of one ED is disgusted by the other. And the most vicious ones I saw were very heavy guys and  girls pretending they hate skinny ones. Any ED is difficult and I hope everyone recovers, but I really dislike their pseudo body positivity, because it’s usually positive only when the scale shows you obese. When it shows you underweight they suddenly hate you",
      "created_utc": 1717459651.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l7oyutz",
      "author": "Sensitive-Athlete412",
      "body": "In my experience, having anorexia has lead other people to think I’m vain, obsessive and not “mentally there” okay maybe I am all those things but it’s all part of the big picture which is I’m doing this to myself because I don’t feel in control of my life and I want to punish myself and I do need support.",
      "created_utc": 1717863659.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6zy8t8",
      "author": "Chaerin_Sistas",
      "body": "When I asked my sister to stop saying things around me like \"I'm gonna get fat from eating this\" or \"do i have a double chin too?\" (implying I had one), she looked at me and told me I was like those woke people who overreact about anything related to their identity.\n\nWell, I'm sorry I don't want to get triggered into starving myself and possibly dying again?",
      "created_utc": 1717462944.0,
      "score": 0,
      "context": []
    },
    {
      "id": "l6zy0kh",
      "author": "Mammoth_Exam1354",
      "body": "Well if you put it this way… I see your point.  Maybe we should just not judge anyone else! This would be ideal of course I am just not sure how realistic that is.\n\nI don’t know for a fact but I think somehow ED is misconstrued as Ann” optional” almost desired condition… like as if people choose to have this.  Nobody chooses to have ED and the truth is people die from it.\n\nI do know for a fact ED is not much different than another form of addiction.  But somehow people almost have more compassion for people with substance abuse…. I don’t know.  I am just rambling on here… I get your point.   This is another area where you just have to focus on you and not worry about what others say or think or do.  Just walk on minding your own business your issues and your actions\n\nWhat others think of me is none of my business.",
      "created_utc": 1717462848.0,
      "score": 9,
      "context": [
        {
          "id": "l6ygp39",
          "author": "uselesstrash3",
          "body": "so real. ppl dont scoff at ppl with other disorders doing certain behaviours as if theyre trying to promote it, but for eds its ok??",
          "created_utc": 1717443209.0
        }
      ]
    },
    {
      "id": "l6yweui",
      "author": "Sweaty-Payment-7175",
      "body": "I think you’re right on the mark about our behaviors appearing more normal in this “ozempic era”. We moved past the body positivity era and now it seems that they’re trying to normalize being dangerously thin and using any means to do so. It’s sad and triggering af, makes me feel too comfortable sometimes displaying disordered behaviors in public/around others",
      "created_utc": 1717448433.0,
      "score": 11,
      "context": [
        {
          "id": "l6yqjzb",
          "author": "BookLover1888",
          "body": "They assume it's driven by physical appearance (vanity) and not by psychological illness. I chalk it up to ignorance. \n\nHonestly, it's hard to fully blame them in a culture that embraces stabbing oneself in the stomach solely to achieve thinness. As the means to lose weight become more drastic, our behavior appears more normal.",
          "created_utc": 1717446472.0
        }
      ]
    },
    {
      "id": "l72yzz2",
      "author": "Expert-Switch-769",
      "body": "omg yes, ppl think we just wanna be thin but no, we just want control and it’s a coping mechanism, not a healthy one tho which is why ppl with eating disorders have to do EXTENSIVE therapy, like it’s been 4+ years and i still struggle and talk to my therapist. ppl just don’t get it’s not something we can just stop",
      "created_utc": 1717517376.0,
      "score": 1,
      "context": [
        {
          "id": "l6yqjzb",
          "author": "BookLover1888",
          "body": "They assume it's driven by physical appearance (vanity) and not by psychological illness. I chalk it up to ignorance. \n\nHonestly, it's hard to fully blame them in a culture that embraces stabbing oneself in the stomach solely to achieve thinness. As the means to lose weight become more drastic, our behavior appears more normal.",
          "created_utc": 1717446472.0
        }
      ]
    },
    {
      "id": "l6zyk1e",
      "author": "Equivalent-Act-2739",
      "body": "I think this is the worst and it makes me feel bad for the accused. \n\nI don't naturally have a skinny build and I was skinny for like 5 seconds. Only some parts of my body are \"thin.\" Like I wouldn't consider myself thick skinned tbh. I've definitely got thick legs. But my natural build just isn't really thick. A couple summers ago I had an Asian lady and a lot of Asians are small, right...So this lady was helping me with my gown in the hospital for an ultrasound and I helped her. As she was tying my gown, she went, \"You're thin!\" I was like omggggggg THANK YOU... WTF???.....Literally I'm not. But I guess it's because my C7 sticks out when I bend my neck regardless of my weight. I thought that was most people? Apparently not. Tbh I don't know what she was referring to exactly, but I was like OKAY COOL. WOW. THX. And I was nowhere near skinny then.............I've been fully recovered now for a long while.",
      "created_utc": 1717463077.0,
      "score": 2,
      "context": [
        {
          "id": "l6zf7zg",
          "author": "CucumberVyvanse",
          "body": "Honestly, I hate that just existing in my body is seen as “promoting” it. It makes me want to disappear even further because just being perceived means I’m doing something wrong.",
          "created_utc": 1717455297.0
        }
      ]
    },
    {
      "id": "l73otng",
      "author": "luckless_vixen",
      "body": "You’re right on the money with this one, the only way people allow you to discuss your ED is when you’re in active recovery; the only way to “be ethical” or a “good person” with a restrictive ED is to be in recovery.",
      "created_utc": 1717526058.0,
      "score": 2,
      "context": [
        {
          "id": "l72zzw4",
          "author": "earthlingsideas",
          "body": "it really feels like they think not actively recovering = proana. people really think they have the right to comment on people when they’re uw or struggle with restriction; i literally saw a random girl dancing and people telling her ‘eat a burger’ when she DIDNT EVEN HAVE AN ED she had a severe digestive disease and was in hospital multiple days a week for it. \n\nthe way they see it, having an ED is being proana and actively trying to indoctrinate people into also having an ED. it drives me fucking wild tbh, half the reason i never got help when i did meet nhs weight requirements was because i felt people would see it as a normal failing. \n\nthen my abusive gf forced me to ‘recover’ and now i feel like i’ll never meet nhs requirements so i’m stuck like this forever 💖",
          "created_utc": 1717517709.0
        }
      ]
    },
    {
      "id": "l71zh8i",
      "author": "MarkAcin0",
      "body": "I've noticed this too.",
      "created_utc": 1717504270.0,
      "score": 1,
      "context": [
        {
          "id": "l6zq7mr",
          "author": "dsp000",
          "body": "I prefer people who are honest about having an ED, than people who have it and pretend it’s body positivity tbh. Usually these people are just delusional, at least people knowing they have an ED, try to get better. I never heard of a completely healthy person physically and mentally to make fun or be disgusted by eating disorders. Usually the other extreme side of one ED is disgusted by the other. And the most vicious ones I saw were very heavy guys and  girls pretending they hate skinny ones. Any ED is difficult and I hope everyone recovers, but I really dislike their pseudo body positivity, because it’s usually positive only when the scale shows you obese. When it shows you underweight they suddenly hate you",
          "created_utc": 1717459651.0
        }
      ]
    },
    {
      "id": "l7izzj6",
      "author": "missmelodydoesitall",
      "body": "i agree with what u said. but, as someone who has had an eating disorder for the past 5 years as well as struggled with substance use. no one has more compassion for drug addicts. the way substance addicts get treated is worse in my experience and opinion.",
      "created_utc": 1717767853.0,
      "score": 3,
      "context": [
        {
          "id": "l6ygp39",
          "author": "uselesstrash3",
          "body": "so real. ppl dont scoff at ppl with other disorders doing certain behaviours as if theyre trying to promote it, but for eds its ok??",
          "created_utc": 1717443209.0
        },
        {
          "id": "l6zy0kh",
          "author": "Mammoth_Exam1354",
          "body": "Well if you put it this way… I see your point.  Maybe we should just not judge anyone else! This would be ideal of course I am just not sure how realistic that is.\n\nI don’t know for a fact but I think somehow ED is misconstrued as Ann” optional” almost desired condition… like as if people choose to have this.  Nobody chooses to have ED and the truth is people die from it.\n\nI do know for a fact ED is not much different than another form of addiction.  But somehow people almost have more compassion for people with substance abuse…. I don’t know.  I am just rambling on here… I get your point.   This is another area where you just have to focus on you and not worry about what others say or think or do.  Just walk on minding your own business your issues and your actions\n\nWhat others think of me is none of my business.",
          "created_utc": 1717462848.0
        }
      ]
    },
    {
      "id": "l6yxysz",
      "author": "BookLover1888",
      "body": "The look on my aunt's face when I told her I was *very* familiar with all of the \"side effects\" of her Monjuro (constantly cold, low BP and pulse, chronic constipation) was rough. \n\nBut there's no denying that these \"side effects\" are the same as physical symptoms of malnourishment.\n\nEdit: I agree that we are in full backlash mode to body positivity and HAES. I'm so pissed I have to live through 2001 again. Groundhog Day from hell.",
      "created_utc": 1717448969.0,
      "score": 2,
      "context": [
        {
          "id": "l6yqjzb",
          "author": "BookLover1888",
          "body": "They assume it's driven by physical appearance (vanity) and not by psychological illness. I chalk it up to ignorance. \n\nHonestly, it's hard to fully blame them in a culture that embraces stabbing oneself in the stomach solely to achieve thinness. As the means to lose weight become more drastic, our behavior appears more normal.",
          "created_utc": 1717446472.0
        },
        {
          "id": "l6yweui",
          "author": "Sweaty-Payment-7175",
          "body": "I think you’re right on the mark about our behaviors appearing more normal in this “ozempic era”. We moved past the body positivity era and now it seems that they’re trying to normalize being dangerously thin and using any means to do so. It’s sad and triggering af, makes me feel too comfortable sometimes displaying disordered behaviors in public/around others",
          "created_utc": 1717448433.0
        }
      ]
    },
    {
      "id": "l7j4qo2",
      "author": "Mammoth_Exam1354",
      "body": "I see what you are saying I think I was saying comparatively. Like if we compare compassion and understanding one offers to someone with an ED or with substance abuse……. I was with an addict for far too long.  His addiction was explained away to veteran status family dysfunction ptsd… I mean you name it he had sympathy from everyone he met (he succumbed to his addiction in the end) … Ed does not get that… comparatively speaking I mean…. I think general consensus is people choose to not eat… but they do not choose drinking or popping pills.  ????Pills are blamed on doctors handing them out in abundance… \n\nbut really are they that much different?? I don’t know.  \n\nLike I said this is not scientific research or anything just my perceptions living in this society.",
      "created_utc": 1717769579.0,
      "score": 1,
      "context": [
        {
          "id": "l6ygp39",
          "author": "uselesstrash3",
          "body": "so real. ppl dont scoff at ppl with other disorders doing certain behaviours as if theyre trying to promote it, but for eds its ok??",
          "created_utc": 1717443209.0
        },
        {
          "id": "l6zy0kh",
          "author": "Mammoth_Exam1354",
          "body": "Well if you put it this way… I see your point.  Maybe we should just not judge anyone else! This would be ideal of course I am just not sure how realistic that is.\n\nI don’t know for a fact but I think somehow ED is misconstrued as Ann” optional” almost desired condition… like as if people choose to have this.  Nobody chooses to have ED and the truth is people die from it.\n\nI do know for a fact ED is not much different than another form of addiction.  But somehow people almost have more compassion for people with substance abuse…. I don’t know.  I am just rambling on here… I get your point.   This is another area where you just have to focus on you and not worry about what others say or think or do.  Just walk on minding your own business your issues and your actions\n\nWhat others think of me is none of my business.",
          "created_utc": 1717462848.0
        },
        {
          "id": "l7izzj6",
          "author": "missmelodydoesitall",
          "body": "i agree with what u said. but, as someone who has had an eating disorder for the past 5 years as well as struggled with substance use. no one has more compassion for drug addicts. the way substance addicts get treated is worse in my experience and opinion.",
          "created_utc": 1717767853.0
        }
      ]
    },
    {
      "id": "l6z074v",
      "author": "Sweaty-Payment-7175",
      "body": "It’s rough, and sad, how hard we have to try to get people to understand how sick we are. I find myself saying really blatant disordered things around family members sometimes, just so they stop brushing off my ED (not proud of that). And then we enter this day and age where we have to try even harder to feel valid because it seems like everyone is starving to be skinny. I hate society lol.",
      "created_utc": 1717449747.0,
      "score": 5,
      "context": [
        {
          "id": "l6yqjzb",
          "author": "BookLover1888",
          "body": "They assume it's driven by physical appearance (vanity) and not by psychological illness. I chalk it up to ignorance. \n\nHonestly, it's hard to fully blame them in a culture that embraces stabbing oneself in the stomach solely to achieve thinness. As the means to lose weight become more drastic, our behavior appears more normal.",
          "created_utc": 1717446472.0
        },
        {
          "id": "l6yweui",
          "author": "Sweaty-Payment-7175",
          "body": "I think you’re right on the mark about our behaviors appearing more normal in this “ozempic era”. We moved past the body positivity era and now it seems that they’re trying to normalize being dangerously thin and using any means to do so. It’s sad and triggering af, makes me feel too comfortable sometimes displaying disordered behaviors in public/around others",
          "created_utc": 1717448433.0
        },
        {
          "id": "l6yxysz",
          "author": "BookLover1888",
          "body": "The look on my aunt's face when I told her I was *very* familiar with all of the \"side effects\" of her Monjuro (constantly cold, low BP and pulse, chronic constipation) was rough. \n\nBut there's no denying that these \"side effects\" are the same as physical symptoms of malnourishment.\n\nEdit: I agree that we are in full backlash mode to body positivity and HAES. I'm so pissed I have to live through 2001 again. Groundhog Day from hell.",
          "created_utc": 1717448969.0
        }
      ]
    }
  ]
}