{
  "id": "1da20sv",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1717734107.0,
  "title": "What are some weird habits/addictions you’ve developed because of anorexia?",
  "selftext": "Although I’m fully recovered now, I’ve had numerous strange addictions. My most memorable one is that I would stock up on an insane amount of 0 calorie sweetener packets (Stevia, Splenda, etc.) and would just rip them open and eat them as a snack. It reached an extreme as to where I’d buy several boxes a day and consume nearly 300 packets in one sitting (major digestive issues entailed).\n\nWhat about you?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1da20sv/what_are_some_weird_habitsaddictions_youve/",
  "score": 242,
  "num_comments": 161,
  "comments": [
    {
      "id": "l7hd3fd",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1717734107.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7hghnn",
      "author": "die-tc0ke",
      "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
      "created_utc": 1717735958.0,
      "score": 176,
      "context": []
    },
    {
      "id": "l7hl4cm",
      "author": "brookleiaway",
      "body": "refusing to do anything joyful or comforting if i feel bloated bc i dont deserve it, stimulating things (eating, watching shows) shouldnt be done at the same time. This ones more of a health thing in general but drinking water, i have no idea how people can go all day without water, i feel so gross and dehydrated without it, and i cannot drink a non water beverage with my meal at all, i always need water or tea",
      "created_utc": 1717738641.0,
      "score": 145,
      "context": []
    },
    {
      "id": "l7hp2if",
      "author": "Main_Training3681",
      "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
      "created_utc": 1717741074.0,
      "score": 133,
      "context": []
    },
    {
      "id": "l7hfn0f",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717735486.0,
      "score": 67,
      "context": []
    },
    {
      "id": "l7her2m",
      "author": "None",
      "body": "Eating almost everything with a fork and knife because it takes longer to eat. Even in recovery now I still cut stuff up even though I’m not trying to eat less.",
      "created_utc": 1717735000.0,
      "score": 52,
      "context": []
    },
    {
      "id": "l7hz7ge",
      "author": "existentialismsim",
      "body": "I go to the supermarkets most days and just pace the aisles looking at the foods and imagining a life where I could just buy what I wanted, instead I read labels like the newspaper just out of calorie curiosity. \n\nI also watch to see what other people buy, it’s crazy to me that someone can just pick out an item and not think 20 times about it, my disorder finds comfort in knowing I can look but not buy, I hate this disease.",
      "created_utc": 1717748003.0,
      "score": 52,
      "context": []
    },
    {
      "id": "l7hek4s",
      "author": "Fitkratomgirl",
      "body": "Putting sugar free syrup and salt on lettuce and just eating it like that lol",
      "created_utc": 1717734896.0,
      "score": 42,
      "context": []
    },
    {
      "id": "l7hm5r1",
      "author": "littlecupcakekitten1",
      "body": " I have rituals around everything, and I must do them, or I'll feel like the world's going to end lmao. Some of the weirdest ones are counting how many times I chew my food and having to be over a certain number, counting banana slices, pieces of fruit, pieces of vegetables etc and having to be an even number. Of course, there are more usual ones like counting cals and steps.  I generally count a lot, and my life revolves around numbers. Ironically, I'm bad at math.",
      "created_utc": 1717739260.0,
      "score": 34,
      "context": []
    },
    {
      "id": "l7hh5by",
      "author": "Extension_Nerve_8233",
      "body": "Habitual showering.\nLicking chopstick and sticking into hot chocolate powder. \nAversion to bare feet on floors.\nConstant herbal tea drinking.\nSriracha/hot sauce makes anything feel like a meal. I eat sriracha and iceberg/pickles/cabbage.",
      "created_utc": 1717736323.0,
      "score": 25,
      "context": []
    },
    {
      "id": "l7hxxeg",
      "author": "ajjanaajjana",
      "body": "Eating with chopsticks (its not weird obviously but i only started using them as a means to eat slower, i'll even eat yoghurt with them)\n\nObsessing over health. I think I spend at least 3-4 hours of everyday researching different foods, nutrition, stalking ed forums, looking at thinspo, meal planning, staring at my cronometer app.\n\nNever going outside :((",
      "created_utc": 1717747073.0,
      "score": 19,
      "context": []
    },
    {
      "id": "l7i0f1z",
      "author": "veepeepee",
      "body": "Not eating for a day or so before a date because I can’t risk being bloated. Or being too embarrassed to eat in front of people cause they’ll think I’m disgusting for eating too much.",
      "created_utc": 1717748886.0,
      "score": 24,
      "context": []
    },
    {
      "id": "l7idhdw",
      "author": "Theicyblonde",
      "body": "I feel like a lot of us are thinking ‘shit where do I start’ - many many weird habits and addictions 🤣\n\nMy top 3:\n\n1. Protein bar hoarding and other safe foods - it started off as a small selection, probably around 10-20 in my bedside draw. Just before I went into hospital I had about 60-80 protein bars and other snacks/bars - kept some for so long they were out of date… had a huge box that I kept in my wardrobe and I would ‘re-organise’ it very very often… \n\n2. ‘Perfect’ routines and rituals - I felt like I couldn’t eat dinner unless it was dark, I had gone to the toilet twice, my hot water bottle was filled but before I started making food so it was at the right temperature when I ate, had to remake my made, light candles, turn my fairy lights on and find something to watch before I felt okay to eat… if I didn’t do any of those things I felt ‘wrong’ \n\n3. Only eating with one type of spoon or fork - and if I couldn’t find those specific things I would panic and refuse to eat anything (I liked the size and the shape, they were small and thin and to this day I still only use them and refuse to use other spoons, I think normal spoons are too big) \n\nAnd there are many many others… (like one that we called ‘food tourism’ - just walking around supermarkets looking at food but never buying it",
      "created_utc": 1717757776.0,
      "score": 23,
      "context": []
    },
    {
      "id": "l7im79r",
      "author": "fredarmisengangbang",
      "body": "i'm asexual and before AN i never masturbated... but i saw a lot of people online talking about using it to burn calories and distract from hunger, and i developed a masturbation addiction.",
      "created_utc": 1717762206.0,
      "score": 16,
      "context": []
    },
    {
      "id": "l7hxgxs",
      "author": "Living-Ant-5131",
      "body": "I think it's pretty common but only eating from cute pink baby bowls... I always said 'i like the design ' :( \n\nAnd eating tons of raw ginger every day, drinking herbal teas and taking supplements all day. But I mean like a maniac.",
      "created_utc": 1717746748.0,
      "score": 15,
      "context": []
    },
    {
      "id": "l7hguat",
      "author": "Alternative_Key4199",
      "body": "I used to invent replacements for things. Like Instead of slim fast powder shake and cows milk, I used the low cal almond milk with Splenda and vanilla extract.",
      "created_utc": 1717736152.0,
      "score": 12,
      "context": []
    },
    {
      "id": "l7jro9a",
      "author": "Kale6196",
      "body": "Waking up at the same time every morning to walk. Have a black coffee and wait for my family to begin eating because I don't want to seem greedy and eat by myself. Eat out of the same bowl, use the same spoon, make sure I'm in the perfect situation and watch a certain youtuber before eating. Each meal would ensue a walk and a workout. When I was at work, if I was hungry, I would just shove mustard packets in my mouth and suck out the sauce. I have to be clean and my room must be clean and everything must be done correctly. No short cuts.",
      "created_utc": 1717777390.0,
      "score": 13,
      "context": []
    },
    {
      "id": "l7hglz9",
      "author": "None",
      "body": "Unless my dinner has tomato sauce on it I won’t eat it, I don’t eat toast at all (I had to eat it like 5x a day in recovery so I’m sick of it for life)",
      "created_utc": 1717736025.0,
      "score": 10,
      "context": []
    },
    {
      "id": "l7i9dh8",
      "author": "leviackermanloverr",
      "body": "I count a lot when I eat or about to eat. I have to have a specific number of pieces and it cannot be 4 or 6, I also have to take 3, 5 or 7 bites from a food. And if I have a “bad number” of foods for example tomato slices, I have to calculate how many bites i have to take for it to turn into a “good number” and I also have to count how many bites I’ll take from all the food to make sure it’s not a bad number. \nI also HAVE to pee before any meal I cannot eat otherwise it just feels gross. \nI don’t like the feeling of metal cutlery but I have to eat with it because of my parents but I just hate the sound and the feeling in my mouth it just feels like too much. \nAlways eating the same foods because I cannot stand trying new things it has to be things that I am comfortable with. Also eating almost only soft foods because I don’t like chewy things. \nI could go on but yeah it’s quite a lot. \nI’m not very good at explaining so sorry if this doesn’t make sense :’ )",
      "created_utc": 1717755265.0,
      "score": 12,
      "context": []
    },
    {
      "id": "l7j9e5i",
      "author": "Electronic_Dream9056",
      "body": "consuming stupid amounts of black coffee or sugar free energy drinks. \nhaving to walk and cycle everywhere despite bad weather. \nexercising every day or every other day. \ndancing like crazy in front of the mirror. \nsmall bowls, small spoons. \nmushy foods or soups. or fruits and salads. \nall simple carbs make me super nervous. \nscared to cook foods. dont understand where food comes from. dont understand why i need to eat. getting very existential and meta about it. realizing im actually just ego tripping and being self centered. hating it. repeat. \nbody checking in windows all the time.",
      "created_utc": 1717771213.0,
      "score": 10,
      "context": []
    },
    {
      "id": "l7jaxtl",
      "author": "poisonedminds",
      "body": "I developped a very bad food shoplifting habit due to my anorexia. Apparently that is quite common. For me I would steal large amounts of food every single day, for years. I got caught twice but couldn't stop even with that.\n\nI'm in recovery now and completely stopped shoplifting. I don't even think about it anymore. I think the malnutrition did something to my brain that made me prone to shoplifting because as soon as I went through renutrition in the hospital, all urges disappeared and I don't think I would dare do it again.",
      "created_utc": 1717771744.0,
      "score": 10,
      "context": []
    },
    {
      "id": "l7i9fyy",
      "author": "Peanut2ur_Tostito",
      "body": "I take forever to it. My food usually gets cold. And I have the smallest spoon & fork.",
      "created_utc": 1717755311.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l7idx6z",
      "author": "d3vi_l",
      "body": "I don’t know where to start…Using smaller utensils and chopsticks always, i take my TIME with food whenever i eat, i have to pee and go number 2 before eating or else i’ll feel “dirty”, eating sitting down and i can’t eat from pots or pans",
      "created_utc": 1717758023.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l7l9gcv",
      "author": "knoppersnutbar",
      "body": "Reading the answers in this thread makes me feel less like a freak. It’s so comforting to know that other people have similar habits to me in a world where I feel totally alone with my ED struggles. \n\n1. Since I always eat in the evening I have to wash my makeup off and wear super comfortable and cozy clothes and get super comfortable before eating. Also my hair needs to be tied in a loose low ponytail.\n\n2. I drink several cans of zero sugar sodas a day because I hate water and it’s a way to keep my stomach full without food. Also zero sugar squash is fine but never plain water.\n\n3. If I dont have my big morning cup of super strong green tea on an empty stomach I feel like my day is ruined.\n\n4. If I do allow myself to eat something during the day (even if it’s a safe food) I will think about it all day and regret it, and therefore punish myself by eating less in the evening or not at all.\n\n5. Obviously tracking everything via food apps.\n\n6. Always stocking up on celery, cucumbers, tomatoes, radishes, zucchini and mushrooms.\n\n7. Last but not least: eating extremely spicy food. I use hot red chili flakes on everything. Also sriracha, tabasco, sambal oelek, jalapeños and habanero like crazy. I consume so much of it that I feel like non spicy food is kind of lame and boring so I always spice up my low cal veggies.",
      "created_utc": 1717795803.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l7jk89v",
      "author": "FoxGirl-NotFurry-03",
      "body": "I keep asking permission to eat or ask if it's okay. I was so deep in the disorder at one point that I truly thought it wasn't okay to eat. I still feel guilty whenever I eat so I almost need to consistently ask for reassurance it is in fact okay to eat..",
      "created_utc": 1717774906.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l7ki09c",
      "author": "purplepigs88",
      "body": "i would eat a shit tone of no suger jelly until i was absolutely stuffed before i done my shopping because when i go shopping on a empty stomach i go crazy\n(i still do this now sometimes to save money so i dont buy loads of food that i will waste but i do it for better reasons now)",
      "created_utc": 1717786214.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l7hucfq",
      "author": "starving_artist02",
      "body": "I know this seems random but i dip everything into my cola zero ☠️☠️ \nMy family id very much a foodie family and we always have home made dips so i guess i just wanna fit in and i end up dipping like my popcorn and chips into the cola",
      "created_utc": 1717744547.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l7i3w6h",
      "author": "Awkward-Bottle-3857",
      "body": "chewing food for a really long time before i swallow it",
      "created_utc": 1717751423.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l7i8fhl",
      "author": "Emergency_Document96",
      "body": "I have a lot of weird habits I am actually ashamed of. I have to eat dinner from a specific bowl (I bought a second identical one for when the other is dirty), I am counting the fruit in my breakfast and it has to be a specific number (like 5 raspberries, 15 blueberries), when preparing the dinner plates, my plate has to have less food than my boyfriend's, but I like to it to look like it has a lot of volume. I consume excessive amounts of sugar alternatives and I cut baked goods with a ruler to make sure they have the same calorie content (I know this is not how this works).",
      "created_utc": 1717754643.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l7igd0o",
      "author": "shampoobittle",
      "body": "I drink sooo much water. Whenever I felt hungry, I’d drink a ton of water so the hunger would feel a tiny bit satiated.",
      "created_utc": 1717759347.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l7itlvn",
      "author": "AGoodKnave",
      "body": "EXTREMELY hot food. Like, cause a blister on the roof of your mouth hot. This used to be for Bad Reasons, but now I just like my food to stay warmer for longer so I can enjoy it for longer.",
      "created_utc": 1717765413.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l7ki375",
      "author": "Ok_You1594",
      "body": "I mean this is probably a very common one but constant body/mirror checking. It isn’t obvious to everyone, but like when I’m walking past windows that mirror, or even mirrors/reflective surfaces I can’t help but body check to see what I look like at every angle/walking etc. it isn’t always conscious, and very habitual",
      "created_utc": 1717786242.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l7ldy30",
      "author": "Snekkeroni",
      "body": "I also still sometimes eat 0 cal sweeteners as a snack despite being in recovery and eating regular snacks with it. I also hoard snacks in my room, chips, granola bars, protein bars, candy. Practically everything. I also drink a bunch of water every time i eat because I used to do it to get fuller quicker, but it carried on despite eating regular meals and not restricting.",
      "created_utc": 1717797619.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l7jc4ct",
      "author": "Jayisme0",
      "body": "Idk if it’s weird for everyone for but for I NEED a drink with every meal, while I used to never care. Also I only use diet condiments",
      "created_utc": 1717772147.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l7jvh2h",
      "author": "WideAtmosphere",
      "body": "Chew-spit.",
      "created_utc": 1717778681.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l7kl8xn",
      "author": "ClNNAMONROLL",
      "body": "Chugging copious amounts of water in a matter of seconds. Idk how I'm able to do it this fast tbh but it started as compulsive water drinking before eating.",
      "created_utc": 1717787322.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l7loezo",
      "author": "ScubaGurrl00",
      "body": "The worst addiction I ended up with due to my eating disorder: nicotine. I started vaping thinking it would reduce my appetite and help me lose weight, but now I’m at an even higher weight and have a vaping habit I just can’t kick.\n\nIf you’re thinking about starting, please don’t. It’s not worth it.",
      "created_utc": 1717801813.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l87rdzc",
      "author": "Melx_Portals17",
      "body": "Here's a weird one, stealing. I developed an energy drink addiction and started stealing energy drinks so I could save money ",
      "created_utc": 1718160818.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l7iat80",
      "author": "mooseyage",
      "body": "I did the same thing! I’d even pick different brands for a variety of taste/texture. in artificial sweetener. 🤦🏽‍♀️😅",
      "created_utc": 1717756189.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l7ipq23",
      "author": "maxdiscomfort",
      "body": "waking up before noon because my apple watch wanted me to get 12 stand hours and i was obsessed with filling my rings",
      "created_utc": 1717763783.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l7kwcqq",
      "author": "Souichis_mouth_nails",
      "body": "Majorlyyyy hoarding food,, like I used to buy so much “junk” and let it just sit in my room because I HAD to have it but I wouldn’t let myself eat any of it.",
      "created_utc": 1717791148.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l7ndorr",
      "author": "DrunkenChemist_",
      "body": "I was diagnosed with anorexia nervosa 13 years ago and I’ve been doing better in the past 3 years. Though I still have a habit of weighing every single grams of food that I eat, calculating how much calories they have, and putting them into small lunchboxes. Basically I’m still tracking everything that I ate. I also like to cut my food into small pieces and then again, putting them into small lunchboxes I also still have the habit (or feeling obligated ) to weigh myself in the morning, almost every day. To make sure that I don’t gain any weight.",
      "created_utc": 1717833961.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l7nqwob",
      "author": "Metastazie",
      "body": "1. Hoarding protein/chocolate bars and other snacks\n\n2. Food time \n\n3. Using only flavdrops to flavour anything\n\n4. Using small utensils",
      "created_utc": 1717843675.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l7kzd41",
      "author": "to-the-moon-andback",
      "body": "Eating absolutely everything with chopsticks",
      "created_utc": 1717792196.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7lb9fb",
      "author": "Altruistic_Door8859",
      "body": "I used to eat bread yeast because it was low cal and kinda had that bread taste. Not going to lie, I still crave it sometimes.",
      "created_utc": 1717796562.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7lr0iy",
      "author": "catsinsunglassess",
      "body": "I basically went from severe restriction to now being overweight. One thing i have a very difficult time stopping, despite eating whatever i want, is the guilt i feel for eating any solid food before 12pm. It’s just this unbreakable rule that my brain will never let go. I also still weigh myself every day, and i have an entire ritual i still follow- wake up, pee, get butt naked, take my smart watch off, and weigh myself first thing every morning. It doesn’t matter if I’m gaining or losing i just *need to know*.\n\nEdit: someone else mentioned they hoard their safe foods and i didn’t even think of that as a behavior. I 100% hoard massive amounts of zucchini (my ultimate safe food) and chicken breasts. I buy these at the market in amounts that don’t make sense whether I’m restricting or not. It brings me comfort just having them in my cart and in my fridge.",
      "created_utc": 1717802869.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7ofwpk",
      "author": "Wild_Travel_8292",
      "body": "The amount of times I use the bathroom in a day determine how much I should eat",
      "created_utc": 1717856376.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l8aacpy",
      "author": "Zimsgirlfriend",
      "body": "-Having to have my meals at certain times  -Must use the bathroom before mealtime  -Having the same foods/drinks everyday  -Have to exercise at least a hour a day Need to be alone while having meals - Must have distractions during meals -Need to use kid tupperware -Have to have background noise  I know most of these seem odd but that's been my rules for my ed over the years even though I'm trying to overcome my ed rn the rules are quite hard to break. ",
      "created_utc": 1718207482.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l8iz4sd",
      "author": "Odd-Volume6673",
      "body": "Not eating at all at work and almost fainting multiple times a day. Also making sure I walk home from work. Lmfaoo. I’m a housekeeper and I’m constantly on my feet 24/7, but of course nothing is ever enough. ",
      "created_utc": 1718334276.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lfhlqy0",
      "author": "dani-loves-women",
      "body": "When I’m in bed I always do leg workouts like without even thinking sometimes it’s just automatic now",
      "created_utc": 1722261692.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7ipi2t",
      "author": "thebonefairy",
      "body": "I stacked 3 tablets bronkAid with my morning coffee and lunch coffee to make sure i wouldn't eat for the rest of the day. I only had broth as my meal with fiber tablets. I was thoroughly suicidal and the spiral would only stop if I cleaned my bathroom.\n\nToday,  I am fully recovered. I don't think at all about what I eat except to accommodate my IBS/collitis which was an original trigger for my anorexia. I am no longer suicidal. Odd how life does get better.:)",
      "created_utc": 1717763686.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l7hkz6s",
      "author": "GoddessEvangelista",
      "body": "Thank you for sharing the sweeteners thing, I've been feeling so isolated because I do the same.",
      "created_utc": 1717738556.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7hqiu1",
      "author": "Copperlaces20",
      "body": "Closing my mouth shut the whole time I’m in the shower lest any sodium get in my mouth from the water.",
      "created_utc": 1717742008.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7iyl0h",
      "author": "alexeiishungry",
      "body": "one of my weirdest ones was when i would drink hot chocolate mix with cold milk. it was like a powder that just sat on the top and mixed in a little. i would drink 3-6 cups a day",
      "created_utc": 1717767337.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7jt5bm",
      "author": "None",
      "body": "sitting on the floor while eating (?)",
      "created_utc": 1717777884.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7ky7kr",
      "author": "reg752",
      "body": "I buy loads of protein bars and don't eat most of them lol. I have a big plastic box full of different brands and flavours and I keep buying more. They end up out of date unless they are really genuinely tasty. Gum as well non stop",
      "created_utc": 1717791793.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7mhsjj",
      "author": "fuckinginfp",
      "body": "IM SO GLAD THE SPLENDA THING WASNT JUST ME🙏🏻🙏🏻🙏🏻",
      "created_utc": 1717814730.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7qzokd",
      "author": "AffectionatePen8684",
      "body": "Eating ice and watching chalk ASMR lmaoo idk maybe a nutrient deficiency….Still can’t kick it down to about two or three cups a day…",
      "created_utc": 1717892890.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l809hjt",
      "author": "None",
      "body": "Kitchen has to be spotless before I can eat. It's INSANE. I also used to spend like, $200 a week on groceries and just...stare at them in the fridge.\n\nUghggh g g hbggjh",
      "created_utc": 1718047239.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lsqbvhl",
      "author": "WholeDependent4271",
      "body": "I basically became obsessed with food waste: I volunteer at food waste companies, I am a toogoodtogo addict, I have eaten rotten foods because I dont want it to go to waste, I even scan my friends and family fridges looking for expired things to eat for it not to go to waste. It is draining as hell",
      "created_utc": 1729366234.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lveja44",
      "author": "grxyilli",
      "body": "When i was 15 (five months ago), I was emaciated to ghe weight of 16 kg at a height of 155 cm, I began to engage in the ritual of chewing and spitting out food, meticulously rinsing my mouth after each bite to ensure that no remnants remained and that no accidental caloric intake occurred through cephalic ingestion through my saliva. This was followed by a tedious routine of brushing my teeth and tongue to pristine cleanliness (albiet w/o toothpaste due to fear that it contained calories. Chew/spit process became an intense source of psychological satisfaction: chewing, spitting, rinsing, and brushing satiated me an illusion of absolute control, that even with food present in my mouth, I maintained the autonomy to expel every trace of potential calorie, a behavior driven by a deeply entrenched psychogenic impulse rooted in maintaining control during the chaos of my unstable domestic environment. I always had an innate predisposition for OCD, which manifested into Anorexia due to the sporadic blights of my household environment as I begun fixating over my numerical weight\n\nThis insane regimen led to an expenditure of calories so significant that I managed to lose 0.4 kg daily, resulting in an exponential drastic decrease from 42 kg to 16 kg within less than four months. my objective was to starve myself to death; I perceived death through anorexia as much more tranquil and enjoyable than platitudinal suicide. I also had a morbid vision of myself dying at 15, looking like an Egyptian mummy in my casket, romanticizibg the idealization of extreme atrophy.\n\nDuring this epoch, (thinking back its kind of embarrassingly humorous) I curated a 140-page document on Google Docs, morbidly scrutinizing every type of food, analyzing its textures, brand, and whether it felt overly unctuous or “fatty.” I would not even proceed to chew/spit the food if I couldn’t identify the type or brand as everything that touched my mouth must be recorded in this document in overt and austere detail or it would trigger profound neurotic distress. reinforcing my OCD.\n\nDespite drinking around 4L of water daily, I was severely dehydrated due to the utter lack of sodium and electrolytes. My lips would frequently crack and bleed, yet even blood was promptly spat out and my mouth cleansed, driven by an irrational fear that it might contain calories.\n\nMy inborn predisposition for OCD manifested into anorexia when the exogenous domestic instability and abuse exacerbated my need for control and autonomy. On June 11th, 2024, I concluded that my initial plan to succumb to death through anorexia was unattainable, as my guardians persisted in sending me to eating disorder treatment facilities. In response, I attempted suicide via refeeding syndrome by consuming an excessive amount of food daily. This led to terrifying peripheral edema, gastrointestinal paresis, and alternating tachycardia and bradycardia arrhythmias. To my dismay, these symptoms subsided after one month. Realizing my plan to die before turning 16 was thwarted, I ultimately gave up attempting to die through ED or Refeeding syndrome. I knew that no physician or psychiatrist could alleviate my profound psychosomatic torment; the enforced confinement in treatment units only intensified my sense of lost control, I understood that my environment was stipulated to change before my healing can commence. I identified the primary source of instability within my family and I was determined to ameliorate my internal psychological warfare, thus I distanced myself from the family members who inflicted torment upon me. Now I’m significantly better.",
      "created_utc": 1730750763.0,
      "score": 2,
      "context": []
    },
    {
      "id": "maiusd7",
      "author": "Deepspacechris",
      "body": "Drinking an enormous amount of Cola Zero and putting cinnamon on absolutely everything.",
      "created_utc": 1738484215.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh5j0dp",
      "author": "Front-Policy-1273",
      "body": "the food need to be perfect, food doesn't have to touch with each other or the calories would mix, more if something have pam, (if I do 40 minutes of cardio) eat 1 slice of bread (25 grams exactly) first, then 60 grams of chicken breast with nothing, 50g of broccoli and a Diet Coke, just eating in that orden if not the meal was not worth the calories and exercise",
      "created_utc": 1741668057.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7ixwgf",
      "author": "gorotika",
      "body": "I can't go anywhere without my waist trainer, and it's on all the time, it feels uncomfortable to be without it",
      "created_utc": 1717767080.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7iaphl",
      "author": "Mammoth_Exam1354",
      "body": "This did not make you sick?",
      "created_utc": 1717756123.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7kls8s",
      "author": "Stxry_mxth",
      "body": "Buy Coke Zero whenever we go to the store",
      "created_utc": 1717787505.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7y38r9",
      "author": "None",
      "body": "TW TW TW \n\nI smoke a lot, I don't care if it's unhealthy, I prefer smoking instead of eating. I also used (and don't want to stop sadly) other dr*gs.\n\nEND OF TW\n\nAlso I only use chopsticks (I am also half-asian so it doesn't seem weird) because you eat slower. I only use small bowls because it looks fuller than a plate. I can drink an insane amount of tea, coke zero and water. I also took the habits to LIE a lot about everything linked with food.",
      "created_utc": 1718018175.0,
      "score": 1,
      "context": []
    },
    {
      "id": "locu4lk",
      "author": "VirtualApricot",
      "body": "Gum, fruit adventure tic tacs, raw Splenda straight from the packets 😅 and I’ve gone through strange phases of food hyperfixations. At one time it was sugar free grape jelly. I was really into puffed wheat cereal for a minute. Right now it’s sugar free jolly ranchers",
      "created_utc": 1727010390.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m46j6oh",
      "author": "mayanabanana",
      "body": "I used to (and still kinda do) have weird rituals around food, like if I was eating with other people I wouldn't finish my food until they had. Also i used to be obsessed with exercise and I forced myself to do 500 squats everyday for a very long time and 10,000 steps on weekdays & 15,000 on weekends which I used to do by getting up at 4am every morning to walk laps around my kitchen (I was only 13)",
      "created_utc": 1735386663.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfimgqx",
      "author": "Alarming_Pop1976",
      "body": "I forced myself to use the bathroom at specific times",
      "created_utc": 1740872400.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgc49r9",
      "author": "Longjumping_Pipe_342",
      "body": "mustard. it's zero calorie and hit the spot when I wanted something savory. I would literally just eat mustard packets and I still put mustard on EVERYTHING.",
      "created_utc": 1741272495.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqog94r",
      "author": "Affectionate-Sell-69",
      "body": "I recovered years and years ago, but that's some of the things I remember:\n\n\\-Imagining my stomach as a small box, and think that everything I ate went into that box. So, even one apple occupies nearly half of the box. At some point, I was eating only one chickpea a day and thinking it was too much.\n\n\\-Showering after meals (especially with hot water) to feel clean again.\n\n\\-Must drink something hot, coffee or tea, after a meal, to clean the food.\n\n\\-Not using any oil when cooking and thinking that it's the most healthy thing ever, while my meals tasted disgusting.",
      "created_utc": 1746436915.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ms5f6r6",
      "author": "Throwawaymightdelet3",
      "body": "Snacking on mints",
      "created_utc": 1747166642.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n30s447",
      "author": "valevale_8888999",
      "body": "I drank 3 liters of coffee with stevia daily and planned my binges with fruit so as not to gain weight, but I thought I could eat 25 or 30 tangerines and then throw them up.",
      "created_utc": 1752467075.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n32uwvo",
      "author": "LobsterDelicious1265",
      "body": "I only eat one meal per day and if I have more than one then I can't eat anything the next day, sorta like I'm paying penance \n\n\nOhhh and also eating but not eating if you get me, like eating but not swallowing, so let's say if I'm feeling really low ill put the food in my mouth and then chew it but spit it out so that I don't swallow it and I'll do that for an entire meal",
      "created_utc": 1752502348.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7hrtwp",
      "author": "None",
      "body": "Me too! I go through sour mentos gum like there is no tomorrow",
      "created_utc": 1717742865.0,
      "score": 30,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        }
      ]
    },
    {
      "id": "l7jed0s",
      "author": "buildingbeautiful",
      "body": "omg so much cinnamon gum holy hell",
      "created_utc": 1717772920.0,
      "score": 9,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        }
      ]
    },
    {
      "id": "l7jzluf",
      "author": "selkieflying",
      "body": "Yuuuuup breaking the pack a day habit was ROUGH but not did my bank account thank me",
      "created_utc": 1717780075.0,
      "score": 6,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        }
      ]
    },
    {
      "id": "l7i9i30",
      "author": "WeirdGirl825",
      "body": "Me too!",
      "created_utc": 1717755350.0,
      "score": 1,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        }
      ]
    },
    {
      "id": "l7l2gkx",
      "author": "intergalacticowl",
      "body": "Dude! Me too!",
      "created_utc": 1717793281.0,
      "score": 1,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        }
      ]
    },
    {
      "id": "l8098yj",
      "author": "None",
      "body": "Dude even in recovery, I still NEED gum 😞",
      "created_utc": 1718047159.0,
      "score": 1,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        }
      ]
    },
    {
      "id": "l7l4xzi",
      "author": "knoppersnutbar",
      "body": "Heavy on this one",
      "created_utc": 1717794152.0,
      "score": 3,
      "context": [
        {
          "id": "l7hl4cm",
          "author": "brookleiaway",
          "body": "refusing to do anything joyful or comforting if i feel bloated bc i dont deserve it, stimulating things (eating, watching shows) shouldnt be done at the same time. This ones more of a health thing in general but drinking water, i have no idea how people can go all day without water, i feel so gross and dehydrated without it, and i cannot drink a non water beverage with my meal at all, i always need water or tea",
          "created_utc": 1717738641.0
        }
      ]
    },
    {
      "id": "l7iba0b",
      "author": "mooseyage",
      "body": "If i’m gonna eat, it has to be optimal conditions. Have to pee, clothes needs to be comfy/fit right, hands clean, can’t be wearing a hat, sleeves have to be pulled up, etc. Obviously a little different if i’m out to dinner/on a date/etc but yeah. i don’t make the rules lol",
      "created_utc": 1717756479.0,
      "score": 95,
      "context": [
        {
          "id": "l7hp2if",
          "author": "Main_Training3681",
          "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
          "created_utc": 1717741074.0
        }
      ]
    },
    {
      "id": "l7j2z7e",
      "author": "cloudberried",
      "body": "Same. Have to pee, have to change into comfortable clothes, remove all makeup, have a napkin and a full glass of water or I can’t start",
      "created_utc": 1717768944.0,
      "score": 32,
      "context": [
        {
          "id": "l7hp2if",
          "author": "Main_Training3681",
          "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
          "created_utc": 1717741074.0
        }
      ]
    },
    {
      "id": "l7hyxsi",
      "author": "existentialismsim",
      "body": "no same otherwise I feel too full to let myself enjoy it 🥲",
      "created_utc": 1717747807.0,
      "score": 20,
      "context": [
        {
          "id": "l7hp2if",
          "author": "Main_Training3681",
          "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
          "created_utc": 1717741074.0
        }
      ]
    },
    {
      "id": "l7itnmg",
      "author": "AGoodKnave",
      "body": "Like this makes absolutely no sense and so much sense at the same time.\n\nEdit: spelling",
      "created_utc": 1717765433.0,
      "score": 15,
      "context": [
        {
          "id": "l7hp2if",
          "author": "Main_Training3681",
          "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
          "created_utc": 1717741074.0
        }
      ]
    },
    {
      "id": "l7mi0d5",
      "author": "fuckinginfp",
      "body": "HEAVY ON EVERYTHING BEING PERFECT ELSE THE FOOD ISNT “WORTH IT”",
      "created_utc": 1717814834.0,
      "score": 15,
      "context": [
        {
          "id": "l7hp2if",
          "author": "Main_Training3681",
          "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
          "created_utc": 1717741074.0
        }
      ]
    },
    {
      "id": "l7i4u4y",
      "author": "NiceGuy1020",
      "body": "Naw that’s gotta be normal right…? Like how the hell does someone eat without peeing before-hand lmao",
      "created_utc": 1717752099.0,
      "score": 13,
      "context": [
        {
          "id": "l7hp2if",
          "author": "Main_Training3681",
          "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
          "created_utc": 1717741074.0
        }
      ]
    },
    {
      "id": "l7iubnv",
      "author": "Wtfisthis66",
      "body": "I think we are all different versions of the same person.",
      "created_utc": 1717765701.0,
      "score": 13,
      "context": [
        {
          "id": "l7hp2if",
          "author": "Main_Training3681",
          "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
          "created_utc": 1717741074.0
        }
      ]
    },
    {
      "id": "l7jp9jr",
      "author": "Kale6196",
      "body": "Absolutely. Pee, wash hands, make sure I'm in a warm condition, have my hair down, and a tall glass of water. Otherwise there's no point.",
      "created_utc": 1717776587.0,
      "score": 9,
      "context": [
        {
          "id": "l7hp2if",
          "author": "Main_Training3681",
          "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
          "created_utc": 1717741074.0
        }
      ]
    },
    {
      "id": "l7jznpb",
      "author": "selkieflying",
      "body": "Omg are u me",
      "created_utc": 1717780093.0,
      "score": 3,
      "context": [
        {
          "id": "l7hp2if",
          "author": "Main_Training3681",
          "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
          "created_utc": 1717741074.0
        }
      ]
    },
    {
      "id": "l7nqlak",
      "author": "Metastazie",
      "body": "Sameee",
      "created_utc": 1717843464.0,
      "score": 2,
      "context": [
        {
          "id": "l7hp2if",
          "author": "Main_Training3681",
          "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
          "created_utc": 1717741074.0
        }
      ]
    },
    {
      "id": "maivxjo",
      "author": "Deepspacechris",
      "body": "Last night I peed 3 times, spent 5 minutes cleaning up around my seating area and making sure I didn’t find any stray hairs that could make its way into my food (that took me hours to make because I had to count and recount every imaginable calories inn all the different orders I could add the ingredients). This was the only meal I had yesterday so I needed perfection. I also made sure that nobody would have the chance to interrupt me during eating because if they would take a bite from my food, comment on something on my plate or offer a condiment or fill up my glass with some drink that I don’t know has sugar or not in it will usually trigger a panic attack. If something unexpected happens during a meal I immediately get so stressed and when I lose control over something I might as well just give up before it spirals.",
      "created_utc": 1738484868.0,
      "score": 2,
      "context": [
        {
          "id": "l7hp2if",
          "author": "Main_Training3681",
          "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
          "created_utc": 1717741074.0
        }
      ]
    },
    {
      "id": "l7himrj",
      "author": "ihatethewordoof",
      "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
      "created_utc": 1717737169.0,
      "score": 28,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        }
      ]
    },
    {
      "id": "l7hgtio",
      "author": "Extension_Nerve_8233",
      "body": "My OCD is more pronounced than during recovery now. I cannot stand my bare feel on my apartment floors now and have to wear ballet shoes all the time at the house. I also shower several times a day lately. 🤦🏻‍♀️",
      "created_utc": 1717736141.0,
      "score": 12,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        }
      ]
    },
    {
      "id": "l7hy0k9",
      "author": "Grape-Suika",
      "body": "Have you considered laser hair removal? This is a game changer for me. Im only on session 3/10 but the difference is already so incredible. \nIn UK theres loads of affordable, reputable clinics",
      "created_utc": 1717747135.0,
      "score": 7,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        }
      ]
    },
    {
      "id": "l7l5dwy",
      "author": "Eli_is_the_swagg",
      "body": "im so glad someone else does this. im still considering fully recovering (im doing some harm reduction/ healing my body from my most recent crash diet) but im afraid to not know. i dont like seeing a high number, but id much rather see the number than not know what it is.",
      "created_utc": 1717794309.0,
      "score": 2,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        }
      ]
    },
    {
      "id": "l7mj38g",
      "author": "Xarismatic",
      "body": "You have my vote madam president.",
      "created_utc": 1717815357.0,
      "score": 2,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        }
      ]
    },
    {
      "id": "m3jy0z5",
      "author": "Typical_Ad_7291",
      "body": "Do you cook your own meals",
      "created_utc": 1735018051.0,
      "score": 1,
      "context": [
        {
          "id": "l7her2m",
          "author": "None",
          "body": "Eating almost everything with a fork and knife because it takes longer to eat. Even in recovery now I still cut stuff up even though I’m not trying to eat less.",
          "created_utc": 1717735000.0
        }
      ]
    },
    {
      "id": "l7i52di",
      "author": "NiceGuy1020",
      "body": "Dayum, yes - I also look at stuff and think “huh wouldn’t it be nice if I got this”. I pick up treats for my family that I otherwise wouldn’t buy for myself; do you do that?",
      "created_utc": 1717752267.0,
      "score": 7,
      "context": [
        {
          "id": "l7hz7ge",
          "author": "existentialismsim",
          "body": "I go to the supermarkets most days and just pace the aisles looking at the foods and imagining a life where I could just buy what I wanted, instead I read labels like the newspaper just out of calorie curiosity. \n\nI also watch to see what other people buy, it’s crazy to me that someone can just pick out an item and not think 20 times about it, my disorder finds comfort in knowing I can look but not buy, I hate this disease.",
          "created_utc": 1717748003.0
        }
      ]
    },
    {
      "id": "l7itoqu",
      "author": "AGoodKnave",
      "body": "Bruh.",
      "created_utc": 1717765445.0,
      "score": 11,
      "context": [
        {
          "id": "l7hek4s",
          "author": "Fitkratomgirl",
          "body": "Putting sugar free syrup and salt on lettuce and just eating it like that lol",
          "created_utc": 1717734896.0
        }
      ]
    },
    {
      "id": "l7i40b8",
      "author": "fuschiaoctopus",
      "body": "This legit sounds like ocd. I have ocd and I do most these things except I'm more about weighing foods on a scale and getting a certain number or serving rather than counting pieces. Ocd has really high comorbidity with eating disorders and especially AN, there's other people in this thread talking about having both. You may already know you have this but if not it's definitely something to look into, especially if you have a lot of rituals outside of food",
      "created_utc": 1717751505.0,
      "score": 12,
      "context": [
        {
          "id": "l7hm5r1",
          "author": "littlecupcakekitten1",
          "body": " I have rituals around everything, and I must do them, or I'll feel like the world's going to end lmao. Some of the weirdest ones are counting how many times I chew my food and having to be over a certain number, counting banana slices, pieces of fruit, pieces of vegetables etc and having to be an even number. Of course, there are more usual ones like counting cals and steps.  I generally count a lot, and my life revolves around numbers. Ironically, I'm bad at math.",
          "created_utc": 1717739260.0
        }
      ]
    },
    {
      "id": "l7jpntk",
      "author": "Kale6196",
      "body": "Everything has to be either an even number or a multiple of five.",
      "created_utc": 1717776717.0,
      "score": 3,
      "context": [
        {
          "id": "l7hm5r1",
          "author": "littlecupcakekitten1",
          "body": " I have rituals around everything, and I must do them, or I'll feel like the world's going to end lmao. Some of the weirdest ones are counting how many times I chew my food and having to be over a certain number, counting banana slices, pieces of fruit, pieces of vegetables etc and having to be an even number. Of course, there are more usual ones like counting cals and steps.  I generally count a lot, and my life revolves around numbers. Ironically, I'm bad at math.",
          "created_utc": 1717739260.0
        }
      ]
    },
    {
      "id": "l7hszhp",
      "author": "OversizedBeret",
      "body": "Can you elaborate on habitual showering?",
      "created_utc": 1717743625.0,
      "score": 5,
      "context": [
        {
          "id": "l7hh5by",
          "author": "Extension_Nerve_8233",
          "body": "Habitual showering.\nLicking chopstick and sticking into hot chocolate powder. \nAversion to bare feet on floors.\nConstant herbal tea drinking.\nSriracha/hot sauce makes anything feel like a meal. I eat sriracha and iceberg/pickles/cabbage.",
          "created_utc": 1717736323.0
        }
      ]
    },
    {
      "id": "l7j9wvh",
      "author": "GothxFeta",
      "body": "Numbers 2 and 3 point very much to the tizzy, but especially 3.\n(I am the tizzy and do all of the above)",
      "created_utc": 1717771391.0,
      "score": 2,
      "context": [
        {
          "id": "l7idhdw",
          "author": "Theicyblonde",
          "body": "I feel like a lot of us are thinking ‘shit where do I start’ - many many weird habits and addictions 🤣\n\nMy top 3:\n\n1. Protein bar hoarding and other safe foods - it started off as a small selection, probably around 10-20 in my bedside draw. Just before I went into hospital I had about 60-80 protein bars and other snacks/bars - kept some for so long they were out of date… had a huge box that I kept in my wardrobe and I would ‘re-organise’ it very very often… \n\n2. ‘Perfect’ routines and rituals - I felt like I couldn’t eat dinner unless it was dark, I had gone to the toilet twice, my hot water bottle was filled but before I started making food so it was at the right temperature when I ate, had to remake my made, light candles, turn my fairy lights on and find something to watch before I felt okay to eat… if I didn’t do any of those things I felt ‘wrong’ \n\n3. Only eating with one type of spoon or fork - and if I couldn’t find those specific things I would panic and refuse to eat anything (I liked the size and the shape, they were small and thin and to this day I still only use them and refuse to use other spoons, I think normal spoons are too big) \n\nAnd there are many many others… (like one that we called ‘food tourism’ - just walking around supermarkets looking at food but never buying it",
          "created_utc": 1717757776.0
        }
      ]
    },
    {
      "id": "l7jr1bz",
      "author": "Kale6196",
      "body": "Literally same. Asexual bc of trauma but masturbating is the perfect distraction.",
      "created_utc": 1717777176.0,
      "score": 6,
      "context": [
        {
          "id": "l7im79r",
          "author": "fredarmisengangbang",
          "body": "i'm asexual and before AN i never masturbated... but i saw a lot of people online talking about using it to burn calories and distract from hunger, and i developed a masturbation addiction.",
          "created_utc": 1717762206.0
        }
      ]
    },
    {
      "id": "l7ltwvs",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717804061.0,
      "score": 2,
      "context": [
        {
          "id": "l7hxgxs",
          "author": "Living-Ant-5131",
          "body": "I think it's pretty common but only eating from cute pink baby bowls... I always said 'i like the design ' :( \n\nAnd eating tons of raw ginger every day, drinking herbal teas and taking supplements all day. But I mean like a maniac.",
          "created_utc": 1717746748.0
        }
      ]
    },
    {
      "id": "le0k4p7",
      "author": "gtaslut",
      "body": "Me too :(",
      "created_utc": 1721435933.0,
      "score": 3,
      "context": [
        {
          "id": "l7jk89v",
          "author": "FoxGirl-NotFurry-03",
          "body": "I keep asking permission to eat or ask if it's okay. I was so deep in the disorder at one point that I truly thought it wasn't okay to eat. I still feel guilty whenever I eat so I almost need to consistently ask for reassurance it is in fact okay to eat..",
          "created_utc": 1717774906.0
        }
      ]
    },
    {
      "id": "l7ibmrj",
      "author": "mooseyage",
      "body": "i used to do pizza crust in coke (even as a kid, pre anorexia diagnosis), and french fries in coke, and it’s life changing",
      "created_utc": 1717756697.0,
      "score": 4,
      "context": [
        {
          "id": "l7hucfq",
          "author": "starving_artist02",
          "body": "I know this seems random but i dip everything into my cola zero ☠️☠️ \nMy family id very much a foodie family and we always have home made dips so i guess i just wanna fit in and i end up dipping like my popcorn and chips into the cola",
          "created_utc": 1717744547.0
        }
      ]
    },
    {
      "id": "lscl0uf",
      "author": "General_Outside3304",
      "body": "Same",
      "created_utc": 1729165703.0,
      "score": 2,
      "context": [
        {
          "id": "l7jvh2h",
          "author": "WideAtmosphere",
          "body": "Chew-spit.",
          "created_utc": 1717778681.0
        }
      ]
    },
    {
      "id": "mdc4lap",
      "author": "molluscsliketoparty",
      "body": "Yeast has B vitamins. So not the worst thing. 😂",
      "created_utc": 1739834312.0,
      "score": 2,
      "context": [
        {
          "id": "l7lb9fb",
          "author": "Altruistic_Door8859",
          "body": "I used to eat bread yeast because it was low cal and kinda had that bread taste. Not going to lie, I still crave it sometimes.",
          "created_utc": 1717796562.0
        }
      ]
    },
    {
      "id": "l7i4ygk",
      "author": "fuschiaoctopus",
      "body": "I mean I don't think the majority of people shower with their mouth open or want to drink shower water but tap water has a really insignificant amount of sodium in it in most countries. Even most bottled water has small amounts of sodium in it (like under 10 mgs per liter) so do you just not drink any water? \n\nSodium also isn't really bad for you unless you have hypertension, high blood pressure, or consume it in significant amounts regularly. It is a necessary electrolyte like potassium, magnesium, calcium, etc and it especially impacts your heart rhythm and blood pressure. While excessive sodium can cause high bp, restricting sodium too heavily can cause dangerously low BP, and many people who restrict already have low bp. If you feel horrible and weak all the time, your heart seems like it's beating weird, or frequently find yourself passing out or feeling like you will if you stand up, then you're probably restricting sodium way too much. Drinking water actually dilutes sodium levels despite the minor amount of sodium in water cause it flushes it out, so if you drink a lot of water and live in a hot environment where it's summer rn and you're sweating (you also sweat out sodium), please don't restrict sodium heavily. It's dangerous and will actually make you retain water (drastic changes in sodium levels either too high OR too low both cause water retention).",
      "created_utc": 1717752185.0,
      "score": 9,
      "context": [
        {
          "id": "l7hqiu1",
          "author": "Copperlaces20",
          "body": "Closing my mouth shut the whole time I’m in the shower lest any sodium get in my mouth from the water.",
          "created_utc": 1717742008.0
        }
      ]
    },
    {
      "id": "lvekeqz",
      "author": "None",
      "body": "Are you doing better now? I can’t even imagine 16kg at 155cm, I’m so sorry you went through that",
      "created_utc": 1730751096.0,
      "score": 1,
      "context": [
        {
          "id": "lveja44",
          "author": "grxyilli",
          "body": "When i was 15 (five months ago), I was emaciated to ghe weight of 16 kg at a height of 155 cm, I began to engage in the ritual of chewing and spitting out food, meticulously rinsing my mouth after each bite to ensure that no remnants remained and that no accidental caloric intake occurred through cephalic ingestion through my saliva. This was followed by a tedious routine of brushing my teeth and tongue to pristine cleanliness (albiet w/o toothpaste due to fear that it contained calories. Chew/spit process became an intense source of psychological satisfaction: chewing, spitting, rinsing, and brushing satiated me an illusion of absolute control, that even with food present in my mouth, I maintained the autonomy to expel every trace of potential calorie, a behavior driven by a deeply entrenched psychogenic impulse rooted in maintaining control during the chaos of my unstable domestic environment. I always had an innate predisposition for OCD, which manifested into Anorexia due to the sporadic blights of my household environment as I begun fixating over my numerical weight\n\nThis insane regimen led to an expenditure of calories so significant that I managed to lose 0.4 kg daily, resulting in an exponential drastic decrease from 42 kg to 16 kg within less than four months. my objective was to starve myself to death; I perceived death through anorexia as much more tranquil and enjoyable than platitudinal suicide. I also had a morbid vision of myself dying at 15, looking like an Egyptian mummy in my casket, romanticizibg the idealization of extreme atrophy.\n\nDuring this epoch, (thinking back its kind of embarrassingly humorous) I curated a 140-page document on Google Docs, morbidly scrutinizing every type of food, analyzing its textures, brand, and whether it felt overly unctuous or “fatty.” I would not even proceed to chew/spit the food if I couldn’t identify the type or brand as everything that touched my mouth must be recorded in this document in overt and austere detail or it would trigger profound neurotic distress. reinforcing my OCD.\n\nDespite drinking around 4L of water daily, I was severely dehydrated due to the utter lack of sodium and electrolytes. My lips would frequently crack and bleed, yet even blood was promptly spat out and my mouth cleansed, driven by an irrational fear that it might contain calories.\n\nMy inborn predisposition for OCD manifested into anorexia when the exogenous domestic instability and abuse exacerbated my need for control and autonomy. On June 11th, 2024, I concluded that my initial plan to succumb to death through anorexia was unattainable, as my guardians persisted in sending me to eating disorder treatment facilities. In response, I attempted suicide via refeeding syndrome by consuming an excessive amount of food daily. This led to terrifying peripheral edema, gastrointestinal paresis, and alternating tachycardia and bradycardia arrhythmias. To my dismay, these symptoms subsided after one month. Realizing my plan to die before turning 16 was thwarted, I ultimately gave up attempting to die through ED or Refeeding syndrome. I knew that no physician or psychiatrist could alleviate my profound psychosomatic torment; the enforced confinement in treatment units only intensified my sense of lost control, I understood that my environment was stipulated to change before my healing can commence. I identified the primary source of instability within my family and I was determined to ameliorate my internal psychological warfare, thus I distanced myself from the family members who inflicted torment upon me. Now I’m significantly better.",
          "created_utc": 1730750763.0
        }
      ]
    },
    {
      "id": "l7n3qfl",
      "author": "None",
      "body": "It caused really severe digestion issues and was the cause of really high inflammatory markers in my blood (like 5 times the normal amount of somebody healthy). Thankfully when I returned to a sustainable diet everything went back to normal, but it was a struggle to get back on track.",
      "created_utc": 1717826995.0,
      "score": 2,
      "context": [
        {
          "id": "l7iaphl",
          "author": "Mammoth_Exam1354",
          "body": "This did not make you sick?",
          "created_utc": 1717756123.0
        }
      ]
    },
    {
      "id": "l7jnk6d",
      "author": "die-tc0ke",
      "body": "omg sour mentos is the BEST",
      "created_utc": 1717776017.0,
      "score": 7,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        },
        {
          "id": "l7hrtwp",
          "author": "None",
          "body": "Me too! I go through sour mentos gum like there is no tomorrow",
          "created_utc": 1717742865.0
        }
      ]
    },
    {
      "id": "l7l323j",
      "author": "Bellissimabee",
      "body": "How did u manage to do it? I'm spending £250 a month on gum, the cost of the packets have gone up so much and I've been spending this every month for the last 6 years, I've got no savings and once the bills are paid I have 0 left over, I've not  had a haircut in 3 years because I need every penny, not brought new clothes, etc. That money could get me a nice holiday or wardrobe, I'm desperate to break free of it, but I can't take the hunger pains all day. Any tips to quit would help please.",
      "created_utc": 1717793491.0,
      "score": 6,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        },
        {
          "id": "l7jzluf",
          "author": "selkieflying",
          "body": "Yuuuuup breaking the pack a day habit was ROUGH but not did my bank account thank me",
          "created_utc": 1717780075.0
        }
      ]
    },
    {
      "id": "l8u25id",
      "author": "Bellissimabee",
      "body": "Is that because you're still restricting? I was kind of hoping that when and if I'm ever ready to recover that would be the end of this addiction and I could be strong enough to not slip back in to it. 😢",
      "created_utc": 1718525921.0,
      "score": 1,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        },
        {
          "id": "l8098yj",
          "author": "None",
          "body": "Dude even in recovery, I still NEED gum 😞",
          "created_utc": 1718047159.0
        }
      ]
    },
    {
      "id": "l7me0lr",
      "author": "YukiHase",
      "body": "My hair has to be tied up. I can't have it getting in my way!",
      "created_utc": 1717812949.0,
      "score": 6,
      "context": [
        {
          "id": "l7hp2if",
          "author": "Main_Training3681",
          "body": "I have to pee before I eat or else the food isn’t worth it (I don’t make the rules)",
          "created_utc": 1717741074.0
        },
        {
          "id": "l7jp9jr",
          "author": "Kale6196",
          "body": "Absolutely. Pee, wash hands, make sure I'm in a warm condition, have my hair down, and a tall glass of water. Otherwise there's no point.",
          "created_utc": 1717776587.0
        }
      ]
    },
    {
      "id": "l7hjrs4",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717737835.0,
      "score": 7,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        }
      ]
    },
    {
      "id": "l7jgm9r",
      "author": "Equivalent-Act-2739",
      "body": "It does give me a lot of comfort and overall awareness. I see it as self care. I actually started counting calories as a method of recovery. But I'm fairly lenient. Like you, I eat whatever I want, however much I want. I prefer to count and track most days. I just spent a week on a work related trip and I'm so ready to get back to tracking today and just relax into my comfort zone.",
      "created_utc": 1717773687.0,
      "score": 3,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        }
      ]
    },
    {
      "id": "m3jxvts",
      "author": "Typical_Ad_7291",
      "body": "What happens if you go over",
      "created_utc": 1735017980.0,
      "score": 1,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        }
      ]
    },
    {
      "id": "l7hi0si",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717736818.0,
      "score": 15,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7hgtio",
          "author": "Extension_Nerve_8233",
          "body": "My OCD is more pronounced than during recovery now. I cannot stand my bare feel on my apartment floors now and have to wear ballet shoes all the time at the house. I also shower several times a day lately. 🤦🏻‍♀️",
          "created_utc": 1717736141.0
        }
      ]
    },
    {
      "id": "l7me0kq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717812949.0,
      "score": 1,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7hy0k9",
          "author": "Grape-Suika",
          "body": "Have you considered laser hair removal? This is a game changer for me. Im only on session 3/10 but the difference is already so incredible. \nIn UK theres loads of affordable, reputable clinics",
          "created_utc": 1717747135.0
        }
      ]
    },
    {
      "id": "l7me9go",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717813062.0,
      "score": 1,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7l5dwy",
          "author": "Eli_is_the_swagg",
          "body": "im so glad someone else does this. im still considering fully recovering (im doing some harm reduction/ healing my body from my most recent crash diet) but im afraid to not know. i dont like seeing a high number, but id much rather see the number than not know what it is.",
          "created_utc": 1717794309.0
        }
      ]
    },
    {
      "id": "l7ira7n",
      "author": "existentialismsim",
      "body": "Absolutely, I love seeing something and thinking “ooh they’ll like this!” Especially for my partner, it’s heart breaking I can’t see myself in the same way and buy something purely out of the though I’d enjoy it but my brain physically will not allow it",
      "created_utc": 1717764454.0,
      "score": 8,
      "context": [
        {
          "id": "l7hz7ge",
          "author": "existentialismsim",
          "body": "I go to the supermarkets most days and just pace the aisles looking at the foods and imagining a life where I could just buy what I wanted, instead I read labels like the newspaper just out of calorie curiosity. \n\nI also watch to see what other people buy, it’s crazy to me that someone can just pick out an item and not think 20 times about it, my disorder finds comfort in knowing I can look but not buy, I hate this disease.",
          "created_utc": 1717748003.0
        },
        {
          "id": "l7i52di",
          "author": "NiceGuy1020",
          "body": "Dayum, yes - I also look at stuff and think “huh wouldn’t it be nice if I got this”. I pick up treats for my family that I otherwise wouldn’t buy for myself; do you do that?",
          "created_utc": 1717752267.0
        }
      ]
    },
    {
      "id": "l7ketcn",
      "author": "Fitkratomgirl",
      "body": "Yup lmao",
      "created_utc": 1717785137.0,
      "score": 2,
      "context": [
        {
          "id": "l7hek4s",
          "author": "Fitkratomgirl",
          "body": "Putting sugar free syrup and salt on lettuce and just eating it like that lol",
          "created_utc": 1717734896.0
        },
        {
          "id": "l7itoqu",
          "author": "AGoodKnave",
          "body": "Bruh.",
          "created_utc": 1717765445.0
        }
      ]
    },
    {
      "id": "l7idj0q",
      "author": "littlecupcakekitten1",
      "body": "Thank you for your input. My therapist told me that I definitely have obsessive traits, but she can't diagnose me with OCD because she's not a psychiatrist. I have rituals outside of food and some intrusive thoughts. Honestly, I just recently found out that I could have OCD and didn't bother to seek the diagnosis because I'm just so tired of doctors, psychiatrists, and institutions. I was diagnosed with BPD and AN at 19, then substance abuse disorder at 21, was in and out different treatments and hospitals, and I'm just so, so tired. Since I'm at least  clean from substances and have my AN semi under control (I harm reduce as much as I can), it's not a priority for me to seek another diagnosis at the moment. I just think even more interactions with doctors would be worse for my mental health at the moment. \n\nBut I am genuinely thankful for your input. It's kinda comforting knowing that someone else does similar things and that there's an explanation for that. I'll research what are the perks of getting the dx in my country, like if there's anything that could help me manage the behaviors and thoughts.\n\nAlso, sorry for the long response, I felt like I needed to explain all the context, haha.",
      "created_utc": 1717757801.0,
      "score": 3,
      "context": [
        {
          "id": "l7hm5r1",
          "author": "littlecupcakekitten1",
          "body": " I have rituals around everything, and I must do them, or I'll feel like the world's going to end lmao. Some of the weirdest ones are counting how many times I chew my food and having to be over a certain number, counting banana slices, pieces of fruit, pieces of vegetables etc and having to be an even number. Of course, there are more usual ones like counting cals and steps.  I generally count a lot, and my life revolves around numbers. Ironically, I'm bad at math.",
          "created_utc": 1717739260.0
        },
        {
          "id": "l7i40b8",
          "author": "fuschiaoctopus",
          "body": "This legit sounds like ocd. I have ocd and I do most these things except I'm more about weighing foods on a scale and getting a certain number or serving rather than counting pieces. Ocd has really high comorbidity with eating disorders and especially AN, there's other people in this thread talking about having both. You may already know you have this but if not it's definitely something to look into, especially if you have a lot of rituals outside of food",
          "created_utc": 1717751505.0
        }
      ]
    },
    {
      "id": "l7i7jn0",
      "author": "dietcrackcocaine",
      "body": "Tbh I relate and for me it's cause it makes me feel new and pure and it's like I'm cleansing myself from eating. The other thing is long showers burn calories. It gets annoying and obsessive and my ocd contributes to this",
      "created_utc": 1717754040.0,
      "score": 14,
      "context": [
        {
          "id": "l7hh5by",
          "author": "Extension_Nerve_8233",
          "body": "Habitual showering.\nLicking chopstick and sticking into hot chocolate powder. \nAversion to bare feet on floors.\nConstant herbal tea drinking.\nSriracha/hot sauce makes anything feel like a meal. I eat sriracha and iceberg/pickles/cabbage.",
          "created_utc": 1717736323.0
        },
        {
          "id": "l7hszhp",
          "author": "OversizedBeret",
          "body": "Can you elaborate on habitual showering?",
          "created_utc": 1717743625.0
        }
      ]
    },
    {
      "id": "l7iqhdf",
      "author": "Extension_Nerve_8233",
      "body": "I shower A LOT. I’m on the spectrum so some of it is sensory and other reasons OCD and others bc I live in a HOT state. Shower bc of the feeling of bug spray, Sun lotion, after washing dishes, after eating etc. Not long showers, but also rinsing off.",
      "created_utc": 1717764112.0,
      "score": 6,
      "context": [
        {
          "id": "l7hh5by",
          "author": "Extension_Nerve_8233",
          "body": "Habitual showering.\nLicking chopstick and sticking into hot chocolate powder. \nAversion to bare feet on floors.\nConstant herbal tea drinking.\nSriracha/hot sauce makes anything feel like a meal. I eat sriracha and iceberg/pickles/cabbage.",
          "created_utc": 1717736323.0
        },
        {
          "id": "l7hszhp",
          "author": "OversizedBeret",
          "body": "Can you elaborate on habitual showering?",
          "created_utc": 1717743625.0
        }
      ]
    },
    {
      "id": "l7lxzji",
      "author": "-Tricky-Vixen-",
      "body": "Metabolism booster, at a guess?",
      "created_utc": 1717805787.0,
      "score": 1,
      "context": [
        {
          "id": "l7hxgxs",
          "author": "Living-Ant-5131",
          "body": "I think it's pretty common but only eating from cute pink baby bowls... I always said 'i like the design ' :( \n\nAnd eating tons of raw ginger every day, drinking herbal teas and taking supplements all day. But I mean like a maniac.",
          "created_utc": 1717746748.0
        },
        {
          "id": "l7ltwvs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717804061.0
        }
      ]
    },
    {
      "id": "l7irvi2",
      "author": "starving_artist02",
      "body": "YESSS not the pizza part tho since i never really liked pizza but the friesss!!",
      "created_utc": 1717764701.0,
      "score": 3,
      "context": [
        {
          "id": "l7hucfq",
          "author": "starving_artist02",
          "body": "I know this seems random but i dip everything into my cola zero ☠️☠️ \nMy family id very much a foodie family and we always have home made dips so i guess i just wanna fit in and i end up dipping like my popcorn and chips into the cola",
          "created_utc": 1717744547.0
        },
        {
          "id": "l7ibmrj",
          "author": "mooseyage",
          "body": "i used to do pizza crust in coke (even as a kid, pre anorexia diagnosis), and french fries in coke, and it’s life changing",
          "created_utc": 1717756697.0
        }
      ]
    },
    {
      "id": "lves2th",
      "author": "grxyilli",
      "body": "Yes, I have made a full recovery but I acknowledge that I will likely forever be bound by my innate predisposition for Anorexia. When I fall back into my inhibitions, these emotions still resurge. No medicine nor psychotherapy can cure it, I simply reassure myself of my worth and remind myself “momentum mori”, one day I’m going to die anyways thus life should be free of obligations and I shouldn’t feel obliged to achieve a certain extremity of “skinniness”. I’m doing significantly better now and feel liberated from my morbid notions of being emaciated.",
      "created_utc": 1730753354.0,
      "score": 1,
      "context": [
        {
          "id": "lveja44",
          "author": "grxyilli",
          "body": "When i was 15 (five months ago), I was emaciated to ghe weight of 16 kg at a height of 155 cm, I began to engage in the ritual of chewing and spitting out food, meticulously rinsing my mouth after each bite to ensure that no remnants remained and that no accidental caloric intake occurred through cephalic ingestion through my saliva. This was followed by a tedious routine of brushing my teeth and tongue to pristine cleanliness (albiet w/o toothpaste due to fear that it contained calories. Chew/spit process became an intense source of psychological satisfaction: chewing, spitting, rinsing, and brushing satiated me an illusion of absolute control, that even with food present in my mouth, I maintained the autonomy to expel every trace of potential calorie, a behavior driven by a deeply entrenched psychogenic impulse rooted in maintaining control during the chaos of my unstable domestic environment. I always had an innate predisposition for OCD, which manifested into Anorexia due to the sporadic blights of my household environment as I begun fixating over my numerical weight\n\nThis insane regimen led to an expenditure of calories so significant that I managed to lose 0.4 kg daily, resulting in an exponential drastic decrease from 42 kg to 16 kg within less than four months. my objective was to starve myself to death; I perceived death through anorexia as much more tranquil and enjoyable than platitudinal suicide. I also had a morbid vision of myself dying at 15, looking like an Egyptian mummy in my casket, romanticizibg the idealization of extreme atrophy.\n\nDuring this epoch, (thinking back its kind of embarrassingly humorous) I curated a 140-page document on Google Docs, morbidly scrutinizing every type of food, analyzing its textures, brand, and whether it felt overly unctuous or “fatty.” I would not even proceed to chew/spit the food if I couldn’t identify the type or brand as everything that touched my mouth must be recorded in this document in overt and austere detail or it would trigger profound neurotic distress. reinforcing my OCD.\n\nDespite drinking around 4L of water daily, I was severely dehydrated due to the utter lack of sodium and electrolytes. My lips would frequently crack and bleed, yet even blood was promptly spat out and my mouth cleansed, driven by an irrational fear that it might contain calories.\n\nMy inborn predisposition for OCD manifested into anorexia when the exogenous domestic instability and abuse exacerbated my need for control and autonomy. On June 11th, 2024, I concluded that my initial plan to succumb to death through anorexia was unattainable, as my guardians persisted in sending me to eating disorder treatment facilities. In response, I attempted suicide via refeeding syndrome by consuming an excessive amount of food daily. This led to terrifying peripheral edema, gastrointestinal paresis, and alternating tachycardia and bradycardia arrhythmias. To my dismay, these symptoms subsided after one month. Realizing my plan to die before turning 16 was thwarted, I ultimately gave up attempting to die through ED or Refeeding syndrome. I knew that no physician or psychiatrist could alleviate my profound psychosomatic torment; the enforced confinement in treatment units only intensified my sense of lost control, I understood that my environment was stipulated to change before my healing can commence. I identified the primary source of instability within my family and I was determined to ameliorate my internal psychological warfare, thus I distanced myself from the family members who inflicted torment upon me. Now I’m significantly better.",
          "created_utc": 1730750763.0
        },
        {
          "id": "lvekeqz",
          "author": "None",
          "body": "Are you doing better now? I can’t even imagine 16kg at 155cm, I’m so sorry you went through that",
          "created_utc": 1730751096.0
        }
      ]
    },
    {
      "id": "l7lmhc1",
      "author": "lola-at-teatime",
      "body": "Wait, isn't gum making you more hungry?? It triggers the release of stomach acid. This is why you should eat gum after eating, to produce saliva that will help clean your teeth.",
      "created_utc": 1717801032.0,
      "score": 2,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        },
        {
          "id": "l7jzluf",
          "author": "selkieflying",
          "body": "Yuuuuup breaking the pack a day habit was ROUGH but not did my bank account thank me",
          "created_utc": 1717780075.0
        },
        {
          "id": "l7l323j",
          "author": "Bellissimabee",
          "body": "How did u manage to do it? I'm spending £250 a month on gum, the cost of the packets have gone up so much and I've been spending this every month for the last 6 years, I've got no savings and once the bills are paid I have 0 left over, I've not  had a haircut in 3 years because I need every penny, not brought new clothes, etc. That money could get me a nice holiday or wardrobe, I'm desperate to break free of it, but I can't take the hunger pains all day. Any tips to quit would help please.",
          "created_utc": 1717793491.0
        }
      ]
    },
    {
      "id": "l8wx8ee",
      "author": "None",
      "body": "Nah, I actually lift weights & eat about 1000 calories more than most people, but I'm smaller than I've ever been. Weight lifting!\n\nThe gum just helps me from eating out of boredom & also with the anxiety",
      "created_utc": 1718572826.0,
      "score": 1,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        },
        {
          "id": "l8098yj",
          "author": "None",
          "body": "Dude even in recovery, I still NEED gum 😞",
          "created_utc": 1718047159.0
        },
        {
          "id": "l8u25id",
          "author": "Bellissimabee",
          "body": "Is that because you're still restricting? I was kind of hoping that when and if I'm ever ready to recover that would be the end of this addiction and I could be strong enough to not slip back in to it. 😢",
          "created_utc": 1718525921.0
        }
      ]
    },
    {
      "id": "l7jh3v3",
      "author": "Equivalent-Act-2739",
      "body": "Lol I track my sleep as well. That's not sad though. It's amazing!",
      "created_utc": 1717773854.0,
      "score": 3,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "l7hjrs4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717737835.0
        }
      ]
    },
    {
      "id": "l7hv5dz",
      "author": "None",
      "body": "Do you have an app or how do you track everything?",
      "created_utc": 1717745098.0,
      "score": 1,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "l7hjrs4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717737835.0
        }
      ]
    },
    {
      "id": "m3t99w5",
      "author": "ihatethewordoof",
      "body": "It depends on just how much over is. It’s rare that I do that but I’m usually always in a deficit so it makes up for itself. I’d probably spend a day hyper-fixating and body checking though.",
      "created_utc": 1735175375.0,
      "score": 1,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "m3jxvts",
          "author": "Typical_Ad_7291",
          "body": "What happens if you go over",
          "created_utc": 1735017980.0
        }
      ]
    },
    {
      "id": "l7hv7n2",
      "author": "None",
      "body": "Do you shave your head and arms etc? How do you prevent ingrown hairs?",
      "created_utc": 1717745141.0,
      "score": 3,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7hgtio",
          "author": "Extension_Nerve_8233",
          "body": "My OCD is more pronounced than during recovery now. I cannot stand my bare feel on my apartment floors now and have to wear ballet shoes all the time at the house. I also shower several times a day lately. 🤦🏻‍♀️",
          "created_utc": 1717736141.0
        },
        {
          "id": "l7hi0si",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717736818.0
        }
      ]
    },
    {
      "id": "l7nfcr0",
      "author": "Grape-Suika",
      "body": "Ah yeah that does make it more difficult. My appointments are once every 6 weeks if that helps. But sounds like you’re rather busy!",
      "created_utc": 1717835193.0,
      "score": 2,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7hy0k9",
          "author": "Grape-Suika",
          "body": "Have you considered laser hair removal? This is a game changer for me. Im only on session 3/10 but the difference is already so incredible. \nIn UK theres loads of affordable, reputable clinics",
          "created_utc": 1717747135.0
        },
        {
          "id": "l7me0kq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717812949.0
        }
      ]
    },
    {
      "id": "l7rvo9u",
      "author": "Eli_is_the_swagg",
      "body": "i honestly cant wait to be able to eat normally. like i know ill be mentally ehh for a bit but to stomach a full meal im excited for",
      "created_utc": 1717908372.0,
      "score": 2,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7l5dwy",
          "author": "Eli_is_the_swagg",
          "body": "im so glad someone else does this. im still considering fully recovering (im doing some harm reduction/ healing my body from my most recent crash diet) but im afraid to not know. i dont like seeing a high number, but id much rather see the number than not know what it is.",
          "created_utc": 1717794309.0
        },
        {
          "id": "l7me9go",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717813062.0
        }
      ]
    },
    {
      "id": "l7j0560",
      "author": "NiceGuy1020",
      "body": "Yup - for me it’s like I’m eating these things [whatever I buy for them] vicariously through them haha. It does make me sad to think about, like you said, how I can’t allow myself to have those treats too. But it helps to watch them enjoy it. It’s like.. well if I can’t have this opportunity, at least you can y’know?",
      "created_utc": 1717767910.0,
      "score": 3,
      "context": [
        {
          "id": "l7hz7ge",
          "author": "existentialismsim",
          "body": "I go to the supermarkets most days and just pace the aisles looking at the foods and imagining a life where I could just buy what I wanted, instead I read labels like the newspaper just out of calorie curiosity. \n\nI also watch to see what other people buy, it’s crazy to me that someone can just pick out an item and not think 20 times about it, my disorder finds comfort in knowing I can look but not buy, I hate this disease.",
          "created_utc": 1717748003.0
        },
        {
          "id": "l7i52di",
          "author": "NiceGuy1020",
          "body": "Dayum, yes - I also look at stuff and think “huh wouldn’t it be nice if I got this”. I pick up treats for my family that I otherwise wouldn’t buy for myself; do you do that?",
          "created_utc": 1717752267.0
        },
        {
          "id": "l7ira7n",
          "author": "existentialismsim",
          "body": "Absolutely, I love seeing something and thinking “ooh they’ll like this!” Especially for my partner, it’s heart breaking I can’t see myself in the same way and buy something purely out of the though I’d enjoy it but my brain physically will not allow it",
          "created_utc": 1717764454.0
        }
      ]
    },
    {
      "id": "l7ibg79",
      "author": "mooseyage",
      "body": "I need to shower before eating dinner, otherwise I don’t feel “clean” or worthy of having a meal",
      "created_utc": 1717756586.0,
      "score": 9,
      "context": [
        {
          "id": "l7hh5by",
          "author": "Extension_Nerve_8233",
          "body": "Habitual showering.\nLicking chopstick and sticking into hot chocolate powder. \nAversion to bare feet on floors.\nConstant herbal tea drinking.\nSriracha/hot sauce makes anything feel like a meal. I eat sriracha and iceberg/pickles/cabbage.",
          "created_utc": 1717736323.0
        },
        {
          "id": "l7hszhp",
          "author": "OversizedBeret",
          "body": "Can you elaborate on habitual showering?",
          "created_utc": 1717743625.0
        },
        {
          "id": "l7i7jn0",
          "author": "dietcrackcocaine",
          "body": "Tbh I relate and for me it's cause it makes me feel new and pure and it's like I'm cleansing myself from eating. The other thing is long showers burn calories. It gets annoying and obsessive and my ocd contributes to this",
          "created_utc": 1717754040.0
        }
      ]
    },
    {
      "id": "lyzlfeb",
      "author": "No_Experience3593",
      "body": "Just wanted to tell you that the way you describe anorexia is like, beautiful. I mean… I know that may be a twisted thing to say but I wish I had half of the vocabulary to communicate what you just said about this horrible disorder. Anyways, I wish you well and hope all is good and will continue to be.",
      "created_utc": 1732577245.0,
      "score": 2,
      "context": [
        {
          "id": "lveja44",
          "author": "grxyilli",
          "body": "When i was 15 (five months ago), I was emaciated to ghe weight of 16 kg at a height of 155 cm, I began to engage in the ritual of chewing and spitting out food, meticulously rinsing my mouth after each bite to ensure that no remnants remained and that no accidental caloric intake occurred through cephalic ingestion through my saliva. This was followed by a tedious routine of brushing my teeth and tongue to pristine cleanliness (albiet w/o toothpaste due to fear that it contained calories. Chew/spit process became an intense source of psychological satisfaction: chewing, spitting, rinsing, and brushing satiated me an illusion of absolute control, that even with food present in my mouth, I maintained the autonomy to expel every trace of potential calorie, a behavior driven by a deeply entrenched psychogenic impulse rooted in maintaining control during the chaos of my unstable domestic environment. I always had an innate predisposition for OCD, which manifested into Anorexia due to the sporadic blights of my household environment as I begun fixating over my numerical weight\n\nThis insane regimen led to an expenditure of calories so significant that I managed to lose 0.4 kg daily, resulting in an exponential drastic decrease from 42 kg to 16 kg within less than four months. my objective was to starve myself to death; I perceived death through anorexia as much more tranquil and enjoyable than platitudinal suicide. I also had a morbid vision of myself dying at 15, looking like an Egyptian mummy in my casket, romanticizibg the idealization of extreme atrophy.\n\nDuring this epoch, (thinking back its kind of embarrassingly humorous) I curated a 140-page document on Google Docs, morbidly scrutinizing every type of food, analyzing its textures, brand, and whether it felt overly unctuous or “fatty.” I would not even proceed to chew/spit the food if I couldn’t identify the type or brand as everything that touched my mouth must be recorded in this document in overt and austere detail or it would trigger profound neurotic distress. reinforcing my OCD.\n\nDespite drinking around 4L of water daily, I was severely dehydrated due to the utter lack of sodium and electrolytes. My lips would frequently crack and bleed, yet even blood was promptly spat out and my mouth cleansed, driven by an irrational fear that it might contain calories.\n\nMy inborn predisposition for OCD manifested into anorexia when the exogenous domestic instability and abuse exacerbated my need for control and autonomy. On June 11th, 2024, I concluded that my initial plan to succumb to death through anorexia was unattainable, as my guardians persisted in sending me to eating disorder treatment facilities. In response, I attempted suicide via refeeding syndrome by consuming an excessive amount of food daily. This led to terrifying peripheral edema, gastrointestinal paresis, and alternating tachycardia and bradycardia arrhythmias. To my dismay, these symptoms subsided after one month. Realizing my plan to die before turning 16 was thwarted, I ultimately gave up attempting to die through ED or Refeeding syndrome. I knew that no physician or psychiatrist could alleviate my profound psychosomatic torment; the enforced confinement in treatment units only intensified my sense of lost control, I understood that my environment was stipulated to change before my healing can commence. I identified the primary source of instability within my family and I was determined to ameliorate my internal psychological warfare, thus I distanced myself from the family members who inflicted torment upon me. Now I’m significantly better.",
          "created_utc": 1730750763.0
        },
        {
          "id": "lvekeqz",
          "author": "None",
          "body": "Are you doing better now? I can’t even imagine 16kg at 155cm, I’m so sorry you went through that",
          "created_utc": 1730751096.0
        },
        {
          "id": "lves2th",
          "author": "grxyilli",
          "body": "Yes, I have made a full recovery but I acknowledge that I will likely forever be bound by my innate predisposition for Anorexia. When I fall back into my inhibitions, these emotions still resurge. No medicine nor psychotherapy can cure it, I simply reassure myself of my worth and remind myself “momentum mori”, one day I’m going to die anyways thus life should be free of obligations and I shouldn’t feel obliged to achieve a certain extremity of “skinniness”. I’m doing significantly better now and feel liberated from my morbid notions of being emaciated.",
          "created_utc": 1730753354.0
        }
      ]
    },
    {
      "id": "lyzm8yc",
      "author": "No_Experience3593",
      "body": "Do you mind explaining what may have triggered it? Trauma? Abusive household? Were you unsatisfied with life?",
      "created_utc": 1732577537.0,
      "score": 1,
      "context": [
        {
          "id": "lveja44",
          "author": "grxyilli",
          "body": "When i was 15 (five months ago), I was emaciated to ghe weight of 16 kg at a height of 155 cm, I began to engage in the ritual of chewing and spitting out food, meticulously rinsing my mouth after each bite to ensure that no remnants remained and that no accidental caloric intake occurred through cephalic ingestion through my saliva. This was followed by a tedious routine of brushing my teeth and tongue to pristine cleanliness (albiet w/o toothpaste due to fear that it contained calories. Chew/spit process became an intense source of psychological satisfaction: chewing, spitting, rinsing, and brushing satiated me an illusion of absolute control, that even with food present in my mouth, I maintained the autonomy to expel every trace of potential calorie, a behavior driven by a deeply entrenched psychogenic impulse rooted in maintaining control during the chaos of my unstable domestic environment. I always had an innate predisposition for OCD, which manifested into Anorexia due to the sporadic blights of my household environment as I begun fixating over my numerical weight\n\nThis insane regimen led to an expenditure of calories so significant that I managed to lose 0.4 kg daily, resulting in an exponential drastic decrease from 42 kg to 16 kg within less than four months. my objective was to starve myself to death; I perceived death through anorexia as much more tranquil and enjoyable than platitudinal suicide. I also had a morbid vision of myself dying at 15, looking like an Egyptian mummy in my casket, romanticizibg the idealization of extreme atrophy.\n\nDuring this epoch, (thinking back its kind of embarrassingly humorous) I curated a 140-page document on Google Docs, morbidly scrutinizing every type of food, analyzing its textures, brand, and whether it felt overly unctuous or “fatty.” I would not even proceed to chew/spit the food if I couldn’t identify the type or brand as everything that touched my mouth must be recorded in this document in overt and austere detail or it would trigger profound neurotic distress. reinforcing my OCD.\n\nDespite drinking around 4L of water daily, I was severely dehydrated due to the utter lack of sodium and electrolytes. My lips would frequently crack and bleed, yet even blood was promptly spat out and my mouth cleansed, driven by an irrational fear that it might contain calories.\n\nMy inborn predisposition for OCD manifested into anorexia when the exogenous domestic instability and abuse exacerbated my need for control and autonomy. On June 11th, 2024, I concluded that my initial plan to succumb to death through anorexia was unattainable, as my guardians persisted in sending me to eating disorder treatment facilities. In response, I attempted suicide via refeeding syndrome by consuming an excessive amount of food daily. This led to terrifying peripheral edema, gastrointestinal paresis, and alternating tachycardia and bradycardia arrhythmias. To my dismay, these symptoms subsided after one month. Realizing my plan to die before turning 16 was thwarted, I ultimately gave up attempting to die through ED or Refeeding syndrome. I knew that no physician or psychiatrist could alleviate my profound psychosomatic torment; the enforced confinement in treatment units only intensified my sense of lost control, I understood that my environment was stipulated to change before my healing can commence. I identified the primary source of instability within my family and I was determined to ameliorate my internal psychological warfare, thus I distanced myself from the family members who inflicted torment upon me. Now I’m significantly better.",
          "created_utc": 1730750763.0
        },
        {
          "id": "lvekeqz",
          "author": "None",
          "body": "Are you doing better now? I can’t even imagine 16kg at 155cm, I’m so sorry you went through that",
          "created_utc": 1730751096.0
        },
        {
          "id": "lves2th",
          "author": "grxyilli",
          "body": "Yes, I have made a full recovery but I acknowledge that I will likely forever be bound by my innate predisposition for Anorexia. When I fall back into my inhibitions, these emotions still resurge. No medicine nor psychotherapy can cure it, I simply reassure myself of my worth and remind myself “momentum mori”, one day I’m going to die anyways thus life should be free of obligations and I shouldn’t feel obliged to achieve a certain extremity of “skinniness”. I’m doing significantly better now and feel liberated from my morbid notions of being emaciated.",
          "created_utc": 1730753354.0
        }
      ]
    },
    {
      "id": "l7n4as9",
      "author": "Bellissimabee",
      "body": " I don't eat anything until late evening, so I'm hungry in the day anyway if I don't have gum, I think people who have one piece and then that's it probably get hungry, but I'm eating copious amounts of it from when I wake up at 6am until I eat in the evening.\n\nIt doesn't' sound believable but I have 230 pieces of it a day, it's non stop, hence why I'm poor because it's an expensive habit, I hate myself for wasting money on it, I literally work 45 hours a week just to pay for it, what's the point. But I can't quit it now either, it's been this way for 6 years I'm truly addicted to the taste & how it makes me feel. Even though it rises my bank and makes me super gassy. When I add what I've spent over 6 years  it's in the thousands of pounds, I could have a nice chunk of savings behind me, or afford a house by now, instead I've wasted it away on something you chew for 10 mins and replace.\n\nI'm nearly 40 and after 17 years together my partner should have someone who's financially stable, not someone who needs to borrow money off him at the end of the month just to get by. I'm miserable but don't know a way out, if I don't eat gum I know it will just lead to me eating In the day and I can't do that.",
      "created_utc": 1717827372.0,
      "score": 3,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        },
        {
          "id": "l7jzluf",
          "author": "selkieflying",
          "body": "Yuuuuup breaking the pack a day habit was ROUGH but not did my bank account thank me",
          "created_utc": 1717780075.0
        },
        {
          "id": "l7l323j",
          "author": "Bellissimabee",
          "body": "How did u manage to do it? I'm spending £250 a month on gum, the cost of the packets have gone up so much and I've been spending this every month for the last 6 years, I've got no savings and once the bills are paid I have 0 left over, I've not  had a haircut in 3 years because I need every penny, not brought new clothes, etc. That money could get me a nice holiday or wardrobe, I'm desperate to break free of it, but I can't take the hunger pains all day. Any tips to quit would help please.",
          "created_utc": 1717793491.0
        },
        {
          "id": "l7lmhc1",
          "author": "lola-at-teatime",
          "body": "Wait, isn't gum making you more hungry?? It triggers the release of stomach acid. This is why you should eat gum after eating, to produce saliva that will help clean your teeth.",
          "created_utc": 1717801032.0
        }
      ]
    },
    {
      "id": "l8x2nfh",
      "author": "Bellissimabee",
      "body": "That's great to hear if your doing better with your health. I just want to be free of gum, if I recover I don't want it to be a part of my life ever, it's too risky to fall into the habit again. I just hope that would be the case and I don't still feel I need it. I'm just eating more gum than I've ever known. It's around 200 pieces a day, it's extreme and it's so expensive I just can't keep doing this but I don't have a way out. It's so depressing.",
      "created_utc": 1718574998.0,
      "score": 2,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        },
        {
          "id": "l8098yj",
          "author": "None",
          "body": "Dude even in recovery, I still NEED gum 😞",
          "created_utc": 1718047159.0
        },
        {
          "id": "l8u25id",
          "author": "Bellissimabee",
          "body": "Is that because you're still restricting? I was kind of hoping that when and if I'm ever ready to recover that would be the end of this addiction and I could be strong enough to not slip back in to it. 😢",
          "created_utc": 1718525921.0
        },
        {
          "id": "l8wx8ee",
          "author": "None",
          "body": "Nah, I actually lift weights & eat about 1000 calories more than most people, but I'm smaller than I've ever been. Weight lifting!\n\nThe gum just helps me from eating out of boredom & also with the anxiety",
          "created_utc": 1718572826.0
        }
      ]
    },
    {
      "id": "l7jkw5z",
      "author": "Independent-Award394",
      "body": "Oura ring is the best. It tracks your deep sleep, light sleep, BMP, HRV, body temp, and helps track ovulation among tons of other things. It is actually a very helpful resource for recovery because you can guesstimate if you’re getting enough electrolytes, vitamins, minerals, sleep, etc. it has NOTHING to do with calorie counting. Simply a wonderful small ring that you wear at night.\n\nEDIT: many people with anorexia tend to develop heart problems, *im not a doctor*, but it can really help to know how your cardiovascular health is doing, and this ring is a great method of tracking. You can get the app with the ring and it will keep data from weeks to years, depending on if you wear it everyday. It’s a very heart focused ring that is also about sleep and recovery.",
      "created_utc": 1717775127.0,
      "score": 5,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "l7hjrs4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717737835.0
        },
        {
          "id": "l7hv5dz",
          "author": "None",
          "body": "Do you have an app or how do you track everything?",
          "created_utc": 1717745098.0
        }
      ]
    },
    {
      "id": "l7hwalg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717745909.0,
      "score": 4,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "l7hjrs4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717737835.0
        },
        {
          "id": "l7hv5dz",
          "author": "None",
          "body": "Do you have an app or how do you track everything?",
          "created_utc": 1717745098.0
        }
      ]
    },
    {
      "id": "m3tbgha",
      "author": "Typical_Ad_7291",
      "body": "So what do you call recovery - eating? (Please note, not sarcasm. It differs for everyone). \n\nI was wondering if recovered meant no thoughts about it, just tracked for OCD. \n\nThank you for clarifying and I’m proud of you! It’s not easy",
      "created_utc": 1735176330.0,
      "score": 1,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "m3jxvts",
          "author": "Typical_Ad_7291",
          "body": "What happens if you go over",
          "created_utc": 1735017980.0
        },
        {
          "id": "m3t99w5",
          "author": "ihatethewordoof",
          "body": "It depends on just how much over is. It’s rare that I do that but I’m usually always in a deficit so it makes up for itself. I’d probably spend a day hyper-fixating and body checking though.",
          "created_utc": 1735175375.0
        }
      ]
    },
    {
      "id": "l7hwgo7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717746031.0,
      "score": 5,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7hgtio",
          "author": "Extension_Nerve_8233",
          "body": "My OCD is more pronounced than during recovery now. I cannot stand my bare feel on my apartment floors now and have to wear ballet shoes all the time at the house. I also shower several times a day lately. 🤦🏻‍♀️",
          "created_utc": 1717736141.0
        },
        {
          "id": "l7hi0si",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717736818.0
        },
        {
          "id": "l7hv7n2",
          "author": "None",
          "body": "Do you shave your head and arms etc? How do you prevent ingrown hairs?",
          "created_utc": 1717745141.0
        }
      ]
    },
    {
      "id": "lz08gqp",
      "author": "grxyilli",
      "body": "Hi! I am highly fond of psychoanalysis and have done some research into the etiology of my illness, here is a composite of my meanderings: https://www.reddit.com/r/psychoanalysis/s/uhuKq0Agef\n\nIn my anecdotal experience, the impetus for my Anorexia revolved around my need for control, my attempt at hormonal castration (I didn’t want my menstrual cycles and wanted less libido because it was giving me bouts of psychosis), and overall enervation because I didn’t want to be drenched in the overwhelming amount of stimuli anymore (I am hypersensitive).\n\nMy innate predisposition for OCD has been conspicuous and overt since birth. I have always been considered high maintenance and a scrupulous perfectionist. This applied to anything I valued: 4.8 GPA, immaculate cleanliness of my room, my academic and intellectual vigor, etc. \n\nAs a child, a concept of perfection, intellect, and academic luminosity permeated my entire existence, which exacerbated my endogenous aptitude for flawlessness. Starting with my parents, my father never hesitated to remind me that if I didn’t accomplish something worthwhile (by which he means, having a net work of Bill Gates), I would be worthless and a travesty to this family. My mother hated me for having a strong volition, as our personalities were polar opposites and greatly clashed, she purged all her hatred for my narcissistic father onto me and would beat me every fucking day, kicking, punching, dragging me by my hair up and down the stairs; the abuse rarely ceased, and if it did, I was met with stone cold contempt. I can still recall in vivid detail the revolt and hatred in her eyes when I would attempt to interact with her. On the other hand, my father was a very limbic and unwell person, his emotions oscillated between genuine ecstasy (complete tolerance for any behaviour: i could throw a tantrum and he would laugh) and barbarian rage (breaking things, beating me, screaming at my mom), with little to no transition period; therefore I never understood how to interact with him and establish appropriate boundaries with him. \n\nI was in grade 5 when I first reached out to my teacher regarding the abuse (at the time, I was so desensitized, I wasn’t even sure if it was considered abuse). Childrens Aid Society contacted my father and he ensured I suffered hell for it. For a week, I had to spend hours memorizing sentences on how to contrive a charade of the perfect family to CAS and my teacher, and I would be  beaten as atonement for my “mishap”. On the bright side, I was alleviated from the “homework-checking” for the extracurricular works my parents assigned that week. I managed to derail the CAS investigation, and resumed to living in that emotional and psychological squalor again, but not for long.\n\n\n**part 1**\nLol srry rhis is gonna be long, im on a rant",
      "created_utc": 1732585416.0,
      "score": 1,
      "context": [
        {
          "id": "lveja44",
          "author": "grxyilli",
          "body": "When i was 15 (five months ago), I was emaciated to ghe weight of 16 kg at a height of 155 cm, I began to engage in the ritual of chewing and spitting out food, meticulously rinsing my mouth after each bite to ensure that no remnants remained and that no accidental caloric intake occurred through cephalic ingestion through my saliva. This was followed by a tedious routine of brushing my teeth and tongue to pristine cleanliness (albiet w/o toothpaste due to fear that it contained calories. Chew/spit process became an intense source of psychological satisfaction: chewing, spitting, rinsing, and brushing satiated me an illusion of absolute control, that even with food present in my mouth, I maintained the autonomy to expel every trace of potential calorie, a behavior driven by a deeply entrenched psychogenic impulse rooted in maintaining control during the chaos of my unstable domestic environment. I always had an innate predisposition for OCD, which manifested into Anorexia due to the sporadic blights of my household environment as I begun fixating over my numerical weight\n\nThis insane regimen led to an expenditure of calories so significant that I managed to lose 0.4 kg daily, resulting in an exponential drastic decrease from 42 kg to 16 kg within less than four months. my objective was to starve myself to death; I perceived death through anorexia as much more tranquil and enjoyable than platitudinal suicide. I also had a morbid vision of myself dying at 15, looking like an Egyptian mummy in my casket, romanticizibg the idealization of extreme atrophy.\n\nDuring this epoch, (thinking back its kind of embarrassingly humorous) I curated a 140-page document on Google Docs, morbidly scrutinizing every type of food, analyzing its textures, brand, and whether it felt overly unctuous or “fatty.” I would not even proceed to chew/spit the food if I couldn’t identify the type or brand as everything that touched my mouth must be recorded in this document in overt and austere detail or it would trigger profound neurotic distress. reinforcing my OCD.\n\nDespite drinking around 4L of water daily, I was severely dehydrated due to the utter lack of sodium and electrolytes. My lips would frequently crack and bleed, yet even blood was promptly spat out and my mouth cleansed, driven by an irrational fear that it might contain calories.\n\nMy inborn predisposition for OCD manifested into anorexia when the exogenous domestic instability and abuse exacerbated my need for control and autonomy. On June 11th, 2024, I concluded that my initial plan to succumb to death through anorexia was unattainable, as my guardians persisted in sending me to eating disorder treatment facilities. In response, I attempted suicide via refeeding syndrome by consuming an excessive amount of food daily. This led to terrifying peripheral edema, gastrointestinal paresis, and alternating tachycardia and bradycardia arrhythmias. To my dismay, these symptoms subsided after one month. Realizing my plan to die before turning 16 was thwarted, I ultimately gave up attempting to die through ED or Refeeding syndrome. I knew that no physician or psychiatrist could alleviate my profound psychosomatic torment; the enforced confinement in treatment units only intensified my sense of lost control, I understood that my environment was stipulated to change before my healing can commence. I identified the primary source of instability within my family and I was determined to ameliorate my internal psychological warfare, thus I distanced myself from the family members who inflicted torment upon me. Now I’m significantly better.",
          "created_utc": 1730750763.0
        },
        {
          "id": "lvekeqz",
          "author": "None",
          "body": "Are you doing better now? I can’t even imagine 16kg at 155cm, I’m so sorry you went through that",
          "created_utc": 1730751096.0
        },
        {
          "id": "lves2th",
          "author": "grxyilli",
          "body": "Yes, I have made a full recovery but I acknowledge that I will likely forever be bound by my innate predisposition for Anorexia. When I fall back into my inhibitions, these emotions still resurge. No medicine nor psychotherapy can cure it, I simply reassure myself of my worth and remind myself “momentum mori”, one day I’m going to die anyways thus life should be free of obligations and I shouldn’t feel obliged to achieve a certain extremity of “skinniness”. I’m doing significantly better now and feel liberated from my morbid notions of being emaciated.",
          "created_utc": 1730753354.0
        },
        {
          "id": "lyzm8yc",
          "author": "No_Experience3593",
          "body": "Do you mind explaining what may have triggered it? Trauma? Abusive household? Were you unsatisfied with life?",
          "created_utc": 1732577537.0
        }
      ]
    },
    {
      "id": "lz08mes",
      "author": "grxyilli",
      "body": "I could still recall as clear as day, the night of my first breakdown, the night I officially snapped. I was 11 and It was a typical evening of homework duties, and my father was enraged by my incompletion and incompetence that day as I have failed to complete the 4 pages of math work he assigned. We argued for a few minutes before it escalated into assault; he chased me to my room, and I had locked the doors again. He went to grab his screwdriver to uninstall the lock, and I would plead with him begging for forgiveness if I opened the door, praying to god for mercy from his wrath (this is how a typical fight would unfold). But to no avail, he persisted in trying to unlock the door and put me in my place. As he was screaming and getting closer to removing the lock, I snapped. I grabbed the chair beside me and I launched it into my closet, creating a loud thud, I proceeded to scream back that I couldn’t care less if he killed me, that I was done with this bullshit. And to my surprise, he retreated. My father yelled back a few more swears, but he eventually left. \nI was left untouched that night. I was relieved. \n\nAfter that incident, I succumbed to MDD and began living in the garage, sleeping on a yoga mat and spent my days learning about topics that actually intrigued me. I would research and watch science videos about physics and philosophy, eventually I found psychoanalysis. I had transformed in those few months drastically, as my repressed desires and psychosis surfaced and the symptoms only intensified as I continued to brawl with my parents. Despite the horrifying fights and constant police involvements, one thing was for sure, that I was liberated, that I finally established my autonomy and I was unfettered from the inundations of my parents.\n\nFor the next 4 years, a lot has happened. Foster homes, treatment residences, hospital admissions, but I’ve managed. I have managed to find an equilibrium of fighting for the maintenance of my autonomy while ensuring the highest academic standards possible. I thought I’ve endured the climax of my life, but far from it. In the summer of 2023, my mother left me and my father, she went to a women’s shelter because she couldn’t handle the narcissistic scapegoating of my father anymore (my father blamed all my mental illness on my mother, and my mother couldn’t practice her “catharsis” of hitting me anymore as a way to mitigate her mental apprehension). I have abandonment issues with my mother from trauma in my early infancy, and her abrupt absence further tormented me. Not to mention my father proceeding to blame his marital problems onto me and gaslighting me to believe that if I wasn’t born, they would be a happy couple. He fought me on my birthday over this crap and was sent to the psyche ward, I spent the following week alone with nothing to eat but corn flakes and I begun developing gastroparesis. Many more incidents ensued and although difficult, I’ve managed to stave away from suic*de and sublimated my focus onto academics again, this is where it goes downhill. \n\nAs I’ve mentioned, my propensity towards asceticism and compulsion for perfection was held in tact with my ability to manage and control, at least my autonomy. But once my father decided to move districts right before I finished my Grade 10 semester, and I couldn’t adjust properly to the new social and emotional conditions of the novel environment because all the my previous coursework were rendered obsolete and I was imposed a new curriculum not of my choosing, I silently snapped. For 4 months, my father berated me and constantly taunted me, saying things along the lines of “youre brain is made of sh*t, and you are a waste of resources, you should k*ll urself”, “you’re GPA is gonna be messed up and you’re gonna be homeless”. I realized not long after, I started obsessively scrutinizing the weight and looks of my body, and incrementally decreased my caloric consumption to a maximum of 30 cal per day. I had officially unraveled; since I lost control of my autonomy, my environment, my relationships, and even my academic procession (the only thing that I truly valued), I knew I had to redirect my focus onto another facet of life, and nothing tasted better than skinny feels. \n\n\n**part 2**",
      "created_utc": 1732585472.0,
      "score": 1,
      "context": [
        {
          "id": "lveja44",
          "author": "grxyilli",
          "body": "When i was 15 (five months ago), I was emaciated to ghe weight of 16 kg at a height of 155 cm, I began to engage in the ritual of chewing and spitting out food, meticulously rinsing my mouth after each bite to ensure that no remnants remained and that no accidental caloric intake occurred through cephalic ingestion through my saliva. This was followed by a tedious routine of brushing my teeth and tongue to pristine cleanliness (albiet w/o toothpaste due to fear that it contained calories. Chew/spit process became an intense source of psychological satisfaction: chewing, spitting, rinsing, and brushing satiated me an illusion of absolute control, that even with food present in my mouth, I maintained the autonomy to expel every trace of potential calorie, a behavior driven by a deeply entrenched psychogenic impulse rooted in maintaining control during the chaos of my unstable domestic environment. I always had an innate predisposition for OCD, which manifested into Anorexia due to the sporadic blights of my household environment as I begun fixating over my numerical weight\n\nThis insane regimen led to an expenditure of calories so significant that I managed to lose 0.4 kg daily, resulting in an exponential drastic decrease from 42 kg to 16 kg within less than four months. my objective was to starve myself to death; I perceived death through anorexia as much more tranquil and enjoyable than platitudinal suicide. I also had a morbid vision of myself dying at 15, looking like an Egyptian mummy in my casket, romanticizibg the idealization of extreme atrophy.\n\nDuring this epoch, (thinking back its kind of embarrassingly humorous) I curated a 140-page document on Google Docs, morbidly scrutinizing every type of food, analyzing its textures, brand, and whether it felt overly unctuous or “fatty.” I would not even proceed to chew/spit the food if I couldn’t identify the type or brand as everything that touched my mouth must be recorded in this document in overt and austere detail or it would trigger profound neurotic distress. reinforcing my OCD.\n\nDespite drinking around 4L of water daily, I was severely dehydrated due to the utter lack of sodium and electrolytes. My lips would frequently crack and bleed, yet even blood was promptly spat out and my mouth cleansed, driven by an irrational fear that it might contain calories.\n\nMy inborn predisposition for OCD manifested into anorexia when the exogenous domestic instability and abuse exacerbated my need for control and autonomy. On June 11th, 2024, I concluded that my initial plan to succumb to death through anorexia was unattainable, as my guardians persisted in sending me to eating disorder treatment facilities. In response, I attempted suicide via refeeding syndrome by consuming an excessive amount of food daily. This led to terrifying peripheral edema, gastrointestinal paresis, and alternating tachycardia and bradycardia arrhythmias. To my dismay, these symptoms subsided after one month. Realizing my plan to die before turning 16 was thwarted, I ultimately gave up attempting to die through ED or Refeeding syndrome. I knew that no physician or psychiatrist could alleviate my profound psychosomatic torment; the enforced confinement in treatment units only intensified my sense of lost control, I understood that my environment was stipulated to change before my healing can commence. I identified the primary source of instability within my family and I was determined to ameliorate my internal psychological warfare, thus I distanced myself from the family members who inflicted torment upon me. Now I’m significantly better.",
          "created_utc": 1730750763.0
        },
        {
          "id": "lvekeqz",
          "author": "None",
          "body": "Are you doing better now? I can’t even imagine 16kg at 155cm, I’m so sorry you went through that",
          "created_utc": 1730751096.0
        },
        {
          "id": "lves2th",
          "author": "grxyilli",
          "body": "Yes, I have made a full recovery but I acknowledge that I will likely forever be bound by my innate predisposition for Anorexia. When I fall back into my inhibitions, these emotions still resurge. No medicine nor psychotherapy can cure it, I simply reassure myself of my worth and remind myself “momentum mori”, one day I’m going to die anyways thus life should be free of obligations and I shouldn’t feel obliged to achieve a certain extremity of “skinniness”. I’m doing significantly better now and feel liberated from my morbid notions of being emaciated.",
          "created_utc": 1730753354.0
        },
        {
          "id": "lyzm8yc",
          "author": "No_Experience3593",
          "body": "Do you mind explaining what may have triggered it? Trauma? Abusive household? Were you unsatisfied with life?",
          "created_utc": 1732577537.0
        }
      ]
    },
    {
      "id": "lz08r9g",
      "author": "grxyilli",
      "body": "I’ve been through manifold eating disorder units and ICU treatments, but it was futile. How do you remedy the illness that remains the only thing keeping you from suic*de? As I watched my weight drop every day, I felt a sense of satiation and gratification; a jouissance and ecstasy I’ve felt before, comparable to the feeling of pride when I accomplished something academically intensive. I was proud of how I was incrementally kllling myself, and I knew damn well I was going to die. But hey, I thought “id look astonishingly attractive in my casket”. I had romanticized my demise and the tragedy of my psyche. \n\nEventually, I realized that the Canadian healthcare system was too vigorous and I wasn’t able to terminate my life in Canada, so I convinced my father to take me back to China, and off we went. I would be admitted into hospitals in my homeland, but managed in persuading my father to allow me residence with my grandparents after tedious badgering on my part. And there, my weight dropped to a staggering 16 kg.\n\nWhen my dad found out, he took a train back to my grandparents and literally tied me up onto a wheelchair to travel to Shanghai for ED treatment. On our way, we stopped at Beijing and an untold nuance of things happened (I’m too exhausted to go into), but he changed course and listened to my will. Instead of going to Shanghai for treatment (he and I both knew how strong willed and potent my volition was, and that treatment would be futile and fail to benefit me), so we decided to go to Hainan. When we stopped as Guangzhou, I had a thought, “I’m going to induce refeeding syndrome to end myself”, so I told him to allow me to eat a surfeit insofar as to throw up. I ate until I puked and my father didn’t object. I believe there was an aspect of my father changing route in his determination of sending me to the Shanghai ED unit that contributed to my mental healing, as I felt I’ve regained my autonomy again. But the predominant role in this psychosomatic transformation was when I began recalling the progression of my disease. I realized something then and there when I stood in front of a public washroom after vomiting all the food out, “I didn’t gain any control by starving myself, I had been controlled by my illness. It was an illusion of autonomy and pleasure I gained through fulfilling my inner child, but reality was that I was wholly bound by my Anorexia”. That’s when I told myself that I don’t have to be “perfect”, I don’t have to live up to the expectations, hell, I don’t even have to be average!\n\n“Momentum mori, I’m going to die regardless, so why live a life restricted by the expectations and ailments of my psychology?”\n\nI felt an emotion I had never experienced before, it was similar to the Buddhist Moksha (liberation), I felt genuine serenity and grace, alleviation and rebirth, tranquility and universality (sry, I dont know how to palpably describe it). But I knew I was in control this time, I wasn’t going to be coerced by my parents, by their expectations, nor by my Anorexia, I was going to be free and uninhibited. That was the commencement to my journey in recovery. \n\nThere has been tremendous difficulty on my journey in recovery, psychical and psychological. But I had identified something, I know what I needed and strived for what I wanted. Unbinding stubbornness is a double edged sword, it could drive you mad when paired with Anorexia, or it could save you from the darkest pits in life. It sounds cliche, but after I learned to wield that sword, the world is my oyster.\n\n\n\n**part 3, last part**",
      "created_utc": 1732585519.0,
      "score": 1,
      "context": [
        {
          "id": "lveja44",
          "author": "grxyilli",
          "body": "When i was 15 (five months ago), I was emaciated to ghe weight of 16 kg at a height of 155 cm, I began to engage in the ritual of chewing and spitting out food, meticulously rinsing my mouth after each bite to ensure that no remnants remained and that no accidental caloric intake occurred through cephalic ingestion through my saliva. This was followed by a tedious routine of brushing my teeth and tongue to pristine cleanliness (albiet w/o toothpaste due to fear that it contained calories. Chew/spit process became an intense source of psychological satisfaction: chewing, spitting, rinsing, and brushing satiated me an illusion of absolute control, that even with food present in my mouth, I maintained the autonomy to expel every trace of potential calorie, a behavior driven by a deeply entrenched psychogenic impulse rooted in maintaining control during the chaos of my unstable domestic environment. I always had an innate predisposition for OCD, which manifested into Anorexia due to the sporadic blights of my household environment as I begun fixating over my numerical weight\n\nThis insane regimen led to an expenditure of calories so significant that I managed to lose 0.4 kg daily, resulting in an exponential drastic decrease from 42 kg to 16 kg within less than four months. my objective was to starve myself to death; I perceived death through anorexia as much more tranquil and enjoyable than platitudinal suicide. I also had a morbid vision of myself dying at 15, looking like an Egyptian mummy in my casket, romanticizibg the idealization of extreme atrophy.\n\nDuring this epoch, (thinking back its kind of embarrassingly humorous) I curated a 140-page document on Google Docs, morbidly scrutinizing every type of food, analyzing its textures, brand, and whether it felt overly unctuous or “fatty.” I would not even proceed to chew/spit the food if I couldn’t identify the type or brand as everything that touched my mouth must be recorded in this document in overt and austere detail or it would trigger profound neurotic distress. reinforcing my OCD.\n\nDespite drinking around 4L of water daily, I was severely dehydrated due to the utter lack of sodium and electrolytes. My lips would frequently crack and bleed, yet even blood was promptly spat out and my mouth cleansed, driven by an irrational fear that it might contain calories.\n\nMy inborn predisposition for OCD manifested into anorexia when the exogenous domestic instability and abuse exacerbated my need for control and autonomy. On June 11th, 2024, I concluded that my initial plan to succumb to death through anorexia was unattainable, as my guardians persisted in sending me to eating disorder treatment facilities. In response, I attempted suicide via refeeding syndrome by consuming an excessive amount of food daily. This led to terrifying peripheral edema, gastrointestinal paresis, and alternating tachycardia and bradycardia arrhythmias. To my dismay, these symptoms subsided after one month. Realizing my plan to die before turning 16 was thwarted, I ultimately gave up attempting to die through ED or Refeeding syndrome. I knew that no physician or psychiatrist could alleviate my profound psychosomatic torment; the enforced confinement in treatment units only intensified my sense of lost control, I understood that my environment was stipulated to change before my healing can commence. I identified the primary source of instability within my family and I was determined to ameliorate my internal psychological warfare, thus I distanced myself from the family members who inflicted torment upon me. Now I’m significantly better.",
          "created_utc": 1730750763.0
        },
        {
          "id": "lvekeqz",
          "author": "None",
          "body": "Are you doing better now? I can’t even imagine 16kg at 155cm, I’m so sorry you went through that",
          "created_utc": 1730751096.0
        },
        {
          "id": "lves2th",
          "author": "grxyilli",
          "body": "Yes, I have made a full recovery but I acknowledge that I will likely forever be bound by my innate predisposition for Anorexia. When I fall back into my inhibitions, these emotions still resurge. No medicine nor psychotherapy can cure it, I simply reassure myself of my worth and remind myself “momentum mori”, one day I’m going to die anyways thus life should be free of obligations and I shouldn’t feel obliged to achieve a certain extremity of “skinniness”. I’m doing significantly better now and feel liberated from my morbid notions of being emaciated.",
          "created_utc": 1730753354.0
        },
        {
          "id": "lyzm8yc",
          "author": "No_Experience3593",
          "body": "Do you mind explaining what may have triggered it? Trauma? Abusive household? Were you unsatisfied with life?",
          "created_utc": 1732577537.0
        }
      ]
    },
    {
      "id": "l7nkygv",
      "author": "lola-at-teatime",
      "body": "I'm so sorry to hear that, my heart goes with you. I know how hard addiction is. If i am to offer am objective view, many people have at least one dysfunctional thing they spend a lot of money on. If it's not one thing, it's another. So don't be so hard on yourself on it, it just does worse for your wellbeing. I also spend sooo much money and time on food (bulimia) that went in the toilet. I was able to recover partially, the money and time remain wasted, but i don't think about it, it does me no good. There's always time to get better, save money, enjoy some nice nourishing food. \n\nPlease please stop beating yourself up for it, you're only human. 🤍🤍",
      "created_utc": 1717839398.0,
      "score": 4,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        },
        {
          "id": "l7jzluf",
          "author": "selkieflying",
          "body": "Yuuuuup breaking the pack a day habit was ROUGH but not did my bank account thank me",
          "created_utc": 1717780075.0
        },
        {
          "id": "l7l323j",
          "author": "Bellissimabee",
          "body": "How did u manage to do it? I'm spending £250 a month on gum, the cost of the packets have gone up so much and I've been spending this every month for the last 6 years, I've got no savings and once the bills are paid I have 0 left over, I've not  had a haircut in 3 years because I need every penny, not brought new clothes, etc. That money could get me a nice holiday or wardrobe, I'm desperate to break free of it, but I can't take the hunger pains all day. Any tips to quit would help please.",
          "created_utc": 1717793491.0
        },
        {
          "id": "l7lmhc1",
          "author": "lola-at-teatime",
          "body": "Wait, isn't gum making you more hungry?? It triggers the release of stomach acid. This is why you should eat gum after eating, to produce saliva that will help clean your teeth.",
          "created_utc": 1717801032.0
        },
        {
          "id": "l7n4as9",
          "author": "Bellissimabee",
          "body": " I don't eat anything until late evening, so I'm hungry in the day anyway if I don't have gum, I think people who have one piece and then that's it probably get hungry, but I'm eating copious amounts of it from when I wake up at 6am until I eat in the evening.\n\nIt doesn't' sound believable but I have 230 pieces of it a day, it's non stop, hence why I'm poor because it's an expensive habit, I hate myself for wasting money on it, I literally work 45 hours a week just to pay for it, what's the point. But I can't quit it now either, it's been this way for 6 years I'm truly addicted to the taste & how it makes me feel. Even though it rises my bank and makes me super gassy. When I add what I've spent over 6 years  it's in the thousands of pounds, I could have a nice chunk of savings behind me, or afford a house by now, instead I've wasted it away on something you chew for 10 mins and replace.\n\nI'm nearly 40 and after 17 years together my partner should have someone who's financially stable, not someone who needs to borrow money off him at the end of the month just to get by. I'm miserable but don't know a way out, if I don't eat gum I know it will just lead to me eating In the day and I can't do that.",
          "created_utc": 1717827372.0
        }
      ]
    },
    {
      "id": "l8a5p33",
      "author": "selkieflying",
      "body": "I started logging the calories from it. Seeing that x (although very low per piece) add up definitely motivated me.\n\nAlso my tmj was so bad that the pain was awful. That was a huge factor for me.",
      "created_utc": 1718205862.0,
      "score": 1,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        },
        {
          "id": "l7jzluf",
          "author": "selkieflying",
          "body": "Yuuuuup breaking the pack a day habit was ROUGH but not did my bank account thank me",
          "created_utc": 1717780075.0
        },
        {
          "id": "l7l323j",
          "author": "Bellissimabee",
          "body": "How did u manage to do it? I'm spending £250 a month on gum, the cost of the packets have gone up so much and I've been spending this every month for the last 6 years, I've got no savings and once the bills are paid I have 0 left over, I've not  had a haircut in 3 years because I need every penny, not brought new clothes, etc. That money could get me a nice holiday or wardrobe, I'm desperate to break free of it, but I can't take the hunger pains all day. Any tips to quit would help please.",
          "created_utc": 1717793491.0
        },
        {
          "id": "l7lmhc1",
          "author": "lola-at-teatime",
          "body": "Wait, isn't gum making you more hungry?? It triggers the release of stomach acid. This is why you should eat gum after eating, to produce saliva that will help clean your teeth.",
          "created_utc": 1717801032.0
        },
        {
          "id": "l7n4as9",
          "author": "Bellissimabee",
          "body": " I don't eat anything until late evening, so I'm hungry in the day anyway if I don't have gum, I think people who have one piece and then that's it probably get hungry, but I'm eating copious amounts of it from when I wake up at 6am until I eat in the evening.\n\nIt doesn't' sound believable but I have 230 pieces of it a day, it's non stop, hence why I'm poor because it's an expensive habit, I hate myself for wasting money on it, I literally work 45 hours a week just to pay for it, what's the point. But I can't quit it now either, it's been this way for 6 years I'm truly addicted to the taste & how it makes me feel. Even though it rises my bank and makes me super gassy. When I add what I've spent over 6 years  it's in the thousands of pounds, I could have a nice chunk of savings behind me, or afford a house by now, instead I've wasted it away on something you chew for 10 mins and replace.\n\nI'm nearly 40 and after 17 years together my partner should have someone who's financially stable, not someone who needs to borrow money off him at the end of the month just to get by. I'm miserable but don't know a way out, if I don't eat gum I know it will just lead to me eating In the day and I can't do that.",
          "created_utc": 1717827372.0
        }
      ]
    },
    {
      "id": "l7l4oc7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717794055.0,
      "score": 2,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "l7hjrs4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717737835.0
        },
        {
          "id": "l7hv5dz",
          "author": "None",
          "body": "Do you have an app or how do you track everything?",
          "created_utc": 1717745098.0
        },
        {
          "id": "l7hwalg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717745909.0
        }
      ]
    },
    {
      "id": "l7jfoh9",
      "author": "Equivalent-Act-2739",
      "body": "Lol....you're not worsening anyone's condition. You're just gatekeeping a helpful resource.",
      "created_utc": 1717773367.0,
      "score": 0,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "l7hjrs4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717737835.0
        },
        {
          "id": "l7hv5dz",
          "author": "None",
          "body": "Do you have an app or how do you track everything?",
          "created_utc": 1717745098.0
        },
        {
          "id": "l7hwalg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717745909.0
        }
      ]
    },
    {
      "id": "m3tcyc5",
      "author": "ihatethewordoof",
      "body": "Recovery is different for everyone. My recovery is not being on my death bed in a hospital because I lost 100 pounds in 10 months. I can eat just about everything now as long as I know the calories. Not everyone with anorexia has OCD though. That just so happens to influence my eating disorder. I have compulsions that I need to satisfy or I hyperfixate on it to an unhealthy degree. I’m of the belief that I’ll always have an eating disorder. Whether I’ll relapse, I don’t know. My relationship with food has drastically improved and that’s something to me. Hopefully that answers your question?",
      "created_utc": 1735176988.0,
      "score": 1,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "m3jxvts",
          "author": "Typical_Ad_7291",
          "body": "What happens if you go over",
          "created_utc": 1735017980.0
        },
        {
          "id": "m3t99w5",
          "author": "ihatethewordoof",
          "body": "It depends on just how much over is. It’s rare that I do that but I’m usually always in a deficit so it makes up for itself. I’d probably spend a day hyper-fixating and body checking though.",
          "created_utc": 1735175375.0
        },
        {
          "id": "m3tbgha",
          "author": "Typical_Ad_7291",
          "body": "So what do you call recovery - eating? (Please note, not sarcasm. It differs for everyone). \n\nI was wondering if recovered meant no thoughts about it, just tracked for OCD. \n\nThank you for clarifying and I’m proud of you! It’s not easy",
          "created_utc": 1735176330.0
        }
      ]
    },
    {
      "id": "l7lw0lg",
      "author": "Extension_Nerve_8233",
      "body": "I’ve had full laser body hair removal. I relate to this post so much.",
      "created_utc": 1717804946.0,
      "score": 2,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7hgtio",
          "author": "Extension_Nerve_8233",
          "body": "My OCD is more pronounced than during recovery now. I cannot stand my bare feel on my apartment floors now and have to wear ballet shoes all the time at the house. I also shower several times a day lately. 🤦🏻‍♀️",
          "created_utc": 1717736141.0
        },
        {
          "id": "l7hi0si",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717736818.0
        },
        {
          "id": "l7hv7n2",
          "author": "None",
          "body": "Do you shave your head and arms etc? How do you prevent ingrown hairs?",
          "created_utc": 1717745141.0
        },
        {
          "id": "l7hwgo7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717746031.0
        }
      ]
    },
    {
      "id": "lz0xc83",
      "author": "No_Experience3593",
      "body": "I admire the way you can articulate these feelings into words considering anorexia is so complex and never just a certain one thing. To read all of what you’ve gone through at the hands of people who are supposed to be the ones to love and support you is devastating. It’s  unbearable and it’s amazing that you’ve been even able to withstand what sounds like purgatory even from such a young age. There’s a special place in hell for parents who have children and expect machines out of them. \nI haven’t gotten a chance to read the psychoanalysis yet but I’m looking forward to it.\nThere are some similarities though, I believe. \nAs a child, I myself witnessed the toxicity of my mother’s relationship with a man. Wanting to save my mother but feeling so helpless. You mentioned perfectionism and I believe I’d developed that from playing childhood sports all through highschool (I just graduated in May) and being held at such high standards that just felt unattainable. I moved schools in 2022, my junior year of highschool and that meant abandoning friendships and familiarity. sometime in Febuary of 2023, I decided to fast. I don’t know why. Or at least I didn’t. I’d been so overwhelmed with feelings of being not enough and it came up on an algorithm. Water fasting for ten days. Lost the weight and it felt euphoric. Anorexia has been hell on me ever since then. I’m a freshman in college and literally can’t even think straight when I’m on campus because I get so stressed out and just overwhelmed with life that all my brain does is resort to food as a way to get a dopamine response but then Anorexia makes it all bad again and so the cycle repeats and so on and so on. I digress though, I’m sure you know more than psychologists about anorexia’s effects the psyche \nLately it’s gotten worse. I don’t think I want to participate in life anymore and anorexia has sort of become a passive path to death which gives me satisfaction thinking about it.\n\nYou said you realized anorexia had been controlling you instead of the other way around and so that motivated you to try and get better and it’s like, I understand that I’m no longer in control as well but it’s like… I can’t stop! \nDid you develop another coping mechanism? Have you developed other obsessions? We don’t get to decide when we are done with traumas and I’m learning now that the body keeps score. \n\nBut like seriously, I hope all is well now or atleast someday in the future. You’re sixteen (I think) and you didn’t deserve that. Plus you’re seriously smart as shit.",
      "created_utc": 1732594772.0,
      "score": 1,
      "context": [
        {
          "id": "lveja44",
          "author": "grxyilli",
          "body": "When i was 15 (five months ago), I was emaciated to ghe weight of 16 kg at a height of 155 cm, I began to engage in the ritual of chewing and spitting out food, meticulously rinsing my mouth after each bite to ensure that no remnants remained and that no accidental caloric intake occurred through cephalic ingestion through my saliva. This was followed by a tedious routine of brushing my teeth and tongue to pristine cleanliness (albiet w/o toothpaste due to fear that it contained calories. Chew/spit process became an intense source of psychological satisfaction: chewing, spitting, rinsing, and brushing satiated me an illusion of absolute control, that even with food present in my mouth, I maintained the autonomy to expel every trace of potential calorie, a behavior driven by a deeply entrenched psychogenic impulse rooted in maintaining control during the chaos of my unstable domestic environment. I always had an innate predisposition for OCD, which manifested into Anorexia due to the sporadic blights of my household environment as I begun fixating over my numerical weight\n\nThis insane regimen led to an expenditure of calories so significant that I managed to lose 0.4 kg daily, resulting in an exponential drastic decrease from 42 kg to 16 kg within less than four months. my objective was to starve myself to death; I perceived death through anorexia as much more tranquil and enjoyable than platitudinal suicide. I also had a morbid vision of myself dying at 15, looking like an Egyptian mummy in my casket, romanticizibg the idealization of extreme atrophy.\n\nDuring this epoch, (thinking back its kind of embarrassingly humorous) I curated a 140-page document on Google Docs, morbidly scrutinizing every type of food, analyzing its textures, brand, and whether it felt overly unctuous or “fatty.” I would not even proceed to chew/spit the food if I couldn’t identify the type or brand as everything that touched my mouth must be recorded in this document in overt and austere detail or it would trigger profound neurotic distress. reinforcing my OCD.\n\nDespite drinking around 4L of water daily, I was severely dehydrated due to the utter lack of sodium and electrolytes. My lips would frequently crack and bleed, yet even blood was promptly spat out and my mouth cleansed, driven by an irrational fear that it might contain calories.\n\nMy inborn predisposition for OCD manifested into anorexia when the exogenous domestic instability and abuse exacerbated my need for control and autonomy. On June 11th, 2024, I concluded that my initial plan to succumb to death through anorexia was unattainable, as my guardians persisted in sending me to eating disorder treatment facilities. In response, I attempted suicide via refeeding syndrome by consuming an excessive amount of food daily. This led to terrifying peripheral edema, gastrointestinal paresis, and alternating tachycardia and bradycardia arrhythmias. To my dismay, these symptoms subsided after one month. Realizing my plan to die before turning 16 was thwarted, I ultimately gave up attempting to die through ED or Refeeding syndrome. I knew that no physician or psychiatrist could alleviate my profound psychosomatic torment; the enforced confinement in treatment units only intensified my sense of lost control, I understood that my environment was stipulated to change before my healing can commence. I identified the primary source of instability within my family and I was determined to ameliorate my internal psychological warfare, thus I distanced myself from the family members who inflicted torment upon me. Now I’m significantly better.",
          "created_utc": 1730750763.0
        },
        {
          "id": "lvekeqz",
          "author": "None",
          "body": "Are you doing better now? I can’t even imagine 16kg at 155cm, I’m so sorry you went through that",
          "created_utc": 1730751096.0
        },
        {
          "id": "lves2th",
          "author": "grxyilli",
          "body": "Yes, I have made a full recovery but I acknowledge that I will likely forever be bound by my innate predisposition for Anorexia. When I fall back into my inhibitions, these emotions still resurge. No medicine nor psychotherapy can cure it, I simply reassure myself of my worth and remind myself “momentum mori”, one day I’m going to die anyways thus life should be free of obligations and I shouldn’t feel obliged to achieve a certain extremity of “skinniness”. I’m doing significantly better now and feel liberated from my morbid notions of being emaciated.",
          "created_utc": 1730753354.0
        },
        {
          "id": "lyzm8yc",
          "author": "No_Experience3593",
          "body": "Do you mind explaining what may have triggered it? Trauma? Abusive household? Were you unsatisfied with life?",
          "created_utc": 1732577537.0
        },
        {
          "id": "lz08r9g",
          "author": "grxyilli",
          "body": "I’ve been through manifold eating disorder units and ICU treatments, but it was futile. How do you remedy the illness that remains the only thing keeping you from suic*de? As I watched my weight drop every day, I felt a sense of satiation and gratification; a jouissance and ecstasy I’ve felt before, comparable to the feeling of pride when I accomplished something academically intensive. I was proud of how I was incrementally kllling myself, and I knew damn well I was going to die. But hey, I thought “id look astonishingly attractive in my casket”. I had romanticized my demise and the tragedy of my psyche. \n\nEventually, I realized that the Canadian healthcare system was too vigorous and I wasn’t able to terminate my life in Canada, so I convinced my father to take me back to China, and off we went. I would be admitted into hospitals in my homeland, but managed in persuading my father to allow me residence with my grandparents after tedious badgering on my part. And there, my weight dropped to a staggering 16 kg.\n\nWhen my dad found out, he took a train back to my grandparents and literally tied me up onto a wheelchair to travel to Shanghai for ED treatment. On our way, we stopped at Beijing and an untold nuance of things happened (I’m too exhausted to go into), but he changed course and listened to my will. Instead of going to Shanghai for treatment (he and I both knew how strong willed and potent my volition was, and that treatment would be futile and fail to benefit me), so we decided to go to Hainan. When we stopped as Guangzhou, I had a thought, “I’m going to induce refeeding syndrome to end myself”, so I told him to allow me to eat a surfeit insofar as to throw up. I ate until I puked and my father didn’t object. I believe there was an aspect of my father changing route in his determination of sending me to the Shanghai ED unit that contributed to my mental healing, as I felt I’ve regained my autonomy again. But the predominant role in this psychosomatic transformation was when I began recalling the progression of my disease. I realized something then and there when I stood in front of a public washroom after vomiting all the food out, “I didn’t gain any control by starving myself, I had been controlled by my illness. It was an illusion of autonomy and pleasure I gained through fulfilling my inner child, but reality was that I was wholly bound by my Anorexia”. That’s when I told myself that I don’t have to be “perfect”, I don’t have to live up to the expectations, hell, I don’t even have to be average!\n\n“Momentum mori, I’m going to die regardless, so why live a life restricted by the expectations and ailments of my psychology?”\n\nI felt an emotion I had never experienced before, it was similar to the Buddhist Moksha (liberation), I felt genuine serenity and grace, alleviation and rebirth, tranquility and universality (sry, I dont know how to palpably describe it). But I knew I was in control this time, I wasn’t going to be coerced by my parents, by their expectations, nor by my Anorexia, I was going to be free and uninhibited. That was the commencement to my journey in recovery. \n\nThere has been tremendous difficulty on my journey in recovery, psychical and psychological. But I had identified something, I know what I needed and strived for what I wanted. Unbinding stubbornness is a double edged sword, it could drive you mad when paired with Anorexia, or it could save you from the darkest pits in life. It sounds cliche, but after I learned to wield that sword, the world is my oyster.\n\n\n\n**part 3, last part**",
          "created_utc": 1732585519.0
        }
      ]
    },
    {
      "id": "lz0y78g",
      "author": "No_Experience3593",
      "body": "I also must add that I think most of my problem now and the reason why the noise is so damn loud is that, I’m not living the life I truly want to live or follow the career path that I truly want. First generation college student and it’s like you don’t major in the arts, you major in something safe and something that’s guaranteed you a lasting career and like something that your mother could then brag on you about to her coworkers or her estranged family members. Anorexia gives me something I can control currently and so when I’m not loosing the weight or fail to adhere to the million of food rules I’ve put myself under, I feel like a turtle and it’s shell underneath the world and everything in it! It’s control, control, control. All control. Maybe I need to give psychoanalysis a try.",
      "created_utc": 1732595141.0,
      "score": 1,
      "context": [
        {
          "id": "lveja44",
          "author": "grxyilli",
          "body": "When i was 15 (five months ago), I was emaciated to ghe weight of 16 kg at a height of 155 cm, I began to engage in the ritual of chewing and spitting out food, meticulously rinsing my mouth after each bite to ensure that no remnants remained and that no accidental caloric intake occurred through cephalic ingestion through my saliva. This was followed by a tedious routine of brushing my teeth and tongue to pristine cleanliness (albiet w/o toothpaste due to fear that it contained calories. Chew/spit process became an intense source of psychological satisfaction: chewing, spitting, rinsing, and brushing satiated me an illusion of absolute control, that even with food present in my mouth, I maintained the autonomy to expel every trace of potential calorie, a behavior driven by a deeply entrenched psychogenic impulse rooted in maintaining control during the chaos of my unstable domestic environment. I always had an innate predisposition for OCD, which manifested into Anorexia due to the sporadic blights of my household environment as I begun fixating over my numerical weight\n\nThis insane regimen led to an expenditure of calories so significant that I managed to lose 0.4 kg daily, resulting in an exponential drastic decrease from 42 kg to 16 kg within less than four months. my objective was to starve myself to death; I perceived death through anorexia as much more tranquil and enjoyable than platitudinal suicide. I also had a morbid vision of myself dying at 15, looking like an Egyptian mummy in my casket, romanticizibg the idealization of extreme atrophy.\n\nDuring this epoch, (thinking back its kind of embarrassingly humorous) I curated a 140-page document on Google Docs, morbidly scrutinizing every type of food, analyzing its textures, brand, and whether it felt overly unctuous or “fatty.” I would not even proceed to chew/spit the food if I couldn’t identify the type or brand as everything that touched my mouth must be recorded in this document in overt and austere detail or it would trigger profound neurotic distress. reinforcing my OCD.\n\nDespite drinking around 4L of water daily, I was severely dehydrated due to the utter lack of sodium and electrolytes. My lips would frequently crack and bleed, yet even blood was promptly spat out and my mouth cleansed, driven by an irrational fear that it might contain calories.\n\nMy inborn predisposition for OCD manifested into anorexia when the exogenous domestic instability and abuse exacerbated my need for control and autonomy. On June 11th, 2024, I concluded that my initial plan to succumb to death through anorexia was unattainable, as my guardians persisted in sending me to eating disorder treatment facilities. In response, I attempted suicide via refeeding syndrome by consuming an excessive amount of food daily. This led to terrifying peripheral edema, gastrointestinal paresis, and alternating tachycardia and bradycardia arrhythmias. To my dismay, these symptoms subsided after one month. Realizing my plan to die before turning 16 was thwarted, I ultimately gave up attempting to die through ED or Refeeding syndrome. I knew that no physician or psychiatrist could alleviate my profound psychosomatic torment; the enforced confinement in treatment units only intensified my sense of lost control, I understood that my environment was stipulated to change before my healing can commence. I identified the primary source of instability within my family and I was determined to ameliorate my internal psychological warfare, thus I distanced myself from the family members who inflicted torment upon me. Now I’m significantly better.",
          "created_utc": 1730750763.0
        },
        {
          "id": "lvekeqz",
          "author": "None",
          "body": "Are you doing better now? I can’t even imagine 16kg at 155cm, I’m so sorry you went through that",
          "created_utc": 1730751096.0
        },
        {
          "id": "lves2th",
          "author": "grxyilli",
          "body": "Yes, I have made a full recovery but I acknowledge that I will likely forever be bound by my innate predisposition for Anorexia. When I fall back into my inhibitions, these emotions still resurge. No medicine nor psychotherapy can cure it, I simply reassure myself of my worth and remind myself “momentum mori”, one day I’m going to die anyways thus life should be free of obligations and I shouldn’t feel obliged to achieve a certain extremity of “skinniness”. I’m doing significantly better now and feel liberated from my morbid notions of being emaciated.",
          "created_utc": 1730753354.0
        },
        {
          "id": "lyzm8yc",
          "author": "No_Experience3593",
          "body": "Do you mind explaining what may have triggered it? Trauma? Abusive household? Were you unsatisfied with life?",
          "created_utc": 1732577537.0
        },
        {
          "id": "lz08r9g",
          "author": "grxyilli",
          "body": "I’ve been through manifold eating disorder units and ICU treatments, but it was futile. How do you remedy the illness that remains the only thing keeping you from suic*de? As I watched my weight drop every day, I felt a sense of satiation and gratification; a jouissance and ecstasy I’ve felt before, comparable to the feeling of pride when I accomplished something academically intensive. I was proud of how I was incrementally kllling myself, and I knew damn well I was going to die. But hey, I thought “id look astonishingly attractive in my casket”. I had romanticized my demise and the tragedy of my psyche. \n\nEventually, I realized that the Canadian healthcare system was too vigorous and I wasn’t able to terminate my life in Canada, so I convinced my father to take me back to China, and off we went. I would be admitted into hospitals in my homeland, but managed in persuading my father to allow me residence with my grandparents after tedious badgering on my part. And there, my weight dropped to a staggering 16 kg.\n\nWhen my dad found out, he took a train back to my grandparents and literally tied me up onto a wheelchair to travel to Shanghai for ED treatment. On our way, we stopped at Beijing and an untold nuance of things happened (I’m too exhausted to go into), but he changed course and listened to my will. Instead of going to Shanghai for treatment (he and I both knew how strong willed and potent my volition was, and that treatment would be futile and fail to benefit me), so we decided to go to Hainan. When we stopped as Guangzhou, I had a thought, “I’m going to induce refeeding syndrome to end myself”, so I told him to allow me to eat a surfeit insofar as to throw up. I ate until I puked and my father didn’t object. I believe there was an aspect of my father changing route in his determination of sending me to the Shanghai ED unit that contributed to my mental healing, as I felt I’ve regained my autonomy again. But the predominant role in this psychosomatic transformation was when I began recalling the progression of my disease. I realized something then and there when I stood in front of a public washroom after vomiting all the food out, “I didn’t gain any control by starving myself, I had been controlled by my illness. It was an illusion of autonomy and pleasure I gained through fulfilling my inner child, but reality was that I was wholly bound by my Anorexia”. That’s when I told myself that I don’t have to be “perfect”, I don’t have to live up to the expectations, hell, I don’t even have to be average!\n\n“Momentum mori, I’m going to die regardless, so why live a life restricted by the expectations and ailments of my psychology?”\n\nI felt an emotion I had never experienced before, it was similar to the Buddhist Moksha (liberation), I felt genuine serenity and grace, alleviation and rebirth, tranquility and universality (sry, I dont know how to palpably describe it). But I knew I was in control this time, I wasn’t going to be coerced by my parents, by their expectations, nor by my Anorexia, I was going to be free and uninhibited. That was the commencement to my journey in recovery. \n\nThere has been tremendous difficulty on my journey in recovery, psychical and psychological. But I had identified something, I know what I needed and strived for what I wanted. Unbinding stubbornness is a double edged sword, it could drive you mad when paired with Anorexia, or it could save you from the darkest pits in life. It sounds cliche, but after I learned to wield that sword, the world is my oyster.\n\n\n\n**part 3, last part**",
          "created_utc": 1732585519.0
        }
      ]
    },
    {
      "id": "l8u1zjw",
      "author": "Bellissimabee",
      "body": "Sorry it's taken me a week to reply, I saw your message but it's such a hard thing for me that I deal with it by burying it, but I thought today I can't keep doing that especially after the amazingly kind words you wrote. So I wanted to say thank you, because you made me feel so much better about it. It's hard when my family and partner constantly remind me about how much I'm spending on it and how little money I have because of it. You're so right though the money and time wasted whenever I choose to get better will remain wasted, but I can't change that. All I can do is look to the future and hopefully somewhere down the line there's a brighter and better one waiting for me. I just need it to hurry up because I'm not getting any younger. \n\nI'm so glad you replied to me, I appreciate everything you said and I hope you are living a happy and healthier life xx",
      "created_utc": 1718525799.0,
      "score": 3,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        },
        {
          "id": "l7jzluf",
          "author": "selkieflying",
          "body": "Yuuuuup breaking the pack a day habit was ROUGH but not did my bank account thank me",
          "created_utc": 1717780075.0
        },
        {
          "id": "l7l323j",
          "author": "Bellissimabee",
          "body": "How did u manage to do it? I'm spending £250 a month on gum, the cost of the packets have gone up so much and I've been spending this every month for the last 6 years, I've got no savings and once the bills are paid I have 0 left over, I've not  had a haircut in 3 years because I need every penny, not brought new clothes, etc. That money could get me a nice holiday or wardrobe, I'm desperate to break free of it, but I can't take the hunger pains all day. Any tips to quit would help please.",
          "created_utc": 1717793491.0
        },
        {
          "id": "l7lmhc1",
          "author": "lola-at-teatime",
          "body": "Wait, isn't gum making you more hungry?? It triggers the release of stomach acid. This is why you should eat gum after eating, to produce saliva that will help clean your teeth.",
          "created_utc": 1717801032.0
        },
        {
          "id": "l7n4as9",
          "author": "Bellissimabee",
          "body": " I don't eat anything until late evening, so I'm hungry in the day anyway if I don't have gum, I think people who have one piece and then that's it probably get hungry, but I'm eating copious amounts of it from when I wake up at 6am until I eat in the evening.\n\nIt doesn't' sound believable but I have 230 pieces of it a day, it's non stop, hence why I'm poor because it's an expensive habit, I hate myself for wasting money on it, I literally work 45 hours a week just to pay for it, what's the point. But I can't quit it now either, it's been this way for 6 years I'm truly addicted to the taste & how it makes me feel. Even though it rises my bank and makes me super gassy. When I add what I've spent over 6 years  it's in the thousands of pounds, I could have a nice chunk of savings behind me, or afford a house by now, instead I've wasted it away on something you chew for 10 mins and replace.\n\nI'm nearly 40 and after 17 years together my partner should have someone who's financially stable, not someone who needs to borrow money off him at the end of the month just to get by. I'm miserable but don't know a way out, if I don't eat gum I know it will just lead to me eating In the day and I can't do that.",
          "created_utc": 1717827372.0
        },
        {
          "id": "l7nkygv",
          "author": "lola-at-teatime",
          "body": "I'm so sorry to hear that, my heart goes with you. I know how hard addiction is. If i am to offer am objective view, many people have at least one dysfunctional thing they spend a lot of money on. If it's not one thing, it's another. So don't be so hard on yourself on it, it just does worse for your wellbeing. I also spend sooo much money and time on food (bulimia) that went in the toilet. I was able to recover partially, the money and time remain wasted, but i don't think about it, it does me no good. There's always time to get better, save money, enjoy some nice nourishing food. \n\nPlease please stop beating yourself up for it, you're only human. 🤍🤍",
          "created_utc": 1717839398.0
        }
      ]
    },
    {
      "id": "l7md8l7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717812593.0,
      "score": 2,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "l7hjrs4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717737835.0
        },
        {
          "id": "l7hv5dz",
          "author": "None",
          "body": "Do you have an app or how do you track everything?",
          "created_utc": 1717745098.0
        },
        {
          "id": "l7hwalg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717745909.0
        },
        {
          "id": "l7l4oc7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717794055.0
        }
      ]
    },
    {
      "id": "l7mi2v0",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717814868.0,
      "score": 2,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "l7hjrs4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717737835.0
        },
        {
          "id": "l7hv5dz",
          "author": "None",
          "body": "Do you have an app or how do you track everything?",
          "created_utc": 1717745098.0
        },
        {
          "id": "l7hwalg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717745909.0
        },
        {
          "id": "l7jfoh9",
          "author": "Equivalent-Act-2739",
          "body": "Lol....you're not worsening anyone's condition. You're just gatekeeping a helpful resource.",
          "created_utc": 1717773367.0
        }
      ]
    },
    {
      "id": "m3tdi5v",
      "author": "Typical_Ad_7291",
      "body": "Exactly! Yes it does\n\nI think it’s managed, but always there",
      "created_utc": 1735177232.0,
      "score": 1,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "m3jxvts",
          "author": "Typical_Ad_7291",
          "body": "What happens if you go over",
          "created_utc": 1735017980.0
        },
        {
          "id": "m3t99w5",
          "author": "ihatethewordoof",
          "body": "It depends on just how much over is. It’s rare that I do that but I’m usually always in a deficit so it makes up for itself. I’d probably spend a day hyper-fixating and body checking though.",
          "created_utc": 1735175375.0
        },
        {
          "id": "m3tbgha",
          "author": "Typical_Ad_7291",
          "body": "So what do you call recovery - eating? (Please note, not sarcasm. It differs for everyone). \n\nI was wondering if recovered meant no thoughts about it, just tracked for OCD. \n\nThank you for clarifying and I’m proud of you! It’s not easy",
          "created_utc": 1735176330.0
        },
        {
          "id": "m3tcyc5",
          "author": "ihatethewordoof",
          "body": "Recovery is different for everyone. My recovery is not being on my death bed in a hospital because I lost 100 pounds in 10 months. I can eat just about everything now as long as I know the calories. Not everyone with anorexia has OCD though. That just so happens to influence my eating disorder. I have compulsions that I need to satisfy or I hyperfixate on it to an unhealthy degree. I’m of the belief that I’ll always have an eating disorder. Whether I’ll relapse, I don’t know. My relationship with food has drastically improved and that’s something to me. Hopefully that answers your question?",
          "created_utc": 1735176988.0
        }
      ]
    },
    {
      "id": "m3tehob",
      "author": "Typical_Ad_7291",
      "body": "I’m also impressed you will cook! I can’t seem to major myself",
      "created_utc": 1735177661.0,
      "score": 1,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "m3jxvts",
          "author": "Typical_Ad_7291",
          "body": "What happens if you go over",
          "created_utc": 1735017980.0
        },
        {
          "id": "m3t99w5",
          "author": "ihatethewordoof",
          "body": "It depends on just how much over is. It’s rare that I do that but I’m usually always in a deficit so it makes up for itself. I’d probably spend a day hyper-fixating and body checking though.",
          "created_utc": 1735175375.0
        },
        {
          "id": "m3tbgha",
          "author": "Typical_Ad_7291",
          "body": "So what do you call recovery - eating? (Please note, not sarcasm. It differs for everyone). \n\nI was wondering if recovered meant no thoughts about it, just tracked for OCD. \n\nThank you for clarifying and I’m proud of you! It’s not easy",
          "created_utc": 1735176330.0
        },
        {
          "id": "m3tcyc5",
          "author": "ihatethewordoof",
          "body": "Recovery is different for everyone. My recovery is not being on my death bed in a hospital because I lost 100 pounds in 10 months. I can eat just about everything now as long as I know the calories. Not everyone with anorexia has OCD though. That just so happens to influence my eating disorder. I have compulsions that I need to satisfy or I hyperfixate on it to an unhealthy degree. I’m of the belief that I’ll always have an eating disorder. Whether I’ll relapse, I don’t know. My relationship with food has drastically improved and that’s something to me. Hopefully that answers your question?",
          "created_utc": 1735176988.0
        }
      ]
    },
    {
      "id": "lz13grf",
      "author": "grxyilli",
      "body": "Thank you so much for taking time out of your day to respond! I go on rants sometimes and lose track of how much I output lol.\n\nHelplessness, as you’ve delineated, is a central constituent in the manifestation of AN. In psychoanalysis: we *sublimate* (transfer our desires and emotions from the symbolic order to an object in reality) our desires for control onto our bodies. The predicaments you’ve gone through with trying to extricate your mother from her relationship and the unpredictable and novel environment after you’ve changed schools abruptly, inevitably took a toll on your psychological wellbeing. To salvage some form of psychological equilibrium, you developed a mechanism of starvation to signify a realm of jurisdiction because other mechanisms were out of reach. \n\nThe Anorexic gene is a substantiated conjecture on how our ancestors began deriving gratification and euphoria from our hunger. It stimulates a rush of dopamine that invigorates our ancestors to find food in a timely manner. This gene has negative connotations nowadays; striving for the desire of asymptotic emaciation rewards our brain with dopamine and achievement. This happens primarily because we aren’t receiving sufficient pride in our current accomplishments.\n\nIt’s amazing that you’ve already identified what has been impeding your sense of self and accomplishment. The mundane tasks of schoolwork and parental expectations have consumed your freedom and obscured the direction of your life. I understand how difficult it is to alleviate the burden and inundations, because one can’t just elude the ideologies and doctrines that have been ingrained in our mind, and I don’t believe I currently have the erudition insofar as to guide you (my life still requires much reparations lol). I strongly disdain contemporary treatment methodologies of forced refeeding and do not support reductionistic tenets of therapy, because it fails to address the underlying impetus, which is control and also untold nuanced psychoanalytical frameworks (which are highly controversial: it involves anorexic fetishism, electra complex, etc. which sounds fanciful when not examined holistically). That being said, perhaps if you rekindled an interest or avocation (ie. begin taking courses in what intrigues you, not what you believe is stipulated by societal mores), then you may feel a restoration of individual autonomy. And eventually, you would feel comfortable enough to stray away from the clasps of vocational expectations and immerse yourself in what you truly value. Afterall, we live only once, and like hell I’m going to compromise my livelihood all because of the plights fate has dealt me with. I shall inhibit no regrets when I’m lying on my deathbed.\n\nP.S: I somehow developed a knack for the culinary arts and gastronomy, so I proceeded to write my own recipe book. I also began to work in restaurants as a mechanism to rebuild my relationship with food (started doing this unconsciously after I quit the 140-page book of listing foods I’ve eaten, interesting how the mind can concoct new methods to fortify itself and expedite recovery). It’s also imperative to note that coping mechanisms are always idiosyncratic and should tailor to the individuals personal needs. I think the reason you haven’t settled on a technique yet is due to the nature of your environment, there has been slim opportunities for you to truly reconnect with yourself, and trust me, opportunities will present themselves when you rectify your exogenous environment (for me, it was emancipation from my father). A turtle can’t crawl out of its shell if it perceives imminent danger, so I suggest placing yourself in a position of psychological comfort before attempting to ameliorate your AN.",
      "created_utc": 1732597560.0,
      "score": 1,
      "context": [
        {
          "id": "lveja44",
          "author": "grxyilli",
          "body": "When i was 15 (five months ago), I was emaciated to ghe weight of 16 kg at a height of 155 cm, I began to engage in the ritual of chewing and spitting out food, meticulously rinsing my mouth after each bite to ensure that no remnants remained and that no accidental caloric intake occurred through cephalic ingestion through my saliva. This was followed by a tedious routine of brushing my teeth and tongue to pristine cleanliness (albiet w/o toothpaste due to fear that it contained calories. Chew/spit process became an intense source of psychological satisfaction: chewing, spitting, rinsing, and brushing satiated me an illusion of absolute control, that even with food present in my mouth, I maintained the autonomy to expel every trace of potential calorie, a behavior driven by a deeply entrenched psychogenic impulse rooted in maintaining control during the chaos of my unstable domestic environment. I always had an innate predisposition for OCD, which manifested into Anorexia due to the sporadic blights of my household environment as I begun fixating over my numerical weight\n\nThis insane regimen led to an expenditure of calories so significant that I managed to lose 0.4 kg daily, resulting in an exponential drastic decrease from 42 kg to 16 kg within less than four months. my objective was to starve myself to death; I perceived death through anorexia as much more tranquil and enjoyable than platitudinal suicide. I also had a morbid vision of myself dying at 15, looking like an Egyptian mummy in my casket, romanticizibg the idealization of extreme atrophy.\n\nDuring this epoch, (thinking back its kind of embarrassingly humorous) I curated a 140-page document on Google Docs, morbidly scrutinizing every type of food, analyzing its textures, brand, and whether it felt overly unctuous or “fatty.” I would not even proceed to chew/spit the food if I couldn’t identify the type or brand as everything that touched my mouth must be recorded in this document in overt and austere detail or it would trigger profound neurotic distress. reinforcing my OCD.\n\nDespite drinking around 4L of water daily, I was severely dehydrated due to the utter lack of sodium and electrolytes. My lips would frequently crack and bleed, yet even blood was promptly spat out and my mouth cleansed, driven by an irrational fear that it might contain calories.\n\nMy inborn predisposition for OCD manifested into anorexia when the exogenous domestic instability and abuse exacerbated my need for control and autonomy. On June 11th, 2024, I concluded that my initial plan to succumb to death through anorexia was unattainable, as my guardians persisted in sending me to eating disorder treatment facilities. In response, I attempted suicide via refeeding syndrome by consuming an excessive amount of food daily. This led to terrifying peripheral edema, gastrointestinal paresis, and alternating tachycardia and bradycardia arrhythmias. To my dismay, these symptoms subsided after one month. Realizing my plan to die before turning 16 was thwarted, I ultimately gave up attempting to die through ED or Refeeding syndrome. I knew that no physician or psychiatrist could alleviate my profound psychosomatic torment; the enforced confinement in treatment units only intensified my sense of lost control, I understood that my environment was stipulated to change before my healing can commence. I identified the primary source of instability within my family and I was determined to ameliorate my internal psychological warfare, thus I distanced myself from the family members who inflicted torment upon me. Now I’m significantly better.",
          "created_utc": 1730750763.0
        },
        {
          "id": "lvekeqz",
          "author": "None",
          "body": "Are you doing better now? I can’t even imagine 16kg at 155cm, I’m so sorry you went through that",
          "created_utc": 1730751096.0
        },
        {
          "id": "lves2th",
          "author": "grxyilli",
          "body": "Yes, I have made a full recovery but I acknowledge that I will likely forever be bound by my innate predisposition for Anorexia. When I fall back into my inhibitions, these emotions still resurge. No medicine nor psychotherapy can cure it, I simply reassure myself of my worth and remind myself “momentum mori”, one day I’m going to die anyways thus life should be free of obligations and I shouldn’t feel obliged to achieve a certain extremity of “skinniness”. I’m doing significantly better now and feel liberated from my morbid notions of being emaciated.",
          "created_utc": 1730753354.0
        },
        {
          "id": "lyzm8yc",
          "author": "No_Experience3593",
          "body": "Do you mind explaining what may have triggered it? Trauma? Abusive household? Were you unsatisfied with life?",
          "created_utc": 1732577537.0
        },
        {
          "id": "lz08r9g",
          "author": "grxyilli",
          "body": "I’ve been through manifold eating disorder units and ICU treatments, but it was futile. How do you remedy the illness that remains the only thing keeping you from suic*de? As I watched my weight drop every day, I felt a sense of satiation and gratification; a jouissance and ecstasy I’ve felt before, comparable to the feeling of pride when I accomplished something academically intensive. I was proud of how I was incrementally kllling myself, and I knew damn well I was going to die. But hey, I thought “id look astonishingly attractive in my casket”. I had romanticized my demise and the tragedy of my psyche. \n\nEventually, I realized that the Canadian healthcare system was too vigorous and I wasn’t able to terminate my life in Canada, so I convinced my father to take me back to China, and off we went. I would be admitted into hospitals in my homeland, but managed in persuading my father to allow me residence with my grandparents after tedious badgering on my part. And there, my weight dropped to a staggering 16 kg.\n\nWhen my dad found out, he took a train back to my grandparents and literally tied me up onto a wheelchair to travel to Shanghai for ED treatment. On our way, we stopped at Beijing and an untold nuance of things happened (I’m too exhausted to go into), but he changed course and listened to my will. Instead of going to Shanghai for treatment (he and I both knew how strong willed and potent my volition was, and that treatment would be futile and fail to benefit me), so we decided to go to Hainan. When we stopped as Guangzhou, I had a thought, “I’m going to induce refeeding syndrome to end myself”, so I told him to allow me to eat a surfeit insofar as to throw up. I ate until I puked and my father didn’t object. I believe there was an aspect of my father changing route in his determination of sending me to the Shanghai ED unit that contributed to my mental healing, as I felt I’ve regained my autonomy again. But the predominant role in this psychosomatic transformation was when I began recalling the progression of my disease. I realized something then and there when I stood in front of a public washroom after vomiting all the food out, “I didn’t gain any control by starving myself, I had been controlled by my illness. It was an illusion of autonomy and pleasure I gained through fulfilling my inner child, but reality was that I was wholly bound by my Anorexia”. That’s when I told myself that I don’t have to be “perfect”, I don’t have to live up to the expectations, hell, I don’t even have to be average!\n\n“Momentum mori, I’m going to die regardless, so why live a life restricted by the expectations and ailments of my psychology?”\n\nI felt an emotion I had never experienced before, it was similar to the Buddhist Moksha (liberation), I felt genuine serenity and grace, alleviation and rebirth, tranquility and universality (sry, I dont know how to palpably describe it). But I knew I was in control this time, I wasn’t going to be coerced by my parents, by their expectations, nor by my Anorexia, I was going to be free and uninhibited. That was the commencement to my journey in recovery. \n\nThere has been tremendous difficulty on my journey in recovery, psychical and psychological. But I had identified something, I know what I needed and strived for what I wanted. Unbinding stubbornness is a double edged sword, it could drive you mad when paired with Anorexia, or it could save you from the darkest pits in life. It sounds cliche, but after I learned to wield that sword, the world is my oyster.\n\n\n\n**part 3, last part**",
          "created_utc": 1732585519.0
        },
        {
          "id": "lz0y78g",
          "author": "No_Experience3593",
          "body": "I also must add that I think most of my problem now and the reason why the noise is so damn loud is that, I’m not living the life I truly want to live or follow the career path that I truly want. First generation college student and it’s like you don’t major in the arts, you major in something safe and something that’s guaranteed you a lasting career and like something that your mother could then brag on you about to her coworkers or her estranged family members. Anorexia gives me something I can control currently and so when I’m not loosing the weight or fail to adhere to the million of food rules I’ve put myself under, I feel like a turtle and it’s shell underneath the world and everything in it! It’s control, control, control. All control. Maybe I need to give psychoanalysis a try.",
          "created_utc": 1732595141.0
        }
      ]
    },
    {
      "id": "l8uy3ap",
      "author": "lola-at-teatime",
      "body": "Everything i said came from the heart and from the experience of battling 13 years of severe bulimia. I've been where you've been.\nWhat i do is call money \"rasberries\". It takes out from the weight of the word. As long as you have enough of them to provide shelter and food, you're honestly good. That's what you need for survival. You already have more than many people on this planet.\nIs kind of normal and expected that your family and partner remind you of that aspect. They mean well, but they probably don't know how much it cab do more harm than good. Try to make peace with their perspective as well. Have you asked them to not mention it anymore, as it can become v triggering? When my mom would remind me of how much of her money I'm spending on thrown up food it made me feel awful and didn't help at all, but the contrary. Just made me be more sneaky and secretive. Addiction  doesn't get healed with shame.\n\nThese are the lessons you need to go through this lifetime, until you get reincarnated in the next one. I truly hope you will find a way to manage , if not overcome these hardships. I was looking through your post history and i've noticed you're an extremely low weight, which breaks my heart. Truly hope the best for you girl ❤️",
      "created_utc": 1718545631.0,
      "score": 2,
      "context": [
        {
          "id": "l7hghnn",
          "author": "die-tc0ke",
          "body": "i know this is pretty common but i chewed an insane amount of gum. like multiple packs a day.",
          "created_utc": 1717735958.0
        },
        {
          "id": "l7jzluf",
          "author": "selkieflying",
          "body": "Yuuuuup breaking the pack a day habit was ROUGH but not did my bank account thank me",
          "created_utc": 1717780075.0
        },
        {
          "id": "l7l323j",
          "author": "Bellissimabee",
          "body": "How did u manage to do it? I'm spending £250 a month on gum, the cost of the packets have gone up so much and I've been spending this every month for the last 6 years, I've got no savings and once the bills are paid I have 0 left over, I've not  had a haircut in 3 years because I need every penny, not brought new clothes, etc. That money could get me a nice holiday or wardrobe, I'm desperate to break free of it, but I can't take the hunger pains all day. Any tips to quit would help please.",
          "created_utc": 1717793491.0
        },
        {
          "id": "l7lmhc1",
          "author": "lola-at-teatime",
          "body": "Wait, isn't gum making you more hungry?? It triggers the release of stomach acid. This is why you should eat gum after eating, to produce saliva that will help clean your teeth.",
          "created_utc": 1717801032.0
        },
        {
          "id": "l7n4as9",
          "author": "Bellissimabee",
          "body": " I don't eat anything until late evening, so I'm hungry in the day anyway if I don't have gum, I think people who have one piece and then that's it probably get hungry, but I'm eating copious amounts of it from when I wake up at 6am until I eat in the evening.\n\nIt doesn't' sound believable but I have 230 pieces of it a day, it's non stop, hence why I'm poor because it's an expensive habit, I hate myself for wasting money on it, I literally work 45 hours a week just to pay for it, what's the point. But I can't quit it now either, it's been this way for 6 years I'm truly addicted to the taste & how it makes me feel. Even though it rises my bank and makes me super gassy. When I add what I've spent over 6 years  it's in the thousands of pounds, I could have a nice chunk of savings behind me, or afford a house by now, instead I've wasted it away on something you chew for 10 mins and replace.\n\nI'm nearly 40 and after 17 years together my partner should have someone who's financially stable, not someone who needs to borrow money off him at the end of the month just to get by. I'm miserable but don't know a way out, if I don't eat gum I know it will just lead to me eating In the day and I can't do that.",
          "created_utc": 1717827372.0
        },
        {
          "id": "l7nkygv",
          "author": "lola-at-teatime",
          "body": "I'm so sorry to hear that, my heart goes with you. I know how hard addiction is. If i am to offer am objective view, many people have at least one dysfunctional thing they spend a lot of money on. If it's not one thing, it's another. So don't be so hard on yourself on it, it just does worse for your wellbeing. I also spend sooo much money and time on food (bulimia) that went in the toilet. I was able to recover partially, the money and time remain wasted, but i don't think about it, it does me no good. There's always time to get better, save money, enjoy some nice nourishing food. \n\nPlease please stop beating yourself up for it, you're only human. 🤍🤍",
          "created_utc": 1717839398.0
        },
        {
          "id": "l8u1zjw",
          "author": "Bellissimabee",
          "body": "Sorry it's taken me a week to reply, I saw your message but it's such a hard thing for me that I deal with it by burying it, but I thought today I can't keep doing that especially after the amazingly kind words you wrote. So I wanted to say thank you, because you made me feel so much better about it. It's hard when my family and partner constantly remind me about how much I'm spending on it and how little money I have because of it. You're so right though the money and time wasted whenever I choose to get better will remain wasted, but I can't change that. All I can do is look to the future and hopefully somewhere down the line there's a brighter and better one waiting for me. I just need it to hurry up because I'm not getting any younger. \n\nI'm so glad you replied to me, I appreciate everything you said and I hope you are living a happy and healthier life xx",
          "created_utc": 1718525799.0
        }
      ]
    },
    {
      "id": "l7mihwx",
      "author": "None",
      "body": "Thanks! All my babies are out of nappies now but keeping track of their sleep/food etc is super helpful for doctors visits",
      "created_utc": 1717815071.0,
      "score": 2,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "l7hjrs4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717737835.0
        },
        {
          "id": "l7hv5dz",
          "author": "None",
          "body": "Do you have an app or how do you track everything?",
          "created_utc": 1717745098.0
        },
        {
          "id": "l7hwalg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717745909.0
        },
        {
          "id": "l7l4oc7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717794055.0
        },
        {
          "id": "l7md8l7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717812593.0
        }
      ]
    },
    {
      "id": "l7miw19",
      "author": "Xarismatic",
      "body": "I agree with this random stranger.",
      "created_utc": 1717815261.0,
      "score": 3,
      "context": [
        {
          "id": "l7hfn0f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717735486.0
        },
        {
          "id": "l7himrj",
          "author": "ihatethewordoof",
          "body": "Dudeeeee, it was so nice to read this. I’m five, almost six, years into recovery and I still calorie count everyday. I went inpatient at 13 and was diagnosed with OCD. The OCD turned into anorexia when I was 16. I use a food scale for everything and have notes filled with recipes that are calorie counted down to the last ingredient. I don’t think I’ll never not calorie count. I’m weight restored, healthy, and eat pretty much whatever I want whenever I want. I just always have my calculator updated with what I’ve eaten.",
          "created_utc": 1717737169.0
        },
        {
          "id": "l7hjrs4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717737835.0
        },
        {
          "id": "l7hv5dz",
          "author": "None",
          "body": "Do you have an app or how do you track everything?",
          "created_utc": 1717745098.0
        },
        {
          "id": "l7hwalg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717745909.0
        },
        {
          "id": "l7jfoh9",
          "author": "Equivalent-Act-2739",
          "body": "Lol....you're not worsening anyone's condition. You're just gatekeeping a helpful resource.",
          "created_utc": 1717773367.0
        },
        {
          "id": "l7mi2v0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717814868.0
        }
      ]
    }
  ]
}