{
  "id": "1djthu5",
  "subreddit": "AnorexiaNervosa",
  "author": "knoppersnutbar",
  "created_utc": 1718829745.0,
  "title": "Thigh gap this thigh gap that",
  "selftext": "Why just WHY are we so obsessed with that damn thigh gap? Everytime I see mine I get such a calm almost euphoric feeling and my mood gets better, how twisted is that?? As soon as it disappears or doesnt show as much as I want it to I restrict like a maniac and feel awful. For me the thigh gap is my ultimate goal and I look for it in every mirror I pass and it’s so tiring… I’m so tired. I do body checks in the mirror maybe a hundred times a day.  \nI just want it to stop. I want to be free from this sick obsession and live a free happy life and focus on the good things in life. Instead I let my body and the fixation on food decide what mood I’m having every damn day. \nHow do I recover from this mess?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1djthu5/thigh_gap_this_thigh_gap_that/",
  "score": 112,
  "num_comments": 18,
  "comments": [
    {
      "id": "l9d42it",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1718829745.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l9dd7ae",
      "author": "JuggaloEnlightment",
      "body": "People obsess over the thigh gap because it’s the only part of your body where you can measure weight loss in the form of an empty space/void. Everything else just gets smaller; thigh gap gets bigger. It really brings home the feeling of disappearing into nothingness; you identify with the empty space between your legs more than the legs themselves",
      "created_utc": 1718832925.0,
      "score": 70,
      "context": []
    },
    {
      "id": "l9d7tof",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1718831018.0,
      "score": 53,
      "context": []
    },
    {
      "id": "l9didb7",
      "author": "raccoonsaff",
      "body": "I promise, once you get to a healthier weight...it really doesn't matter as much. You don't think about it, or you think about it a lot less, I think because:\n\n\\- You're doing things, you've got the energy to LIVE life and be busy\n\n\\- You feel more confident because you actually LOOK better\n\n\\- You no longer cling to the ED world and identity and realise people don't care!\n\n\\- You're generally less obsessive as your brain starts to work!",
      "created_utc": 1718834833.0,
      "score": 11,
      "context": []
    },
    {
      "id": "l9f89bv",
      "author": "Only-Basil-5222",
      "body": "It’s not just you. Give yourself some grace. You are enough and you are worthy of love and happiness!",
      "created_utc": 1718861973.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l9hmtmu",
      "author": "zillabirdblue",
      "body": "I don’t know if I’ll ever get over it. The sensation of my thighs brushing together makes me spiral. I try not to let it happen because it’s so triggering while struggling to stay on top of my recovery. I should focus on making that sensation LESS triggering…honestly feel like I’ll probably always have this issue. I don’t like the way it feels and when it happens it doesn’t take long before I just stop eating until it’s “fixed”. Whatever, it’s a small thing to spend so much time and energy worrying about!!!! So frustrating.",
      "created_utc": 1718903519.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l9edsvq",
      "author": "CoiledBubble413",
      "body": "i relate to this a lot and i’m in a similar situation, but i promise you it will get better for both of us one day :)",
      "created_utc": 1718847324.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l9fjsoy",
      "author": "beepdoopbedo",
      "body": "I think it’s because you can’t have one if you’re an average weight, so it’s one of the most obvious indicators that someone is underweight",
      "created_utc": 1718869619.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l9hgzoz",
      "author": "Agile_Cash_4249",
      "body": "This is from my recollection, so I could be wrong. But I am in my mid 20s, and I distinctly remember around 2012-2014 when the thigh gap was literally invented. The concept NEVER existed before (maybe in the more insulated pro ana forms they had in the 2000s but certainly not mainstream). Not even on trashy tabloids that criticized women’s weights in horrible ways throughout all of the 00s. \n\nThe thigh gap partially led to my ED. I just wish I had never learned about it or saw it on Tumblr. \n\nSometimes I see newly invented flaws women are supposed to know about, but after my experience with the thigh gap, I know better than to look it up.",
      "created_utc": 1718901652.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l9llr7f",
      "author": "None",
      "body": "As someone who has anorexia, but not anorexia nervosa - for me it is the complete opposite. My anorexia is brought on by depression, and when that thigh gap starts, my anxiety skyrockets. I become obsessively self-conscious, I realize I am too thin and hate it... the stress makes my appetite even worse...by this point, the thought of food is nauseating and thus the behavior ends up spiraling. I am not sure what support group to join because I don't feel I fit this support group. :( I am sorry for all of you struggling with this because I can only imagine how much harder it is to fight a illness that your mind is telling you is \"good\".",
      "created_utc": 1718968728.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l9fbx7v",
      "author": "Legitimate_Phase2498",
      "body": "It’s just comforting to hear I’m not alone in literally 100 body checks a day",
      "created_utc": 1718864249.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l9fombe",
      "author": "NationalAd9154",
      "body": "I wish my legs were normal 😅 my thigh gap is a result of my bowlegs🥲",
      "created_utc": 1718873106.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l9fwt66",
      "author": "None",
      "body": "I relate to this so much",
      "created_utc": 1718878891.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l9h0acw",
      "author": "NerdyGran",
      "body": "For me it's that and the way my knees \"stick out\" from my legs",
      "created_utc": 1718896133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l9f8cix",
      "author": "Only-Basil-5222",
      "body": "Perfect explanation! Thank you so much. This is helpful. Very helpful.",
      "created_utc": 1718862026.0,
      "score": 8,
      "context": [
        {
          "id": "l9dd7ae",
          "author": "JuggaloEnlightment",
          "body": "People obsess over the thigh gap because it’s the only part of your body where you can measure weight loss in the form of an empty space/void. Everything else just gets smaller; thigh gap gets bigger. It really brings home the feeling of disappearing into nothingness; you identify with the empty space between your legs more than the legs themselves",
          "created_utc": 1718832925.0
        }
      ]
    },
    {
      "id": "l9d8uvx",
      "author": "knoppersnutbar",
      "body": "Wow that sounds wonderful. So happy for you! \nIt does make sense when I read it like this, but I’m too deep down in my ed-mess to fully understand it and follow that advice I think.",
      "created_utc": 1718831380.0,
      "score": 6,
      "context": [
        {
          "id": "l9d7tof",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1718831018.0
        }
      ]
    },
    {
      "id": "l9hvo4k",
      "author": "knoppersnutbar",
      "body": "Omg so true",
      "created_utc": 1718906373.0,
      "score": 1,
      "context": [
        {
          "id": "l9hgzoz",
          "author": "Agile_Cash_4249",
          "body": "This is from my recollection, so I could be wrong. But I am in my mid 20s, and I distinctly remember around 2012-2014 when the thigh gap was literally invented. The concept NEVER existed before (maybe in the more insulated pro ana forms they had in the 2000s but certainly not mainstream). Not even on trashy tabloids that criticized women’s weights in horrible ways throughout all of the 00s. \n\nThe thigh gap partially led to my ED. I just wish I had never learned about it or saw it on Tumblr. \n\nSometimes I see newly invented flaws women are supposed to know about, but after my experience with the thigh gap, I know better than to look it up.",
          "created_utc": 1718901652.0
        }
      ]
    },
    {
      "id": "l9fkwht",
      "author": "Shxnxgamx",
      "body": "Also it’s very likely that your body dysmorphia will decrease.",
      "created_utc": 1718870425.0,
      "score": 5,
      "context": [
        {
          "id": "l9d7tof",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1718831018.0
        },
        {
          "id": "l9d8uvx",
          "author": "knoppersnutbar",
          "body": "Wow that sounds wonderful. So happy for you! \nIt does make sense when I read it like this, but I’m too deep down in my ed-mess to fully understand it and follow that advice I think.",
          "created_utc": 1718831380.0
        }
      ]
    },
    {
      "id": "l9h18fv",
      "author": "callmeanightmare",
      "body": "This! While I was extremely unhappy after being weight restored I still felt I looked less fat than at my lw. Its crazy.",
      "created_utc": 1718896450.0,
      "score": 3,
      "context": [
        {
          "id": "l9d7tof",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1718831018.0
        },
        {
          "id": "l9d8uvx",
          "author": "knoppersnutbar",
          "body": "Wow that sounds wonderful. So happy for you! \nIt does make sense when I read it like this, but I’m too deep down in my ed-mess to fully understand it and follow that advice I think.",
          "created_utc": 1718831380.0
        },
        {
          "id": "l9fkwht",
          "author": "Shxnxgamx",
          "body": "Also it’s very likely that your body dysmorphia will decrease.",
          "created_utc": 1718870425.0
        }
      ]
    }
  ]
}