{
  "id": "1dnpdqs",
  "subreddit": "AnorexiaNervosa",
  "author": "NotMyColeSlaw",
  "created_utc": 1719265632.0,
  "title": "My husband made a comment and I have been spiraling ever since. ",
  "selftext": "I had pretty severe ana for several years in my teens. I was hospitalized twice and had horrible experiences. Through hard work and a lot of relapsing I have been on a pretty decent path for several years. Obviously the feelings never went away but the restricting got much better to the point I gained a significant amount of weight. The other day I found out my husband had been using illegal steroids behind my back so we had a conversation about what led him to keep this from me, what feelings he was feeling, etc. he proceeded to bring up how much we have changed. How we have gotten older and our bodies are changing. He then mentions that I have gained weight and look different than when he met me. This is something I am obviously aware of but hearing it out loud was so emotionally devastating for me I didn’t know what to even think. And for the first time in years, I am restricting again. And all the work I put in feels like nothing at all. My husband works out of state for months at a time and my brain is telling me how wonderful things will be now that I am restricting and am truly alone to do what I want. I don’t even know what to do at this point. It’s like every ounce of everything I put into trying to be okay is just disappearing right in front of me and the worst part is I am happier to be back to doing this than I have felt in awhile. And if a honest conversation where my husband acknowledges something I have known all along could cause me to break so easily then who was I kidding these past few years? Was I ever really in a better place at all? Idk. That’s my rant for today. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1dnpdqs/my_husband_made_a_comment_and_i_have_been/",
  "score": 118,
  "num_comments": 13,
  "comments": [
    {
      "id": "la44hxs",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1719265633.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la46544",
      "author": "SageTheHyppo",
      "body": "You are loved and SO beautiful. You don’t need to be at a certain weight to attain value, it’s innate. ❤️❤️❤️",
      "created_utc": 1719266215.0,
      "score": 52,
      "context": []
    },
    {
      "id": "la4ccb2",
      "author": "Courtney_DiLaurentis",
      "body": "I am both infuriated and heartbroken for you right now!! There is no way he can remotely connect his illegal steroid use to your weight fluctuations!! It’s not okay for him to project his insecurities onto you. I am so sorry OP, bodies are supposed to change and look different over time (even if some of us with ed’s wish they didn’t). He probably looks different now than when you first met, and I’m sure you love him all the same! I’m so frustrated that he tried to use you as an excuse to use steroids, that’s awful. Please take care of yourself🫶🏻",
      "created_utc": 1719268531.0,
      "score": 51,
      "context": []
    },
    {
      "id": "la4eqp0",
      "author": "No_Philosophy7921",
      "body": "I don’t know what possessed him to speak to someone he loves like that. To blame something he is struggling with on your body? Even without an ED history that’s a horrible thing to do. Honestly OP, if it were me this might be a deal breaker. I don’t know the history between you two, I’m sure you could talk it out if you wanted to, but someone who is supposed to love me speaking to me like that is not something I think I could get over. I know it’s hard, but you don’t deserve to get punished for his assholery. Try to keep eating, you’re doing so well and you should be so proud. It’s so hard. One setback does not negate the years and energy you put into your healing. Nobody is immune to triggers, it’s how we respond to them. Sending you hugs🩷",
      "created_utc": 1719269426.0,
      "score": 37,
      "context": []
    },
    {
      "id": "la4u8vl",
      "author": "Old-Friendship9613",
      "body": "I hear you and I totally get where you're coming from. I know how devastating it can be when a comment hits that sensitive spot we all have about our bodies and weight. First off, I want you to know that your feelings are valid and understandable. What your husband said was tough to hear, especially given your history.\n\nBut here's the thing - all that hard work you put in over the years? It's not gone!! Recovery isn't a straight line, and this bump in the road doesn't erase all the progress you've made. I know it might feel like you're back at square one, but you're not. You've got skills and strength you didn't have before, even if they feel out of reach right now.\n\nI'm worried about you falling back into restriction, though. I get that it feels good in the moment - that sense of control can be so seductive. But we both know where that road leads, and it's not somewhere you want to go again. Your health and well-being are worth so much more than any number on a scale.\n\nI think it might be really helpful to talk to someone about this - maybe a therapist or counselor who gets ED stuff. And as hard as it might be, maybe think about opening up to your husband about how his words affected you. He might not realize the impact they had.\n\nYou're not alone in this. Please please reach out for support, whether it's to professionals, support groups, or even just friends who understand. You've fought hard to get where you are, and you've got the strength to keep fighting. Sending you all the support and good vibes <3",
      "created_utc": 1719275336.0,
      "score": 9,
      "context": []
    },
    {
      "id": "la7gwdg",
      "author": "Vaggs75",
      "body": "It feels like he was anticipating a lash out on him, because steroids are very dangerous and women (who don't use them) fear them especially. He was surprised that you decided to talk about it, instead of leaving him, so he really tried to play the victim and it would have been easier if you screamed at him. But you didn't so he became very cornered. He just threw out something that you couldn't even respond to, which honestly doesn't even make sense. \n\nAnother theme is that he may be suffering from ED, and may have a distorted image of his, ,as well as others'bodies. \n\nI think you should tell him to stop the steroids and ask for an apology, and this will be happily resolved for the both of you. \n\n  \nBest of lack to you, I'm so happy that you have made all this progress for all these years! Never forget how beautiful you are!",
      "created_utc": 1719324156.0,
      "score": 8,
      "context": []
    },
    {
      "id": "la7feyn",
      "author": "rxnyeah",
      "body": "I’m sorry but your husband is an ass",
      "created_utc": 1719323606.0,
      "score": 3,
      "context": []
    },
    {
      "id": "la6kdh3",
      "author": "FlameP76",
      "body": "Yea no, that was dog of him to spin it back on you love. \nI'm so sorry he said that honestly, his use of steriods have nothing to do with you and everything to do with how he feels about himself and his own insecurities.\n\nYou deserve better",
      "created_utc": 1719307713.0,
      "score": 3,
      "context": []
    },
    {
      "id": "la4dbxs",
      "author": "Kindly_Concentrate12",
      "body": "Oh boo to him for saying that. There are excuses that can be made like he wasn't thinking about your Ana, but every guy knows not to say something about a woman's weight. If he is taking steroids it could also be affecting his mood, etc. Even if it was an honest conversation, he's justifying doing things behind your back instead of telling you up front. And being triggered happens, don't beat yourself up. Maybe take some time to think, reflect, ensure that he isn't still using drugs- because please think of using steroids on the same level as doing other drugs, it's the same or worse in some cases - and talk to him again. Tell him that you have been relapsing and feeling bad lately. You don't even have to tell him why if you don't want to, honestly if you say why he might utilize that as an excuse not to be open with you in the future. \n\n I'm really sorry, sweetie. You didn't deserve that. My loved one telling me I put on weight would hurt so bad.",
      "created_utc": 1719268900.0,
      "score": 3,
      "context": []
    },
    {
      "id": "la6infh",
      "author": "MercurialChickadee",
      "body": "I know that feeling very well. It is very frustrating and hopeless, and you have my deepest sympathy.\nSo, snap back to reality. Your “progress” is not a glass that can break. Your “set of actions” is not an object that can break. The time passed in joy does not come back painful. You CAN stop restricting again, and you deserve to.\nYes, of course, it feels good to be back. An addict would be thrilled by the first fix after a ten year detox… but it works the same way, I think you know how you’ll stop feeling thrilled when following the restriction urge and start feeling miserable when not.\nAnd you deserve to feel thrilled without doing so… and I believe you can.",
      "created_utc": 1719306458.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la7phrc",
      "author": "Eiffeltoren",
      "body": "Maybe he thinks your battle belongs to the past 🤷🏻‍♀️ is he aware you are still struggling ?",
      "created_utc": 1719327226.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la9rg2s",
      "author": "Vaggs75",
      "body": "clarification\\* his comment on how you are getting older and your bodies are changing doesn't make sense. That is just sentimental response to a very specific issue (steroids)",
      "created_utc": 1719351598.0,
      "score": 2,
      "context": [
        {
          "id": "la7gwdg",
          "author": "Vaggs75",
          "body": "It feels like he was anticipating a lash out on him, because steroids are very dangerous and women (who don't use them) fear them especially. He was surprised that you decided to talk about it, instead of leaving him, so he really tried to play the victim and it would have been easier if you screamed at him. But you didn't so he became very cornered. He just threw out something that you couldn't even respond to, which honestly doesn't even make sense. \n\nAnother theme is that he may be suffering from ED, and may have a distorted image of his, ,as well as others'bodies. \n\nI think you should tell him to stop the steroids and ask for an apology, and this will be happily resolved for the both of you. \n\n  \nBest of lack to you, I'm so happy that you have made all this progress for all these years! Never forget how beautiful you are!",
          "created_utc": 1719324156.0
        }
      ]
    }
  ]
}