{
  "id": "1do77ln",
  "subreddit": "AnorexiaNervosa",
  "author": "user8361572",
  "created_utc": 1719325337.0,
  "title": "my therapist told me i look disgusting ",
  "selftext": "she said it because of my weight and it’s not left my mind all day, she knows i’ve been struggling like hell with eating recently and cut down a lot - it’s partly the reason of wanting to look skinnier but mainly just external factors and things thatve been going on, eating hasn’t been a priority for me and i’ve been avoiding it as much as possible, and she was making comments today about how she can tell i’ve lost weight and ‘it looks disgusting’ even her facial expressions she looked revolted, it made me wanna cry i was so shocked she could say that so bluntly, in a way as though i don’t eat for the fun of it? she was making comments about how ‘i look anorexic’ too and i don’t think she realises how insensitive she is \n",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1do77ln/my_therapist_told_me_i_look_disgusting/",
  "score": 130,
  "num_comments": 69,
  "comments": [
    {
      "id": "la7k3z3",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1719325338.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la7wsro",
      "author": "quarantinemeplz",
      "body": "Time to get a new therapist. Her comment was completely inappropriate, cruel, & unprofessional. Those words should never come from any therapist. Ever. I’m sorry she said that to you.",
      "created_utc": 1719329708.0,
      "score": 176,
      "context": []
    },
    {
      "id": "la7l30r",
      "author": "brownguyinthecorner",
      "body": "Y'know what's so ironic about our condition is that once we get what we think we wanted we actually hate it. Is your therapist specialising in ED's? Regardless of their specialities or lack thereof, that was a totally insensitive and rude thing to say. I'm sorry you had to hear that and deal with it. Some therapists should really be seeking different professions...",
      "created_utc": 1719325686.0,
      "score": 65,
      "context": []
    },
    {
      "id": "la88abv",
      "author": "Ok-Bug-3449",
      "body": "I’m not this type of person ever but you should go to her supervisor and tell them what she said to you. I’m never out to get anyone in trouble or fired but saying this to someone is beyond unprofessional. You’re seeking help for your mental health from a therapist. I know for me in my weak moments if someone had said that to me I could’ve done something awful to myself after hearing that. You’re not disgusting. She is.",
      "created_utc": 1719333532.0,
      "score": 23,
      "context": []
    },
    {
      "id": "la8ibre",
      "author": "plastic_candi",
      "body": "get that hoe FIRED",
      "created_utc": 1719336832.0,
      "score": 22,
      "context": []
    },
    {
      "id": "la7rjyp",
      "author": "I_amWEIRDandODD",
      "body": "That is an awful therapist. That’s what I have to say on the matter. Telling someone about looking gross doesn’t help them. AT ALL.",
      "created_utc": 1719327932.0,
      "score": 30,
      "context": []
    },
    {
      "id": "la8cdeb",
      "author": "Quirky_Top_8990",
      "body": "She sounds like an awful therapist. That’s such an unhelpful thing to say and for some people with AN, that sort of comment could inversely act as a compliment as some people want to appear sick. I’m so sorry she said that to you.",
      "created_utc": 1719334874.0,
      "score": 11,
      "context": []
    },
    {
      "id": "la8ycxb",
      "author": "FistsOfFury77",
      "body": "Get a new therapist!  Seriously. A good therapist wouldn’t make such a comment!  A good therapist would relay their concern by saying something like, “I can see that you’re really struggling,” or that “you are really in the thick of your eating disorder”. But “social commentary” is so unprofessional!",
      "created_utc": 1719342052.0,
      "score": 9,
      "context": []
    },
    {
      "id": "la8s56s",
      "author": "Kindly_Concentrate12",
      "body": "I'd definitely find someone else. But also, if you don't feel comfortable telling her in person, then maybe send her a message explaining why you're leaving. She should know what she said was wrong.",
      "created_utc": 1719340029.0,
      "score": 5,
      "context": []
    },
    {
      "id": "la94exv",
      "author": "GoddessEvangelista",
      "body": "Personally I'd report her and start looking for another, better suited therapist. Finding a good one is like any meaningful relationship, it takes trial and error.",
      "created_utc": 1719344060.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lac8bzy",
      "author": "None",
      "body": "My therapist never commented on my appearance (aside from hair or clothes etc) ONCE and that to me is a good therapist for eds- it fuels the ed either way and isn’t right",
      "created_utc": 1719394660.0,
      "score": 3,
      "context": []
    },
    {
      "id": "laa997p",
      "author": "BitterRequirement897",
      "body": "Even my most uneducated friends have the sense of what not to say to someone struggling. She may be one of those types that think they can ‘scare’ you or guilt you into change. She’s obviously not the right therapist for you, I’m so sorry this happened! \n\nI hear people say it all the time ‘why do they (anorexics) do it, don’t they know it doesn’t look good?! It’s not attractive to be emaciated etc etc’.\n\nThese people are severely misinformed about the disease, they have no idea how complex it is and that it is hardly about appearance, that’s just the tip of the iceberg.",
      "created_utc": 1719358141.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lac3mbw",
      "author": "Consistent_Shower734",
      "body": "I would flat out cuss her out and say something 10x worse. It will help you feel better. Her heart is a p.o.s",
      "created_utc": 1719391232.0,
      "score": 3,
      "context": []
    },
    {
      "id": "laea3ij",
      "author": "tallaght71",
      "body": "Run don’t walk. Get a new therapist. Beyond unprofessional and actually damaging to you when you are seeking help.  This person is a trained professional…. They either don’t know how to do the job or they are just plain psycho. Leave and at some point let them know that their behaviour is the reason why. You deserve better",
      "created_utc": 1719424418.0,
      "score": 3,
      "context": []
    },
    {
      "id": "laebpat",
      "author": "StaringBlnklyAtMyNVL",
      "body": "I hope you told her she's a bitch. And then you find a new therapist.",
      "created_utc": 1719424927.0,
      "score": 3,
      "context": []
    },
    {
      "id": "la96pzw",
      "author": "sadseabiscuit",
      "body": "My partner says that to me almost daily, and it just adds fuel to the fire. Nothing about being called that is helpful or motivating. Please seek out a new therapist, like everyone else is saying. That's appalling behavior and in no way professional or okay. I'm so sorry someone that you're supposed to be able to trust acted like that, you don't deserve to be treated that way. :(",
      "created_utc": 1719344814.0,
      "score": 2,
      "context": []
    },
    {
      "id": "la9lrt3",
      "author": "discrete_venting",
      "body": "Did she actually say the words, \"you're disgusting\"? Or are you interpreting something she said to mean that?",
      "created_utc": 1719349666.0,
      "score": 2,
      "context": []
    },
    {
      "id": "laano5u",
      "author": "Responsible_Poet3516",
      "body": "I am so sorry. What a rude lady. ",
      "created_utc": 1719363758.0,
      "score": 2,
      "context": []
    },
    {
      "id": "laat4hl",
      "author": "AwayPineapple8074",
      "body": "I'm a professional counselor. You should report to the respective supervisor or board. This is unprofessional and inappropriate",
      "created_utc": 1719366009.0,
      "score": 2,
      "context": []
    },
    {
      "id": "laayuhz",
      "author": "soymlksweetie",
      "body": "oh my god my therapist legit told me the same exact thing during my appt with her today and i wanted to just leave and go cry. i feel like especially as a therapist if you know someone is mentally struggling it’s best to just not make any comments on their appearance whatsoever like write it down in ur private notes and go",
      "created_utc": 1719368296.0,
      "score": 2,
      "context": []
    },
    {
      "id": "labavx0",
      "author": "gleek-4-ever",
      "body": "I am so sorry that she felt the need to address this like that, it is extremely unprofessional and foul, let alone how in appropriate. If you can, I’d suggest getting a new therapist, this is not how you want something this delicate and complicated addressed by the person that is supposed to help you through issues, etc.",
      "created_utc": 1719373509.0,
      "score": 2,
      "context": []
    },
    {
      "id": "labj4z2",
      "author": "None",
      "body": "I would absolutely report het",
      "created_utc": 1719377767.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lac34tk",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1719390876.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lac5r2k",
      "author": "blair_doll3",
      "body": "That’s so gross and inappropriate to say, but it’s probably true. Being skinny is so ugly, especially if you’re sick.",
      "created_utc": 1719392785.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ladk1po",
      "author": "cosmicflamexo",
      "body": "Please please drop the Cat Unto Next Tuesday. As a survivor of abusive therapists, a Broad In That Cognitive Headspace like her will absolutely make everything worse and mess you up for the rest of your life. Bad therapists aren't like some highschool bully. every move they make, remark they toss out, their body language, the insults they tell you is carefully calculated to change the way you think, often for the worse. They are the most vindictive, manipulative people you've ever met. Think about it this way... people are afraid of going to a dentist, but all they do is mess up your teeth. An abusive therapist can destroy your mind.",
      "created_utc": 1719415781.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lah6ho3",
      "author": "Time_Ad_6887",
      "body": "Report her!!!",
      "created_utc": 1719463149.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lajn8ka",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1719506525.0,
      "score": 2,
      "context": []
    },
    {
      "id": "laov11n",
      "author": "Few_Bell_8166",
      "body": "You should report her if u can, that's wildly inappropriate and cruel. She's meant to help u improve ur self confidence not worsen and degrade u when ur struggling. I hope ur okay and can get proper helpful care somewhere else",
      "created_utc": 1719587454.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lap02cf",
      "author": "Kattorimu",
      "body": "Absolutely inappropriate, but the way this would give me such an ego boost rip 😞",
      "created_utc": 1719589126.0,
      "score": 2,
      "context": []
    },
    {
      "id": "laqosw6",
      "author": "ItsGr3n",
      "body": "Especially your therapist? That's wild. Meanwhile my psych told me I am looking good after losing weight and asked what I've done, like girl I haven't had any food in a week but I'm not about to tell you that.",
      "created_utc": 1719609864.0,
      "score": 1,
      "context": []
    },
    {
      "id": "latc7vn",
      "author": "ScottishWidow64",
      "body": "Actually, I would report her. Unfortunately though unless your session is taped, there is no evidence. However, she might have written some very inappropriate notes on your file. People with AN have at some point perhaps experienced trauma, this is shocking and so detrimental to someone’s improvement. Hugs.",
      "created_utc": 1719658014.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lso0ppa",
      "author": "LeastPay0",
      "body": "It's her job to be honest with you. I'm sure she's not supposed to walk on eggshells for any of her patients. If you don't like the way she practices then seek therapy elsewhere. But on another note, don't be afraid of the truth for the truth is what will set you free. Learn to own who you are and the decisions you make for yourself. Take some responsibility for sitting in a therapists office.",
      "created_utc": 1729334784.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mms4ttw",
      "author": "Melodic_Economics964",
      "body": "That's so mean!! Not nice at all. It's just as cruel as calling overweight people disgusting.",
      "created_utc": 1744485957.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la7t80i",
      "author": "Excellent-World-476",
      "body": "Sometimes being blunt is necessary.",
      "created_utc": 1719328503.0,
      "score": -17,
      "context": []
    },
    {
      "id": "lafgebn",
      "author": "Bitter-Major-5595",
      "body": "Exactly!!!🤯",
      "created_utc": 1719438249.0,
      "score": 2,
      "context": [
        {
          "id": "la7wsro",
          "author": "quarantinemeplz",
          "body": "Time to get a new therapist. Her comment was completely inappropriate, cruel, & unprofessional. Those words should never come from any therapist. Ever. I’m sorry she said that to you.",
          "created_utc": 1719329708.0
        }
      ]
    },
    {
      "id": "la7m4tz",
      "author": "user8361572",
      "body": "it’s weird hating myself the way i look yet still having the urge to get worse in a sense, it confuses the hell out of me i have no idea what i want, and i think she does specialise in ed’s amongst a couple other things but honestly she’s so incredibly unprofessional- it makes me question how she’s even qualified in the first place, i always leave feeling 100x worse after i see her than before, thank you though for your response i appreciate it :)",
      "created_utc": 1719326061.0,
      "score": 21,
      "context": [
        {
          "id": "la7l30r",
          "author": "brownguyinthecorner",
          "body": "Y'know what's so ironic about our condition is that once we get what we think we wanted we actually hate it. Is your therapist specialising in ED's? Regardless of their specialities or lack thereof, that was a totally insensitive and rude thing to say. I'm sorry you had to hear that and deal with it. Some therapists should really be seeking different professions...",
          "created_utc": 1719325686.0
        }
      ]
    },
    {
      "id": "la8dybf",
      "author": "user8361572",
      "body": "i’ve thought about making a complaint but it doesn’t feel valid enough? despite the way it made me feel, i still feel as though i’d be in the wrong to say something about her and i don’t even know why, i think it could be guilt",
      "created_utc": 1719335399.0,
      "score": 4,
      "context": [
        {
          "id": "la88abv",
          "author": "Ok-Bug-3449",
          "body": "I’m not this type of person ever but you should go to her supervisor and tell them what she said to you. I’m never out to get anyone in trouble or fired but saying this to someone is beyond unprofessional. You’re seeking help for your mental health from a therapist. I know for me in my weak moments if someone had said that to me I could’ve done something awful to myself after hearing that. You’re not disgusting. She is.",
          "created_utc": 1719333532.0
        }
      ]
    },
    {
      "id": "la8ks6m",
      "author": "user8361572",
      "body": "the notification for this made me laugh so much people like you are just 🙏🙏",
      "created_utc": 1719337625.0,
      "score": 10,
      "context": [
        {
          "id": "la8ibre",
          "author": "plastic_candi",
          "body": "get that hoe FIRED",
          "created_utc": 1719336832.0
        }
      ]
    },
    {
      "id": "la8ei9w",
      "author": "user8361572",
      "body": "this was sort of exactly how i took it, it felt like being complimented because of wanting to look skinnier, yet so hurtful at the same time because of the realisation that’s how people around me probably view me and i can’t stand that",
      "created_utc": 1719335584.0,
      "score": 4,
      "context": [
        {
          "id": "la8cdeb",
          "author": "Quirky_Top_8990",
          "body": "She sounds like an awful therapist. That’s such an unhelpful thing to say and for some people with AN, that sort of comment could inversely act as a compliment as some people want to appear sick. I’m so sorry she said that to you.",
          "created_utc": 1719334874.0
        }
      ]
    },
    {
      "id": "la8v2bd",
      "author": "user8361572",
      "body": "this is a good idea i’m thinking of sending her some sort of message explaining- i’m worried though that she still won’t realise what she said was wrong, i feel like she has this mindset where everything she says is correct and only she knows what’s best, she’s just gonna think i’m being typically critical or something of the sort it’s so frustrating",
      "created_utc": 1719340984.0,
      "score": 3,
      "context": [
        {
          "id": "la8s56s",
          "author": "Kindly_Concentrate12",
          "body": "I'd definitely find someone else. But also, if you don't feel comfortable telling her in person, then maybe send her a message explaining why you're leaving. She should know what she said was wrong.",
          "created_utc": 1719340029.0
        }
      ]
    },
    {
      "id": "lakba6n",
      "author": "user8361572",
      "body": "completely agree with you- it’s so fucked up",
      "created_utc": 1719514300.0,
      "score": 1,
      "context": [
        {
          "id": "lac8bzy",
          "author": "None",
          "body": "My therapist never commented on my appearance (aside from hair or clothes etc) ONCE and that to me is a good therapist for eds- it fuels the ed either way and isn’t right",
          "created_utc": 1719394660.0
        }
      ]
    },
    {
      "id": "lakbk15",
      "author": "user8361572",
      "body": "someone mentioned this to me actually, he told me how her words were her way of trying to get me to eat, but it’s such a twisted way of going about it, especially coming from a qualified therapist it’s just stupid, and your completely right i can’t stand people who comment on things they don’t have some understanding of it just annoys the hell out of me",
      "created_utc": 1719514388.0,
      "score": 1,
      "context": [
        {
          "id": "laa997p",
          "author": "BitterRequirement897",
          "body": "Even my most uneducated friends have the sense of what not to say to someone struggling. She may be one of those types that think they can ‘scare’ you or guilt you into change. She’s obviously not the right therapist for you, I’m so sorry this happened! \n\nI hear people say it all the time ‘why do they (anorexics) do it, don’t they know it doesn’t look good?! It’s not attractive to be emaciated etc etc’.\n\nThese people are severely misinformed about the disease, they have no idea how complex it is and that it is hardly about appearance, that’s just the tip of the iceberg.",
          "created_utc": 1719358141.0
        }
      ]
    },
    {
      "id": "lakbo11",
      "author": "user8361572",
      "body": "i reacted so slow in the moment i barely processed it until after i left, i wish i did do this and just walked out honestly",
      "created_utc": 1719514424.0,
      "score": 2,
      "context": [
        {
          "id": "lac3mbw",
          "author": "Consistent_Shower734",
          "body": "I would flat out cuss her out and say something 10x worse. It will help you feel better. Her heart is a p.o.s",
          "created_utc": 1719391232.0
        }
      ]
    },
    {
      "id": "lakbw7q",
      "author": "user8361572",
      "body": "wishing with literally everything that i told her that honestly",
      "created_utc": 1719514500.0,
      "score": 1,
      "context": [
        {
          "id": "laebpat",
          "author": "StaringBlnklyAtMyNVL",
          "body": "I hope you told her she's a bitch. And then you find a new therapist.",
          "created_utc": 1719424927.0
        }
      ]
    },
    {
      "id": "la9mfnl",
      "author": "discrete_venting",
      "body": ".... get a new partner?",
      "created_utc": 1719349887.0,
      "score": 2,
      "context": [
        {
          "id": "la96pzw",
          "author": "sadseabiscuit",
          "body": "My partner says that to me almost daily, and it just adds fuel to the fire. Nothing about being called that is helpful or motivating. Please seek out a new therapist, like everyone else is saying. That's appalling behavior and in no way professional or okay. I'm so sorry someone that you're supposed to be able to trust acted like that, you don't deserve to be treated that way. :(",
          "created_utc": 1719344814.0
        }
      ]
    },
    {
      "id": "la9nbpg",
      "author": "user8361572",
      "body": "i appreciate your kind words thank you it means a lot! :) i do plan to start looking for a new therapist it’ll definitely be for the best, regarding your partner though i could say the same to you- that’s not right for them to say to you at all and i really hope your okay because that sounds like it could honestly be a damaging relationship",
      "created_utc": 1719350186.0,
      "score": 2,
      "context": [
        {
          "id": "la96pzw",
          "author": "sadseabiscuit",
          "body": "My partner says that to me almost daily, and it just adds fuel to the fire. Nothing about being called that is helpful or motivating. Please seek out a new therapist, like everyone else is saying. That's appalling behavior and in no way professional or okay. I'm so sorry someone that you're supposed to be able to trust acted like that, you don't deserve to be treated that way. :(",
          "created_utc": 1719344814.0
        }
      ]
    },
    {
      "id": "la9nwmg",
      "author": "user8361572",
      "body": "the conversation went something like, her making a comment that she can tell herself i’ve lost weight, that made me happy to hear; you could tell by my expression, and i was making comments like ‘so you think i look skinny’- then she told me it looks disgusting and she had this somewhat revolted expression on her face",
      "created_utc": 1719350383.0,
      "score": 1,
      "context": [
        {
          "id": "la9lrt3",
          "author": "discrete_venting",
          "body": "Did she actually say the words, \"you're disgusting\"? Or are you interpreting something she said to mean that?",
          "created_utc": 1719349666.0
        }
      ]
    },
    {
      "id": "lake4ju",
      "author": "user8361572",
      "body": "no i completely agree with you, but are you okay?? it’s such a horrible thing to hear i’m here if you wanna talk just message me :)",
      "created_utc": 1719515223.0,
      "score": 1,
      "context": [
        {
          "id": "laayuhz",
          "author": "soymlksweetie",
          "body": "oh my god my therapist legit told me the same exact thing during my appt with her today and i wanted to just leave and go cry. i feel like especially as a therapist if you know someone is mentally struggling it’s best to just not make any comments on their appearance whatsoever like write it down in ur private notes and go",
          "created_utc": 1719368296.0
        }
      ]
    },
    {
      "id": "lakec5h",
      "author": "user8361572",
      "body": "i appreciate you saying this a lot thank you:) and i completely agree she is incredibly unprofessional and it pisses me off so much, and i am currently looking for a new therapist thankfully",
      "created_utc": 1719515293.0,
      "score": 1,
      "context": [
        {
          "id": "labavx0",
          "author": "gleek-4-ever",
          "body": "I am so sorry that she felt the need to address this like that, it is extremely unprofessional and foul, let alone how in appropriate. If you can, I’d suggest getting a new therapist, this is not how you want something this delicate and complicated addressed by the person that is supposed to help you through issues, etc.",
          "created_utc": 1719373509.0
        }
      ]
    },
    {
      "id": "lakedhp",
      "author": "user8361572",
      "body": "WORKING ON IT!!",
      "created_utc": 1719515306.0,
      "score": 1,
      "context": [
        {
          "id": "lac34tk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1719390876.0
        }
      ]
    },
    {
      "id": "lakeooh",
      "author": "user8361572",
      "body": "yeah i feel like this is a truth a lot of people don’t like to admit, somehow it never feels like i can look skinny enough in the mirror despite any of the horrible comments people make",
      "created_utc": 1719515406.0,
      "score": 1,
      "context": [
        {
          "id": "lac5r2k",
          "author": "blair_doll3",
          "body": "That’s so gross and inappropriate to say, but it’s probably true. Being skinny is so ugly, especially if you’re sick.",
          "created_utc": 1719392785.0
        }
      ]
    },
    {
      "id": "lakfbk2",
      "author": "user8361572",
      "body": "this is really well written wow, you dont hear people speak about therapists in this sense a lot but i do agree with you, i feel as though overtime the mental damage they can inflict is insane, and you don’t even start to realise it until it’s somewhat too late and your walking out everyday feeling worse than when you came in",
      "created_utc": 1719515614.0,
      "score": 1,
      "context": [
        {
          "id": "ladk1po",
          "author": "cosmicflamexo",
          "body": "Please please drop the Cat Unto Next Tuesday. As a survivor of abusive therapists, a Broad In That Cognitive Headspace like her will absolutely make everything worse and mess you up for the rest of your life. Bad therapists aren't like some highschool bully. every move they make, remark they toss out, their body language, the insults they tell you is carefully calculated to change the way you think, often for the worse. They are the most vindictive, manipulative people you've ever met. Think about it this way... people are afraid of going to a dentist, but all they do is mess up your teeth. An abusive therapist can destroy your mind.",
          "created_utc": 1719415781.0
        }
      ]
    },
    {
      "id": "lakfe9f",
      "author": "user8361572",
      "body": "i’ll definitely keep this in mind, i appreciate it thank you! :)",
      "created_utc": 1719515638.0,
      "score": 1,
      "context": [
        {
          "id": "lajn8ka",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1719506525.0
        }
      ]
    },
    {
      "id": "lap0rqz",
      "author": "user8361572",
      "body": "your so real for that- it’s damaging as hell to hear but it admittedly does make you feel a lil good in the worst way",
      "created_utc": 1719589359.0,
      "score": 1,
      "context": [
        {
          "id": "lap02cf",
          "author": "Kattorimu",
          "body": "Absolutely inappropriate, but the way this would give me such an ego boost rip 😞",
          "created_utc": 1719589126.0
        }
      ]
    },
    {
      "id": "la7wakw",
      "author": "Suspicious_Force_890",
      "body": "there’s being blunt and there’s being cruel",
      "created_utc": 1719329535.0,
      "score": 20,
      "context": [
        {
          "id": "la7t80i",
          "author": "Excellent-World-476",
          "body": "Sometimes being blunt is necessary.",
          "created_utc": 1719328503.0
        }
      ]
    },
    {
      "id": "la7tya3",
      "author": "user8361572",
      "body": "you think there isn’t anything wrong with what she said?",
      "created_utc": 1719328750.0,
      "score": 8,
      "context": [
        {
          "id": "la7t80i",
          "author": "Excellent-World-476",
          "body": "Sometimes being blunt is necessary.",
          "created_utc": 1719328503.0
        }
      ]
    },
    {
      "id": "la8xz30",
      "author": "Cautious_Bandicoot_4",
      "body": "Therapists shouldn’t comment on your body, good or bad. When you’re seeing a person with an ED this is even more important. If she wanted to give a reality check she could have talked about OPs behaviors or health. Saying “you look disgusting” is not only completely unprofessional and rude, but someone with AN will probably take it as a compliment/validation on some level. Any therapist who understands EDs at all should know this.",
      "created_utc": 1719341929.0,
      "score": 5,
      "context": [
        {
          "id": "la7t80i",
          "author": "Excellent-World-476",
          "body": "Sometimes being blunt is necessary.",
          "created_utc": 1719328503.0
        }
      ]
    },
    {
      "id": "la882tz",
      "author": "Ok-Internet-8003",
      "body": "I really relate to this. I look awful and I hate it but I also want to see how bad it can get…\n\nYour therapist sounds awful though! I can only guess that she’s worried about you and is trying to alert you to how bad things are? But that’s a terrible way to do it! Have you found her to be a good therapist apart from this?",
      "created_utc": 1719333463.0,
      "score": 10,
      "context": [
        {
          "id": "la7l30r",
          "author": "brownguyinthecorner",
          "body": "Y'know what's so ironic about our condition is that once we get what we think we wanted we actually hate it. Is your therapist specialising in ED's? Regardless of their specialities or lack thereof, that was a totally insensitive and rude thing to say. I'm sorry you had to hear that and deal with it. Some therapists should really be seeking different professions...",
          "created_utc": 1719325686.0
        },
        {
          "id": "la7m4tz",
          "author": "user8361572",
          "body": "it’s weird hating myself the way i look yet still having the urge to get worse in a sense, it confuses the hell out of me i have no idea what i want, and i think she does specialise in ed’s amongst a couple other things but honestly she’s so incredibly unprofessional- it makes me question how she’s even qualified in the first place, i always leave feeling 100x worse after i see her than before, thank you though for your response i appreciate it :)",
          "created_utc": 1719326061.0
        }
      ]
    },
    {
      "id": "la8gru0",
      "author": "None",
      "body": "Making a complaint would be completely valid and justified. I fully agree with everything Bug said.\n\nAdditionally, if what she said doesn't amount to something *bad enough* to where she'd be punished for it, then she just won't be punished for it. That's why there's a complaints process! What she said is so awful I can't imagine there being no repercussions for her, but I thought I'd bring it up since you're concerned about validity -- if it wasn't a \"valid\" complaint (it totally is, though) and the therapist hadn't done something wrong, then nothing would happen (to either you or her). Either way you've done nothing wrong in reporting it!",
      "created_utc": 1719336325.0,
      "score": 15,
      "context": [
        {
          "id": "la88abv",
          "author": "Ok-Bug-3449",
          "body": "I’m not this type of person ever but you should go to her supervisor and tell them what she said to you. I’m never out to get anyone in trouble or fired but saying this to someone is beyond unprofessional. You’re seeking help for your mental health from a therapist. I know for me in my weak moments if someone had said that to me I could’ve done something awful to myself after hearing that. You’re not disgusting. She is.",
          "created_utc": 1719333532.0
        },
        {
          "id": "la8dybf",
          "author": "user8361572",
          "body": "i’ve thought about making a complaint but it doesn’t feel valid enough? despite the way it made me feel, i still feel as though i’d be in the wrong to say something about her and i don’t even know why, i think it could be guilt",
          "created_utc": 1719335399.0
        }
      ]
    },
    {
      "id": "la8erzt",
      "author": "Ok-Bug-3449",
      "body": "You said should ask yourself why it doesn’t feel valid enough. If this were another person and you heard about this happening, what would you tell them to do? Why do you feel differently about it with regards to yourself? I hope you at the very least switch therapists if you decide not to tell a supervisor",
      "created_utc": 1719335672.0,
      "score": 10,
      "context": [
        {
          "id": "la88abv",
          "author": "Ok-Bug-3449",
          "body": "I’m not this type of person ever but you should go to her supervisor and tell them what she said to you. I’m never out to get anyone in trouble or fired but saying this to someone is beyond unprofessional. You’re seeking help for your mental health from a therapist. I know for me in my weak moments if someone had said that to me I could’ve done something awful to myself after hearing that. You’re not disgusting. She is.",
          "created_utc": 1719333532.0
        },
        {
          "id": "la8dybf",
          "author": "user8361572",
          "body": "i’ve thought about making a complaint but it doesn’t feel valid enough? despite the way it made me feel, i still feel as though i’d be in the wrong to say something about her and i don’t even know why, i think it could be guilt",
          "created_utc": 1719335399.0
        }
      ]
    },
    {
      "id": "layk0ll",
      "author": "National_Process7365",
      "body": "Oh it’s valid enough! What she said is abusive. There is no therapeutic value to how she handled that. ED is complex- what u have to unpack has nothing to do with your appearance - she needs an evaluation and you need a new therapist. ",
      "created_utc": 1719743108.0,
      "score": 2,
      "context": [
        {
          "id": "la88abv",
          "author": "Ok-Bug-3449",
          "body": "I’m not this type of person ever but you should go to her supervisor and tell them what she said to you. I’m never out to get anyone in trouble or fired but saying this to someone is beyond unprofessional. You’re seeking help for your mental health from a therapist. I know for me in my weak moments if someone had said that to me I could’ve done something awful to myself after hearing that. You’re not disgusting. She is.",
          "created_utc": 1719333532.0
        },
        {
          "id": "la8dybf",
          "author": "user8361572",
          "body": "i’ve thought about making a complaint but it doesn’t feel valid enough? despite the way it made me feel, i still feel as though i’d be in the wrong to say something about her and i don’t even know why, i think it could be guilt",
          "created_utc": 1719335399.0
        }
      ]
    },
    {
      "id": "la8xl00",
      "author": "Kindly_Concentrate12",
      "body": "That's understandable. I think the point of the message is more for you than her. A year from now, you can look back and say that you did the right thing. Her response doesn't matter, you could even block her after you send it so her response doesn't trigger you.",
      "created_utc": 1719341804.0,
      "score": 2,
      "context": [
        {
          "id": "la8s56s",
          "author": "Kindly_Concentrate12",
          "body": "I'd definitely find someone else. But also, if you don't feel comfortable telling her in person, then maybe send her a message explaining why you're leaving. She should know what she said was wrong.",
          "created_utc": 1719340029.0
        },
        {
          "id": "la8v2bd",
          "author": "user8361572",
          "body": "this is a good idea i’m thinking of sending her some sort of message explaining- i’m worried though that she still won’t realise what she said was wrong, i feel like she has this mindset where everything she says is correct and only she knows what’s best, she’s just gonna think i’m being typically critical or something of the sort it’s so frustrating",
          "created_utc": 1719340984.0
        }
      ]
    },
    {
      "id": "lachla9",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1719400416.0,
      "score": 2,
      "context": [
        {
          "id": "la8s56s",
          "author": "Kindly_Concentrate12",
          "body": "I'd definitely find someone else. But also, if you don't feel comfortable telling her in person, then maybe send her a message explaining why you're leaving. She should know what she said was wrong.",
          "created_utc": 1719340029.0
        },
        {
          "id": "la8v2bd",
          "author": "user8361572",
          "body": "this is a good idea i’m thinking of sending her some sort of message explaining- i’m worried though that she still won’t realise what she said was wrong, i feel like she has this mindset where everything she says is correct and only she knows what’s best, she’s just gonna think i’m being typically critical or something of the sort it’s so frustrating",
          "created_utc": 1719340984.0
        }
      ]
    },
    {
      "id": "la9mrl9",
      "author": "sadseabiscuit",
      "body": "We're married, so it's more complicated",
      "created_utc": 1719349997.0,
      "score": 2,
      "context": [
        {
          "id": "la96pzw",
          "author": "sadseabiscuit",
          "body": "My partner says that to me almost daily, and it just adds fuel to the fire. Nothing about being called that is helpful or motivating. Please seek out a new therapist, like everyone else is saying. That's appalling behavior and in no way professional or okay. I'm so sorry someone that you're supposed to be able to trust acted like that, you don't deserve to be treated that way. :(",
          "created_utc": 1719344814.0
        },
        {
          "id": "la9mfnl",
          "author": "discrete_venting",
          "body": ".... get a new partner?",
          "created_utc": 1719349887.0
        }
      ]
    },
    {
      "id": "la9to9z",
      "author": "discrete_venting",
      "body": "Oh wow.",
      "created_utc": 1719352385.0,
      "score": 1,
      "context": [
        {
          "id": "la9lrt3",
          "author": "discrete_venting",
          "body": "Did she actually say the words, \"you're disgusting\"? Or are you interpreting something she said to mean that?",
          "created_utc": 1719349666.0
        },
        {
          "id": "la9nwmg",
          "author": "user8361572",
          "body": "the conversation went something like, her making a comment that she can tell herself i’ve lost weight, that made me happy to hear; you could tell by my expression, and i was making comments like ‘so you think i look skinny’- then she told me it looks disgusting and she had this somewhat revolted expression on her face",
          "created_utc": 1719350383.0
        }
      ]
    },
    {
      "id": "la7u9cn",
      "author": "Excellent-World-476",
      "body": "I’d have to hear it in context to really know. I appreciate the word is questionable but I’ve also heard similar statements that were more about reality checks. I’m not weighing in on appropriateness since I wasn’t there.",
      "created_utc": 1719328852.0,
      "score": -10,
      "context": [
        {
          "id": "la7t80i",
          "author": "Excellent-World-476",
          "body": "Sometimes being blunt is necessary.",
          "created_utc": 1719328503.0
        },
        {
          "id": "la7tya3",
          "author": "user8361572",
          "body": "you think there isn’t anything wrong with what she said?",
          "created_utc": 1719328750.0
        }
      ]
    },
    {
      "id": "la8djvt",
      "author": "user8361572",
      "body": "it’s difficult to explain but i see her more like a friend than a therapist, it’s never felt like an actual therapy session when i talk to her she’s so unhelpful- thank you for your response though :) it feels nice to be understood but at the same time i’m sorry to hear your in the same boat, it’s such a dangerous route trying to become the worst you can, yet it feels so much easier than just trying to get better",
      "created_utc": 1719335266.0,
      "score": 9,
      "context": [
        {
          "id": "la7l30r",
          "author": "brownguyinthecorner",
          "body": "Y'know what's so ironic about our condition is that once we get what we think we wanted we actually hate it. Is your therapist specialising in ED's? Regardless of their specialities or lack thereof, that was a totally insensitive and rude thing to say. I'm sorry you had to hear that and deal with it. Some therapists should really be seeking different professions...",
          "created_utc": 1719325686.0
        },
        {
          "id": "la7m4tz",
          "author": "user8361572",
          "body": "it’s weird hating myself the way i look yet still having the urge to get worse in a sense, it confuses the hell out of me i have no idea what i want, and i think she does specialise in ed’s amongst a couple other things but honestly she’s so incredibly unprofessional- it makes me question how she’s even qualified in the first place, i always leave feeling 100x worse after i see her than before, thank you though for your response i appreciate it :)",
          "created_utc": 1719326061.0
        },
        {
          "id": "la882tz",
          "author": "Ok-Internet-8003",
          "body": "I really relate to this. I look awful and I hate it but I also want to see how bad it can get…\n\nYour therapist sounds awful though! I can only guess that she’s worried about you and is trying to alert you to how bad things are? But that’s a terrible way to do it! Have you found her to be a good therapist apart from this?",
          "created_utc": 1719333463.0
        }
      ]
    },
    {
      "id": "la8kn1k",
      "author": "user8361572",
      "body": "this does help put things into perspective tbh you make a good point, i appreciate it thank you :) i’m thinking of making a complaint tomorrow and seeing what happens from there, although i’m worried shes gonna try and twist what she said or just straight up deny ever saying it",
      "created_utc": 1719337577.0,
      "score": 7,
      "context": [
        {
          "id": "la88abv",
          "author": "Ok-Bug-3449",
          "body": "I’m not this type of person ever but you should go to her supervisor and tell them what she said to you. I’m never out to get anyone in trouble or fired but saying this to someone is beyond unprofessional. You’re seeking help for your mental health from a therapist. I know for me in my weak moments if someone had said that to me I could’ve done something awful to myself after hearing that. You’re not disgusting. She is.",
          "created_utc": 1719333532.0
        },
        {
          "id": "la8dybf",
          "author": "user8361572",
          "body": "i’ve thought about making a complaint but it doesn’t feel valid enough? despite the way it made me feel, i still feel as though i’d be in the wrong to say something about her and i don’t even know why, i think it could be guilt",
          "created_utc": 1719335399.0
        },
        {
          "id": "la8gru0",
          "author": "None",
          "body": "Making a complaint would be completely valid and justified. I fully agree with everything Bug said.\n\nAdditionally, if what she said doesn't amount to something *bad enough* to where she'd be punished for it, then she just won't be punished for it. That's why there's a complaints process! What she said is so awful I can't imagine there being no repercussions for her, but I thought I'd bring it up since you're concerned about validity -- if it wasn't a \"valid\" complaint (it totally is, though) and the therapist hadn't done something wrong, then nothing would happen (to either you or her). Either way you've done nothing wrong in reporting it!",
          "created_utc": 1719336325.0
        }
      ]
    },
    {
      "id": "la8k7bs",
      "author": "user8361572",
      "body": "i honestly couldn’t give an answer to that i genuinely don’t know why, i wouldn’t say i have an extremely low self esteem but if this did happen to someone else i’d 100% give the advice you gave me, but because it’s me it feels like almost as though she had a right to say that and it’s okay, i have no clue why i think this way though- i definitely will switch therapists at the least though",
      "created_utc": 1719337435.0,
      "score": 5,
      "context": [
        {
          "id": "la88abv",
          "author": "Ok-Bug-3449",
          "body": "I’m not this type of person ever but you should go to her supervisor and tell them what she said to you. I’m never out to get anyone in trouble or fired but saying this to someone is beyond unprofessional. You’re seeking help for your mental health from a therapist. I know for me in my weak moments if someone had said that to me I could’ve done something awful to myself after hearing that. You’re not disgusting. She is.",
          "created_utc": 1719333532.0
        },
        {
          "id": "la8dybf",
          "author": "user8361572",
          "body": "i’ve thought about making a complaint but it doesn’t feel valid enough? despite the way it made me feel, i still feel as though i’d be in the wrong to say something about her and i don’t even know why, i think it could be guilt",
          "created_utc": 1719335399.0
        },
        {
          "id": "la8erzt",
          "author": "Ok-Bug-3449",
          "body": "You said should ask yourself why it doesn’t feel valid enough. If this were another person and you heard about this happening, what would you tell them to do? Why do you feel differently about it with regards to yourself? I hope you at the very least switch therapists if you decide not to tell a supervisor",
          "created_utc": 1719335672.0
        }
      ]
    },
    {
      "id": "lakb7ry",
      "author": "user8361572",
      "body": "this was honestly very well written to read, i appreciate you replying and i’ll definitely take your advice into account, but it’s concerning what you mention towards the end- are you okay?? i know you think what your doing rn is having some sort of impact in terms of showcasing damage that’s been done but i’ll be so honest, the only person your truly affecting the most is yourself in the most negative way possible and that’s not how you want to spend 2+ years of your life, and i can gurantee it’s not at all worth ending your life over, i understand that you think this is a method and essentially your only option to process your trauma and whats happened, but that feels so small minded i’m certain there has to be other things you can do, and i hope your okay",
      "created_utc": 1719514279.0,
      "score": 1,
      "context": [
        {
          "id": "la8s56s",
          "author": "Kindly_Concentrate12",
          "body": "I'd definitely find someone else. But also, if you don't feel comfortable telling her in person, then maybe send her a message explaining why you're leaving. She should know what she said was wrong.",
          "created_utc": 1719340029.0
        },
        {
          "id": "la8v2bd",
          "author": "user8361572",
          "body": "this is a good idea i’m thinking of sending her some sort of message explaining- i’m worried though that she still won’t realise what she said was wrong, i feel like she has this mindset where everything she says is correct and only she knows what’s best, she’s just gonna think i’m being typically critical or something of the sort it’s so frustrating",
          "created_utc": 1719340984.0
        },
        {
          "id": "lachla9",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1719400416.0
        }
      ]
    },
    {
      "id": "la9tcgt",
      "author": "discrete_venting",
      "body": "Oh :( I'm sorry",
      "created_utc": 1719352269.0,
      "score": 2,
      "context": [
        {
          "id": "la96pzw",
          "author": "sadseabiscuit",
          "body": "My partner says that to me almost daily, and it just adds fuel to the fire. Nothing about being called that is helpful or motivating. Please seek out a new therapist, like everyone else is saying. That's appalling behavior and in no way professional or okay. I'm so sorry someone that you're supposed to be able to trust acted like that, you don't deserve to be treated that way. :(",
          "created_utc": 1719344814.0
        },
        {
          "id": "la9mfnl",
          "author": "discrete_venting",
          "body": ".... get a new partner?",
          "created_utc": 1719349887.0
        },
        {
          "id": "la9mrl9",
          "author": "sadseabiscuit",
          "body": "We're married, so it's more complicated",
          "created_utc": 1719349997.0
        }
      ]
    }
  ]
}