{
  "id": "1dxafqr",
  "subreddit": "AnorexiaNervosa",
  "author": "Queenofwands1212",
  "created_utc": 1720335510.0,
  "title": "Nobody gives a fuck until weight loss is involved ",
  "selftext": "It’s funny how no one in my life shows any concern. I have no friends in real life. I guess I have many acquaintances via social media, but none of that is real. Well I’ve been relapsing hard the last several months and I guess I’ve lost weight. I thought I maintained but I don’t know since I don’t weigh myself. No one in my physical reality shows any concern so it makes me feel like my Ed isn’t that bad. Then I post things on IG and all of a sudden I have two “friends” reach out to me with concern about my weight loss. No body gives a flying fuck about me, until weight loss is in the picture. That’s funny, because I remember when I was a healthy bmi, and my Ed was in such a horrible place, purging, over exercising, self harming, but no one cared then because I looked normal. my family all lives far away and they have no idea how sick I am. And no one around me seems to care either. Im severely depressed and going through some sort of depressive episode. Life seems pointless ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1dxafqr/nobody_gives_a_fuck_until_weight_loss_is_involved/",
  "score": 142,
  "num_comments": 20,
  "comments": [
    {
      "id": "lc0bkvp",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1720335510.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lc13awn",
      "author": "None",
      "body": "I mean sometimes it's hard to know the struggles somebody is going through unless you voice them directly.  When being severely underweight, a person will be able to see your pain very clearly and that's just the way it is sometimes.\n\nI understand your struggles somewhat and sometimes people just don't realize how bad you're feeling until it's staring them in the face.",
      "created_utc": 1720354382.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lc0q4mk",
      "author": "That_Agent1983",
      "body": "yep thats true. \n\nnobody cares if you are depressed: \"It's puperty.\" \"Maybe go for a walk\" \"Everyone is a little sad\".\n\nif you start loosing weight / lost lots of weight: \"I see that you are not doing well\". \"poor thing\" \"are you doing okay?\"\n\n  \nGIRLY I HAVE BEEN DOING BAD ALL THE TIME. I hate this people so much. Its true nobody takes you seriously if you arent uw or loosing rapidly. Even doctors. They tell you, they will but they don't. Thats how it works.",
      "created_utc": 1720345902.0,
      "score": 33,
      "context": []
    },
    {
      "id": "lc7b5kb",
      "author": "KeyTranslator420",
      "body": "I was recently hospitalized and was given little to no care for my mental health... only given a weight gain plan. Thank god im not staying with the stupid clinic",
      "created_utc": 1720451729.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lc6nx4o",
      "author": "NerdyGran",
      "body": "No one has any idea about me either. They comment frequently on how much weight Ive lost and how thin I am (I was overweight and now quite a bit under), but I brush them off and tbh I tell them I'm OK and at a healthy weight just at the very lower end of it. I'm not sure if they believe it as my daughter sort of sarcastically makes comments and says things. However, I'm certain no one has the slightest idea about me ED. They live closely, and when they are around for visits, which usually mean meals, I try not to restrict or mainly put safe foods on my plate to hide, so it's my fault. Even my husband doesn't call me out on it. He is also the only person who hasn't mentioned my weight loss once. It's isolating, to be sure, but I'm not sure I'm ready to face it yet and telling them I would be facing it. I think I want someone to notice to make me face it, like when I was an alcoholic 15 years ago, and my parents noticed and forced me to confront it when I wouldn't. Sorry, I didn't mean to hijack your post, but explain my situation to ask if that is in anyway how you feel? If so you are not alone",
      "created_utc": 1720443057.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lc1hwzk",
      "author": "hanls",
      "body": "My family have gotten so intense around me and my weight loss. But had none of this energy when I was involuntarily sectioned because of how badly my mental health had deteriorated. Then it was just expectations from when I would get out. When are you getting a job again?. (My sister had been unemployed for 6 months at that point). I quit my job after I got calls from clients in the ward being like where are you, because my workplace didn't tell them I was in hospital. \n\nStop taking the meds they are bad for you, so is unmedicated bipolar but my family refuses to learn/accept my diagnosis. It's just treated like a character flaw in me",
      "created_utc": 1720361161.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lc1kmf8",
      "author": "GoddessEvangelista",
      "body": "Tbh their concern might be selfish virtue signaling, they probably still don't gaf but they want to look like they do.  I know from experience! You'll find people who do but it might take some time, try not to let it make you bitter and pessimistic.",
      "created_utc": 1720362239.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lc1u4qi",
      "author": "lemonlovelimes",
      "body": "I promise you, this is not the truth. There are people who care, many just don’t know what or how to say it, and are worried about making things worse. People care about you, regardless of weight. This is just a trigger point where they are thinking “oh fuck, I need to check in on them” but still aren’t sure what to do, but they’re concerned enough that has outweighed the fear. If you said to a friend that you’re not doing well and need help, they could try and help you find a therapist, or a treatment center. \nI promise you, just because you can’t see it, doesn’t mean people are not concerned. Your ED brain is lying to you.",
      "created_utc": 1720365746.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lc3w4rs",
      "author": "Hallucin8in",
      "body": "I’ve just recently realized how much I’ve kept everything about myself a secret from my family. I expected them to read my mind, feelings and thoughts. And I wasn’t even aware of this. I just thought THEY KNEW. I would silently get angry and hold grudges cause I didn’t think anyone cared. I’m not going to lie and say it’s easy, the past year has been very anxiety provoking and uncomfortable but I have shared so much with my family and realized that they honestly never knew. It honestly hurt and still does occasionally to acknowledge they never saw my pain or struggle. It feels like a weights been lifted and my relationships are better. Everyday I think they must know everything about me now but constantly they are saying to me “I didn’t know that”. I feel like I’ve put so many expectations onto myself. I don’t know if this is helpful in anyway but hope maybe you can get something from it. Sorry if you read all of this and didn’t benefit from it. Wishing you the best!",
      "created_utc": 1720391960.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lcb9akt",
      "author": "NerdyGran",
      "body": "Meant to say, I also went to the doctor, and he weighed me and said my weight wasn't low enough to be a concern, even though there seems to be categories here for mildly, moderately and severely underweight and I am moderately atm and he didn't listen to me explaining my eating habits whatsoever so it sucks I can't access the help I need. It's luck of the draw when I call up to get an appointment as to which doctor I see, so I'm scared to call again in case of rejection as last time caused me to spiral",
      "created_utc": 1720504823.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lc0r8u0",
      "author": "Queenofwands1212",
      "body": "It’s honestly sickening me. The one “friend” who reached out I haven’t heard from in years. But now all of a sudden bc I’ve lost a lot of weight she is soOO concerned. Is it concern or is it jealousy? Or is she just curious? And what is her intention? How can she even help? She can’t. And she’s not a real friend. Until you are sick and deeply ill no one gives a fuck",
      "created_utc": 1720346717.0,
      "score": 15,
      "context": [
        {
          "id": "lc0q4mk",
          "author": "That_Agent1983",
          "body": "yep thats true. \n\nnobody cares if you are depressed: \"It's puperty.\" \"Maybe go for a walk\" \"Everyone is a little sad\".\n\nif you start loosing weight / lost lots of weight: \"I see that you are not doing well\". \"poor thing\" \"are you doing okay?\"\n\n  \nGIRLY I HAVE BEEN DOING BAD ALL THE TIME. I hate this people so much. Its true nobody takes you seriously if you arent uw or loosing rapidly. Even doctors. They tell you, they will but they don't. Thats how it works.",
          "created_utc": 1720345902.0
        }
      ]
    },
    {
      "id": "lca53b7",
      "author": "Queenofwands1212",
      "body": "That’s the problem with anorexia treatment. Same thing happened to me in 2005, I was very young but they porked me up and that was the goal. I left with aBSOLUTLEY no mental health tools, I was so uncomfortable, now I have truama when it comes to weight gain",
      "created_utc": 1720486437.0,
      "score": 3,
      "context": [
        {
          "id": "lc7b5kb",
          "author": "KeyTranslator420",
          "body": "I was recently hospitalized and was given little to no care for my mental health... only given a weight gain plan. Thank god im not staying with the stupid clinic",
          "created_utc": 1720451729.0
        }
      ]
    },
    {
      "id": "lc4laz0",
      "author": "Queenofwands1212",
      "body": "Yeah… I’m not feeling bitter but it almost reiinforces me just wanting to continue my anoreixa at this intensity because if I gain weight now, my body is on display and people are watching and if they see me gain weight I don’t want comments In that way either. If I god Forbid gained weight and someone said I “look better or healthy” I would lose my fuvking mind . So now I just feel like I want to keep this going",
      "created_utc": 1720401896.0,
      "score": 2,
      "context": [
        {
          "id": "lc1kmf8",
          "author": "GoddessEvangelista",
          "body": "Tbh their concern might be selfish virtue signaling, they probably still don't gaf but they want to look like they do.  I know from experience! You'll find people who do but it might take some time, try not to let it make you bitter and pessimistic.",
          "created_utc": 1720362239.0
        }
      ]
    },
    {
      "id": "lc40wc8",
      "author": "Queenofwands1212",
      "body": "That’s a good point. I can defiantly isolate , but I have actually told my mom that I am struggling with my Ed. I’ve even told her I have bulimia and puke my food. She chooses to hear what she wants to hear. She cares for me obviously but she has no idea how I am actually suffering and she doesn’t know how to help either. I think it just triggered me so much yesterday getting comments from these two old friends because it’s like neither of them get it. And a text from them concerned about my weight loss is far gone. It’s not helpful at this point",
      "created_utc": 1720393763.0,
      "score": 3,
      "context": [
        {
          "id": "lc3w4rs",
          "author": "Hallucin8in",
          "body": "I’ve just recently realized how much I’ve kept everything about myself a secret from my family. I expected them to read my mind, feelings and thoughts. And I wasn’t even aware of this. I just thought THEY KNEW. I would silently get angry and hold grudges cause I didn’t think anyone cared. I’m not going to lie and say it’s easy, the past year has been very anxiety provoking and uncomfortable but I have shared so much with my family and realized that they honestly never knew. It honestly hurt and still does occasionally to acknowledge they never saw my pain or struggle. It feels like a weights been lifted and my relationships are better. Everyday I think they must know everything about me now but constantly they are saying to me “I didn’t know that”. I feel like I’ve put so many expectations onto myself. I don’t know if this is helpful in anyway but hope maybe you can get something from it. Sorry if you read all of this and didn’t benefit from it. Wishing you the best!",
          "created_utc": 1720391960.0
        }
      ]
    },
    {
      "id": "lc4uuf8",
      "author": "med10cre_at_best",
      "body": "Oh my gosh, I can relate so hard... I grappled with severe BED/bulimia for many months and begged my parents to help me. They did nothing. My mom told me, \"Every other woman has struggled with food at some point. You're not special. You just have to learn to deal with it like the rest of us.\"\n\nSo, I put myself on a very restrictive meal plan because that's the only way I knew how to stop. After I started rapidly losing weight, suddenly, my mom pretended to be all concerned, like, \"If you don't gain weight, I'm going to force you into residential!\" Absolutely kills me. I swear she just doesn't want me to be skinny 😒",
      "created_utc": 1720405864.0,
      "score": 4,
      "context": [
        {
          "id": "lc0q4mk",
          "author": "That_Agent1983",
          "body": "yep thats true. \n\nnobody cares if you are depressed: \"It's puperty.\" \"Maybe go for a walk\" \"Everyone is a little sad\".\n\nif you start loosing weight / lost lots of weight: \"I see that you are not doing well\". \"poor thing\" \"are you doing okay?\"\n\n  \nGIRLY I HAVE BEEN DOING BAD ALL THE TIME. I hate this people so much. Its true nobody takes you seriously if you arent uw or loosing rapidly. Even doctors. They tell you, they will but they don't. Thats how it works.",
          "created_utc": 1720345902.0
        },
        {
          "id": "lc0r8u0",
          "author": "Queenofwands1212",
          "body": "It’s honestly sickening me. The one “friend” who reached out I haven’t heard from in years. But now all of a sudden bc I’ve lost a lot of weight she is soOO concerned. Is it concern or is it jealousy? Or is she just curious? And what is her intention? How can she even help? She can’t. And she’s not a real friend. Until you are sick and deeply ill no one gives a fuck",
          "created_utc": 1720346717.0
        }
      ]
    },
    {
      "id": "lc2opdy",
      "author": "NefariousnessMost660",
      "body": "Everyone looks up to thin people no matter how unwilling they are to admit it. It's what we all want to be, even people who want fat acceptance.",
      "created_utc": 1720376497.0,
      "score": 4,
      "context": [
        {
          "id": "lc0q4mk",
          "author": "That_Agent1983",
          "body": "yep thats true. \n\nnobody cares if you are depressed: \"It's puperty.\" \"Maybe go for a walk\" \"Everyone is a little sad\".\n\nif you start loosing weight / lost lots of weight: \"I see that you are not doing well\". \"poor thing\" \"are you doing okay?\"\n\n  \nGIRLY I HAVE BEEN DOING BAD ALL THE TIME. I hate this people so much. Its true nobody takes you seriously if you arent uw or loosing rapidly. Even doctors. They tell you, they will but they don't. Thats how it works.",
          "created_utc": 1720345902.0
        },
        {
          "id": "lc0r8u0",
          "author": "Queenofwands1212",
          "body": "It’s honestly sickening me. The one “friend” who reached out I haven’t heard from in years. But now all of a sudden bc I’ve lost a lot of weight she is soOO concerned. Is it concern or is it jealousy? Or is she just curious? And what is her intention? How can she even help? She can’t. And she’s not a real friend. Until you are sick and deeply ill no one gives a fuck",
          "created_utc": 1720346717.0
        }
      ]
    },
    {
      "id": "lcd8cwf",
      "author": "KeyTranslator420",
      "body": "I hadn't even gone in for anything related to anorexia, i came thru the ER!!! My parents and i weren't even aware of why they were keeping me until the second day it was such BS",
      "created_utc": 1720540393.0,
      "score": 3,
      "context": [
        {
          "id": "lc7b5kb",
          "author": "KeyTranslator420",
          "body": "I was recently hospitalized and was given little to no care for my mental health... only given a weight gain plan. Thank god im not staying with the stupid clinic",
          "created_utc": 1720451729.0
        },
        {
          "id": "lca53b7",
          "author": "Queenofwands1212",
          "body": "That’s the problem with anorexia treatment. Same thing happened to me in 2005, I was very young but they porked me up and that was the goal. I left with aBSOLUTLEY no mental health tools, I was so uncomfortable, now I have truama when it comes to weight gain",
          "created_utc": 1720486437.0
        }
      ]
    },
    {
      "id": "lc4p4vg",
      "author": "GoddessEvangelista",
      "body": "I totally understand that because I'd feel the same way. I mentioned this to someone else on here, when you notice it bothering you, look at it as height. Someone will always be taller and someone else shorter, and people talking about it is fucking stupid but they do, doesn't make one better than the other regardless of opinion. It helps a little bit personally or I spiral, it helps hold that feeling back a bit",
      "created_utc": 1720403469.0,
      "score": 3,
      "context": [
        {
          "id": "lc1kmf8",
          "author": "GoddessEvangelista",
          "body": "Tbh their concern might be selfish virtue signaling, they probably still don't gaf but they want to look like they do.  I know from experience! You'll find people who do but it might take some time, try not to let it make you bitter and pessimistic.",
          "created_utc": 1720362239.0
        },
        {
          "id": "lc4laz0",
          "author": "Queenofwands1212",
          "body": "Yeah… I’m not feeling bitter but it almost reiinforces me just wanting to continue my anoreixa at this intensity because if I gain weight now, my body is on display and people are watching and if they see me gain weight I don’t want comments In that way either. If I god Forbid gained weight and someone said I “look better or healthy” I would lose my fuvking mind . So now I just feel like I want to keep this going",
          "created_utc": 1720401896.0
        }
      ]
    },
    {
      "id": "lc4zo4s",
      "author": "Queenofwands1212",
      "body": "Ugh… there’s a lot there . A lot of trauma and a lot that would need to be worked on in therapy.",
      "created_utc": 1720407948.0,
      "score": 2,
      "context": [
        {
          "id": "lc0q4mk",
          "author": "That_Agent1983",
          "body": "yep thats true. \n\nnobody cares if you are depressed: \"It's puperty.\" \"Maybe go for a walk\" \"Everyone is a little sad\".\n\nif you start loosing weight / lost lots of weight: \"I see that you are not doing well\". \"poor thing\" \"are you doing okay?\"\n\n  \nGIRLY I HAVE BEEN DOING BAD ALL THE TIME. I hate this people so much. Its true nobody takes you seriously if you arent uw or loosing rapidly. Even doctors. They tell you, they will but they don't. Thats how it works.",
          "created_utc": 1720345902.0
        },
        {
          "id": "lc0r8u0",
          "author": "Queenofwands1212",
          "body": "It’s honestly sickening me. The one “friend” who reached out I haven’t heard from in years. But now all of a sudden bc I’ve lost a lot of weight she is soOO concerned. Is it concern or is it jealousy? Or is she just curious? And what is her intention? How can she even help? She can’t. And she’s not a real friend. Until you are sick and deeply ill no one gives a fuck",
          "created_utc": 1720346717.0
        },
        {
          "id": "lc4uuf8",
          "author": "med10cre_at_best",
          "body": "Oh my gosh, I can relate so hard... I grappled with severe BED/bulimia for many months and begged my parents to help me. They did nothing. My mom told me, \"Every other woman has struggled with food at some point. You're not special. You just have to learn to deal with it like the rest of us.\"\n\nSo, I put myself on a very restrictive meal plan because that's the only way I knew how to stop. After I started rapidly losing weight, suddenly, my mom pretended to be all concerned, like, \"If you don't gain weight, I'm going to force you into residential!\" Absolutely kills me. I swear she just doesn't want me to be skinny 😒",
          "created_utc": 1720405864.0
        }
      ]
    },
    {
      "id": "lc4plb8",
      "author": "Queenofwands1212",
      "body": "Yeah… I am just so easily triggered when it comes to body comments. I used to be in a larger ish body. And I never ever ever want to go back there. I’m happy being underweight and anorexic compared to how I felt back then. So if someone were to comment on my body if I gain a few lbs, game over. I would have a fuckkng nervous breakdown",
      "created_utc": 1720403662.0,
      "score": 1,
      "context": [
        {
          "id": "lc1kmf8",
          "author": "GoddessEvangelista",
          "body": "Tbh their concern might be selfish virtue signaling, they probably still don't gaf but they want to look like they do.  I know from experience! You'll find people who do but it might take some time, try not to let it make you bitter and pessimistic.",
          "created_utc": 1720362239.0
        },
        {
          "id": "lc4laz0",
          "author": "Queenofwands1212",
          "body": "Yeah… I’m not feeling bitter but it almost reiinforces me just wanting to continue my anoreixa at this intensity because if I gain weight now, my body is on display and people are watching and if they see me gain weight I don’t want comments In that way either. If I god Forbid gained weight and someone said I “look better or healthy” I would lose my fuvking mind . So now I just feel like I want to keep this going",
          "created_utc": 1720401896.0
        },
        {
          "id": "lc4p4vg",
          "author": "GoddessEvangelista",
          "body": "I totally understand that because I'd feel the same way. I mentioned this to someone else on here, when you notice it bothering you, look at it as height. Someone will always be taller and someone else shorter, and people talking about it is fucking stupid but they do, doesn't make one better than the other regardless of opinion. It helps a little bit personally or I spiral, it helps hold that feeling back a bit",
          "created_utc": 1720403469.0
        }
      ]
    }
  ]
}