{
  "id": "1e5vryg",
  "subreddit": "AnorexiaNervosa",
  "author": "Total_Strawberry_280",
  "created_utc": 1721256365.0,
  "title": "My friend is getting euthanised tomorrow.",
  "selftext": "My friend (F26) and I (F28) have been friends for almost 15 years. We met on a proana site, but then began to support each other through recovery. I managed to come out the other side 'recovered' but she has been battling for over ten years now. She lives in Holland where Euthanasia is legal and I live in the UK. She has just rang me to say that she is going to be euthanised tomorrow and to say goodbye. I have so many mixed feelings, I want her to be able to have a choice and not to suffer anymore, but I don't know what else to do or say. I feel like I want to talk to her all night but she is very tired and saving the last moments for her dad, but now I am just lying awake thinking about everything and replaying all our conversations in my head about what I could have said or done. I'm doing everything I can not to say please don't leave, but I think she has been classed as 'terminal' (if that can even be guaranteed?) I don't even know what question I am asking here, I just want to know what other people have been through and if it's similar, how did you get through it and is there anything I should ask, say or do before she leaves?\n\n**Edit for responses:** I just want to say thank you to everyone who has left comments. It's been comforting to know I was able to get to say everything I wanted while hearing from others. I may not have replied to all comments but I have read all of them and am truly grateful for everyone taking time out of their day to offer words of support. <3",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1e5vryg/my_friend_is_getting_euthanised_tomorrow/",
  "score": 549,
  "num_comments": 81,
  "comments": [
    {
      "id": "ldop2tu",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1721256366.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ldp22ju",
      "author": "Excellent-World-476",
      "body": "I have so many mixed feelings about the concept of terminal anorexia. I wish you and your friend some peace. It is a difficult thing.",
      "created_utc": 1721261182.0,
      "score": 382,
      "context": []
    },
    {
      "id": "ldoqixs",
      "author": "Talysha1921",
      "body": "I would make a promise to her that I would recover enough for the both of us.",
      "created_utc": 1721256886.0,
      "score": 445,
      "context": []
    },
    {
      "id": "ldp1heq",
      "author": "Kloana",
      "body": "I can only imagine how incredibly excruciating and confusing this situation is for you and all involved. And I wish I could give you a satisfying answer because.. well... I'm trying not to go down that path myself... even though the government is currently working on passing the euthanasia law in my country, so it could be a viable option in the future. It is truly scary think about but, ultimately, it seems she's finding her peace, and I think that's all anyone wants in our final moments. I'm so sorry, I would give you a hug now if I could :( 🙏",
      "created_utc": 1721260960.0,
      "score": 115,
      "context": []
    },
    {
      "id": "ldp56z9",
      "author": "MorgJo",
      "body": "I don't have any suggestions, I just want you to know you're cared for and I'm so sorry this is so hard",
      "created_utc": 1721262386.0,
      "score": 75,
      "context": []
    },
    {
      "id": "ldpi3tp",
      "author": "Responsible_Poet3516",
      "body": "what have we been through thats similar? Im sorry it’s probably not going to be comforting: \n\nI logged into Facebook one day in 2006 (no twitter yet) and found one of my good friends mom posting from her account (we didn’t keep them secret yet then) She was gone. And her mom wanted to comfort US!!!! \nIt’s been so long (and there have since been so many more) that I struggle to remember her name. And there’s a sick pit in my stomach that’s making my feel I won’t ever remember it. \n\nIf anyone needed a sign to try harder in recovery. Please let today be it. ",
      "created_utc": 1721267448.0,
      "score": 60,
      "context": []
    },
    {
      "id": "ldpt8ya",
      "author": "justcallmedrzoidberg",
      "body": "Holding space for you. We are here.",
      "created_utc": 1721272056.0,
      "score": 31,
      "context": []
    },
    {
      "id": "ldpc0nm",
      "author": "Beezywella",
      "body": "I can’t imagine hearing a suicide note spoken from the person writing it. I’m so sorry you’re going through this and my heart is broken for your friend. God is good but life is so hard. You can still be better every day. I can only imagine but I think people staring mortality in the face have a greater appreciation for honesty. If I were you I wouldn’t hold back at all. Tell her how much she means to you. Tell her you don’t want her to leave. Know you did all you could before she does. Praying for the both of you.",
      "created_utc": 1721265052.0,
      "score": 83,
      "context": []
    },
    {
      "id": "ldoywo8",
      "author": "None",
      "body": "I’m so sorry, that must be horrible. I think your mixed feelings are very understandable. I’m usually very pro all kinds of bodily autonomy. But as a recovered person, I think this is wrong. This isn’t compassion. I don’t believe in lost causes - unless someone is guaranteed to die anyway. When you’re sick, you need others to hold hope for you. I gave up on myself many times, but there were people who cared enough to make sure I was safe and be there for as long as it took for me to choose recovery. It sounds like there might not be much you can do, which sounds extremely stressful. This is devastating. Feel your emotions & look after yourself. Is there anyone you can talk to irl?",
      "created_utc": 1721259993.0,
      "score": 101,
      "context": []
    },
    {
      "id": "ldph2kh",
      "author": "Responsible_Poet3516",
      "body": "I am so sorry I can’t hug you through the phone. ",
      "created_utc": 1721267039.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ldosjaj",
      "author": "Meggy_bug",
      "body": "Yess, not a doc but I remember after 8+ years Anorexia may be classified as terminal\n\n it is very sad and scary, but that is good your friend won't have to suffer anymore, anorexia taught me, that sometimes in life you can go too far, and cannot return and fix that later, your friend's illness sadly drove her to that no return point.. she choosen to be free of all of suffering and it's okay,, she can have peace now\n\n wish you well :( <3 I know it is hard",
      "created_utc": 1721257624.0,
      "score": 58,
      "context": []
    },
    {
      "id": "ldqo6bd",
      "author": "Avocadorable_Guac",
      "body": "This was so heavy and hard to read. I can’t even imagine what you’re going through. All I am can say is I’m so sorry you’re in this situation and having to deal with this as the friend of someone suffering from the same disease",
      "created_utc": 1721289383.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ldqhpgu",
      "author": "Quirky_Top_8990",
      "body": "I don’t know what to say, I’m sending you both all my best. I’m so sorry.",
      "created_utc": 1721285088.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ldrr7oo",
      "author": "Training-Cry510",
      "body": "Ugh 😣 I hate this so much for both of you, and her dad. She’s got to be hurting physically, and mentally from this disease so badly. I wonder if they add these cases into the statistics where it shows it’s the deadliest mental illness. \n\nThe sadness, confusion, and anguish with this fucking disorder must be hitting you hard right now, and to respect her decision, and not beg her to stay I know couldn’t have been easy. I know how hard it was to lose my grandparents after they lived mostly healthy lives, for 8-9 decades and trying to bargain with god or whatever is out there to give me just one more year, one more month, one more day. Or my two aunts passing away in their 40s even though they were terribly sick with cancer, then my uncle last year in his 60s still I imagined got to live more than your best friend. It all just doesn’t seem fair.  Please don’t inadvertently relapse from the sadness. If you catch yourself slipping take care she will want you to. \n\nI want to say to you something like “maybe she’ll change her mind last minute” or have a revelation that she can find a way out. I don’t think that’s fair to you though, or realistic if her Drs signed off on it. I think if a Dr had any inkling that someone may change their mind they wouldn’t go through with it, and I imagine there’s a lengthy therapy process beforehand to make sure they really understand what they’re getting into. I can hope that for you, but I don’t think it’s something that realistically would happen. \n\nMaybe send her a text or email just one last “I love you forever “ my best friend and I before this or depression even became prevalent in our lives made a pact on how we’d let one another know we were lurking and haunting the other whoever goes first. It was a dark conversation, but at the same time we came up with out there shit nobody else would know besides the two of us so we both laughed and cried a lot that night. She’ll be with you. Idk if god is real but I don’t believe death is the end only because I’ve had some run ins that couldn’t be explained. \n\nI’ll be keeping you both, and her dad in my thoughts. 🫶🏻 you got a great community that is here for you. Please take care of yourself",
      "created_utc": 1721310284.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ldp2aex",
      "author": "No_Cartoonist_1441",
      "body": "I'm sorry your friend chose that method. It was very caring knowing she called you to let you know. Sometimes, being sick is not fun, and every day is a struggle.. I live in America and we don't have the choice,  which is not fair in my opinion.",
      "created_utc": 1721261266.0,
      "score": 45,
      "context": []
    },
    {
      "id": "ldq53dg",
      "author": "cluelessin",
      "body": "I'm so sorry",
      "created_utc": 1721277715.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ldrzf5o",
      "author": "Icy-Tumbleweed6234",
      "body": "I am so, so sorry. \n\nI am keeping all of you in my thoughts today. I hope she is at peace. \n\nPlease take care of yourself. Please be gentle with yourself. 🤟🏻🖤",
      "created_utc": 1721313185.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ldqppc6",
      "author": "Warrior-Skye",
      "body": "First of all, I would like to wish you a lot of strength in this difficult time.  Perhaps I can provide a little more explanation as I come from the Netherlands and follow the political discussions surrounding euthanasia.  In the Netherlands it is also possible to obtain euthanasia for psychologically unbearable suffering, without the prospect of improvement.  Just as with a physical condition that never gets better, this can also be requested in extreme cases with a psychological condition.  It only remains a discussion when it is 'unbearable suffering' and also when there is no longer any prospect of improvement.  The process to obtain euthanasia often takes at least 2 years and several doctors and psychiatrists must agree that the suffering is unbearable and hopeless before approval is given.  With only a diagnosis of AN, even after 10 years you will not receive euthanasia, then there is more to be done, so the situation is considered to be that recovery is no longer possible and life is unbearable.",
      "created_utc": 1721290421.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lds8n8q",
      "author": "thethrowaway094",
      "body": "i’m so sorry. your feelings are valid. sending you lots of love & strength during this time 💓",
      "created_utc": 1721316241.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ldq62ak",
      "author": "Different_Sun2848",
      "body": "I'm so sorry for both of you. What a devastating situation. Unfortunately, I don't have answers on what you should say or do because I don't think there are any. Euthanasia and suicide are still such a stigmatised topic that it's barely discussed, making it more socially divisive. \n\nAll I do know is she would have undergone so many assessments to make sure this decision can be considered in her best interest, so it's not an impulsive decision. Saying goodbye is heartbreaking, and it never feels right or enough. My personal opinion about assisted suicide is that a person with capacity should be allowed to decide when their suffering is too unbearable and gives them a way out that won't leave their loved ones in shock or wondering if it was their fault (comparing to suicide). Take comfort knowing you were with her on this lonely journey where she didn't have to go through anorexia alone for 15 years. It's incredibly painful when we lose animals by putting them down, but a time comes when their suffering becomes too much for us to force them to keep going through solely because we don't want to say goodbye. We can choose when ending our pets' pain is the only way we can stop them from suffering and allow them to rest in some comfort. My opinion is that humans should be able to choose a controlled, peaceful end where they have the chance to say goodbye to their loved ones. Nevertheless, it's still shocking and devastating for everyone involved. I'm so sorry for your loss. Try to take comfort that her suffering has stopped, and she has chosen to be at peace.",
      "created_utc": 1721278224.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ldstti0",
      "author": "Fluffy-Panqueques",
      "body": "I can’t say it; only you can. Don’t hold back anything. \nTell her how much she means to you, \ntell her how beautiful she was, \ntell her how strong she was to fight this disgusting emotion longer than most, \ntell her how much she’s contributed to the world, \ntell her that it’s okay and all of those guilty feelings are now going to succumb, \ntell her the past is in the past and to enjoy her last couple of hours,\ntell her nobody in the world will judge her if she wants to eat or not in the last few hours,\ntell her she was more than the number,\ntell her you’re sorry you couldn’t do more,\nTell her.\n\nAnd for you, don’t ever, ever think you did anything wrong. I know, I KNOW you tried your best, but this was her battle. ",
      "created_utc": 1721323272.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ldvgua7",
      "author": "anonymousdemigirl",
      "body": "In my opinion, that’s absolutely horrible for all parties involved & it’s rly sad she got to that point. Are there bad treatment options in Holland? I definitely understand the struggle, it’s been a long run for me too… ❤️‍🩹",
      "created_utc": 1721358272.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ldswwpy",
      "author": "Time_Ad_6887",
      "body": "That is just heart breaking. I feel so bad for you. (and for your friend too of course.)",
      "created_utc": 1721324253.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ldt48su",
      "author": "amski_gp",
      "body": "Babe I think you need to focus on you and what you need for closure too. 💕  this is a huge news to get, to process, to say good bye before it goes down tomorrow.\n\nYou need to be very patient with yourself, and whatever you do, DO NOT BLAME YOURSELF.  You did your best, she did her best, our medical systems are very broken, especially for the classification of SEED, but limiting care and support until someone is underweight, ensuring they get sicker to even get help.  But we know EDs are more treatable the earlier they’re treated. \n\nShe gave you very little time to say goodbye, and that’s really hard. 💕 she’ll want to spend a lot of the last moments with her family, so you might not get to have the goodbye you’d like.  I’m so sorry bb.  Please take care of yourself right now.  I’m so sorry, my heart breaks for you.",
      "created_utc": 1721326645.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ldto67e",
      "author": "bubbles2360",
      "body": "As someone who dealt with this godawful disorder I feel strongly on both your sides. It’s horrible when nobody will believe you (as the person dealing with it), thinks you’re just attention seeking, and doctors are absolutely useless to helping you recover cuz they refuse to see it as a psychological AND physical thing, not just one or the other. Euthanasia is a real thing that people should have access to, but this disorder doesn’t have to claim peoples’ lives. It still does though cuz the body can only take so much restriction/malnourishment. I hope your friend has peace after her euthanasia (if she believes in an afterlife) as well as yourself rn cuz as someone said, listening to someone basically speak a suicide note out loud right to you is horrifying, confusing, depressing, and infuriating all at once!",
      "created_utc": 1721333131.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ldtwwcp",
      "author": "madeleinetwocock",
      "body": "i don’t know what to say. i’ve been rendered speechless. but hear me when i say that i want to give you a big ol’ bear hug so incredibly badly. i’m so sorry - not only for her passing, but that you are experiencing this as well. grief is horrendous, complicated, and messy. i’m here for you if you ever need anyone to just talk to. always 🩶",
      "created_utc": 1721335934.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ldxx013",
      "author": "Total_Strawberry_280",
      "body": "I just want to say thank you to everyone who has left comments It's been comforting to know I was able to get to say everything I wanted while hearing from others. I may not have replied to all comments but I have read all of them and am truly grateful for everyone taking time out of their day to offer words of support.",
      "created_utc": 1721402560.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ldu7at6",
      "author": "None",
      "body": "I'm so so so so so sorry. Sending hugs <3",
      "created_utc": 1721339433.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ldujndv",
      "author": "ll0v3rg1rll",
      "body": "i'm so sorry for your friend and for your loss. i hope your friend finds peace, however that may be.",
      "created_utc": 1721344906.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ldup4c4",
      "author": "kaywhateverloser",
      "body": "I am so very sorry. I wish you relief that your friend is feeling better, and that you may meet again one way or another.",
      "created_utc": 1721346979.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lduw1kw",
      "author": "imsureyourenice",
      "body": "I’m so sorry. Be extra kind to yourself. ❤️",
      "created_utc": 1721349736.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ldv78fp",
      "author": "urm0mmmmm",
      "body": "may she rest in peace",
      "created_utc": 1721354242.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ldv9ia2",
      "author": "pumpkinlattepenelope",
      "body": "I don’t know you or near live you but my deepest sympathies are with you",
      "created_utc": 1721355162.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ldotgwq",
      "author": "HerElectronicHaze",
      "body": "I wish I lived in Holland. I knew this did this for other patients, but didn’t know it was potentially available for people with EDs\n\nNot sure why I’m being downvoted. I have a chronic and severe long term ED, which makes day to day living pretty unbearable and my body is falling apart. I’m supposed to pretend that I want to continue living with this, until my body crumbles further?\n\nI truly believe we should have the right to end our lives in a safe and dignified way, of course provided there is proper safeguarding etc.",
      "created_utc": 1721257970.0,
      "score": 37,
      "context": []
    },
    {
      "id": "ldq9uz1",
      "author": "Butterscotchnoodle",
      "body": "I don’t think anyone is qualified to decide whether it’s ethical what she is doing or not. She’s decided this is best for her health. Sure it could be the wrong choice but who are we to say or are to take any reasonable measurement of her mental of physical state. Pain can be unimaginable to those who have not experienced it or who can’t imagine needing to make this choice. Nevertheless the real focus should be on OP feelings. OP I would go to a therapist and find one that deals with grief and the loss of someone to this process. I think there is nothing anyone could do to change her plight. It just is as it is. Focus now would be on accepting her choice but I also think you can tell her how you feel. I think there can be fair space for both your experiences. You’re entitled to feel  angry and hurt and all kinds of things but to also tell her and say you know it’s her choice but you wished she would stay. I don’t think anything else can be done after that- if she chooses or not. I hope the best for you and her",
      "created_utc": 1721280328.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ldox8u2",
      "author": "evie111_",
      "body": "oh my gosh. is there anything you can do to convince her to live? this is heartbreaking and im so sorry.",
      "created_utc": 1721259366.0,
      "score": 13,
      "context": []
    },
    {
      "id": "le10rh9",
      "author": "QuietObsessions",
      "body": "I am so incredibly sorry you are dealing with this. I knew someone who also chose a medical assisted death for severe and enduring anorexia and it feels absolutely devastating. I’m so sorry for your loss. Just tell her you love her and have cherished all of your moments together and that miss her forever. That’s all you can do. Again I am so sorry, this is a type of grief not many understand. ❣️",
      "created_utc": 1721443093.0,
      "score": 2,
      "context": []
    },
    {
      "id": "le2imtm",
      "author": "SlowImprovement886",
      "body": "Condolences for your loss and best wishes for your full recovery",
      "created_utc": 1721476103.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lsnzwor",
      "author": "LeastPay0",
      "body": "Use her as an example of what not to become. Have purpose in moving forward to help others. Sorry for your loss. In life we're always learning lessons whether good or bad. Honor her name for her, speak about her, bring awareness to those who need it. Again, my condolences to you!!!♥️",
      "created_utc": 1729334298.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ldszivl",
      "author": "None",
      "body": "euthanasia is a joke. government should have no role in helping people with mental disorders to end their lives. it gives them an incentive to do that instead of helping.",
      "created_utc": 1721325084.0,
      "score": 4,
      "context": []
    },
    {
      "id": "le70bsb",
      "author": "neko_otakuchan",
      "body": "im so so sorry...",
      "created_utc": 1721545140.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lduyo2f",
      "author": "Dominant_King12",
      "body": "What happened?",
      "created_utc": 1721350789.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ldowyfd",
      "author": "Total_Strawberry_280",
      "body": "This is lovely, I am going to message her this. I hope she sees it.",
      "created_utc": 1721259258.0,
      "score": 294,
      "context": [
        {
          "id": "ldoqixs",
          "author": "Talysha1921",
          "body": "I would make a promise to her that I would recover enough for the both of us.",
          "created_utc": 1721256886.0
        }
      ]
    },
    {
      "id": "ldxx6ez",
      "author": "Total_Strawberry_280",
      "body": "Thank you for your kind words, I hope you get the support and help you need",
      "created_utc": 1721402617.0,
      "score": 4,
      "context": [
        {
          "id": "ldp1heq",
          "author": "Kloana",
          "body": "I can only imagine how incredibly excruciating and confusing this situation is for you and all involved. And I wish I could give you a satisfying answer because.. well... I'm trying not to go down that path myself... even though the government is currently working on passing the euthanasia law in my country, so it could be a viable option in the future. It is truly scary think about but, ultimately, it seems she's finding her peace, and I think that's all anyone wants in our final moments. I'm so sorry, I would give you a hug now if I could :( 🙏",
          "created_utc": 1721260960.0
        }
      ]
    },
    {
      "id": "ldxxagf",
      "author": "Total_Strawberry_280",
      "body": "<3",
      "created_utc": 1721402654.0,
      "score": 2,
      "context": [
        {
          "id": "ldpt8ya",
          "author": "justcallmedrzoidberg",
          "body": "Holding space for you. We are here.",
          "created_utc": 1721272056.0
        }
      ]
    },
    {
      "id": "ldrn9xb",
      "author": "Total_Strawberry_280",
      "body": "This is very true, it feels like you’d always want the opportunity to reply to a suicide note. Having lost friends to suicide before I always wished it but when you get the chance in reality it’s hard to know everything you want to say before it happens",
      "created_utc": 1721308786.0,
      "score": 27,
      "context": [
        {
          "id": "ldpc0nm",
          "author": "Beezywella",
          "body": "I can’t imagine hearing a suicide note spoken from the person writing it. I’m so sorry you’re going through this and my heart is broken for your friend. God is good but life is so hard. You can still be better every day. I can only imagine but I think people staring mortality in the face have a greater appreciation for honesty. If I were you I wouldn’t hold back at all. Tell her how much she means to you. Tell her you don’t want her to leave. Know you did all you could before she does. Praying for the both of you.",
          "created_utc": 1721265052.0
        }
      ]
    },
    {
      "id": "ldqd0vk",
      "author": "Fun_Recognition9904",
      "body": "Well said.",
      "created_utc": 1721282183.0,
      "score": 8,
      "context": [
        {
          "id": "ldpc0nm",
          "author": "Beezywella",
          "body": "I can’t imagine hearing a suicide note spoken from the person writing it. I’m so sorry you’re going through this and my heart is broken for your friend. God is good but life is so hard. You can still be better every day. I can only imagine but I think people staring mortality in the face have a greater appreciation for honesty. If I were you I wouldn’t hold back at all. Tell her how much she means to you. Tell her you don’t want her to leave. Know you did all you could before she does. Praying for the both of you.",
          "created_utc": 1721265052.0
        }
      ]
    },
    {
      "id": "ldpzgt9",
      "author": "Much_Bite_8772",
      "body": "I don't think OP's friend necessarily thinks she's a lost cause (nor do the doctors signing off on this) and therefore wants to undergo euthanasia for that reason. As someone who used to work in the medical field (and former sufferer of AN) there is a lot of physical pain that results from the longterm illness - between muscle wastage and nerve damage, gastrointestinal intestinal problems and blockages, and organ failure. For those who fall too far into the disease the damage is debilitating and so physically painful. It's just such a sad situation overall. Sending you lots of love OP and to everyone who's struggling here",
      "created_utc": 1721274913.0,
      "score": 36,
      "context": [
        {
          "id": "ldoywo8",
          "author": "None",
          "body": "I’m so sorry, that must be horrible. I think your mixed feelings are very understandable. I’m usually very pro all kinds of bodily autonomy. But as a recovered person, I think this is wrong. This isn’t compassion. I don’t believe in lost causes - unless someone is guaranteed to die anyway. When you’re sick, you need others to hold hope for you. I gave up on myself many times, but there were people who cared enough to make sure I was safe and be there for as long as it took for me to choose recovery. It sounds like there might not be much you can do, which sounds extremely stressful. This is devastating. Feel your emotions & look after yourself. Is there anyone you can talk to irl?",
          "created_utc": 1721259993.0
        }
      ]
    },
    {
      "id": "ldpxvk9",
      "author": "RuthMaudeJameison",
      "body": "There is criteria that must be met. Her body may be ravaged. She may have brain damage from starvation. There could be all kinds of issues, but no matter what, you can’t just say, “hey, I wanna be euthanized, how’s next Friday look?”",
      "created_utc": 1721274167.0,
      "score": 29,
      "context": [
        {
          "id": "ldoywo8",
          "author": "None",
          "body": "I’m so sorry, that must be horrible. I think your mixed feelings are very understandable. I’m usually very pro all kinds of bodily autonomy. But as a recovered person, I think this is wrong. This isn’t compassion. I don’t believe in lost causes - unless someone is guaranteed to die anyway. When you’re sick, you need others to hold hope for you. I gave up on myself many times, but there were people who cared enough to make sure I was safe and be there for as long as it took for me to choose recovery. It sounds like there might not be much you can do, which sounds extremely stressful. This is devastating. Feel your emotions & look after yourself. Is there anyone you can talk to irl?",
          "created_utc": 1721259993.0
        }
      ]
    },
    {
      "id": "ldpbl1c",
      "author": "laslack1989",
      "body": "I’m glad you’re recovered but the reality is that some aren’t going to, there’s just no getting around that, and dying from heart failure, malnutrition or other complications of anorexia is a pretty horrible way to go. I’ve got mixed feelings about it too because of course recovery is possible and I want everyone to recover- but they’re not going to. Just like drug addicts are gonna die from their addiction.",
      "created_utc": 1721264881.0,
      "score": 50,
      "context": [
        {
          "id": "ldoywo8",
          "author": "None",
          "body": "I’m so sorry, that must be horrible. I think your mixed feelings are very understandable. I’m usually very pro all kinds of bodily autonomy. But as a recovered person, I think this is wrong. This isn’t compassion. I don’t believe in lost causes - unless someone is guaranteed to die anyway. When you’re sick, you need others to hold hope for you. I gave up on myself many times, but there were people who cared enough to make sure I was safe and be there for as long as it took for me to choose recovery. It sounds like there might not be much you can do, which sounds extremely stressful. This is devastating. Feel your emotions & look after yourself. Is there anyone you can talk to irl?",
          "created_utc": 1721259993.0
        }
      ]
    },
    {
      "id": "ldufgx5",
      "author": "Total_Strawberry_280",
      "body": "❤️",
      "created_utc": 1721343325.0,
      "score": 2,
      "context": [
        {
          "id": "ldph2kh",
          "author": "Responsible_Poet3516",
          "body": "I am so sorry I can’t hug you through the phone. ",
          "created_utc": 1721267039.0
        }
      ]
    },
    {
      "id": "ldqv95a",
      "author": "Eiffeltoren",
      "body": "Hello Meggy, that’s interesting about 8+ We have been fighting 5 years and got to almost recovery. I get your point that once you pushed the body too far, it might be too late. My daughter’s doctor said it is as if you swim for one island to another against the current. If you are too weak you never get to the other island.",
      "created_utc": 1721294216.0,
      "score": 14,
      "context": [
        {
          "id": "ldosjaj",
          "author": "Meggy_bug",
          "body": "Yess, not a doc but I remember after 8+ years Anorexia may be classified as terminal\n\n it is very sad and scary, but that is good your friend won't have to suffer anymore, anorexia taught me, that sometimes in life you can go too far, and cannot return and fix that later, your friend's illness sadly drove her to that no return point.. she choosen to be free of all of suffering and it's okay,, she can have peace now\n\n wish you well :( <3 I know it is hard",
          "created_utc": 1721257624.0
        }
      ]
    },
    {
      "id": "ldrtovr",
      "author": "Total_Strawberry_280",
      "body": "Thank you so much for your kind words here. I did message her this morning saying I loved her and she sent a heart back. But she said it was happening in the morning so it must have been right before it happened. I don’t know who is even going to let me know if or when it has happened.",
      "created_utc": 1721311185.0,
      "score": 12,
      "context": [
        {
          "id": "ldrr7oo",
          "author": "Training-Cry510",
          "body": "Ugh 😣 I hate this so much for both of you, and her dad. She’s got to be hurting physically, and mentally from this disease so badly. I wonder if they add these cases into the statistics where it shows it’s the deadliest mental illness. \n\nThe sadness, confusion, and anguish with this fucking disorder must be hitting you hard right now, and to respect her decision, and not beg her to stay I know couldn’t have been easy. I know how hard it was to lose my grandparents after they lived mostly healthy lives, for 8-9 decades and trying to bargain with god or whatever is out there to give me just one more year, one more month, one more day. Or my two aunts passing away in their 40s even though they were terribly sick with cancer, then my uncle last year in his 60s still I imagined got to live more than your best friend. It all just doesn’t seem fair.  Please don’t inadvertently relapse from the sadness. If you catch yourself slipping take care she will want you to. \n\nI want to say to you something like “maybe she’ll change her mind last minute” or have a revelation that she can find a way out. I don’t think that’s fair to you though, or realistic if her Drs signed off on it. I think if a Dr had any inkling that someone may change their mind they wouldn’t go through with it, and I imagine there’s a lengthy therapy process beforehand to make sure they really understand what they’re getting into. I can hope that for you, but I don’t think it’s something that realistically would happen. \n\nMaybe send her a text or email just one last “I love you forever “ my best friend and I before this or depression even became prevalent in our lives made a pact on how we’d let one another know we were lurking and haunting the other whoever goes first. It was a dark conversation, but at the same time we came up with out there shit nobody else would know besides the two of us so we both laughed and cried a lot that night. She’ll be with you. Idk if god is real but I don’t believe death is the end only because I’ve had some run ins that couldn’t be explained. \n\nI’ll be keeping you both, and her dad in my thoughts. 🫶🏻 you got a great community that is here for you. Please take care of yourself",
          "created_utc": 1721310284.0
        }
      ]
    },
    {
      "id": "ldug27f",
      "author": "Total_Strawberry_280",
      "body": "Thank you for providing some clarification on this for me x",
      "created_utc": 1721343546.0,
      "score": 4,
      "context": [
        {
          "id": "ldqppc6",
          "author": "Warrior-Skye",
          "body": "First of all, I would like to wish you a lot of strength in this difficult time.  Perhaps I can provide a little more explanation as I come from the Netherlands and follow the political discussions surrounding euthanasia.  In the Netherlands it is also possible to obtain euthanasia for psychologically unbearable suffering, without the prospect of improvement.  Just as with a physical condition that never gets better, this can also be requested in extreme cases with a psychological condition.  It only remains a discussion when it is 'unbearable suffering' and also when there is no longer any prospect of improvement.  The process to obtain euthanasia often takes at least 2 years and several doctors and psychiatrists must agree that the suffering is unbearable and hopeless before approval is given.  With only a diagnosis of AN, even after 10 years you will not receive euthanasia, then there is more to be done, so the situation is considered to be that recovery is no longer possible and life is unbearable.",
          "created_utc": 1721290421.0
        }
      ]
    },
    {
      "id": "ldxybht",
      "author": "Total_Strawberry_280",
      "body": "She has been outpatient, inpatient and hospitalised many times with trips to Portugal for therapy. I haven't been in the same country as her but I know its been a long and painful struggle for the last 10-15 years, and although I'm not sure about all treatment options available that are covered by insurance, I know her parents spent a lot of money trying to get her the best help available.",
      "created_utc": 1721402989.0,
      "score": 3,
      "context": [
        {
          "id": "ldvgua7",
          "author": "anonymousdemigirl",
          "body": "In my opinion, that’s absolutely horrible for all parties involved & it’s rly sad she got to that point. Are there bad treatment options in Holland? I definitely understand the struggle, it’s been a long run for me too… ❤️‍🩹",
          "created_utc": 1721358272.0
        }
      ]
    },
    {
      "id": "ldw2lgv",
      "author": "Total_Strawberry_280",
      "body": "❤️",
      "created_utc": 1721369515.0,
      "score": 2,
      "context": [
        {
          "id": "ldt48su",
          "author": "amski_gp",
          "body": "Babe I think you need to focus on you and what you need for closure too. 💕  this is a huge news to get, to process, to say good bye before it goes down tomorrow.\n\nYou need to be very patient with yourself, and whatever you do, DO NOT BLAME YOURSELF.  You did your best, she did her best, our medical systems are very broken, especially for the classification of SEED, but limiting care and support until someone is underweight, ensuring they get sicker to even get help.  But we know EDs are more treatable the earlier they’re treated. \n\nShe gave you very little time to say goodbye, and that’s really hard. 💕 she’ll want to spend a lot of the last moments with her family, so you might not get to have the goodbye you’d like.  I’m so sorry bb.  Please take care of yourself right now.  I’m so sorry, my heart breaks for you.",
          "created_utc": 1721326645.0
        }
      ]
    },
    {
      "id": "ldugcbi",
      "author": "Total_Strawberry_280",
      "body": "Thank you. Hugs x",
      "created_utc": 1721343652.0,
      "score": 3,
      "context": [
        {
          "id": "ldtwwcp",
          "author": "madeleinetwocock",
          "body": "i don’t know what to say. i’ve been rendered speechless. but hear me when i say that i want to give you a big ol’ bear hug so incredibly badly. i’m so sorry - not only for her passing, but that you are experiencing this as well. grief is horrendous, complicated, and messy. i’m here for you if you ever need anyone to just talk to. always 🩶",
          "created_utc": 1721335934.0
        }
      ]
    },
    {
      "id": "ldqm767",
      "author": "Total_Strawberry_280",
      "body": "I think your original comment was very brief and may have got downvotes for low relevance. I wasn’t one of those but I could see why your comment before editing might have seemed. I hope you find what you are looking for x",
      "created_utc": 1721288037.0,
      "score": 11,
      "context": [
        {
          "id": "ldotgwq",
          "author": "HerElectronicHaze",
          "body": "I wish I lived in Holland. I knew this did this for other patients, but didn’t know it was potentially available for people with EDs\n\nNot sure why I’m being downvoted. I have a chronic and severe long term ED, which makes day to day living pretty unbearable and my body is falling apart. I’m supposed to pretend that I want to continue living with this, until my body crumbles further?\n\nI truly believe we should have the right to end our lives in a safe and dignified way, of course provided there is proper safeguarding etc.",
          "created_utc": 1721257970.0
        }
      ]
    },
    {
      "id": "ldqvf07",
      "author": "Eiffeltoren",
      "body": "hugs and strength ❤️",
      "created_utc": 1721294329.0,
      "score": 5,
      "context": [
        {
          "id": "ldotgwq",
          "author": "HerElectronicHaze",
          "body": "I wish I lived in Holland. I knew this did this for other patients, but didn’t know it was potentially available for people with EDs\n\nNot sure why I’m being downvoted. I have a chronic and severe long term ED, which makes day to day living pretty unbearable and my body is falling apart. I’m supposed to pretend that I want to continue living with this, until my body crumbles further?\n\nI truly believe we should have the right to end our lives in a safe and dignified way, of course provided there is proper safeguarding etc.",
          "created_utc": 1721257970.0
        }
      ]
    },
    {
      "id": "ldrb63v",
      "author": "Puzzleheaded_Ad550",
      "body": "Don't think like that. Be frustrated about how disappointing eating disorder treatment is in the Netherlands. How there are waiting lists that could last 6 months before an intake. How there have been so many cut backs in funding that there's even more waiting even after being accepted for treatment. It's no country to be jealous of.",
      "created_utc": 1721303582.0,
      "score": 10,
      "context": [
        {
          "id": "ldotgwq",
          "author": "HerElectronicHaze",
          "body": "I wish I lived in Holland. I knew this did this for other patients, but didn’t know it was potentially available for people with EDs\n\nNot sure why I’m being downvoted. I have a chronic and severe long term ED, which makes day to day living pretty unbearable and my body is falling apart. I’m supposed to pretend that I want to continue living with this, until my body crumbles further?\n\nI truly believe we should have the right to end our lives in a safe and dignified way, of course provided there is proper safeguarding etc.",
          "created_utc": 1721257970.0
        }
      ]
    },
    {
      "id": "ldoxysd",
      "author": "Total_Strawberry_280",
      "body": "She’s asked that no one convince her, she is set on it and her family have accepted this too. She just wants positivity / good memories. I don’t want to tarnish our last conversation, she will have e had plenty of other people try to convince her otherwise. She can of course back out at any point up to the time. Thank you for your condolences though!",
      "created_utc": 1721259638.0,
      "score": 56,
      "context": [
        {
          "id": "ldox8u2",
          "author": "evie111_",
          "body": "oh my gosh. is there anything you can do to convince her to live? this is heartbreaking and im so sorry.",
          "created_utc": 1721259366.0
        }
      ]
    },
    {
      "id": "lswfpsl",
      "author": "Total_Strawberry_280",
      "body": "thank you <3 x",
      "created_utc": 1729456801.0,
      "score": 1,
      "context": [
        {
          "id": "lsnzwor",
          "author": "LeastPay0",
          "body": "Use her as an example of what not to become. Have purpose in moving forward to help others. Sorry for your loss. In life we're always learning lessons whether good or bad. Honor her name for her, speak about her, bring awareness to those who need it. Again, my condolences to you!!!♥️",
          "created_utc": 1729334298.0
        }
      ]
    },
    {
      "id": "ldt9pi2",
      "author": "customer-of-thorns",
      "body": "sometimes, when the disease eats a person alive and the process is gone too far, the suffering becomes unbearable and there's no going back. it's kinda selfish of you to say such things while people continue to die horrible painful deaths, having no choice but to suffer. we deserve to die peacefully.",
      "created_utc": 1721328402.0,
      "score": 5,
      "context": [
        {
          "id": "ldszivl",
          "author": "None",
          "body": "euthanasia is a joke. government should have no role in helping people with mental disorders to end their lives. it gives them an incentive to do that instead of helping.",
          "created_utc": 1721325084.0
        }
      ]
    },
    {
      "id": "legm44r",
      "author": "Kloana",
      "body": "My pleasure and thank you 🙏❤️",
      "created_utc": 1721690533.0,
      "score": 3,
      "context": [
        {
          "id": "ldp1heq",
          "author": "Kloana",
          "body": "I can only imagine how incredibly excruciating and confusing this situation is for you and all involved. And I wish I could give you a satisfying answer because.. well... I'm trying not to go down that path myself... even though the government is currently working on passing the euthanasia law in my country, so it could be a viable option in the future. It is truly scary think about but, ultimately, it seems she's finding her peace, and I think that's all anyone wants in our final moments. I'm so sorry, I would give you a hug now if I could :( 🙏",
          "created_utc": 1721260960.0
        },
        {
          "id": "ldxx6ez",
          "author": "Total_Strawberry_280",
          "body": "Thank you for your kind words, I hope you get the support and help you need",
          "created_utc": 1721402617.0
        }
      ]
    },
    {
      "id": "ldrthk4",
      "author": "Beezywella",
      "body": "And what else could you possibly say except “no. I love you so much. Please don’t go.”? The strength OP has to respect her friend’s wishes and stay positive is so commendable. I have no idea how I would respond given the unfortunate opportunity.",
      "created_utc": 1721311114.0,
      "score": 22,
      "context": [
        {
          "id": "ldpc0nm",
          "author": "Beezywella",
          "body": "I can’t imagine hearing a suicide note spoken from the person writing it. I’m so sorry you’re going through this and my heart is broken for your friend. God is good but life is so hard. You can still be better every day. I can only imagine but I think people staring mortality in the face have a greater appreciation for honesty. If I were you I wouldn’t hold back at all. Tell her how much she means to you. Tell her you don’t want her to leave. Know you did all you could before she does. Praying for the both of you.",
          "created_utc": 1721265052.0
        },
        {
          "id": "ldrn9xb",
          "author": "Total_Strawberry_280",
          "body": "This is very true, it feels like you’d always want the opportunity to reply to a suicide note. Having lost friends to suicide before I always wished it but when you get the chance in reality it’s hard to know everything you want to say before it happens",
          "created_utc": 1721308786.0
        }
      ]
    },
    {
      "id": "le3zhpi",
      "author": "Bitter-Major-5595",
      "body": "The Netherlands laws on assisted suicide and euthanasia are much more lenient than anywhere else in the world. While I support death with dignity & believe it should be legalized everywhere, there’s definitely a “slippery slope”; especially with government involvement. It’s a very interesting topic that I suggest everyone research thoroughly in order to make informed decisions when electing officials.",
      "created_utc": 1721497369.0,
      "score": 3,
      "context": [
        {
          "id": "ldoywo8",
          "author": "None",
          "body": "I’m so sorry, that must be horrible. I think your mixed feelings are very understandable. I’m usually very pro all kinds of bodily autonomy. But as a recovered person, I think this is wrong. This isn’t compassion. I don’t believe in lost causes - unless someone is guaranteed to die anyway. When you’re sick, you need others to hold hope for you. I gave up on myself many times, but there were people who cared enough to make sure I was safe and be there for as long as it took for me to choose recovery. It sounds like there might not be much you can do, which sounds extremely stressful. This is devastating. Feel your emotions & look after yourself. Is there anyone you can talk to irl?",
          "created_utc": 1721259993.0
        },
        {
          "id": "ldpxvk9",
          "author": "RuthMaudeJameison",
          "body": "There is criteria that must be met. Her body may be ravaged. She may have brain damage from starvation. There could be all kinds of issues, but no matter what, you can’t just say, “hey, I wanna be euthanized, how’s next Friday look?”",
          "created_utc": 1721274167.0
        }
      ]
    },
    {
      "id": "ldpu5h1",
      "author": "Excellent-World-476",
      "body": "My mixed feelings is the fact that with this is place it’s cheaper for governments to allow people to die versus doing research and providing good and affordable treatment.",
      "created_utc": 1721272461.0,
      "score": 42,
      "context": [
        {
          "id": "ldoywo8",
          "author": "None",
          "body": "I’m so sorry, that must be horrible. I think your mixed feelings are very understandable. I’m usually very pro all kinds of bodily autonomy. But as a recovered person, I think this is wrong. This isn’t compassion. I don’t believe in lost causes - unless someone is guaranteed to die anyway. When you’re sick, you need others to hold hope for you. I gave up on myself many times, but there were people who cared enough to make sure I was safe and be there for as long as it took for me to choose recovery. It sounds like there might not be much you can do, which sounds extremely stressful. This is devastating. Feel your emotions & look after yourself. Is there anyone you can talk to irl?",
          "created_utc": 1721259993.0
        },
        {
          "id": "ldpbl1c",
          "author": "laslack1989",
          "body": "I’m glad you’re recovered but the reality is that some aren’t going to, there’s just no getting around that, and dying from heart failure, malnutrition or other complications of anorexia is a pretty horrible way to go. I’ve got mixed feelings about it too because of course recovery is possible and I want everyone to recover- but they’re not going to. Just like drug addicts are gonna die from their addiction.",
          "created_utc": 1721264881.0
        }
      ]
    },
    {
      "id": "ldsm0ez",
      "author": "ActiveEuphoric3919",
      "body": "I had anorexia for over 8 years, from 11 to almost 20, and I have had horrible complications including terrible gastroparesis and organ and heart damage. I am lucky that almost or all of my damage is reversible or I am able to live with it. Before I went to one of my more recent treatment centers my mom told me something (horrible to say and broke me and didn’t help at all). She said that she does view my anorexia as terminal, and that everytime I start recovery I will always relapse again. I knew the same thing about me was true though. And it was, until it wasn’t. I don’t know what changed in me, but between that treatment stay, traveling this past January, and starting another treatment this past February, I’m almost fully recovered now. And I really don’t see the signs in myself that I will ever go back to behaviors. I started treatment with a chronic AN/SEED approach in mind, thinking I would just learn to life with it until I die young, but I’m pretty much past that and am almost fully recovered now. I wish I knew how to unlock this realization in everyone but I don’t. But don’t give up hope just because someone says after a certain year you should, you can recover at any time, even with physical damage and chronic conditions.",
      "created_utc": 1721320744.0,
      "score": 14,
      "context": [
        {
          "id": "ldosjaj",
          "author": "Meggy_bug",
          "body": "Yess, not a doc but I remember after 8+ years Anorexia may be classified as terminal\n\n it is very sad and scary, but that is good your friend won't have to suffer anymore, anorexia taught me, that sometimes in life you can go too far, and cannot return and fix that later, your friend's illness sadly drove her to that no return point.. she choosen to be free of all of suffering and it's okay,, she can have peace now\n\n wish you well :( <3 I know it is hard",
          "created_utc": 1721257624.0
        },
        {
          "id": "ldqv95a",
          "author": "Eiffeltoren",
          "body": "Hello Meggy, that’s interesting about 8+ We have been fighting 5 years and got to almost recovery. I get your point that once you pushed the body too far, it might be too late. My daughter’s doctor said it is as if you swim for one island to another against the current. If you are too weak you never get to the other island.",
          "created_utc": 1721294216.0
        }
      ]
    },
    {
      "id": "ldtcm3c",
      "author": "Meggy_bug",
      "body": "Sending virtual hugs :( Stay strong, don't worry, that point of no return is rare to happen, and (depending on person and case) in often reversible in many aspects. Also, thank you for being amazing parent to your daughter!! Sadly rare to have for people with ED's (Because parents and all people in society view ed similar to addicts/ \"junkies\" and in annoyed by them, sees the as stupid, shallow..)",
      "created_utc": 1721329341.0,
      "score": 3,
      "context": [
        {
          "id": "ldosjaj",
          "author": "Meggy_bug",
          "body": "Yess, not a doc but I remember after 8+ years Anorexia may be classified as terminal\n\n it is very sad and scary, but that is good your friend won't have to suffer anymore, anorexia taught me, that sometimes in life you can go too far, and cannot return and fix that later, your friend's illness sadly drove her to that no return point.. she choosen to be free of all of suffering and it's okay,, she can have peace now\n\n wish you well :( <3 I know it is hard",
          "created_utc": 1721257624.0
        },
        {
          "id": "ldqv95a",
          "author": "Eiffeltoren",
          "body": "Hello Meggy, that’s interesting about 8+ We have been fighting 5 years and got to almost recovery. I get your point that once you pushed the body too far, it might be too late. My daughter’s doctor said it is as if you swim for one island to another against the current. If you are too weak you never get to the other island.",
          "created_utc": 1721294216.0
        }
      ]
    },
    {
      "id": "ldw086v",
      "author": "Warrior-Skye",
      "body": "No problem at all, you're welcome.  Above all, I wish you lots of strength. I hope I explained it a bit clearly, because I'm not very good at English.",
      "created_utc": 1721368104.0,
      "score": 3,
      "context": [
        {
          "id": "ldqppc6",
          "author": "Warrior-Skye",
          "body": "First of all, I would like to wish you a lot of strength in this difficult time.  Perhaps I can provide a little more explanation as I come from the Netherlands and follow the political discussions surrounding euthanasia.  In the Netherlands it is also possible to obtain euthanasia for psychologically unbearable suffering, without the prospect of improvement.  Just as with a physical condition that never gets better, this can also be requested in extreme cases with a psychological condition.  It only remains a discussion when it is 'unbearable suffering' and also when there is no longer any prospect of improvement.  The process to obtain euthanasia often takes at least 2 years and several doctors and psychiatrists must agree that the suffering is unbearable and hopeless before approval is given.  With only a diagnosis of AN, even after 10 years you will not receive euthanasia, then there is more to be done, so the situation is considered to be that recovery is no longer possible and life is unbearable.",
          "created_utc": 1721290421.0
        },
        {
          "id": "ldug27f",
          "author": "Total_Strawberry_280",
          "body": "Thank you for providing some clarification on this for me x",
          "created_utc": 1721343546.0
        }
      ]
    },
    {
      "id": "lduitkr",
      "author": "madeleinetwocock",
      "body": "🧸🫶🏻💌\n\nthinking about you. tons. have been since i saw your post.",
      "created_utc": 1721344593.0,
      "score": 3,
      "context": [
        {
          "id": "ldtwwcp",
          "author": "madeleinetwocock",
          "body": "i don’t know what to say. i’ve been rendered speechless. but hear me when i say that i want to give you a big ol’ bear hug so incredibly badly. i’m so sorry - not only for her passing, but that you are experiencing this as well. grief is horrendous, complicated, and messy. i’m here for you if you ever need anyone to just talk to. always 🩶",
          "created_utc": 1721335934.0
        },
        {
          "id": "ldugcbi",
          "author": "Total_Strawberry_280",
          "body": "Thank you. Hugs x",
          "created_utc": 1721343652.0
        }
      ]
    },
    {
      "id": "ldqsbx3",
      "author": "Initial-Beautiful718",
      "body": "Im so, so sorry. \nI understand that you dont want to make it even more difficult for her, yet I think I would always regret not having at least tried to convince her. It would stick around in my mind. \nIve had very severe anorexia for 20 years, times that doctors declared me terminal, times I would have wanted it too (strange as it sounds my pride prevented me)\nIm not at all recovered, and i never will be.Aside the mental part, im physically completely broken. \nHowever, Im still so happy that im still here. Life isnt easy at all, but theres little moments of joy. \n\nBut ofcourse I understand that you need to respect someones choice, i really do. But its irreversible. Sometimes youre so so deep that you can’t see it clearly yourself \n\nSorry i cant be more helpful. hug!",
      "created_utc": 1721292193.0,
      "score": 5,
      "context": [
        {
          "id": "ldox8u2",
          "author": "evie111_",
          "body": "oh my gosh. is there anything you can do to convince her to live? this is heartbreaking and im so sorry.",
          "created_utc": 1721259366.0
        },
        {
          "id": "ldoxysd",
          "author": "Total_Strawberry_280",
          "body": "She’s asked that no one convince her, she is set on it and her family have accepted this too. She just wants positivity / good memories. I don’t want to tarnish our last conversation, she will have e had plenty of other people try to convince her otherwise. She can of course back out at any point up to the time. Thank you for your condolences though!",
          "created_utc": 1721259638.0
        }
      ]
    },
    {
      "id": "le8ykys",
      "author": "RuthMaudeJameison",
      "body": "I guess “lenient” is a matter of perspective.",
      "created_utc": 1721580519.0,
      "score": 4,
      "context": [
        {
          "id": "ldoywo8",
          "author": "None",
          "body": "I’m so sorry, that must be horrible. I think your mixed feelings are very understandable. I’m usually very pro all kinds of bodily autonomy. But as a recovered person, I think this is wrong. This isn’t compassion. I don’t believe in lost causes - unless someone is guaranteed to die anyway. When you’re sick, you need others to hold hope for you. I gave up on myself many times, but there were people who cared enough to make sure I was safe and be there for as long as it took for me to choose recovery. It sounds like there might not be much you can do, which sounds extremely stressful. This is devastating. Feel your emotions & look after yourself. Is there anyone you can talk to irl?",
          "created_utc": 1721259993.0
        },
        {
          "id": "ldpxvk9",
          "author": "RuthMaudeJameison",
          "body": "There is criteria that must be met. Her body may be ravaged. She may have brain damage from starvation. There could be all kinds of issues, but no matter what, you can’t just say, “hey, I wanna be euthanized, how’s next Friday look?”",
          "created_utc": 1721274167.0
        },
        {
          "id": "le3zhpi",
          "author": "Bitter-Major-5595",
          "body": "The Netherlands laws on assisted suicide and euthanasia are much more lenient than anywhere else in the world. While I support death with dignity & believe it should be legalized everywhere, there’s definitely a “slippery slope”; especially with government involvement. It’s a very interesting topic that I suggest everyone research thoroughly in order to make informed decisions when electing officials.",
          "created_utc": 1721497369.0
        }
      ]
    },
    {
      "id": "ldqcaib",
      "author": "daisycaulfield",
      "body": "Exactly. Anorexia is so beyond misunderstood and will continue to be when there is barely any pharmacological research or other treatments available.",
      "created_utc": 1721281753.0,
      "score": 22,
      "context": [
        {
          "id": "ldoywo8",
          "author": "None",
          "body": "I’m so sorry, that must be horrible. I think your mixed feelings are very understandable. I’m usually very pro all kinds of bodily autonomy. But as a recovered person, I think this is wrong. This isn’t compassion. I don’t believe in lost causes - unless someone is guaranteed to die anyway. When you’re sick, you need others to hold hope for you. I gave up on myself many times, but there were people who cared enough to make sure I was safe and be there for as long as it took for me to choose recovery. It sounds like there might not be much you can do, which sounds extremely stressful. This is devastating. Feel your emotions & look after yourself. Is there anyone you can talk to irl?",
          "created_utc": 1721259993.0
        },
        {
          "id": "ldpbl1c",
          "author": "laslack1989",
          "body": "I’m glad you’re recovered but the reality is that some aren’t going to, there’s just no getting around that, and dying from heart failure, malnutrition or other complications of anorexia is a pretty horrible way to go. I’ve got mixed feelings about it too because of course recovery is possible and I want everyone to recover- but they’re not going to. Just like drug addicts are gonna die from their addiction.",
          "created_utc": 1721264881.0
        },
        {
          "id": "ldpu5h1",
          "author": "Excellent-World-476",
          "body": "My mixed feelings is the fact that with this is place it’s cheaper for governments to allow people to die versus doing research and providing good and affordable treatment.",
          "created_utc": 1721272461.0
        }
      ]
    },
    {
      "id": "ldq34vf",
      "author": "theskymaid",
      "body": "You hit the nail on the head and more people should be talking about this.",
      "created_utc": 1721276711.0,
      "score": 8,
      "context": [
        {
          "id": "ldoywo8",
          "author": "None",
          "body": "I’m so sorry, that must be horrible. I think your mixed feelings are very understandable. I’m usually very pro all kinds of bodily autonomy. But as a recovered person, I think this is wrong. This isn’t compassion. I don’t believe in lost causes - unless someone is guaranteed to die anyway. When you’re sick, you need others to hold hope for you. I gave up on myself many times, but there were people who cared enough to make sure I was safe and be there for as long as it took for me to choose recovery. It sounds like there might not be much you can do, which sounds extremely stressful. This is devastating. Feel your emotions & look after yourself. Is there anyone you can talk to irl?",
          "created_utc": 1721259993.0
        },
        {
          "id": "ldpbl1c",
          "author": "laslack1989",
          "body": "I’m glad you’re recovered but the reality is that some aren’t going to, there’s just no getting around that, and dying from heart failure, malnutrition or other complications of anorexia is a pretty horrible way to go. I’ve got mixed feelings about it too because of course recovery is possible and I want everyone to recover- but they’re not going to. Just like drug addicts are gonna die from their addiction.",
          "created_utc": 1721264881.0
        },
        {
          "id": "ldpu5h1",
          "author": "Excellent-World-476",
          "body": "My mixed feelings is the fact that with this is place it’s cheaper for governments to allow people to die versus doing research and providing good and affordable treatment.",
          "created_utc": 1721272461.0
        }
      ]
    },
    {
      "id": "ldtdp7g",
      "author": "Meggy_bug",
      "body": "Congratulations on your recovery<3 Wish you well, and amazing life with strong and healthy body and mind :) You're really strong and brave, many people would see that as too hard to try recovery at this point, you are proof that no matter that \"incurable anorexia\" and all no one should never give up and stop trying\n\nAnd yeah, \"terminal anorexia\" kinda can be hurtful to someone struggling, I too think that such label might be sometimes making someone worse, but also some cases are too far gone sadly(especially if someone used harsh methods on themselves, like constant energy drinks, drugs etc, and damaged their heart badly)",
      "created_utc": 1721329701.0,
      "score": 4,
      "context": [
        {
          "id": "ldosjaj",
          "author": "Meggy_bug",
          "body": "Yess, not a doc but I remember after 8+ years Anorexia may be classified as terminal\n\n it is very sad and scary, but that is good your friend won't have to suffer anymore, anorexia taught me, that sometimes in life you can go too far, and cannot return and fix that later, your friend's illness sadly drove her to that no return point.. she choosen to be free of all of suffering and it's okay,, she can have peace now\n\n wish you well :( <3 I know it is hard",
          "created_utc": 1721257624.0
        },
        {
          "id": "ldqv95a",
          "author": "Eiffeltoren",
          "body": "Hello Meggy, that’s interesting about 8+ We have been fighting 5 years and got to almost recovery. I get your point that once you pushed the body too far, it might be too late. My daughter’s doctor said it is as if you swim for one island to another against the current. If you are too weak you never get to the other island.",
          "created_utc": 1721294216.0
        },
        {
          "id": "ldsm0ez",
          "author": "ActiveEuphoric3919",
          "body": "I had anorexia for over 8 years, from 11 to almost 20, and I have had horrible complications including terrible gastroparesis and organ and heart damage. I am lucky that almost or all of my damage is reversible or I am able to live with it. Before I went to one of my more recent treatment centers my mom told me something (horrible to say and broke me and didn’t help at all). She said that she does view my anorexia as terminal, and that everytime I start recovery I will always relapse again. I knew the same thing about me was true though. And it was, until it wasn’t. I don’t know what changed in me, but between that treatment stay, traveling this past January, and starting another treatment this past February, I’m almost fully recovered now. And I really don’t see the signs in myself that I will ever go back to behaviors. I started treatment with a chronic AN/SEED approach in mind, thinking I would just learn to life with it until I die young, but I’m pretty much past that and am almost fully recovered now. I wish I knew how to unlock this realization in everyone but I don’t. But don’t give up hope just because someone says after a certain year you should, you can recover at any time, even with physical damage and chronic conditions.",
          "created_utc": 1721320744.0
        }
      ]
    },
    {
      "id": "leg0cjv",
      "author": "Eiffeltoren",
      "body": "Dear Meg, thanks for your compliment. I had a severe depression and understand very well what a mental illness can do to a person. But even without it, parents should fight for their children especially if they are minors or young adults. But the thing is that I have been diagnosed with chronic fatigue syndrome 2 months ago. It’s a pity. My daughter is so much better after our fight, studies, Dances, works, adventures… but what about me now ? I accept my fate but it hurts sometimes.",
      "created_utc": 1721682910.0,
      "score": 3,
      "context": [
        {
          "id": "ldosjaj",
          "author": "Meggy_bug",
          "body": "Yess, not a doc but I remember after 8+ years Anorexia may be classified as terminal\n\n it is very sad and scary, but that is good your friend won't have to suffer anymore, anorexia taught me, that sometimes in life you can go too far, and cannot return and fix that later, your friend's illness sadly drove her to that no return point.. she choosen to be free of all of suffering and it's okay,, she can have peace now\n\n wish you well :( <3 I know it is hard",
          "created_utc": 1721257624.0
        },
        {
          "id": "ldqv95a",
          "author": "Eiffeltoren",
          "body": "Hello Meggy, that’s interesting about 8+ We have been fighting 5 years and got to almost recovery. I get your point that once you pushed the body too far, it might be too late. My daughter’s doctor said it is as if you swim for one island to another against the current. If you are too weak you never get to the other island.",
          "created_utc": 1721294216.0
        },
        {
          "id": "ldtcm3c",
          "author": "Meggy_bug",
          "body": "Sending virtual hugs :( Stay strong, don't worry, that point of no return is rare to happen, and (depending on person and case) in often reversible in many aspects. Also, thank you for being amazing parent to your daughter!! Sadly rare to have for people with ED's (Because parents and all people in society view ed similar to addicts/ \"junkies\" and in annoyed by them, sees the as stupid, shallow..)",
          "created_utc": 1721329341.0
        }
      ]
    },
    {
      "id": "ldw2jlw",
      "author": "Total_Strawberry_280",
      "body": "Thank you x",
      "created_utc": 1721369483.0,
      "score": 2,
      "context": [
        {
          "id": "ldtwwcp",
          "author": "madeleinetwocock",
          "body": "i don’t know what to say. i’ve been rendered speechless. but hear me when i say that i want to give you a big ol’ bear hug so incredibly badly. i’m so sorry - not only for her passing, but that you are experiencing this as well. grief is horrendous, complicated, and messy. i’m here for you if you ever need anyone to just talk to. always 🩶",
          "created_utc": 1721335934.0
        },
        {
          "id": "ldugcbi",
          "author": "Total_Strawberry_280",
          "body": "Thank you. Hugs x",
          "created_utc": 1721343652.0
        },
        {
          "id": "lduitkr",
          "author": "madeleinetwocock",
          "body": "🧸🫶🏻💌\n\nthinking about you. tons. have been since i saw your post.",
          "created_utc": 1721344593.0
        }
      ]
    },
    {
      "id": "leijjts",
      "author": "Meggy_bug",
      "body": "oh I understand :( You are really strong, and saved your daughter,  she's really amazing too! Very glad she's alright♡ I think your fate can be still good, do you gave Access to possible mental health treatment?\n\nhope for the Best for you🫂",
      "created_utc": 1721723652.0,
      "score": 2,
      "context": [
        {
          "id": "ldosjaj",
          "author": "Meggy_bug",
          "body": "Yess, not a doc but I remember after 8+ years Anorexia may be classified as terminal\n\n it is very sad and scary, but that is good your friend won't have to suffer anymore, anorexia taught me, that sometimes in life you can go too far, and cannot return and fix that later, your friend's illness sadly drove her to that no return point.. she choosen to be free of all of suffering and it's okay,, she can have peace now\n\n wish you well :( <3 I know it is hard",
          "created_utc": 1721257624.0
        },
        {
          "id": "ldqv95a",
          "author": "Eiffeltoren",
          "body": "Hello Meggy, that’s interesting about 8+ We have been fighting 5 years and got to almost recovery. I get your point that once you pushed the body too far, it might be too late. My daughter’s doctor said it is as if you swim for one island to another against the current. If you are too weak you never get to the other island.",
          "created_utc": 1721294216.0
        },
        {
          "id": "ldtcm3c",
          "author": "Meggy_bug",
          "body": "Sending virtual hugs :( Stay strong, don't worry, that point of no return is rare to happen, and (depending on person and case) in often reversible in many aspects. Also, thank you for being amazing parent to your daughter!! Sadly rare to have for people with ED's (Because parents and all people in society view ed similar to addicts/ \"junkies\" and in annoyed by them, sees the as stupid, shallow..)",
          "created_utc": 1721329341.0
        },
        {
          "id": "leg0cjv",
          "author": "Eiffeltoren",
          "body": "Dear Meg, thanks for your compliment. I had a severe depression and understand very well what a mental illness can do to a person. But even without it, parents should fight for their children especially if they are minors or young adults. But the thing is that I have been diagnosed with chronic fatigue syndrome 2 months ago. It’s a pity. My daughter is so much better after our fight, studies, Dances, works, adventures… but what about me now ? I accept my fate but it hurts sometimes.",
          "created_utc": 1721682910.0
        }
      ]
    },
    {
      "id": "leith0y",
      "author": "Eiffeltoren",
      "body": "Yes I have access to the best hospital in Europe but doctors say only psychotherapy helps. So it do this. Thanks for your kind words ❤️",
      "created_utc": 1721730230.0,
      "score": 3,
      "context": [
        {
          "id": "ldosjaj",
          "author": "Meggy_bug",
          "body": "Yess, not a doc but I remember after 8+ years Anorexia may be classified as terminal\n\n it is very sad and scary, but that is good your friend won't have to suffer anymore, anorexia taught me, that sometimes in life you can go too far, and cannot return and fix that later, your friend's illness sadly drove her to that no return point.. she choosen to be free of all of suffering and it's okay,, she can have peace now\n\n wish you well :( <3 I know it is hard",
          "created_utc": 1721257624.0
        },
        {
          "id": "ldqv95a",
          "author": "Eiffeltoren",
          "body": "Hello Meggy, that’s interesting about 8+ We have been fighting 5 years and got to almost recovery. I get your point that once you pushed the body too far, it might be too late. My daughter’s doctor said it is as if you swim for one island to another against the current. If you are too weak you never get to the other island.",
          "created_utc": 1721294216.0
        },
        {
          "id": "ldtcm3c",
          "author": "Meggy_bug",
          "body": "Sending virtual hugs :( Stay strong, don't worry, that point of no return is rare to happen, and (depending on person and case) in often reversible in many aspects. Also, thank you for being amazing parent to your daughter!! Sadly rare to have for people with ED's (Because parents and all people in society view ed similar to addicts/ \"junkies\" and in annoyed by them, sees the as stupid, shallow..)",
          "created_utc": 1721329341.0
        },
        {
          "id": "leg0cjv",
          "author": "Eiffeltoren",
          "body": "Dear Meg, thanks for your compliment. I had a severe depression and understand very well what a mental illness can do to a person. But even without it, parents should fight for their children especially if they are minors or young adults. But the thing is that I have been diagnosed with chronic fatigue syndrome 2 months ago. It’s a pity. My daughter is so much better after our fight, studies, Dances, works, adventures… but what about me now ? I accept my fate but it hurts sometimes.",
          "created_utc": 1721682910.0
        },
        {
          "id": "leijjts",
          "author": "Meggy_bug",
          "body": "oh I understand :( You are really strong, and saved your daughter,  she's really amazing too! Very glad she's alright♡ I think your fate can be still good, do you gave Access to possible mental health treatment?\n\nhope for the Best for you🫂",
          "created_utc": 1721723652.0
        }
      ]
    }
  ]
}