{
  "id": "1e85gcj",
  "subreddit": "AnorexiaNervosa",
  "author": "vellichxrr1021",
  "created_utc": 1721509059.0,
  "title": "goodbye : )",
  "selftext": "so much can change in less than a year. 9 months ago, i was close to death and struggling to eat anything but blueberries, protein powder, and oatmeal. it hurt to sit and lay down. i was always freezing and having to go to the hospital. not only that, but i was benched at the end of my school season and missed out on travel ball.\n\n\nnow i’m eating cookies in the middle of the day and going out after practice for slushies. i’m also going to be starting on my varsity team. i’m so much stronger and so much happier, i feel like im thriving. before, i thought that i would hate my body when it was weight restored, but i actually love it and i feel so pretty and lucky to have a healthy body. it took lots, and lots, and lots of pints of ice cream to get where i needed to be before my next school season began, but i actually made my goal of being a starter. i regret all the time i wasted, but i feel like im so much more grateful for everything i have now. \n\n\ni remember joining this group to look for validation or somebody to tell me that i needed to recover. i related so hard to every single post about physical and mental pain. looking through this group now, i sympathize with lots of posts but do not currently relate to them. it feels odd looking through these posts because i used to be the person writing them. anyways, i’m going to be leaving now and i really hope that the person reading this will also be able to leave someday, too❤️",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1e85gcj/goodbye/",
  "score": 275,
  "num_comments": 23,
  "comments": [
    {
      "id": "le4us0a",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1721509059.0,
      "score": 1,
      "context": []
    },
    {
      "id": "le4xq1p",
      "author": "maracujadodo",
      "body": "im so proud of you and happy for you!!!!! youre inspiring me to take my ED more seriously <3",
      "created_utc": 1721510185.0,
      "score": 36,
      "context": []
    },
    {
      "id": "le52wxa",
      "author": "raccoonsaff",
      "body": "This is absolutely amazing, and I hope you can stay well and keep on enjoying and loving life <3",
      "created_utc": 1721512215.0,
      "score": 9,
      "context": []
    },
    {
      "id": "le53liv",
      "author": "Far_Blueberry383",
      "body": "You are so amazing!!!! I hope you continue to thrive and get everywhere you want in life. 😊🫶🏻❤️",
      "created_utc": 1721512488.0,
      "score": 10,
      "context": []
    },
    {
      "id": "le57hd1",
      "author": "selkieflying",
      "body": "This makes me so happy 🩷 nothing is better than living a full life. Best of luck to you, my friend.",
      "created_utc": 1721514067.0,
      "score": 7,
      "context": []
    },
    {
      "id": "le5dpqz",
      "author": "None",
      "body": "I'm so happy for you :) thanks for the kind words and inspiration, it is appreciated ♡",
      "created_utc": 1721516616.0,
      "score": 6,
      "context": []
    },
    {
      "id": "le8bqql",
      "author": "SweetBabyMona",
      "body": "Thank you for your kind words and sharing your progress. I say this in the nicest, most loving way possible, I hope I truly never see you in this community ever again. Good luck, my friend!!",
      "created_utc": 1721572366.0,
      "score": 4,
      "context": []
    },
    {
      "id": "le5pkbj",
      "author": "zillabirdblue",
      "body": "I’m thrilled for you, congrats on your recovery! ❤️‍🩹",
      "created_utc": 1721521512.0,
      "score": 3,
      "context": []
    },
    {
      "id": "le6fuhx",
      "author": "Chemical_Twist_6575",
      "body": "You make me so proud OP. Lots of love, power and happiness to you. 💕💕",
      "created_utc": 1721533318.0,
      "score": 3,
      "context": []
    },
    {
      "id": "le70848",
      "author": "terrorbagoly",
      "body": "Well done! 🙌🏻❤️ Keep on winning!",
      "created_utc": 1721545072.0,
      "score": 3,
      "context": []
    },
    {
      "id": "le8296p",
      "author": "Soft-lamb",
      "body": "This is so so amazing. I wish you a happy, healthy life 🌞 May you live long and peaceful ❤❤",
      "created_utc": 1721568615.0,
      "score": 3,
      "context": []
    },
    {
      "id": "le70q48",
      "author": "Quirky_Top_8990",
      "body": "So proud of you.",
      "created_utc": 1721545400.0,
      "score": 2,
      "context": []
    },
    {
      "id": "le7mcnn",
      "author": "None",
      "body": "I’m so incredibly proud and happy for you❤️",
      "created_utc": 1721560404.0,
      "score": 2,
      "context": []
    },
    {
      "id": "le7qbpe",
      "author": "buildingbeautiful",
      "body": "❤️❤️❤️❤️",
      "created_utc": 1721562756.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lea21pu",
      "author": "AniKorn_Doge",
      "body": "Good job! \n\nA lil vent, I do not feel at I will ever be able to recover. I am kinda been trying for over a year now and I hate the weight gain. I hate my body again. I fell into a depressive episode a few months back and it feels horrible...",
      "created_utc": 1721593715.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lebtbjq",
      "author": "Little_Messiah",
      "body": "In proud of you honey",
      "created_utc": 1721618194.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lecwca3",
      "author": "badvibezforever_",
      "body": "♥️",
      "created_utc": 1721641844.0,
      "score": 2,
      "context": []
    },
    {
      "id": "leeiurl",
      "author": "urliterallysopretty",
      "body": "im so happy for u! ur amazing <3",
      "created_utc": 1721665989.0,
      "score": 2,
      "context": []
    },
    {
      "id": "leczonj",
      "author": "badvibezforever_",
      "body": "I am now currently recovering from malnutrition/anorexia (since the 12th of this month) and its so hard but I can do it! 💪but I am still saying no to food that I do not need (junk food) I am still in that cycle of forcing myself to not eat those kinda things and only eating those things when it's the end of the month (30th or 31st) and I'm also trying to gain muscle cause I lost some last month:( and I'm also busy with gaining weight rn 😅  so slowly but surely I will get there :) I wish myself the best of luck 🍀",
      "created_utc": 1721643992.0,
      "score": 1,
      "context": []
    },
    {
      "id": "le5345h",
      "author": "None",
      "body": "You're doing so awesome!!!! Even I'm still working on cookies and stuff (major fear food, and honestly, whenever I try them, they just don't taste them same) YOURE THE BEST <333",
      "created_utc": 1721512295.0,
      "score": 1,
      "context": []
    },
    {
      "id": "le57kio",
      "author": "vellichxrr1021",
      "body": "i used to not take mine seriously either but it is possible to become happy again—the sooner you start progressing the better it is. you got this!!",
      "created_utc": 1721514104.0,
      "score": 17,
      "context": [
        {
          "id": "le4xq1p",
          "author": "maracujadodo",
          "body": "im so proud of you and happy for you!!!!! youre inspiring me to take my ED more seriously <3",
          "created_utc": 1721510185.0
        }
      ]
    },
    {
      "id": "le53hsh",
      "author": "Far_Blueberry383",
      "body": "Omg same!!! I want so badly to be happy and healthy again….",
      "created_utc": 1721512446.0,
      "score": 7,
      "context": [
        {
          "id": "le4xq1p",
          "author": "maracujadodo",
          "body": "im so proud of you and happy for you!!!!! youre inspiring me to take my ED more seriously <3",
          "created_utc": 1721510185.0
        }
      ]
    }
  ]
}