{
  "id": "1edi9du",
  "subreddit": "AnorexiaNervosa",
  "author": "PineappleExpress4521",
  "created_utc": 1722092221.0,
  "title": "bloodwork results literally fat shaming me",
  "selftext": "my results have yet to be looked at by a doctor but my cholesterol is apparently as high as an obese man and i’m literally underweight but my mom is making jokes about it and i can’t do it i feel like a fat fucking whale now and i know i should be happy that nothing is obviously wrong with my bloodwork but im not why am i not sick enough yet?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1edi9du/bloodwork_results_literally_fat_shaming_me/",
  "score": 119,
  "num_comments": 55,
  "comments": [
    {
      "id": "lf732o8",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1722092221.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lf740tv",
      "author": "Excellent-World-476",
      "body": "It’s due to restriction. It is normal for anorexics.",
      "created_utc": 1722092557.0,
      "score": 216,
      "context": []
    },
    {
      "id": "lf848a7",
      "author": "zillabirdblue",
      "body": "When you starve your body eats your muscles. Think about what’s left, your body is trying to store fat to save your life. Don’t think high cholesterol can only happen to overweight people. You can still be underweight, even when you’re suffering malnutrition. That is why, not because you’re a “whale” which you aren’t. Please don’t let this make you spiral, I know it can. ❤️",
      "created_utc": 1722105428.0,
      "score": 36,
      "context": []
    },
    {
      "id": "lf882wu",
      "author": "Skythebluestars",
      "body": "Heey dont worry i had that too. Doctors dont have a clue. I was UW and high cholesterol and they told to mind my intake of fat. And fastfood. They did this bloodwork for my medications (was few years ago) i looked at them like.. do you even know anything..  \n\nJust let it goo.. they dont know shit.  They dont understand that restriction causes high cholesterol. \n\nDoctors are not educated enough about eating disorders and it causes more harm then good.",
      "created_utc": 1722106851.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lf7j5dy",
      "author": "MeMarieandI",
      "body": "Had the same thing. It's normal for people who restrict. Don't worry. But also, do worry and RECOVER. YOU CAN DO IT <3",
      "created_utc": 1722097926.0,
      "score": 37,
      "context": []
    },
    {
      "id": "lf7xiyx",
      "author": "rachrachcalero",
      "body": "It’s one of the greatest ironies of the disease!!",
      "created_utc": 1722103002.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lf73k3y",
      "author": "None",
      "body": "Thinking your not sick enough is a sign that there is definitely something wrong with you.",
      "created_utc": 1722092392.0,
      "score": 23,
      "context": []
    },
    {
      "id": "lf7n7hr",
      "author": "xaiyzu",
      "body": "This happened to me too, I felt all the shame of it lol\n\nI have genetic high cholesterol though, if you’ve had high cholesterol since before ana and have family history then this might be something worth looking into",
      "created_utc": 1722099378.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lf8nlkv",
      "author": "islandrebel",
      "body": "Cholesterol fluctuations happen because of factors that aren’t necessarily related to weight.",
      "created_utc": 1722112599.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lf8ge1b",
      "author": "cautionfreshpaint",
      "body": "100% restriction, i had the same thing!",
      "created_utc": 1722109947.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lf8vg8w",
      "author": "_nachtkalmar_",
      "body": "I am more shocked that your mother is cracking jokes about it. I would be super worried if you were my daughter. Is she often cruel to you? I'm very sorry about the situation and what sounds like a lack of support, I hope you can find it elsewhere you f this is a pattern with her, you deserve better.",
      "created_utc": 1722115539.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lf964fv",
      "author": "narcissisticmartyr",
      "body": "\"It could a\n be that lipoproteins [i.e., cholesterol ] are transporting fats in the body, which the body is relying on as fuel due to insufficient food intake. If the body is going to rely on fat as fuel, it needs some way to mobilize those fat molecules and get them to a location where they can be broken down effectively. This could perhaps explain the abnormal rise in cholesterol levels.\n\n\nSource: Edbites.blogspot.com",
      "created_utc": 1722119735.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lf9uszf",
      "author": "FreeAdvertising7450",
      "body": "High cholesterol is pretty typical for anorexia patients",
      "created_utc": 1722129878.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lfaaqw1",
      "author": "3germstar",
      "body": "I've always had high cholesterol when really study. Restricting can do some fucked up things to your body",
      "created_utc": 1722136902.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lf75qpl",
      "author": "That_Agent1983",
      "body": "Your mom is …",
      "created_utc": 1722093174.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lf8u4st",
      "author": "frankincentss",
      "body": "Just popping in to say that you’re so not alone in this. My cholesterol came back high and I was told to go on a low fat diet all while I was severely uw, it was disturbing asf to hear considering my eating habits. Sending lots of love :)",
      "created_utc": 1722115035.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lf8vkzm",
      "author": "hellookayyy",
      "body": "I had blood work come back like this recently- it sent me spiralling too. There are quite a few posts on reddit talking about the correlation of Anorexia and high cholesterol, it’s common apparently- read the book “sick enough” if you’re interested- it goes into the medical details.",
      "created_utc": 1722115589.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lf93a39",
      "author": "throwawaymyanalbeads",
      "body": "Same thing happened to me at 18-19 and i was also underweight.\n\n\n\n\nYou're not a whale, luv. You just have too high a count of the bad cholesterol.",
      "created_utc": 1722118582.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lfan0gj",
      "author": "Trick-Ad-9094",
      "body": "I also have high cholesterol, both kinds! My dietician said it’s normal w restriction and she explained something about liver enzymes but I didn’t really understand",
      "created_utc": 1722142981.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lfaqo38",
      "author": "collectedd",
      "body": "I've been there! Definitely not alone. Don't allow your brain to twist this, it's very common in anorexics.",
      "created_utc": 1722144976.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lf8xhcg",
      "author": "Odd-End-7236",
      "body": "girl sameeee",
      "created_utc": 1722116312.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfb1gg4",
      "author": "Listen_Successful",
      "body": "Yes it’s very common to have elevated cholesterol levels and liver enzymes in underweight long term restrictors.",
      "created_utc": 1722151789.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lf9rmx3",
      "author": "Dr_DG_Darkness-MDM",
      "body": "Hi, I'm in medical school right now and did biochemistry for my undergrad and can say that while diet does affect cholesterol, it's largely controlled by genetics. If it were me, I'd get an ApoB test (if your doctor knows what that is) because that will tell you more about your risk than a regular cholesterol test.",
      "created_utc": 1722128489.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lf77g1v",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1722093780.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lf7rehu",
      "author": "Ill-Bite-6864",
      "body": "Hey, it’s probably genetic!",
      "created_utc": 1722100856.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lf98d9l",
      "author": "duckfruits",
      "body": "High cholesterol is just as common with underweight people. It doesn't have as much to do with your weight as it does with the overall diet. If you eat foods high in cholesterol then you'll probably get higher cholesterol levels, regardless of quantity. Also, rapid weight loss and psychological stress can increase cholesterol levels too. It's not just an overweight thing. That's a super common misconception/association though.",
      "created_utc": 1722120640.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lf7w4f0",
      "author": "Odd_Incident7140",
      "body": "I am OW but restrict a lot and I’ve been UW most of my life until semi recently (recovery? Gained too much). Mines also high but the rest of my blood work shows malnutrition. It’s normal.",
      "created_utc": 1722102511.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lf8onuw",
      "author": "laurenthenurse20",
      "body": "Can be genetic too, try not to let it get to you! Can’t control your genes",
      "created_utc": 1722112987.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lfc4loz",
      "author": "Low-Bit2048",
      "body": "Generally, there are two causes for high cholesterol levels in blood: internal and external. External would be eating too much foods high in fat and cholesterol. Internal causes are when the body produces too much cholesterol. Most of the cholesterol in your body is made by your liver, and a small amount comes from your diet.\n\nSome people overproduce cholesterol when their dietary intake is not enough. Mine gets ridiculously high when I restrict for a long time.",
      "created_utc": 1722174928.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lfcjyyg",
      "author": "alexisseffy",
      "body": "I have AN and high cholesterol too, although only my HDL and total cholesterol is high and my HDL:LDL ratio is good. Idk why but I’ve heard it’s common in those of us with AN",
      "created_utc": 1722180587.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lfgseet",
      "author": "Sad-Street-6664",
      "body": "I always have high cholesterol and im anorexic. Its linked to heavy restriction.",
      "created_utc": 1722247701.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lfhsbhz",
      "author": "Sad-Event-4222",
      "body": "My cholesterol was high and I got fat shamed too. They don’t put two and two together unless you look like a bag of bones. It’s due to highly restrictive diet.",
      "created_utc": 1722264006.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgdapn5",
      "author": "Less_Constant4060",
      "body": "You are not alone!!! I'm going through the same shit, it could have been me writing this. Wow..   \nIt feels so invalidating :( My bloodworks showed high cholesterol today as well. I spiraled and felt like a big lump of butter only due to reading the results implying I'm not sick at all. I really relate to your post. Reading on this sub and hearing similar experiences really saved my day <3  hope you're ok though <3",
      "created_utc": 1741284663.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lf7475m",
      "author": "PineappleExpress4521",
      "body": "i know this sounds horrible but i’m actually very relieved to hear that thanks you 😭",
      "created_utc": 1722092618.0,
      "score": 100,
      "context": [
        {
          "id": "lf740tv",
          "author": "Excellent-World-476",
          "body": "It’s due to restriction. It is normal for anorexics.",
          "created_utc": 1722092557.0
        }
      ]
    },
    {
      "id": "lfe0qru",
      "author": "Classic_Livid",
      "body": "Why is this a thing?",
      "created_utc": 1722198815.0,
      "score": 2,
      "context": [
        {
          "id": "lf740tv",
          "author": "Excellent-World-476",
          "body": "It’s due to restriction. It is normal for anorexics.",
          "created_utc": 1722092557.0
        }
      ]
    },
    {
      "id": "lfrod13",
      "author": "InformalCollection27",
      "body": "This is so good to know. I'm an older female (relapsed after 30 years) whose cholesterol has been well controlled for a decade with one tiny pill a day. My most recent labs showed some vitamin deficiencies and HIGH cholesterol. I didn't understand. Here I am, a fully restrictive anorexic, with fat circulating in my blood! ",
      "created_utc": 1722402060.0,
      "score": 1,
      "context": [
        {
          "id": "lf740tv",
          "author": "Excellent-World-476",
          "body": "It’s due to restriction. It is normal for anorexics.",
          "created_utc": 1722092557.0
        }
      ]
    },
    {
      "id": "lf89zhd",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1722107562.0,
      "score": 2,
      "context": [
        {
          "id": "lf882wu",
          "author": "Skythebluestars",
          "body": "Heey dont worry i had that too. Doctors dont have a clue. I was UW and high cholesterol and they told to mind my intake of fat. And fastfood. They did this bloodwork for my medications (was few years ago) i looked at them like.. do you even know anything..  \n\nJust let it goo.. they dont know shit.  They dont understand that restriction causes high cholesterol. \n\nDoctors are not educated enough about eating disorders and it causes more harm then good.",
          "created_utc": 1722106851.0
        }
      ]
    },
    {
      "id": "lf94x1n",
      "author": "WideAtmosphere",
      "body": "Mine is borderline high for the same reason. My teeny little grandmother who was never overweight a day in her life was on statins for high cholesterol. Her diet was extremely healthy. It’s familial hypercholesterolemia. Thankfully my good cholesterol is high and bad is low. The doctor told me that was protective.",
      "created_utc": 1722119248.0,
      "score": 3,
      "context": [
        {
          "id": "lf7n7hr",
          "author": "xaiyzu",
          "body": "This happened to me too, I felt all the shame of it lol\n\nI have genetic high cholesterol though, if you’ve had high cholesterol since before ana and have family history then this might be something worth looking into",
          "created_utc": 1722099378.0
        }
      ]
    },
    {
      "id": "lf8voqn",
      "author": "PineappleExpress4521",
      "body": "shes not cruel i just dont think she understands how bad my health is physically which i dont blame her for because its not like im super open about it",
      "created_utc": 1722115629.0,
      "score": 1,
      "context": [
        {
          "id": "lf8vg8w",
          "author": "_nachtkalmar_",
          "body": "I am more shocked that your mother is cracking jokes about it. I would be super worried if you were my daughter. Is she often cruel to you? I'm very sorry about the situation and what sounds like a lack of support, I hope you can find it elsewhere you f this is a pattern with her, you deserve better.",
          "created_utc": 1722115539.0
        }
      ]
    },
    {
      "id": "lffu850",
      "author": "helpmykeyboardbroken",
      "body": "Some nutrients need fats to dissolve and need to be bonded to fat to move around the body. When you aren’t getting enough fat in your diet your liver increases your cholesterol levels to ensure there’s adequate fat in your blood so the nutrients you are getting can be moved and dissolved.",
      "created_utc": 1722225816.0,
      "score": 1,
      "context": [
        {
          "id": "lfan0gj",
          "author": "Trick-Ad-9094",
          "body": "I also have high cholesterol, both kinds! My dietician said it’s normal w restriction and she explained something about liver enzymes but I didn’t really understand",
          "created_utc": 1722142981.0
        }
      ]
    },
    {
      "id": "lf77v2x",
      "author": "PineappleExpress4521",
      "body": "i mean at least ur ripped??",
      "created_utc": 1722093924.0,
      "score": 10,
      "context": [
        {
          "id": "lf77g1v",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722093780.0
        }
      ]
    },
    {
      "id": "lf8eoib",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1722109310.0,
      "score": 1,
      "context": [
        {
          "id": "lf77g1v",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722093780.0
        }
      ]
    },
    {
      "id": "lfc5ffl",
      "author": "Low-Bit2048",
      "body": "I don't know why you got downvoted, it is genetic. Genetics are related to this phenomenon. Some people are genetically prone to high cholesterol when they restrict.",
      "created_utc": 1722175257.0,
      "score": 2,
      "context": [
        {
          "id": "lf7rehu",
          "author": "Ill-Bite-6864",
          "body": "Hey, it’s probably genetic!",
          "created_utc": 1722100856.0
        }
      ]
    },
    {
      "id": "lf74lkz",
      "author": "Excellent-World-476",
      "body": "So many people including doctors don’t understand this. It’s good to be educated.",
      "created_utc": 1722092763.0,
      "score": 69,
      "context": [
        {
          "id": "lf740tv",
          "author": "Excellent-World-476",
          "body": "It’s due to restriction. It is normal for anorexics.",
          "created_utc": 1722092557.0
        },
        {
          "id": "lf7475m",
          "author": "PineappleExpress4521",
          "body": "i know this sounds horrible but i’m actually very relieved to hear that thanks you 😭",
          "created_utc": 1722092618.0
        }
      ]
    },
    {
      "id": "lf777om",
      "author": "Scrunchkins317",
      "body": "Yes it’s very common. It’s happened to me countless times and to many of my friends who struggle too.",
      "created_utc": 1722093698.0,
      "score": 30,
      "context": [
        {
          "id": "lf740tv",
          "author": "Excellent-World-476",
          "body": "It’s due to restriction. It is normal for anorexics.",
          "created_utc": 1722092557.0
        },
        {
          "id": "lf7475m",
          "author": "PineappleExpress4521",
          "body": "i know this sounds horrible but i’m actually very relieved to hear that thanks you 😭",
          "created_utc": 1722092618.0
        }
      ]
    },
    {
      "id": "lffjf0k",
      "author": "Eastern_Bug5217",
      "body": "I would like to know too",
      "created_utc": 1722220691.0,
      "score": 1,
      "context": [
        {
          "id": "lf740tv",
          "author": "Excellent-World-476",
          "body": "It’s due to restriction. It is normal for anorexics.",
          "created_utc": 1722092557.0
        },
        {
          "id": "lfe0qru",
          "author": "Classic_Livid",
          "body": "Why is this a thing?",
          "created_utc": 1722198815.0
        }
      ]
    },
    {
      "id": "lf8erlm",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1722109342.0,
      "score": 2,
      "context": [
        {
          "id": "lf882wu",
          "author": "Skythebluestars",
          "body": "Heey dont worry i had that too. Doctors dont have a clue. I was UW and high cholesterol and they told to mind my intake of fat. And fastfood. They did this bloodwork for my medications (was few years ago) i looked at them like.. do you even know anything..  \n\nJust let it goo.. they dont know shit.  They dont understand that restriction causes high cholesterol. \n\nDoctors are not educated enough about eating disorders and it causes more harm then good.",
          "created_utc": 1722106851.0
        },
        {
          "id": "lf89zhd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722107562.0
        }
      ]
    },
    {
      "id": "lf9793p",
      "author": "xaiyzu",
      "body": "You lucked out with your genetics! So jealous lol. Thankfully my good is decently high and bad is not as bad as the others in my family. I've been taking statins since I was 14 and will probably be on them for life which is sad but hey, I'm ready to become your teeny little grandmother",
      "created_utc": 1722120189.0,
      "score": 3,
      "context": [
        {
          "id": "lf7n7hr",
          "author": "xaiyzu",
          "body": "This happened to me too, I felt all the shame of it lol\n\nI have genetic high cholesterol though, if you’ve had high cholesterol since before ana and have family history then this might be something worth looking into",
          "created_utc": 1722099378.0
        },
        {
          "id": "lf94x1n",
          "author": "WideAtmosphere",
          "body": "Mine is borderline high for the same reason. My teeny little grandmother who was never overweight a day in her life was on statins for high cholesterol. Her diet was extremely healthy. It’s familial hypercholesterolemia. Thankfully my good cholesterol is high and bad is low. The doctor told me that was protective.",
          "created_utc": 1722119248.0
        }
      ]
    },
    {
      "id": "lf7k0cu",
      "author": "starving_artist02",
      "body": "Thats why im so confused . Im like not even close im very uw and not even close to ripped but its because i used to not drink like at all so i didnt pee so all the protein stayed in my body",
      "created_utc": 1722098236.0,
      "score": 2,
      "context": [
        {
          "id": "lf77g1v",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722093780.0
        },
        {
          "id": "lf77v2x",
          "author": "PineappleExpress4521",
          "body": "i mean at least ur ripped??",
          "created_utc": 1722093924.0
        }
      ]
    },
    {
      "id": "lf7dv1w",
      "author": "Mammoth_Exam1354",
      "body": "There is an explanation for it and it makes sense.  I just don’t recall it.  It is also tied to why many anorexics sadly succumb to heart failure.  I am sorry.",
      "created_utc": 1722096022.0,
      "score": 36,
      "context": [
        {
          "id": "lf740tv",
          "author": "Excellent-World-476",
          "body": "It’s due to restriction. It is normal for anorexics.",
          "created_utc": 1722092557.0
        },
        {
          "id": "lf7475m",
          "author": "PineappleExpress4521",
          "body": "i know this sounds horrible but i’m actually very relieved to hear that thanks you 😭",
          "created_utc": 1722092618.0
        },
        {
          "id": "lf74lkz",
          "author": "Excellent-World-476",
          "body": "So many people including doctors don’t understand this. It’s good to be educated.",
          "created_utc": 1722092763.0
        }
      ]
    },
    {
      "id": "lf7kp8v",
      "author": "Melodramatic-anon876",
      "body": "If anyone does have an explanation I’d love to know as well",
      "created_utc": 1722098482.0,
      "score": 13,
      "context": [
        {
          "id": "lf740tv",
          "author": "Excellent-World-476",
          "body": "It’s due to restriction. It is normal for anorexics.",
          "created_utc": 1722092557.0
        },
        {
          "id": "lf7475m",
          "author": "PineappleExpress4521",
          "body": "i know this sounds horrible but i’m actually very relieved to hear that thanks you 😭",
          "created_utc": 1722092618.0
        },
        {
          "id": "lf777om",
          "author": "Scrunchkins317",
          "body": "Yes it’s very common. It’s happened to me countless times and to many of my friends who struggle too.",
          "created_utc": 1722093698.0
        }
      ]
    },
    {
      "id": "lfae3ys",
      "author": "WideAtmosphere",
      "body": "I hope you are to your grandchildren what my grandmother was to me! And she lived into her 80s! ♥️",
      "created_utc": 1722138503.0,
      "score": 3,
      "context": [
        {
          "id": "lf7n7hr",
          "author": "xaiyzu",
          "body": "This happened to me too, I felt all the shame of it lol\n\nI have genetic high cholesterol though, if you’ve had high cholesterol since before ana and have family history then this might be something worth looking into",
          "created_utc": 1722099378.0
        },
        {
          "id": "lf94x1n",
          "author": "WideAtmosphere",
          "body": "Mine is borderline high for the same reason. My teeny little grandmother who was never overweight a day in her life was on statins for high cholesterol. Her diet was extremely healthy. It’s familial hypercholesterolemia. Thankfully my good cholesterol is high and bad is low. The doctor told me that was protective.",
          "created_utc": 1722119248.0
        },
        {
          "id": "lf9793p",
          "author": "xaiyzu",
          "body": "You lucked out with your genetics! So jealous lol. Thankfully my good is decently high and bad is not as bad as the others in my family. I've been taking statins since I was 14 and will probably be on them for life which is sad but hey, I'm ready to become your teeny little grandmother",
          "created_utc": 1722120189.0
        }
      ]
    },
    {
      "id": "lf7k5ye",
      "author": "PineappleExpress4521",
      "body": "rlly that’s strange body’s r weird but i think i have the opposite problem where i drink so much nothing is staying in my body 😭",
      "created_utc": 1722098291.0,
      "score": 3,
      "context": [
        {
          "id": "lf77g1v",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722093780.0
        },
        {
          "id": "lf77v2x",
          "author": "PineappleExpress4521",
          "body": "i mean at least ur ripped??",
          "created_utc": 1722093924.0
        },
        {
          "id": "lf7k0cu",
          "author": "starving_artist02",
          "body": "Thats why im so confused . Im like not even close im very uw and not even close to ripped but its because i used to not drink like at all so i didnt pee so all the protein stayed in my body",
          "created_utc": 1722098236.0
        }
      ]
    },
    {
      "id": "lf7ldhi",
      "author": "Scrunchkins317",
      "body": "I found this [https://www.medicalnewstoday.com/articles/anorexia-cholesterol](https://www.medicalnewstoday.com/articles/anorexia-cholesterol)",
      "created_utc": 1722098723.0,
      "score": 17,
      "context": [
        {
          "id": "lf740tv",
          "author": "Excellent-World-476",
          "body": "It’s due to restriction. It is normal for anorexics.",
          "created_utc": 1722092557.0
        },
        {
          "id": "lf7475m",
          "author": "PineappleExpress4521",
          "body": "i know this sounds horrible but i’m actually very relieved to hear that thanks you 😭",
          "created_utc": 1722092618.0
        },
        {
          "id": "lf777om",
          "author": "Scrunchkins317",
          "body": "Yes it’s very common. It’s happened to me countless times and to many of my friends who struggle too.",
          "created_utc": 1722093698.0
        },
        {
          "id": "lf7kp8v",
          "author": "Melodramatic-anon876",
          "body": "If anyone does have an explanation I’d love to know as well",
          "created_utc": 1722098482.0
        }
      ]
    },
    {
      "id": "lfjjole",
      "author": "xaiyzu",
      "body": "This is so sweet!! I can tell your grandma was a wonderful person, thank you 🥹💗",
      "created_utc": 1722284368.0,
      "score": 1,
      "context": [
        {
          "id": "lf7n7hr",
          "author": "xaiyzu",
          "body": "This happened to me too, I felt all the shame of it lol\n\nI have genetic high cholesterol though, if you’ve had high cholesterol since before ana and have family history then this might be something worth looking into",
          "created_utc": 1722099378.0
        },
        {
          "id": "lf94x1n",
          "author": "WideAtmosphere",
          "body": "Mine is borderline high for the same reason. My teeny little grandmother who was never overweight a day in her life was on statins for high cholesterol. Her diet was extremely healthy. It’s familial hypercholesterolemia. Thankfully my good cholesterol is high and bad is low. The doctor told me that was protective.",
          "created_utc": 1722119248.0
        },
        {
          "id": "lf9793p",
          "author": "xaiyzu",
          "body": "You lucked out with your genetics! So jealous lol. Thankfully my good is decently high and bad is not as bad as the others in my family. I've been taking statins since I was 14 and will probably be on them for life which is sad but hey, I'm ready to become your teeny little grandmother",
          "created_utc": 1722120189.0
        },
        {
          "id": "lfae3ys",
          "author": "WideAtmosphere",
          "body": "I hope you are to your grandchildren what my grandmother was to me! And she lived into her 80s! ♥️",
          "created_utc": 1722138503.0
        }
      ]
    }
  ]
}