{
  "id": "1eg1at9",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1722365377.0,
  "title": "End stage anorexia",
  "selftext": "I have severe and enduring anorexia. I've suffered from it for 18 years. I never fully recovered. I tried inpatient treatment twice, but it didn't help me. I have autism as well, and the inpatient programs I went to did not take this into consideration at the time. I am experiencing severe medical complications from prolonged malnutrition, like an inability to digest nutrients properly from the food I eat. This is resulting in unintentional weight loss and stomach pain. I also have bladder issues and painful, frequent urination. Due to the embarrassment of the symptoms, I don't want to go to the hospital. These symptoms have been going on for three years and have not resolved. I am on palliative care for my eating disorder. My doctor has told me I could die if I don't turn things around and explained my body can't process the nutrients from food properly because of how long I have starved myself. She said it will take time for me to feel better and that I will have to push myself to eat more, despite the pain I am in. And that's very difficult. Because on days when I am in pain, it's hard to motivate myself to eat more. My parents had a hard time accepting the severity of my illness, and wouldn't take it seriously, until the nurse from palliative care explained it to them. They are very supportive, but I think it makes them sad to talk with me about this. They will take me to my doctors appointments, but don't want to listen to me when I explain to them how bad my pain is. My doctor is trying to get me set up with an online eating disorder program that works with people who have autism and anorexia. I just want the painful medical complications to go away. I try to eat more, but it doesn't make me feel better. My weight won't go up. I can't go through a day without feel pain and exhaustion. I don't want to get worse, but I feel I've been sick for so long, that I may not be able to completely reverse these medical complications. I know this is serious, but I have a fear of change. This fear of change makes me afraid of trying new things, new treatments. Talking to new doctors gives me anxiety. But I know if I do nothing, I will continue to decline. Can anyone relate? Anorexia is such a serious illness. Anyone who is struggling, I advise you to seek help as soon as you become ill. I was very stubborn and refused to listen to the doctors years ago, who told me I needed to treat this right away. I stayed sick for years, and now my behaviors are deeply entrenched and hard to break. Due to being autistic, I also have sensory sensitivities, rigid thinking, and issues with my hunger cues, which are things not typically addressed in anorexia treatment. I think being autistic makes my behaviors more engrained. I don't think recovering is impossible for me, but it is more difficult for me at this point. And that is why I need a treatment program tailored to fit my specific needs. Anorexia is a heartbreaking disorder. No one deserves to suffer with it. I do have a therapist and nutritionist and I hope the online program can offer me some advice about what to do. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1eg1at9/end_stage_anorexia/",
  "score": 175,
  "num_comments": 64,
  "comments": [
    {
      "id": "lfoxmgi",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1722365377.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lfp4f7w",
      "author": "jarosunshine",
      "body": "I'm so sorry you have to be in this situation. <3 I've been dealing with my ED for a ridiculously long time, too, and am at the point where the physical consequences are kicking my a$$, and it's miserable. \n\nIf you want to get your weight up and reduce your symptoms, I wonder if your team (or you) would consider nutrition options that might be more invasive but potentially more... tolerable... I'm referring to non-oral feeding like tube feeds or even TPN (nutrition through a large vessel) - it seems like those options may have the potential to bypass the parts of nourishing yourself that are so painful or that you have aversions to. Having more nutrition would improve your quality of life, even if the methods are a bit more invasive. \n\nI have heard a lot of folx have success with more flexible thinking patterns through RO-DBT - radically open DBT. \n\nI understand there is fear and discomfort around change, but I also hear discomfort and fear around continuing to do what you are doing. Not a comfy place to be. <3 \n\nAnd please don't let embarrassment keep you from getting the medical care you deserve. Having worked in healthcare most of my adult life, I can promise you that the majority of folx aren't judging folx like you for the conditions you're suffering with, we're judging the lewd, crude, and overtly disrespectful people. And if they are judging you, that says more about them than you. <3",
      "created_utc": 1722367520.0,
      "score": 52,
      "context": []
    },
    {
      "id": "lfpd1p5",
      "author": "InsidetheIvy13",
      "body": "As a fellow palliative/end stage sufferer I just want to let you know how valid your voice is and that in sharing your story I hope you can see you aren’t alone and whilst things feel very overwhelming and bleak there may be glimmers of support that others here can offer that can help comfort and hopefully guide you towards those first steps towards a better quality of life. I’m not certain of your location but in the UK there is a relatively new care pathway called the *PEACEpathway* they’ve been specially set up to deal with people and complex cases who have both autism and EDs, they have a range of resources that may help you, your family or your care team- even if you are out of country. \n\nI echo the sentiments of the other responder in that please don’t feel embarrassed - I know that’s easier said than done and I too have medical complications that cause me much shame -about seeking support, bodies fail in all sorts of ways for all sorts of reasons, medicine exists not to judge but to care and help. \n\nI don’t know if you’ve ever recieved enteral feeding - I’ve had a PEG for 12years, NGs before that, my advice would always be that if you can find ways to keep hold of an oral intake then do so as tubes come with many downsides, but equally if you have no other choice and it hasn’t been suggested then I’d propose asking your team why it couldn’t be at least a stabilising option for you.\n\nLastly if you still have hope please don’t allow any professional to erase that from you. Nobody should be forced into palliative care, or given up on because you have a lengthy or complex presentation. Palliative should be a collaborative decision never to be taken lightly and never used as an excuse to not continue to support or provide you with care. \n\nYour words highlight to me that you still have that inner fight to reclaim a life worth living, hold onto that, and whilst I know it can feel impossible to advocate for yourself you are allowed to need different care, tailored care, person centric care. You aren’t your disorder or labels, you deserve the right to heal and find a life that’s more than just enduring.",
      "created_utc": 1722370236.0,
      "score": 20,
      "context": []
    },
    {
      "id": "lfp7vc3",
      "author": "lrina_",
      "body": "i'm sorry about everything ):  i'm not doing too well myself so im not in a position to recommend anything, except don't decline treatment out of embarassment.  people who have been working in the medical field have seen all sorts of things, so bladder problems are a typical sight for them and nothing to be grossed out about since they've seen those types of issues many times.  best of luck to you!! hope it gets better!",
      "created_utc": 1722368612.0,
      "score": 19,
      "context": []
    },
    {
      "id": "lfpqqpu",
      "author": "Excellent-World-476",
      "body": "Where do you live?  I wonder if Acute would be an option?  It is the individual room based care for medical care. Don’t give up. I’ve been inpatient and residential more times then I can count but I am a different person now. Just because it didn’t help twice doesn’t mean it will never help.  Doctors and nurses will not judge things like incontinence. I experienced a time of not having bowel control and my nurses were lovely. Hang in there.",
      "created_utc": 1722374585.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lfqenm2",
      "author": "slut4almondmilkk",
      "body": "as someone who is also in palliative care and will eventually move to hospice and pass away from my anorexia, it selfishly helps to not feel alone. i hope you make whatever decision you feels is best and most manageable💜. it’s so lonely on my end to realize getting better isn’t in the cards for me and palliative care/hospice around anorexia is SO stigmatized. though i dont have good advice, thank you for starting this conversation!",
      "created_utc": 1722382983.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lfruek7",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1722405540.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lfsmk08",
      "author": "None",
      "body": "I can relate to a lot. I was diagnosed for 18 years. I haven't actually recovered, but did gain A LOT of weight in relation to specific things in just the past year. I still have the same disorder though some symptoms are different. \n\nIn my depths this helped me to manage it all: https://books.google.com/books?id=LtyjCwAAQBAJ&printsec=frontcover&dq=seed+anorexia+nervosa+harm+reduction+pdf&hl=en&newbks=1&newbks_redir=0&source=gb_mobile_search&sa=X&ved=2ahUKEwj38Jjjj9GHAxUTJjQIHehnAUUQ6AF6BAgNEAM#v=onepage&q&f=false\n\nIt is technically targeted towards clinicians. I applied what I could where I could and I was not recovered, but I was doing better/maintained a decent life.  I relate to a lot that you wrote. I have some other patient intended and general seed books via PDF.and some random publications. Let me know if you want further material. \n\nThis disorder is awful. Please keep trying.",
      "created_utc": 1722423864.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lfrxuut",
      "author": "sunmalone",
      "body": "Have you tried a fecal transplant? It could change your microbiomes and help with digestion, and maybe make it less painful. It’s worth the try imo",
      "created_utc": 1722407680.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lftg97s",
      "author": "YouAutruistic",
      "body": "I don't have advice, but I have autism and anorexia as well. I'm not fully recovered, but I'm past the worst of it I believe. The cognitive flexibility was hard to develop, but it's gotten much easier. This is a terrible battle to fight, sending strength and love.",
      "created_utc": 1722436132.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lfu5q2k",
      "author": "Low-Bit2048",
      "body": "Did your doctors speak to you about the option of getting your nutrition via a feeding tube or an IV? You could get better physically while you try to get better mentally. Having the mental toll of eating being lifted, it's easier to get better. You can learn to change your behavior little by little, without the stress of making huge changes at once.",
      "created_utc": 1722444352.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lfubfwa",
      "author": "Nemesis_xx",
      "body": "Iam autistic too and iam exactly in the same situation. I developed Crohn so even when I want to eat, I simply can’t without enduring hours of pain. I have days I can barely walk and I’m always so tired it’s unexplainable.. but.. I’m not ready to go.. Much strength to all!!",
      "created_utc": 1722446145.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lg0qkif",
      "author": "gdesuyis",
      "body": "i’m so sorry to hear this. i’m autistic too and have anorexia was diagnosed at 12 and now 28- it’s awful and mind numbing. i pray you find the right treatment. it’s a mission to find something catered to us autistic folk but it’s not impossible",
      "created_utc": 1722538750.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgc8wnf",
      "author": "InitiativeAfter1528",
      "body": "aww sorry you have suffered so long hun..try eating baby foods regularly as your digestion will be awfully slow as your body is slowly giving up and thats not a good sign love. while your heart is still beating you can totally reverse this. ive seen many die and its so sad..im also a anorexic in recovery babes so i understand. your will to live has to get stronger hun you deserve to be here happy healthy and glowing..big hugs time to kick anorexia in the butt once and for all. tell nurses your ready to work harder to recover..seek all therapys and resources available to you..even counceling..also what is your root cause? treat that as well as often anorexia is just a side effect to something more like trauma etc..you are loved hun lets do this together im getting well lets see you do it too😁",
      "created_utc": 1722711521.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lplcgae",
      "author": "Sunriseandset",
      "body": "Do you have terrible insomnia? I do, and I'm so tired of it. I'm so sorry you're going through this as well.",
      "created_utc": 1727663366.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lfpjfvd",
      "author": "Username_mel0",
      "body": "May I ask what the online program is? I only know of equip and within. I did within and found them wildly uninformed",
      "created_utc": 1722372230.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lfpxb4n",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1722376774.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mht7aji",
      "author": "kratio13",
      "body": "Thanks for getting through this, I'm so glad youre here <3",
      "created_utc": 1741984719.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mzgjed9",
      "author": "Freefromratfinks",
      "body": "I just want to say thank you for sharing and also, when you get very thin it does hurt. It increases pain\n\n\nYour connective tissue needs support!\n\n\nTry to eat more over time, but start with easily digestable things ",
      "created_utc": 1750739895.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfq272e",
      "author": "phoenix-girlx",
      "body": "I also have some permanent damage after 20 years of anorexia and it's irreversible. And I still don't care. I know I will die with anorexia. I am in mindset that I would rather die with anorexia than get better or recover. I hate myself, how I look. I wish I could just remove so much fatness I see. I know it's what I see and it's not what others see when they see me but it's only thing that I see.\nMy parents, I would say, still don't understand how far this has gone. And I have lax addiction for some time.\nI have several syndromes and physical chronic illnesses and it's so hard to live like this. I am not suicidal. I just know how I will end. And that is shitty. My life \"could\" look different and great but it didn't... Because it didn't.\n\nI also have high possibility of autism and have testing in October.",
      "created_utc": 1722378466.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfp5b5i",
      "author": "Coffeegreysky12",
      "body": "Thank you for the helpful advice. I will talk with my doctor about this. Yes, I have a fear and discomfort around change, but also fear around continuing to decline. I hope I can start to feel better. I won't let the embarrassment from the symptoms stop me from reaching out for support. Doing nothing is keeping me stuck and I really want to feel better",
      "created_utc": 1722367803.0,
      "score": 27,
      "context": [
        {
          "id": "lfp4f7w",
          "author": "jarosunshine",
          "body": "I'm so sorry you have to be in this situation. <3 I've been dealing with my ED for a ridiculously long time, too, and am at the point where the physical consequences are kicking my a$$, and it's miserable. \n\nIf you want to get your weight up and reduce your symptoms, I wonder if your team (or you) would consider nutrition options that might be more invasive but potentially more... tolerable... I'm referring to non-oral feeding like tube feeds or even TPN (nutrition through a large vessel) - it seems like those options may have the potential to bypass the parts of nourishing yourself that are so painful or that you have aversions to. Having more nutrition would improve your quality of life, even if the methods are a bit more invasive. \n\nI have heard a lot of folx have success with more flexible thinking patterns through RO-DBT - radically open DBT. \n\nI understand there is fear and discomfort around change, but I also hear discomfort and fear around continuing to do what you are doing. Not a comfy place to be. <3 \n\nAnd please don't let embarrassment keep you from getting the medical care you deserve. Having worked in healthcare most of my adult life, I can promise you that the majority of folx aren't judging folx like you for the conditions you're suffering with, we're judging the lewd, crude, and overtly disrespectful people. And if they are judging you, that says more about them than you. <3",
          "created_utc": 1722367520.0
        }
      ]
    },
    {
      "id": "lfqxb0w",
      "author": "Exotic_Lengthiness32",
      "body": "i was about to say!! tpn sounds like it could be very beneficial!",
      "created_utc": 1722390098.0,
      "score": 5,
      "context": [
        {
          "id": "lfp4f7w",
          "author": "jarosunshine",
          "body": "I'm so sorry you have to be in this situation. <3 I've been dealing with my ED for a ridiculously long time, too, and am at the point where the physical consequences are kicking my a$$, and it's miserable. \n\nIf you want to get your weight up and reduce your symptoms, I wonder if your team (or you) would consider nutrition options that might be more invasive but potentially more... tolerable... I'm referring to non-oral feeding like tube feeds or even TPN (nutrition through a large vessel) - it seems like those options may have the potential to bypass the parts of nourishing yourself that are so painful or that you have aversions to. Having more nutrition would improve your quality of life, even if the methods are a bit more invasive. \n\nI have heard a lot of folx have success with more flexible thinking patterns through RO-DBT - radically open DBT. \n\nI understand there is fear and discomfort around change, but I also hear discomfort and fear around continuing to do what you are doing. Not a comfy place to be. <3 \n\nAnd please don't let embarrassment keep you from getting the medical care you deserve. Having worked in healthcare most of my adult life, I can promise you that the majority of folx aren't judging folx like you for the conditions you're suffering with, we're judging the lewd, crude, and overtly disrespectful people. And if they are judging you, that says more about them than you. <3",
          "created_utc": 1722367520.0
        }
      ]
    },
    {
      "id": "lfpg28c",
      "author": "Coffeegreysky12",
      "body": "Thank you for the words of encouragement.  I've never had enteral feeding or a feeding tube. This was helpful to read. I am glad I am not alone in my struggles. I  do want to feel better and be happier. I think having treatment tailored to fit my needs will really help me.",
      "created_utc": 1722371176.0,
      "score": 11,
      "context": [
        {
          "id": "lfpd1p5",
          "author": "InsidetheIvy13",
          "body": "As a fellow palliative/end stage sufferer I just want to let you know how valid your voice is and that in sharing your story I hope you can see you aren’t alone and whilst things feel very overwhelming and bleak there may be glimmers of support that others here can offer that can help comfort and hopefully guide you towards those first steps towards a better quality of life. I’m not certain of your location but in the UK there is a relatively new care pathway called the *PEACEpathway* they’ve been specially set up to deal with people and complex cases who have both autism and EDs, they have a range of resources that may help you, your family or your care team- even if you are out of country. \n\nI echo the sentiments of the other responder in that please don’t feel embarrassed - I know that’s easier said than done and I too have medical complications that cause me much shame -about seeking support, bodies fail in all sorts of ways for all sorts of reasons, medicine exists not to judge but to care and help. \n\nI don’t know if you’ve ever recieved enteral feeding - I’ve had a PEG for 12years, NGs before that, my advice would always be that if you can find ways to keep hold of an oral intake then do so as tubes come with many downsides, but equally if you have no other choice and it hasn’t been suggested then I’d propose asking your team why it couldn’t be at least a stabilising option for you.\n\nLastly if you still have hope please don’t allow any professional to erase that from you. Nobody should be forced into palliative care, or given up on because you have a lengthy or complex presentation. Palliative should be a collaborative decision never to be taken lightly and never used as an excuse to not continue to support or provide you with care. \n\nYour words highlight to me that you still have that inner fight to reclaim a life worth living, hold onto that, and whilst I know it can feel impossible to advocate for yourself you are allowed to need different care, tailored care, person centric care. You aren’t your disorder or labels, you deserve the right to heal and find a life that’s more than just enduring.",
          "created_utc": 1722370236.0
        }
      ]
    },
    {
      "id": "lfpa2sk",
      "author": "Coffeegreysky12",
      "body": "Thank you for the support and I am sorry you are struggling too. This helped me feel better about it. I hope my treatment team can offer me some helpful advice.",
      "created_utc": 1722369308.0,
      "score": 7,
      "context": [
        {
          "id": "lfp7vc3",
          "author": "lrina_",
          "body": "i'm sorry about everything ):  i'm not doing too well myself so im not in a position to recommend anything, except don't decline treatment out of embarassment.  people who have been working in the medical field have seen all sorts of things, so bladder problems are a typical sight for them and nothing to be grossed out about since they've seen those types of issues many times.  best of luck to you!! hope it gets better!",
          "created_utc": 1722368612.0
        }
      ]
    },
    {
      "id": "lfpsb71",
      "author": "Coffeegreysky12",
      "body": "Thank you. I'm really afraid to go to the hospital, any type of hospital setting where I would be away from home. I was so uncomfortable the last two times I was hospitalized. I could hardly focus on getting better because I was so anxious. And the programs didn't take into consideration that I have autism and that I will respond differently to anorexia treatment. I think I have trauma from my last inpatient experiences. But I know all programs are different and I know they do work for some people. I would feel more comfortable staying at home and doing outpatient care.",
      "created_utc": 1722375103.0,
      "score": 2,
      "context": [
        {
          "id": "lfpqqpu",
          "author": "Excellent-World-476",
          "body": "Where do you live?  I wonder if Acute would be an option?  It is the individual room based care for medical care. Don’t give up. I’ve been inpatient and residential more times then I can count but I am a different person now. Just because it didn’t help twice doesn’t mean it will never help.  Doctors and nurses will not judge things like incontinence. I experienced a time of not having bowel control and my nurses were lovely. Hang in there.",
          "created_utc": 1722374585.0
        }
      ]
    },
    {
      "id": "lfqfmz5",
      "author": "Coffeegreysky12",
      "body": "I'm glad my post is helping others not feel alone. And I'm sorry for what you are going through. You are not alone. I also don't feel like getting completely better is a possibility for me at this point. But I do hope to manage some of these painful symptoms I experience. Palliative care/hospice care around anorexia should be discussed more than it is.",
      "created_utc": 1722383346.0,
      "score": 5,
      "context": [
        {
          "id": "lfqenm2",
          "author": "slut4almondmilkk",
          "body": "as someone who is also in palliative care and will eventually move to hospice and pass away from my anorexia, it selfishly helps to not feel alone. i hope you make whatever decision you feels is best and most manageable💜. it’s so lonely on my end to realize getting better isn’t in the cards for me and palliative care/hospice around anorexia is SO stigmatized. though i dont have good advice, thank you for starting this conversation!",
          "created_utc": 1722382983.0
        }
      ]
    },
    {
      "id": "lfsx9r0",
      "author": "Coffeegreysky12",
      "body": "Thank you for the support and advice",
      "created_utc": 1722428983.0,
      "score": 3,
      "context": [
        {
          "id": "lfruek7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722405540.0
        }
      ]
    },
    {
      "id": "lfsxcxx",
      "author": "Coffeegreysky12",
      "body": "Thank you for the helpful advice. I will keep trying",
      "created_utc": 1722429021.0,
      "score": 3,
      "context": [
        {
          "id": "lfsmk08",
          "author": "None",
          "body": "I can relate to a lot. I was diagnosed for 18 years. I haven't actually recovered, but did gain A LOT of weight in relation to specific things in just the past year. I still have the same disorder though some symptoms are different. \n\nIn my depths this helped me to manage it all: https://books.google.com/books?id=LtyjCwAAQBAJ&printsec=frontcover&dq=seed+anorexia+nervosa+harm+reduction+pdf&hl=en&newbks=1&newbks_redir=0&source=gb_mobile_search&sa=X&ved=2ahUKEwj38Jjjj9GHAxUTJjQIHehnAUUQ6AF6BAgNEAM#v=onepage&q&f=false\n\nIt is technically targeted towards clinicians. I applied what I could where I could and I was not recovered, but I was doing better/maintained a decent life.  I relate to a lot that you wrote. I have some other patient intended and general seed books via PDF.and some random publications. Let me know if you want further material. \n\nThis disorder is awful. Please keep trying.",
          "created_utc": 1722423864.0
        }
      ]
    },
    {
      "id": "m0xkx5j",
      "author": "Rectangular_Bird",
      "body": "Hi! I'm in a difficult situation as well and I think I could benefit from those materials. Could you share them with me?",
      "created_utc": 1733607099.0,
      "score": 2,
      "context": [
        {
          "id": "lfsmk08",
          "author": "None",
          "body": "I can relate to a lot. I was diagnosed for 18 years. I haven't actually recovered, but did gain A LOT of weight in relation to specific things in just the past year. I still have the same disorder though some symptoms are different. \n\nIn my depths this helped me to manage it all: https://books.google.com/books?id=LtyjCwAAQBAJ&printsec=frontcover&dq=seed+anorexia+nervosa+harm+reduction+pdf&hl=en&newbks=1&newbks_redir=0&source=gb_mobile_search&sa=X&ved=2ahUKEwj38Jjjj9GHAxUTJjQIHehnAUUQ6AF6BAgNEAM#v=onepage&q&f=false\n\nIt is technically targeted towards clinicians. I applied what I could where I could and I was not recovered, but I was doing better/maintained a decent life.  I relate to a lot that you wrote. I have some other patient intended and general seed books via PDF.and some random publications. Let me know if you want further material. \n\nThis disorder is awful. Please keep trying.",
          "created_utc": 1722423864.0
        }
      ]
    },
    {
      "id": "lft7ofm",
      "author": "Coffeegreysky12",
      "body": "No, i have not tried that",
      "created_utc": 1722433125.0,
      "score": 2,
      "context": [
        {
          "id": "lfrxuut",
          "author": "sunmalone",
          "body": "Have you tried a fecal transplant? It could change your microbiomes and help with digestion, and maybe make it less painful. It’s worth the try imo",
          "created_utc": 1722407680.0
        }
      ]
    },
    {
      "id": "lfthf7z",
      "author": "Coffeegreysky12",
      "body": "I am glad others can relate. Having autism and anorexia is so challenging. I am glad you are past the worst of it. I hope I can get past this too. It is a hard battle to fight. It's every minute of every day. And I wish there were more treatment options available for those with anorexia and autism. Thank you for the support.",
      "created_utc": 1722436525.0,
      "score": 1,
      "context": [
        {
          "id": "lftg97s",
          "author": "YouAutruistic",
          "body": "I don't have advice, but I have autism and anorexia as well. I'm not fully recovered, but I'm past the worst of it I believe. The cognitive flexibility was hard to develop, but it's gotten much easier. This is a terrible battle to fight, sending strength and love.",
          "created_utc": 1722436132.0
        }
      ]
    },
    {
      "id": "lfu7hoc",
      "author": "Coffeegreysky12",
      "body": "I have not talked to my doctor about it, but I have talked to the nurse from palliative care about it. I am a little worried about side effects from a feeding tube, if I were to get one. I will mention it to my doctor and see what she says. I have a big fear around trying different things. But I know I need to try something different at this point, because eating regular food doesn't appear to be helping me",
      "created_utc": 1722444902.0,
      "score": 2,
      "context": [
        {
          "id": "lfu5q2k",
          "author": "Low-Bit2048",
          "body": "Did your doctors speak to you about the option of getting your nutrition via a feeding tube or an IV? You could get better physically while you try to get better mentally. Having the mental toll of eating being lifted, it's easier to get better. You can learn to change your behavior little by little, without the stress of making huge changes at once.",
          "created_utc": 1722444352.0
        }
      ]
    },
    {
      "id": "lfuddxr",
      "author": "Coffeegreysky12",
      "body": "I am sorry you are going through pain too. I can relate to what you wrote.  I hope we can both start feeling better. I get so tired also. It's miserable. But I am trying to be positive and push through the pain. I really want to feel better",
      "created_utc": 1722446750.0,
      "score": 1,
      "context": [
        {
          "id": "lfubfwa",
          "author": "Nemesis_xx",
          "body": "Iam autistic too and iam exactly in the same situation. I developed Crohn so even when I want to eat, I simply can’t without enduring hours of pain. I have days I can barely walk and I’m always so tired it’s unexplainable.. but.. I’m not ready to go.. Much strength to all!!",
          "created_utc": 1722446145.0
        }
      ]
    },
    {
      "id": "lg0qx0z",
      "author": "Coffeegreysky12",
      "body": "Thank you. So true. I hope I find a treatment that works for both my autism and anorexia. Glad others can relate",
      "created_utc": 1722538861.0,
      "score": 2,
      "context": [
        {
          "id": "lg0qkif",
          "author": "gdesuyis",
          "body": "i’m so sorry to hear this. i’m autistic too and have anorexia was diagnosed at 12 and now 28- it’s awful and mind numbing. i pray you find the right treatment. it’s a mission to find something catered to us autistic folk but it’s not impossible",
          "created_utc": 1722538750.0
        }
      ]
    },
    {
      "id": "lgca27n",
      "author": "Coffeegreysky12",
      "body": "Thank you for the support. I appreciate it. I do want to live a long time and feel better. It's such an awful disorder. I will keep trying. Some days, it's very difficult. I'm not sure what my root cause is, but I know it's hard to stop the eating disorder behaviors completely. I want to turn this around and feel healthier and stronger. I am glad you are getting well. I hope I can get well too.",
      "created_utc": 1722711928.0,
      "score": 2,
      "context": [
        {
          "id": "lgc8wnf",
          "author": "InitiativeAfter1528",
          "body": "aww sorry you have suffered so long hun..try eating baby foods regularly as your digestion will be awfully slow as your body is slowly giving up and thats not a good sign love. while your heart is still beating you can totally reverse this. ive seen many die and its so sad..im also a anorexic in recovery babes so i understand. your will to live has to get stronger hun you deserve to be here happy healthy and glowing..big hugs time to kick anorexia in the butt once and for all. tell nurses your ready to work harder to recover..seek all therapys and resources available to you..even counceling..also what is your root cause? treat that as well as often anorexia is just a side effect to something more like trauma etc..you are loved hun lets do this together im getting well lets see you do it too😁",
          "created_utc": 1722711521.0
        }
      ]
    },
    {
      "id": "lpz1adv",
      "author": "Coffeegreysky12",
      "body": "Yes, I do have insomnia. I am sorry you struggle as well",
      "created_utc": 1727875692.0,
      "score": 1,
      "context": [
        {
          "id": "lplcgae",
          "author": "Sunriseandset",
          "body": "Do you have terrible insomnia? I do, and I'm so tired of it. I'm so sorry you're going through this as well.",
          "created_utc": 1727663366.0
        }
      ]
    },
    {
      "id": "lfpjor1",
      "author": "Coffeegreysky12",
      "body": "I think it's equip health.",
      "created_utc": 1722372306.0,
      "score": 5,
      "context": [
        {
          "id": "lfpjfvd",
          "author": "Username_mel0",
          "body": "May I ask what the online program is? I only know of equip and within. I did within and found them wildly uninformed",
          "created_utc": 1722372230.0
        }
      ]
    },
    {
      "id": "lfpyivn",
      "author": "Coffeegreysky12",
      "body": "Thank you. Well said. It is nice to know that I am not alone in my fears and distress and that others with anorexia understand. Anorexia is about control and getting treatment takes away some of that control. Of course that is scary to a person with an eating disorder. Thank you for the words of encouragement. I hope the online program helps me. And I will continue to remain hopeful that things can improve for me",
      "created_utc": 1722377188.0,
      "score": 1,
      "context": [
        {
          "id": "lfpxb4n",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1722376774.0
        }
      ]
    },
    {
      "id": "mht9ek7",
      "author": "Coffeegreysky12",
      "body": "Thank you. I appreciate the support",
      "created_utc": 1741985343.0,
      "score": 1,
      "context": [
        {
          "id": "mht7aji",
          "author": "kratio13",
          "body": "Thanks for getting through this, I'm so glad youre here <3",
          "created_utc": 1741984719.0
        }
      ]
    },
    {
      "id": "mzi8yh6",
      "author": "Coffeegreysky12",
      "body": "Thank you for the advice and support",
      "created_utc": 1750770583.0,
      "score": 1,
      "context": [
        {
          "id": "mzgjed9",
          "author": "Freefromratfinks",
          "body": "I just want to say thank you for sharing and also, when you get very thin it does hurt. It increases pain\n\n\nYour connective tissue needs support!\n\n\nTry to eat more over time, but start with easily digestable things ",
          "created_utc": 1750739895.0
        }
      ]
    },
    {
      "id": "mzi9a25",
      "author": "Coffeegreysky12",
      "body": "Thank you for the advice",
      "created_utc": 1750770691.0,
      "score": 1,
      "context": [
        {
          "id": "mzgjed9",
          "author": "Freefromratfinks",
          "body": "I just want to say thank you for sharing and also, when you get very thin it does hurt. It increases pain\n\n\nYour connective tissue needs support!\n\n\nTry to eat more over time, but start with easily digestable things ",
          "created_utc": 1750739895.0
        }
      ]
    },
    {
      "id": "lfq3fif",
      "author": "Coffeegreysky12",
      "body": "I'm sorry you are going through this as well. It's very hard to live like this. It's a physical, mental and emotional pain people without anorexia will never understand. I hope things improve, for both of us. My friend died of anorexia. Anorexia is a scary illness. I am trying to be positive and fight this, even though it's very hard sometimes. I hope you start feeling better.",
      "created_utc": 1722378903.0,
      "score": 7,
      "context": [
        {
          "id": "lfq272e",
          "author": "phoenix-girlx",
          "body": "I also have some permanent damage after 20 years of anorexia and it's irreversible. And I still don't care. I know I will die with anorexia. I am in mindset that I would rather die with anorexia than get better or recover. I hate myself, how I look. I wish I could just remove so much fatness I see. I know it's what I see and it's not what others see when they see me but it's only thing that I see.\nMy parents, I would say, still don't understand how far this has gone. And I have lax addiction for some time.\nI have several syndromes and physical chronic illnesses and it's so hard to live like this. I am not suicidal. I just know how I will end. And that is shitty. My life \"could\" look different and great but it didn't... Because it didn't.\n\nI also have high possibility of autism and have testing in October.",
          "created_utc": 1722378466.0
        }
      ]
    },
    {
      "id": "lfsipe8",
      "author": "Pro_Ana_Online",
      "body": "I will also second ro-dbt for those specifically with autism w/ anorexia nervosa. What works for those with binge eating and/or  bulimia (dbt) is deathly for those with anorexia...especially exacerbated with autism. There are good videos on youtube about ro-dbt I would encourage you to check out. Here's one:\n\n[https://youtu.be/oBDlhAVqiDc?si=XWA07pjD0cLV129R&t=220](https://youtu.be/oBDlhAVqiDc?si=XWA07pjD0cLV129R&t=220)\n\nThere's also a ro-dbt vs dbt recommendation quiz you can take here:\n\n[https://guidepostdbt.com/ro-dbt-quiz](https://guidepostdbt.com/ro-dbt-quiz)\n\nYou get the results even without enter a real email, but if you include your email you get your answers to all the questions and you can see your scoring scale. The place that has this quiz offers both dbt and ro-dbt so that hopefully means the quiz is not be biased.\n\nWith your body in such an awful state and things looking helpless your mind is the biggest thing you can still influence at this point in my book and to me that's never worth giving up on no matter the prognosis for one's body.",
      "created_utc": 1722421638.0,
      "score": 5,
      "context": [
        {
          "id": "lfp4f7w",
          "author": "jarosunshine",
          "body": "I'm so sorry you have to be in this situation. <3 I've been dealing with my ED for a ridiculously long time, too, and am at the point where the physical consequences are kicking my a$$, and it's miserable. \n\nIf you want to get your weight up and reduce your symptoms, I wonder if your team (or you) would consider nutrition options that might be more invasive but potentially more... tolerable... I'm referring to non-oral feeding like tube feeds or even TPN (nutrition through a large vessel) - it seems like those options may have the potential to bypass the parts of nourishing yourself that are so painful or that you have aversions to. Having more nutrition would improve your quality of life, even if the methods are a bit more invasive. \n\nI have heard a lot of folx have success with more flexible thinking patterns through RO-DBT - radically open DBT. \n\nI understand there is fear and discomfort around change, but I also hear discomfort and fear around continuing to do what you are doing. Not a comfy place to be. <3 \n\nAnd please don't let embarrassment keep you from getting the medical care you deserve. Having worked in healthcare most of my adult life, I can promise you that the majority of folx aren't judging folx like you for the conditions you're suffering with, we're judging the lewd, crude, and overtly disrespectful people. And if they are judging you, that says more about them than you. <3",
          "created_utc": 1722367520.0
        },
        {
          "id": "lfp5b5i",
          "author": "Coffeegreysky12",
          "body": "Thank you for the helpful advice. I will talk with my doctor about this. Yes, I have a fear and discomfort around change, but also fear around continuing to decline. I hope I can start to feel better. I won't let the embarrassment from the symptoms stop me from reaching out for support. Doing nothing is keeping me stuck and I really want to feel better",
          "created_utc": 1722367803.0
        }
      ]
    },
    {
      "id": "lfpk3ae",
      "author": "InsidetheIvy13",
      "body": "Hold onto that hope and stay true to yourself- you aren’t supposed to fit into a box, none of us are the typical textbook cases, needing different care does not make you a burden or be a responsibility you have to hold alone. Please do look at the PEACEpathway if you can, especially as nobody should be deeming you as end stage/palliative when there are treatment avenues that haven’t been explored for you. Keep talking, to your family, your care providers and here if you need to.",
      "created_utc": 1722372431.0,
      "score": 8,
      "context": [
        {
          "id": "lfpd1p5",
          "author": "InsidetheIvy13",
          "body": "As a fellow palliative/end stage sufferer I just want to let you know how valid your voice is and that in sharing your story I hope you can see you aren’t alone and whilst things feel very overwhelming and bleak there may be glimmers of support that others here can offer that can help comfort and hopefully guide you towards those first steps towards a better quality of life. I’m not certain of your location but in the UK there is a relatively new care pathway called the *PEACEpathway* they’ve been specially set up to deal with people and complex cases who have both autism and EDs, they have a range of resources that may help you, your family or your care team- even if you are out of country. \n\nI echo the sentiments of the other responder in that please don’t feel embarrassed - I know that’s easier said than done and I too have medical complications that cause me much shame -about seeking support, bodies fail in all sorts of ways for all sorts of reasons, medicine exists not to judge but to care and help. \n\nI don’t know if you’ve ever recieved enteral feeding - I’ve had a PEG for 12years, NGs before that, my advice would always be that if you can find ways to keep hold of an oral intake then do so as tubes come with many downsides, but equally if you have no other choice and it hasn’t been suggested then I’d propose asking your team why it couldn’t be at least a stabilising option for you.\n\nLastly if you still have hope please don’t allow any professional to erase that from you. Nobody should be forced into palliative care, or given up on because you have a lengthy or complex presentation. Palliative should be a collaborative decision never to be taken lightly and never used as an excuse to not continue to support or provide you with care. \n\nYour words highlight to me that you still have that inner fight to reclaim a life worth living, hold onto that, and whilst I know it can feel impossible to advocate for yourself you are allowed to need different care, tailored care, person centric care. You aren’t your disorder or labels, you deserve the right to heal and find a life that’s more than just enduring.",
          "created_utc": 1722370236.0
        },
        {
          "id": "lfpg28c",
          "author": "Coffeegreysky12",
          "body": "Thank you for the words of encouragement.  I've never had enteral feeding or a feeding tube. This was helpful to read. I am glad I am not alone in my struggles. I  do want to feel better and be happier. I think having treatment tailored to fit my needs will really help me.",
          "created_utc": 1722371176.0
        }
      ]
    },
    {
      "id": "lfpsj43",
      "author": "Excellent-World-476",
      "body": "I did a lot of research before going residential last time. I called and asked questions to make sure it addressed my needs.  That was very helpful.",
      "created_utc": 1722375177.0,
      "score": 6,
      "context": [
        {
          "id": "lfpqqpu",
          "author": "Excellent-World-476",
          "body": "Where do you live?  I wonder if Acute would be an option?  It is the individual room based care for medical care. Don’t give up. I’ve been inpatient and residential more times then I can count but I am a different person now. Just because it didn’t help twice doesn’t mean it will never help.  Doctors and nurses will not judge things like incontinence. I experienced a time of not having bowel control and my nurses were lovely. Hang in there.",
          "created_utc": 1722374585.0
        },
        {
          "id": "lfpsb71",
          "author": "Coffeegreysky12",
          "body": "Thank you. I'm really afraid to go to the hospital, any type of hospital setting where I would be away from home. I was so uncomfortable the last two times I was hospitalized. I could hardly focus on getting better because I was so anxious. And the programs didn't take into consideration that I have autism and that I will respond differently to anorexia treatment. I think I have trauma from my last inpatient experiences. But I know all programs are different and I know they do work for some people. I would feel more comfortable staying at home and doing outpatient care.",
          "created_utc": 1722375103.0
        }
      ]
    },
    {
      "id": "lfsy6kj",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1722429373.0,
      "score": 3,
      "context": [
        {
          "id": "lfruek7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722405540.0
        },
        {
          "id": "lfsx9r0",
          "author": "Coffeegreysky12",
          "body": "Thank you for the support and advice",
          "created_utc": 1722428983.0
        }
      ]
    },
    {
      "id": "m0zl0un",
      "author": "None",
      "body": "I believe the specific book linked is still available for purchase,  but am not sure the cost. I referred to others as well, and can add those titles if that would be helpful(?). \n\nAssuming I still have all of the titles, otherwise I can do what I am able to.",
      "created_utc": 1733634384.0,
      "score": 1,
      "context": [
        {
          "id": "lfsmk08",
          "author": "None",
          "body": "I can relate to a lot. I was diagnosed for 18 years. I haven't actually recovered, but did gain A LOT of weight in relation to specific things in just the past year. I still have the same disorder though some symptoms are different. \n\nIn my depths this helped me to manage it all: https://books.google.com/books?id=LtyjCwAAQBAJ&printsec=frontcover&dq=seed+anorexia+nervosa+harm+reduction+pdf&hl=en&newbks=1&newbks_redir=0&source=gb_mobile_search&sa=X&ved=2ahUKEwj38Jjjj9GHAxUTJjQIHehnAUUQ6AF6BAgNEAM#v=onepage&q&f=false\n\nIt is technically targeted towards clinicians. I applied what I could where I could and I was not recovered, but I was doing better/maintained a decent life.  I relate to a lot that you wrote. I have some other patient intended and general seed books via PDF.and some random publications. Let me know if you want further material. \n\nThis disorder is awful. Please keep trying.",
          "created_utc": 1722423864.0
        },
        {
          "id": "m0xkx5j",
          "author": "Rectangular_Bird",
          "body": "Hi! I'm in a difficult situation as well and I think I could benefit from those materials. Could you share them with me?",
          "created_utc": 1733607099.0
        }
      ]
    },
    {
      "id": "lg0r3z2",
      "author": "gdesuyis",
      "body": "i wish you all the best on your journey",
      "created_utc": 1722538923.0,
      "score": 2,
      "context": [
        {
          "id": "lg0qkif",
          "author": "gdesuyis",
          "body": "i’m so sorry to hear this. i’m autistic too and have anorexia was diagnosed at 12 and now 28- it’s awful and mind numbing. i pray you find the right treatment. it’s a mission to find something catered to us autistic folk but it’s not impossible",
          "created_utc": 1722538750.0
        },
        {
          "id": "lg0qx0z",
          "author": "Coffeegreysky12",
          "body": "Thank you. So true. I hope I find a treatment that works for both my autism and anorexia. Glad others can relate",
          "created_utc": 1722538861.0
        }
      ]
    },
    {
      "id": "lktso6q",
      "author": "InitiativeAfter1528",
      "body": "you absolutely can hun...have faith in yourself you can do it..big hugs..",
      "created_utc": 1725109910.0,
      "score": 2,
      "context": [
        {
          "id": "lgc8wnf",
          "author": "InitiativeAfter1528",
          "body": "aww sorry you have suffered so long hun..try eating baby foods regularly as your digestion will be awfully slow as your body is slowly giving up and thats not a good sign love. while your heart is still beating you can totally reverse this. ive seen many die and its so sad..im also a anorexic in recovery babes so i understand. your will to live has to get stronger hun you deserve to be here happy healthy and glowing..big hugs time to kick anorexia in the butt once and for all. tell nurses your ready to work harder to recover..seek all therapys and resources available to you..even counceling..also what is your root cause? treat that as well as often anorexia is just a side effect to something more like trauma etc..you are loved hun lets do this together im getting well lets see you do it too😁",
          "created_utc": 1722711521.0
        },
        {
          "id": "lgca27n",
          "author": "Coffeegreysky12",
          "body": "Thank you for the support. I appreciate it. I do want to live a long time and feel better. It's such an awful disorder. I will keep trying. Some days, it's very difficult. I'm not sure what my root cause is, but I know it's hard to stop the eating disorder behaviors completely. I want to turn this around and feel healthier and stronger. I am glad you are getting well. I hope I can get well too.",
          "created_utc": 1722711928.0
        }
      ]
    },
    {
      "id": "lfsz23k",
      "author": "Coffeegreysky12",
      "body": "Thank you for the advice. This was helpful. I will keep trying to get better",
      "created_utc": 1722429739.0,
      "score": 2,
      "context": [
        {
          "id": "lfp4f7w",
          "author": "jarosunshine",
          "body": "I'm so sorry you have to be in this situation. <3 I've been dealing with my ED for a ridiculously long time, too, and am at the point where the physical consequences are kicking my a$$, and it's miserable. \n\nIf you want to get your weight up and reduce your symptoms, I wonder if your team (or you) would consider nutrition options that might be more invasive but potentially more... tolerable... I'm referring to non-oral feeding like tube feeds or even TPN (nutrition through a large vessel) - it seems like those options may have the potential to bypass the parts of nourishing yourself that are so painful or that you have aversions to. Having more nutrition would improve your quality of life, even if the methods are a bit more invasive. \n\nI have heard a lot of folx have success with more flexible thinking patterns through RO-DBT - radically open DBT. \n\nI understand there is fear and discomfort around change, but I also hear discomfort and fear around continuing to do what you are doing. Not a comfy place to be. <3 \n\nAnd please don't let embarrassment keep you from getting the medical care you deserve. Having worked in healthcare most of my adult life, I can promise you that the majority of folx aren't judging folx like you for the conditions you're suffering with, we're judging the lewd, crude, and overtly disrespectful people. And if they are judging you, that says more about them than you. <3",
          "created_utc": 1722367520.0
        },
        {
          "id": "lfp5b5i",
          "author": "Coffeegreysky12",
          "body": "Thank you for the helpful advice. I will talk with my doctor about this. Yes, I have a fear and discomfort around change, but also fear around continuing to decline. I hope I can start to feel better. I won't let the embarrassment from the symptoms stop me from reaching out for support. Doing nothing is keeping me stuck and I really want to feel better",
          "created_utc": 1722367803.0
        },
        {
          "id": "lfsipe8",
          "author": "Pro_Ana_Online",
          "body": "I will also second ro-dbt for those specifically with autism w/ anorexia nervosa. What works for those with binge eating and/or  bulimia (dbt) is deathly for those with anorexia...especially exacerbated with autism. There are good videos on youtube about ro-dbt I would encourage you to check out. Here's one:\n\n[https://youtu.be/oBDlhAVqiDc?si=XWA07pjD0cLV129R&t=220](https://youtu.be/oBDlhAVqiDc?si=XWA07pjD0cLV129R&t=220)\n\nThere's also a ro-dbt vs dbt recommendation quiz you can take here:\n\n[https://guidepostdbt.com/ro-dbt-quiz](https://guidepostdbt.com/ro-dbt-quiz)\n\nYou get the results even without enter a real email, but if you include your email you get your answers to all the questions and you can see your scoring scale. The place that has this quiz offers both dbt and ro-dbt so that hopefully means the quiz is not be biased.\n\nWith your body in such an awful state and things looking helpless your mind is the biggest thing you can still influence at this point in my book and to me that's never worth giving up on no matter the prognosis for one's body.",
          "created_utc": 1722421638.0
        }
      ]
    },
    {
      "id": "lfplbnb",
      "author": "Coffeegreysky12",
      "body": "Thank you. I will try to remain hopeful and positive. I don't want to get worse. And I want to improve my quality of life and find relief from the painful symptoms I am experiencing. I am glad I am not alone in this",
      "created_utc": 1722372816.0,
      "score": 8,
      "context": [
        {
          "id": "lfpd1p5",
          "author": "InsidetheIvy13",
          "body": "As a fellow palliative/end stage sufferer I just want to let you know how valid your voice is and that in sharing your story I hope you can see you aren’t alone and whilst things feel very overwhelming and bleak there may be glimmers of support that others here can offer that can help comfort and hopefully guide you towards those first steps towards a better quality of life. I’m not certain of your location but in the UK there is a relatively new care pathway called the *PEACEpathway* they’ve been specially set up to deal with people and complex cases who have both autism and EDs, they have a range of resources that may help you, your family or your care team- even if you are out of country. \n\nI echo the sentiments of the other responder in that please don’t feel embarrassed - I know that’s easier said than done and I too have medical complications that cause me much shame -about seeking support, bodies fail in all sorts of ways for all sorts of reasons, medicine exists not to judge but to care and help. \n\nI don’t know if you’ve ever recieved enteral feeding - I’ve had a PEG for 12years, NGs before that, my advice would always be that if you can find ways to keep hold of an oral intake then do so as tubes come with many downsides, but equally if you have no other choice and it hasn’t been suggested then I’d propose asking your team why it couldn’t be at least a stabilising option for you.\n\nLastly if you still have hope please don’t allow any professional to erase that from you. Nobody should be forced into palliative care, or given up on because you have a lengthy or complex presentation. Palliative should be a collaborative decision never to be taken lightly and never used as an excuse to not continue to support or provide you with care. \n\nYour words highlight to me that you still have that inner fight to reclaim a life worth living, hold onto that, and whilst I know it can feel impossible to advocate for yourself you are allowed to need different care, tailored care, person centric care. You aren’t your disorder or labels, you deserve the right to heal and find a life that’s more than just enduring.",
          "created_utc": 1722370236.0
        },
        {
          "id": "lfpg28c",
          "author": "Coffeegreysky12",
          "body": "Thank you for the words of encouragement.  I've never had enteral feeding or a feeding tube. This was helpful to read. I am glad I am not alone in my struggles. I  do want to feel better and be happier. I think having treatment tailored to fit my needs will really help me.",
          "created_utc": 1722371176.0
        },
        {
          "id": "lfpk3ae",
          "author": "InsidetheIvy13",
          "body": "Hold onto that hope and stay true to yourself- you aren’t supposed to fit into a box, none of us are the typical textbook cases, needing different care does not make you a burden or be a responsibility you have to hold alone. Please do look at the PEACEpathway if you can, especially as nobody should be deeming you as end stage/palliative when there are treatment avenues that haven’t been explored for you. Keep talking, to your family, your care providers and here if you need to.",
          "created_utc": 1722372431.0
        }
      ]
    },
    {
      "id": "lfpt2ms",
      "author": "Excellent-World-476",
      "body": "There are programs that are better with autism than others. I know it can be hard. My last admission one of my peers was autistic and they handled it well.",
      "created_utc": 1722375358.0,
      "score": 5,
      "context": [
        {
          "id": "lfpqqpu",
          "author": "Excellent-World-476",
          "body": "Where do you live?  I wonder if Acute would be an option?  It is the individual room based care for medical care. Don’t give up. I’ve been inpatient and residential more times then I can count but I am a different person now. Just because it didn’t help twice doesn’t mean it will never help.  Doctors and nurses will not judge things like incontinence. I experienced a time of not having bowel control and my nurses were lovely. Hang in there.",
          "created_utc": 1722374585.0
        },
        {
          "id": "lfpsb71",
          "author": "Coffeegreysky12",
          "body": "Thank you. I'm really afraid to go to the hospital, any type of hospital setting where I would be away from home. I was so uncomfortable the last two times I was hospitalized. I could hardly focus on getting better because I was so anxious. And the programs didn't take into consideration that I have autism and that I will respond differently to anorexia treatment. I think I have trauma from my last inpatient experiences. But I know all programs are different and I know they do work for some people. I would feel more comfortable staying at home and doing outpatient care.",
          "created_utc": 1722375103.0
        },
        {
          "id": "lfpsj43",
          "author": "Excellent-World-476",
          "body": "I did a lot of research before going residential last time. I called and asked questions to make sure it addressed my needs.  That was very helpful.",
          "created_utc": 1722375177.0
        }
      ]
    },
    {
      "id": "lfpta0b",
      "author": "Coffeegreysky12",
      "body": "Thank you for the advice. I've never been to a residential program. I will try to be more optimistic about treatment. I think I get set in my ways, and any change is very scary to me",
      "created_utc": 1722375427.0,
      "score": 2,
      "context": [
        {
          "id": "lfpqqpu",
          "author": "Excellent-World-476",
          "body": "Where do you live?  I wonder if Acute would be an option?  It is the individual room based care for medical care. Don’t give up. I’ve been inpatient and residential more times then I can count but I am a different person now. Just because it didn’t help twice doesn’t mean it will never help.  Doctors and nurses will not judge things like incontinence. I experienced a time of not having bowel control and my nurses were lovely. Hang in there.",
          "created_utc": 1722374585.0
        },
        {
          "id": "lfpsb71",
          "author": "Coffeegreysky12",
          "body": "Thank you. I'm really afraid to go to the hospital, any type of hospital setting where I would be away from home. I was so uncomfortable the last two times I was hospitalized. I could hardly focus on getting better because I was so anxious. And the programs didn't take into consideration that I have autism and that I will respond differently to anorexia treatment. I think I have trauma from my last inpatient experiences. But I know all programs are different and I know they do work for some people. I would feel more comfortable staying at home and doing outpatient care.",
          "created_utc": 1722375103.0
        },
        {
          "id": "lfpsj43",
          "author": "Excellent-World-476",
          "body": "I did a lot of research before going residential last time. I called and asked questions to make sure it addressed my needs.  That was very helpful.",
          "created_utc": 1722375177.0
        }
      ]
    },
    {
      "id": "lfsyo6c",
      "author": "Coffeegreysky12",
      "body": "That's very sad. I want to live a long time and will try to fight this",
      "created_utc": 1722429579.0,
      "score": 2,
      "context": [
        {
          "id": "lfruek7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722405540.0
        },
        {
          "id": "lfsx9r0",
          "author": "Coffeegreysky12",
          "body": "Thank you for the support and advice",
          "created_utc": 1722428983.0
        },
        {
          "id": "lfsy6kj",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722429373.0
        }
      ]
    },
    {
      "id": "m10aa57",
      "author": "Rectangular_Bird",
      "body": "I think I found a free version of that linked book! But what titles are you talking about, sorry, English is is not my native language",
      "created_utc": 1733649110.0,
      "score": 2,
      "context": [
        {
          "id": "lfsmk08",
          "author": "None",
          "body": "I can relate to a lot. I was diagnosed for 18 years. I haven't actually recovered, but did gain A LOT of weight in relation to specific things in just the past year. I still have the same disorder though some symptoms are different. \n\nIn my depths this helped me to manage it all: https://books.google.com/books?id=LtyjCwAAQBAJ&printsec=frontcover&dq=seed+anorexia+nervosa+harm+reduction+pdf&hl=en&newbks=1&newbks_redir=0&source=gb_mobile_search&sa=X&ved=2ahUKEwj38Jjjj9GHAxUTJjQIHehnAUUQ6AF6BAgNEAM#v=onepage&q&f=false\n\nIt is technically targeted towards clinicians. I applied what I could where I could and I was not recovered, but I was doing better/maintained a decent life.  I relate to a lot that you wrote. I have some other patient intended and general seed books via PDF.and some random publications. Let me know if you want further material. \n\nThis disorder is awful. Please keep trying.",
          "created_utc": 1722423864.0
        },
        {
          "id": "m0xkx5j",
          "author": "Rectangular_Bird",
          "body": "Hi! I'm in a difficult situation as well and I think I could benefit from those materials. Could you share them with me?",
          "created_utc": 1733607099.0
        },
        {
          "id": "m0zl0un",
          "author": "None",
          "body": "I believe the specific book linked is still available for purchase,  but am not sure the cost. I referred to others as well, and can add those titles if that would be helpful(?). \n\nAssuming I still have all of the titles, otherwise I can do what I am able to.",
          "created_utc": 1733634384.0
        }
      ]
    },
    {
      "id": "lg0rf94",
      "author": "Coffeegreysky12",
      "body": "Thank you",
      "created_utc": 1722539025.0,
      "score": 2,
      "context": [
        {
          "id": "lg0qkif",
          "author": "gdesuyis",
          "body": "i’m so sorry to hear this. i’m autistic too and have anorexia was diagnosed at 12 and now 28- it’s awful and mind numbing. i pray you find the right treatment. it’s a mission to find something catered to us autistic folk but it’s not impossible",
          "created_utc": 1722538750.0
        },
        {
          "id": "lg0qx0z",
          "author": "Coffeegreysky12",
          "body": "Thank you. So true. I hope I find a treatment that works for both my autism and anorexia. Glad others can relate",
          "created_utc": 1722538861.0
        },
        {
          "id": "lg0r3z2",
          "author": "gdesuyis",
          "body": "i wish you all the best on your journey",
          "created_utc": 1722538923.0
        }
      ]
    },
    {
      "id": "lktterp",
      "author": "Coffeegreysky12",
      "body": "Thank you:)",
      "created_utc": 1725110207.0,
      "score": 1,
      "context": [
        {
          "id": "lgc8wnf",
          "author": "InitiativeAfter1528",
          "body": "aww sorry you have suffered so long hun..try eating baby foods regularly as your digestion will be awfully slow as your body is slowly giving up and thats not a good sign love. while your heart is still beating you can totally reverse this. ive seen many die and its so sad..im also a anorexic in recovery babes so i understand. your will to live has to get stronger hun you deserve to be here happy healthy and glowing..big hugs time to kick anorexia in the butt once and for all. tell nurses your ready to work harder to recover..seek all therapys and resources available to you..even counceling..also what is your root cause? treat that as well as often anorexia is just a side effect to something more like trauma etc..you are loved hun lets do this together im getting well lets see you do it too😁",
          "created_utc": 1722711521.0
        },
        {
          "id": "lgca27n",
          "author": "Coffeegreysky12",
          "body": "Thank you for the support. I appreciate it. I do want to live a long time and feel better. It's such an awful disorder. I will keep trying. Some days, it's very difficult. I'm not sure what my root cause is, but I know it's hard to stop the eating disorder behaviors completely. I want to turn this around and feel healthier and stronger. I am glad you are getting well. I hope I can get well too.",
          "created_utc": 1722711928.0
        },
        {
          "id": "lktso6q",
          "author": "InitiativeAfter1528",
          "body": "you absolutely can hun...have faith in yourself you can do it..big hugs..",
          "created_utc": 1725109910.0
        }
      ]
    },
    {
      "id": "lfpu91f",
      "author": "Coffeegreysky12",
      "body": "That's true. All programs are different",
      "created_utc": 1722375749.0,
      "score": 1,
      "context": [
        {
          "id": "lfpqqpu",
          "author": "Excellent-World-476",
          "body": "Where do you live?  I wonder if Acute would be an option?  It is the individual room based care for medical care. Don’t give up. I’ve been inpatient and residential more times then I can count but I am a different person now. Just because it didn’t help twice doesn’t mean it will never help.  Doctors and nurses will not judge things like incontinence. I experienced a time of not having bowel control and my nurses were lovely. Hang in there.",
          "created_utc": 1722374585.0
        },
        {
          "id": "lfpsb71",
          "author": "Coffeegreysky12",
          "body": "Thank you. I'm really afraid to go to the hospital, any type of hospital setting where I would be away from home. I was so uncomfortable the last two times I was hospitalized. I could hardly focus on getting better because I was so anxious. And the programs didn't take into consideration that I have autism and that I will respond differently to anorexia treatment. I think I have trauma from my last inpatient experiences. But I know all programs are different and I know they do work for some people. I would feel more comfortable staying at home and doing outpatient care.",
          "created_utc": 1722375103.0
        },
        {
          "id": "lfpsj43",
          "author": "Excellent-World-476",
          "body": "I did a lot of research before going residential last time. I called and asked questions to make sure it addressed my needs.  That was very helpful.",
          "created_utc": 1722375177.0
        },
        {
          "id": "lfpt2ms",
          "author": "Excellent-World-476",
          "body": "There are programs that are better with autism than others. I know it can be hard. My last admission one of my peers was autistic and they handled it well.",
          "created_utc": 1722375358.0
        }
      ]
    },
    {
      "id": "lfpty83",
      "author": "Excellent-World-476",
      "body": "Absolutely. It is very scary and you can’t imagine what is on the other side. It’s hard to jump off a cliff not knowing if you will fly or fall. But it is possible you will fly.",
      "created_utc": 1722375651.0,
      "score": 2,
      "context": [
        {
          "id": "lfpqqpu",
          "author": "Excellent-World-476",
          "body": "Where do you live?  I wonder if Acute would be an option?  It is the individual room based care for medical care. Don’t give up. I’ve been inpatient and residential more times then I can count but I am a different person now. Just because it didn’t help twice doesn’t mean it will never help.  Doctors and nurses will not judge things like incontinence. I experienced a time of not having bowel control and my nurses were lovely. Hang in there.",
          "created_utc": 1722374585.0
        },
        {
          "id": "lfpsb71",
          "author": "Coffeegreysky12",
          "body": "Thank you. I'm really afraid to go to the hospital, any type of hospital setting where I would be away from home. I was so uncomfortable the last two times I was hospitalized. I could hardly focus on getting better because I was so anxious. And the programs didn't take into consideration that I have autism and that I will respond differently to anorexia treatment. I think I have trauma from my last inpatient experiences. But I know all programs are different and I know they do work for some people. I would feel more comfortable staying at home and doing outpatient care.",
          "created_utc": 1722375103.0
        },
        {
          "id": "lfpsj43",
          "author": "Excellent-World-476",
          "body": "I did a lot of research before going residential last time. I called and asked questions to make sure it addressed my needs.  That was very helpful.",
          "created_utc": 1722375177.0
        },
        {
          "id": "lfpta0b",
          "author": "Coffeegreysky12",
          "body": "Thank you for the advice. I've never been to a residential program. I will try to be more optimistic about treatment. I think I get set in my ways, and any change is very scary to me",
          "created_utc": 1722375427.0
        }
      ]
    },
    {
      "id": "lfsysv6",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1722429633.0,
      "score": 3,
      "context": [
        {
          "id": "lfruek7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722405540.0
        },
        {
          "id": "lfsx9r0",
          "author": "Coffeegreysky12",
          "body": "Thank you for the support and advice",
          "created_utc": 1722428983.0
        },
        {
          "id": "lfsy6kj",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722429373.0
        },
        {
          "id": "lfsyo6c",
          "author": "Coffeegreysky12",
          "body": "That's very sad. I want to live a long time and will try to fight this",
          "created_utc": 1722429579.0
        }
      ]
    },
    {
      "id": "m19x3m0",
      "author": "None",
      "body": "Honestly, your English is good. \n\nMy recall of the books I read at the time is not perfect, and I took an approach I essentially created, and asked my psychiatrist if it would be reasonable. He was fine with it, and I proceeded to apply it for some time. \n\nSome of the content came from articles I found in studies accessible online and similar information sources. I cannot locate those with ease given they were saved on a device I no longer own. \n\nSome of the titles do not focus on SEEDs, but I likely found something that led to saving the book long-term. At the time I approached it this way I had restrictive anorexia nervosa, but I know most have info about binge purge subtype. I'd say they're generally lacking in terms of atypical anorexia nervosa. \n\nI also obtained information from content related to harm reduction in drug use and applied similar guidelines. Likewise, I looked at medical, none eating disorder focused texts that included information related to complications I personally experienced (ranging from dietary deficiencies and osteoporosis to impact of malnutrition on other conditions I was diagnosed with). I won't know which specific books these were offhand. \n\nI apologize given the list is likely incomplete, but will list what I can:\n\n•The Oxford Handook of Eating Disorders\n\n• Severe and Enduring Eating Disorder: Management of Complex Anorexia and Bulimia Nervosa\n\n• Medical Management of Eating Disorders\n\n• Critical Care for Anorexia Nervosa: Marsipan Guidelines \n\n• Behavioral Neurobiology of Eating Disorders \n\n• Neurobiology in the Treatment of Eating Disorders \n\n• Anorexia Nervosa: Symptoms, Treatment, and Neurobiology \n\n• Tipping the Scales: Ethical and Legal Dilemmas in managing Severe Eating Disorders\n\nThose are the only ones I still have downloaded. I hope you are able to find something of help in one of them. I used methods from different types of therapy I was aware of either through reading or treatment, too. \n\nIf you are able to find and obtain a provider who works with SEEDs, i recommend that route first.",
      "created_utc": 1733786980.0,
      "score": 2,
      "context": [
        {
          "id": "lfsmk08",
          "author": "None",
          "body": "I can relate to a lot. I was diagnosed for 18 years. I haven't actually recovered, but did gain A LOT of weight in relation to specific things in just the past year. I still have the same disorder though some symptoms are different. \n\nIn my depths this helped me to manage it all: https://books.google.com/books?id=LtyjCwAAQBAJ&printsec=frontcover&dq=seed+anorexia+nervosa+harm+reduction+pdf&hl=en&newbks=1&newbks_redir=0&source=gb_mobile_search&sa=X&ved=2ahUKEwj38Jjjj9GHAxUTJjQIHehnAUUQ6AF6BAgNEAM#v=onepage&q&f=false\n\nIt is technically targeted towards clinicians. I applied what I could where I could and I was not recovered, but I was doing better/maintained a decent life.  I relate to a lot that you wrote. I have some other patient intended and general seed books via PDF.and some random publications. Let me know if you want further material. \n\nThis disorder is awful. Please keep trying.",
          "created_utc": 1722423864.0
        },
        {
          "id": "m0xkx5j",
          "author": "Rectangular_Bird",
          "body": "Hi! I'm in a difficult situation as well and I think I could benefit from those materials. Could you share them with me?",
          "created_utc": 1733607099.0
        },
        {
          "id": "m0zl0un",
          "author": "None",
          "body": "I believe the specific book linked is still available for purchase,  but am not sure the cost. I referred to others as well, and can add those titles if that would be helpful(?). \n\nAssuming I still have all of the titles, otherwise I can do what I am able to.",
          "created_utc": 1733634384.0
        },
        {
          "id": "m10aa57",
          "author": "Rectangular_Bird",
          "body": "I think I found a free version of that linked book! But what titles are you talking about, sorry, English is is not my native language",
          "created_utc": 1733649110.0
        }
      ]
    },
    {
      "id": "lfpuiyt",
      "author": "Coffeegreysky12",
      "body": "Thank you for the advice",
      "created_utc": 1722375841.0,
      "score": 1,
      "context": [
        {
          "id": "lfpqqpu",
          "author": "Excellent-World-476",
          "body": "Where do you live?  I wonder if Acute would be an option?  It is the individual room based care for medical care. Don’t give up. I’ve been inpatient and residential more times then I can count but I am a different person now. Just because it didn’t help twice doesn’t mean it will never help.  Doctors and nurses will not judge things like incontinence. I experienced a time of not having bowel control and my nurses were lovely. Hang in there.",
          "created_utc": 1722374585.0
        },
        {
          "id": "lfpsb71",
          "author": "Coffeegreysky12",
          "body": "Thank you. I'm really afraid to go to the hospital, any type of hospital setting where I would be away from home. I was so uncomfortable the last two times I was hospitalized. I could hardly focus on getting better because I was so anxious. And the programs didn't take into consideration that I have autism and that I will respond differently to anorexia treatment. I think I have trauma from my last inpatient experiences. But I know all programs are different and I know they do work for some people. I would feel more comfortable staying at home and doing outpatient care.",
          "created_utc": 1722375103.0
        },
        {
          "id": "lfpsj43",
          "author": "Excellent-World-476",
          "body": "I did a lot of research before going residential last time. I called and asked questions to make sure it addressed my needs.  That was very helpful.",
          "created_utc": 1722375177.0
        },
        {
          "id": "lfpta0b",
          "author": "Coffeegreysky12",
          "body": "Thank you for the advice. I've never been to a residential program. I will try to be more optimistic about treatment. I think I get set in my ways, and any change is very scary to me",
          "created_utc": 1722375427.0
        },
        {
          "id": "lfpty83",
          "author": "Excellent-World-476",
          "body": "Absolutely. It is very scary and you can’t imagine what is on the other side. It’s hard to jump off a cliff not knowing if you will fly or fall. But it is possible you will fly.",
          "created_utc": 1722375651.0
        }
      ]
    },
    {
      "id": "lfszuw9",
      "author": "Coffeegreysky12",
      "body": "I will remember this. Thank you for the words of encouragement",
      "created_utc": 1722430068.0,
      "score": 3,
      "context": [
        {
          "id": "lfruek7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722405540.0
        },
        {
          "id": "lfsx9r0",
          "author": "Coffeegreysky12",
          "body": "Thank you for the support and advice",
          "created_utc": 1722428983.0
        },
        {
          "id": "lfsy6kj",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722429373.0
        },
        {
          "id": "lfsyo6c",
          "author": "Coffeegreysky12",
          "body": "That's very sad. I want to live a long time and will try to fight this",
          "created_utc": 1722429579.0
        },
        {
          "id": "lfsysv6",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1722429633.0
        }
      ]
    },
    {
      "id": "m1hgfjg",
      "author": "Rectangular_Bird",
      "body": "Thank you so much! And there really isn't resources in my country to help people with seeds, maybe some private providers, but they cost a fortune... 😔",
      "created_utc": 1733896030.0,
      "score": 2,
      "context": [
        {
          "id": "lfsmk08",
          "author": "None",
          "body": "I can relate to a lot. I was diagnosed for 18 years. I haven't actually recovered, but did gain A LOT of weight in relation to specific things in just the past year. I still have the same disorder though some symptoms are different. \n\nIn my depths this helped me to manage it all: https://books.google.com/books?id=LtyjCwAAQBAJ&printsec=frontcover&dq=seed+anorexia+nervosa+harm+reduction+pdf&hl=en&newbks=1&newbks_redir=0&source=gb_mobile_search&sa=X&ved=2ahUKEwj38Jjjj9GHAxUTJjQIHehnAUUQ6AF6BAgNEAM#v=onepage&q&f=false\n\nIt is technically targeted towards clinicians. I applied what I could where I could and I was not recovered, but I was doing better/maintained a decent life.  I relate to a lot that you wrote. I have some other patient intended and general seed books via PDF.and some random publications. Let me know if you want further material. \n\nThis disorder is awful. Please keep trying.",
          "created_utc": 1722423864.0
        },
        {
          "id": "m0xkx5j",
          "author": "Rectangular_Bird",
          "body": "Hi! I'm in a difficult situation as well and I think I could benefit from those materials. Could you share them with me?",
          "created_utc": 1733607099.0
        },
        {
          "id": "m0zl0un",
          "author": "None",
          "body": "I believe the specific book linked is still available for purchase,  but am not sure the cost. I referred to others as well, and can add those titles if that would be helpful(?). \n\nAssuming I still have all of the titles, otherwise I can do what I am able to.",
          "created_utc": 1733634384.0
        },
        {
          "id": "m10aa57",
          "author": "Rectangular_Bird",
          "body": "I think I found a free version of that linked book! But what titles are you talking about, sorry, English is is not my native language",
          "created_utc": 1733649110.0
        },
        {
          "id": "m19x3m0",
          "author": "None",
          "body": "Honestly, your English is good. \n\nMy recall of the books I read at the time is not perfect, and I took an approach I essentially created, and asked my psychiatrist if it would be reasonable. He was fine with it, and I proceeded to apply it for some time. \n\nSome of the content came from articles I found in studies accessible online and similar information sources. I cannot locate those with ease given they were saved on a device I no longer own. \n\nSome of the titles do not focus on SEEDs, but I likely found something that led to saving the book long-term. At the time I approached it this way I had restrictive anorexia nervosa, but I know most have info about binge purge subtype. I'd say they're generally lacking in terms of atypical anorexia nervosa. \n\nI also obtained information from content related to harm reduction in drug use and applied similar guidelines. Likewise, I looked at medical, none eating disorder focused texts that included information related to complications I personally experienced (ranging from dietary deficiencies and osteoporosis to impact of malnutrition on other conditions I was diagnosed with). I won't know which specific books these were offhand. \n\nI apologize given the list is likely incomplete, but will list what I can:\n\n•The Oxford Handook of Eating Disorders\n\n• Severe and Enduring Eating Disorder: Management of Complex Anorexia and Bulimia Nervosa\n\n• Medical Management of Eating Disorders\n\n• Critical Care for Anorexia Nervosa: Marsipan Guidelines \n\n• Behavioral Neurobiology of Eating Disorders \n\n• Neurobiology in the Treatment of Eating Disorders \n\n• Anorexia Nervosa: Symptoms, Treatment, and Neurobiology \n\n• Tipping the Scales: Ethical and Legal Dilemmas in managing Severe Eating Disorders\n\nThose are the only ones I still have downloaded. I hope you are able to find something of help in one of them. I used methods from different types of therapy I was aware of either through reading or treatment, too. \n\nIf you are able to find and obtain a provider who works with SEEDs, i recommend that route first.",
          "created_utc": 1733786980.0
        }
      ]
    },
    {
      "id": "m1hhys5",
      "author": "None",
      "body": "I'm sorry :/\n\nI started trying to develop an approach on my own when I found out that all ED based treatment in my area did not take insurance, so also a fortune. It prompted the entire thing. \n\nI can absolutely relate and hope something helps.",
      "created_utc": 1733896858.0,
      "score": 1,
      "context": [
        {
          "id": "lfsmk08",
          "author": "None",
          "body": "I can relate to a lot. I was diagnosed for 18 years. I haven't actually recovered, but did gain A LOT of weight in relation to specific things in just the past year. I still have the same disorder though some symptoms are different. \n\nIn my depths this helped me to manage it all: https://books.google.com/books?id=LtyjCwAAQBAJ&printsec=frontcover&dq=seed+anorexia+nervosa+harm+reduction+pdf&hl=en&newbks=1&newbks_redir=0&source=gb_mobile_search&sa=X&ved=2ahUKEwj38Jjjj9GHAxUTJjQIHehnAUUQ6AF6BAgNEAM#v=onepage&q&f=false\n\nIt is technically targeted towards clinicians. I applied what I could where I could and I was not recovered, but I was doing better/maintained a decent life.  I relate to a lot that you wrote. I have some other patient intended and general seed books via PDF.and some random publications. Let me know if you want further material. \n\nThis disorder is awful. Please keep trying.",
          "created_utc": 1722423864.0
        },
        {
          "id": "m0xkx5j",
          "author": "Rectangular_Bird",
          "body": "Hi! I'm in a difficult situation as well and I think I could benefit from those materials. Could you share them with me?",
          "created_utc": 1733607099.0
        },
        {
          "id": "m0zl0un",
          "author": "None",
          "body": "I believe the specific book linked is still available for purchase,  but am not sure the cost. I referred to others as well, and can add those titles if that would be helpful(?). \n\nAssuming I still have all of the titles, otherwise I can do what I am able to.",
          "created_utc": 1733634384.0
        },
        {
          "id": "m10aa57",
          "author": "Rectangular_Bird",
          "body": "I think I found a free version of that linked book! But what titles are you talking about, sorry, English is is not my native language",
          "created_utc": 1733649110.0
        },
        {
          "id": "m19x3m0",
          "author": "None",
          "body": "Honestly, your English is good. \n\nMy recall of the books I read at the time is not perfect, and I took an approach I essentially created, and asked my psychiatrist if it would be reasonable. He was fine with it, and I proceeded to apply it for some time. \n\nSome of the content came from articles I found in studies accessible online and similar information sources. I cannot locate those with ease given they were saved on a device I no longer own. \n\nSome of the titles do not focus on SEEDs, but I likely found something that led to saving the book long-term. At the time I approached it this way I had restrictive anorexia nervosa, but I know most have info about binge purge subtype. I'd say they're generally lacking in terms of atypical anorexia nervosa. \n\nI also obtained information from content related to harm reduction in drug use and applied similar guidelines. Likewise, I looked at medical, none eating disorder focused texts that included information related to complications I personally experienced (ranging from dietary deficiencies and osteoporosis to impact of malnutrition on other conditions I was diagnosed with). I won't know which specific books these were offhand. \n\nI apologize given the list is likely incomplete, but will list what I can:\n\n•The Oxford Handook of Eating Disorders\n\n• Severe and Enduring Eating Disorder: Management of Complex Anorexia and Bulimia Nervosa\n\n• Medical Management of Eating Disorders\n\n• Critical Care for Anorexia Nervosa: Marsipan Guidelines \n\n• Behavioral Neurobiology of Eating Disorders \n\n• Neurobiology in the Treatment of Eating Disorders \n\n• Anorexia Nervosa: Symptoms, Treatment, and Neurobiology \n\n• Tipping the Scales: Ethical and Legal Dilemmas in managing Severe Eating Disorders\n\nThose are the only ones I still have downloaded. I hope you are able to find something of help in one of them. I used methods from different types of therapy I was aware of either through reading or treatment, too. \n\nIf you are able to find and obtain a provider who works with SEEDs, i recommend that route first.",
          "created_utc": 1733786980.0
        },
        {
          "id": "m1hgfjg",
          "author": "Rectangular_Bird",
          "body": "Thank you so much! And there really isn't resources in my country to help people with seeds, maybe some private providers, but they cost a fortune... 😔",
          "created_utc": 1733896030.0
        }
      ]
    }
  ]
}