{
  "id": "1ekjoqc",
  "subreddit": "AnorexiaNervosa",
  "author": "Weird-Flatworm860",
  "created_utc": 1722850928.0,
  "title": "I absolutely hate it when people around me lose weight.",
  "selftext": "I dont know why but i literally feel extremely sad when people around me start losing weight. I start envying them. i deep down wish that they gain all that weight back plus some more. i know i'm being very negative and i shouldnt feel this way, but even if i try to not think like this, i cannot help it. Recently i met two of my distant relatives after a year or two and they looked so much thinner. It triggered me and i dont know why i want them to get fat again. i seriously think i'm messed up in the head and i feel like shit right now. What should i do about it?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ekjoqc/i_absolutely_hate_it_when_people_around_me_lose/",
  "score": 135,
  "num_comments": 14,
  "comments": [
    {
      "id": "lgl0gp1",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1722850928.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lglyfz0",
      "author": "mediocre_truth_",
      "body": "I sometimes have those thoughts too. It sucks but I try to keep in mind that it's the ed speaking. My friend has lost a lot of weight because he wanted to go from overweight to normal weight and somehow I feel like I'm in a competition which I'm losing...",
      "created_utc": 1722866851.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lgl3kyn",
      "author": "Real_CatCupcake",
      "body": "Just know that your not alone I feel this way about other people too and it makes me feel like such a bad person. What I did was to remind myself that these thoughts are just part of my disordered thinking and don't reflect who I am as a person. The same thing goes for you, your not a bad person for having these thoughts, you've acknowledged them and now you can let them go. I hope you feel better soon Xx",
      "created_utc": 1722852944.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lgl4k75",
      "author": "flowerlesspotato",
      "body": "Eating disorders are extremely competitive, I believe you found out the reason why you hate other people losing weight: it's the ed comparing you to them and making you feel terrible. \n\nYou cannot control your immediate feelings towards something, I'd recommend just reminding yourself that it's the ed voice speaking and not yours, and that you never know what other people are going through that's causing their body to change. You are your own person and the changes others experience do not determine anything about you, not your worth, nor health, nor your beauty, and neither the depth of your struggles, nothing.\n\nDon't beat yourself too hard about this, I one hundred percent think it's the illness messing with you and not your own values making you feel like this. As long as you don't act with some kind of revenge or spite towards them, you are doing great. Thoughts when you have a mental illness, more often than not, do not represent your real beliefs.\n\nI hope you can find peace with these thoughts, take a deep breath and just accept that they are there but they are not you. In my experience, these kind go away gradually when you realize it's not you thinking them and let them go away without acting on them or giving them too much power (sometimes they might come back, but just repeat the process: breathe, accept, and don't act).\n\nHave a good day, you deserve it!",
      "created_utc": 1722853559.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lglfutm",
      "author": "None",
      "body": "I felt exactly the same way right before i relapsed…i feel so fucking stupid right now",
      "created_utc": 1722859479.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgny6rb",
      "author": "Several-Blueberry984",
      "body": "my ed makes me super competitive. I make sure I eat less than my 5 year old sister. Ed’s are designed to kill us. I’m sorry you feel the way you do, you’re not alone.🩷",
      "created_utc": 1722889909.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lglfys9",
      "author": "8_cat_8",
      "body": "I just find it amusing how evil we all are lmao",
      "created_utc": 1722859530.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh0kv4b",
      "author": "Puzzleheaded_Lie_708",
      "body": "The same thing happens to me, it doesn't matter if they lose a kilo but they are still 7 kilos heavier than me, I'm going to think that I have to lose more than that, even though I weigh much less than them :( I hate that",
      "created_utc": 1723069911.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgns0jx",
      "author": "TractorGirly",
      "body": "I feel the exact same! I worry about my family's health, and want them to eat healthier, yet I want them to eat more than me (which would be a lot) and to not lose weight, even though they actually need to. It makes no sense...",
      "created_utc": 1722887959.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgm7a0w",
      "author": "imsureyourenice",
      "body": "I understand that, you aren’t alone. I am *just* underweight and my husband had a few extra lbs on him (he looks fantastic always) and he dropped them and got to a perfect healthy weight. I felt so triggered by his modest and appropriate loss.. I feel so guilty and ashamed of this. It’s my disorder, not me. The real me isn’t jealous or negative.. my disorder is competitive and hateful",
      "created_utc": 1722869846.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lglstbo",
      "author": "Weird-Flatworm860",
      "body": "Thankyou!",
      "created_utc": 1722864830.0,
      "score": 2,
      "context": [
        {
          "id": "lgl3kyn",
          "author": "Real_CatCupcake",
          "body": "Just know that your not alone I feel this way about other people too and it makes me feel like such a bad person. What I did was to remind myself that these thoughts are just part of my disordered thinking and don't reflect who I am as a person. The same thing goes for you, your not a bad person for having these thoughts, you've acknowledged them and now you can let them go. I hope you feel better soon Xx",
          "created_utc": 1722852944.0
        }
      ]
    },
    {
      "id": "lgltg5z",
      "author": "Weird-Flatworm860",
      "body": "Thankyou for such kind words!🥺 i really needed it right now.",
      "created_utc": 1722865067.0,
      "score": 1,
      "context": [
        {
          "id": "lgl4k75",
          "author": "flowerlesspotato",
          "body": "Eating disorders are extremely competitive, I believe you found out the reason why you hate other people losing weight: it's the ed comparing you to them and making you feel terrible. \n\nYou cannot control your immediate feelings towards something, I'd recommend just reminding yourself that it's the ed voice speaking and not yours, and that you never know what other people are going through that's causing their body to change. You are your own person and the changes others experience do not determine anything about you, not your worth, nor health, nor your beauty, and neither the depth of your struggles, nothing.\n\nDon't beat yourself too hard about this, I one hundred percent think it's the illness messing with you and not your own values making you feel like this. As long as you don't act with some kind of revenge or spite towards them, you are doing great. Thoughts when you have a mental illness, more often than not, do not represent your real beliefs.\n\nI hope you can find peace with these thoughts, take a deep breath and just accept that they are there but they are not you. In my experience, these kind go away gradually when you realize it's not you thinking them and let them go away without acting on them or giving them too much power (sometimes they might come back, but just repeat the process: breathe, accept, and don't act).\n\nHave a good day, you deserve it!",
          "created_utc": 1722853559.0
        }
      ]
    },
    {
      "id": "lglt293",
      "author": "Weird-Flatworm860",
      "body": "I'm relapsing too, 8 years after recovery.",
      "created_utc": 1722864924.0,
      "score": 3,
      "context": [
        {
          "id": "lglfutm",
          "author": "None",
          "body": "I felt exactly the same way right before i relapsed…i feel so fucking stupid right now",
          "created_utc": 1722859479.0
        }
      ]
    },
    {
      "id": "lglt5do",
      "author": "Weird-Flatworm860",
      "body": "Lmao. 🥺😭",
      "created_utc": 1722864955.0,
      "score": 2,
      "context": [
        {
          "id": "lglfys9",
          "author": "8_cat_8",
          "body": "I just find it amusing how evil we all are lmao",
          "created_utc": 1722859530.0
        }
      ]
    }
  ]
}