{
  "id": "1elajlz",
  "subreddit": "AnorexiaNervosa",
  "author": "Weird-Flatworm860",
  "created_utc": 1722925243.0,
  "title": "What is the most stupid thing someone has said to you, knowing you're an anorexic.",
  "selftext": "A few days ago, a close friend of mine told me,\"you're going to get even prettier now?! i'm jealous\". That was right after i told her that i am relapsing back into anorexia after having recovered 8 years ago. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1elajlz/what_is_the_most_stupid_thing_someone_has_said_to/",
  "score": 201,
  "num_comments": 150,
  "comments": [
    {
      "id": "lgqdx02",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1722925243.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgqj180",
      "author": "Turbulent-Ability271",
      "body": "\"My niece was anorexic! She was (some abysmally unattainable low number) kg.\"",
      "created_utc": 1722928529.0,
      "score": 84,
      "context": []
    },
    {
      "id": "lgqi0ug",
      "author": "FruitSalad_24",
      "body": "I was told that I'm a 'part time anorexic' and 'not that bad' because I don't do certain behaviours (that aren't even classed as Anorexia Nervosa behaviours)",
      "created_utc": 1722927869.0,
      "score": 71,
      "context": []
    },
    {
      "id": "lgqkipo",
      "author": "sj0714",
      "body": "My mom called me her little garbage disposal when I started eating more regularly",
      "created_utc": 1722929518.0,
      "score": 63,
      "context": []
    },
    {
      "id": "lgqgeca",
      "author": "LostSoul4607",
      "body": "My mom just invalidates me all the fucking time and makes me feel awful.\n\nMy ED stems from self hatred after being raped by my former stepdad when I was little, but my mom still denies that it ever happened, so she just tells me that I enjoy making her feel like shit and that I'm a failure.\n\nI can't wait to fucking move away for college next year cause she sucks",
      "created_utc": 1722926819.0,
      "score": 104,
      "context": []
    },
    {
      "id": "lgra58a",
      "author": "Dependent_Setting415",
      "body": "\"OMG you've lost so much weight can you teach me how?!\" Sure thing Jan! It's really simple actually. You just need to place more importance on the number on the scales and how you are perceived by others than in your own health and happiness. I also recommend isolating yourself as much as possible so that nobody can see how dangerous your eating habits are, causing you to become incredibly lonely and then you can use that loneliness as fuel for the need to be perceived as beautiful by others. Easy peasy!",
      "created_utc": 1722945125.0,
      "score": 49,
      "context": []
    },
    {
      "id": "lgqilfl",
      "author": "tinylittlehare",
      "body": "“wow you know that’s really bad for you right. like it’s really dangerous!” (this was after being in the hospital and inpatient treatment for over 2 months lol) \n\n“you’re so selfish, do you know how much your ED affects me??” -my sister\n\nmy personal favorite- my parents telling people I’m anorexic as if I won a medal for it. they pretended it was terrible and they hated it, but secretly I think they were proud of me.",
      "created_utc": 1722928244.0,
      "score": 68,
      "context": []
    },
    {
      "id": "lgr9c9o",
      "author": "RentMelodic4381",
      "body": "I was forced to go on a long family holiday and had to eat with them twice a day, (they don’t know about my ed so I decided to eat more then I’m comfortable with to keep it hidden) then after I got back my mum told me “you look so curvy, you were starting to look dugsusting and anorexic before” thanks mum, thanks a lot",
      "created_utc": 1722944748.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lgqf3mf",
      "author": "jarosunshine",
      "body": "“It’s better than cancer! You can just quit [using ED to lose weight] any time!”\n\n I was diagnosed with stage 3 cancer 2 years later. 🥴 (I’m in the “no evidence of disease” club as of my last check, but still struggling to “just quit” this damn ED.) \n\n\nThen there was the RN case manager for my insurance, “you can’t die from an eating disorder.” \n\n\nAnd my dad, for good measure, “don’t f*ck up. Quit this s*it. Just lose weight normally and get good grades. You’ll always be ugly.”",
      "created_utc": 1722925988.0,
      "score": 50,
      "context": []
    },
    {
      "id": "lgqme2x",
      "author": "cheekyu",
      "body": "my partner asking how much I weigh and then going, “Oh, I would’ve expected more.”",
      "created_utc": 1722930783.0,
      "score": 20,
      "context": []
    },
    {
      "id": "lgqneyy",
      "author": "None",
      "body": "My best friend texted our group chat saying : stop pretending we all know you’re anorexic… we’re in our 30s… we haven’t talked in 7 weeks",
      "created_utc": 1722931482.0,
      "score": 23,
      "context": []
    },
    {
      "id": "lgqrsge",
      "author": "Glamour-Ad7669",
      "body": "‘It’s funny that you eat that while I’m cutting it out of my diet now that I’m trying to lose weight’",
      "created_utc": 1722934443.0,
      "score": 25,
      "context": []
    },
    {
      "id": "lgqie6f",
      "author": "TractorGirly",
      "body": "I've gained a lot of weight recently in my recovery, but I'm still very sensitive and self-loathing, yet my family make these little digs about how much I eat, making me feel like the greediest pig ever. For insurance, yesterday I asked if we could go to a particular library which also has a vegan bakery nearby and my dad said 'forget the library, you just want to go to the bakery!'. \nI know he's joking, but I can't take a joke, especially around eating. And I  know these things are very minor, but I feel like for us, even the smallest thing could send us spiralling.",
      "created_utc": 1722928114.0,
      "score": 33,
      "context": []
    },
    {
      "id": "lgrhi2v",
      "author": "jm4320",
      "body": "A “friend” said just calling to see if you’re dead yet",
      "created_utc": 1722948320.0,
      "score": 14,
      "context": []
    },
    {
      "id": "lgrlteq",
      "author": "leytourmaline",
      "body": "“You’re too far gone for help,” from an eating disorder specialist who I was referred to after I was sent to the hospita.",
      "created_utc": 1722949978.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lgqfns1",
      "author": "Quirky_Top_8990",
      "body": "My Papa is a lovely man, but he’s extremely fatphobic and will say things like ‘I saw this man with disgusting rolls of fat’ in front of me. 🤦‍♂️",
      "created_utc": 1722926348.0,
      "score": 30,
      "context": []
    },
    {
      "id": "lgs79f2",
      "author": "DueYogurtcloset2351",
      "body": "ugsj I'm so sorry your friend said that to you. It's crazy how a lot of people don't have the common decency to not comment on peoples' bodies or relationship with food\n\n• \"you are one of the better looking anorexics I've seen\"\\\n• \"what was your lowest weight?\"\\\n• \"you should count your calories so you know how much you're eating\"\\\n• \"don't eat that, it has too many calories/sugar/carbs/etc.\" (while reading the nutrition label of the food I was eating 👺)\\\n• \"you'd look better if you gained a few pounds\"\\\n• \"you look like a 12 year old boy\"\\\n• (people trying to guess my weight)\\\n• \"You're still hungry??\" / \"how did you eat all of that?\"\\\n• \"You're so disciplined\"\\\n• \"I could crush you\" (I HATED this one oh my god, random people would just say it out of the blue)\\\n \nOne that kinda made me laugh:\\\n\"Yo you probably shouldn't be taking food from an anorexic\"\\\n\nhope you're okay OP 🫂",
      "created_utc": 1722957220.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lgqxnhw",
      "author": "Candid-Ad9983",
      "body": "“You wanna go for a run?” My husband knowing I’m very underweight and my body could not endure a workout like that.",
      "created_utc": 1722938340.0,
      "score": 24,
      "context": []
    },
    {
      "id": "lgqnmng",
      "author": "Express_Sea_5312",
      "body": "Told someone I was relapsing into my ana habits and they said \"but you're not skinny\". I was at the lower end of healthy bmi",
      "created_utc": 1722931628.0,
      "score": 21,
      "context": []
    },
    {
      "id": "lgr7iat",
      "author": "Frequent-Volume5817",
      "body": "My step sister used to try to 'compete' with my eating disorder when we were younger (I was 16, she was 18) and would always say off the wall shit to me. After going through my journal, she commented how she had eaten xxx less calories than me and was \"better at anorexia\". She kept that up for about a month.\n\n Always making it a competition, while she was trying to be better than i was, my body was shutting down and my hair was falling out 🙃 \nFor a little more context, her best friend in high school also has anorexia and my sister took it upon herself to try to develop bulimia after going through her friends tumblr!! And then a few years later tried to develop anorexia through me because bulimia didn't \"work out\". Wild behavior.",
      "created_utc": 1722943862.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lgqmcmt",
      "author": "None",
      "body": "Mine’s pretty tame compared to some of these, but my dad asking me, “have you considered changing your diet?”\n\nYes dad, because it’s a diet :/",
      "created_utc": 1722930756.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lgr9a53",
      "author": "awkward_writer1",
      "body": "Someone told me my puffy face will go away when I lose weight knowing I had anorexia and just recovered a year ago. Never relapsed so hard lol",
      "created_utc": 1722944721.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lgrxio1",
      "author": "tresjoliesuzanne",
      "body": "My partner told me I’d be more attractive if I lost weight..",
      "created_utc": 1722954064.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lgs152l",
      "author": "throwawaymyanalbeads",
      "body": "\"But I don't get it. You're not skinny.\"",
      "created_utc": 1722955255.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lgrtzwa",
      "author": "Solal-King-Raccoon",
      "body": "“Oh you’ll never be anorexic because your brain doesn’t have the willpower to starve itself”",
      "created_utc": 1722952873.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lgrujje",
      "author": "thethrowaway094",
      "body": "“can you just forget all the fat phobic comments we said about you and get better already ?? it’s been years and you’re just hurting us now”",
      "created_utc": 1722953059.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lgs2p37",
      "author": "nonexistentgrape",
      "body": "Everytime I would go for medical care getting comments about how \"tiny\" i was while i was literally there because of it lol, it makes me sick to think about how little thought or education there is about eds in healthcare, it literally served as validation for me.",
      "created_utc": 1722955759.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lgsv7sz",
      "author": "mmntmrvvr",
      "body": "my parents are the WORST about this. if i’m denying food, they will either say something like, “oh, of course you’re not going to eat! what did i expect?” in a sarcastic tone that makes me feel guilty, or (on NUMEROUS OCCASIONS) have said stuff like, “i wish i could just not eat like you do”. like, no, you don’t wish you were like me, because i have an EATING DISORDER.",
      "created_utc": 1722964664.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lgtbddc",
      "author": "MaccaGroovy",
      "body": "\"Youre doing it to rebel against your parents i think\"\n\nGirl was a nutritionist at a mental health clinic after i told her i starve for control against my body and to feel small\n\nAlso even worse\n\"You look like a holocaust victim\"\nThanks dad",
      "created_utc": 1722969622.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lgrp4ql",
      "author": "OpeningSuspect7296",
      "body": "Some family were talking about my weight as a child as I was a bit fat and my uncle said to my face knowing fully I have an ed “I wonder how much do you weigh now”",
      "created_utc": 1722951179.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lgrwxe9",
      "author": "cerealmilkvegan",
      "body": "brother called me fat 😍",
      "created_utc": 1722953867.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lgsl85e",
      "author": "locus0fcontrol",
      "body": "I wish I was inside of you \n\n^ said by my sister \n\nshe did not mean it sexually, she said she meant she envied my slim body\n\nit was disturbing \n\n\nanother one \n\n\"what are those negative tits?\"\n\na guy looking at one of my tit pics",
      "created_utc": 1722961599.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lgqtrwi",
      "author": "Sharkfeet19",
      "body": "“Why don’t you just eat healthy, whole foods?”😵‍💫",
      "created_utc": 1722935804.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lgrhqx2",
      "author": "jm4320",
      "body": "Oh and, just eat. It can’t be that hard. It’s like stopping smoking. You’re just being stubborn",
      "created_utc": 1722948420.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgspljc",
      "author": "BuddySevere7585",
      "body": "Told my doctor eating 2 meals a day was hard because it felt like i was gaining weight and getting fat and my doctor responds with “you look just fine”. I have atypical anorexia so that means im not sick looking enough yet 🙃",
      "created_utc": 1722962936.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgt9vab",
      "author": "SarcasticSnowflake17",
      "body": "My roommate looked me dead in the eye while I was eating breakfast and said “wow that’s a lot of calories”. I was eating a bowl of lentils.",
      "created_utc": 1722969156.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lgrgbra",
      "author": "megryanreynolds",
      "body": "I have a friend who routinely tells me guys don’t want to date a woman who has an ED. Or she will send me videos of those people on TikTok who are “promoting EDs” and says how to think about food all the time is mentally unwell.",
      "created_utc": 1722947841.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgrgd61",
      "author": "megryanreynolds",
      "body": "I have a friend who routinely tells me guys don’t want to date a woman who has an ED. Or she will send me videos of those people on TikTok who are “promoting EDs” and says how to think about food all the time is mentally unwell.",
      "created_utc": 1722947857.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgs0dgt",
      "author": "starvedgemini",
      "body": "my gf constantly talking about what foods are healthy or unhealthy, or when she brings up old empires who practiced starvation as “meditation” because they thought it would “heal” them, or when she doesn’t eat in the morning because we have something to do later and says “we’re probably going to end up eating later so I just want to wait for that” stupid stupid shit. I think she has an ed aswell and just hasn’t told me because she wants to be in secret competition or something! it pisses me off beyond belief and makes me want to never eat again 😃",
      "created_utc": 1722955002.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgs5bet",
      "author": "Yuthenia",
      "body": "I needed some clean clothes to wear so I raided my bro closet. Without knowingly my mom was listening on me and handed me one of my old clothes (when I was overweight) with a smirk. I felt so embarrassed thinking that’s how everyone seees me still. I sometimes fear she hates me.",
      "created_utc": 1722956599.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgsrwp8",
      "author": "None",
      "body": "“What do you mean you can’t eat? Yes, you can! Here, open your mouth.”\n\nGIRL I KNOW HOW TO EAT😭😭",
      "created_utc": 1722963637.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgstp8r",
      "author": "O_luuu",
      "body": "Someone once said to me when out to dinner with friends. “How’s that’ eating disorder going”. I left immediately and just started crying",
      "created_utc": 1722964195.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgte8bz",
      "author": "Chaerin_Sistas",
      "body": "I remember the day I told my twin sister I'm suffering from anorexia, and right after I made my confession she said, \"Well you did start to look a lot prettier when you got sick\" and I just stared at her frowning and didn't say anything else after that.",
      "created_utc": 1722970503.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgrozlo",
      "author": "Planth1ng",
      "body": "”Will you eat if I ask my sister to make cinnamon buns”",
      "created_utc": 1722951128.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lgreyba",
      "author": "None",
      "body": "“You’re not hungry? Is that it? Just eat!”",
      "created_utc": 1722947263.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgst2ej",
      "author": "ButterflyHarpGirl",
      "body": "This isn’t something that was said, but something someone did. When this person found out I was diagnosed with anorexia when I was a teenager, they bought me an elliptical, thinking if I had a way to exercise I wouldn’t restrict. I never got into exercising, but definitely something totally against recovery for someone with AN.",
      "created_utc": 1722963996.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgsv3wi",
      "author": "Temporary-Lettuce505",
      "body": "‘step on the scale once a day. it’ll help you develop discipline when you focus on the numbers’. i had an (undiagnosed) eating disorder 4 years ago, then gained it back due to surgery, then gained some more due to depression. my dad comments on my stomach and says ‘you’re already big enough, just do more exercise so you don’t have a belly. guys don’t like that.’",
      "created_utc": 1722964631.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgtg1ca",
      "author": "rodricksimp",
      "body": "I was told this by an intake person at a psych ward: “oh did you used to be like super skinny?”\nI had just gotten out of treatment for my anorexia and that was a gut punch that caused a relapse :/",
      "created_utc": 1722971060.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgtilvs",
      "author": "Skythebluestars",
      "body": "\"You dont look anorexic\" while being uw. My body has natural curves. Bc im lantinx so yes my curves wont go away as by most people. But thankyou for the compliment 🥲",
      "created_utc": 1722971861.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgu1wcq",
      "author": "mimillamaa",
      "body": "my “friend” shaming me for eating one of my few safe foods at the time, oatmeal, when my ed was at its worst. she kept talking about how bad its macros are and how high calorie it is, how ill never lose weight if i eat it regularly. it’s a fear food for me now lol",
      "created_utc": 1722977808.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgv4ofh",
      "author": "IrishRun",
      "body": "\"you look great\"",
      "created_utc": 1722991196.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lji40wy",
      "author": "Heyplaguedoctor",
      "body": "“If you think you’re fat, you must think I’m a whale!” Not how it works Jenny. Not how it works *at all*.",
      "created_utc": 1724391620.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ltafepz",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1729655428.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgs3s1k",
      "author": "Melx_Portals17",
      "body": "\"Oh fear foods are good for you\" - My mom",
      "created_utc": 1722956106.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgst3li",
      "author": "shonapokemon",
      "body": "\"you need to eat proper food, not that\" (protein or nut bars were a safe food, and i started eating those instead of skipping lunches and not eating at all)\n\n\"how come you started eating so much / so often lately?\" (started bringing my own food into work to ensure consistent eating / 3 meals and 3 snacks a day / avoid scarcity mindset)\n\n\"you are eating really healthy lately. with a bit of junk mixed in\" (preparing and eating the exact same meals for weeks straight, without change, since i finally found food i can reliably enjoy without guilt. then binging on bad days, which is then vomited, restricted, and exercised away to maintain a visibly underweight body. though they were not aware of the purging aspect...)",
      "created_utc": 1722964006.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgt85d6",
      "author": "ry5k4",
      "body": "My ex friend stared texting me things like \"oh no I ate too much🫠🫠\" \"my mom got me a piece of cake, how heavy can it be😀\" \"I had a spoon of nutella😔😔😔😔 I shouldn't have\" etc knowing exactly I am struggling with food (my ed was one of the reason our friendship end), and when I asked her to not start this subject with me (BTW SHE ASKED ME BEFORE NOT TO TALK ABOUT IT WITH HER BC IT WAS TOO MUCH FOR HER??? like OK I fully understand and respect it but lol then why you starting?????) she TRIED TO MAKE ME FEEL BAD writing smth like \"OK I talk about it ONLY to you, so I can starve myself alone now 😶😬\" bruh",
      "created_utc": 1722968629.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgtayz9",
      "author": "Sinisterfox23",
      "body": "I have dealt with ED mainly in the past but my partner is currently in recovery from her ED. My mom grew up in the age of “mommy’s little helper” and Weight Watchers. She often says incredibly daft shit to my girlfriend that enrages me…I have told her many times to not make ANY comments about my partner’s size, eating habits etc etc. \n\nShe’ll say shit like “I wish I was as skinny as you!” “I want to look like that” It boils my fucking blood. Why is it SO hard to just…keep your goddamn opinions to yourself. My mom struggles with addiction so she’s no stranger to mental health and obsessive tendencies. Drives me insane, and obviously has been hurtful to my love.",
      "created_utc": 1722969500.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgtb4lx",
      "author": "Pure_danger911",
      "body": "My mum said if she had my control over her diet then her diabetes would be better 🤦‍♀️. \n\nMy brother said that i don’t have anorexia since my eating habits have improved. Made me think I’ve gotten fat or I need to pass out again to prove myself.\n\n‘Why don’t you exercise instead of starving yourself?’ After explaining countless times going to the gym and even doing workouts at home has me doing obsessive repetitive movements.",
      "created_utc": 1722969548.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgtbmj9",
      "author": "nervous_veggie",
      "body": "I think your friend needs to learn how ugly anorexia makes you (not you OP, ‘you’ in the universal sense)",
      "created_utc": 1722969700.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgtu6el",
      "author": "toiletparrot",
      "body": "“You’re going to live close to all these food places, you can go and pig out and then walk off the calories home.” Literally what the fuck?",
      "created_utc": 1722975440.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgtyest",
      "author": "anonymousdemigirl",
      "body": "That I’m not underweight so I can’t have an ED (see: atypical anorexia), actually the majority of people with AN are normal weight or higher — fun fact!",
      "created_utc": 1722976737.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgu0jfu",
      "author": "g59g59g59",
      "body": "my shift lead found out and said “damn i wish i had that” and my other co worker scolded her lol. we have a joking relationship but yeah it blew me lol",
      "created_utc": 1722977393.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgu1dd4",
      "author": "Avalolo",
      "body": "Me, eating my high volume breakfast that’s X cals (low)\n\nMy mom, eating her low volume breakfast that’s 4X cals: you can’t keep eating so much. You’re gonna get huge",
      "created_utc": 1722977648.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgu1fbj",
      "author": "Avalolo",
      "body": "Me, eating my high volume breakfast that’s XX cals (low)\n\nMy mom, eating her low volume breakfast that’s XXXX cals (many times higher): you can’t keep eating so much. You’re gonna get huge",
      "created_utc": 1722977664.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgu4usr",
      "author": "No-Event4806",
      "body": "Not being able to wear a bathing suit because they’re not “summer ready”, explaining they can’t eat sugar (they stupidly didn’t realise all carbs are technically sugar and what the mean is added sugar)",
      "created_utc": 1722978739.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgu5idv",
      "author": "flaming_enby",
      "body": "Feel so good that you eat a whole pizza by yourself this evening 😬 \n— my exGirlfriend",
      "created_utc": 1722978945.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgubc3k",
      "author": "Training_Ad_5779",
      "body": "“I get it. You’re not spending money on food because you’re going out clubbing and to the movies with your friends” (I don’t drink or go to the movies ever)",
      "created_utc": 1722980828.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lguwmpr",
      "author": "Dekubakaoioioi",
      "body": "When I wanted to pick what I ate for lunch but my dad said that it's just the eating disorder talking and bought me something else. I hate my dad",
      "created_utc": 1722988257.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgvb5k0",
      "author": "Zimsgirlfriend",
      "body": "To be told to just eat... ",
      "created_utc": 1722993632.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgvd2yy",
      "author": "beroneko",
      "body": "Laughed and said 'no you're not. For that you'd have to be wayyyyy skinnier'. That guy is a medical doctor by now btw",
      "created_utc": 1722994363.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgvvnpz",
      "author": "coldbrewtuesday",
      "body": "My mom insulted me after I finally confided in her. She told me I looked sick as I was getting ready to meet my boyfriends parents and they would think something was wrong with me. Then she came back 20 minutes later and asked me for some tips on weight loss “I don’t want to look like YOU but I need some tips!”. She asked me another time if I was “being anorexic” because I thought she was fat and I was avoiding looking like her? Any time I would mention anything about my disorder to her for years she would get angry and tell me to get over it. Also my abusive ex told me he wasn’t going to “waste money” taking me on dates and buying me food because I would just “get rid of it later”.",
      "created_utc": 1723001828.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgvyu1b",
      "author": "urfuckingmomma",
      "body": "bruh thats not a friend",
      "created_utc": 1723003269.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgw1yk3",
      "author": "s1nkingturtle",
      "body": "Public shamed me infront of friends&family&strangers saying stuff like “shes scared of getting fat” , “that small cookie wont make u fat” , “no wonder she doesnt eat nuts anymore..it has fats”",
      "created_utc": 1723004757.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgw2cbb",
      "author": "YourOldPalBendy",
      "body": "I had a (skinny af, no WAY dude wasn't underweight himself) psychologist tell me he didn't think I had ANY type of eating disorder once. \n\nWhile in a psych hospital that an ED residential treatment center had me go to to keep me safe while waiting for a room to open up for me in their program. I went there because I was pretty sure I was getting too close to the dying part of the whole disorder, and also was HELLA struggling with SH and SI, and all that jazz. \n\nThey discharged me before a bed opened (and kept me for less than a week) because they \"couldn't keep me since I had no meds that needed adjusting,\" so I had \"no reason to be there.\"\n\nYou'd better BELIEVE I went into my all-time most dangerous bout of ED behavior for the rest of the time I waited for a space at that treatment center. I hit my record fasting time because of that motherfucker.",
      "created_utc": 1723004946.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgw65lv",
      "author": "ShotStandard8710",
      "body": "“It’s not a belly it’s a womb” “you look healthy you haven’t put weight on since I last saw you you look good”",
      "created_utc": 1723006895.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgzgqul",
      "author": "None",
      "body": "My dad calling me a baby when I only wanted one slice of cake. I was so ready to scream at him.\n\n\nLater I tried to explain because I thought maybe he wasn't educated and he deadass blamed me for getting offended and having an eating disorder instead of apologizing.\n\n\nI don't see him anymore.",
      "created_utc": 1723057258.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lh0ket6",
      "author": "Puzzleheaded_Lie_708",
      "body": "Once I cheered up after a week without trying something sweet (not sweetened with fruit but a sweet with real sugar)  And my dad told me, oh, remember not to eat too much sugar, I mean I know he didn't say it in a bad way BUT BRO!!! Let me enjoy a small piece of treat after weeks without thinking about it so much 😭 In the end I didn't eat it and he realized it, after that he offered me a piece of my favorite cake and I rejected it.\n\n\nI know your intentions were good dad, but don't tell a person who is very strict with their food to \"be careful\" because they already know! ",
      "created_utc": 1723069750.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lh0uvrl",
      "author": "Melodramatic-anon876",
      "body": "Context: Two of my friends had a little going away event (idk what to call it) for me before my last treatment stay. \n\nFriend: “omg you’re so tiny, what do you weigh?”\n\nMe: “ *insert weight here* “\n\nFriend: *does mental calculations* “you lost *insert horrifyingly unhealthily large percentage* of you weight? That’s almost impressive!” \n\n\n\nOne of the friends has a lot of body insecurities stemming from when she struggled with addiction years ago and the changes to her body size from the misuse so she had already made some…very inappropriate comments and body comparisons to my body which was severely UW. I have talked to her about it but she gets extremely defensive and will also get extremely annoyed if I don’t answer questions about weight so I’d usually just go along with it knowing I wouldn’t have to have another interaction for a few months. I say her and I’d history to give some perspective, it doesn’t make it any less inappropriate but it does humanize the situation. We don’t talk much anymore as she still makes comments.",
      "created_utc": 1723073433.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lh1bw70",
      "author": "Born_Willingness_156",
      "body": "My dad said “you can’t have Ano because people with that are scared of food” …. 🙃 (mind you I hadn’t shared a meal with my family in 2 years at this point) while living at home",
      "created_utc": 1723079699.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lh2uj9y",
      "author": "flutterbykt",
      "body": "One of my friends in high school sent me a bunch of photos of her ribcage when she knew I was very sick. I made another friend log in to my Facebook and delete the messages so I didn't have to see them all lol. That was INSANE.\n\nWhen I relapsed at 20 and didn't realise I'd relapsed I went to my GP about various symptoms (which I now realise are bc of AN lol) and he weighed me, said well it's the same as when you were 16 (and anorexic) and told me not to worry. Then when I got a blood test done and had high cholesterol, very common for anorexics, he told me to eat less fat LOL. Like okay challenge accepted! \n\nAnother time I was getting a blood test and making general convo with the pathologist about uni. I told her I was studying nutrition and dietetics and she said \"well thats good you can get rid of all the fat people!\" It literally said eating disorder on the pathology form 😭😭 and more recently when I was getting a blood test the pathology nurse told me all about her intermittent fasting when I said I hadn't eaten yet that morning....again it said eating disorder on the form 😭\n\nPeople are soooooo hopeless",
      "created_utc": 1723107181.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lh4faoj",
      "author": "Medical_Initiative23",
      "body": "\"Hmmm, you must weigh like...150 or 160 pounds?\"  \n  \nThis was my boyfriend's response after I asked him how much he thought I weighed when he picked me up. I'm not actively anorexic anymore (been quasi-recovered for 3 ish years) but I'm still fairly thin and hearing him say such a \"high\" number was super triggering. Especially when it's apparent that I'm fairly light (I've also told him my weight before, but maybe he forgot).",
      "created_utc": 1723131395.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lh8ntxk",
      "author": "OwlFree7566",
      "body": "\"You need to stop self diagnosing yourself with things, I saw you eat ice cream yesterday\" -my brother\n\n  \nOh you mean my halo top that I had exactly one spoonful of. Yeah buddy that was the only thing I ate for the day so stop being careless when I try and tell you something emotional.",
      "created_utc": 1723187914.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhbspf0",
      "author": "Herefortheladiez",
      "body": "Just stop having an ED and eat its not that hard \n\nit hurts me more than you\n\nLol",
      "created_utc": 1723232761.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lie9f9g",
      "author": "None",
      "body": "“Why are you doing this to yourself?” Thanks mom.",
      "created_utc": 1723811349.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt49n86",
      "author": "Eh_Alright___",
      "body": "I was recently told to \"just eat something\" whicy felt insulting and hurtful.",
      "created_utc": 1729567384.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz0fhzq",
      "author": "anjkisan",
      "body": "“you’re TOO skinny” i was 110lbs and im 5’0” now why are we LYING to my face. 😭 now that im 106lbs and still the same height, no one has been making comments bc they know i will explode on them. another thing is when my mom brings up how she was 80lbs when she had anorexia, i don’t think she realises how competitive this disorder is — so she’s honestly making me worse.",
      "created_utc": 1732587916.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzd7vdg",
      "author": "SouvlTrap",
      "body": "\"I should maybe starve myself to lose weight too\" no dude you don't want to do that, the worst decision I ever made was to give up on exercise or diets for weight loss because I was \"too lazy\" and just started starving myself and now it's an endless cycle that I can't stop even if I tried",
      "created_utc": 1732773026.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mnaxfs5",
      "author": "Melodic_Economics964",
      "body": "My 2nd last therapist told me I didn't have an eating disorder I had an obsession because \"True anorexics never talk about it they hide it so you're not that. You're fine. You need to stop obsessing and take up other interests.\" I got angry and told her \"I talk about it because people are on my back. It's so triggering. How am I supposed to react?\" \n\nThat was my last session before I found another therapist.",
      "created_utc": 1744752249.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgr3csq",
      "author": "_-ollie",
      "body": "i would cry if someone told me this. EDs are so competitive...",
      "created_utc": 1722941707.0,
      "score": 49,
      "context": [
        {
          "id": "lgqj180",
          "author": "Turbulent-Ability271",
          "body": "\"My niece was anorexic! She was (some abysmally unattainable low number) kg.\"",
          "created_utc": 1722928529.0
        }
      ]
    },
    {
      "id": "lgu0wux",
      "author": "QuietObsessions",
      "body": "Part time anorexic is craaaaaazy 😭😭",
      "created_utc": 1722977507.0,
      "score": 20,
      "context": [
        {
          "id": "lgqi0ug",
          "author": "FruitSalad_24",
          "body": "I was told that I'm a 'part time anorexic' and 'not that bad' because I don't do certain behaviours (that aren't even classed as Anorexia Nervosa behaviours)",
          "created_utc": 1722927869.0
        }
      ]
    },
    {
      "id": "lgvafa7",
      "author": "MadzIsAngry",
      "body": "That would literally be EDNOS which is still an eating disorder like what????",
      "created_utc": 1722993352.0,
      "score": 11,
      "context": [
        {
          "id": "lgqi0ug",
          "author": "FruitSalad_24",
          "body": "I was told that I'm a 'part time anorexic' and 'not that bad' because I don't do certain behaviours (that aren't even classed as Anorexia Nervosa behaviours)",
          "created_utc": 1722927869.0
        }
      ]
    },
    {
      "id": "lzv1a4s",
      "author": "Awkward-Exchange-698",
      "body": "dinner offbeat chase knee ancient distinct squeeze modern fly repeat\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1733056191.0,
      "score": 2,
      "context": [
        {
          "id": "lgqi0ug",
          "author": "FruitSalad_24",
          "body": "I was told that I'm a 'part time anorexic' and 'not that bad' because I don't do certain behaviours (that aren't even classed as Anorexia Nervosa behaviours)",
          "created_utc": 1722927869.0
        }
      ]
    },
    {
      "id": "lgtjc9i",
      "author": "zillabirdblue",
      "body": "JFC, what the hell?",
      "created_utc": 1722972087.0,
      "score": 7,
      "context": [
        {
          "id": "lgqkipo",
          "author": "sj0714",
          "body": "My mom called me her little garbage disposal when I started eating more regularly",
          "created_utc": 1722929518.0
        }
      ]
    },
    {
      "id": "lgqtyn8",
      "author": "Sharkfeet19",
      "body": "Nooooooo😮‍💨",
      "created_utc": 1722935934.0,
      "score": 4,
      "context": [
        {
          "id": "lgqkipo",
          "author": "sj0714",
          "body": "My mom called me her little garbage disposal when I started eating more regularly",
          "created_utc": 1722929518.0
        }
      ]
    },
    {
      "id": "mnavqeq",
      "author": "Melodic_Economics964",
      "body": "oh no omg no that's sick! I'm so sorry you were called that.",
      "created_utc": 1744751714.0,
      "score": 1,
      "context": [
        {
          "id": "lgqkipo",
          "author": "sj0714",
          "body": "My mom called me her little garbage disposal when I started eating more regularly",
          "created_utc": 1722929518.0
        }
      ]
    },
    {
      "id": "lgqh84o",
      "author": "Weird-Flatworm860",
      "body": "Oh that sucks!! i'm sorry.",
      "created_utc": 1722927354.0,
      "score": 26,
      "context": [
        {
          "id": "lgqgeca",
          "author": "LostSoul4607",
          "body": "My mom just invalidates me all the fucking time and makes me feel awful.\n\nMy ED stems from self hatred after being raped by my former stepdad when I was little, but my mom still denies that it ever happened, so she just tells me that I enjoy making her feel like shit and that I'm a failure.\n\nI can't wait to fucking move away for college next year cause she sucks",
          "created_utc": 1722926819.0
        }
      ]
    },
    {
      "id": "lgr0jtf",
      "author": "mEJiiii",
      "body": "Omg, virtual hugs to you! You deserve better, I can't wait for you to move away from her too lol. Hopefully you'll find a better, more comfortable environment! 💙🫂",
      "created_utc": 1722940107.0,
      "score": 11,
      "context": [
        {
          "id": "lgqgeca",
          "author": "LostSoul4607",
          "body": "My mom just invalidates me all the fucking time and makes me feel awful.\n\nMy ED stems from self hatred after being raped by my former stepdad when I was little, but my mom still denies that it ever happened, so she just tells me that I enjoy making her feel like shit and that I'm a failure.\n\nI can't wait to fucking move away for college next year cause she sucks",
          "created_utc": 1722926819.0
        }
      ]
    },
    {
      "id": "lgse99w",
      "author": "Darnelllover",
      "body": "There's a special type of mother that turns everything about her. I am sorry. Love from an internet stranger ♥︎♡♥︎",
      "created_utc": 1722959432.0,
      "score": 5,
      "context": [
        {
          "id": "lgqgeca",
          "author": "LostSoul4607",
          "body": "My mom just invalidates me all the fucking time and makes me feel awful.\n\nMy ED stems from self hatred after being raped by my former stepdad when I was little, but my mom still denies that it ever happened, so she just tells me that I enjoy making her feel like shit and that I'm a failure.\n\nI can't wait to fucking move away for college next year cause she sucks",
          "created_utc": 1722926819.0
        }
      ]
    },
    {
      "id": "lgvacqc",
      "author": "MadzIsAngry",
      "body": "You're getting out of there thank god!! Get away from her and never turn back that sounds like a nightmare I'm so so sorry:(",
      "created_utc": 1722993325.0,
      "score": 3,
      "context": [
        {
          "id": "lgqgeca",
          "author": "LostSoul4607",
          "body": "My mom just invalidates me all the fucking time and makes me feel awful.\n\nMy ED stems from self hatred after being raped by my former stepdad when I was little, but my mom still denies that it ever happened, so she just tells me that I enjoy making her feel like shit and that I'm a failure.\n\nI can't wait to fucking move away for college next year cause she sucks",
          "created_utc": 1722926819.0
        }
      ]
    },
    {
      "id": "lgw66x9",
      "author": "ShotStandard8710",
      "body": "So sorry that happened",
      "created_utc": 1723006914.0,
      "score": 3,
      "context": [
        {
          "id": "lgqgeca",
          "author": "LostSoul4607",
          "body": "My mom just invalidates me all the fucking time and makes me feel awful.\n\nMy ED stems from self hatred after being raped by my former stepdad when I was little, but my mom still denies that it ever happened, so she just tells me that I enjoy making her feel like shit and that I'm a failure.\n\nI can't wait to fucking move away for college next year cause she sucks",
          "created_utc": 1722926819.0
        }
      ]
    },
    {
      "id": "lzv1cu4",
      "author": "Awkward-Exchange-698",
      "body": "arrest wide snatch ink sheet normal escape zephyr sulky lavish\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1733056233.0,
      "score": 1,
      "context": [
        {
          "id": "lgqgeca",
          "author": "LostSoul4607",
          "body": "My mom just invalidates me all the fucking time and makes me feel awful.\n\nMy ED stems from self hatred after being raped by my former stepdad when I was little, but my mom still denies that it ever happened, so she just tells me that I enjoy making her feel like shit and that I'm a failure.\n\nI can't wait to fucking move away for college next year cause she sucks",
          "created_utc": 1722926819.0
        }
      ]
    },
    {
      "id": "lzv1fcw",
      "author": "Awkward-Exchange-698",
      "body": "brave normal ghost zephyr juggle hat test soup profit straight\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1733056272.0,
      "score": 1,
      "context": [
        {
          "id": "lgra58a",
          "author": "Dependent_Setting415",
          "body": "\"OMG you've lost so much weight can you teach me how?!\" Sure thing Jan! It's really simple actually. You just need to place more importance on the number on the scales and how you are perceived by others than in your own health and happiness. I also recommend isolating yourself as much as possible so that nobody can see how dangerous your eating habits are, causing you to become incredibly lonely and then you can use that loneliness as fuel for the need to be perceived as beautiful by others. Easy peasy!",
          "created_utc": 1722945125.0
        }
      ]
    },
    {
      "id": "lh032ft",
      "author": "Sea_Gold_4864",
      "body": "At least your parents and sister give a fuck. I'm an Orphan with living parents. Thank God I have my twin sister but even she doesn't care if I'm not eating and lose weight \n\n y'all know how bad it hurts when no one gives a fuck even though you can visibly see that we are hurting. \n\nA year ago I was paralyzed in a car crash and Anna has been the only one there for me this whole time. I'm so alone and no one loves me. \n\nIm a dancer. I don't want to live without going for walks and hiking I hiked 5 miles every day. I can't do this. \n\nI just want to starve to death and I told my sister I don't want a funeral and flush my ashes down the toilet",
      "created_utc": 1723064079.0,
      "score": 0,
      "context": [
        {
          "id": "lgqilfl",
          "author": "tinylittlehare",
          "body": "“wow you know that’s really bad for you right. like it’s really dangerous!” (this was after being in the hospital and inpatient treatment for over 2 months lol) \n\n“you’re so selfish, do you know how much your ED affects me??” -my sister\n\nmy personal favorite- my parents telling people I’m anorexic as if I won a medal for it. they pretended it was terrible and they hated it, but secretly I think they were proud of me.",
          "created_utc": 1722928244.0
        }
      ]
    },
    {
      "id": "lgqffbq",
      "author": "Weird-Flatworm860",
      "body": "Oh man, i'm furious!😭 and i'm so sorry you had go through such difficult phases in life. i wish you a long healthy and happy life ahead. :)",
      "created_utc": 1722926194.0,
      "score": 22,
      "context": [
        {
          "id": "lgqf3mf",
          "author": "jarosunshine",
          "body": "“It’s better than cancer! You can just quit [using ED to lose weight] any time!”\n\n I was diagnosed with stage 3 cancer 2 years later. 🥴 (I’m in the “no evidence of disease” club as of my last check, but still struggling to “just quit” this damn ED.) \n\n\nThen there was the RN case manager for my insurance, “you can’t die from an eating disorder.” \n\n\nAnd my dad, for good measure, “don’t f*ck up. Quit this s*it. Just lose weight normally and get good grades. You’ll always be ugly.”",
          "created_utc": 1722925988.0
        }
      ]
    },
    {
      "id": "lgta5xb",
      "author": "Sinisterfox23",
      "body": "“you can’t die from an eating disorder.” This RN case manager is spreading incredibly dangerous information if they said this. Im sure im preaching to the choir here but they are gravely mistaken. EDs (particularly anorexia) have an extremely high mortality rate compared to other mental disorders.\n\n\n“Anorexia has the highest case mortality rate and second-highest crude mortality rate of any mental illness. 10,200 deaths each year are the direct result of an eating disorder—that's one death every 52 minutes.”\n\n- ANAD.org",
      "created_utc": 1722969249.0,
      "score": 5,
      "context": [
        {
          "id": "lgqf3mf",
          "author": "jarosunshine",
          "body": "“It’s better than cancer! You can just quit [using ED to lose weight] any time!”\n\n I was diagnosed with stage 3 cancer 2 years later. 🥴 (I’m in the “no evidence of disease” club as of my last check, but still struggling to “just quit” this damn ED.) \n\n\nThen there was the RN case manager for my insurance, “you can’t die from an eating disorder.” \n\n\nAnd my dad, for good measure, “don’t f*ck up. Quit this s*it. Just lose weight normally and get good grades. You’ll always be ugly.”",
          "created_utc": 1722925988.0
        }
      ]
    },
    {
      "id": "lzv1owf",
      "author": "Awkward-Exchange-698",
      "body": "wide encouraging six lush zephyr roof pen pie plants hard-to-find\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1733056421.0,
      "score": 0,
      "context": [
        {
          "id": "lgqf3mf",
          "author": "jarosunshine",
          "body": "“It’s better than cancer! You can just quit [using ED to lose weight] any time!”\n\n I was diagnosed with stage 3 cancer 2 years later. 🥴 (I’m in the “no evidence of disease” club as of my last check, but still struggling to “just quit” this damn ED.) \n\n\nThen there was the RN case manager for my insurance, “you can’t die from an eating disorder.” \n\n\nAnd my dad, for good measure, “don’t f*ck up. Quit this s*it. Just lose weight normally and get good grades. You’ll always be ugly.”",
          "created_utc": 1722925988.0
        }
      ]
    },
    {
      "id": "lzv1ua0",
      "author": "Awkward-Exchange-698",
      "body": "fanatical divide enjoy recognise unite theory spotted public yoke familiar\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1733056504.0,
      "score": 1,
      "context": [
        {
          "id": "lgqme2x",
          "author": "cheekyu",
          "body": "my partner asking how much I weigh and then going, “Oh, I would’ve expected more.”",
          "created_utc": 1722930783.0
        }
      ]
    },
    {
      "id": "lh03ff8",
      "author": "Sea_Gold_4864",
      "body": "Haha what the fuck that's so terrible 😭",
      "created_utc": 1723064188.0,
      "score": 1,
      "context": [
        {
          "id": "lgqneyy",
          "author": "None",
          "body": "My best friend texted our group chat saying : stop pretending we all know you’re anorexic… we’re in our 30s… we haven’t talked in 7 weeks",
          "created_utc": 1722931482.0
        }
      ]
    },
    {
      "id": "lxo2qgm",
      "author": "Chaerin_Sistas",
      "body": "I hate this so so much and hearing this will piss anyone off endlessly. I just have to tell myself that they’re dumbasses that don’t fully understand the >!calories in calories out rule!<\nMy sister will not stop telling me “Wow you’re eating a lot of bread you must be trying to gain weight” knowing I suffer from ana. Yea those few extra slices of bread i eat in front of you is all i eat now bug off ",
      "created_utc": 1731884881.0,
      "score": 2,
      "context": [
        {
          "id": "lgqrsge",
          "author": "Glamour-Ad7669",
          "body": "‘It’s funny that you eat that while I’m cutting it out of my diet now that I’m trying to lose weight’",
          "created_utc": 1722934443.0
        }
      ]
    },
    {
      "id": "lgr26s7",
      "author": "daisycaulfield",
      "body": "Wow you’d think with developing anorexia that parents wouldn’t engage so much in diet culture type talk. I’m really sorry you’re dealing with that.",
      "created_utc": 1722941060.0,
      "score": 14,
      "context": [
        {
          "id": "lgqie6f",
          "author": "TractorGirly",
          "body": "I've gained a lot of weight recently in my recovery, but I'm still very sensitive and self-loathing, yet my family make these little digs about how much I eat, making me feel like the greediest pig ever. For insurance, yesterday I asked if we could go to a particular library which also has a vegan bakery nearby and my dad said 'forget the library, you just want to go to the bakery!'. \nI know he's joking, but I can't take a joke, especially around eating. And I  know these things are very minor, but I feel like for us, even the smallest thing could send us spiralling.",
          "created_utc": 1722928114.0
        }
      ]
    },
    {
      "id": "lxo3m97",
      "author": "Chaerin_Sistas",
      "body": "I feel you so much, litrly ANY comment about food that is directed to me will drive me nuts. Whether it’s a positive comment or negative, it won’t escape my mind. Even if they’re directed to others it makes me go insane. I’m so sorry that your parents are insensitive and ik it feels suffocating, you’re not alone.",
      "created_utc": 1731885193.0,
      "score": 2,
      "context": [
        {
          "id": "lgqie6f",
          "author": "TractorGirly",
          "body": "I've gained a lot of weight recently in my recovery, but I'm still very sensitive and self-loathing, yet my family make these little digs about how much I eat, making me feel like the greediest pig ever. For insurance, yesterday I asked if we could go to a particular library which also has a vegan bakery nearby and my dad said 'forget the library, you just want to go to the bakery!'. \nI know he's joking, but I can't take a joke, especially around eating. And I  know these things are very minor, but I feel like for us, even the smallest thing could send us spiralling.",
          "created_utc": 1722928114.0
        }
      ]
    },
    {
      "id": "lh03rec",
      "author": "Sea_Gold_4864",
      "body": "Damn that's brutal were they just joking ??",
      "created_utc": 1723064290.0,
      "score": 1,
      "context": [
        {
          "id": "lgrhi2v",
          "author": "jm4320",
          "body": "A “friend” said just calling to see if you’re dead yet",
          "created_utc": 1722948320.0
        }
      ]
    },
    {
      "id": "lgsyt8v",
      "author": "kimba_b3ar",
      "body": "Needs to be fired. Period.",
      "created_utc": 1722965769.0,
      "score": 11,
      "context": [
        {
          "id": "lgrlteq",
          "author": "leytourmaline",
          "body": "“You’re too far gone for help,” from an eating disorder specialist who I was referred to after I was sent to the hospita.",
          "created_utc": 1722949978.0
        }
      ]
    },
    {
      "id": "lgssxvy",
      "author": "Aromatic_Note8944",
      "body": "Old people have absolutely no shame when it comes to calling people fat",
      "created_utc": 1722963957.0,
      "score": 7,
      "context": [
        {
          "id": "lgqfns1",
          "author": "Quirky_Top_8990",
          "body": "My Papa is a lovely man, but he’s extremely fatphobic and will say things like ‘I saw this man with disgusting rolls of fat’ in front of me. 🤦‍♂️",
          "created_utc": 1722926348.0
        }
      ]
    },
    {
      "id": "lgtjqml",
      "author": "zillabirdblue",
      "body": "That’s my dad. I remember he visited some old friends in Scotland and when he got home the first thing he said about this was how horrible it is that they “got fat”. Like they ruined their entire lives.",
      "created_utc": 1722972212.0,
      "score": 2,
      "context": [
        {
          "id": "lgqfns1",
          "author": "Quirky_Top_8990",
          "body": "My Papa is a lovely man, but he’s extremely fatphobic and will say things like ‘I saw this man with disgusting rolls of fat’ in front of me. 🤦‍♂️",
          "created_utc": 1722926348.0
        }
      ]
    },
    {
      "id": "lh2urql",
      "author": "Head_Priority5152",
      "body": "My partner is like this. He will very rudely fatshame people on a daily basis. Irl on TV whatever. Morbidly obsese or slightly chubby. Will ALWAYS comment. How does that help me feel better about my appearance knowing he's truly that shallow. And yes I know I'm the other side but I still FEEL fat. I feel like he thinks the same of me.",
      "created_utc": 1723107335.0,
      "score": 2,
      "context": [
        {
          "id": "lgqfns1",
          "author": "Quirky_Top_8990",
          "body": "My Papa is a lovely man, but he’s extremely fatphobic and will say things like ‘I saw this man with disgusting rolls of fat’ in front of me. 🤦‍♂️",
          "created_utc": 1722926348.0
        }
      ]
    },
    {
      "id": "lgtdo2u",
      "author": "Sinisterfox23",
      "body": "Not gonna lie, the last one made me chuckle without knowing the context. :p\n\nIt’s fucking *baffling* how so many people feel the need to share the first thing that pops into their stupid brain.",
      "created_utc": 1722970329.0,
      "score": 3,
      "context": [
        {
          "id": "lgs79f2",
          "author": "DueYogurtcloset2351",
          "body": "ugsj I'm so sorry your friend said that to you. It's crazy how a lot of people don't have the common decency to not comment on peoples' bodies or relationship with food\n\n• \"you are one of the better looking anorexics I've seen\"\\\n• \"what was your lowest weight?\"\\\n• \"you should count your calories so you know how much you're eating\"\\\n• \"don't eat that, it has too many calories/sugar/carbs/etc.\" (while reading the nutrition label of the food I was eating 👺)\\\n• \"you'd look better if you gained a few pounds\"\\\n• \"you look like a 12 year old boy\"\\\n• (people trying to guess my weight)\\\n• \"You're still hungry??\" / \"how did you eat all of that?\"\\\n• \"You're so disciplined\"\\\n• \"I could crush you\" (I HATED this one oh my god, random people would just say it out of the blue)\\\n \nOne that kinda made me laugh:\\\n\"Yo you probably shouldn't be taking food from an anorexic\"\\\n\nhope you're okay OP 🫂",
          "created_utc": 1722957220.0
        }
      ]
    },
    {
      "id": "lh04565",
      "author": "Sea_Gold_4864",
      "body": "If my man said that to me I would slap him because I'm paralyzed",
      "created_utc": 1723064407.0,
      "score": 3,
      "context": [
        {
          "id": "lgqxnhw",
          "author": "Candid-Ad9983",
          "body": "“You wanna go for a run?” My husband knowing I’m very underweight and my body could not endure a workout like that.",
          "created_utc": 1722938340.0
        }
      ]
    },
    {
      "id": "lgrxos0",
      "author": "tresjoliesuzanne",
      "body": "Which isn’t untrue, but he also knew I wasn’t eating at the time. So. I don’t really know what more he wanted from me",
      "created_utc": 1722954120.0,
      "score": 2,
      "context": [
        {
          "id": "lgrxio1",
          "author": "tresjoliesuzanne",
          "body": "My partner told me I’d be more attractive if I lost weight..",
          "created_utc": 1722954064.0
        }
      ]
    },
    {
      "id": "lgtyaii",
      "author": "Velvetvioletvinegar",
      "body": "THIS\n\nI was in the psych ward for my borderline personality disorder (and having the worst relapse/lowest weight I’d ever been at the time) and almost all the nurses and techs would say, “you’re 30?! But you’re so little!” As if age equates to size? But either way, they shouldn’t have said anything at all. It was extremely validating/triggering. It’s VERY common for people to gain weight in the psych ward due to meds and being fed 3 Hearty meals a day. Because of those nurses comments I actively threw up anything I ate in there even though I never ever ever purge because I just hate it so much.",
      "created_utc": 1722976700.0,
      "score": 2,
      "context": [
        {
          "id": "lgs2p37",
          "author": "nonexistentgrape",
          "body": "Everytime I would go for medical care getting comments about how \"tiny\" i was while i was literally there because of it lol, it makes me sick to think about how little thought or education there is about eds in healthcare, it literally served as validation for me.",
          "created_utc": 1722955759.0
        }
      ]
    },
    {
      "id": "lh04xqn",
      "author": "Sea_Gold_4864",
      "body": "Hahaha me and my twin have said that to each other when we are down bad",
      "created_utc": 1723064653.0,
      "score": 3,
      "context": [
        {
          "id": "lgtbddc",
          "author": "MaccaGroovy",
          "body": "\"Youre doing it to rebel against your parents i think\"\n\nGirl was a nutritionist at a mental health clinic after i told her i starve for control against my body and to feel small\n\nAlso even worse\n\"You look like a holocaust victim\"\nThanks dad",
          "created_utc": 1722969622.0
        }
      ]
    },
    {
      "id": "lgrbi7q",
      "author": "Hallucin8in",
      "body": "My mom 24/7, though she has good intentions and truly is trying to help 😭",
      "created_utc": 1722945743.0,
      "score": 5,
      "context": [
        {
          "id": "lgqtrwi",
          "author": "Sharkfeet19",
          "body": "“Why don’t you just eat healthy, whole foods?”😵‍💫",
          "created_utc": 1722935804.0
        }
      ]
    },
    {
      "id": "mnb7y6m",
      "author": "Melodic_Economics964",
      "body": "I understand. That is such a nasty thing to say to you. It's not a joke and it's not okay. I would cry too.",
      "created_utc": 1744755663.0,
      "score": 1,
      "context": [
        {
          "id": "lgstp8r",
          "author": "O_luuu",
          "body": "Someone once said to me when out to dinner with friends. “How’s that’ eating disorder going”. I left immediately and just started crying",
          "created_utc": 1722964195.0
        }
      ]
    },
    {
      "id": "lx1xzjz",
      "author": "OneFootDown",
      "body": "This made my heart sink",
      "created_utc": 1731568808.0,
      "score": 2,
      "context": [
        {
          "id": "lgte8bz",
          "author": "Chaerin_Sistas",
          "body": "I remember the day I told my twin sister I'm suffering from anorexia, and right after I made my confession she said, \"Well you did start to look a lot prettier when you got sick\" and I just stared at her frowning and didn't say anything else after that.",
          "created_utc": 1722970503.0
        }
      ]
    },
    {
      "id": "lxo51dn",
      "author": "Chaerin_Sistas",
      "body": "I either assume they’re not telling me the truth (especially if it’s someone who recently insulted my body/appearance) or that i need to maintain this unhealthy weight",
      "created_utc": 1731885695.0,
      "score": 2,
      "context": [
        {
          "id": "lgv4ofh",
          "author": "IrishRun",
          "body": "\"you look great\"",
          "created_utc": 1722991196.0
        }
      ]
    },
    {
      "id": "lxo3x02",
      "author": "Chaerin_Sistas",
      "body": "I hate it when people have to make it about themselves, like i don’t want to worry about your insecurities on top of mine",
      "created_utc": 1731885300.0,
      "score": 2,
      "context": [
        {
          "id": "lji40wy",
          "author": "Heyplaguedoctor",
          "body": "“If you think you’re fat, you must think I’m a whale!” Not how it works Jenny. Not how it works *at all*.",
          "created_utc": 1724391620.0
        }
      ]
    },
    {
      "id": "lxo3pnr",
      "author": "Chaerin_Sistas",
      "body": "Lucky? Haha yea i’m so lucky i’m slowly killing myself",
      "created_utc": 1731885227.0,
      "score": 1,
      "context": [
        {
          "id": "ltafepz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1729655428.0
        }
      ]
    },
    {
      "id": "lgstf6z",
      "author": "shonapokemon",
      "body": "oh, and let us not forget: \"wow, hungry today arent you?\" (yeah. thanks for reminding me. this was my only planned food today too)",
      "created_utc": 1722964108.0,
      "score": 3,
      "context": [
        {
          "id": "lgst3li",
          "author": "shonapokemon",
          "body": "\"you need to eat proper food, not that\" (protein or nut bars were a safe food, and i started eating those instead of skipping lunches and not eating at all)\n\n\"how come you started eating so much / so often lately?\" (started bringing my own food into work to ensure consistent eating / 3 meals and 3 snacks a day / avoid scarcity mindset)\n\n\"you are eating really healthy lately. with a bit of junk mixed in\" (preparing and eating the exact same meals for weeks straight, without change, since i finally found food i can reliably enjoy without guilt. then binging on bad days, which is then vomited, restricted, and exercised away to maintain a visibly underweight body. though they were not aware of the purging aspect...)",
          "created_utc": 1722964006.0
        }
      ]
    },
    {
      "id": "lgwn5uf",
      "author": "blair_doll3",
      "body": "I had this too!!!! “There are people who have a BMI of 12! You’re not sick.”",
      "created_utc": 1723017234.0,
      "score": 1,
      "context": [
        {
          "id": "lgvd2yy",
          "author": "beroneko",
          "body": "Laughed and said 'no you're not. For that you'd have to be wayyyyy skinnier'. That guy is a medical doctor by now btw",
          "created_utc": 1722994363.0
        }
      ]
    },
    {
      "id": "lgwn01o",
      "author": "blair_doll3",
      "body": "The first one actually helped me??? Knowing that woman physically can’t get rid of their uterus, so a little bump is normal!",
      "created_utc": 1723017128.0,
      "score": 1,
      "context": [
        {
          "id": "lgw65lv",
          "author": "ShotStandard8710",
          "body": "“It’s not a belly it’s a womb” “you look healthy you haven’t put weight on since I last saw you you look good”",
          "created_utc": 1723006895.0
        }
      ]
    },
    {
      "id": "lxo4qzn",
      "author": "Chaerin_Sistas",
      "body": "I don’t understand how people can be so insensitive/ignorant. It’s not like eating disorders are unheard of, and most people understand the basics of the emotions and problems that ppl with ed deal with. The day I went to the cardiologist to get a EKG test for my heartrate, a few days after i started recovering, the nurse started telling me and my mom about how hungry she was because she’s started intermittent fasting. Gee thanks!\nAlso i’m wondering about the high cholesterol thing in anorexics, i’ve never heard of it before and wondered why that is the case? Is it something to do with lack of other nutrients?",
      "created_utc": 1731885595.0,
      "score": 1,
      "context": [
        {
          "id": "lh2uj9y",
          "author": "flutterbykt",
          "body": "One of my friends in high school sent me a bunch of photos of her ribcage when she knew I was very sick. I made another friend log in to my Facebook and delete the messages so I didn't have to see them all lol. That was INSANE.\n\nWhen I relapsed at 20 and didn't realise I'd relapsed I went to my GP about various symptoms (which I now realise are bc of AN lol) and he weighed me, said well it's the same as when you were 16 (and anorexic) and told me not to worry. Then when I got a blood test done and had high cholesterol, very common for anorexics, he told me to eat less fat LOL. Like okay challenge accepted! \n\nAnother time I was getting a blood test and making general convo with the pathologist about uni. I told her I was studying nutrition and dietetics and she said \"well thats good you can get rid of all the fat people!\" It literally said eating disorder on the pathology form 😭😭 and more recently when I was getting a blood test the pathology nurse told me all about her intermittent fasting when I said I hadn't eaten yet that morning....again it said eating disorder on the form 😭\n\nPeople are soooooo hopeless",
          "created_utc": 1723107181.0
        }
      ]
    },
    {
      "id": "lxo45j5",
      "author": "Chaerin_Sistas",
      "body": "I relate to this so hard cuz I’ve started eating halo top and my sisters have started telling me its so gross that i eat the whole pint knowing i >!self harm!< when people comment about my eating \nYes i eat the whole damn pint and i’m still fucking miserable and hungry so please just stop looking at me",
      "created_utc": 1731885385.0,
      "score": 1,
      "context": [
        {
          "id": "lh8ntxk",
          "author": "OwlFree7566",
          "body": "\"You need to stop self diagnosing yourself with things, I saw you eat ice cream yesterday\" -my brother\n\n  \nOh you mean my halo top that I had exactly one spoonful of. Yeah buddy that was the only thing I ate for the day so stop being careless when I try and tell you something emotional.",
          "created_utc": 1723187914.0
        }
      ]
    },
    {
      "id": "lxo3tmp",
      "author": "Chaerin_Sistas",
      "body": "Wow! Thanks for the advice, it’s not like I’ve been thinking about that very thing every minute of every day!",
      "created_utc": 1731885267.0,
      "score": 2,
      "context": [
        {
          "id": "lt49n86",
          "author": "Eh_Alright___",
          "body": "I was recently told to \"just eat something\" whicy felt insulting and hurtful.",
          "created_utc": 1729567384.0
        }
      ]
    },
    {
      "id": "lz0i3xa",
      "author": "Weird-Flatworm860",
      "body": "i'm so sorry! Sending you love. <3",
      "created_utc": 1732588851.0,
      "score": 2,
      "context": [
        {
          "id": "lz0fhzq",
          "author": "anjkisan",
          "body": "“you’re TOO skinny” i was 110lbs and im 5’0” now why are we LYING to my face. 😭 now that im 106lbs and still the same height, no one has been making comments bc they know i will explode on them. another thing is when my mom brings up how she was 80lbs when she had anorexia, i don’t think she realises how competitive this disorder is — so she’s honestly making me worse.",
          "created_utc": 1732587916.0
        }
      ]
    },
    {
      "id": "lzvo3by",
      "author": "FruitSalad_24",
      "body": "They meant that I eat a bit more normally sometimes. I think it was just an uneducated foot -in- mouth sort of comment. Unfortunately I haven't recovered yet but I'm slowly trying to make harm reduction steps.",
      "created_utc": 1733066091.0,
      "score": 1,
      "context": [
        {
          "id": "lgqi0ug",
          "author": "FruitSalad_24",
          "body": "I was told that I'm a 'part time anorexic' and 'not that bad' because I don't do certain behaviours (that aren't even classed as Anorexia Nervosa behaviours)",
          "created_utc": 1722927869.0
        },
        {
          "id": "lzv1a4s",
          "author": "Awkward-Exchange-698",
          "body": "dinner offbeat chase knee ancient distinct squeeze modern fly repeat\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1733056191.0
        }
      ]
    },
    {
      "id": "lgtjgeg",
      "author": "sj0714",
      "body": "It didn’t help that bulimia started after hahahaha",
      "created_utc": 1722972123.0,
      "score": 6,
      "context": [
        {
          "id": "lgqkipo",
          "author": "sj0714",
          "body": "My mom called me her little garbage disposal when I started eating more regularly",
          "created_utc": 1722929518.0
        },
        {
          "id": "lgtjc9i",
          "author": "zillabirdblue",
          "body": "JFC, what the hell?",
          "created_utc": 1722972087.0
        }
      ]
    },
    {
      "id": "lzvb483",
      "author": "Dependent_Setting415",
      "body": "I did not say it. I laughed awkwardly and came up with a bullshit excuse. I wish I had the balls.",
      "created_utc": 1733060967.0,
      "score": 3,
      "context": [
        {
          "id": "lgra58a",
          "author": "Dependent_Setting415",
          "body": "\"OMG you've lost so much weight can you teach me how?!\" Sure thing Jan! It's really simple actually. You just need to place more importance on the number on the scales and how you are perceived by others than in your own health and happiness. I also recommend isolating yourself as much as possible so that nobody can see how dangerous your eating habits are, causing you to become incredibly lonely and then you can use that loneliness as fuel for the need to be perceived as beautiful by others. Easy peasy!",
          "created_utc": 1722945125.0
        },
        {
          "id": "lzv1fcw",
          "author": "Awkward-Exchange-698",
          "body": "brave normal ghost zephyr juggle hat test soup profit straight\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1733056272.0
        }
      ]
    },
    {
      "id": "lxo2blz",
      "author": "Chaerin_Sistas",
      "body": "It’s okay to feel like it’s unfair that you’re going through what is a very unfortunate situation but don’t tell someone else that their situation is better than yours. Saying “at least you…” can automatically make someone feel invalid for their own feelings",
      "created_utc": 1731884738.0,
      "score": 3,
      "context": [
        {
          "id": "lgqilfl",
          "author": "tinylittlehare",
          "body": "“wow you know that’s really bad for you right. like it’s really dangerous!” (this was after being in the hospital and inpatient treatment for over 2 months lol) \n\n“you’re so selfish, do you know how much your ED affects me??” -my sister\n\nmy personal favorite- my parents telling people I’m anorexic as if I won a medal for it. they pretended it was terrible and they hated it, but secretly I think they were proud of me.",
          "created_utc": 1722928244.0
        },
        {
          "id": "lh032ft",
          "author": "Sea_Gold_4864",
          "body": "At least your parents and sister give a fuck. I'm an Orphan with living parents. Thank God I have my twin sister but even she doesn't care if I'm not eating and lose weight \n\n y'all know how bad it hurts when no one gives a fuck even though you can visibly see that we are hurting. \n\nA year ago I was paralyzed in a car crash and Anna has been the only one there for me this whole time. I'm so alone and no one loves me. \n\nIm a dancer. I don't want to live without going for walks and hiking I hiked 5 miles every day. I can't do this. \n\nI just want to starve to death and I told my sister I don't want a funeral and flush my ashes down the toilet",
          "created_utc": 1723064079.0
        }
      ]
    },
    {
      "id": "lh0yqyo",
      "author": "Melodramatic-anon876",
      "body": "I don’t want this to come across as invalidating, just offering a perspective. \n\nOP’s dad could easily be just happy/excited she’s mentioned a bakery she might like and is normalizing enjoying yummy baked goods. To me this comes across as the opposite of diet culture and more normalizing going out for eating. OP said it was posed in a joking way and that she felt sensitive around the joke. \n\nOP-that’s amazing that you can recognize both your feelings and the situation! I hope you enjoyed the trip to the library and bakery and your recovery gets easier 🫶🏼",
      "created_utc": 1723074835.0,
      "score": 1,
      "context": [
        {
          "id": "lgqie6f",
          "author": "TractorGirly",
          "body": "I've gained a lot of weight recently in my recovery, but I'm still very sensitive and self-loathing, yet my family make these little digs about how much I eat, making me feel like the greediest pig ever. For insurance, yesterday I asked if we could go to a particular library which also has a vegan bakery nearby and my dad said 'forget the library, you just want to go to the bakery!'. \nI know he's joking, but I can't take a joke, especially around eating. And I  know these things are very minor, but I feel like for us, even the smallest thing could send us spiralling.",
          "created_utc": 1722928114.0
        },
        {
          "id": "lgr26s7",
          "author": "daisycaulfield",
          "body": "Wow you’d think with developing anorexia that parents wouldn’t engage so much in diet culture type talk. I’m really sorry you’re dealing with that.",
          "created_utc": 1722941060.0
        }
      ]
    },
    {
      "id": "lh0k0eq",
      "author": "jm4320",
      "body": "Nope. Serious",
      "created_utc": 1723069610.0,
      "score": 1,
      "context": [
        {
          "id": "lgrhi2v",
          "author": "jm4320",
          "body": "A “friend” said just calling to see if you’re dead yet",
          "created_utc": 1722948320.0
        },
        {
          "id": "lh03rec",
          "author": "Sea_Gold_4864",
          "body": "Damn that's brutal were they just joking ??",
          "created_utc": 1723064290.0
        }
      ]
    },
    {
      "id": "lgtd2yg",
      "author": "Sinisterfox23",
      "body": "At least where I’m located (in one of the biggest cities in the US) the professional help; inpatients and outpatients are horrible. Full of people that either dont care, dont know what the fuck theyre talking about or actively doing harm and triggering the *shit* out of their patients. \n\nIs this pretty common from anyone else’s experiences? It’s legitimately hard to believe just how bad the state of affairs is, and how low the bar is, for professional ED recovery institutions.",
      "created_utc": 1722970149.0,
      "score": 8,
      "context": [
        {
          "id": "lgrlteq",
          "author": "leytourmaline",
          "body": "“You’re too far gone for help,” from an eating disorder specialist who I was referred to after I was sent to the hospita.",
          "created_utc": 1722949978.0
        },
        {
          "id": "lgsyt8v",
          "author": "kimba_b3ar",
          "body": "Needs to be fired. Period.",
          "created_utc": 1722965769.0
        }
      ]
    },
    {
      "id": "lh03ly1",
      "author": "Sea_Gold_4864",
      "body": "But.. if I got fat that would ruin my life lmao",
      "created_utc": 1723064243.0,
      "score": 2,
      "context": [
        {
          "id": "lgqfns1",
          "author": "Quirky_Top_8990",
          "body": "My Papa is a lovely man, but he’s extremely fatphobic and will say things like ‘I saw this man with disgusting rolls of fat’ in front of me. 🤦‍♂️",
          "created_utc": 1722926348.0
        },
        {
          "id": "lgtjqml",
          "author": "zillabirdblue",
          "body": "That’s my dad. I remember he visited some old friends in Scotland and when he got home the first thing he said about this was how horrible it is that they “got fat”. Like they ruined their entire lives.",
          "created_utc": 1722972212.0
        }
      ]
    },
    {
      "id": "lgutwgo",
      "author": "DueYogurtcloset2351",
      "body": "It is!! And then they have the nerve to get all mad when you don't want to tell them about anything having to do with it. Make it make sense",
      "created_utc": 1722987282.0,
      "score": 1,
      "context": [
        {
          "id": "lgs79f2",
          "author": "DueYogurtcloset2351",
          "body": "ugsj I'm so sorry your friend said that to you. It's crazy how a lot of people don't have the common decency to not comment on peoples' bodies or relationship with food\n\n• \"you are one of the better looking anorexics I've seen\"\\\n• \"what was your lowest weight?\"\\\n• \"you should count your calories so you know how much you're eating\"\\\n• \"don't eat that, it has too many calories/sugar/carbs/etc.\" (while reading the nutrition label of the food I was eating 👺)\\\n• \"you'd look better if you gained a few pounds\"\\\n• \"you look like a 12 year old boy\"\\\n• (people trying to guess my weight)\\\n• \"You're still hungry??\" / \"how did you eat all of that?\"\\\n• \"You're so disciplined\"\\\n• \"I could crush you\" (I HATED this one oh my god, random people would just say it out of the blue)\\\n \nOne that kinda made me laugh:\\\n\"Yo you probably shouldn't be taking food from an anorexic\"\\\n\nhope you're okay OP 🫂",
          "created_utc": 1722957220.0
        },
        {
          "id": "lgtdo2u",
          "author": "Sinisterfox23",
          "body": "Not gonna lie, the last one made me chuckle without knowing the context. :p\n\nIt’s fucking *baffling* how so many people feel the need to share the first thing that pops into their stupid brain.",
          "created_utc": 1722970329.0
        }
      ]
    },
    {
      "id": "lgto1e3",
      "author": "med10cre_at_best",
      "body": "You deserve better than that :(",
      "created_utc": 1722973551.0,
      "score": 3,
      "context": [
        {
          "id": "lgrxio1",
          "author": "tresjoliesuzanne",
          "body": "My partner told me I’d be more attractive if I lost weight..",
          "created_utc": 1722954064.0
        },
        {
          "id": "lgrxos0",
          "author": "tresjoliesuzanne",
          "body": "Which isn’t untrue, but he also knew I wasn’t eating at the time. So. I don’t really know what more he wanted from me",
          "created_utc": 1722954120.0
        }
      ]
    },
    {
      "id": "lgsi6nj",
      "author": "Sharkfeet19",
      "body": "🩷🩷🩷🩷",
      "created_utc": 1722960659.0,
      "score": 1,
      "context": [
        {
          "id": "lgqtrwi",
          "author": "Sharkfeet19",
          "body": "“Why don’t you just eat healthy, whole foods?”😵‍💫",
          "created_utc": 1722935804.0
        },
        {
          "id": "lgrbi7q",
          "author": "Hallucin8in",
          "body": "My mom 24/7, though she has good intentions and truly is trying to help 😭",
          "created_utc": 1722945743.0
        }
      ]
    },
    {
      "id": "lxo5dsd",
      "author": "Chaerin_Sistas",
      "body": "It really made my stomach turn, i felt so betrayed. She started suffering from disordered behaviors as well not too long after and we had a talk about it the other day and I reminded her of what she said to me but she didn’t remember and apologized for it. It doesn’t change the fact that i still believe her words but I’m glad she’s at least a decent person",
      "created_utc": 1731885817.0,
      "score": 1,
      "context": [
        {
          "id": "lgte8bz",
          "author": "Chaerin_Sistas",
          "body": "I remember the day I told my twin sister I'm suffering from anorexia, and right after I made my confession she said, \"Well you did start to look a lot prettier when you got sick\" and I just stared at her frowning and didn't say anything else after that.",
          "created_utc": 1722970503.0
        },
        {
          "id": "lx1xzjz",
          "author": "OneFootDown",
          "body": "This made my heart sink",
          "created_utc": 1731568808.0
        }
      ]
    },
    {
      "id": "lxodabz",
      "author": "Heyplaguedoctor",
      "body": "Exactly! Like, why guilt trip someone for having a mental illness?",
      "created_utc": 1731888588.0,
      "score": 2,
      "context": [
        {
          "id": "lji40wy",
          "author": "Heyplaguedoctor",
          "body": "“If you think you’re fat, you must think I’m a whale!” Not how it works Jenny. Not how it works *at all*.",
          "created_utc": 1724391620.0
        },
        {
          "id": "lxo3x02",
          "author": "Chaerin_Sistas",
          "body": "I hate it when people have to make it about themselves, like i don’t want to worry about your insecurities on top of mine",
          "created_utc": 1731885300.0
        }
      ]
    },
    {
      "id": "lgwo9ik",
      "author": "ShotStandard8710",
      "body": "The person who said it to me when I got body dysmorphia on top of AN hasn’t had kids so didn’t help me but each to their own",
      "created_utc": 1723017966.0,
      "score": 1,
      "context": [
        {
          "id": "lgw65lv",
          "author": "ShotStandard8710",
          "body": "“It’s not a belly it’s a womb” “you look healthy you haven’t put weight on since I last saw you you look good”",
          "created_utc": 1723006895.0
        },
        {
          "id": "lgwn01o",
          "author": "blair_doll3",
          "body": "The first one actually helped me??? Knowing that woman physically can’t get rid of their uterus, so a little bump is normal!",
          "created_utc": 1723017128.0
        }
      ]
    },
    {
      "id": "lgwod45",
      "author": "ShotStandard8710",
      "body": "Mines like a pouch tho like I just can’t get it flat no matter what I do I researched it it could be genetics or hormonal",
      "created_utc": 1723018032.0,
      "score": 1,
      "context": [
        {
          "id": "lgw65lv",
          "author": "ShotStandard8710",
          "body": "“It’s not a belly it’s a womb” “you look healthy you haven’t put weight on since I last saw you you look good”",
          "created_utc": 1723006895.0
        },
        {
          "id": "lgwn01o",
          "author": "blair_doll3",
          "body": "The first one actually helped me??? Knowing that woman physically can’t get rid of their uterus, so a little bump is normal!",
          "created_utc": 1723017128.0
        }
      ]
    },
    {
      "id": "lkkmtal",
      "author": "Sea_Gold_4864",
      "body": "I've been an addict and experienced similar I'm sorry sweetie",
      "created_utc": 1724967416.0,
      "score": 1,
      "context": [
        {
          "id": "lgrhi2v",
          "author": "jm4320",
          "body": "A “friend” said just calling to see if you’re dead yet",
          "created_utc": 1722948320.0
        },
        {
          "id": "lh03rec",
          "author": "Sea_Gold_4864",
          "body": "Damn that's brutal were they just joking ??",
          "created_utc": 1723064290.0
        },
        {
          "id": "lh0k0eq",
          "author": "jm4320",
          "body": "Nope. Serious",
          "created_utc": 1723069610.0
        }
      ]
    },
    {
      "id": "lgw2zp6",
      "author": "YourOldPalBendy",
      "body": "I spent a lot of time in generic mental health treatment in the Midwest, and I can say with confidence that it's similar there. With an added bonus of their limited funding being pulled more and more so there's even less of the terrible resources that are still all those people have. \n\nI've only been to one ED treatment center, and my insurance cut me two weeks in because I was \"doing too well.\" AKA, actually TRYING. The only reason I was able to stay for TWO weeks was because the psychiatrist there started me on a new depression med as an excuse (needing to monitor the adjustment to it or whatever). Soooo... I don't have much knowledge about those specifically. Not from personal experience, anyway.",
      "created_utc": 1723005269.0,
      "score": 1,
      "context": [
        {
          "id": "lgrlteq",
          "author": "leytourmaline",
          "body": "“You’re too far gone for help,” from an eating disorder specialist who I was referred to after I was sent to the hospita.",
          "created_utc": 1722949978.0
        },
        {
          "id": "lgsyt8v",
          "author": "kimba_b3ar",
          "body": "Needs to be fired. Period.",
          "created_utc": 1722965769.0
        },
        {
          "id": "lgtd2yg",
          "author": "Sinisterfox23",
          "body": "At least where I’m located (in one of the biggest cities in the US) the professional help; inpatients and outpatients are horrible. Full of people that either dont care, dont know what the fuck theyre talking about or actively doing harm and triggering the *shit* out of their patients. \n\nIs this pretty common from anyone else’s experiences? It’s legitimately hard to believe just how bad the state of affairs is, and how low the bar is, for professional ED recovery institutions.",
          "created_utc": 1722970149.0
        }
      ]
    }
  ]
}