{
  "id": "1ephhmb",
  "subreddit": "AnorexiaNervosa",
  "author": "Gambo4theLambo",
  "created_utc": 1723371369.0,
  "title": "My 11y.o Son just diagnosed with Anorexia Nervosa",
  "selftext": "My son is a beautiful young boy, very sporty, very smart. Whilst at school a few events unknown to us resulted in him thinking he was fat (he was probably less than 8% body fat at the time). Things got worse over six months but we still didn’t realise he had A.N. \nAbout 6 weeks ago I took him to the doctors and mental heath clinic and they immediately noticed what they were dealing with. They have started implementing a “family based therapy” approach where they coach us how to respond to our son’s remarks etc and we then take all control of food. We have to choose the food types, the amount and the frequency.\nAfter 3 weeks of this it seems like he is just getting worse and worse and is still losing weight no matter how hard we try to get him to eat. His tantrums have gone next level, it’s like he is possessed and saying terrible things we’ve never heard from him before, even to his grandparents- the people he adores the most), and then switches back to our child and is so concerned he is ruining everyone’s lives and cries for help. \nThe psychiatrist has warned that we may need to medicate him soon and not allow him to play sport (the one thing that makes him happy at the moment). \n\nWe are terrified, heartbroken and don’t know what to do. I don’t know what I am asking in this post, but if you have any tips, or have had similar experiences I would appreciate any knowledge or understanding I can gain. \n\nThanks \n",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ephhmb/my_11yo_son_just_diagnosed_with_anorexia_nervosa/",
  "score": 225,
  "num_comments": 56,
  "comments": [
    {
      "id": "lhkhp9h",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1723371369.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhlig2q",
      "author": "attimhsa",
      "body": "Anorexia is a mental disorder that shows physical symptoms. \n\nNever doubt that.",
      "created_utc": 1723388508.0,
      "score": 76,
      "context": []
    },
    {
      "id": "lhkoarw",
      "author": "None",
      "body": "It‘s important to know that an Eating Disorder, in this case obviously anorexia, is not just about to eat. He needs to understand and see it himself that he is good and beautiful, no matter how much he weighs. Try to show him that food is not bad. Never force him to eat!! Maybe it would help when he can choose himself what he wants to eat, looking for safe food, so food which is not making him feel bad. Much love to u and ur son, hopefully he can be able to see his worth and recover!",
      "created_utc": 1723375512.0,
      "score": 150,
      "context": []
    },
    {
      "id": "lhklns2",
      "author": "nepheleene",
      "body": "The main issue with recovery is always that, no matter how much you want to help as an outsider, it is the ill person that has to decide for themselves to recover. Unless this happens, there is little you can do.\nI don't know how bad it is already but you might want to think about hospitalisation.",
      "created_utc": 1723373957.0,
      "score": 104,
      "context": []
    },
    {
      "id": "lhkn65j",
      "author": "yarn-and-sad-poems",
      "body": "Hey I understand this. I've had anorexia for 2.5 years and did fbt back at the start. It was a horrendous experience that traumatised my entire family. My parents, like you, were scared and alone and didn't know what to do and fbt was the only offered support in my area.\nI would not recommend it. Instead, engage a dietician and some form of therapy as an absolute priority. If he's involved and invested there is a far higher chance of recovery. I don't know where you are but there are many public mental health services available, or private if that's not feasible. For me, having a space to talk about my emotions and the trauma from fbt was central to my improvement.\nFor me, fbt was extremely invalidating to my person hood but was constantly pushed due to its \"gold standard\" (meaning people just weight restore) when in fact it causes severe trauma. Weight restoration tbh is the last thing to worry about - anorexia is a mental health condition.\nYour son clearly has loving parents who want the best for him, and I pray that he finds his way out. His having a space to be validated and process emotions in a specific, trained environment in the field of mental health is vital and in my experience you just don't get that with fbt.\nAnyway, I'm just an internet stranger and I don't know you but I empathise with your struggle. Look after yourself and learn about real experiences of eds (being on here is an amazing start) and I wish you and especially your son the absolute best.\nHugs 💕",
      "created_utc": 1723374861.0,
      "score": 53,
      "context": []
    },
    {
      "id": "lhlsifc",
      "author": "GardenRake_",
      "body": "anorexia will make you dull, boring, angry, and stupid. it just does. it absolutely dissolves your brain to the point of being a shell of yourself, and it destroys your life to the point where the ed is all you have going for you. love him regardless. he doesn't need to be beautiful, smart or sporty to be loved and worthy, he is loveable and perfect regardless of those things. that's what's important. \n\nanorexics are critical and perfectionists and if our sense of worth is reliant on anything that requires any degree of upkeep then we will obsess over it to a critical degree, and when anorexia takes it from us we feel like it takes our identity too, and the ed replaces it until anorexia is our friend, our hobby, our job and our identity. \n\nmake sure he doesn't think you only see him for all the things his ed may and eventually will take from him or he will only grasp harder onto the one thing that's been consistent for him.make sure he knows you love him because of HIM. not because he's energetic, not because he's accomplished, not because he's your son. you love him because he is him. \n\nif its dangerous for him to play sports then it could be necessary to take him out of that but fill it with something else. make plans with him and spend time with him, let him spend as much time with his friends as possible and try to make sure food isn't a factor in those plans. it sounds counter productive but the anxiety is a social deterrent, but loneliness is a massive fuel for eds too. \n\nfood and recovery are one part of his life, his friends and family and hobbies are a totally separate part and you can start bringing them closer and closer together as he improves, until his social life is rewarding enough to be a motivation to eat better once he's comfortable enough for the food not to put him off spending time with people if that makes sense. but for now the anxiety from food will only make him reclusive, build up his social life and his hobbies to the best of his abilities without that anxiety, and then slowly slowly slowly introduce it back.",
      "created_utc": 1723391908.0,
      "score": 19,
      "context": []
    },
    {
      "id": "lhkslj2",
      "author": "CommunistBarabbas",
      "body": ">My son is a beautiful young boy, very sporty, very smart.\n\n\nthis has nothing to do with your sons diagnosis. i want to start this off with how so many parents have a “what happened to who you *used to be*” moment with their kids and it makes their kids feel even worse so please consider that when talking to/about your child. \n\nyou’re doing great by getting your son help (you’d be shocked the amount of parents that encourage/turn a blind eye). this is all about how he sees himself and what he expects of himself, you can help by not just encouraging him to eat but with self-esteem building.",
      "created_utc": 1723377826.0,
      "score": 74,
      "context": []
    },
    {
      "id": "lhll8q7",
      "author": "Chanelx99",
      "body": "I developed anorexia at about the same age as your son so hopefully I can share some insight you might find helpful. First of all, I’m very sorry you and your family are experiencing this. I realize this is a stressful time for all of you. \n\nDeveloping Ana at such a young age would lead me to believe there is some other underlying mental health condition. OCD, ptsd, anxiety, or something like that. If he isn’t already receiving treatment, I would suggest setting him up with weekly counseling. Not ED focused, just talk therapy. Treating the underlying condition is CRUCIAL for recovery. \n\nYou mentioned that you’ve been in full control of his diet and that he is still losing weight. That tells me he is vomiting, using laxatives, or exercising excessively behind your back. There’s no other explanation and don’t let him convince you there is. Eating disorders make you lie and be sneaky even if it isn’t in your character to do so. Make sure there are no laxatives in the home accessible to him. Read into signs of bulimia (bruised knuckles, hair loss, etc) to see if it fits his behaviors. If he’s running to the bathroom after every meal there’s your answer. I know you are a very involved mama but he might need even MORE supervision to prevent further weight loss. \n\nThe more weight you lose the less of a grip on reality you have because your brain isn’t functioning properly. Which would explain the emotional outbursts and illogical behavior. He’s also getting closer to puberty age so that is probably a factor as well. \n\nGenerally I don’t advise invading your child’s privacy but this is his health and future here. His brain is still developing. I think you should do a quick glance at his social media pages to see if he’s following harmful “pro Ana” content, look in hidy holes in his room for hidden food or vomit, clothing pockets even. I’ve seen people hide food in their hair and under their nails. Be very vigilant. No long sleeves or hoodies at the dinner table. When he grows up he’ll see how much you cared and thank you for it but for now you have to be the bad guy so he has a future. I’m not trying to scare you, but this disease has taken the life of 3 of my friends. 1 at the age of 16. As horrible as you may feel invading his space, it could save his life. \n\nIf all else fails, in-patient treatment is your last resort option. It is effective if done properly. Do your research when finding a facility for him because the care he receives in-patient could make or break his recovery. I’ve been to amazing  in-patient centers that actually care about the patients and I’ve been to facilities where the staff is just there for a paycheck. It makes a huge difference. \n\nYou’re already doing a good job so just keep the ball rolling. Show him how much you care. Make sure he knows no one is angry with him. Wishing you and your family a smooth recovery! I didn’t intend to write such a long response but with him being so young this sounded all too familiar to me",
      "created_utc": 1723389466.0,
      "score": 24,
      "context": []
    },
    {
      "id": "lhmd3ql",
      "author": "_ALLuR3",
      "body": "Controlling his behavior is not the way, you need to shower that boy in love especially when he is raging. That behavior is coming from a place of fear and possibly a belief he is unlovely all together & not worthy of eating (speaking from my individual perspective with anorexia). When approaching meals or snacks, be an encourager not an enforcer. When anyone comes in hot and tries to strong arm me into eating, you better believe I’m doubling down and can hold out like nothing else— a battle over what was only intended as a decline of one meal could send me into a hunger strike for several days depending upon how much force or threat that person tried to impose upon me. That is not because I’m obstinate, but because my eating disorder is the only thing I feel safe and protected by and the thought to relinquish that (especially in a tense environment ) is something I couldn’t endure. If I’d give one piece of advice, please try to separate the eating disorder from your son. Don’t begin treating your son as the disorder when you become frustrated.You might not recognize him as your son when he’s engaging in the eating disorder but try to see past the behaviors. Feeling rejected by a loved one because of the eating disorder is the most alienating experience. Eating disorders are weird, at one moment you feel safe and protected by it, at other moments it feels like you’re enslaved to a cruel demon much more powerful than you who is tormenting your mind  and your to terrified to “disobey” their (the ED rules )",
      "created_utc": 1723398903.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lhm2zmj",
      "author": "According-Activity10",
      "body": "I've compared it before to addiction. In the same way an alcoholic thinks about alcohol all the time, an anorexic thinks about food all the time. Either restriction, amount, what they have to do for a deficit, etc. Addiction is a disease, anorexia is paradoxical addiction (the addiction is restriction). \n\nThe other similarity is when your loved one has an addiction/eating disorder, you think about where they're gonna get their DOC or food/lack there of from too. So it becomes your co-addiction. \n\n9/10 addiction based diseases have the mental health component. My anorexia is so tied to my OCD and some other variables. You can kill a spider everytime you see one, or you can figure out where they're getting in from and fix the problem more long term. I think finding a good cognitive behavioral therapist might be a good choice, but I don't know much about CBT and children so anyone else can feel free to chime in.  It's the only thing that really ever worked for me. I also have made healthy eating into a game for myself and I keep a food journal and track the macro nutrition so I know I'm getting the most from my food fuel. I will never have a truly happy and healthy relationship with food but I want to LIVE and therapy has helped me realize that's the perogative. \n\nYoure doing your best, and it's SCARY. No one noticed my ED until I was 19 and it started at 10. You're doing so well by him. I promise. Therapy will help him value himself more, he already knows you do. I really hope you get to a better place with this. I can't imagine how scared I'd be if I were one of my kids (I have two little boys myself now).",
      "created_utc": 1723395476.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lhkynp0",
      "author": "EpicCreeper111",
      "body": "I’m really glad everyone is supportive. I would recommend to find a residential program if you have any in your area. I’ve been to those programs and they have really helped me.",
      "created_utc": 1723380750.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lhlh0wd",
      "author": "MeMarieandI",
      "body": "I just want to send you good luck wishes and the biggest hug❤️ Please take care of yourself too and remember that this is temporary.",
      "created_utc": 1723388015.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lhnstpt",
      "author": "None",
      "body": "Please do not harm your child by taking away all of his power and forcing food on him. It’s all with good intentions, but my parents took a similar approach and it made things worse. I understand why it would be tempting to monitor him this closely, and I’m not recommending that you just look away. But, he needs to feel like he has some control in his life for him to even have a chance at healing right now. I don’t know what that looks like for your family…but trust needs to be rebuilt and your son needs to feel capable. Like he can take control in possible ways that serve him, rather than negative ways like coping devices with his ED.",
      "created_utc": 1723416712.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lhodgkt",
      "author": "BohBellaMia",
      "body": "    My youngest developed anorexia around the same age. We tried our best to manage it at home, for about a year, but my wife and I realized we were not equipped to deal with it. I made the decision to admit her to our local children’s hospital, where her doctor was an attending in the ED center. The two weeks gave her some perspective, but in the end, we admitted her to a residential program. \n     All the centers in our state were full, so we had to send her 3 states away. I think I had been away from her maybe twice since she was born and I had to send my baby hours away. But in hindsight, it was the best thing we could have ever done for her. She had 24 hour care, access to therapists, doctors, nurses, dietitians, personal chefs. Her food was monitored, she had both group and personal therapy, and we zoomed in for family sessions. We visited every single week on Fridays. It was incredibly difficult. There were ups and downs. There were tears and arguments, but those eventually gave way to laughs that we hadn’t heard in so long and smiles as she learned more about how to handle herself and accepting who she was. \n    My wife and I learned a lot and realized a lot of what we were doing prior to residential was probably not the best approach, but we learned to forgive ourselves. We are a year out now and we now have a new normal. The ED is still there - I can see it lurking from time to time but we have the tools now to recognize when it appears and how to work through it. \n    The residential program saved her. It was one of the hardest decisions to make, and I fought it for so long, but it truly turned everything around. I’ll pray for you and please know you are not alone.",
      "created_utc": 1723424687.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lho19na",
      "author": "scrolling-for-fifi",
      "body": "in my personal experience, fbt can be extremely difficult and overwhelming for a young person - especially at just 11 years old. it can easily make the child feel like they’re not being listened to, and everyone is against them, even when this isn’t the case and you truly just want the best for them.\n\ni would recommend trying to make mealtimes as stress-free as possible, listen to and validate his feelings, and display unrestricted food habits yourself! be a model to show that food isn’t the enemy, positively reinforce his hood behaviours, and show empathy and compassion when he struggles. \n\navoid sayings like ‘i promise we won’t let you get fat’, because whilst this sounds like it would be comforting, it reinforces the idea that ‘having body fat’ and ‘increasing in weight’ are bad things, which should be avoided, and this will feed into the eating disorder.\n\nit’s a difficult difficult journey, and it won’t be easy. it’ll take time, effort, energy and will be exhausting, but i promise you can help your son combat this. there is light on the other side!!! \n\nalways happy to answer any questions or provide advice if i can, best of luck to you op 💗",
      "created_utc": 1723419899.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lsrmoj1",
      "author": "Aggressive-Coyote467",
      "body": "I am so sorry. It pains me and I relate to your son. I was also a child, 11 years old when I was hospitalized for severe anorexia. Please take this as seriously as possible because death is literally knocking at his door. Heart failure is the most common cause of death in anorexia. I know fellow individuals who while I was hospitalized had passed and due to refusal to eat or drink fluids could not be revived. Treat this as an addict who is addicted to heroine. Meaning you have to make the hard choice as my mom did, thank goodness she had sent me to a residential facility after hospitalization where they had me there for 6-8 months before I was able to go back home",
      "created_utc": 1729383124.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lhktcx2",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1723378216.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhoe4rn",
      "author": "skidaddleskidoodle24",
      "body": "a lot of people have given advice but i just wanna say u go mom! when i was going through this neither the doctors nor my parents raised a red flag. my parents just villainized me for not eating. you’re doing great and i hope your son is ok.",
      "created_utc": 1723424956.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhpdx1v",
      "author": "None",
      "body": "oh my god :((( im so sorry",
      "created_utc": 1723441809.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhpju8l",
      "author": "ScottishWidow64",
      "body": "Hi, my heart is with you. I’ve had disordered eating since I was 14, I am now 59. I remember when I was first diagnosed with anorexia the fear in me was terrifying but I didn’t have ‘present’ parents. \nYour son is very young and will be very scared as he has no understanding of what is happening. Firstly, I would encourage you to have a meeting with his school. It could be there is an exact trigger somewhere and needs to be avoided until he is stronger. \nYoung children can be traumatized easily as they have not developed enough coping skills. It is imperative you find someone who is an eating disorders specialist and not just a general psychiatrist/therapist. It is heartbreaking for family ( I know ) as they want to understand, support and help their child but patience and love are two very important qualities to show him. It is hard not to be frustrated and just want him to eat and at times perceived as angry by him and this causes more stress unfortunately. Never for get to look after yourself in this time. I know you will be exhausted. \nAlso, you probably already know or maybe he is already taking vitamins and minerals etc. Nutrition-drink is good for children. If you want to talk I am here for you…sending strength and a friendly hug.",
      "created_utc": 1723445538.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhppmsy",
      "author": "pathologicalprotest",
      "body": "I have come to understand that Family Based Therapy can be a VERY mixed bag, but I wouldn’t doscourage you. Individual therapy for your son and you seeing a registered dietician would be my advice.\n\nI feel for your son, and you. I’m sorry this is happening. Don’t underestimate the psychological aspect despite the physical symptoms being alarming.\n\nHere are some resources in case you haven’t been given them: https://capp.ucsf.edu/sites/g/files/tkssra6871/f/Family%20Resources%20for%20Eating%20Disorders%20%28PDF%29.pdf",
      "created_utc": 1723449428.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhth44u",
      "author": "american-teen",
      "body": "I also did family based treatment for a few years after my diagnosis at 17! The tantrums/panic attacks around meals are so tough, but I found a few ways to help with those. The first thing is heat/cool therapy. When I started to freak out, holding ice or taking a cold shower helped me to ground myself. In addition, stopping the sport that I loved so much helped me. As a teen, I was a state level tennis player, but I quickly found that my sport was tied to a lot of bad memories. Now, I exercise in different ways, but still have to be very careful with activity trackers. During my most recent relapse, medication helped so much. I take an antidepressant and an anxiety medication. I am glad your son has you to support him!",
      "created_utc": 1723501152.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhtkwfv",
      "author": "Mistii222",
      "body": "When i was at my worst, around age 12 or 13, my mum used to often say it was like dealing with a demon that wasn't me. I hope things get better soon. Apparently if you get over a certain weight the anorexia demon winds down",
      "created_utc": 1723502493.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhu4owx",
      "author": "chicadoro16",
      "body": "I read \" we now have complete control of his food\" and died inside. \n\nPlease dont take away his sports. \n\nI'm also completely against family based solutions. \n\nI eat best when I feel safe (mentally and physically), and the food meets my (insane) requirements. \n\nI'm 37 F with high functioning AN and the best living situation for my eating is sharing food with someone whos not trying to fix me. I've had it forever, but some of my school friends and their parents had no idea, because I have always felt safe eating around them. \n\nI also find distraction helps, like reading a book with breakfast,  or watching TV. \n\nI have had lots of therapy over the years from specialised therapists, and it really did help me manage it better. But the best advice I got from one of them was that (and you can fact check this) no amount of therapy makes you better. Only eating does. \n\nSo try not to do things which make eating more stressful, or a negative, pressurised, guilt ridden experience. \n\nFind out what \"safe\" foods they have and have them available all the time.  \n\nGood luck OP",
      "created_utc": 1723509670.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhvz53p",
      "author": "LetterheadLumpy5995",
      "body": "STOP the family based bs and put him in real therapy that works with him instead of making it family problem that often leads to kids never speaking to parents again.  The horror stories I hear(+my journey) about family based treatment. Put him inpatient until your child returns",
      "created_utc": 1723544218.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhw60em",
      "author": "ElkSure821",
      "body": "Mum you have got this and its not your fault remember that. A lot of parents of kids with anorexia think that it is something they have done wrong but it is not. There is something that i describe as a guilt cycle that happens between parents and children with anorexia. You feel guilty like you have done something wrong, you show anger and distress to the child -> the child feels like they are destroying their life and upsetting everyone -> the child doesn't know how to cope with negative feelings in a healthy way and continues to starve as a way to cope-> you get frustrated and show your distress again. And the cycle repeats. I am a girl not a boy but one thing I think could help you in supporting your boy is to help him to find something (sadly that thing was sport) that he really loves and can devote himself to that is more important than anorexia. Throw him into social groups where he can make friends, learn a skill (that's an important one, anorexics love an ongoing and ever improving project) ect. Your job is to be a solid foundation, treat him the same as if he never was sick, be someone that won't go away if he decides to improve. Something that perpetuates anorexia is the feeling that if you recover people won't love you/ be there for you anymore and you will have to grow up. That's why it develops around puberty usually. You've got this mum, its so hard but you will get through it. I'm sorry and I really feel for you",
      "created_utc": 1723548103.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lw00odj",
      "author": "PrettyEcho6555",
      "body": "My son is 11. He was hospitalized for severe malnutrition a s we received a diagnosis of AN. I feel very similar. He did improve while inpatient; but, it has been much harder in outpatient. Whenever they increase the amount of food he has to eat, every meal is painful. ",
      "created_utc": 1731027833.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lw010vg",
      "author": "PrettyEcho6555",
      "body": "Also, at this age, I have such a hard time explaining the disorder and what we need to do. He is very smart, but, he partially understands it ",
      "created_utc": 1731027953.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhkws7v",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1723379884.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lhu0kt0",
      "author": "Gambo4theLambo",
      "body": "Thanks so much for your insights. FBT is basically that, forcing him to eat when he doesn’t want. He even has to be supervised at school which hopefully they are doing in a dignified way 😢 my belief is that our child and us can come up with a solution together to beat this. I’m not sold on FBT and any doctor that tells me there is only one way makes me go the other direction.",
      "created_utc": 1723508144.0,
      "score": 5,
      "context": [
        {
          "id": "lhkoarw",
          "author": "None",
          "body": "It‘s important to know that an Eating Disorder, in this case obviously anorexia, is not just about to eat. He needs to understand and see it himself that he is good and beautiful, no matter how much he weighs. Try to show him that food is not bad. Never force him to eat!! Maybe it would help when he can choose himself what he wants to eat, looking for safe food, so food which is not making him feel bad. Much love to u and ur son, hopefully he can be able to see his worth and recover!",
          "created_utc": 1723375512.0
        }
      ]
    },
    {
      "id": "lhu0xh5",
      "author": "Gambo4theLambo",
      "body": "Thanks! 🙏Yesterday we had a good day, he said to his mum on the car ride home from school “mum there’s no point in not eating” as if there was a little click in his brain. He then at a lot that day with no battles. It’s a small win, and every day is different, but hopefully we are in the right track.",
      "created_utc": 1723508274.0,
      "score": 5,
      "context": [
        {
          "id": "lhklns2",
          "author": "nepheleene",
          "body": "The main issue with recovery is always that, no matter how much you want to help as an outsider, it is the ill person that has to decide for themselves to recover. Unless this happens, there is little you can do.\nI don't know how bad it is already but you might want to think about hospitalisation.",
          "created_utc": 1723373957.0
        }
      ]
    },
    {
      "id": "lhko77m",
      "author": "yarn-and-sad-poems",
      "body": "When I was in fbt, I also experienced this extreme worsening of my emotions as I was out of control, exactly as you described your son. I felt horrendous all the time and was extremely dysregulated and in a system void of support, despite having the kindest and most loving parents I could have wanted.\n The reason for this was, from my perspective, a treatment system that refused to acknowledge me as an individual and delve into my own conceptualisation of the illness. For example, a key philosophy of externalising the eating disorder voice did not resonate with me and everything I said was me \"lying or being manipulative\".\nI got out of this cycle of weight gain correlating in my parents' and the doctors' minds to recovery eventually. I refused to continue fbt and my relationship with my parents disintegrated further and further until I began to receive mental health support acknowledging the intersectionality of my personality and my anorexia. This therapist, who has been absolutely key to my improvement, helped me articulate how the controlling nature of FBT was triggering my eating disorder into a violent spiral of >!self harm!< and increasing isolation, and that the best support they could give me was to empower me to engage in and choose the direction of my own treatment.\nI'm not recovered by any stretch, but I'm happier, more fulfilled, have stronger relationships with my family and a healthier relationship to food, and have stopped both the >!self harm and losing weight!<. Talk to your son, find out his perspective, make sure he knows that you're going to support how he deals with his own mental health, and I would suggest finding alternatives to fbt.\nAgain, wishing all the best 💕",
      "created_utc": 1723375456.0,
      "score": 18,
      "context": [
        {
          "id": "lhkn65j",
          "author": "yarn-and-sad-poems",
          "body": "Hey I understand this. I've had anorexia for 2.5 years and did fbt back at the start. It was a horrendous experience that traumatised my entire family. My parents, like you, were scared and alone and didn't know what to do and fbt was the only offered support in my area.\nI would not recommend it. Instead, engage a dietician and some form of therapy as an absolute priority. If he's involved and invested there is a far higher chance of recovery. I don't know where you are but there are many public mental health services available, or private if that's not feasible. For me, having a space to talk about my emotions and the trauma from fbt was central to my improvement.\nFor me, fbt was extremely invalidating to my person hood but was constantly pushed due to its \"gold standard\" (meaning people just weight restore) when in fact it causes severe trauma. Weight restoration tbh is the last thing to worry about - anorexia is a mental health condition.\nYour son clearly has loving parents who want the best for him, and I pray that he finds his way out. His having a space to be validated and process emotions in a specific, trained environment in the field of mental health is vital and in my experience you just don't get that with fbt.\nAnyway, I'm just an internet stranger and I don't know you but I empathise with your struggle. Look after yourself and learn about real experiences of eds (being on here is an amazing start) and I wish you and especially your son the absolute best.\nHugs 💕",
          "created_utc": 1723374861.0
        }
      ]
    },
    {
      "id": "lhkrj3g",
      "author": "Quirky_Top_8990",
      "body": "I agree with this completely, FBT made my eating disorder so much worse, I think if my parents had involved me with a therapist and dietician instead I might have been able to recover a lot quicker.",
      "created_utc": 1723377278.0,
      "score": 16,
      "context": [
        {
          "id": "lhkn65j",
          "author": "yarn-and-sad-poems",
          "body": "Hey I understand this. I've had anorexia for 2.5 years and did fbt back at the start. It was a horrendous experience that traumatised my entire family. My parents, like you, were scared and alone and didn't know what to do and fbt was the only offered support in my area.\nI would not recommend it. Instead, engage a dietician and some form of therapy as an absolute priority. If he's involved and invested there is a far higher chance of recovery. I don't know where you are but there are many public mental health services available, or private if that's not feasible. For me, having a space to talk about my emotions and the trauma from fbt was central to my improvement.\nFor me, fbt was extremely invalidating to my person hood but was constantly pushed due to its \"gold standard\" (meaning people just weight restore) when in fact it causes severe trauma. Weight restoration tbh is the last thing to worry about - anorexia is a mental health condition.\nYour son clearly has loving parents who want the best for him, and I pray that he finds his way out. His having a space to be validated and process emotions in a specific, trained environment in the field of mental health is vital and in my experience you just don't get that with fbt.\nAnyway, I'm just an internet stranger and I don't know you but I empathise with your struggle. Look after yourself and learn about real experiences of eds (being on here is an amazing start) and I wish you and especially your son the absolute best.\nHugs 💕",
          "created_utc": 1723374861.0
        }
      ]
    },
    {
      "id": "lhu1qrw",
      "author": "Gambo4theLambo",
      "body": "Thank you, I value your input a HUGE amount. My belief is that our child and us can come up with a solution together to beat this. I’m not sold on FBT and any doctor that tells me there is only one way makes me go the other direction. We are meeting with the psychiatrist today and I’m going to request a counselor for him to chat to independently. I’m also going to ask for a point at which we evaluate if the FBT is the right methodology for his treatment. Did you receive CBT as well? Thanks again!",
      "created_utc": 1723508573.0,
      "score": 3,
      "context": [
        {
          "id": "lhkn65j",
          "author": "yarn-and-sad-poems",
          "body": "Hey I understand this. I've had anorexia for 2.5 years and did fbt back at the start. It was a horrendous experience that traumatised my entire family. My parents, like you, were scared and alone and didn't know what to do and fbt was the only offered support in my area.\nI would not recommend it. Instead, engage a dietician and some form of therapy as an absolute priority. If he's involved and invested there is a far higher chance of recovery. I don't know where you are but there are many public mental health services available, or private if that's not feasible. For me, having a space to talk about my emotions and the trauma from fbt was central to my improvement.\nFor me, fbt was extremely invalidating to my person hood but was constantly pushed due to its \"gold standard\" (meaning people just weight restore) when in fact it causes severe trauma. Weight restoration tbh is the last thing to worry about - anorexia is a mental health condition.\nYour son clearly has loving parents who want the best for him, and I pray that he finds his way out. His having a space to be validated and process emotions in a specific, trained environment in the field of mental health is vital and in my experience you just don't get that with fbt.\nAnyway, I'm just an internet stranger and I don't know you but I empathise with your struggle. Look after yourself and learn about real experiences of eds (being on here is an amazing start) and I wish you and especially your son the absolute best.\nHugs 💕",
          "created_utc": 1723374861.0
        }
      ]
    },
    {
      "id": "lhq73mt",
      "author": "GardenRake_",
      "body": "https://youtu.be/nqYaRCqZNmc?si=2J0CJWg36LWltqcX\n\nwas reminded of this thread by notifications and realised I had this video on the back burner. this might be worth a watch.",
      "created_utc": 1723460764.0,
      "score": 1,
      "context": [
        {
          "id": "lhlsifc",
          "author": "GardenRake_",
          "body": "anorexia will make you dull, boring, angry, and stupid. it just does. it absolutely dissolves your brain to the point of being a shell of yourself, and it destroys your life to the point where the ed is all you have going for you. love him regardless. he doesn't need to be beautiful, smart or sporty to be loved and worthy, he is loveable and perfect regardless of those things. that's what's important. \n\nanorexics are critical and perfectionists and if our sense of worth is reliant on anything that requires any degree of upkeep then we will obsess over it to a critical degree, and when anorexia takes it from us we feel like it takes our identity too, and the ed replaces it until anorexia is our friend, our hobby, our job and our identity. \n\nmake sure he doesn't think you only see him for all the things his ed may and eventually will take from him or he will only grasp harder onto the one thing that's been consistent for him.make sure he knows you love him because of HIM. not because he's energetic, not because he's accomplished, not because he's your son. you love him because he is him. \n\nif its dangerous for him to play sports then it could be necessary to take him out of that but fill it with something else. make plans with him and spend time with him, let him spend as much time with his friends as possible and try to make sure food isn't a factor in those plans. it sounds counter productive but the anxiety is a social deterrent, but loneliness is a massive fuel for eds too. \n\nfood and recovery are one part of his life, his friends and family and hobbies are a totally separate part and you can start bringing them closer and closer together as he improves, until his social life is rewarding enough to be a motivation to eat better once he's comfortable enough for the food not to put him off spending time with people if that makes sense. but for now the anxiety from food will only make him reclusive, build up his social life and his hobbies to the best of his abilities without that anxiety, and then slowly slowly slowly introduce it back.",
          "created_utc": 1723391908.0
        }
      ]
    },
    {
      "id": "lhm65q7",
      "author": "RuthMaudeJameison",
      "body": "I read that as a description of love and style. Not like smart, so why? Sporty, so why when he’s muscle? Almost like part of the personality. It reads British English style to me. Just wanted to say that because I think OP is doing their best with a LOT of love showing through. And fear. And that’s understandable.",
      "created_utc": 1723396555.0,
      "score": 20,
      "context": [
        {
          "id": "lhkslj2",
          "author": "CommunistBarabbas",
          "body": ">My son is a beautiful young boy, very sporty, very smart.\n\n\nthis has nothing to do with your sons diagnosis. i want to start this off with how so many parents have a “what happened to who you *used to be*” moment with their kids and it makes their kids feel even worse so please consider that when talking to/about your child. \n\nyou’re doing great by getting your son help (you’d be shocked the amount of parents that encourage/turn a blind eye). this is all about how he sees himself and what he expects of himself, you can help by not just encouraging him to eat but with self-esteem building.",
          "created_utc": 1723377826.0
        }
      ]
    },
    {
      "id": "lhmrtah",
      "author": "attimhsa",
      "body": "This this this this. Your son is deeply deeply unhappy; get attuned.",
      "created_utc": 1723403904.0,
      "score": 5,
      "context": [
        {
          "id": "lhkslj2",
          "author": "CommunistBarabbas",
          "body": ">My son is a beautiful young boy, very sporty, very smart.\n\n\nthis has nothing to do with your sons diagnosis. i want to start this off with how so many parents have a “what happened to who you *used to be*” moment with their kids and it makes their kids feel even worse so please consider that when talking to/about your child. \n\nyou’re doing great by getting your son help (you’d be shocked the amount of parents that encourage/turn a blind eye). this is all about how he sees himself and what he expects of himself, you can help by not just encouraging him to eat but with self-esteem building.",
          "created_utc": 1723377826.0
        }
      ]
    },
    {
      "id": "lhv1h86",
      "author": "Gambo4theLambo",
      "body": "Thanks so much for your input - I really appreciate it. We are speaking with his psychiatrist shortly and will hopefully be sorting a few of these issues out. 🙏🙏",
      "created_utc": 1723523064.0,
      "score": 1,
      "context": [
        {
          "id": "lhll8q7",
          "author": "Chanelx99",
          "body": "I developed anorexia at about the same age as your son so hopefully I can share some insight you might find helpful. First of all, I’m very sorry you and your family are experiencing this. I realize this is a stressful time for all of you. \n\nDeveloping Ana at such a young age would lead me to believe there is some other underlying mental health condition. OCD, ptsd, anxiety, or something like that. If he isn’t already receiving treatment, I would suggest setting him up with weekly counseling. Not ED focused, just talk therapy. Treating the underlying condition is CRUCIAL for recovery. \n\nYou mentioned that you’ve been in full control of his diet and that he is still losing weight. That tells me he is vomiting, using laxatives, or exercising excessively behind your back. There’s no other explanation and don’t let him convince you there is. Eating disorders make you lie and be sneaky even if it isn’t in your character to do so. Make sure there are no laxatives in the home accessible to him. Read into signs of bulimia (bruised knuckles, hair loss, etc) to see if it fits his behaviors. If he’s running to the bathroom after every meal there’s your answer. I know you are a very involved mama but he might need even MORE supervision to prevent further weight loss. \n\nThe more weight you lose the less of a grip on reality you have because your brain isn’t functioning properly. Which would explain the emotional outbursts and illogical behavior. He’s also getting closer to puberty age so that is probably a factor as well. \n\nGenerally I don’t advise invading your child’s privacy but this is his health and future here. His brain is still developing. I think you should do a quick glance at his social media pages to see if he’s following harmful “pro Ana” content, look in hidy holes in his room for hidden food or vomit, clothing pockets even. I’ve seen people hide food in their hair and under their nails. Be very vigilant. No long sleeves or hoodies at the dinner table. When he grows up he’ll see how much you cared and thank you for it but for now you have to be the bad guy so he has a future. I’m not trying to scare you, but this disease has taken the life of 3 of my friends. 1 at the age of 16. As horrible as you may feel invading his space, it could save his life. \n\nIf all else fails, in-patient treatment is your last resort option. It is effective if done properly. Do your research when finding a facility for him because the care he receives in-patient could make or break his recovery. I’ve been to amazing  in-patient centers that actually care about the patients and I’ve been to facilities where the staff is just there for a paycheck. It makes a huge difference. \n\nYou’re already doing a good job so just keep the ball rolling. Show him how much you care. Make sure he knows no one is angry with him. Wishing you and your family a smooth recovery! I didn’t intend to write such a long response but with him being so young this sounded all too familiar to me",
          "created_utc": 1723389466.0
        }
      ]
    },
    {
      "id": "lhv1qgy",
      "author": "Gambo4theLambo",
      "body": "Thanks so much for sharing those feelings. I believe that’s exactly what we’ve observed with him. We had a good day yesterday, let’s hope for another today. And yes, I agree we need another option other than FBT",
      "created_utc": 1723523191.0,
      "score": 2,
      "context": [
        {
          "id": "lhmd3ql",
          "author": "_ALLuR3",
          "body": "Controlling his behavior is not the way, you need to shower that boy in love especially when he is raging. That behavior is coming from a place of fear and possibly a belief he is unlovely all together & not worthy of eating (speaking from my individual perspective with anorexia). When approaching meals or snacks, be an encourager not an enforcer. When anyone comes in hot and tries to strong arm me into eating, you better believe I’m doubling down and can hold out like nothing else— a battle over what was only intended as a decline of one meal could send me into a hunger strike for several days depending upon how much force or threat that person tried to impose upon me. That is not because I’m obstinate, but because my eating disorder is the only thing I feel safe and protected by and the thought to relinquish that (especially in a tense environment ) is something I couldn’t endure. If I’d give one piece of advice, please try to separate the eating disorder from your son. Don’t begin treating your son as the disorder when you become frustrated.You might not recognize him as your son when he’s engaging in the eating disorder but try to see past the behaviors. Feeling rejected by a loved one because of the eating disorder is the most alienating experience. Eating disorders are weird, at one moment you feel safe and protected by it, at other moments it feels like you’re enslaved to a cruel demon much more powerful than you who is tormenting your mind  and your to terrified to “disobey” their (the ED rules )",
          "created_utc": 1723398903.0
        }
      ]
    },
    {
      "id": "lhv27fv",
      "author": "Gambo4theLambo",
      "body": "Thank you so much for your in depth insight. We will speak to the psychiatrist today about CBT. And like you, I believe there is a way together with our son, where we can devise a plan and become friends with food in some way. I hate how unindividualised his treatment has been so far. Thank you 🙏🙏🙏",
      "created_utc": 1723523430.0,
      "score": 1,
      "context": [
        {
          "id": "lhm2zmj",
          "author": "According-Activity10",
          "body": "I've compared it before to addiction. In the same way an alcoholic thinks about alcohol all the time, an anorexic thinks about food all the time. Either restriction, amount, what they have to do for a deficit, etc. Addiction is a disease, anorexia is paradoxical addiction (the addiction is restriction). \n\nThe other similarity is when your loved one has an addiction/eating disorder, you think about where they're gonna get their DOC or food/lack there of from too. So it becomes your co-addiction. \n\n9/10 addiction based diseases have the mental health component. My anorexia is so tied to my OCD and some other variables. You can kill a spider everytime you see one, or you can figure out where they're getting in from and fix the problem more long term. I think finding a good cognitive behavioral therapist might be a good choice, but I don't know much about CBT and children so anyone else can feel free to chime in.  It's the only thing that really ever worked for me. I also have made healthy eating into a game for myself and I keep a food journal and track the macro nutrition so I know I'm getting the most from my food fuel. I will never have a truly happy and healthy relationship with food but I want to LIVE and therapy has helped me realize that's the perogative. \n\nYoure doing your best, and it's SCARY. No one noticed my ED until I was 19 and it started at 10. You're doing so well by him. I promise. Therapy will help him value himself more, he already knows you do. I really hope you get to a better place with this. I can't imagine how scared I'd be if I were one of my kids (I have two little boys myself now).",
          "created_utc": 1723395476.0
        }
      ]
    },
    {
      "id": "lhv2a4b",
      "author": "Gambo4theLambo",
      "body": "💚",
      "created_utc": 1723523467.0,
      "score": 2,
      "context": [
        {
          "id": "lhkynp0",
          "author": "EpicCreeper111",
          "body": "I’m really glad everyone is supportive. I would recommend to find a residential program if you have any in your area. I’ve been to those programs and they have really helped me.",
          "created_utc": 1723380750.0
        }
      ]
    },
    {
      "id": "lhv29jw",
      "author": "Gambo4theLambo",
      "body": "💚",
      "created_utc": 1723523459.0,
      "score": 1,
      "context": [
        {
          "id": "lhlh0wd",
          "author": "MeMarieandI",
          "body": "I just want to send you good luck wishes and the biggest hug❤️ Please take care of yourself too and remember that this is temporary.",
          "created_utc": 1723388015.0
        }
      ]
    },
    {
      "id": "lhv2u83",
      "author": "Gambo4theLambo",
      "body": "Wow, thanks for sharing. Your journey sounds so heartbreaking in order to be life saving. Well done on doing what needed to be done. Amazing parents!\nWe are not there yet, but it’s good to know such centers are there should we need it. Thanks so much 🙏💚",
      "created_utc": 1723523757.0,
      "score": 1,
      "context": [
        {
          "id": "lhodgkt",
          "author": "BohBellaMia",
          "body": "    My youngest developed anorexia around the same age. We tried our best to manage it at home, for about a year, but my wife and I realized we were not equipped to deal with it. I made the decision to admit her to our local children’s hospital, where her doctor was an attending in the ED center. The two weeks gave her some perspective, but in the end, we admitted her to a residential program. \n     All the centers in our state were full, so we had to send her 3 states away. I think I had been away from her maybe twice since she was born and I had to send my baby hours away. But in hindsight, it was the best thing we could have ever done for her. She had 24 hour care, access to therapists, doctors, nurses, dietitians, personal chefs. Her food was monitored, she had both group and personal therapy, and we zoomed in for family sessions. We visited every single week on Fridays. It was incredibly difficult. There were ups and downs. There were tears and arguments, but those eventually gave way to laughs that we hadn’t heard in so long and smiles as she learned more about how to handle herself and accepting who she was. \n    My wife and I learned a lot and realized a lot of what we were doing prior to residential was probably not the best approach, but we learned to forgive ourselves. We are a year out now and we now have a new normal. The ED is still there - I can see it lurking from time to time but we have the tools now to recognize when it appears and how to work through it. \n    The residential program saved her. It was one of the hardest decisions to make, and I fought it for so long, but it truly turned everything around. I’ll pray for you and please know you are not alone.",
          "created_utc": 1723424687.0
        }
      ]
    },
    {
      "id": "lhv2ltb",
      "author": "Gambo4theLambo",
      "body": "Thank you 💚 we’ve been trying to do just that. 🙏",
      "created_utc": 1723523636.0,
      "score": 1,
      "context": [
        {
          "id": "lho19na",
          "author": "scrolling-for-fifi",
          "body": "in my personal experience, fbt can be extremely difficult and overwhelming for a young person - especially at just 11 years old. it can easily make the child feel like they’re not being listened to, and everyone is against them, even when this isn’t the case and you truly just want the best for them.\n\ni would recommend trying to make mealtimes as stress-free as possible, listen to and validate his feelings, and display unrestricted food habits yourself! be a model to show that food isn’t the enemy, positively reinforce his hood behaviours, and show empathy and compassion when he struggles. \n\navoid sayings like ‘i promise we won’t let you get fat’, because whilst this sounds like it would be comforting, it reinforces the idea that ‘having body fat’ and ‘increasing in weight’ are bad things, which should be avoided, and this will feed into the eating disorder.\n\nit’s a difficult difficult journey, and it won’t be easy. it’ll take time, effort, energy and will be exhausting, but i promise you can help your son combat this. there is light on the other side!!! \n\nalways happy to answer any questions or provide advice if i can, best of luck to you op 💗",
          "created_utc": 1723419899.0
        }
      ]
    },
    {
      "id": "lhlg03t",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 9: Don't ask users to DM you or contact you in any way off of r/AnorexiaNervosa. \n\nWhile your intentions may be good, there are a lot of creeps in the eating disorder community. Because of this, we ask that users do not do this. It will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1723387659.0,
      "score": 1,
      "context": [
        {
          "id": "lhktcx2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1723378216.0
        }
      ]
    },
    {
      "id": "lhpdjll",
      "author": "Gambo4theLambo",
      "body": "Thank you 🙏",
      "created_utc": 1723441585.0,
      "score": 1,
      "context": [
        {
          "id": "lhoe4rn",
          "author": "skidaddleskidoodle24",
          "body": "a lot of people have given advice but i just wanna say u go mom! when i was going through this neither the doctors nor my parents raised a red flag. my parents just villainized me for not eating. you’re doing great and i hope your son is ok.",
          "created_utc": 1723424956.0
        }
      ]
    },
    {
      "id": "lhu03l4",
      "author": "Gambo4theLambo",
      "body": "Thanks so much for your insights- we had a good day yesterday, a mini win, hopefully we can get to a place where the demon steps down completely. 🙏",
      "created_utc": 1723507966.0,
      "score": 1,
      "context": [
        {
          "id": "lhtkwfv",
          "author": "Mistii222",
          "body": "When i was at my worst, around age 12 or 13, my mum used to often say it was like dealing with a demon that wasn't me. I hope things get better soon. Apparently if you get over a certain weight the anorexia demon winds down",
          "created_utc": 1723502493.0
        }
      ]
    },
    {
      "id": "lw19oc7",
      "author": "Gambo4theLambo",
      "body": "I’m so sorry to hear this. We had to sneak double cream and a very high calorie powder into all of his meals. He eventually gained weight. We also discovered he had a bit of anxiety so we started him on antidepressants- he is doing really well now, as if back to normal. My heart goes out to you! Feel free to contact me further if you wish",
      "created_utc": 1731044390.0,
      "score": 1,
      "context": [
        {
          "id": "lw00odj",
          "author": "PrettyEcho6555",
          "body": "My son is 11. He was hospitalized for severe malnutrition a s we received a diagnosis of AN. I feel very similar. He did improve while inpatient; but, it has been much harder in outpatient. Whenever they increase the amount of food he has to eat, every meal is painful. ",
          "created_utc": 1731027833.0
        }
      ]
    },
    {
      "id": "lhl8jhi",
      "author": "HerElectronicHaze",
      "body": "This approach is controversial at best and for many young people with EDs, leads the ED to become much worse and destroys the relationship between the child and their parents. It can be extremely traumatic.\n\nI have read through that forum over the years and I think some of the advice there can be counterproductive and harmful.",
      "created_utc": 1723384893.0,
      "score": 3,
      "context": [
        {
          "id": "lhkws7v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1723379884.0
        }
      ]
    },
    {
      "id": "lhv5lvm",
      "author": "None",
      "body": "Oh thats honestly so sad. This is one reason why I am afraid to talk about my own anorexia. Am scared they will force me to eat. Maybe u can talk with his teachers, so u all can make up a plan. It could be really helpful when ur son has some safe food. Also I suggest cooking with him! He can see what the food is made of, how it is made etc. Maybe he can feel a bit better also, bc he made the food himself so he definitely deserves it to eat some of it (he always deserves food, his body is working non stop for him to be alive). I get the doctors told u what to do.. but with all love, this way (forcing to eat) is the wrongest way ever. It will just make people, here ur son, more afraid of food. It will become more disgusting etc..",
      "created_utc": 1723525219.0,
      "score": 4,
      "context": [
        {
          "id": "lhkoarw",
          "author": "None",
          "body": "It‘s important to know that an Eating Disorder, in this case obviously anorexia, is not just about to eat. He needs to understand and see it himself that he is good and beautiful, no matter how much he weighs. Try to show him that food is not bad. Never force him to eat!! Maybe it would help when he can choose himself what he wants to eat, looking for safe food, so food which is not making him feel bad. Much love to u and ur son, hopefully he can be able to see his worth and recover!",
          "created_utc": 1723375512.0
        },
        {
          "id": "lhu0kt0",
          "author": "Gambo4theLambo",
          "body": "Thanks so much for your insights. FBT is basically that, forcing him to eat when he doesn’t want. He even has to be supervised at school which hopefully they are doing in a dignified way 😢 my belief is that our child and us can come up with a solution together to beat this. I’m not sold on FBT and any doctor that tells me there is only one way makes me go the other direction.",
          "created_utc": 1723508144.0
        }
      ]
    },
    {
      "id": "lm4ut9d",
      "author": "2bciah5factng",
      "body": "That’s fantastic. But the truth is that it does need to be a click within his brain. You mentioned medication in the post and that really concerned me — an 11 year old boy absolutely should not be medicated for anorexia (unless it’s prescribed by a doctor — not a psychiatrist — to treat physical side effects of the disorder). Forcing him to eat won’t help anything, it will just make him hate and mistrust you, while he starts to hate himself even more. The very, very best thing you can do is make it easy for him to eat. Never comment on his body, good or bad. Don’t comment on calories or the health of food. Just make lots of calorie-dense food. Have it around all the time. Make and buy him any food he asks for. Ask him if there’s anything you could get him that he wants to eat. Eat a family meal three times a day, and invite him to eat, without judgement. I always appreciated it when the family dinner conversation wasn’t about the food or my health, but just… about what’s going on in our lives. Honestly, family dinner was the difference between my anorexia killing me and me getting out alive. Have his friends over and put snacks out. Think of special occasions to have good food. I can’t reiterate enough — don’t force him to eat. Don’t fight with him. Be gentle and loving and make it as easy as possible for him to eat.",
      "created_utc": 1725812101.0,
      "score": 1,
      "context": [
        {
          "id": "lhklns2",
          "author": "nepheleene",
          "body": "The main issue with recovery is always that, no matter how much you want to help as an outsider, it is the ill person that has to decide for themselves to recover. Unless this happens, there is little you can do.\nI don't know how bad it is already but you might want to think about hospitalisation.",
          "created_utc": 1723373957.0
        },
        {
          "id": "lhu0xh5",
          "author": "Gambo4theLambo",
          "body": "Thanks! 🙏Yesterday we had a good day, he said to his mum on the car ride home from school “mum there’s no point in not eating” as if there was a little click in his brain. He then at a lot that day with no battles. It’s a small win, and every day is different, but hopefully we are in the right track.",
          "created_utc": 1723508274.0
        }
      ]
    },
    {
      "id": "lhkohri",
      "author": "yarn-and-sad-poems",
      "body": "Also don't take away the sport that he loves. For me, my sport was my >!only reason not to commit suicide!< at one point. The treatment used it as a weapon, threatening me with not being allowed to participate if I didn't comply (this fed deeply into the >!self harm !< mentioned above). Give him more things that he loves, don't take them away ♥ ♥",
      "created_utc": 1723375621.0,
      "score": 21,
      "context": [
        {
          "id": "lhkn65j",
          "author": "yarn-and-sad-poems",
          "body": "Hey I understand this. I've had anorexia for 2.5 years and did fbt back at the start. It was a horrendous experience that traumatised my entire family. My parents, like you, were scared and alone and didn't know what to do and fbt was the only offered support in my area.\nI would not recommend it. Instead, engage a dietician and some form of therapy as an absolute priority. If he's involved and invested there is a far higher chance of recovery. I don't know where you are but there are many public mental health services available, or private if that's not feasible. For me, having a space to talk about my emotions and the trauma from fbt was central to my improvement.\nFor me, fbt was extremely invalidating to my person hood but was constantly pushed due to its \"gold standard\" (meaning people just weight restore) when in fact it causes severe trauma. Weight restoration tbh is the last thing to worry about - anorexia is a mental health condition.\nYour son clearly has loving parents who want the best for him, and I pray that he finds his way out. His having a space to be validated and process emotions in a specific, trained environment in the field of mental health is vital and in my experience you just don't get that with fbt.\nAnyway, I'm just an internet stranger and I don't know you but I empathise with your struggle. Look after yourself and learn about real experiences of eds (being on here is an amazing start) and I wish you and especially your son the absolute best.\nHugs 💕",
          "created_utc": 1723374861.0
        },
        {
          "id": "lhko77m",
          "author": "yarn-and-sad-poems",
          "body": "When I was in fbt, I also experienced this extreme worsening of my emotions as I was out of control, exactly as you described your son. I felt horrendous all the time and was extremely dysregulated and in a system void of support, despite having the kindest and most loving parents I could have wanted.\n The reason for this was, from my perspective, a treatment system that refused to acknowledge me as an individual and delve into my own conceptualisation of the illness. For example, a key philosophy of externalising the eating disorder voice did not resonate with me and everything I said was me \"lying or being manipulative\".\nI got out of this cycle of weight gain correlating in my parents' and the doctors' minds to recovery eventually. I refused to continue fbt and my relationship with my parents disintegrated further and further until I began to receive mental health support acknowledging the intersectionality of my personality and my anorexia. This therapist, who has been absolutely key to my improvement, helped me articulate how the controlling nature of FBT was triggering my eating disorder into a violent spiral of >!self harm!< and increasing isolation, and that the best support they could give me was to empower me to engage in and choose the direction of my own treatment.\nI'm not recovered by any stretch, but I'm happier, more fulfilled, have stronger relationships with my family and a healthier relationship to food, and have stopped both the >!self harm and losing weight!<. Talk to your son, find out his perspective, make sure he knows that you're going to support how he deals with his own mental health, and I would suggest finding alternatives to fbt.\nAgain, wishing all the best 💕",
          "created_utc": 1723375456.0
        }
      ]
    },
    {
      "id": "lhu2amv",
      "author": "Gambo4theLambo",
      "body": "Thank you so much for your insights and help. We will take your advice 100%. I’m so glad I came on to Reddit and found all of you 💚",
      "created_utc": 1723508777.0,
      "score": 6,
      "context": [
        {
          "id": "lhkn65j",
          "author": "yarn-and-sad-poems",
          "body": "Hey I understand this. I've had anorexia for 2.5 years and did fbt back at the start. It was a horrendous experience that traumatised my entire family. My parents, like you, were scared and alone and didn't know what to do and fbt was the only offered support in my area.\nI would not recommend it. Instead, engage a dietician and some form of therapy as an absolute priority. If he's involved and invested there is a far higher chance of recovery. I don't know where you are but there are many public mental health services available, or private if that's not feasible. For me, having a space to talk about my emotions and the trauma from fbt was central to my improvement.\nFor me, fbt was extremely invalidating to my person hood but was constantly pushed due to its \"gold standard\" (meaning people just weight restore) when in fact it causes severe trauma. Weight restoration tbh is the last thing to worry about - anorexia is a mental health condition.\nYour son clearly has loving parents who want the best for him, and I pray that he finds his way out. His having a space to be validated and process emotions in a specific, trained environment in the field of mental health is vital and in my experience you just don't get that with fbt.\nAnyway, I'm just an internet stranger and I don't know you but I empathise with your struggle. Look after yourself and learn about real experiences of eds (being on here is an amazing start) and I wish you and especially your son the absolute best.\nHugs 💕",
          "created_utc": 1723374861.0
        },
        {
          "id": "lhko77m",
          "author": "yarn-and-sad-poems",
          "body": "When I was in fbt, I also experienced this extreme worsening of my emotions as I was out of control, exactly as you described your son. I felt horrendous all the time and was extremely dysregulated and in a system void of support, despite having the kindest and most loving parents I could have wanted.\n The reason for this was, from my perspective, a treatment system that refused to acknowledge me as an individual and delve into my own conceptualisation of the illness. For example, a key philosophy of externalising the eating disorder voice did not resonate with me and everything I said was me \"lying or being manipulative\".\nI got out of this cycle of weight gain correlating in my parents' and the doctors' minds to recovery eventually. I refused to continue fbt and my relationship with my parents disintegrated further and further until I began to receive mental health support acknowledging the intersectionality of my personality and my anorexia. This therapist, who has been absolutely key to my improvement, helped me articulate how the controlling nature of FBT was triggering my eating disorder into a violent spiral of >!self harm!< and increasing isolation, and that the best support they could give me was to empower me to engage in and choose the direction of my own treatment.\nI'm not recovered by any stretch, but I'm happier, more fulfilled, have stronger relationships with my family and a healthier relationship to food, and have stopped both the >!self harm and losing weight!<. Talk to your son, find out his perspective, make sure he knows that you're going to support how he deals with his own mental health, and I would suggest finding alternatives to fbt.\nAgain, wishing all the best 💕",
          "created_utc": 1723375456.0
        }
      ]
    },
    {
      "id": "lhu2p4x",
      "author": "Gambo4theLambo",
      "body": "Thanks so much for your insights and help. I fear that we are doing the same thing to our son. However today, due to the help from this support group I will begin to question his treatment with his psychiatrist. I believed our son and us can find the solution together. No drugs, no torture. \nThank you, thank you 🙏!!!",
      "created_utc": 1723508927.0,
      "score": 4,
      "context": [
        {
          "id": "lhkn65j",
          "author": "yarn-and-sad-poems",
          "body": "Hey I understand this. I've had anorexia for 2.5 years and did fbt back at the start. It was a horrendous experience that traumatised my entire family. My parents, like you, were scared and alone and didn't know what to do and fbt was the only offered support in my area.\nI would not recommend it. Instead, engage a dietician and some form of therapy as an absolute priority. If he's involved and invested there is a far higher chance of recovery. I don't know where you are but there are many public mental health services available, or private if that's not feasible. For me, having a space to talk about my emotions and the trauma from fbt was central to my improvement.\nFor me, fbt was extremely invalidating to my person hood but was constantly pushed due to its \"gold standard\" (meaning people just weight restore) when in fact it causes severe trauma. Weight restoration tbh is the last thing to worry about - anorexia is a mental health condition.\nYour son clearly has loving parents who want the best for him, and I pray that he finds his way out. His having a space to be validated and process emotions in a specific, trained environment in the field of mental health is vital and in my experience you just don't get that with fbt.\nAnyway, I'm just an internet stranger and I don't know you but I empathise with your struggle. Look after yourself and learn about real experiences of eds (being on here is an amazing start) and I wish you and especially your son the absolute best.\nHugs 💕",
          "created_utc": 1723374861.0
        },
        {
          "id": "lhko77m",
          "author": "yarn-and-sad-poems",
          "body": "When I was in fbt, I also experienced this extreme worsening of my emotions as I was out of control, exactly as you described your son. I felt horrendous all the time and was extremely dysregulated and in a system void of support, despite having the kindest and most loving parents I could have wanted.\n The reason for this was, from my perspective, a treatment system that refused to acknowledge me as an individual and delve into my own conceptualisation of the illness. For example, a key philosophy of externalising the eating disorder voice did not resonate with me and everything I said was me \"lying or being manipulative\".\nI got out of this cycle of weight gain correlating in my parents' and the doctors' minds to recovery eventually. I refused to continue fbt and my relationship with my parents disintegrated further and further until I began to receive mental health support acknowledging the intersectionality of my personality and my anorexia. This therapist, who has been absolutely key to my improvement, helped me articulate how the controlling nature of FBT was triggering my eating disorder into a violent spiral of >!self harm!< and increasing isolation, and that the best support they could give me was to empower me to engage in and choose the direction of my own treatment.\nI'm not recovered by any stretch, but I'm happier, more fulfilled, have stronger relationships with my family and a healthier relationship to food, and have stopped both the >!self harm and losing weight!<. Talk to your son, find out his perspective, make sure he knows that you're going to support how he deals with his own mental health, and I would suggest finding alternatives to fbt.\nAgain, wishing all the best 💕",
          "created_utc": 1723375456.0
        }
      ]
    },
    {
      "id": "lhv12a3",
      "author": "Gambo4theLambo",
      "body": "Thanks, I appreciate your input 🙏",
      "created_utc": 1723522857.0,
      "score": 1,
      "context": [
        {
          "id": "lhkn65j",
          "author": "yarn-and-sad-poems",
          "body": "Hey I understand this. I've had anorexia for 2.5 years and did fbt back at the start. It was a horrendous experience that traumatised my entire family. My parents, like you, were scared and alone and didn't know what to do and fbt was the only offered support in my area.\nI would not recommend it. Instead, engage a dietician and some form of therapy as an absolute priority. If he's involved and invested there is a far higher chance of recovery. I don't know where you are but there are many public mental health services available, or private if that's not feasible. For me, having a space to talk about my emotions and the trauma from fbt was central to my improvement.\nFor me, fbt was extremely invalidating to my person hood but was constantly pushed due to its \"gold standard\" (meaning people just weight restore) when in fact it causes severe trauma. Weight restoration tbh is the last thing to worry about - anorexia is a mental health condition.\nYour son clearly has loving parents who want the best for him, and I pray that he finds his way out. His having a space to be validated and process emotions in a specific, trained environment in the field of mental health is vital and in my experience you just don't get that with fbt.\nAnyway, I'm just an internet stranger and I don't know you but I empathise with your struggle. Look after yourself and learn about real experiences of eds (being on here is an amazing start) and I wish you and especially your son the absolute best.\nHugs 💕",
          "created_utc": 1723374861.0
        },
        {
          "id": "lhkrj3g",
          "author": "Quirky_Top_8990",
          "body": "I agree with this completely, FBT made my eating disorder so much worse, I think if my parents had involved me with a therapist and dietician instead I might have been able to recover a lot quicker.",
          "created_utc": 1723377278.0
        }
      ]
    },
    {
      "id": "lhv1688",
      "author": "Gambo4theLambo",
      "body": "Thanks for your kind words.",
      "created_utc": 1723522912.0,
      "score": 2,
      "context": [
        {
          "id": "lhkslj2",
          "author": "CommunistBarabbas",
          "body": ">My son is a beautiful young boy, very sporty, very smart.\n\n\nthis has nothing to do with your sons diagnosis. i want to start this off with how so many parents have a “what happened to who you *used to be*” moment with their kids and it makes their kids feel even worse so please consider that when talking to/about your child. \n\nyou’re doing great by getting your son help (you’d be shocked the amount of parents that encourage/turn a blind eye). this is all about how he sees himself and what he expects of himself, you can help by not just encouraging him to eat but with self-esteem building.",
          "created_utc": 1723377826.0
        },
        {
          "id": "lhm65q7",
          "author": "RuthMaudeJameison",
          "body": "I read that as a description of love and style. Not like smart, so why? Sporty, so why when he’s muscle? Almost like part of the personality. It reads British English style to me. Just wanted to say that because I think OP is doing their best with a LOT of love showing through. And fear. And that’s understandable.",
          "created_utc": 1723396555.0
        }
      ]
    },
    {
      "id": "liopkwt",
      "author": "yarn-and-sad-poems",
      "body": "💕",
      "created_utc": 1723967125.0,
      "score": 1,
      "context": [
        {
          "id": "lhkn65j",
          "author": "yarn-and-sad-poems",
          "body": "Hey I understand this. I've had anorexia for 2.5 years and did fbt back at the start. It was a horrendous experience that traumatised my entire family. My parents, like you, were scared and alone and didn't know what to do and fbt was the only offered support in my area.\nI would not recommend it. Instead, engage a dietician and some form of therapy as an absolute priority. If he's involved and invested there is a far higher chance of recovery. I don't know where you are but there are many public mental health services available, or private if that's not feasible. For me, having a space to talk about my emotions and the trauma from fbt was central to my improvement.\nFor me, fbt was extremely invalidating to my person hood but was constantly pushed due to its \"gold standard\" (meaning people just weight restore) when in fact it causes severe trauma. Weight restoration tbh is the last thing to worry about - anorexia is a mental health condition.\nYour son clearly has loving parents who want the best for him, and I pray that he finds his way out. His having a space to be validated and process emotions in a specific, trained environment in the field of mental health is vital and in my experience you just don't get that with fbt.\nAnyway, I'm just an internet stranger and I don't know you but I empathise with your struggle. Look after yourself and learn about real experiences of eds (being on here is an amazing start) and I wish you and especially your son the absolute best.\nHugs 💕",
          "created_utc": 1723374861.0
        },
        {
          "id": "lhko77m",
          "author": "yarn-and-sad-poems",
          "body": "When I was in fbt, I also experienced this extreme worsening of my emotions as I was out of control, exactly as you described your son. I felt horrendous all the time and was extremely dysregulated and in a system void of support, despite having the kindest and most loving parents I could have wanted.\n The reason for this was, from my perspective, a treatment system that refused to acknowledge me as an individual and delve into my own conceptualisation of the illness. For example, a key philosophy of externalising the eating disorder voice did not resonate with me and everything I said was me \"lying or being manipulative\".\nI got out of this cycle of weight gain correlating in my parents' and the doctors' minds to recovery eventually. I refused to continue fbt and my relationship with my parents disintegrated further and further until I began to receive mental health support acknowledging the intersectionality of my personality and my anorexia. This therapist, who has been absolutely key to my improvement, helped me articulate how the controlling nature of FBT was triggering my eating disorder into a violent spiral of >!self harm!< and increasing isolation, and that the best support they could give me was to empower me to engage in and choose the direction of my own treatment.\nI'm not recovered by any stretch, but I'm happier, more fulfilled, have stronger relationships with my family and a healthier relationship to food, and have stopped both the >!self harm and losing weight!<. Talk to your son, find out his perspective, make sure he knows that you're going to support how he deals with his own mental health, and I would suggest finding alternatives to fbt.\nAgain, wishing all the best 💕",
          "created_utc": 1723375456.0
        },
        {
          "id": "lhu2p4x",
          "author": "Gambo4theLambo",
          "body": "Thanks so much for your insights and help. I fear that we are doing the same thing to our son. However today, due to the help from this support group I will begin to question his treatment with his psychiatrist. I believed our son and us can find the solution together. No drugs, no torture. \nThank you, thank you 🙏!!!",
          "created_utc": 1723508927.0
        }
      ]
    }
  ]
}