{
  "id": "1eqp90b",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1723496525.0,
  "title": "Things to consider when you feel \"not sick enough.\"",
  "selftext": "As someone who has suffered from anorexia for 18 years and has what is called severe and enduring anorexia, I would like to offer my perspective on chronic anorexia and the way it progresses. When I see people who have only been ill for a short time say they wish they were sicker so they feel valid, it makes me sad. When I see people say they want to get worse so someone will care, it makes me sad. So if you have not been ill for years, if your eating disorder has only gone on for a couple of months, a year, two years, if you think no one will take you seriously or care until you lose more weight or become sicker, I am here to tell you that you are not alone. Your pain is real. Your illness is real and you have nothing to prove to anyone. When you find yourself wishing you were worse, or thinking you are not as bad as someone else with anorexia, imagine this. You start wanting to lose weight, for whatever reason. Maybe you are sad. Maybe someone was mean to you. Maybe you went through trauma. Maybe someone made fun of your weight. Maybe you just started restricting your food intake, and you can't really think of a reason why. Whatever the trigger, something clicks in your brain. And the eating disorder is now the most important thing on your mind. You find yourself obsessing over your body, your weight. You lose weight. But you are never happy. So you keep going. The number on the scale will become the most important thing to you. People around you start to notice there is a problem and you aren't acting like yourself. But you ignore their concerns. You start to become emaciated. Your bones become weak. Your heart beats fast. You find yourself thinking about food and worrying about what you will eat. All you can think of is that you want to lose weight. But you don't realize at this point you have a serious problem that is deadly and requires treatment. Anorexia has become your entire world. It offers you predictability and control, in a world where you feel out of control.  But deep down, you know what you are doing isn't healthy. But you believe you aren't that bad yet. You keep going. Losing more weight. You hide your body in layers of clothes, but people keep asking you about your weight loss. You want to be left alone, to continue what you are doing. But people who care can't stop worrying. And they want to help you. Your doctor tells you that you need treatment and that anorexia nervosa has a high death rate. You don't believe you can die yet. But a part of you fears this. Eventually, you get hospitalized and threatened with a feeding tube. You look around at other ed patients. They are all hurting in their own ways. Some people are recovering. Some people are struggling with eating. You wonder why you can't be like the people who are getting better. When you hear doctors telling you to treat this as soon as possible, to listen to the advice they are giving you, you ignore it. Because you want things back the way they were. You want to starve yourself, to lose weight, to see the perfect number on the scale. But eating disorders lie. And no number is a perfect number and no matter how much weight you lose, you will never find the happiness you want. Because an illness like anorexia does not give you happiness. It takes it away. You are not a chronic sufferer yet. You don't stop and consider the consequences yet. Or what will happen to your health in the future. You are so sick that you are in the hospital with people trying to get you to eat more. But it still has not dawned on you how ill you are. Some people with anorexia will never go to the hospital for their eating disorder. But their pain is just as valid.  And they are just as sick as people in the hospital. Some people with anorexia will never have a feeding tube. But they are suffering just like all the rest. Eating disorders affect everyone differently. And eating disorders don't care what you weigh when they cause permanent complications. People die of eating disorders and you often don't realize you are at that critical point, until damage has been done. Years later, you have what is called severe and enduring anorexia, chronic anorexia. You find you are suffering awful and painful medical complications. You are older, and getting better seems difficult. Your behaviors are more entrenched.  You are on palliative care for your eating disorder. Even though you know you are hurting yourself, you find a comfort in your illness. And that is the tricky part. Because to get better, you have to put up with being uncomfortable. You finally feel sick enough, but what did it get you? Your body is declining and your health is worse. You could die. Because all an eating disorder wants is to cause the person suffering and no one deserves to suffer. So if you find yourself feeling not sick enough, I am telling you that when you are in physical pain, a chronic sufferer, you will wish you had listened to people sooner when they told you to treat this earlier. We all all valid. We all deserve support and understanding. We all hurt. And we all deserve to heal, not suffer",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1eqp90b/things_to_consider_when_you_feel_not_sick_enough/",
  "score": 121,
  "num_comments": 16,
  "comments": [
    {
      "id": "lht3bzz",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1723496525.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhtvs4i",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1723506382.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lhu9jfn",
      "author": "seasofGalia",
      "body": "I’m 30. Since I was ten, I’ve been overweight. I’ve been underweight. I’ve been to inpatient and res many times. I’ve been tubed. I’ve been told I was close to a heart attack. But no, I’ve never been sick enough. Currently working through a relapse two weeks before I’m supposed to start my MSW at my dream school, and being threatened with res for the Nth time if I can’t start making progress on my meal plan. Going to school doesn’t seem worth it because, frankly, I want my disorder to kill me. \n\nI needed to hear this. Thanks for posting, OP.",
      "created_utc": 1723511477.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lhuocy8",
      "author": "DifferenceInitial962",
      "body": "Thank you for this. I never feel sick enough and it makes me blind to my illness",
      "created_utc": 1723517165.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lhuru6k",
      "author": "BoringRelationship91",
      "body": "sometimes i justify not getting treatment because i don't feel sick enough to want anything to be treated. i haven't had a crazy health scare that's proven the link between my restrictive diet and declining health. so i tell myself that i can keep living this way until i have something to really worry about. my muscles and bones feel slightly weaker, i'm much more fatigued, and i am not recovering from illnesses as fast as i used to. i'm almost positive i had covid several weeks ago and i still don't feel recovered fully. i don't know how far is too far with this disease.",
      "created_utc": 1723518614.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lhvfklt",
      "author": "Quirky_Top_8990",
      "body": "This post should be pinned to this page.",
      "created_utc": 1723531220.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lhu12cp",
      "author": "melan111e",
      "body": "thank you for this",
      "created_utc": 1723508324.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lhukcrq",
      "author": "Odd_Incident7140",
      "body": "As someone who has also been diagnosed and in an active ed for 18 years (despite treatment) and now diagnosed with SEED as well, just wanted to say I relate and you’re not alone. It’s hard, being on this side of it.",
      "created_utc": 1723515578.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lhyfxj7",
      "author": "Extension-Lychee-296",
      "body": "I am in the ER right now praying something is wrong with my blood tests so that I can feel validated.",
      "created_utc": 1723576293.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lhtx65z",
      "author": "Coffeegreysky12",
      "body": "Thank you. I am glad this post was helpful to you. I hope it helps others too.",
      "created_utc": 1723506885.0,
      "score": 3,
      "context": [
        {
          "id": "lhtvs4i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1723506382.0
        }
      ]
    },
    {
      "id": "lhuae4p",
      "author": "Coffeegreysky12",
      "body": "You are welcome. I am sorry for what you are going through. You are valid and you aren't alone in your struggles.",
      "created_utc": 1723511793.0,
      "score": 3,
      "context": [
        {
          "id": "lhu9jfn",
          "author": "seasofGalia",
          "body": "I’m 30. Since I was ten, I’ve been overweight. I’ve been underweight. I’ve been to inpatient and res many times. I’ve been tubed. I’ve been told I was close to a heart attack. But no, I’ve never been sick enough. Currently working through a relapse two weeks before I’m supposed to start my MSW at my dream school, and being threatened with res for the Nth time if I can’t start making progress on my meal plan. Going to school doesn’t seem worth it because, frankly, I want my disorder to kill me. \n\nI needed to hear this. Thanks for posting, OP.",
          "created_utc": 1723511477.0
        }
      ]
    },
    {
      "id": "lhuonyv",
      "author": "Coffeegreysky12",
      "body": "You are welcome. You are valid and you deserve support and understanding",
      "created_utc": 1723517291.0,
      "score": 3,
      "context": [
        {
          "id": "lhuocy8",
          "author": "DifferenceInitial962",
          "body": "Thank you for this. I never feel sick enough and it makes me blind to my illness",
          "created_utc": 1723517165.0
        }
      ]
    },
    {
      "id": "lhuscrr",
      "author": "Coffeegreysky12",
      "body": "I am sorry to hear this. Your pain is valid and your health matters. You don't have to get worse to be worthy of help and support. You deserve help at any stage in your illness. I regret not getting help sooner. I hope you start feeling better. I know getting help is scary, but so is suffering health consequences",
      "created_utc": 1723518836.0,
      "score": 2,
      "context": [
        {
          "id": "lhuru6k",
          "author": "BoringRelationship91",
          "body": "sometimes i justify not getting treatment because i don't feel sick enough to want anything to be treated. i haven't had a crazy health scare that's proven the link between my restrictive diet and declining health. so i tell myself that i can keep living this way until i have something to really worry about. my muscles and bones feel slightly weaker, i'm much more fatigued, and i am not recovering from illnesses as fast as i used to. i'm almost positive i had covid several weeks ago and i still don't feel recovered fully. i don't know how far is too far with this disease.",
          "created_utc": 1723518614.0
        }
      ]
    },
    {
      "id": "lhvzzrj",
      "author": "Coffeegreysky12",
      "body": "Thanks",
      "created_utc": 1723544744.0,
      "score": 2,
      "context": [
        {
          "id": "lhvfklt",
          "author": "Quirky_Top_8990",
          "body": "This post should be pinned to this page.",
          "created_utc": 1723531220.0
        }
      ]
    },
    {
      "id": "lhu1qd8",
      "author": "Coffeegreysky12",
      "body": "You are welcome",
      "created_utc": 1723508569.0,
      "score": 3,
      "context": [
        {
          "id": "lhu12cp",
          "author": "melan111e",
          "body": "thank you for this",
          "created_utc": 1723508324.0
        }
      ]
    },
    {
      "id": "lhukz4n",
      "author": "Coffeegreysky12",
      "body": "Thank you. It's nice to know I am not alone. SEED is hard to deal with, but I am trying to remain positive.",
      "created_utc": 1723515823.0,
      "score": 3,
      "context": [
        {
          "id": "lhukcrq",
          "author": "Odd_Incident7140",
          "body": "As someone who has also been diagnosed and in an active ed for 18 years (despite treatment) and now diagnosed with SEED as well, just wanted to say I relate and you’re not alone. It’s hard, being on this side of it.",
          "created_utc": 1723515578.0
        }
      ]
    },
    {
      "id": "lhygcfb",
      "author": "Coffeegreysky12",
      "body": "I'm sorry you are struggling right now. You are valid. Your pain matters. You deserve help and support",
      "created_utc": 1723576425.0,
      "score": 1,
      "context": [
        {
          "id": "lhyfxj7",
          "author": "Extension-Lychee-296",
          "body": "I am in the ER right now praying something is wrong with my blood tests so that I can feel validated.",
          "created_utc": 1723576293.0
        }
      ]
    }
  ]
}