{
  "id": "1fec3xc",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1726066426.0,
  "title": "Saddest/scariest moments during my anorexia",
  "selftext": "Thinking about these awful moments during my eating disorder helps to motivate me to do better, to not get worse. An eating disorder does not just affect the person who has the illness. It will affect everyone around you that cares about you. Even if you think they aren't paying attention, usually, if someone loves you and cares about you, no matter how hard you try to hide it, they are going to eventually notice you not eating/losing weight and say something to you. \n\n1, One of the saddest moments I can remember is when it was around my birthday and I was severely ill and had lost a lot of weight. And my mom asked me to weigh myself in front of her and then she broke down in tears when she saw how low the number was. So for the rest of the day, all I could think about was her reaction and how much my illness was hurting her. I had a difficult time enjoying my birthday because her reaction upset me and I just felt terrible for making her worry. \n\n2. When I was staying with my grandparents, I would go out jogging, every day, on this big hill. I was really sick then. My grandfather told me that every day, he wished it would rain, so that I wouldn't be able to jog and lose more weight. He started crying and told me he didn't want anything to happen to me. This reminded me that even when you think your family isn't paying attention or doesn't notice your behaviors around food and weight, they are noticing. I've never forgotten the look on my grandfather's face when he told me that. \n\n3. On a vacation to the beach with my cousin's family, I dressed in layers, oversized hoodies and jeans, during the entire trip, even when it was hot out. I had such a distorted view of my body that I didn't realize how sick I looked then. And I didn't want others to ask questions about my weight loss, so I tried to hide it. But everyone noticed my weight loss and behaviors. I took my bathroom scale on the trip. And would spend lots of time in the bathroom checking my weight on the trip. My uncle noticed I had a difficult time eating and he started asking me what he could do to help. He was very understanding and made me feel not alone. But the trip was hard to enjoy because I cared more about what the scale said at the time, instead of focusing on having fun at the beach\n\n4. Being told in inpatient treatment that I was at risk of dying at the time and that I needed to take this seriously and work on the eating disorder now. I was younger and just wasn't thinking about the future back then. It's not my fault I have an eating disorder, but it's something I think about often. I was seriously ill at the time and just kept saying to everyone that it wasn't that bad and I could handle it. I refused to listen to the people in inpatient at the time, and quickly relapsed and refused residential treatment as soon as I got out of inpatient. Then, I stayed sick for years. And never worked on getting better. I'm now realizing what a mistake that was, because now I have severe medical complications and my illness is chronic. I'm trying to get better, but it's not easy. My doctor told me to not be too hard on myself, as I didn't choose to be sick. \n\n5. Meeting a good friend in inpatient treatment, who was also anorexic. Becoming close friends with her for years, writing her letters and calling her on the phone. And then finding out later that she died from complications of her eating disorder. She was one of my closest friends and very kind. And I've never forgotten her. \n\n6. When I wasn't answering my phone one day, my dad drove to my apartment and knocked on the door, worried. I didn't realize he was worried. He said he had been trying to contact me for hours and I wasn't answering my phone. Something was wrong with my phone that day and his calls weren't showing up in  my phone. My dad, who rarely cries, broke down in tears, saying he thought I had died from my eating disorder and that's why I wasn't answering the phone. I felt so bad and tried to reassure my dad I was fine. But seeing my family cry is something that stays with me. Even if I argue with my parents sometimes about my disorder, they are always here for me. They don't always understand my eating disorder behaviors, but I know they love me a lot and would be sad if anything happened to me\n\n  \n7. When I fainted in front of my dad and he caught me in his arms and my mom ran over to me, panicking. That was really scary and I am glad my parents were there to make sure I was okay\n\n8. Being so obsessed with my scale that I had to have it with me at all times and cared more about what it said, than anything else. I've since gotten rid of my scale and my doctor said that's a great thing. But I do remember, for years, the scale was one of the most important things in my life\n\nEating disorders are not fun, or cute or enjoyable. They are painful, isolating and scary. Painful not only to the person, but everyone around them. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1fec3xc/saddestscariest_moments_during_my_anorexia/",
  "score": 132,
  "num_comments": 24,
  "comments": [
    {
      "id": "lmm2i34",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1726066426.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmoj9ok",
      "author": "osnispatzi",
      "body": "Thank you for your impressive moments, your openness, and your vulnerability that you shared with us here ♥️ I can see why  this helps you avoid falling back into old patterns. You can be very proud on yourself.",
      "created_utc": 1726095339.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lmor32t",
      "author": "db_anon8452",
      "body": "Thanks for sharing. I also have memories when I was younger of travelling with my scale.",
      "created_utc": 1726098286.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lmpvr81",
      "author": "Listen_Successful",
      "body": "Thank you for sharing your painful experiences with your eating disorder. I identify with so many of your behaviors. I don’t think anyone notices my weight or behaviors because I’m a normal BMI, but I’ve lost almost half of my body weight during the last 2 years and I’m in the “you look so good!” honeymoon phase. \n But reading this, idk, I’m thinking about getting some help. Before I get too bad from fasting and restricting and over exercising.\n G-d bless you and I hope you get better. You probably don’t realize it, but you’re helping so many people with your post. ❤️",
      "created_utc": 1726115118.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lmpxuul",
      "author": "Wild_Travel_8292",
      "body": "Seeing your family hurt from your ED is the worst. It really sucks knowing you’re actively hurting the people you love but not knowing how to stop. I’m sorry you went through all of that, but I’m glad it’s motivated you to change it.",
      "created_utc": 1726116232.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lmqasxn",
      "author": "Pumpkinwaterfall",
      "body": "I hate eating disorders and am I very very extremely sorry you went through this.",
      "created_utc": 1726124058.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lmrart9",
      "author": "Future-Membership133",
      "body": "Beautifully written 💜🦋\nI don’t think anyone in my family really cared. Like it was something they could “show off” and how much my mom “loved” me by sending me to the best residential facilities as if it were some prestigious university. It was more guilt and all the wasted money….\nBut your family sounds marvelous and caring. Something so important. I had a therapist who always told me that we remember and forget and then remember again. It isn’t our fault that we have this illness (even though it feels so creepy choiceful at times). \nUltimately we have to get better/recover for ourselves (not our family or anyone else). Recovery isn’t easy",
      "created_utc": 1726145411.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lmo4wbp",
      "author": "mtboglarka",
      "body": "wow :(",
      "created_utc": 1726090214.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lmucuq6",
      "author": "sickinomnibus",
      "body": "1) I lied about having to meet my friends when all my family was going out to dinner just so that I wouldn’t have to eat. Everyone knew I was lying. \n\n2) having to hold on to my father’s hand when I could feel all forces leaving me and I could no longer stand or walk. I remember my hands being completely frozen though it was August and my nails turning blue \n\n3) crying alone in fear at the thought of eating and telling myself I would never eat again just because the stress of facing one more meal was simply too much and I wished I would die",
      "created_utc": 1726181887.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ln4xkpo",
      "author": "starvenby",
      "body": "I recently stayed overnight at a hotel and brought my scale with me. I then realized how much my eating disorder has taken hold of me, yet again",
      "created_utc": 1726344288.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhb27g7",
      "author": "isacrificee",
      "body": "The part about the scale felt very familiar to me because, just recently, my steps app, which had my entire record of extreme walking from the very beginning of my ED, stopped working and somehow erased everything. It felt like losing my whole life since it was one of the most important things to me.. This disorder is very sad and lonely. Take care and thanks for sharing!!",
      "created_utc": 1741740554.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmvpeq4",
      "author": "Human_Limit5283",
      "body": "This tirgged me so bad Why this just gave me more motivation not to 3at?",
      "created_utc": 1726201204.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lmoji9s",
      "author": "Coffeegreysky12",
      "body": "You are welcome. Remembering these moments helps me to stay motivated to get better",
      "created_utc": 1726095427.0,
      "score": 9,
      "context": [
        {
          "id": "lmoj9ok",
          "author": "osnispatzi",
          "body": "Thank you for your impressive moments, your openness, and your vulnerability that you shared with us here ♥️ I can see why  this helps you avoid falling back into old patterns. You can be very proud on yourself.",
          "created_utc": 1726095339.0
        }
      ]
    },
    {
      "id": "lmor9jx",
      "author": "Coffeegreysky12",
      "body": "You are welcome. Yes, I used to be so attached to my scale but I am glad I am not like that anymore",
      "created_utc": 1726098354.0,
      "score": 5,
      "context": [
        {
          "id": "lmor32t",
          "author": "db_anon8452",
          "body": "Thanks for sharing. I also have memories when I was younger of travelling with my scale.",
          "created_utc": 1726098286.0
        }
      ]
    },
    {
      "id": "lmpw34w",
      "author": "Coffeegreysky12",
      "body": "You are welcome. I'm glad this post was helpful to you and I hope it helps others. Eating disorders are so painful. I hope everyone that struggles with one finds the support they need and deserve",
      "created_utc": 1726115292.0,
      "score": 2,
      "context": [
        {
          "id": "lmpvr81",
          "author": "Listen_Successful",
          "body": "Thank you for sharing your painful experiences with your eating disorder. I identify with so many of your behaviors. I don’t think anyone notices my weight or behaviors because I’m a normal BMI, but I’ve lost almost half of my body weight during the last 2 years and I’m in the “you look so good!” honeymoon phase. \n But reading this, idk, I’m thinking about getting some help. Before I get too bad from fasting and restricting and over exercising.\n G-d bless you and I hope you get better. You probably don’t realize it, but you’re helping so many people with your post. ❤️",
          "created_utc": 1726115118.0
        }
      ]
    },
    {
      "id": "lmpy042",
      "author": "Coffeegreysky12",
      "body": "So true. It really does affect people around you. Thank you for the support and kind words",
      "created_utc": 1726116314.0,
      "score": 3,
      "context": [
        {
          "id": "lmpxuul",
          "author": "Wild_Travel_8292",
          "body": "Seeing your family hurt from your ED is the worst. It really sucks knowing you’re actively hurting the people you love but not knowing how to stop. I’m sorry you went through all of that, but I’m glad it’s motivated you to change it.",
          "created_utc": 1726116232.0
        }
      ]
    },
    {
      "id": "lmqlir4",
      "author": "Coffeegreysky12",
      "body": "Thank you. That means a lot",
      "created_utc": 1726131674.0,
      "score": 3,
      "context": [
        {
          "id": "lmqasxn",
          "author": "Pumpkinwaterfall",
          "body": "I hate eating disorders and am I very very extremely sorry you went through this.",
          "created_utc": 1726124058.0
        }
      ]
    },
    {
      "id": "lmrbl1g",
      "author": "Coffeegreysky12",
      "body": "Thank you. Your pain is valid and I'm sorry you feel like your family doesn't care. So true. It's not our fault we have this illness. And recovery is difficult but not impossible",
      "created_utc": 1726145734.0,
      "score": 2,
      "context": [
        {
          "id": "lmrart9",
          "author": "Future-Membership133",
          "body": "Beautifully written 💜🦋\nI don’t think anyone in my family really cared. Like it was something they could “show off” and how much my mom “loved” me by sending me to the best residential facilities as if it were some prestigious university. It was more guilt and all the wasted money….\nBut your family sounds marvelous and caring. Something so important. I had a therapist who always told me that we remember and forget and then remember again. It isn’t our fault that we have this illness (even though it feels so creepy choiceful at times). \nUltimately we have to get better/recover for ourselves (not our family or anyone else). Recovery isn’t easy",
          "created_utc": 1726145411.0
        }
      ]
    },
    {
      "id": "lmudcg4",
      "author": "Coffeegreysky12",
      "body": "I'm sorry you went through that. Eating disorders are terrible illnesses",
      "created_utc": 1726182071.0,
      "score": 2,
      "context": [
        {
          "id": "lmucuq6",
          "author": "sickinomnibus",
          "body": "1) I lied about having to meet my friends when all my family was going out to dinner just so that I wouldn’t have to eat. Everyone knew I was lying. \n\n2) having to hold on to my father’s hand when I could feel all forces leaving me and I could no longer stand or walk. I remember my hands being completely frozen though it was August and my nails turning blue \n\n3) crying alone in fear at the thought of eating and telling myself I would never eat again just because the stress of facing one more meal was simply too much and I wished I would die",
          "created_utc": 1726181887.0
        }
      ]
    },
    {
      "id": "ln4xxqv",
      "author": "Coffeegreysky12",
      "body": "Yes, it's sad when you realize how much the eating disorder consumes your thoughts. I can relate. It took me a while to break my addiction to weighing myself. But it's possible to not focus so much on the number and that's an improvement for me. I hope you get to a point where you can feel better about it",
      "created_utc": 1726344401.0,
      "score": 1,
      "context": [
        {
          "id": "ln4xkpo",
          "author": "starvenby",
          "body": "I recently stayed overnight at a hotel and brought my scale with me. I then realized how much my eating disorder has taken hold of me, yet again",
          "created_utc": 1726344288.0
        }
      ]
    },
    {
      "id": "mhb2ozp",
      "author": "Coffeegreysky12",
      "body": "Thank you",
      "created_utc": 1741740715.0,
      "score": 2,
      "context": [
        {
          "id": "mhb27g7",
          "author": "isacrificee",
          "body": "The part about the scale felt very familiar to me because, just recently, my steps app, which had my entire record of extreme walking from the very beginning of my ED, stopped working and somehow erased everything. It felt like losing my whole life since it was one of the most important things to me.. This disorder is very sad and lonely. Take care and thanks for sharing!!",
          "created_utc": 1741740554.0
        }
      ]
    },
    {
      "id": "lmyo9pr",
      "author": "prettipain",
      "body": "maybe stay off subs like this?",
      "created_utc": 1726250032.0,
      "score": 1,
      "context": [
        {
          "id": "lmvpeq4",
          "author": "Human_Limit5283",
          "body": "This tirgged me so bad Why this just gave me more motivation not to 3at?",
          "created_utc": 1726201204.0
        }
      ]
    },
    {
      "id": "lmuehdm",
      "author": "sickinomnibus",
      "body": "Thank you for giving me a chance to reflect a bit on what we’ve been through. I usually try to push these memories away but remembering helps, and I deeply relate to what you posted. It feels a bit like I’m sharing some of your pain as well. We deserved better than to live through horrible experiences such as these. I send a lot (a lot!) of love your way, and the biggest hug I am capable of.",
      "created_utc": 1726182502.0,
      "score": 2,
      "context": [
        {
          "id": "lmucuq6",
          "author": "sickinomnibus",
          "body": "1) I lied about having to meet my friends when all my family was going out to dinner just so that I wouldn’t have to eat. Everyone knew I was lying. \n\n2) having to hold on to my father’s hand when I could feel all forces leaving me and I could no longer stand or walk. I remember my hands being completely frozen though it was August and my nails turning blue \n\n3) crying alone in fear at the thought of eating and telling myself I would never eat again just because the stress of facing one more meal was simply too much and I wished I would die",
          "created_utc": 1726181887.0
        },
        {
          "id": "lmudcg4",
          "author": "Coffeegreysky12",
          "body": "I'm sorry you went through that. Eating disorders are terrible illnesses",
          "created_utc": 1726182071.0
        }
      ]
    },
    {
      "id": "lmuf29q",
      "author": "Coffeegreysky12",
      "body": "Thank you. That's kind of you to say. I'm glad my post helps people with eating disorders to not feel alone.",
      "created_utc": 1726182721.0,
      "score": 2,
      "context": [
        {
          "id": "lmucuq6",
          "author": "sickinomnibus",
          "body": "1) I lied about having to meet my friends when all my family was going out to dinner just so that I wouldn’t have to eat. Everyone knew I was lying. \n\n2) having to hold on to my father’s hand when I could feel all forces leaving me and I could no longer stand or walk. I remember my hands being completely frozen though it was August and my nails turning blue \n\n3) crying alone in fear at the thought of eating and telling myself I would never eat again just because the stress of facing one more meal was simply too much and I wished I would die",
          "created_utc": 1726181887.0
        },
        {
          "id": "lmudcg4",
          "author": "Coffeegreysky12",
          "body": "I'm sorry you went through that. Eating disorders are terrible illnesses",
          "created_utc": 1726182071.0
        },
        {
          "id": "lmuehdm",
          "author": "sickinomnibus",
          "body": "Thank you for giving me a chance to reflect a bit on what we’ve been through. I usually try to push these memories away but remembering helps, and I deeply relate to what you posted. It feels a bit like I’m sharing some of your pain as well. We deserved better than to live through horrible experiences such as these. I send a lot (a lot!) of love your way, and the biggest hug I am capable of.",
          "created_utc": 1726182502.0
        }
      ]
    }
  ]
}