{
  "id": "1fhuuls",
  "subreddit": "AnorexiaNervosa",
  "author": "AndrewK7503",
  "created_utc": 1726456388.0,
  "title": "A Man at a Bar Commented On My Weight",
  "selftext": "Today I went to a bar with my friend Brandon to hang out and drink our sorrows away! Once we got there, we both had a couple beers and we met this guy there named Curtis. Curtis struck up a conversation with us, we got to talking, and he seemed like a really cool guy; super laid-back and just overall very chill. He was an older gentleman, pretty heavy- set, and spoke with a soft, deep voice that made him kinda hard to understand with the background noise from the bar. \n\nAfter the beers, we decided to order some bar food. Brandon got a chicken tender platter, and I got 10 boneless wings, which was **plenty** of food for me. \n\nNow, when I get drunk, I get very very gratuitous, and I like to offer food, snacks, or drinks to pretty much everybody around me, so I offered Curtis one of my boneless wings, to which he politely declined. About a minute later, he turned to me and said, \n\n“Now I know this isn’t any of my business, but how much do you weigh if you don’t mind me asking?”\n\nI didn’t mind, so I replied with my weight, to which he says back, \n\n“Now, I’m a big man and I’m not gonna take food from somebody as skinny as you; that would be evil. If you offered me a wing out of a whole-ass bucket I would accept, but you’re on your last two wings and you gotta eat!”\n\nGenuinely, that shit meant a lot for some reason. As a recovering anorexic, some random stranger in a bar caring enough to turn down my offer of free food just felt *good*. To him, what he said was just another sentence, but it really made me feel acknowledged? \n\nAppreciated? \n\nCared about? \n\nI dunno, but I felt pretty damn good.\n\nAfter that, we laughed, talked for a bit more, and then he left the bar, but not before I gave him a handshake and a kind thank you.\n\nCurtis, if you’re on the anorexia subreddit for some fucking reason, thank you. You’re the man.\n\n",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1fhuuls/a_man_at_a_bar_commented_on_my_weight/",
  "score": 172,
  "num_comments": 6,
  "comments": [
    {
      "id": "lnctx7m",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1726456388.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lnd5s7e",
      "author": "brownguyinthecorner",
      "body": "Curtis is an indisputable legend. We need more bartenders like Curtis! \n\nI used to be a bartender in Central London and one time I remember this company rented out the whole bar. They ordered dominos for their whole company, so give or take 12 large pizzas. I distinctly recall seeing the female version of me (tall, brown, and slim) actively refuse to eat any of the food presented to her. All I could think to myself was \"Girl, eat!\" but I know damn well I'd do the exact same thing in her situation. All she did was drink. \n\nI am genuinely glad to read that you were able to eat whilst you were drinking with your mate. I hope you enjoyed the food, it sounds delicious :)",
      "created_utc": 1726462062.0,
      "score": 36,
      "context": []
    },
    {
      "id": "lndpwk3",
      "author": "Queenofwands1212",
      "body": "This is so heart warming. I thought his comment was going to be detrimental. Thank you for sharing this story",
      "created_utc": 1726475450.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lnd1hh5",
      "author": "None",
      "body": "That's really sweet. Sounds like a generally caring person that you randomly came across at just the right time.\n\nSmall acts of kindness from strangers you will never see again make me believe in angels on earth",
      "created_utc": 1726459783.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lndt176",
      "author": "tealfairydust",
      "body": "he sounds so sweet and caring lol, hope you kept in touch :)",
      "created_utc": 1726477816.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lndbj35",
      "author": "AndrewK7503",
      "body": "THE WINGS WERE ABSOLUTELY IMMACULATE!!! :DDDDD\n\nAnd I’m VERY much trying not to be like that girl in the corner; a life without pizza is a life I don’t wanna live in!",
      "created_utc": 1726465416.0,
      "score": 18,
      "context": [
        {
          "id": "lnd5s7e",
          "author": "brownguyinthecorner",
          "body": "Curtis is an indisputable legend. We need more bartenders like Curtis! \n\nI used to be a bartender in Central London and one time I remember this company rented out the whole bar. They ordered dominos for their whole company, so give or take 12 large pizzas. I distinctly recall seeing the female version of me (tall, brown, and slim) actively refuse to eat any of the food presented to her. All I could think to myself was \"Girl, eat!\" but I know damn well I'd do the exact same thing in her situation. All she did was drink. \n\nI am genuinely glad to read that you were able to eat whilst you were drinking with your mate. I hope you enjoyed the food, it sounds delicious :)",
          "created_utc": 1726462062.0
        }
      ]
    }
  ]
}