{
  "id": "1fkrfbp",
  "subreddit": "AnorexiaNervosa",
  "author": "AwkwardShrimp0",
  "created_utc": 1726769146.0,
  "title": "I'm just so mean",
  "selftext": "I feel like this disorder has just made me so mean. I've become so rude and selfish, and it really hurts me that I'm hurting the people I love. And they're all leaving me because of it, one by one. This isn't a self-pity post, I know it's my fault. I guess I'm just hoping someone out there relates.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1fkrfbp/im_just_so_mean/",
  "score": 108,
  "num_comments": 25,
  "comments": [
    {
      "id": "lnxlga2",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1726769147.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lny9nw7",
      "author": "nervous_veggie",
      "body": "starvation has a proven effect on temperament and 'irritability', add in the constant stressor of the thoughts in your head bullying you all the time, it's no wonder you aren't sunshine and rainbows. you aren't a bad person, you are just unwell",
      "created_utc": 1726780378.0,
      "score": 41,
      "context": []
    },
    {
      "id": "lny94qb",
      "author": "AdEffective563",
      "body": "I understand what you mean, you’re not the only one that feels this way. Every time I relapse, I become so horrible to everyone around me and completely shut people out. There was even a point where I considered my ed as my best friend because of how distant I became. I hope things get better for you.",
      "created_utc": 1726780209.0,
      "score": 21,
      "context": []
    },
    {
      "id": "lnydlee",
      "author": "sadieaustin",
      "body": "I was the same when I was in the depth of my anorexia. I was so angry with myself and depressed that my depression came out as lashing out on people I loved. Not promoting medication, but anti depressants were night and day for me. You’re not alone. This too shall pass 🤍",
      "created_utc": 1726781645.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lny7yd0",
      "author": "Mobile-Register-9578",
      "body": "I completely understand you and relate to you, it’s one of the things I hate the most about my ED.",
      "created_utc": 1726779837.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lnxoshd",
      "author": "NervousToucan",
      "body": "I also feel really mean and I don’t have patience for people anymore",
      "created_utc": 1726770200.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lnyd06q",
      "author": "Ill-Bite-6864",
      "body": "Don’t forget to separate yourself from the disorder. Anorexia as a separate entity from yourself. It’s a parasitic mental lllness, that you’re not choosing to have, even if it feels that way. Pls give yourself some compassion and forgiveness, and don’t double down on behaviors if this is causing you feelings of guilt and shame. I pushed people away, was self centered and yes more irritable. Not sure if you’re ready for recovery, but maybe it can be motivation? I’m sorry you’re feeling this way, you’re not alone❤️\n\nEdit: another analogy- I have bipolar disorder and my episodes can cause me to feel pessimistic and suicidal, when my baseline is usually positive. Mental illness can seriously distort everything. The illness causes me to feel things and act in ways that aren’t part of my normal value system.",
      "created_utc": 1726781450.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lnz6q5h",
      "author": "Ok_Bird_1378",
      "body": "Love, this isn't your fault. You're sick. Is it a cancer patients fault they have cancer? Of course not!! And it's not your fault you have anorexia. ED's happen for many different reasons, some genetic, some environmental, sometimes trauma. And like any other sick person, you have two options: Staying where you're at or try to get better. There's no right or wrong answer, both sides have good and bad consequences. But I will say, your loved one's miss you. They want YOU back, not the shell your ED uses as a host. And if you ever decide you want to get rid of the parasite that is anorexia, we'll all be here for you<3",
      "created_utc": 1726792166.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lo0kqgv",
      "author": "girlimprisoned",
      "body": "I feel you. My ed has eaten away almost everything from me to the point where I feel like I’m only made up from crumbs of what I used to be. No one rly talks about this enough. You’re not alone.",
      "created_utc": 1726815692.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lo0hfvr",
      "author": "Quirky_Top_8990",
      "body": "I was a horrible person during my illness, starving makes you very angry and emotional.",
      "created_utc": 1726813548.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lo4b3kl",
      "author": "clairethebaby",
      "body": "i feel you. especially the constant lying about “i ate earlier” “im not hungry” “i just eat healthy and exercise” i’m doing is taking a huge toll on my moral compass. i’ve always valued honesty, and i’m neglecting my own ethical code just to lose weight. i feel like such a fake.",
      "created_utc": 1726869273.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lnxxs7t",
      "author": "Pleasant-Sir4724",
      "body": "i can relate",
      "created_utc": 1726776640.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lnxmo5c",
      "author": "DifferenceInitial962",
      "body": "You’re not alone",
      "created_utc": 1726769533.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lo1de1e",
      "author": "LeastPay0",
      "body": "It's called being Hangry. Only you have the control to stop or start. If you notice that you have become increasingly mean to where you're losing loved ones then it's time to make a serious change or you'll be all by your lonesome. You can catch more bees with honey than you can with vinegar!!!",
      "created_utc": 1726833457.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lo3gr9y",
      "author": "tourguidetorie",
      "body": "I feel like I have so much less patience with my stepsons, and it comes across as snappy. It sucks knowing you’re being an asshole and feeling like there’s nothing you can do about it cause it’s more important to be skinny.",
      "created_utc": 1726859187.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lo408ud",
      "author": "Kattorimu",
      "body": "Me too :( ...",
      "created_utc": 1726865613.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lo8zyf2",
      "author": "Capital_Ad1318",
      "body": "Oh I 100% feel this. My mum is just trying to help but I get so overwhelmed by everything and I end up being a bitch.",
      "created_utc": 1726944901.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpwd23x",
      "author": "Fluttery_Soul",
      "body": "Yeah I tend to snap at my loved ones without meaning to...the smallest inconvenience irritates me and I feel bad that they have to put up with me 😓",
      "created_utc": 1727827537.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lnylp82",
      "author": "Proof-March275",
      "body": "It’s so hard bc I don’t feel like doing anything anymore",
      "created_utc": 1726784414.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lo5z1qi",
      "author": "Whythisgirlnamedlea",
      "body": "No this is NOT your fault!!!! Please please watch this video [https://youtu.be/KAhPr7OfkWQ?si=b-K62jx45lGkdwUH](https://youtu.be/KAhPr7OfkWQ?si=b-K62jx45lGkdwUH) I felt as though it was my fault but IT IS NOT. You will make it out, you got this!!!!",
      "created_utc": 1726895157.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lo5r1qo",
      "author": "neopronoun_dropper",
      "body": "I had a manic episode where my thoughts would race, and would make incredibly good mean jokes constantly, but when I found out they actually hurt people, I thought the world was better off without me. I didn’t know that suicide was a thing you could actually, so I just started self-isolating so other people wouldn’t see. I was full blown mixed manic, and I realized there was something seriously wrong with me. I felt so out of control. I was able to get help. Has nothing to do with ED for me though.",
      "created_utc": 1726890839.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lo0i8mt",
      "author": "livv3ss",
      "body": "Agreed, I had full on temper tantrums and was very mean the whole time during anorexia. Now recovered I haven't had a temper tantrum or been mean on purpose at all.",
      "created_utc": 1726814067.0,
      "score": 10,
      "context": [
        {
          "id": "lny9nw7",
          "author": "nervous_veggie",
          "body": "starvation has a proven effect on temperament and 'irritability', add in the constant stressor of the thoughts in your head bullying you all the time, it's no wonder you aren't sunshine and rainbows. you aren't a bad person, you are just unwell",
          "created_utc": 1726780378.0
        }
      ]
    },
    {
      "id": "lo00dti",
      "author": "None",
      "body": "I just want to lay in bed and wither away",
      "created_utc": 1726804089.0,
      "score": 3,
      "context": [
        {
          "id": "lnylp82",
          "author": "Proof-March275",
          "body": "It’s so hard bc I don’t feel like doing anything anymore",
          "created_utc": 1726784414.0
        }
      ]
    },
    {
      "id": "lo59alg",
      "author": "lrina_",
      "body": "you might want to look into anhedonia",
      "created_utc": 1726882812.0,
      "score": 2,
      "context": [
        {
          "id": "lnylp82",
          "author": "Proof-March275",
          "body": "It’s so hard bc I don’t feel like doing anything anymore",
          "created_utc": 1726784414.0
        }
      ]
    },
    {
      "id": "lo5h3t6",
      "author": "Proof-March275",
      "body": "This was very helpful, thank you!!",
      "created_utc": 1726886208.0,
      "score": 2,
      "context": [
        {
          "id": "lnylp82",
          "author": "Proof-March275",
          "body": "It’s so hard bc I don’t feel like doing anything anymore",
          "created_utc": 1726784414.0
        },
        {
          "id": "lo59alg",
          "author": "lrina_",
          "body": "you might want to look into anhedonia",
          "created_utc": 1726882812.0
        }
      ]
    }
  ]
}