{
  "id": "1fobk86",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1727181830.0,
  "title": "What is something about anorexia you wish others would try to understand?",
  "selftext": "There are a lot of misconceptions about anorexia. One thing I wish other people would try to understand is that a person who suffers from anorexia is in pain, whether that is physical, mental or emotional. They did not wake up one day and choose to starve themselves. And they are not doing it to look a certain way or because of vanity. It is not about vanity. It's about being in pain and feeling bad about yourself and you don't know how to cope with it, other than to restrict your food intake and lose weight. Even if you reach a very low weight, you still feel unhappy with yourself. So I wish people who have never suffered from this illness would try to be more compassionate to those who have it. It is not an easy disorder to cure and the person going through the illness needs support and understanding, not harsh judgements and criticism. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1fobk86/what_is_something_about_anorexia_you_wish_others/",
  "score": 164,
  "num_comments": 107,
  "comments": [
    {
      "id": "look5ky",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1727181831.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loonskb",
      "author": "notitymp",
      "body": "that being malnourished doesn’t mean you’re skin and bones, that you can still die from anorexia at a higher weight, that it can change your personality when you’re afflicted with brain fog, just how it actually works in general",
      "created_utc": 1727183255.0,
      "score": 132,
      "context": []
    },
    {
      "id": "loorse0",
      "author": "LoveThatForYouBebe",
      "body": "That “gold standard” treatments (looking at you, CBT) aren’t designed with autistic brains in mind. And a lot of people with AN are autistic, much larger a percentage than the population at-large. It doesn’t mean you’re a failure if it takes a long time to find an approach that works for you.\n\nEdit: stupid typo",
      "created_utc": 1727184743.0,
      "score": 46,
      "context": []
    },
    {
      "id": "loouw5w",
      "author": "Silver-Corgi4435",
      "body": "That it will take everything from you and you will eventually loose every connection and relationship you have and by the time it does you’re too tired and too in deep to care. The people who stay and stand by you through the darkest parts love you for you",
      "created_utc": 1727185852.0,
      "score": 34,
      "context": []
    },
    {
      "id": "loorgd1",
      "author": "empty_fruit_6747",
      "body": "It's not a disease about vanity or wanting to be attractive to others. It goes far beyond those sorts of mentality. \n\nAlso the whole ignorant 'just eat a burger' mentality can go to hell",
      "created_utc": 1727184620.0,
      "score": 27,
      "context": []
    },
    {
      "id": "lop22tw",
      "author": "VeniceBtich",
      "body": "That you can have anorexia and not look necessarily unwell. Functioning anorexic maybe? When I was at my unhealthiest and lowest weight, people constantly told me how good I looked, how healthy and \"soft\" one guy told me I looked!! I was severely underweight, but absolutely did not look knobbly-kneed thin like some people you see. \n\nAlso, when I was actually at my unhealthiest, when I felt like I was actually going to have a heart attack, I even was at a healthy bmi.  \nSo yeah, looks can be deceiving.",
      "created_utc": 1727188297.0,
      "score": 25,
      "context": []
    },
    {
      "id": "lopiwkq",
      "author": "Kattorimu",
      "body": "That being anorexic doesn't mean you never eat and people seeing you eat doesn't mean you're doing any better physically or mentally. I can sob my heart out over a bowl of watermelon then 5 hours later have a moment and eat a whole box of pizza. That you have good days and bad days. Having a day or multiple days of full eating doesn't make you no longer anorexic and completely better. \n\nThat being malnourished and dying/experiencing deadly complications can happen at any weight, you don't have to be skin and bones and LOOK on the brink of death to be there. That most people with ana aren't UW but that's all you see or think of.\n\nThat I spend every day agonizing over getting through the day and just hurrying up and passing the time to get away from all the food noise and self hatred. Nothing in life is enjoyable anymore, I'm so miserable. If I had the option to erase ed completely from my brain but in return be in a body double or triple my size but happy and healthy, I would take it in an instant. \n\nThat I don't hate fat people or look down on them in anyway, think that they are ugly or gross. \n\nI honestly look at fat bodies more than skinny ones. I look at the beautiful fat girls with radiating smiles eating a meal and laughing with friends and wearing a cute outfit and those are the kinds of girls I am jealous of. Not the ones that look miserable off a cup of coffee a day or the ones living off one protein bar and hours at the gym every day. I'm jealous of the fat girls powerlifting at the gym fueling themselves looking strong as fuck not the ones who struggle lifting their body weight to get out of bed. I wish I was a man at this point because in terms of weight and food, men are bashed so much less than women. \n\nThat this disorder has turned me into a shell of person and I feel so broken, tired, angry, hungry, alone, ugly, disgusting, repulsive, depressed. All I want to do is to eat or die and I'm so done with life and ready to end it all every day. I am so so tired of living this way and want it to all go away, to wake up from it like some sort of awful nightmare. There's absolutely nothing that I can enjoy anymore because everything revolves around food and burning cals.",
      "created_utc": 1727193629.0,
      "score": 38,
      "context": []
    },
    {
      "id": "lopbf2i",
      "author": "Excellent_Gur_9249",
      "body": "That I still eat lol. That I literally forget sm and have lost parts of myself…",
      "created_utc": 1727191303.0,
      "score": 15,
      "context": []
    },
    {
      "id": "loou73i",
      "author": "Anabundanceofbunda",
      "body": "Recently had my grandma tell me that if I wanted to I could've stopped and, while shes just old and doesn't know too much about the illness, it did really upset me for a while. \nI was so out of touch with reality, genuinely thought that I was invincible at some points where even death scares weren't enough to get me to stop.\n I was living with people who didn't see me or notice how bad I had gotten. The only reason I ever started recovery was because I moved here (with my grandma).\nI was so out of control in the end. I remember seeing blood in my vomit, telling myself I was never going to do something like that again. Found myself back in the bathroom the next day.\nI woke up in the middle of the night because I felt like I couldn't breathe. Constantly checking my heart rate and blood pressure. Heart rate in the 30s and I couldn't bring myself to start recovery.\nIn the end I wanted to stop more than anything but I genuinely couldn't stick to it. \nI hate the idea that everything is within your control, maybe some aspects are. But i really don't think I was to blame for it getting as bad as it did. I didn't feel sick. I never saw how bad it had gotten until two months ago when I looked back at old photos, remembered small snippets of that time,\nRealised the last seven years of my life have been a  blur, the last year even more so. I hate the idea that eating disorders are voluntary. That they're something you can choose to have and then choose to snap out of. \n\n\nAnother one, I think, is a pretty obvious one.\n That it's not about weight. That lower weights dont make you more valid. Ive had an eating disorder for 7 years, only in the last year was I ever underweight. \n\nONE year, out of seven, did I fit the stupid criteria for a diagnosis and, even then, from what I've seen about the NHS ED services, sometimes even that underweight BMI means nothing to them unless you're about to die.\n\nI was sick before I was underweight and the years of trying to fit the stupid criteria destroyed my health so much so that when I reached what was borderline underweight my body was having none of it and started genuinely failing on me where some people can get to BMI 11 and have fairly little issue. \nThe lower my weight got past that, the worse I felt physically.\nIt's so stupid to look at weight when, clearly, my body felt uncomfortable even being near the underweight category. \nThey're so incredibly personal and where people can stay alive for months,even years, in a sickeningly low bmi, I personally don't think I would've survived past 14. When you put so much emphasis on something so stupid, you make people sicker.\n You draw out their illness for longer, you essentially give them a death sentence when you don't act immediately. I'm so lucky to be in recovery and I'm so lucky that I didn't leave it until it was too late and that my mind wasn't starved beyond convincing.\n\n I think the eating disorder statistic is bullshit. I think Recovery potential is much higher than what is shown. I think people are just not given the resources and environment to recover. I think people aren't given the chance.",
      "created_utc": 1727185609.0,
      "score": 14,
      "context": []
    },
    {
      "id": "loopuwc",
      "author": "TapRevolutionary5022",
      "body": "That you can have it and not be super thin. Or even thin.",
      "created_utc": 1727184032.0,
      "score": 30,
      "context": []
    },
    {
      "id": "loqaii3",
      "author": "incorrectlyironman",
      "body": "That I'm not vain, I'm not doing it to look good, and confronting me to tell me I look like shit in hopes of getting me to stop is no less cruel than doing it to anyone without AN. \n\nThat it's a coping mechanism I use when I feel like shit. So snarky comments about how little I'm eating or how bad I look are counterproductive, they make me feel worse and eat less as a result. \n\nThat I don't feel a sense of superiority over people with other eating disorders, or overweight people, or people who eat a normal (or larger than normal) amount. \"If you think you're fat then you must think I'm huuuuge\" is not how it works. Also that most underweight people with long term AN are aware that they're thin, at least on some level, but that doesn't take away the obsessions or the attachment to the ED as a coping mechanism. Telling me \"you know you're not fat at all right\" does nothing. \n\nThat I'm suffering too and that relapses aren't some kind of shameless self-indulgence at the expense of the people around me. \n\nThat \"warning\" me about the risk of \"going too far in the other direction\" during a recovery attempt is one of the most harmful things you could possibly do to someone who has an obsessive fear of that exact thing.",
      "created_utc": 1727202217.0,
      "score": 14,
      "context": []
    },
    {
      "id": "loom712",
      "author": "Miserable_Thought933",
      "body": "That it's not easy just saying to a person who's anorexic  just eat you need to take it out of your head. Don't listen to the voice. It's not that easy and I wish people would understand that!!",
      "created_utc": 1727182636.0,
      "score": 16,
      "context": []
    },
    {
      "id": "loozac7",
      "author": "False_Look_1212",
      "body": "That eating more/getting healthier physically doesn't fix the problem. You may look and be so much physically healthier but be suffering inside 100x more. It fucking hurts to lose the part of my identity I've clung to for years even though I know its just a sickness. \n\nI want to get better but at the same time I want to get worse :')",
      "created_utc": 1727187364.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lophqfa",
      "author": "ImOnlyHereForTheSims",
      "body": "That we don’t want to be sick and we don’t want to ruin anyone else’s lives :(",
      "created_utc": 1727193268.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lopufgk",
      "author": "Quirky_Top_8990",
      "body": "That’s it’s not romantic, it’s not cute, it’s not glamorous and it will destroy your life eventually.",
      "created_utc": 1727197242.0,
      "score": 9,
      "context": []
    },
    {
      "id": "loqlff5",
      "author": "runchmunch",
      "body": "that it’s not even about food",
      "created_utc": 1727205630.0,
      "score": 7,
      "context": []
    },
    {
      "id": "loqz7rx",
      "author": "whyamIevenhere83",
      "body": "That for some of us, the eating disorder tricked us into loving it before we started to hate it. \nI have this thing that I can engage in that makes ZERO logical sense but thanks to genetics, environment and over 25 years of playing with this shit- I still feel like it's my best friend when things are shity. Despite how close it has come to killing me and its deadly progression over time- it's still an alternative to constant debilitating SI. \nThat's what I wish people knew.",
      "created_utc": 1727209923.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lor0nt7",
      "author": "alienprincess111",
      "body": "For me, it's that anorexia is an addiction, somewhat like being an alcoholic.  This is why one can't just stop restricting.  I would also add that not everyone with anorexia thinks they are fat when they are emaciated.  I am so ashamed I am thin, but I can't change it because I am addicted to the restriction.",
      "created_utc": 1727210378.0,
      "score": 8,
      "context": []
    },
    {
      "id": "loq0310",
      "author": "sad_potat_07",
      "body": "That anorexics still eat. For some reason, many people think that anorexics literally never consume food. Or they think we only eat salad. Obviously we still eat, and it doesn't matter what we eat, we can still be disordered.",
      "created_utc": 1727198994.0,
      "score": 5,
      "context": []
    },
    {
      "id": "loqt4yb",
      "author": "Timely_Yesterday7007",
      "body": "I’m not doing this for attention. If I could just eat, I would. I know what malnutrition does to people and your body. It’s not as simple as saying “just eat or else your body will shut down”. I don’t know why I can’t eat, but I’m not doing it for your pity.",
      "created_utc": 1727208020.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lotej00",
      "author": "garnetandjade",
      "body": "That it’s always a downhill spiral… I have a cycle of losing weight until I’m very thin and people start making comments, and then when people comment I tell myself I’ve “earned” eating again and I “must” put on some weight in order to not be a burden and a worry to others. So I’ll binge for a while, gain weight until I’m no longer UW and maybe even carrying a few extra… and then suddenly become horrified and think “I’ve gone too far,” and the cycle starts again. This has gone on for a decade. People envision anorexia as linear… losing weight and getting and staying super duper thin. But for me it’s always been a cruel cycle. People just sort of assume my weight fluctuates at this point. I sort of hope other people experience this too, because it feels very isolating.",
      "created_utc": 1727245253.0,
      "score": 5,
      "context": []
    },
    {
      "id": "los4mhy",
      "author": "Imaginary_Meaning",
      "body": "I wish people knew it's less about social media and pretty standards and more about being in control. I don't have anorexia because i want to look like Gisele Bundchen I have it because I'm a perfectionist and hate myself",
      "created_utc": 1727224406.0,
      "score": 3,
      "context": []
    },
    {
      "id": "losud18",
      "author": "SweetSweetBee",
      "body": "that im not starving myself to torture/make others feel bad, my mom used to accuse me of it before i got diagnosed",
      "created_utc": 1727234514.0,
      "score": 4,
      "context": []
    },
    {
      "id": "loopeex",
      "author": "No_Cartoonist_1441",
      "body": "Something I wish people would stop saying is, \"You like the attention.\" Yes, when I was extremely overweight, I wanted to lose the weight.. Now, I just want the ED to disappear like an ex-boyfriend.",
      "created_utc": 1727183861.0,
      "score": 7,
      "context": []
    },
    {
      "id": "loos8tv",
      "author": "Many_Flamingo_5153",
      "body": "“just eat!” does more harm than good",
      "created_utc": 1727184909.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lorcjuq",
      "author": "None",
      "body": "That it’s more than just looking a certain way, and that recovery feels like failing because you feel so out of control. You gain weight but you’re still fighting the food noise and end up hating yourself more at points in recovery because of constantly being watched and assessed and trying to get better but hating every second of it. \n\nThat recovery programs often make things worse. Still blows my mind they try to get out to go from heavy restriction and food fears to eating things like 2 magnum ice creams for a snack and sit there watching you every meal commenting. Like as if I didn’t have enough trouble it triggered the worst food thoughts and fears ever",
      "created_utc": 1727214244.0,
      "score": 3,
      "context": []
    },
    {
      "id": "loserc9",
      "author": "Nex_Nova_",
      "body": "The things it actually does to your body and mind slowly (or rapidly).",
      "created_utc": 1727228248.0,
      "score": 3,
      "context": []
    },
    {
      "id": "losoyxs",
      "author": "Actual_Reception2610",
      "body": "I quote the documentary THIN this girl said “I used to have a personality” \n\nInstead of having a life my entire life is to accommodate anorexia. \n\nRecovery is not linear and I personally don’t believe full recovery is possible, those thought don’t completely leave and the recovered person just get better at being logical and not act on those thoughts and the most insignificant thing can trigger a whole relapse \n\nYou don’t magically recover love food and live in happy land",
      "created_utc": 1727232226.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lot6hqy",
      "author": "ButterflyHarpGirl",
      "body": "To be willing to hear my personal experiences & thoughts before making judgments…",
      "created_utc": 1727240515.0,
      "score": 3,
      "context": []
    },
    {
      "id": "loybqi9",
      "author": "SarcasticSnowflake17",
      "body": "It isn’t about weight but it is at the same time. Idk how to describe it. \n\nLike obviously weight is on my mind a LOT and obsession over weight is part of the diagnosis. But I don’t care about weight for the sake of caring about weight, it’s not about vanity or beauty standards. Anorexia is a fully self-perpetuating cyclical disease that exists in my mind and manifests itself on the surface as being about weight. \n\nBut the actual cause is deeper. For me it’s about wanting control, approval, acceptance, and the high that starving can bring. But it’s also an addiction. There’s a physical and psychological high that it gives me that I can’t seem to stop craving, even 5 years in recovery.",
      "created_utc": 1727314226.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lopr8he",
      "author": "strawberryfemme1",
      "body": "I wish people didn't think I hate bigger people. My problems with food and eating have nothing to do with how I view others",
      "created_utc": 1727196255.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lou2fps",
      "author": "SnooRevelations7103",
      "body": "My anorexia didn't start from a place of trying to be thin or pretty. It started from been so sad and wanting die, so i ran to feel a little closer to death without harming myself. \n\nThen i got so focused on what i perceived as being \"good\" for post work out meals and \"perfecting\" my macros, vitamins and minerals. Then the running distance became too easy so it doubled, then tripled then became 2 triple length runs per day. THEN, after 2 yrs of fighting myself, came the restriction down (not going into specifics), then came the 2 tripled runs before i was \"allowed\" to eat. Then I partially tore my achilles and had to stop running but if i didnt run, i couldnt eat. So I'd walk the same distances (obviously that didnt allow it to heal well) so i had to stop. Then i passed out at work from fasting too long and i put my patients at risk. \nAnd that was always my hardline for when id gotten \"too bad\" was if my BMI hit a certain number, or i couldnt take care of my people and became a burden on my team. My team had been telling me for months that i was looking ill but i kept laughing and telling them i was just really into my running and hadnt quite worked out my calories in vs calories out properly.",
      "created_utc": 1727261263.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lovoi43",
      "author": "AbundantiaTheWitch",
      "body": "Someone very recently said to me “if anorexic people could actually see how bad it makes their bodies look they wouldn’t have an eating disorder”. So probably making more people aware that it’s not just a switch you can turn off even when you know the consequences",
      "created_utc": 1727282585.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lovplcf",
      "author": "daisycaulfield",
      "body": "That it’s the most complex, highly misunderstood, 100% 24/7 all consuming severe illness that no one could possibly even begin to understand how it feels and what it is like to live with unless you have it/had it yourself.",
      "created_utc": 1727282920.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lovwmp5",
      "author": "New-Philosopher5624",
      "body": "That because I struggle with my image doesn't mean i think you're fat. “If you're fat then what am i?? a whale” like i do not even think about your weight 😭",
      "created_utc": 1727285087.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lox4ktj",
      "author": "tc26981",
      "body": "Well said! I can’t ever explain anorexia even to myself. One thing I struggle with is allowing myself to eat before any tasks I have are done. I wish others could understand that. Another thing for some reason is I am ashamed of eating. I can’t explain that either, if someone else can I am listening.",
      "created_utc": 1727298684.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m7cwkjp",
      "author": "www_tttfff",
      "body": "The forcing to eat.. I would literally hate you if u forced me to eat when I'm fasting I hate that shit like saying c'mon it's jus one bite it won't hurt will it's not just a fuckin bite now u ruined my whole week cuz I won't be able to stop on eating so it's not just a fuckin bite",
      "created_utc": 1736982651.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mah5k7h",
      "author": "PossibilityWeekly406",
      "body": "people never talk about its not just easy to start eating again. its an addiction. like any drug you can't just stop.  \nanother thing is its not just for people who are females who are white and skinny. it applies to everyone.",
      "created_utc": 1738459206.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lza1bgf",
      "author": "Responsible-Major921",
      "body": "1. you dont have to be underweight to be anorexic. anorexia attacks ppl of all shapes, sizes, and weights. \n\n2. yes, many anorexics lie frequently, but not constantly. ppl are always think that we are always lying. it pisses me off. like, stop accusing me! \n\n3. we are ppl too. the rules and punishments that go on in ed treatments are actually scary af. i knew one girl who was locked in a room and not allowed to talk to anyone until she hit a certain weight. she was there for weeks.",
      "created_utc": 1732731079.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m066dbp",
      "author": "Explosiveclit",
      "body": "Something i struggle with and people look past is that i am aware im anorexic, im not oblivious to the fact that i am sick. I am fully aware of my decisions and their consequences, i still do it. Some days i choose to inflict it more than others. Some days i intentionally starve myself and some other days i dont. Some days i actually eat and dont feel guilty for a few hours but most i do. Anorexia is not always starving yourself and feeling guilty, sometimes i dont feel guilty for eating, but its the guilt after i do that continues the cycle.",
      "created_utc": 1733213058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mtb0khr",
      "author": "Tricky_Bet_2914",
      "body": "That I love eating, I love food. I’m just so scared of gaining weight I refuse to give my body the luxury of it. ",
      "created_utc": 1747753068.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loonwm4",
      "author": "Coffeegreysky12",
      "body": "Well said",
      "created_utc": 1727183297.0,
      "score": 8,
      "context": [
        {
          "id": "loonskb",
          "author": "notitymp",
          "body": "that being malnourished doesn’t mean you’re skin and bones, that you can still die from anorexia at a higher weight, that it can change your personality when you’re afflicted with brain fog, just how it actually works in general",
          "created_utc": 1727183255.0
        }
      ]
    },
    {
      "id": "loosb09",
      "author": "Coffeegreysky12",
      "body": "This is a great one. I am autistic. Lots of anorexic people have autism and I wish eating disorder programs would offer more accommodations for those of us with anorexia and autism. The eating disorder programs I went to were not designed for those with autism. They didn't understand my sensory sensitivities or my anxiety about change and need for a routine. Luckily, I have a treatment team now that understands how the anorexia and autism affect each other and they don't shame me for my struggles.",
      "created_utc": 1727184930.0,
      "score": 16,
      "context": [
        {
          "id": "loorse0",
          "author": "LoveThatForYouBebe",
          "body": "That “gold standard” treatments (looking at you, CBT) aren’t designed with autistic brains in mind. And a lot of people with AN are autistic, much larger a percentage than the population at-large. It doesn’t mean you’re a failure if it takes a long time to find an approach that works for you.\n\nEdit: stupid typo",
          "created_utc": 1727184743.0
        }
      ]
    },
    {
      "id": "lopu3ry",
      "author": "Quirky_Top_8990",
      "body": "This is exactly why treatment didn’t work for me and I had to recover alone.",
      "created_utc": 1727197141.0,
      "score": 7,
      "context": [
        {
          "id": "loorse0",
          "author": "LoveThatForYouBebe",
          "body": "That “gold standard” treatments (looking at you, CBT) aren’t designed with autistic brains in mind. And a lot of people with AN are autistic, much larger a percentage than the population at-large. It doesn’t mean you’re a failure if it takes a long time to find an approach that works for you.\n\nEdit: stupid typo",
          "created_utc": 1727184743.0
        }
      ]
    },
    {
      "id": "lou463a",
      "author": "milkisterrifying",
      "body": "this a thousand times over, and there have actually been studies on it too!",
      "created_utc": 1727262196.0,
      "score": 6,
      "context": [
        {
          "id": "loorse0",
          "author": "LoveThatForYouBebe",
          "body": "That “gold standard” treatments (looking at you, CBT) aren’t designed with autistic brains in mind. And a lot of people with AN are autistic, much larger a percentage than the population at-large. It doesn’t mean you’re a failure if it takes a long time to find an approach that works for you.\n\nEdit: stupid typo",
          "created_utc": 1727184743.0
        }
      ]
    },
    {
      "id": "loovghl",
      "author": "Coffeegreysky12",
      "body": "Well said. It is so important to have people in your life that validate your struggles and stand by you, through the darkest moments. It's an awful illness and no one should go through it alone",
      "created_utc": 1727186048.0,
      "score": 3,
      "context": [
        {
          "id": "loouw5w",
          "author": "Silver-Corgi4435",
          "body": "That it will take everything from you and you will eventually loose every connection and relationship you have and by the time it does you’re too tired and too in deep to care. The people who stay and stand by you through the darkest parts love you for you",
          "created_utc": 1727185852.0
        }
      ]
    },
    {
      "id": "lovn6as",
      "author": "daisycaulfield",
      "body": "Yeah this is so true. People don’t understand how severely isolating anorexia is.",
      "created_utc": 1727282174.0,
      "score": 2,
      "context": [
        {
          "id": "loouw5w",
          "author": "Silver-Corgi4435",
          "body": "That it will take everything from you and you will eventually loose every connection and relationship you have and by the time it does you’re too tired and too in deep to care. The people who stay and stand by you through the darkest parts love you for you",
          "created_utc": 1727185852.0
        }
      ]
    },
    {
      "id": "loorvy4",
      "author": "Coffeegreysky12",
      "body": "Exactly. I hate the \"eat a burger\" or \"eat a sandwich\" comments that people make.",
      "created_utc": 1727184778.0,
      "score": 5,
      "context": [
        {
          "id": "loorgd1",
          "author": "empty_fruit_6747",
          "body": "It's not a disease about vanity or wanting to be attractive to others. It goes far beyond those sorts of mentality. \n\nAlso the whole ignorant 'just eat a burger' mentality can go to hell",
          "created_utc": 1727184620.0
        }
      ]
    },
    {
      "id": "lop3g1w",
      "author": "Coffeegreysky12",
      "body": "Yes, not everyone is going to look obviously sick on the outside, but that does not mean they are not still suffering physically, mentally and emotionally. You can't always tell who suffers from an eating disorder. It won't always look obvious, but that doesn't mean the person isn't severely ill. I wish more people would realize this. Anorexia isn't a look.",
      "created_utc": 1727188743.0,
      "score": 5,
      "context": [
        {
          "id": "lop22tw",
          "author": "VeniceBtich",
          "body": "That you can have anorexia and not look necessarily unwell. Functioning anorexic maybe? When I was at my unhealthiest and lowest weight, people constantly told me how good I looked, how healthy and \"soft\" one guy told me I looked!! I was severely underweight, but absolutely did not look knobbly-kneed thin like some people you see. \n\nAlso, when I was actually at my unhealthiest, when I felt like I was actually going to have a heart attack, I even was at a healthy bmi.  \nSo yeah, looks can be deceiving.",
          "created_utc": 1727188297.0
        }
      ]
    },
    {
      "id": "loplm14",
      "author": "Coffeegreysky12",
      "body": "Well said. I am sorry you are struggling. Your struggles are valid and I hope you start feeling better.",
      "created_utc": 1727194485.0,
      "score": 7,
      "context": [
        {
          "id": "lopiwkq",
          "author": "Kattorimu",
          "body": "That being anorexic doesn't mean you never eat and people seeing you eat doesn't mean you're doing any better physically or mentally. I can sob my heart out over a bowl of watermelon then 5 hours later have a moment and eat a whole box of pizza. That you have good days and bad days. Having a day or multiple days of full eating doesn't make you no longer anorexic and completely better. \n\nThat being malnourished and dying/experiencing deadly complications can happen at any weight, you don't have to be skin and bones and LOOK on the brink of death to be there. That most people with ana aren't UW but that's all you see or think of.\n\nThat I spend every day agonizing over getting through the day and just hurrying up and passing the time to get away from all the food noise and self hatred. Nothing in life is enjoyable anymore, I'm so miserable. If I had the option to erase ed completely from my brain but in return be in a body double or triple my size but happy and healthy, I would take it in an instant. \n\nThat I don't hate fat people or look down on them in anyway, think that they are ugly or gross. \n\nI honestly look at fat bodies more than skinny ones. I look at the beautiful fat girls with radiating smiles eating a meal and laughing with friends and wearing a cute outfit and those are the kinds of girls I am jealous of. Not the ones that look miserable off a cup of coffee a day or the ones living off one protein bar and hours at the gym every day. I'm jealous of the fat girls powerlifting at the gym fueling themselves looking strong as fuck not the ones who struggle lifting their body weight to get out of bed. I wish I was a man at this point because in terms of weight and food, men are bashed so much less than women. \n\nThat this disorder has turned me into a shell of person and I feel so broken, tired, angry, hungry, alone, ugly, disgusting, repulsive, depressed. All I want to do is to eat or die and I'm so done with life and ready to end it all every day. I am so so tired of living this way and want it to all go away, to wake up from it like some sort of awful nightmare. There's absolutely nothing that I can enjoy anymore because everything revolves around food and burning cals.",
          "created_utc": 1727193629.0
        }
      ]
    },
    {
      "id": "lote42m",
      "author": "garnetandjade",
      "body": "Thank you for writing this. It resonates deeply",
      "created_utc": 1727244990.0,
      "score": 3,
      "context": [
        {
          "id": "lopiwkq",
          "author": "Kattorimu",
          "body": "That being anorexic doesn't mean you never eat and people seeing you eat doesn't mean you're doing any better physically or mentally. I can sob my heart out over a bowl of watermelon then 5 hours later have a moment and eat a whole box of pizza. That you have good days and bad days. Having a day or multiple days of full eating doesn't make you no longer anorexic and completely better. \n\nThat being malnourished and dying/experiencing deadly complications can happen at any weight, you don't have to be skin and bones and LOOK on the brink of death to be there. That most people with ana aren't UW but that's all you see or think of.\n\nThat I spend every day agonizing over getting through the day and just hurrying up and passing the time to get away from all the food noise and self hatred. Nothing in life is enjoyable anymore, I'm so miserable. If I had the option to erase ed completely from my brain but in return be in a body double or triple my size but happy and healthy, I would take it in an instant. \n\nThat I don't hate fat people or look down on them in anyway, think that they are ugly or gross. \n\nI honestly look at fat bodies more than skinny ones. I look at the beautiful fat girls with radiating smiles eating a meal and laughing with friends and wearing a cute outfit and those are the kinds of girls I am jealous of. Not the ones that look miserable off a cup of coffee a day or the ones living off one protein bar and hours at the gym every day. I'm jealous of the fat girls powerlifting at the gym fueling themselves looking strong as fuck not the ones who struggle lifting their body weight to get out of bed. I wish I was a man at this point because in terms of weight and food, men are bashed so much less than women. \n\nThat this disorder has turned me into a shell of person and I feel so broken, tired, angry, hungry, alone, ugly, disgusting, repulsive, depressed. All I want to do is to eat or die and I'm so done with life and ready to end it all every day. I am so so tired of living this way and want it to all go away, to wake up from it like some sort of awful nightmare. There's absolutely nothing that I can enjoy anymore because everything revolves around food and burning cals.",
          "created_utc": 1727193629.0
        }
      ]
    },
    {
      "id": "lopcooj",
      "author": "Coffeegreysky12",
      "body": "Exactly. Anorexic people still eat",
      "created_utc": 1727191696.0,
      "score": 5,
      "context": [
        {
          "id": "lopbf2i",
          "author": "Excellent_Gur_9249",
          "body": "That I still eat lol. That I literally forget sm and have lost parts of myself…",
          "created_utc": 1727191303.0
        }
      ]
    },
    {
      "id": "loov8a7",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing. I am sorry you had to go through all that and I am glad you are in recovery. Your struggles are valid. People can be seriously ill even when they are not severely underweight. I wish people would understand this. Eating disorders affect every person differently. And people can and do recover. But not everyone can find the support they need, and that's sad. I wish everyone that suffered from this had the help they need and deserve. No one should go through something like this on their own",
      "created_utc": 1727185970.0,
      "score": 6,
      "context": [
        {
          "id": "loou73i",
          "author": "Anabundanceofbunda",
          "body": "Recently had my grandma tell me that if I wanted to I could've stopped and, while shes just old and doesn't know too much about the illness, it did really upset me for a while. \nI was so out of touch with reality, genuinely thought that I was invincible at some points where even death scares weren't enough to get me to stop.\n I was living with people who didn't see me or notice how bad I had gotten. The only reason I ever started recovery was because I moved here (with my grandma).\nI was so out of control in the end. I remember seeing blood in my vomit, telling myself I was never going to do something like that again. Found myself back in the bathroom the next day.\nI woke up in the middle of the night because I felt like I couldn't breathe. Constantly checking my heart rate and blood pressure. Heart rate in the 30s and I couldn't bring myself to start recovery.\nIn the end I wanted to stop more than anything but I genuinely couldn't stick to it. \nI hate the idea that everything is within your control, maybe some aspects are. But i really don't think I was to blame for it getting as bad as it did. I didn't feel sick. I never saw how bad it had gotten until two months ago when I looked back at old photos, remembered small snippets of that time,\nRealised the last seven years of my life have been a  blur, the last year even more so. I hate the idea that eating disorders are voluntary. That they're something you can choose to have and then choose to snap out of. \n\n\nAnother one, I think, is a pretty obvious one.\n That it's not about weight. That lower weights dont make you more valid. Ive had an eating disorder for 7 years, only in the last year was I ever underweight. \n\nONE year, out of seven, did I fit the stupid criteria for a diagnosis and, even then, from what I've seen about the NHS ED services, sometimes even that underweight BMI means nothing to them unless you're about to die.\n\nI was sick before I was underweight and the years of trying to fit the stupid criteria destroyed my health so much so that when I reached what was borderline underweight my body was having none of it and started genuinely failing on me where some people can get to BMI 11 and have fairly little issue. \nThe lower my weight got past that, the worse I felt physically.\nIt's so stupid to look at weight when, clearly, my body felt uncomfortable even being near the underweight category. \nThey're so incredibly personal and where people can stay alive for months,even years, in a sickeningly low bmi, I personally don't think I would've survived past 14. When you put so much emphasis on something so stupid, you make people sicker.\n You draw out their illness for longer, you essentially give them a death sentence when you don't act immediately. I'm so lucky to be in recovery and I'm so lucky that I didn't leave it until it was too late and that my mind wasn't starved beyond convincing.\n\n I think the eating disorder statistic is bullshit. I think Recovery potential is much higher than what is shown. I think people are just not given the resources and environment to recover. I think people aren't given the chance.",
          "created_utc": 1727185609.0
        }
      ]
    },
    {
      "id": "looq3ue",
      "author": "Coffeegreysky12",
      "body": "Yep",
      "created_utc": 1727184125.0,
      "score": 3,
      "context": [
        {
          "id": "loopuwc",
          "author": "TapRevolutionary5022",
          "body": "That you can have it and not be super thin. Or even thin.",
          "created_utc": 1727184032.0
        }
      ]
    },
    {
      "id": "loqhfu7",
      "author": "Coffeegreysky12",
      "body": "Well said. This is all true. Thank you for sharing",
      "created_utc": 1727204375.0,
      "score": 1,
      "context": [
        {
          "id": "loqaii3",
          "author": "incorrectlyironman",
          "body": "That I'm not vain, I'm not doing it to look good, and confronting me to tell me I look like shit in hopes of getting me to stop is no less cruel than doing it to anyone without AN. \n\nThat it's a coping mechanism I use when I feel like shit. So snarky comments about how little I'm eating or how bad I look are counterproductive, they make me feel worse and eat less as a result. \n\nThat I don't feel a sense of superiority over people with other eating disorders, or overweight people, or people who eat a normal (or larger than normal) amount. \"If you think you're fat then you must think I'm huuuuge\" is not how it works. Also that most underweight people with long term AN are aware that they're thin, at least on some level, but that doesn't take away the obsessions or the attachment to the ED as a coping mechanism. Telling me \"you know you're not fat at all right\" does nothing. \n\nThat I'm suffering too and that relapses aren't some kind of shameless self-indulgence at the expense of the people around me. \n\nThat \"warning\" me about the risk of \"going too far in the other direction\" during a recovery attempt is one of the most harmful things you could possibly do to someone who has an obsessive fear of that exact thing.",
          "created_utc": 1727202217.0
        }
      ]
    },
    {
      "id": "loqaw1q",
      "author": "Own_Difference800",
      "body": "Nothing annoys me more than people saying “just eat” 🫠. Like it infuriates me.",
      "created_utc": 1727202333.0,
      "score": 7,
      "context": [
        {
          "id": "loom712",
          "author": "Miserable_Thought933",
          "body": "That it's not easy just saying to a person who's anorexic  just eat you need to take it out of your head. Don't listen to the voice. It's not that easy and I wish people would understand that!!",
          "created_utc": 1727182636.0
        }
      ]
    },
    {
      "id": "loomezh",
      "author": "Coffeegreysky12",
      "body": "So true. I wish more people would understand this as well",
      "created_utc": 1727182722.0,
      "score": 2,
      "context": [
        {
          "id": "loom712",
          "author": "Miserable_Thought933",
          "body": "That it's not easy just saying to a person who's anorexic  just eat you need to take it out of your head. Don't listen to the voice. It's not that easy and I wish people would understand that!!",
          "created_utc": 1727182636.0
        }
      ]
    },
    {
      "id": "loq0emz",
      "author": "sad_potat_07",
      "body": "I agree. People think once were weight restored that were better and fully recovered. If anything, I felt even worse mentally. It doesn't mean we're recovered, it's not about weight",
      "created_utc": 1727199093.0,
      "score": 4,
      "context": [
        {
          "id": "loozac7",
          "author": "False_Look_1212",
          "body": "That eating more/getting healthier physically doesn't fix the problem. You may look and be so much physically healthier but be suffering inside 100x more. It fucking hurts to lose the part of my identity I've clung to for years even though I know its just a sickness. \n\nI want to get better but at the same time I want to get worse :')",
          "created_utc": 1727187364.0
        }
      ]
    },
    {
      "id": "loozjp6",
      "author": "Coffeegreysky12",
      "body": "Yes, exactly. It's a mental illness and just because a person appears to be doing better on the outside does not mean they aren't still suffering, internally",
      "created_utc": 1727187454.0,
      "score": 2,
      "context": [
        {
          "id": "loozac7",
          "author": "False_Look_1212",
          "body": "That eating more/getting healthier physically doesn't fix the problem. You may look and be so much physically healthier but be suffering inside 100x more. It fucking hurts to lose the part of my identity I've clung to for years even though I know its just a sickness. \n\nI want to get better but at the same time I want to get worse :')",
          "created_utc": 1727187364.0
        }
      ]
    },
    {
      "id": "lophz8l",
      "author": "Coffeegreysky12",
      "body": "Exactly. We don't want to be sick and we didn't choose to be sick.",
      "created_utc": 1727193345.0,
      "score": 3,
      "context": [
        {
          "id": "lophqfa",
          "author": "ImOnlyHereForTheSims",
          "body": "That we don’t want to be sick and we don’t want to ruin anyone else’s lives :(",
          "created_utc": 1727193268.0
        }
      ]
    },
    {
      "id": "lopuqx7",
      "author": "Coffeegreysky12",
      "body": "Yes, that's the truth",
      "created_utc": 1727197341.0,
      "score": 2,
      "context": [
        {
          "id": "lopufgk",
          "author": "Quirky_Top_8990",
          "body": "That’s it’s not romantic, it’s not cute, it’s not glamorous and it will destroy your life eventually.",
          "created_utc": 1727197242.0
        }
      ]
    },
    {
      "id": "loqlk1s",
      "author": "Coffeegreysky12",
      "body": "So true",
      "created_utc": 1727205671.0,
      "score": 1,
      "context": [
        {
          "id": "loqlff5",
          "author": "runchmunch",
          "body": "that it’s not even about food",
          "created_utc": 1727205630.0
        }
      ]
    },
    {
      "id": "lovo5l4",
      "author": "daisycaulfield",
      "body": "So true. Even though the honey moon stages don’t  last forever, I feel like AN is my only true safe space, literally the only thing that allows me to survive mentally.",
      "created_utc": 1727282477.0,
      "score": 2,
      "context": [
        {
          "id": "loqz7rx",
          "author": "whyamIevenhere83",
          "body": "That for some of us, the eating disorder tricked us into loving it before we started to hate it. \nI have this thing that I can engage in that makes ZERO logical sense but thanks to genetics, environment and over 25 years of playing with this shit- I still feel like it's my best friend when things are shity. Despite how close it has come to killing me and its deadly progression over time- it's still an alternative to constant debilitating SI. \nThat's what I wish people knew.",
          "created_utc": 1727209923.0
        }
      ]
    },
    {
      "id": "loqznr1",
      "author": "Coffeegreysky12",
      "body": "Very true",
      "created_utc": 1727210063.0,
      "score": 1,
      "context": [
        {
          "id": "loqz7rx",
          "author": "whyamIevenhere83",
          "body": "That for some of us, the eating disorder tricked us into loving it before we started to hate it. \nI have this thing that I can engage in that makes ZERO logical sense but thanks to genetics, environment and over 25 years of playing with this shit- I still feel like it's my best friend when things are shity. Despite how close it has come to killing me and its deadly progression over time- it's still an alternative to constant debilitating SI. \nThat's what I wish people knew.",
          "created_utc": 1727209923.0
        }
      ]
    },
    {
      "id": "lor1jix",
      "author": "Coffeegreysky12",
      "body": "Exactly. Everyone with anorexia is different. And some people are aware that they are thin",
      "created_utc": 1727210653.0,
      "score": 2,
      "context": [
        {
          "id": "lor0nt7",
          "author": "alienprincess111",
          "body": "For me, it's that anorexia is an addiction, somewhat like being an alcoholic.  This is why one can't just stop restricting.  I would also add that not everyone with anorexia thinks they are fat when they are emaciated.  I am so ashamed I am thin, but I can't change it because I am addicted to the restriction.",
          "created_utc": 1727210378.0
        }
      ]
    },
    {
      "id": "loq08oq",
      "author": "Coffeegreysky12",
      "body": "Yes, exactly. We still eat and we don't just eat salad.",
      "created_utc": 1727199043.0,
      "score": 2,
      "context": [
        {
          "id": "loq0310",
          "author": "sad_potat_07",
          "body": "That anorexics still eat. For some reason, many people think that anorexics literally never consume food. Or they think we only eat salad. Obviously we still eat, and it doesn't matter what we eat, we can still be disordered.",
          "created_utc": 1727198994.0
        }
      ]
    },
    {
      "id": "loqvhlp",
      "author": "Coffeegreysky12",
      "body": "So true",
      "created_utc": 1727208755.0,
      "score": 1,
      "context": [
        {
          "id": "loqt4yb",
          "author": "Timely_Yesterday7007",
          "body": "I’m not doing this for attention. If I could just eat, I would. I know what malnutrition does to people and your body. It’s not as simple as saying “just eat or else your body will shut down”. I don’t know why I can’t eat, but I’m not doing it for your pity.",
          "created_utc": 1727208020.0
        }
      ]
    },
    {
      "id": "lotlqr2",
      "author": "Coffeegreysky12",
      "body": "I am sorry you are going through this",
      "created_utc": 1727250045.0,
      "score": 3,
      "context": [
        {
          "id": "lotej00",
          "author": "garnetandjade",
          "body": "That it’s always a downhill spiral… I have a cycle of losing weight until I’m very thin and people start making comments, and then when people comment I tell myself I’ve “earned” eating again and I “must” put on some weight in order to not be a burden and a worry to others. So I’ll binge for a while, gain weight until I’m no longer UW and maybe even carrying a few extra… and then suddenly become horrified and think “I’ve gone too far,” and the cycle starts again. This has gone on for a decade. People envision anorexia as linear… losing weight and getting and staying super duper thin. But for me it’s always been a cruel cycle. People just sort of assume my weight fluctuates at this point. I sort of hope other people experience this too, because it feels very isolating.",
          "created_utc": 1727245253.0
        }
      ]
    },
    {
      "id": "los6blo",
      "author": "Coffeegreysky12",
      "body": "Yes, control is a big reason why people have eating disorders",
      "created_utc": 1727225027.0,
      "score": 2,
      "context": [
        {
          "id": "los4mhy",
          "author": "Imaginary_Meaning",
          "body": "I wish people knew it's less about social media and pretty standards and more about being in control. I don't have anorexia because i want to look like Gisele Bundchen I have it because I'm a perfectionist and hate myself",
          "created_utc": 1727224406.0
        }
      ]
    },
    {
      "id": "lot0htt",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing",
      "created_utc": 1727237391.0,
      "score": 1,
      "context": [
        {
          "id": "losud18",
          "author": "SweetSweetBee",
          "body": "that im not starving myself to torture/make others feel bad, my mom used to accuse me of it before i got diagnosed",
          "created_utc": 1727234514.0
        }
      ]
    },
    {
      "id": "loopldf",
      "author": "Coffeegreysky12",
      "body": "Yes, I don't like when people say a person is anorexic because they want attention. It's so offensive",
      "created_utc": 1727183933.0,
      "score": 4,
      "context": [
        {
          "id": "loopeex",
          "author": "No_Cartoonist_1441",
          "body": "Something I wish people would stop saying is, \"You like the attention.\" Yes, when I was extremely overweight, I wanted to lose the weight.. Now, I just want the ED to disappear like an ex-boyfriend.",
          "created_utc": 1727183861.0
        }
      ]
    },
    {
      "id": "looskcu",
      "author": "Coffeegreysky12",
      "body": "So true. It doesn't cure the illness and it can actually make the person with anorexia feel worse about themselves",
      "created_utc": 1727185027.0,
      "score": 4,
      "context": [
        {
          "id": "loos8tv",
          "author": "Many_Flamingo_5153",
          "body": "“just eat!” does more harm than good",
          "created_utc": 1727184909.0
        }
      ]
    },
    {
      "id": "loreoia",
      "author": "Coffeegreysky12",
      "body": "Well said. This is exactly what having an eating disorder feels like",
      "created_utc": 1727214970.0,
      "score": 1,
      "context": [
        {
          "id": "lorcjuq",
          "author": "None",
          "body": "That it’s more than just looking a certain way, and that recovery feels like failing because you feel so out of control. You gain weight but you’re still fighting the food noise and end up hating yourself more at points in recovery because of constantly being watched and assessed and trying to get better but hating every second of it. \n\nThat recovery programs often make things worse. Still blows my mind they try to get out to go from heavy restriction and food fears to eating things like 2 magnum ice creams for a snack and sit there watching you every meal commenting. Like as if I didn’t have enough trouble it triggered the worst food thoughts and fears ever",
          "created_utc": 1727214244.0
        }
      ]
    },
    {
      "id": "losf8o5",
      "author": "Coffeegreysky12",
      "body": "Yes, it causes so many complications",
      "created_utc": 1727228431.0,
      "score": 2,
      "context": [
        {
          "id": "loserc9",
          "author": "Nex_Nova_",
          "body": "The things it actually does to your body and mind slowly (or rapidly).",
          "created_utc": 1727228248.0
        }
      ]
    },
    {
      "id": "lospjun",
      "author": "Coffeegreysky12",
      "body": "Well said",
      "created_utc": 1727232466.0,
      "score": 1,
      "context": [
        {
          "id": "losoyxs",
          "author": "Actual_Reception2610",
          "body": "I quote the documentary THIN this girl said “I used to have a personality” \n\nInstead of having a life my entire life is to accommodate anorexia. \n\nRecovery is not linear and I personally don’t believe full recovery is possible, those thought don’t completely leave and the recovered person just get better at being logical and not act on those thoughts and the most insignificant thing can trigger a whole relapse \n\nYou don’t magically recover love food and live in happy land",
          "created_utc": 1727232226.0
        }
      ]
    },
    {
      "id": "loycqxw",
      "author": "Coffeegreysky12",
      "body": "Well said",
      "created_utc": 1727314613.0,
      "score": 1,
      "context": [
        {
          "id": "loybqi9",
          "author": "SarcasticSnowflake17",
          "body": "It isn’t about weight but it is at the same time. Idk how to describe it. \n\nLike obviously weight is on my mind a LOT and obsession over weight is part of the diagnosis. But I don’t care about weight for the sake of caring about weight, it’s not about vanity or beauty standards. Anorexia is a fully self-perpetuating cyclical disease that exists in my mind and manifests itself on the surface as being about weight. \n\nBut the actual cause is deeper. For me it’s about wanting control, approval, acceptance, and the high that starving can bring. But it’s also an addiction. There’s a physical and psychological high that it gives me that I can’t seem to stop craving, even 5 years in recovery.",
          "created_utc": 1727314226.0
        }
      ]
    },
    {
      "id": "loprsew",
      "author": "Coffeegreysky12",
      "body": "Well said",
      "created_utc": 1727196427.0,
      "score": 1,
      "context": [
        {
          "id": "lopr8he",
          "author": "strawberryfemme1",
          "body": "I wish people didn't think I hate bigger people. My problems with food and eating have nothing to do with how I view others",
          "created_utc": 1727196255.0
        }
      ]
    },
    {
      "id": "lou2o77",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing your experience. I am sorry you struggle with this",
      "created_utc": 1727261394.0,
      "score": 1,
      "context": [
        {
          "id": "lou2fps",
          "author": "SnooRevelations7103",
          "body": "My anorexia didn't start from a place of trying to be thin or pretty. It started from been so sad and wanting die, so i ran to feel a little closer to death without harming myself. \n\nThen i got so focused on what i perceived as being \"good\" for post work out meals and \"perfecting\" my macros, vitamins and minerals. Then the running distance became too easy so it doubled, then tripled then became 2 triple length runs per day. THEN, after 2 yrs of fighting myself, came the restriction down (not going into specifics), then came the 2 tripled runs before i was \"allowed\" to eat. Then I partially tore my achilles and had to stop running but if i didnt run, i couldnt eat. So I'd walk the same distances (obviously that didnt allow it to heal well) so i had to stop. Then i passed out at work from fasting too long and i put my patients at risk. \nAnd that was always my hardline for when id gotten \"too bad\" was if my BMI hit a certain number, or i couldnt take care of my people and became a burden on my team. My team had been telling me for months that i was looking ill but i kept laughing and telling them i was just really into my running and hadnt quite worked out my calories in vs calories out properly.",
          "created_utc": 1727261263.0
        }
      ]
    },
    {
      "id": "lovovpm",
      "author": "Coffeegreysky12",
      "body": "Exactly, even when you are very aware of the consequences, you can have a difficult time stopping the behaviors. If anorexia had an off switch, people would be able to just stop being anorexic. But it doesn't work that way. I wish more people understood this",
      "created_utc": 1727282701.0,
      "score": 2,
      "context": [
        {
          "id": "lovoi43",
          "author": "AbundantiaTheWitch",
          "body": "Someone very recently said to me “if anorexic people could actually see how bad it makes their bodies look they wouldn’t have an eating disorder”. So probably making more people aware that it’s not just a switch you can turn off even when you know the consequences",
          "created_utc": 1727282585.0
        }
      ]
    },
    {
      "id": "lovpu8d",
      "author": "Coffeegreysky12",
      "body": "Exactly. No one can truly know how it feels to be anorexic, unless they have been through it, themselves",
      "created_utc": 1727282997.0,
      "score": 1,
      "context": [
        {
          "id": "lovplcf",
          "author": "daisycaulfield",
          "body": "That it’s the most complex, highly misunderstood, 100% 24/7 all consuming severe illness that no one could possibly even begin to understand how it feels and what it is like to live with unless you have it/had it yourself.",
          "created_utc": 1727282920.0
        }
      ]
    },
    {
      "id": "lovzgmd",
      "author": "Coffeegreysky12",
      "body": "Well said",
      "created_utc": 1727285958.0,
      "score": 2,
      "context": [
        {
          "id": "lovwmp5",
          "author": "New-Philosopher5624",
          "body": "That because I struggle with my image doesn't mean i think you're fat. “If you're fat then what am i?? a whale” like i do not even think about your weight 😭",
          "created_utc": 1727285087.0
        }
      ]
    },
    {
      "id": "lox4tre",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing. Your struggles are valid and I am sorry you are going through this. Eating disorders affect everyone differently",
      "created_utc": 1727298763.0,
      "score": 1,
      "context": [
        {
          "id": "lox4ktj",
          "author": "tc26981",
          "body": "Well said! I can’t ever explain anorexia even to myself. One thing I struggle with is allowing myself to eat before any tasks I have are done. I wish others could understand that. Another thing for some reason is I am ashamed of eating. I can’t explain that either, if someone else can I am listening.",
          "created_utc": 1727298684.0
        }
      ]
    },
    {
      "id": "lop1h82",
      "author": "MercurialChickadee",
      "body": "Yes, ESPECIALLY the brain fog personality change. I used to feel trapped within my own demeanour, and no one knew. Like being replaced with a copy kinda thing.",
      "created_utc": 1727188099.0,
      "score": 27,
      "context": [
        {
          "id": "loonskb",
          "author": "notitymp",
          "body": "that being malnourished doesn’t mean you’re skin and bones, that you can still die from anorexia at a higher weight, that it can change your personality when you’re afflicted with brain fog, just how it actually works in general",
          "created_utc": 1727183255.0
        },
        {
          "id": "loonwm4",
          "author": "Coffeegreysky12",
          "body": "Well said",
          "created_utc": 1727183297.0
        }
      ]
    },
    {
      "id": "loosgej",
      "author": "LoveThatForYouBebe",
      "body": "Preach! I’m right there with you. I’m so glad you have a team now who seems to get it, that’s a big deal! (Proud of you for continuing to push forward to find care that worked for you!)",
      "created_utc": 1727184987.0,
      "score": 4,
      "context": [
        {
          "id": "loorse0",
          "author": "LoveThatForYouBebe",
          "body": "That “gold standard” treatments (looking at you, CBT) aren’t designed with autistic brains in mind. And a lot of people with AN are autistic, much larger a percentage than the population at-large. It doesn’t mean you’re a failure if it takes a long time to find an approach that works for you.\n\nEdit: stupid typo",
          "created_utc": 1727184743.0
        },
        {
          "id": "loosb09",
          "author": "Coffeegreysky12",
          "body": "This is a great one. I am autistic. Lots of anorexic people have autism and I wish eating disorder programs would offer more accommodations for those of us with anorexia and autism. The eating disorder programs I went to were not designed for those with autism. They didn't understand my sensory sensitivities or my anxiety about change and need for a routine. Luckily, I have a treatment team now that understands how the anorexia and autism affect each other and they don't shame me for my struggles.",
          "created_utc": 1727184930.0
        }
      ]
    },
    {
      "id": "lpqll54",
      "author": "tc26981",
      "body": "How did you do it alone? I have a team and I still can’t figure it out. I don’t even know that I want anorexia gone. I know I should want it gone.",
      "created_utc": 1727742881.0,
      "score": 2,
      "context": [
        {
          "id": "loorse0",
          "author": "LoveThatForYouBebe",
          "body": "That “gold standard” treatments (looking at you, CBT) aren’t designed with autistic brains in mind. And a lot of people with AN are autistic, much larger a percentage than the population at-large. It doesn’t mean you’re a failure if it takes a long time to find an approach that works for you.\n\nEdit: stupid typo",
          "created_utc": 1727184743.0
        },
        {
          "id": "lopu3ry",
          "author": "Quirky_Top_8990",
          "body": "This is exactly why treatment didn’t work for me and I had to recover alone.",
          "created_utc": 1727197141.0
        }
      ]
    },
    {
      "id": "lovex0s",
      "author": "sargisaghost",
      "body": ":00 Do you know where can I find some?? (Edit for typos)",
      "created_utc": 1727279585.0,
      "score": 2,
      "context": [
        {
          "id": "loorse0",
          "author": "LoveThatForYouBebe",
          "body": "That “gold standard” treatments (looking at you, CBT) aren’t designed with autistic brains in mind. And a lot of people with AN are autistic, much larger a percentage than the population at-large. It doesn’t mean you’re a failure if it takes a long time to find an approach that works for you.\n\nEdit: stupid typo",
          "created_utc": 1727184743.0
        },
        {
          "id": "lou463a",
          "author": "milkisterrifying",
          "body": "this a thousand times over, and there have actually been studies on it too!",
          "created_utc": 1727262196.0
        }
      ]
    },
    {
      "id": "loosffs",
      "author": "empty_fruit_6747",
      "body": "Fr, acting like the mental illness with the worst mortality rate is an easy fix like that is so ignorant and dismissive",
      "created_utc": 1727184976.0,
      "score": 6,
      "context": [
        {
          "id": "loorgd1",
          "author": "empty_fruit_6747",
          "body": "It's not a disease about vanity or wanting to be attractive to others. It goes far beyond those sorts of mentality. \n\nAlso the whole ignorant 'just eat a burger' mentality can go to hell",
          "created_utc": 1727184620.0
        },
        {
          "id": "loorvy4",
          "author": "Coffeegreysky12",
          "body": "Exactly. I hate the \"eat a burger\" or \"eat a sandwich\" comments that people make.",
          "created_utc": 1727184778.0
        }
      ]
    },
    {
      "id": "lorze4d",
      "author": "DesignPersonal2619",
      "body": "The fatphobic comments irk me the most. I had a roomate (who was a bigger body type) attack me about “hating fat people” and how “looking like her was my worst fear”. Just because I didn’t want to eat dinner with her. This person had a victim mindset about literally everything so I know not everyone is like this. \nBut I do think most people don’t realize that the people with the disorder are the victims! Victims of a horrible mental illness that we have no control over. :( No one is choosing this.",
      "created_utc": 1727222450.0,
      "score": 7,
      "context": [
        {
          "id": "lopiwkq",
          "author": "Kattorimu",
          "body": "That being anorexic doesn't mean you never eat and people seeing you eat doesn't mean you're doing any better physically or mentally. I can sob my heart out over a bowl of watermelon then 5 hours later have a moment and eat a whole box of pizza. That you have good days and bad days. Having a day or multiple days of full eating doesn't make you no longer anorexic and completely better. \n\nThat being malnourished and dying/experiencing deadly complications can happen at any weight, you don't have to be skin and bones and LOOK on the brink of death to be there. That most people with ana aren't UW but that's all you see or think of.\n\nThat I spend every day agonizing over getting through the day and just hurrying up and passing the time to get away from all the food noise and self hatred. Nothing in life is enjoyable anymore, I'm so miserable. If I had the option to erase ed completely from my brain but in return be in a body double or triple my size but happy and healthy, I would take it in an instant. \n\nThat I don't hate fat people or look down on them in anyway, think that they are ugly or gross. \n\nI honestly look at fat bodies more than skinny ones. I look at the beautiful fat girls with radiating smiles eating a meal and laughing with friends and wearing a cute outfit and those are the kinds of girls I am jealous of. Not the ones that look miserable off a cup of coffee a day or the ones living off one protein bar and hours at the gym every day. I'm jealous of the fat girls powerlifting at the gym fueling themselves looking strong as fuck not the ones who struggle lifting their body weight to get out of bed. I wish I was a man at this point because in terms of weight and food, men are bashed so much less than women. \n\nThat this disorder has turned me into a shell of person and I feel so broken, tired, angry, hungry, alone, ugly, disgusting, repulsive, depressed. All I want to do is to eat or die and I'm so done with life and ready to end it all every day. I am so so tired of living this way and want it to all go away, to wake up from it like some sort of awful nightmare. There's absolutely nothing that I can enjoy anymore because everything revolves around food and burning cals.",
          "created_utc": 1727193629.0
        },
        {
          "id": "loplm14",
          "author": "Coffeegreysky12",
          "body": "Well said. I am sorry you are struggling. Your struggles are valid and I hope you start feeling better.",
          "created_utc": 1727194485.0
        }
      ]
    },
    {
      "id": "loujkzy",
      "author": "Coffeegreysky12",
      "body": "You are welcome. I am glad you found it helpful",
      "created_utc": 1727269064.0,
      "score": 1,
      "context": [
        {
          "id": "lopiwkq",
          "author": "Kattorimu",
          "body": "That being anorexic doesn't mean you never eat and people seeing you eat doesn't mean you're doing any better physically or mentally. I can sob my heart out over a bowl of watermelon then 5 hours later have a moment and eat a whole box of pizza. That you have good days and bad days. Having a day or multiple days of full eating doesn't make you no longer anorexic and completely better. \n\nThat being malnourished and dying/experiencing deadly complications can happen at any weight, you don't have to be skin and bones and LOOK on the brink of death to be there. That most people with ana aren't UW but that's all you see or think of.\n\nThat I spend every day agonizing over getting through the day and just hurrying up and passing the time to get away from all the food noise and self hatred. Nothing in life is enjoyable anymore, I'm so miserable. If I had the option to erase ed completely from my brain but in return be in a body double or triple my size but happy and healthy, I would take it in an instant. \n\nThat I don't hate fat people or look down on them in anyway, think that they are ugly or gross. \n\nI honestly look at fat bodies more than skinny ones. I look at the beautiful fat girls with radiating smiles eating a meal and laughing with friends and wearing a cute outfit and those are the kinds of girls I am jealous of. Not the ones that look miserable off a cup of coffee a day or the ones living off one protein bar and hours at the gym every day. I'm jealous of the fat girls powerlifting at the gym fueling themselves looking strong as fuck not the ones who struggle lifting their body weight to get out of bed. I wish I was a man at this point because in terms of weight and food, men are bashed so much less than women. \n\nThat this disorder has turned me into a shell of person and I feel so broken, tired, angry, hungry, alone, ugly, disgusting, repulsive, depressed. All I want to do is to eat or die and I'm so done with life and ready to end it all every day. I am so so tired of living this way and want it to all go away, to wake up from it like some sort of awful nightmare. There's absolutely nothing that I can enjoy anymore because everything revolves around food and burning cals.",
          "created_utc": 1727193629.0
        },
        {
          "id": "lote42m",
          "author": "garnetandjade",
          "body": "Thank you for writing this. It resonates deeply",
          "created_utc": 1727244990.0
        }
      ]
    },
    {
      "id": "loq4dhr",
      "author": "Coffeegreysky12",
      "body": "So true",
      "created_utc": 1727200309.0,
      "score": 1,
      "context": [
        {
          "id": "loozac7",
          "author": "False_Look_1212",
          "body": "That eating more/getting healthier physically doesn't fix the problem. You may look and be so much physically healthier but be suffering inside 100x more. It fucking hurts to lose the part of my identity I've clung to for years even though I know its just a sickness. \n\nI want to get better but at the same time I want to get worse :')",
          "created_utc": 1727187364.0
        },
        {
          "id": "loq0emz",
          "author": "sad_potat_07",
          "body": "I agree. People think once were weight restored that were better and fully recovered. If anything, I felt even worse mentally. It doesn't mean we're recovered, it's not about weight",
          "created_utc": 1727199093.0
        }
      ]
    },
    {
      "id": "losff3e",
      "author": "Nex_Nova_",
      "body": "Legit gave myself peripheral neuropathy in my legs from severe B12, now have low estrogen and progesterone and booked for a bone density scan tomorrow 🙃",
      "created_utc": 1727228500.0,
      "score": 2,
      "context": [
        {
          "id": "loserc9",
          "author": "Nex_Nova_",
          "body": "The things it actually does to your body and mind slowly (or rapidly).",
          "created_utc": 1727228248.0
        },
        {
          "id": "losf8o5",
          "author": "Coffeegreysky12",
          "body": "Yes, it causes so many complications",
          "created_utc": 1727228431.0
        }
      ]
    },
    {
      "id": "lop30fh",
      "author": "Coffeegreysky12",
      "body": "Yes, the brain fog is so difficult to deal with",
      "created_utc": 1727188603.0,
      "score": 13,
      "context": [
        {
          "id": "loonskb",
          "author": "notitymp",
          "body": "that being malnourished doesn’t mean you’re skin and bones, that you can still die from anorexia at a higher weight, that it can change your personality when you’re afflicted with brain fog, just how it actually works in general",
          "created_utc": 1727183255.0
        },
        {
          "id": "loonwm4",
          "author": "Coffeegreysky12",
          "body": "Well said",
          "created_utc": 1727183297.0
        },
        {
          "id": "lop1h82",
          "author": "MercurialChickadee",
          "body": "Yes, ESPECIALLY the brain fog personality change. I used to feel trapped within my own demeanour, and no one knew. Like being replaced with a copy kinda thing.",
          "created_utc": 1727188099.0
        }
      ]
    },
    {
      "id": "low77dy",
      "author": "notitymp",
      "body": "it makes me feel like i’m on autopilot and just watching my life go by as if i were watching tv tbh, fully makes me go dumb zombie mode",
      "created_utc": 1727288350.0,
      "score": 7,
      "context": [
        {
          "id": "loonskb",
          "author": "notitymp",
          "body": "that being malnourished doesn’t mean you’re skin and bones, that you can still die from anorexia at a higher weight, that it can change your personality when you’re afflicted with brain fog, just how it actually works in general",
          "created_utc": 1727183255.0
        },
        {
          "id": "loonwm4",
          "author": "Coffeegreysky12",
          "body": "Well said",
          "created_utc": 1727183297.0
        },
        {
          "id": "lop1h82",
          "author": "MercurialChickadee",
          "body": "Yes, ESPECIALLY the brain fog personality change. I used to feel trapped within my own demeanour, and no one knew. Like being replaced with a copy kinda thing.",
          "created_utc": 1727188099.0
        }
      ]
    },
    {
      "id": "loosxm6",
      "author": "Coffeegreysky12",
      "body": "Thank you. It took a while to find the right people to help me. For a while, I was without support but I didn't give up and now I am happy that I have found the right people to help me. I hope you have support as well",
      "created_utc": 1727185160.0,
      "score": 3,
      "context": [
        {
          "id": "loorse0",
          "author": "LoveThatForYouBebe",
          "body": "That “gold standard” treatments (looking at you, CBT) aren’t designed with autistic brains in mind. And a lot of people with AN are autistic, much larger a percentage than the population at-large. It doesn’t mean you’re a failure if it takes a long time to find an approach that works for you.\n\nEdit: stupid typo",
          "created_utc": 1727184743.0
        },
        {
          "id": "loosb09",
          "author": "Coffeegreysky12",
          "body": "This is a great one. I am autistic. Lots of anorexic people have autism and I wish eating disorder programs would offer more accommodations for those of us with anorexia and autism. The eating disorder programs I went to were not designed for those with autism. They didn't understand my sensory sensitivities or my anxiety about change and need for a routine. Luckily, I have a treatment team now that understands how the anorexia and autism affect each other and they don't shame me for my struggles.",
          "created_utc": 1727184930.0
        },
        {
          "id": "loosgej",
          "author": "LoveThatForYouBebe",
          "body": "Preach! I’m right there with you. I’m so glad you have a team now who seems to get it, that’s a big deal! (Proud of you for continuing to push forward to find care that worked for you!)",
          "created_utc": 1727184987.0
        }
      ]
    },
    {
      "id": "loxxxlh",
      "author": "milkisterrifying",
      "body": "I just found them by searching on google scholar. Springer Link tended to have the most open access ones if I recall correctly.",
      "created_utc": 1727309084.0,
      "score": 2,
      "context": [
        {
          "id": "loorse0",
          "author": "LoveThatForYouBebe",
          "body": "That “gold standard” treatments (looking at you, CBT) aren’t designed with autistic brains in mind. And a lot of people with AN are autistic, much larger a percentage than the population at-large. It doesn’t mean you’re a failure if it takes a long time to find an approach that works for you.\n\nEdit: stupid typo",
          "created_utc": 1727184743.0
        },
        {
          "id": "lou463a",
          "author": "milkisterrifying",
          "body": "this a thousand times over, and there have actually been studies on it too!",
          "created_utc": 1727262196.0
        },
        {
          "id": "lovex0s",
          "author": "sargisaghost",
          "body": ":00 Do you know where can I find some?? (Edit for typos)",
          "created_utc": 1727279585.0
        }
      ]
    },
    {
      "id": "loot1lp",
      "author": "Coffeegreysky12",
      "body": "So true",
      "created_utc": 1727185199.0,
      "score": 2,
      "context": [
        {
          "id": "loorgd1",
          "author": "empty_fruit_6747",
          "body": "It's not a disease about vanity or wanting to be attractive to others. It goes far beyond those sorts of mentality. \n\nAlso the whole ignorant 'just eat a burger' mentality can go to hell",
          "created_utc": 1727184620.0
        },
        {
          "id": "loorvy4",
          "author": "Coffeegreysky12",
          "body": "Exactly. I hate the \"eat a burger\" or \"eat a sandwich\" comments that people make.",
          "created_utc": 1727184778.0
        },
        {
          "id": "loosffs",
          "author": "empty_fruit_6747",
          "body": "Fr, acting like the mental illness with the worst mortality rate is an easy fix like that is so ignorant and dismissive",
          "created_utc": 1727184976.0
        }
      ]
    },
    {
      "id": "los1muk",
      "author": "Coffeegreysky12",
      "body": "So true. No one chooses this illness",
      "created_utc": 1727223290.0,
      "score": 1,
      "context": [
        {
          "id": "lopiwkq",
          "author": "Kattorimu",
          "body": "That being anorexic doesn't mean you never eat and people seeing you eat doesn't mean you're doing any better physically or mentally. I can sob my heart out over a bowl of watermelon then 5 hours later have a moment and eat a whole box of pizza. That you have good days and bad days. Having a day or multiple days of full eating doesn't make you no longer anorexic and completely better. \n\nThat being malnourished and dying/experiencing deadly complications can happen at any weight, you don't have to be skin and bones and LOOK on the brink of death to be there. That most people with ana aren't UW but that's all you see or think of.\n\nThat I spend every day agonizing over getting through the day and just hurrying up and passing the time to get away from all the food noise and self hatred. Nothing in life is enjoyable anymore, I'm so miserable. If I had the option to erase ed completely from my brain but in return be in a body double or triple my size but happy and healthy, I would take it in an instant. \n\nThat I don't hate fat people or look down on them in anyway, think that they are ugly or gross. \n\nI honestly look at fat bodies more than skinny ones. I look at the beautiful fat girls with radiating smiles eating a meal and laughing with friends and wearing a cute outfit and those are the kinds of girls I am jealous of. Not the ones that look miserable off a cup of coffee a day or the ones living off one protein bar and hours at the gym every day. I'm jealous of the fat girls powerlifting at the gym fueling themselves looking strong as fuck not the ones who struggle lifting their body weight to get out of bed. I wish I was a man at this point because in terms of weight and food, men are bashed so much less than women. \n\nThat this disorder has turned me into a shell of person and I feel so broken, tired, angry, hungry, alone, ugly, disgusting, repulsive, depressed. All I want to do is to eat or die and I'm so done with life and ready to end it all every day. I am so so tired of living this way and want it to all go away, to wake up from it like some sort of awful nightmare. There's absolutely nothing that I can enjoy anymore because everything revolves around food and burning cals.",
          "created_utc": 1727193629.0
        },
        {
          "id": "loplm14",
          "author": "Coffeegreysky12",
          "body": "Well said. I am sorry you are struggling. Your struggles are valid and I hope you start feeling better.",
          "created_utc": 1727194485.0
        },
        {
          "id": "lorze4d",
          "author": "DesignPersonal2619",
          "body": "The fatphobic comments irk me the most. I had a roomate (who was a bigger body type) attack me about “hating fat people” and how “looking like her was my worst fear”. Just because I didn’t want to eat dinner with her. This person had a victim mindset about literally everything so I know not everyone is like this. \nBut I do think most people don’t realize that the people with the disorder are the victims! Victims of a horrible mental illness that we have no control over. :( No one is choosing this.",
          "created_utc": 1727222450.0
        }
      ]
    },
    {
      "id": "losfkb7",
      "author": "Coffeegreysky12",
      "body": "I'm sorry you have complications. I do too",
      "created_utc": 1727228556.0,
      "score": 2,
      "context": [
        {
          "id": "loserc9",
          "author": "Nex_Nova_",
          "body": "The things it actually does to your body and mind slowly (or rapidly).",
          "created_utc": 1727228248.0
        },
        {
          "id": "losf8o5",
          "author": "Coffeegreysky12",
          "body": "Yes, it causes so many complications",
          "created_utc": 1727228431.0
        },
        {
          "id": "losff3e",
          "author": "Nex_Nova_",
          "body": "Legit gave myself peripheral neuropathy in my legs from severe B12, now have low estrogen and progesterone and booked for a bone density scan tomorrow 🙃",
          "created_utc": 1727228500.0
        }
      ]
    },
    {
      "id": "low8xyw",
      "author": "MercurialChickadee",
      "body": "THIS",
      "created_utc": 1727288891.0,
      "score": 2,
      "context": [
        {
          "id": "loonskb",
          "author": "notitymp",
          "body": "that being malnourished doesn’t mean you’re skin and bones, that you can still die from anorexia at a higher weight, that it can change your personality when you’re afflicted with brain fog, just how it actually works in general",
          "created_utc": 1727183255.0
        },
        {
          "id": "loonwm4",
          "author": "Coffeegreysky12",
          "body": "Well said",
          "created_utc": 1727183297.0
        },
        {
          "id": "lop1h82",
          "author": "MercurialChickadee",
          "body": "Yes, ESPECIALLY the brain fog personality change. I used to feel trapped within my own demeanour, and no one knew. Like being replaced with a copy kinda thing.",
          "created_utc": 1727188099.0
        },
        {
          "id": "low77dy",
          "author": "notitymp",
          "body": "it makes me feel like i’m on autopilot and just watching my life go by as if i were watching tv tbh, fully makes me go dumb zombie mode",
          "created_utc": 1727288350.0
        }
      ]
    },
    {
      "id": "lootinb",
      "author": "LoveThatForYouBebe",
      "body": "I actually feel like I could write the comment you wrote, because it took forever, but I’ve finally got a decent support system. Still currently being recommended for a HLOC, but will be able to return to working with my current OP team, which is a huge deal. Thank you, friend.",
      "created_utc": 1727185369.0,
      "score": 3,
      "context": [
        {
          "id": "loorse0",
          "author": "LoveThatForYouBebe",
          "body": "That “gold standard” treatments (looking at you, CBT) aren’t designed with autistic brains in mind. And a lot of people with AN are autistic, much larger a percentage than the population at-large. It doesn’t mean you’re a failure if it takes a long time to find an approach that works for you.\n\nEdit: stupid typo",
          "created_utc": 1727184743.0
        },
        {
          "id": "loosb09",
          "author": "Coffeegreysky12",
          "body": "This is a great one. I am autistic. Lots of anorexic people have autism and I wish eating disorder programs would offer more accommodations for those of us with anorexia and autism. The eating disorder programs I went to were not designed for those with autism. They didn't understand my sensory sensitivities or my anxiety about change and need for a routine. Luckily, I have a treatment team now that understands how the anorexia and autism affect each other and they don't shame me for my struggles.",
          "created_utc": 1727184930.0
        },
        {
          "id": "loosgej",
          "author": "LoveThatForYouBebe",
          "body": "Preach! I’m right there with you. I’m so glad you have a team now who seems to get it, that’s a big deal! (Proud of you for continuing to push forward to find care that worked for you!)",
          "created_utc": 1727184987.0
        },
        {
          "id": "loosxm6",
          "author": "Coffeegreysky12",
          "body": "Thank you. It took a while to find the right people to help me. For a while, I was without support but I didn't give up and now I am happy that I have found the right people to help me. I hope you have support as well",
          "created_utc": 1727185160.0
        }
      ]
    },
    {
      "id": "lou9ubj",
      "author": "FriedLipstick",
      "body": "OP I love how you described this so well in your post. It’s literally suffering from something (often traumatic) and not knowing how to cope. The not-eating mechanism is a catalyst to decreasing health and causing symptoms as described. A way back is so difficult. It’s a mental illness. It’s not as simple as starting to eat again as so many people think.",
      "created_utc": 1727264983.0,
      "score": 3,
      "context": [
        {
          "id": "lopiwkq",
          "author": "Kattorimu",
          "body": "That being anorexic doesn't mean you never eat and people seeing you eat doesn't mean you're doing any better physically or mentally. I can sob my heart out over a bowl of watermelon then 5 hours later have a moment and eat a whole box of pizza. That you have good days and bad days. Having a day or multiple days of full eating doesn't make you no longer anorexic and completely better. \n\nThat being malnourished and dying/experiencing deadly complications can happen at any weight, you don't have to be skin and bones and LOOK on the brink of death to be there. That most people with ana aren't UW but that's all you see or think of.\n\nThat I spend every day agonizing over getting through the day and just hurrying up and passing the time to get away from all the food noise and self hatred. Nothing in life is enjoyable anymore, I'm so miserable. If I had the option to erase ed completely from my brain but in return be in a body double or triple my size but happy and healthy, I would take it in an instant. \n\nThat I don't hate fat people or look down on them in anyway, think that they are ugly or gross. \n\nI honestly look at fat bodies more than skinny ones. I look at the beautiful fat girls with radiating smiles eating a meal and laughing with friends and wearing a cute outfit and those are the kinds of girls I am jealous of. Not the ones that look miserable off a cup of coffee a day or the ones living off one protein bar and hours at the gym every day. I'm jealous of the fat girls powerlifting at the gym fueling themselves looking strong as fuck not the ones who struggle lifting their body weight to get out of bed. I wish I was a man at this point because in terms of weight and food, men are bashed so much less than women. \n\nThat this disorder has turned me into a shell of person and I feel so broken, tired, angry, hungry, alone, ugly, disgusting, repulsive, depressed. All I want to do is to eat or die and I'm so done with life and ready to end it all every day. I am so so tired of living this way and want it to all go away, to wake up from it like some sort of awful nightmare. There's absolutely nothing that I can enjoy anymore because everything revolves around food and burning cals.",
          "created_utc": 1727193629.0
        },
        {
          "id": "loplm14",
          "author": "Coffeegreysky12",
          "body": "Well said. I am sorry you are struggling. Your struggles are valid and I hope you start feeling better.",
          "created_utc": 1727194485.0
        },
        {
          "id": "lorze4d",
          "author": "DesignPersonal2619",
          "body": "The fatphobic comments irk me the most. I had a roomate (who was a bigger body type) attack me about “hating fat people” and how “looking like her was my worst fear”. Just because I didn’t want to eat dinner with her. This person had a victim mindset about literally everything so I know not everyone is like this. \nBut I do think most people don’t realize that the people with the disorder are the victims! Victims of a horrible mental illness that we have no control over. :( No one is choosing this.",
          "created_utc": 1727222450.0
        },
        {
          "id": "los1muk",
          "author": "Coffeegreysky12",
          "body": "So true. No one chooses this illness",
          "created_utc": 1727223290.0
        }
      ]
    },
    {
      "id": "losfpac",
      "author": "Nex_Nova_",
      "body": "My doctor gave me the biggest lecture yesterday and was the first appointment we didn’t laugh once. This shit is hard.",
      "created_utc": 1727228606.0,
      "score": 2,
      "context": [
        {
          "id": "loserc9",
          "author": "Nex_Nova_",
          "body": "The things it actually does to your body and mind slowly (or rapidly).",
          "created_utc": 1727228248.0
        },
        {
          "id": "losf8o5",
          "author": "Coffeegreysky12",
          "body": "Yes, it causes so many complications",
          "created_utc": 1727228431.0
        },
        {
          "id": "losff3e",
          "author": "Nex_Nova_",
          "body": "Legit gave myself peripheral neuropathy in my legs from severe B12, now have low estrogen and progesterone and booked for a bone density scan tomorrow 🙃",
          "created_utc": 1727228500.0
        },
        {
          "id": "losfkb7",
          "author": "Coffeegreysky12",
          "body": "I'm sorry you have complications. I do too",
          "created_utc": 1727228556.0
        }
      ]
    },
    {
      "id": "loottdk",
      "author": "Coffeegreysky12",
      "body": "You are welcome. I am glad you have support and I am glad you found this post helpful",
      "created_utc": 1727185474.0,
      "score": 2,
      "context": [
        {
          "id": "loorse0",
          "author": "LoveThatForYouBebe",
          "body": "That “gold standard” treatments (looking at you, CBT) aren’t designed with autistic brains in mind. And a lot of people with AN are autistic, much larger a percentage than the population at-large. It doesn’t mean you’re a failure if it takes a long time to find an approach that works for you.\n\nEdit: stupid typo",
          "created_utc": 1727184743.0
        },
        {
          "id": "loosb09",
          "author": "Coffeegreysky12",
          "body": "This is a great one. I am autistic. Lots of anorexic people have autism and I wish eating disorder programs would offer more accommodations for those of us with anorexia and autism. The eating disorder programs I went to were not designed for those with autism. They didn't understand my sensory sensitivities or my anxiety about change and need for a routine. Luckily, I have a treatment team now that understands how the anorexia and autism affect each other and they don't shame me for my struggles.",
          "created_utc": 1727184930.0
        },
        {
          "id": "loosgej",
          "author": "LoveThatForYouBebe",
          "body": "Preach! I’m right there with you. I’m so glad you have a team now who seems to get it, that’s a big deal! (Proud of you for continuing to push forward to find care that worked for you!)",
          "created_utc": 1727184987.0
        },
        {
          "id": "loosxm6",
          "author": "Coffeegreysky12",
          "body": "Thank you. It took a while to find the right people to help me. For a while, I was without support but I didn't give up and now I am happy that I have found the right people to help me. I hope you have support as well",
          "created_utc": 1727185160.0
        },
        {
          "id": "lootinb",
          "author": "LoveThatForYouBebe",
          "body": "I actually feel like I could write the comment you wrote, because it took forever, but I’ve finally got a decent support system. Still currently being recommended for a HLOC, but will be able to return to working with my current OP team, which is a huge deal. Thank you, friend.",
          "created_utc": 1727185369.0
        }
      ]
    },
    {
      "id": "louj84l",
      "author": "Coffeegreysky12",
      "body": "Thank you. It's a complex illness",
      "created_utc": 1727268927.0,
      "score": 1,
      "context": [
        {
          "id": "lopiwkq",
          "author": "Kattorimu",
          "body": "That being anorexic doesn't mean you never eat and people seeing you eat doesn't mean you're doing any better physically or mentally. I can sob my heart out over a bowl of watermelon then 5 hours later have a moment and eat a whole box of pizza. That you have good days and bad days. Having a day or multiple days of full eating doesn't make you no longer anorexic and completely better. \n\nThat being malnourished and dying/experiencing deadly complications can happen at any weight, you don't have to be skin and bones and LOOK on the brink of death to be there. That most people with ana aren't UW but that's all you see or think of.\n\nThat I spend every day agonizing over getting through the day and just hurrying up and passing the time to get away from all the food noise and self hatred. Nothing in life is enjoyable anymore, I'm so miserable. If I had the option to erase ed completely from my brain but in return be in a body double or triple my size but happy and healthy, I would take it in an instant. \n\nThat I don't hate fat people or look down on them in anyway, think that they are ugly or gross. \n\nI honestly look at fat bodies more than skinny ones. I look at the beautiful fat girls with radiating smiles eating a meal and laughing with friends and wearing a cute outfit and those are the kinds of girls I am jealous of. Not the ones that look miserable off a cup of coffee a day or the ones living off one protein bar and hours at the gym every day. I'm jealous of the fat girls powerlifting at the gym fueling themselves looking strong as fuck not the ones who struggle lifting their body weight to get out of bed. I wish I was a man at this point because in terms of weight and food, men are bashed so much less than women. \n\nThat this disorder has turned me into a shell of person and I feel so broken, tired, angry, hungry, alone, ugly, disgusting, repulsive, depressed. All I want to do is to eat or die and I'm so done with life and ready to end it all every day. I am so so tired of living this way and want it to all go away, to wake up from it like some sort of awful nightmare. There's absolutely nothing that I can enjoy anymore because everything revolves around food and burning cals.",
          "created_utc": 1727193629.0
        },
        {
          "id": "loplm14",
          "author": "Coffeegreysky12",
          "body": "Well said. I am sorry you are struggling. Your struggles are valid and I hope you start feeling better.",
          "created_utc": 1727194485.0
        },
        {
          "id": "lorze4d",
          "author": "DesignPersonal2619",
          "body": "The fatphobic comments irk me the most. I had a roomate (who was a bigger body type) attack me about “hating fat people” and how “looking like her was my worst fear”. Just because I didn’t want to eat dinner with her. This person had a victim mindset about literally everything so I know not everyone is like this. \nBut I do think most people don’t realize that the people with the disorder are the victims! Victims of a horrible mental illness that we have no control over. :( No one is choosing this.",
          "created_utc": 1727222450.0
        },
        {
          "id": "los1muk",
          "author": "Coffeegreysky12",
          "body": "So true. No one chooses this illness",
          "created_utc": 1727223290.0
        },
        {
          "id": "lou9ubj",
          "author": "FriedLipstick",
          "body": "OP I love how you described this so well in your post. It’s literally suffering from something (often traumatic) and not knowing how to cope. The not-eating mechanism is a catalyst to decreasing health and causing symptoms as described. A way back is so difficult. It’s a mental illness. It’s not as simple as starting to eat again as so many people think.",
          "created_utc": 1727264983.0
        }
      ]
    },
    {
      "id": "losfwsl",
      "author": "Coffeegreysky12",
      "body": "Yes, it's so difficult to deal with. I hope you start feeling better",
      "created_utc": 1727228684.0,
      "score": 2,
      "context": [
        {
          "id": "loserc9",
          "author": "Nex_Nova_",
          "body": "The things it actually does to your body and mind slowly (or rapidly).",
          "created_utc": 1727228248.0
        },
        {
          "id": "losf8o5",
          "author": "Coffeegreysky12",
          "body": "Yes, it causes so many complications",
          "created_utc": 1727228431.0
        },
        {
          "id": "losff3e",
          "author": "Nex_Nova_",
          "body": "Legit gave myself peripheral neuropathy in my legs from severe B12, now have low estrogen and progesterone and booked for a bone density scan tomorrow 🙃",
          "created_utc": 1727228500.0
        },
        {
          "id": "losfkb7",
          "author": "Coffeegreysky12",
          "body": "I'm sorry you have complications. I do too",
          "created_utc": 1727228556.0
        },
        {
          "id": "losfpac",
          "author": "Nex_Nova_",
          "body": "My doctor gave me the biggest lecture yesterday and was the first appointment we didn’t laugh once. This shit is hard.",
          "created_utc": 1727228606.0
        }
      ]
    },
    {
      "id": "losh32h",
      "author": "Nex_Nova_",
      "body": "Thanks. I am just numb these days tbh",
      "created_utc": 1727229131.0,
      "score": 2,
      "context": [
        {
          "id": "loserc9",
          "author": "Nex_Nova_",
          "body": "The things it actually does to your body and mind slowly (or rapidly).",
          "created_utc": 1727228248.0
        },
        {
          "id": "losf8o5",
          "author": "Coffeegreysky12",
          "body": "Yes, it causes so many complications",
          "created_utc": 1727228431.0
        },
        {
          "id": "losff3e",
          "author": "Nex_Nova_",
          "body": "Legit gave myself peripheral neuropathy in my legs from severe B12, now have low estrogen and progesterone and booked for a bone density scan tomorrow 🙃",
          "created_utc": 1727228500.0
        },
        {
          "id": "losfkb7",
          "author": "Coffeegreysky12",
          "body": "I'm sorry you have complications. I do too",
          "created_utc": 1727228556.0
        },
        {
          "id": "losfpac",
          "author": "Nex_Nova_",
          "body": "My doctor gave me the biggest lecture yesterday and was the first appointment we didn’t laugh once. This shit is hard.",
          "created_utc": 1727228606.0
        },
        {
          "id": "losfwsl",
          "author": "Coffeegreysky12",
          "body": "Yes, it's so difficult to deal with. I hope you start feeling better",
          "created_utc": 1727228684.0
        }
      ]
    }
  ]
}