{
  "id": "1fsh25t",
  "subreddit": "AnorexiaNervosa",
  "author": "AndrewK7503",
  "created_utc": 1727650307.0,
  "title": "People do NOTTT know how to talk around anorexics",
  "selftext": "Last night I was chilling and talking with my partner’s family, just shootin’ the shit, eating dinner, and here are some of the comments I heard while just existing:\n\n“There’s no way he’s gonna eat all that, that’s a LOT of food!” (Partner’s mom referring to me eating dinner)\n\n“No way, he’s (insert weight), he looks so much bigger than me.” (Comment from partner’s brother who is taller than me but close in weight)\n\nAND JUST A LOTTA TALK ABOUT CALORIES???\n\nI know not everyone is trained to talk around anorexics or anything, but everyone in the family *knows* I’m disordered as fuck. \n\nThat shit sucks. Anyone else hear any really not-so-great comments from people around you?\n\n\n\n",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1fsh25t/people_do_nottt_know_how_to_talk_around_anorexics/",
  "score": 269,
  "num_comments": 42,
  "comments": [
    {
      "id": "lpkf7my",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1727650308.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpkqzfk",
      "author": "zaddyh0e",
      "body": "That’s actually awful I’m so sorry you have to deal with shit like that. People wonder why we usually prefer to eat alone as well😭😭",
      "created_utc": 1727654830.0,
      "score": 47,
      "context": []
    },
    {
      "id": "lpkytjw",
      "author": "Acedia_spark",
      "body": "My mother has a tendency to do this as well.\n\nI often get \"Honey, I get that you don't want to eat but there's such a thing as too skinny and you're starting to look like a bobblehead. Men don't like that you know!\"\n\nYou think I do this for MEN!? And she wonders why I don't like visiting them around meal times 🙄",
      "created_utc": 1727657929.0,
      "score": 39,
      "context": []
    },
    {
      "id": "lpkh9tf",
      "author": "Nia_KR",
      "body": "I prefer when people don’t filter themselves around me, I don’t want people to just see me as the anorexic you have to walk on eggshells around",
      "created_utc": 1727651070.0,
      "score": 73,
      "context": []
    },
    {
      "id": "lpkt81h",
      "author": "tourguidetorie",
      "body": "Did your partner stick up for you?",
      "created_utc": 1727655723.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lpkpndq",
      "author": "General-Event-3191",
      "body": "Sometimes we have to let others know our boundaries to protect our peace. Commenting on your body or what you’re consuming is none of their damn business.",
      "created_utc": 1727654298.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lpkr4vg",
      "author": "Anxious-Mechanic-249",
      "body": "Its diet culture, I’m so sorry you had to experience that",
      "created_utc": 1727654891.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lpkgxps",
      "author": "alienprincess111",
      "body": "I'm sorry.  Do they know you have an ED?",
      "created_utc": 1727650945.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lplsu8c",
      "author": "Speckled_snowshoe",
      "body": "my dad does this a lot i feel you, constantly talking about calories, portion sizes, how unhealthy things are etc, even when were eating the same thing and hes well aware. he literally ordered the same thing as me at a restaurant then talked with the waitress about how high calorie it was :| \n\ntbh i feel like this type of talk is kinda unwarranted in general even outside an ED? \"if you cant fix it in 5 minutes dont point it out\" + commenting on other peoples food/ amount of food is just rude.",
      "created_utc": 1727671038.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lpmr9gs",
      "author": "iykykennit",
      "body": "honestly that’s why i sent my mum a booklet from Beat UK charity website, it’s a family support booklet explaining everything and how to support, what to talk about, how to conduct meal times and take care of themselves mentally x",
      "created_utc": 1727694023.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lpn15hb",
      "author": "Advanced-Arm-1735",
      "body": "Oh yeah it becomes a case of.. Deal with it people like to talk about their weight and not eating, I guess they don't want to avoid talking about stuff they have in their minds even if it's extremely triggering perhaps they don't understand what's happening in our minds when they talk casually about all of that. Harder still to keep your mouth shut and not get involved when you're actually well versed in all of that! \n\nThe most brazen comment I had was... \"oh look X is pretending to eat again!' I froze.",
      "created_utc": 1727699007.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lplsurb",
      "author": "Katastrophe_404",
      "body": "Sounds to me like this family has their own issues with food. I know my mom refuses to acknowledge her toxic relationship with food but she talks about portions, calories, etc at every mealtime. I grew up with hearing it constantly. I’m almost 40 and she STILL talks constantly about food. It’s a huge reason why I’ve struggled my whole life with eating disorders across the spectrum. There are a lot of people out there with toxic relationships with food and they project it onto others without even realizing it - they clearly don’t see the elephant in the room. They’re blind to the notion of“disordered eating” and are just out there living their lives unaware of their own toxicity. Must be nice to some degree actually.",
      "created_utc": 1727671046.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lpqbf8q",
      "author": "madieish",
      "body": "having my boyfriend actively begging me to gain weight/recover meanwhile he’s letting me know every night that he “hasn’t eaten all day” …some don’t have brain cells when it comes to eating disorders 😀",
      "created_utc": 1727739114.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lpkheby",
      "author": "unacknowledgement",
      "body": "I'm sorry. I get how hard this is because sometimes comments get under my skin too.\n\nHowever remember that others do not have to be trained or extra sensitive around us. This is our issue and we have to figure it out",
      "created_utc": 1727651116.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lplszxk",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1727671127.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpm30i0",
      "author": "Independent_Bag_4909",
      "body": "Diet culture is so ingrained in society, it’s actually sickening.",
      "created_utc": 1727677183.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpmh8ul",
      "author": "flowersaregrowin",
      "body": "They are fucking stupid",
      "created_utc": 1727687350.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpmkxqa",
      "author": "c0tt0n_mOuth",
      "body": "My colleague talks the same way even though I've been sent home due to fainting loool - I can't imagine being that inconsiderate tbh",
      "created_utc": 1727689994.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpnpnni",
      "author": "babyswinub",
      "body": "I hadn’t seen my mother in a while so I went to go visit her when I was at my lowest weight. My mother is very heavy and also a massive bitch. She knew something was going on with me and said while eating “you look like a crackhead. No one likes a bony girl.” I do not visit her often",
      "created_utc": 1727708339.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpnqmch",
      "author": "lifeofduder",
      "body": "I really feel your pain. My mother used to be the \"best skilled\" (still not great but better than the rest of my family) when it came to talking about food and other topics that could trigger anorexic people (like me).\nUnfortunately, she passed away unexpectedly 1 year ago (which obviously didn't help to my problems) and my dad is trying to take over her role. Bless him, he tries but he has 0 emotional intelligence and says al the wrong things to the point that we've had a serious conversation and I told him that I appreciate the effort he's trying to put but it's better if we leave the ed topic off limits in any family gathering ",
      "created_utc": 1727708663.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpo3ebl",
      "author": "AnyManufacturer2048",
      "body": "omg im so sorry, I know it's not everyone, but it's mainly family members that make it worse 😭😭 which shouldn't be normal",
      "created_utc": 1727712864.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpxh2uz",
      "author": "ottxzvy",
      "body": "Being told I don't \"look\" sick. Like hello? What does \"sick\" look like? And they never have an answer when I ask what sick looks like to them",
      "created_utc": 1727843490.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt48sz4",
      "author": "Eh_Alright___",
      "body": "I know I'm late to comment, but my husband is constantly offering me random food he sees and I find it very triggering. I'm aware he is trying to help but the constant bombardment wherever we are makes me want to disappear.",
      "created_utc": 1729567039.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lu2w9hn",
      "author": "Infinite_Equal6550",
      "body": "thats realy insenstive. i dont understand  the need to say that he believes you look bigger, its unneccery, its like ok? you think he looks bigger? so? like why do we need to know that lol. Same, poeple aorund me are insenstive. I dont need u walking on eggshells, but saying i got fat and ugly and fat like multiple times and straight up laughing at me , is ridiclous, ive learned to not care, i dont care, they can say what they want, but dont pretand it isnt disrespectful.  (i went from bmi 11 to bmi 18/17., so fat lol)",
      "created_utc": 1730066247.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4875s4",
      "author": "v4mp_xoxo",
      "body": "this is so real,\nmy parents [esp my mum] know smths up with my relationship with food and weight etc. yet they still make odd comments that js make me become even more disordered.\nlike im js having a single peice of chocolate and my dad says \"oh! werent you trying to lose weight🤣\" like bro..\nor im js weighing myself and my mum walks in and asks \"awh has it gone up again??\" in a mocking voice too, it acc hurts.\nits always those little comments that make me feel like im not sick enough 😓",
      "created_utc": 1753044170.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lplsgsg",
      "author": "aphroditesdaughter_",
      "body": "tbh I would have left. I don't think you're being overly too sensitive, those are just really rude comments",
      "created_utc": 1727670831.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lplhek7",
      "author": "LeastPay0",
      "body": "Next time learn to switch topics or change direction of conversation. I do it all the time...ask them what they think about the next president of the United States or something...go off topic. It works. Or avoid being around them if it bothers you that much.  Or eat elsewhere. You have options.",
      "created_utc": 1727665418.0,
      "score": -2,
      "context": []
    },
    {
      "id": "lpkznju",
      "author": "AndrewK7503",
      "body": "OH MY GOD MY DAD SAID A VERY SIMILAR THING WHEN I FIRST TOLD THEM ABOUT MY ED\n\n“You know, you look way worse anorexic than you do when you’re normal”\n\nAw shucks, thanks dad that makes me feel so awesome 👍",
      "created_utc": 1727658260.0,
      "score": 15,
      "context": [
        {
          "id": "lpkytjw",
          "author": "Acedia_spark",
          "body": "My mother has a tendency to do this as well.\n\nI often get \"Honey, I get that you don't want to eat but there's such a thing as too skinny and you're starting to look like a bobblehead. Men don't like that you know!\"\n\nYou think I do this for MEN!? And she wonders why I don't like visiting them around meal times 🙄",
          "created_utc": 1727657929.0
        }
      ]
    },
    {
      "id": "lpkjdyu",
      "author": "hellosmallfriend",
      "body": "Me neither but honestly if someone was commenting on both my weight and how much I was eating I’d be hella annoyed.",
      "created_utc": 1727651859.0,
      "score": 71,
      "context": [
        {
          "id": "lpkh9tf",
          "author": "Nia_KR",
          "body": "I prefer when people don’t filter themselves around me, I don’t want people to just see me as the anorexic you have to walk on eggshells around",
          "created_utc": 1727651070.0
        }
      ]
    },
    {
      "id": "lplinvg",
      "author": "Comfortable_Job_266",
      "body": "Ya but the 2 comments quoted are just insensitive and not super classy imo. Being aware of how u come off and the things u say isn't walking on eggshells.",
      "created_utc": 1727665971.0,
      "score": 6,
      "context": [
        {
          "id": "lpkh9tf",
          "author": "Nia_KR",
          "body": "I prefer when people don’t filter themselves around me, I don’t want people to just see me as the anorexic you have to walk on eggshells around",
          "created_utc": 1727651070.0
        }
      ]
    },
    {
      "id": "lpktdus",
      "author": "AndrewK7503",
      "body": "Oh yeah they 100% did!!! They’re insanely supportive and know that their family is a *litttleeee bit* insensitive with that sort of thing (they’ve struggled hella, too, so they know how wack their family is with that kinda thing)",
      "created_utc": 1727655786.0,
      "score": 17,
      "context": [
        {
          "id": "lpkt81h",
          "author": "tourguidetorie",
          "body": "Did your partner stick up for you?",
          "created_utc": 1727655723.0
        }
      ]
    },
    {
      "id": "lpkoxdt",
      "author": "AndrewK7503",
      "body": "Yup, they 1000% know 😔",
      "created_utc": 1727654010.0,
      "score": 10,
      "context": [
        {
          "id": "lpkgxps",
          "author": "alienprincess111",
          "body": "I'm sorry.  Do they know you have an ED?",
          "created_utc": 1727650945.0
        }
      ]
    },
    {
      "id": "lps4z8h",
      "author": "madieish",
      "body": "i love and live by the “can they fix it in 5 seconds” rule! it is golden 💛",
      "created_utc": 1727769666.0,
      "score": 1,
      "context": [
        {
          "id": "lplsu8c",
          "author": "Speckled_snowshoe",
          "body": "my dad does this a lot i feel you, constantly talking about calories, portion sizes, how unhealthy things are etc, even when were eating the same thing and hes well aware. he literally ordered the same thing as me at a restaurant then talked with the waitress about how high calorie it was :| \n\ntbh i feel like this type of talk is kinda unwarranted in general even outside an ED? \"if you cant fix it in 5 minutes dont point it out\" + commenting on other peoples food/ amount of food is just rude.",
          "created_utc": 1727671038.0
        }
      ]
    },
    {
      "id": "lpkph2z",
      "author": "AndrewK7503",
      "body": "I 100% AGREE!!! The only thing with this situation, is that they all *knew* about my disorder and then made those comments. Guaranteed they wouldn’t have said anything even close to that if they never knew I was disordered and trying to recover.\n\n***I ALSO DEFINITELY NEED THICKER SKIN THERES NO DOUBT ABOUT THAT***, but in such early stages of recovery my disordered brain is still goin’ fuckin’ wild when I hear stuff like that *about me*, ya know?",
      "created_utc": 1727654228.0,
      "score": 4,
      "context": [
        {
          "id": "lpkheby",
          "author": "unacknowledgement",
          "body": "I'm sorry. I get how hard this is because sometimes comments get under my skin too.\n\nHowever remember that others do not have to be trained or extra sensitive around us. This is our issue and we have to figure it out",
          "created_utc": 1727651116.0
        }
      ]
    },
    {
      "id": "lpltds6",
      "author": "AndrewK7503",
      "body": "OH I TOTALLY UNDERSTAND!!! Those comments don’t bother me at all, it’s just that they were all explicitly talking about my food and my physical body weight all in one interaction, ya know?\n\nThat’s a combo that still stings even *without* a related disorder ):",
      "created_utc": 1727671338.0,
      "score": 1,
      "context": [
        {
          "id": "lplszxk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1727671127.0
        }
      ]
    },
    {
      "id": "lpnptzh",
      "author": "AndrewK7503",
      "body": "That is actually an INSANE comment I’m so sorry dude 🫂",
      "created_utc": 1727708398.0,
      "score": 1,
      "context": [
        {
          "id": "lpnpnni",
          "author": "babyswinub",
          "body": "I hadn’t seen my mother in a while so I went to go visit her when I was at my lowest weight. My mother is very heavy and also a massive bitch. She knew something was going on with me and said while eating “you look like a crackhead. No one likes a bony girl.” I do not visit her often",
          "created_utc": 1727708339.0
        }
      ]
    },
    {
      "id": "lt493pq",
      "author": "AndrewK7503",
      "body": "NAH I TOTALLY GET THAT!!\n\nMy partner is super duper cool about it, but whenever I simply don’t want something, anybody else would give me a “knowing” look like they’ve “caught” me or something.\n\nLike come on, man, I just don’t want *another* serving; I’m trying to recover, not ***BURST*** 😭",
      "created_utc": 1729567161.0,
      "score": 2,
      "context": [
        {
          "id": "lt48sz4",
          "author": "Eh_Alright___",
          "body": "I know I'm late to comment, but my husband is constantly offering me random food he sees and I find it very triggering. I'm aware he is trying to help but the constant bombardment wherever we are makes me want to disappear.",
          "created_utc": 1729567039.0
        }
      ]
    },
    {
      "id": "lqljhr9",
      "author": "Clear_Record7951",
      "body": "Yeah, my sister and mum said that to me, and my dad suggested it in his speech… I know they were just trying to help tho. Still didn’t work, stuck with me, and gave me another reason to restrict more at that time! They know now (atleast my mum does. Although, right now, as I’m in self recovery with her, she does comment on my weight gain in a way that a normal person would be happy about, and there is really nothing wrong with what she says, but me and my still messed up mind end up wanting to go back to old ways, or just end up feeling bad…) not to speak in a certain way, but my dad doesn’t and my sister still does talk in a way that badly affects me, but not everything is about me so I can’t change them for me alone. Plus, I want to learn to be able to stand convos and words like that again. It’s not really working so far, but oh well. Plus, I recovered by eating alone, so now I can eat most fear foods alone without any big bad thought, but I can’t eat anything in front of my family, but I can infront of my friends… weird.",
      "created_utc": 1728211659.0,
      "score": 2,
      "context": [
        {
          "id": "lpkytjw",
          "author": "Acedia_spark",
          "body": "My mother has a tendency to do this as well.\n\nI often get \"Honey, I get that you don't want to eat but there's such a thing as too skinny and you're starting to look like a bobblehead. Men don't like that you know!\"\n\nYou think I do this for MEN!? And she wonders why I don't like visiting them around meal times 🙄",
          "created_utc": 1727657929.0
        },
        {
          "id": "lpkznju",
          "author": "AndrewK7503",
          "body": "OH MY GOD MY DAD SAID A VERY SIMILAR THING WHEN I FIRST TOLD THEM ABOUT MY ED\n\n“You know, you look way worse anorexic than you do when you’re normal”\n\nAw shucks, thanks dad that makes me feel so awesome 👍",
          "created_utc": 1727658260.0
        }
      ]
    },
    {
      "id": "lpkjkz1",
      "author": "Nia_KR",
      "body": "Oh shit I just realized op’s family’s comments were directed towards them, I thought they were referring to other random people not in the room 😭 nvm sorry",
      "created_utc": 1727651929.0,
      "score": 36,
      "context": [
        {
          "id": "lpkh9tf",
          "author": "Nia_KR",
          "body": "I prefer when people don’t filter themselves around me, I don’t want people to just see me as the anorexic you have to walk on eggshells around",
          "created_utc": 1727651070.0
        },
        {
          "id": "lpkjdyu",
          "author": "hellosmallfriend",
          "body": "Me neither but honestly if someone was commenting on both my weight and how much I was eating I’d be hella annoyed.",
          "created_utc": 1727651859.0
        }
      ]
    },
    {
      "id": "lpkp730",
      "author": "alienprincess111",
      "body": "It's unbelievable how insensitive they are in this case! I suggest staying away from them of you can.",
      "created_utc": 1727654116.0,
      "score": 9,
      "context": [
        {
          "id": "lpkgxps",
          "author": "alienprincess111",
          "body": "I'm sorry.  Do they know you have an ED?",
          "created_utc": 1727650945.0
        },
        {
          "id": "lpkoxdt",
          "author": "AndrewK7503",
          "body": "Yup, they 1000% know 😔",
          "created_utc": 1727654010.0
        }
      ]
    },
    {
      "id": "lpkjpbk",
      "author": "hellosmallfriend",
      "body": "I thought you may have missed that tbh!! ❤️ I was like, that’s not eggshells, that’s just hurdling eggs",
      "created_utc": 1727651973.0,
      "score": 25,
      "context": [
        {
          "id": "lpkh9tf",
          "author": "Nia_KR",
          "body": "I prefer when people don’t filter themselves around me, I don’t want people to just see me as the anorexic you have to walk on eggshells around",
          "created_utc": 1727651070.0
        },
        {
          "id": "lpkjdyu",
          "author": "hellosmallfriend",
          "body": "Me neither but honestly if someone was commenting on both my weight and how much I was eating I’d be hella annoyed.",
          "created_utc": 1727651859.0
        },
        {
          "id": "lpkjkz1",
          "author": "Nia_KR",
          "body": "Oh shit I just realized op’s family’s comments were directed towards them, I thought they were referring to other random people not in the room 😭 nvm sorry",
          "created_utc": 1727651929.0
        }
      ]
    },
    {
      "id": "lpkp2q4",
      "author": "AndrewK7503",
      "body": "AY YOU’RE GOOD!!! DEFINITELY AN EASY MISUNDERSTANDING!!!\n\nI wouldn’t have minded at ALL if they were just general comments and not directed *straight to my face* 😭😭😭",
      "created_utc": 1727654069.0,
      "score": 21,
      "context": [
        {
          "id": "lpkh9tf",
          "author": "Nia_KR",
          "body": "I prefer when people don’t filter themselves around me, I don’t want people to just see me as the anorexic you have to walk on eggshells around",
          "created_utc": 1727651070.0
        },
        {
          "id": "lpkjdyu",
          "author": "hellosmallfriend",
          "body": "Me neither but honestly if someone was commenting on both my weight and how much I was eating I’d be hella annoyed.",
          "created_utc": 1727651859.0
        },
        {
          "id": "lpkjkz1",
          "author": "Nia_KR",
          "body": "Oh shit I just realized op’s family’s comments were directed towards them, I thought they were referring to other random people not in the room 😭 nvm sorry",
          "created_utc": 1727651929.0
        }
      ]
    },
    {
      "id": "lpkplhg",
      "author": "AndrewK7503",
      "body": "I live with ‘em, but I prefer to spend time in my room upstairs anyway so we’re chillin! 😎",
      "created_utc": 1727654276.0,
      "score": 6,
      "context": [
        {
          "id": "lpkgxps",
          "author": "alienprincess111",
          "body": "I'm sorry.  Do they know you have an ED?",
          "created_utc": 1727650945.0
        },
        {
          "id": "lpkoxdt",
          "author": "AndrewK7503",
          "body": "Yup, they 1000% know 😔",
          "created_utc": 1727654010.0
        },
        {
          "id": "lpkp730",
          "author": "alienprincess111",
          "body": "It's unbelievable how insensitive they are in this case! I suggest staying away from them of you can.",
          "created_utc": 1727654116.0
        }
      ]
    }
  ]
}