{
  "id": "1fsj4n6",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1727656571.0,
  "title": "GOD I HATE HAVING A PERIOD WHILE HAVING AN EATING DISORDER",
  "selftext": "I HATE HAVING A PERIOD WHILE HAVING AN EATING DISORDER. \n\n  \nI get scared that I feel like I'm accidentally faking. Even though my periods are light/irregular a lot of people don't get them and I feel like I don't have a real eating disorder if that makes sense. Periods also give me cravings and I know I will cry if I eat food. I know its actually good to eat food but in mind it feels bad and scary.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1fsj4n6/god_i_hate_having_a_period_while_having_an_eating/",
  "score": 127,
  "num_comments": 26,
  "comments": [
    {
      "id": "lpkvdu2",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1727656571.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpkw8yz",
      "author": "Anxious-Mechanic-249",
      "body": "I never lost my period it just became irregular, you’re not faking",
      "created_utc": 1727656914.0,
      "score": 52,
      "context": []
    },
    {
      "id": "lpkw2ul",
      "author": "10ginger12",
      "body": "If it makes you feel any better, there’s no such thing as “accidentally faking” \n\nFaking an ED would be a conscious decision that for whatever reason, you want people to think you have one. \n\nBut why would someone fake it for no reason? It wouldn’t make any sense.",
      "created_utc": 1727656847.0,
      "score": 22,
      "context": []
    },
    {
      "id": "lpm7m7l",
      "author": "Emotional_Clock2910",
      "body": "Having an ED has lowkey made me obsessed with my period. I want it to go away so badly. Every time I get my period I think “alright, next time we’re gonna do better” and start restricting even more than before I started. \n\nBut right before I get my period, I can’t control my cravings and I give in. I eat a lot more than I normally do. “You’re having a period, your body needs energy to have one, just eat”. But giving in makes me feel like that’s the reason I got my period again. I shouldn’t give in to those cravings. \n\nIt’s such a back and forth thing for me. But I find myself constantly thinking about my period and how my ED can make it go away. It does feel invalidating every time you start. But this is a mental illness and it’s hard as fuck to work through. Be kind to yourself. You are so valid dude",
      "created_utc": 1727680320.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lpld31d",
      "author": "Nex_Nova_",
      "body": "I lost my period a few months ago and now I am very close to having osteopenia.\n\nIt’s a blessing and a curse at the same time.\n\nMy estrogen and progesterone are post menopause levels and I am irritable and depressed as hell 🙃",
      "created_utc": 1727663620.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lpl0vbj",
      "author": "jazzmagik",
      "body": "Never lost my period, even when severely underweight. I'm not on the pill, either. Technically, I still shouldn't have it based on BMI and BF %. My friend is the same. Everyone is different. It's no longer part of the diagnostic criteria for AN; indeed, hasn't been for a while.",
      "created_utc": 1727658744.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lpm39y6",
      "author": "Quirky_Top_8990",
      "body": "It doesn’t make you invalid. Lots of people don’t lose theirs- I’m a guy so k never had one to lose, that doesn’t mean my ED wasn’t serious.",
      "created_utc": 1727677359.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lpolcnv",
      "author": "tsmiv12",
      "body": "My period stopped when I was 26. Recovered somewhat, and it came back when I was 28. I got pregnant and had my daughter at 30. Breast fed and my period didn’t return for another three years. Was really spotty. By 39, thought I was going through the perimenopause, but no, my son turned up! My period finally disappeared when I was 47, just after my daughter was diagnosed with cancer in her ovary. She is now 5 years in remission, and I am well over the whole thing. Still have lingering ED traits and weakened bones, but survived.",
      "created_utc": 1727718588.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lpm90ky",
      "author": "Kittyquts",
      "body": "I haven’t had a period in 3 months and i’m only 21, I’m devastated and what hurts most is I did it to myself. \nTake care of yourself before it happens to you ❤️‍🩹",
      "created_utc": 1727681319.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpnngyr",
      "author": "GroundbreakingTerm32",
      "body": "I never lost my period. It didn't even get irregular.",
      "created_utc": 1727707612.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpq0ni7",
      "author": "Catboy-666",
      "body": "never lost mine, 10 years of this and lots of that was spent underweight, some people don’t lose their period even if they are about to die. different bodies prioritize different things, likely genetic factors and such, idk. it’s a stupid criteria for anorexia.",
      "created_utc": 1727735206.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpynv7u",
      "author": "molbrae435",
      "body": "guys here’s a reminder that you don’t need to lose your period, lose weight, gain weight, lose hair, pass out, or be on the literal brink of death to have a valid eating disorder. eating disorders don’t discriminate and will harm anyone. you are valid, and don’t have to try to lose anything to prove to anyone you are not well.",
      "created_utc": 1727870116.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lplf42z",
      "author": "None",
      "body": "Yeah it’s so invalidating :(",
      "created_utc": 1727664448.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpqp185",
      "author": "None",
      "body": "Some women never lose their period, even at drastically low weights. I've know two anorexics to manage to get pregnant and carry the baby to full term, whilst being extremely poorly. It doesn't invalidate your illness or mean you're faking.",
      "created_utc": 1727744150.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lq5zk98",
      "author": "IndependenceOdd4655",
      "body": "You’re not faking. I was inpatient for anorexia and I never even lost my period.",
      "created_utc": 1727975590.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpunmm8",
      "author": "Who-caresssss",
      "body": "Can‘t relate but had a friend with ED. She told me to restrict her from eating the chocolate but hours later begged me to say yes and stated calorie facts. I allowed her and she regretted it later. You can do this tho, I believe in you ❤️",
      "created_utc": 1727807227.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lpm2s9g",
      "author": "dayeonist",
      "body": "same🥲 got stuck in forced recovery and gained all the weight back therefore bringing my period back, but now that i’m severely restricting again the iron deficiency is getting to me 😭",
      "created_utc": 1727677033.0,
      "score": -2,
      "context": []
    },
    {
      "id": "lpmhs05",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1727687735.0,
      "score": -2,
      "context": []
    },
    {
      "id": "lpkxwbh",
      "author": "None",
      "body": "I'm glad I'm not the only one",
      "created_utc": 1727657562.0,
      "score": 11,
      "context": [
        {
          "id": "lpkw8yz",
          "author": "Anxious-Mechanic-249",
          "body": "I never lost my period it just became irregular, you’re not faking",
          "created_utc": 1727656914.0
        }
      ]
    },
    {
      "id": "lps7ypc",
      "author": "AbbyLeeMillersWig-",
      "body": "Same, I never lost mine, it just got *mad* irregular and shorter (went from 7 days to 4).",
      "created_utc": 1727771670.0,
      "score": 2,
      "context": [
        {
          "id": "lpkw8yz",
          "author": "Anxious-Mechanic-249",
          "body": "I never lost my period it just became irregular, you’re not faking",
          "created_utc": 1727656914.0
        }
      ]
    },
    {
      "id": "lpkxtna",
      "author": "None",
      "body": "My step mom would tell me I was faking when I asked her for help because ''I didn't have it snice I was a kid''.  For context my mom also has one but Isn't getting help while I'm currently on a waitlist to go to a hospital.",
      "created_utc": 1727657534.0,
      "score": 12,
      "context": [
        {
          "id": "lpkw2ul",
          "author": "10ginger12",
          "body": "If it makes you feel any better, there’s no such thing as “accidentally faking” \n\nFaking an ED would be a conscious decision that for whatever reason, you want people to think you have one. \n\nBut why would someone fake it for no reason? It wouldn’t make any sense.",
          "created_utc": 1727656847.0
        }
      ]
    },
    {
      "id": "lquqhhy",
      "author": "Saint-monkey",
      "body": "When I experienced this my gyno started me on birth control to bring it back. If you’re interested that may be an option for you ♥️",
      "created_utc": 1728341472.0,
      "score": 1,
      "context": [
        {
          "id": "lpm90ky",
          "author": "Kittyquts",
          "body": "I haven’t had a period in 3 months and i’m only 21, I’m devastated and what hurts most is I did it to myself. \nTake care of yourself before it happens to you ❤️‍🩹",
          "created_utc": 1727681319.0
        }
      ]
    },
    {
      "id": "mgixzw3",
      "author": "VanillaSilent2452",
      "body": "Same. I lowkey wish I did",
      "created_utc": 1741362263.0,
      "score": 1,
      "context": [
        {
          "id": "lpnngyr",
          "author": "GroundbreakingTerm32",
          "body": "I never lost my period. It didn't even get irregular.",
          "created_utc": 1727707612.0
        }
      ]
    },
    {
      "id": "lppsc0e",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 1: Do not participate in pro-ed behaviors. \n\nAs doing things like asking for \"ana buddies\" is harmful for members of the r/AnorexiaNervosa community, it is not allowed. Please do not do things like this in the future. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1727732224.0,
      "score": 1,
      "context": [
        {
          "id": "lpmhs05",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1727687735.0
        }
      ]
    },
    {
      "id": "lpky89f",
      "author": "Anxious-Mechanic-249",
      "body": "Me too",
      "created_utc": 1727657694.0,
      "score": 7,
      "context": [
        {
          "id": "lpkw8yz",
          "author": "Anxious-Mechanic-249",
          "body": "I never lost my period it just became irregular, you’re not faking",
          "created_utc": 1727656914.0
        },
        {
          "id": "lpkxwbh",
          "author": "None",
          "body": "I'm glad I'm not the only one",
          "created_utc": 1727657562.0
        }
      ]
    },
    {
      "id": "lplqh8j",
      "author": "LeastPay0",
      "body": "Has she influenced you in any way? This is the first time I've heard parent and child both have an ed. How does it work out in your house? Does everyone Around you and your mom know too or is it like a secret between you two???. How long has she been that way?",
      "created_utc": 1727669761.0,
      "score": 1,
      "context": [
        {
          "id": "lpkw2ul",
          "author": "10ginger12",
          "body": "If it makes you feel any better, there’s no such thing as “accidentally faking” \n\nFaking an ED would be a conscious decision that for whatever reason, you want people to think you have one. \n\nBut why would someone fake it for no reason? It wouldn’t make any sense.",
          "created_utc": 1727656847.0
        },
        {
          "id": "lpkxtna",
          "author": "None",
          "body": "My step mom would tell me I was faking when I asked her for help because ''I didn't have it snice I was a kid''.  For context my mom also has one but Isn't getting help while I'm currently on a waitlist to go to a hospital.",
          "created_utc": 1727657534.0
        }
      ]
    }
  ]
}