{
  "id": "1ftmitb",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1727784643.0,
  "title": "i hate when people tell me they're proud of me for eating",
  "selftext": "like i know they mean it in a good way but then i feel bad about myself cus i clearly wasn't gonna die if i didn't eat ?? ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ftmitb/i_hate_when_people_tell_me_theyre_proud_of_me_for/",
  "score": 143,
  "num_comments": 14,
  "comments": [
    {
      "id": "lpstmbk",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1727784644.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpsygmc",
      "author": "lindybopperette",
      "body": "Saaaaaame. Please, don’t pay attention to me ingesting food, you’re making it *worse*",
      "created_utc": 1727786740.0,
      "score": 52,
      "context": []
    },
    {
      "id": "lpt4br8",
      "author": "mkraft418",
      "body": "I hate it too. It just further reminds me that I struggle doing something everyone else doesn’t struggle with. I always view it as someone mockingly saying, “congratulations on doing something necessary for basic human function.”",
      "created_utc": 1727789049.0,
      "score": 41,
      "context": []
    },
    {
      "id": "lpsw68v",
      "author": "trashcannottt",
      "body": "Same, it just makes me feel bad about myself. It also kinda implies that eating this one thing has a big impact, which it shouldnt be. it's a normal meal or a snack. it shouldnt mean anything, it's normal, please dont make it a big thing.",
      "created_utc": 1727785772.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lpv3efv",
      "author": "None",
      "body": "sameee or when people say \"your doing so well\" idk how the recovery wieiads deal with it. like people say \"your doing so well- you help me so much, im so proud\" does that not make them feel like shit\n\nI cant explain it but my ed doesnt want people to be proud of think im doing well as that basically means your eating well aka your eating more then they expected, and if people said to me I help them I would cry myself to sleep, (only as in from posting a wieiad) as people will say that they help you, only cos the person they are watching eats more then they would let themselves if that even makes sense",
      "created_utc": 1727812107.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lptqlzd",
      "author": "Mobile-Register-9578",
      "body": "Oh same here!! My dad used to say “well done”, until I told him to not say it to me. It felt so patronising, nobody else gets congratulated for eating so don’t do it for me!!",
      "created_utc": 1727796726.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lpy1to5",
      "author": "finnyyy-winnyyy",
      "body": "Oh my god I hate it so much too",
      "created_utc": 1727856473.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lq1etog",
      "author": "Nex_Nova_",
      "body": "It instantly makes me want to yeet my food into the bin",
      "created_utc": 1727903225.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lq2suw1",
      "author": "american-teen",
      "body": "This and I also hate when professionals call it “the” ED. Like, no. It was MY best coping mechanism!",
      "created_utc": 1727922106.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lq3qukl",
      "author": "Skythebluestars",
      "body": "It makes me uncomfortable bc i dont know what to answer.. likee im not gonna say thanks.. bc it doesnt feel good to eat.. i dont feel proud.. it makes everything so awkward...",
      "created_utc": 1727940555.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpt7vjp",
      "author": "wony123",
      "body": "Same it just makes me feel so much worse yk",
      "created_utc": 1727790379.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lpva83d",
      "author": "chantellexoxoxo",
      "body": "omg hate hate it so much i got the ick from a guy i was seeing who kept saying this or “did you eat today? what did you eat today? i feel like you never eat, lol” that i ghosted him. ICKKKK",
      "created_utc": 1727814201.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpvymaq",
      "author": "None",
      "body": "My parents, EVERY time I finish a meal at a restaurant. I instantly feel fatter",
      "created_utc": 1727822231.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdkjpl0",
      "author": "JVisone",
      "body": "That pisses me off because I feel like I've been manipulated.",
      "created_utc": 1739944603.0,
      "score": 1,
      "context": []
    }
  ]
}