{
  "id": "1fy0grz",
  "subreddit": "AnorexiaNervosa",
  "author": "Legitimate_Summer_59",
  "created_utc": 1728279227.0,
  "title": "Being an adult with ED sucks ",
  "selftext": "I feel like I’m the only adult out there with an eating disorder. I first had disordered eating in 6th grade and from 9th-12th grade struggled heavily with Anorexia with a binge purge subtype. I got better around the age of 18 once I moved out and was able to cook my own food and start enjoying it again but in my twenties ( currently 23 now) I’ve begun having relapses every few months or so. \n\nThey last from a few days to a few weeks and then go away gradually but I still feel weird having these relapses as an adult bc I know better at this point I know what I’m doing but I just don’t care. \n\nI feel like everyone who had MH issues when I  was a teenager has recovered now that they are an adult but I feel still stuck with continuing relapses of all my issues I’ve had for years but can’t say anything abt it and can’t seek proper help bc I can’t afford it \n\nCan anyone relate? ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1fy0grz/being_an_adult_with_ed_sucks/",
  "score": 167,
  "num_comments": 39,
  "comments": [
    {
      "id": "lqqityp",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1728279227.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqqnchj",
      "author": "No-Event4806",
      "body": "I developed full blown anorexia as an adult after having on and off disordered eating during my teen years and body dysmorphia, and it’s a special kind of hell. I feel like I can’t get better after being told your metabolism will slow down as you age since I don’t want to gain weight, but I’m also so scared to go “fully in” on starving myself since I can’t not pay bills and such. It’s also so depressing seeing so many people who were sick around the same time as me start to move on and no longer associate with their disordered past. The same goes for people who I knew suffered when I was younger and recovered and are living normal lives when I worry I’ll always have this lingering",
      "created_utc": 1728282001.0,
      "score": 38,
      "context": []
    },
    {
      "id": "lqqjrw7",
      "author": "AndrewK7503",
      "body": "21 here! This is the worst my ED has been for me, even worse than high school, and I 100% understand the feeling.\n\nI thought I curbed this shit in 11th grade, but I guess I didn't ):",
      "created_utc": 1728279788.0,
      "score": 19,
      "context": []
    },
    {
      "id": "lqqmxyl",
      "author": "Suspicious_monkey16",
      "body": "Mine started at 19/20 and I’m 35 now worst I’ve been since early days",
      "created_utc": 1728281742.0,
      "score": 25,
      "context": []
    },
    {
      "id": "lqr31zp",
      "author": "apizzamx",
      "body": "im 25 tomorrow and this is the worst my ED behaviours have ever been (the last 9 months). I had on and off episodes during school and college but this is by far the worst. I also feel strange being an adult struggling but no other disorder has an age limit so why would AN",
      "created_utc": 1728293083.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lqr0j7q",
      "author": "None",
      "body": "I can totally relate to that.\n\nAnd I am so much older than you.\n\nI've just turned 49 and I am struggling with my ED since high school!! \n\nI often ask myself how others got away from it and why I can't manage to beat this anorexia. In the meantime, I have realized for myself that it has probably become a part of me that I have to live with. \nSince then I've dealt with it a little differently, even though it's so hard not to let it win.\nIt's a daily battle.",
      "created_utc": 1728291268.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lqqrija",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1728284735.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lqr7czf",
      "author": "NotAThrowAway28",
      "body": "My ED started at 9. I am 32. I have been in a continuous relapse/weird pseudo recovery/relapse for the past 5 years. \n\nI am exhausted and need off this ride, but i cannot seem to stay in recovery. I cannot seem to get better no matter how hard i try...\n\nIn treatment I have met people in their 60s with either newly developed or lifelong EDs. We are really and truly not alone and it effects all body types, all genders, all ages, all races.",
      "created_utc": 1728296032.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lqqt8g6",
      "author": "universallyround",
      "body": "i developed full blown, debilitating anorexia bp when i was 23. it is so easy comparing to the younger people who suffer but we’re all on our own journey",
      "created_utc": 1728285922.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lqqurb4",
      "author": "FruitSalad_24",
      "body": "I developed Atypical anorexia age 19 which then became Anorexia Nervosa. Still struggling now; I'm 24 years old almost 25 now!",
      "created_utc": 1728287030.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lqrl63a",
      "author": "Imaginary_Meaning",
      "body": "25 here so you are not alone lol",
      "created_utc": 1728303483.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lqrsyht",
      "author": "countyourcalories",
      "body": "37 here, you're not alone.",
      "created_utc": 1728306782.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lqrw22a",
      "author": "NeverEnough2be1",
      "body": "Almost 46 and have been struggling with it since 16. You are not alone. I just hope younger people who are struggling can somehow get out of the hell, and not lose out on what life could be without the ED. I still don’t know that life, but I hate myself every day thinking about where I could be if I had gotten better help in the beginning. Keep taking one step forward each day. My therapist says many small changes become big wins over time.",
      "created_utc": 1728307995.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lqs0n0h",
      "author": "EquivalentEngineer22",
      "body": "23, I’ve had it on and off since I was 17. You’re not alone",
      "created_utc": 1728309685.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lqv51ee",
      "author": "anony0419",
      "body": "felt this so hard. i’m also 23, my ED took full force once i was 18 and in uni. the independence of being an adult and not being forced into treatment has been both a blessing and a curse: feeling very trapped in the ED and not seeing a way out really. also not “looking like i have an ED” so people don’t give a shit",
      "created_utc": 1728346846.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lqrmtwc",
      "author": "p0150n_1vy",
      "body": "35 here… 😞 you aren’t alone!! 🫶🏼",
      "created_utc": 1728304225.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lqrxz29",
      "author": "samsam4short",
      "body": "I’m 31. Was actually considered “recovered” from like 25-29. Relapsed, I’m worse than ever and it’s fucking embarrassing to think I haven’t beaten this shit yet. You’re not alone and honestly at 23 I never even thought I would get to a point of being in recovery. Although for me it was short lived, it was still the happiest time of my life and honestly I liked my body more then, at a higher weight than I do now, at a lower one",
      "created_utc": 1728308720.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lqsg04i",
      "author": "tishafish",
      "body": "I’m 32 and still yo-yoing 🫂 It doesn’t get easier, but you do get stronger.",
      "created_utc": 1728314866.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lqt2wiu",
      "author": "None",
      "body": "i relate, it feels so invalidating. especially the part about it being relapses, so then people see me eat (because i have to, i’m an adult that works a manual labor job i can’t always just not eat) and literally say “see! you couldn’t be anorexic!” like it literally comes in waves and sometimes i just have a better grasp on it bc, once again, i’m an adult.",
      "created_utc": 1728322162.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lqudt19",
      "author": "humancoloringbook923",
      "body": "I acquired an ED in my late 30s. I didn't realize it until it was pretty far gone. You're definitely not the only one.",
      "created_utc": 1728337054.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lquhuzw",
      "author": "BrilliantNew2288",
      "body": "39 here, I look around me and everyone has a normal relationship with food, being an adult with this truly does suck in more ways then one.",
      "created_utc": 1728338412.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lqsttfx",
      "author": "Specialist_Chef_5660",
      "body": "I feel you!! 🫂 I’m 22",
      "created_utc": 1728319307.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqswinr",
      "author": "runchmunch",
      "body": "im the same as you. i remember in sixth grade wishing that i would get anorexia. at that time i had a note in my phone stating how little i was going to eat so that i could get a boy to like me…lol. around grade 5 i stopped bringing a lunch to school and never stopped. then i developed BED, and a few years later restriction has taken over my life. im also 23 now (almost 24) and this disorder can feel very very lonely at times. i also feel so guilty for the stress i put my parents through, knowing that at my age they were buying a house/planning a life together. just know that you are not alone, there are many people suffering with this and they can be 10 years old or 60 years old. wishing you the best 🤍",
      "created_utc": 1728320148.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqsyeze",
      "author": "Busy-Comb-8365",
      "body": "im currently 20, and i’ve developed my ED within the last year and have a very hard time controlling the thoughts. my sister in law is in her thirties and went through an eating disorder when she was younger, but she still gets triggered and urges to relapse (luckily my step brother has helped her in preventing relapses and such). eating disorders are a lifelong battle, and feeling guilty for relapsing is totally normal. however, everyone relapses and gets urges to relapse, this applies to every addiction. you got this! wishing you the absolute best!",
      "created_utc": 1728320749.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqt4pgr",
      "author": "blob2021A",
      "body": "I’m 53. Had issues since I was 4 years old. You aren’t alone.",
      "created_utc": 1728322734.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqtjaza",
      "author": "db_anon8452",
      "body": "I’m 38, I had atypical anorexia (EDNOS at the time) from 13-18, then bulimia 19-28 and then fully recovered. I relapsed recently but realized I have too many responsibilities (work/kids) to ever go back. I need to keep myself functioning.",
      "created_utc": 1728327300.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqu0v35",
      "author": "Ocean_waves726",
      "body": "You aren’t alone. I’m 36 and have been struggling with an ED since I was 12",
      "created_utc": 1728332888.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqua3gm",
      "author": "Wrong-Tell8996",
      "body": "34yo over here.\n\nThere are a lot of teens here that post (which is totally fine, and I'm glad they are seeking a community! We're all here for each other, regardless of age) but it is a bit different in terms of phases of life (work, relationships, bonds with family). What I will say is, it can happen at any age... there are unique difficulties that arise once you get older but there's nothing weird about having an ED when older. Some of the challenges I have had:  \n-Your body really stops losing the ability to handle it, I had weight issues in my early 20s but it's so different now. My hair, my teeth, my skin, my nails are all shit.  \n-Inability to work. I've had more than one notice put up on my apartment door but I sleep two-three times a day and it's very hard for me to perform at a job... actually about to start training tomorrow and am freaking out because IDK if I can do it but really am facing either homelessness or trying  \n-Lost a lot of familial bonds because I was avoiding them bc I didn't want them to notice or suspect\n\nI don't have health insurance myself, and especially being out of work, it is rough. But check out [anad.org](http://anad.org) there are group sessions you can sign up for, multiple times a week, and also get yourself a free mentor (Go to, \"Get Support,\" at the top of the page). BetterHelp also offers therapists who specialize in EDs, it's about $200/mo which isn't feasible for me anymore... but community support is helpful",
      "created_utc": 1728335827.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lquwl3z",
      "author": "annalongleg",
      "body": "I developed my ED near my 20th birthday and I anticipate living with it for a while (though in recovery now). You are certainly not alone.",
      "created_utc": 1728343689.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lquwwk4",
      "author": "Many_Flamingo_5153",
      "body": "i’m 21 and i’m still going through it hard 😔 you aren’t alone by any means 🫂🩷",
      "created_utc": 1728343806.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqvdbv4",
      "author": "fadingaurora9828",
      "body": "So can relate unfortunately I’m 37 and have struggled with AN B/P for the last 20 years.. started out as anorexia at age 11. So much different as an adult",
      "created_utc": 1728349851.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqwco8o",
      "author": "ButterflyHarpGirl",
      "body": "You definitely are not alone!!!",
      "created_utc": 1728365557.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqzl18j",
      "author": "FistsOfFury77",
      "body": "My last inpatient stay was when I was 39. It wasn’t my first time. In college is when it started. I managed to stay out of treatment for 15yrs. I’m 47 now. While I’m not in a danger zone, I still struggle. And I was inpatient with a number of people over the age of 30. Yours not alone.",
      "created_utc": 1728416566.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lr4ytfj",
      "author": "firecracker723x",
      "body": "I'm 36. I've been fighting on and off with this since I was 11. I was hospitalized earlier this year and 99% of the unit was barely 20 if that. Depressing on another level, feels like I'll never be better",
      "created_utc": 1728501587.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqrkohh",
      "author": "Saint-monkey",
      "body": "Happy almost birthday and I hope this is your year ♥️",
      "created_utc": 1728303257.0,
      "score": 5,
      "context": [
        {
          "id": "lqr31zp",
          "author": "apizzamx",
          "body": "im 25 tomorrow and this is the worst my ED behaviours have ever been (the last 9 months). I had on and off episodes during school and college but this is by far the worst. I also feel strange being an adult struggling but no other disorder has an age limit so why would AN",
          "created_utc": 1728293083.0
        }
      ]
    },
    {
      "id": "lqt4rq3",
      "author": "Legitimate_Summer_59",
      "body": "Exactly! Like I need to be able to be functional enough to pay bills and stuff I can’t just slog thru school and bed rot the rest of the day like when I was a teen , tho this relapse the only way I’ll eat besides dinner is if I purge everything else",
      "created_utc": 1728322754.0,
      "score": 2,
      "context": [
        {
          "id": "lqt2wiu",
          "author": "None",
          "body": "i relate, it feels so invalidating. especially the part about it being relapses, so then people see me eat (because i have to, i’m an adult that works a manual labor job i can’t always just not eat) and literally say “see! you couldn’t be anorexic!” like it literally comes in waves and sometimes i just have a better grasp on it bc, once again, i’m an adult.",
          "created_utc": 1728322162.0
        }
      ]
    },
    {
      "id": "lqybqag",
      "author": "apizzamx",
      "body": "thank you ❤️",
      "created_utc": 1728401633.0,
      "score": 2,
      "context": [
        {
          "id": "lqr31zp",
          "author": "apizzamx",
          "body": "im 25 tomorrow and this is the worst my ED behaviours have ever been (the last 9 months). I had on and off episodes during school and college but this is by far the worst. I also feel strange being an adult struggling but no other disorder has an age limit so why would AN",
          "created_utc": 1728293083.0
        },
        {
          "id": "lqrkohh",
          "author": "Saint-monkey",
          "body": "Happy almost birthday and I hope this is your year ♥️",
          "created_utc": 1728303257.0
        }
      ]
    },
    {
      "id": "lqt5lu8",
      "author": "None",
      "body": "i totally get it! i have like 3-4 safe foods that i usually eat for lunch, and if i “allow” myself dinner it is another safe food, or i uncontrollably eat a ton of unhealthy food and “eat” nothing but coffee the next day to get me through work. you’re def not alone. thank you for this post! but also wishing you recovery!",
      "created_utc": 1728323017.0,
      "score": 1,
      "context": [
        {
          "id": "lqt2wiu",
          "author": "None",
          "body": "i relate, it feels so invalidating. especially the part about it being relapses, so then people see me eat (because i have to, i’m an adult that works a manual labor job i can’t always just not eat) and literally say “see! you couldn’t be anorexic!” like it literally comes in waves and sometimes i just have a better grasp on it bc, once again, i’m an adult.",
          "created_utc": 1728322162.0
        },
        {
          "id": "lqt4rq3",
          "author": "Legitimate_Summer_59",
          "body": "Exactly! Like I need to be able to be functional enough to pay bills and stuff I can’t just slog thru school and bed rot the rest of the day like when I was a teen , tho this relapse the only way I’ll eat besides dinner is if I purge everything else",
          "created_utc": 1728322754.0
        }
      ]
    }
  ]
}