{
  "id": "1fztqju",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1728486717.0,
  "title": "Things I wish more people knew about anorexia",
  "selftext": "When your bloodwork comes back normal, it doesn't mean everything is fine and that you aren't sick\n\nYou can't always tell who has an eating disorder, by looking at them. People with atypical anorexia aren't underweight. They are still sick and can experience medical complications. Yes, there are severely underweight anorexic people, who look visibly sick on the outside. There are also people who don't look ill on the outside, but this doesn't mean they aren't suffering. The mental pain you go through with this disorder can't be seen. Both anorexic and atypical anorexic people are suffering. \n\nRecovering can take years. Some people won't make a full recovery. Relapses after treatment are very common\n\nThere are a wide range of medical issues that anorexia can cause. Heart and bone problems are common. Other complications that don't get talked about enough are things like bladder issues, digestive issues, stomach problems, nerve damage. There are a lot more. What happens to each person varies. You won't experience the exact same health issues that another person is experiencing, even if both people are dealing with anorexia\n\nEating more food doesn't automatically mean you are cured. Anorexic people still eat.\n\nSaying \"just eat\" is counterproductive and doesn't make the person get over the illness. Saying \"I'm sorry you are struggling with eating\" is more helpful, than demanding the person eat more. This is a serious mental illness and you can't shame or scold a person out of it. \n\nThere is no \"sick enough.\" If you are experiencing mental and emotional pain, have low self esteem, and start restricting and losing weight to an unhealthy degree, that's the moment you are sick. You have nothing to prove to anyone. If you feel bad about yourself in any way, that's the moment your feelings are valid. You don't have to get worse, so more people will care. Someone cares. \n\nAnorexia isn't about trying to look a certain way or about vanity. It is an all consuming, deadly mental disorder. One with the highest mortality rate of any mental illness. People who have this illness are suffering. They aren't choosing to starve themselves. They have an illness. An illness that takes therapy, support from family and treatment to overcome. Even when you go through treatment for this illness, you can find it very difficult and you can relapse. \n\nNot all treatments for anorexia are helpful. Not all anorexic people want to be treated with inpatient treatment. Some people have chronic anorexia and complex situations. Some people have other disorders or disabilities, alongside anorexia, and typical anorexia treatments won't be helpful for them. This is why you should have treatment tailored to fit your needs. And a treatment team that listens, but doesn't pressure you or try to put you in a box. You won't have the exact needs as another anorexic person. If you have other disorders or disabilities that complicate your efforts at recovering, then your treatment team should make adjustments for you. No one should be given up on or made to go through this alone. Even if you have suffered for years and have a hard time thinking about what your life would be like without this disorder, you deserve support and understanding\n\nIf you are younger and just found out you have anorexia, I hope you have support around you\n\nIf you are older and have dealt with this disorder for years and are considered chronic, I hope you have support around you\n\nYou are not a burden. You are not a failure. You are not too difficult\n\nWe all deserve to be at peace with ourselves. \n\n\n\n",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1fztqju/things_i_wish_more_people_knew_about_anorexia/",
  "score": 141,
  "num_comments": 21,
  "comments": [
    {
      "id": "lr3ofij",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1728486717.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lr4dyin",
      "author": "Mean_Ad_4762",
      "body": "I would add that what is probably even more common than atypical anorexia, are people who were treated against their will or made to gain weight - or people in ‘semi-recovery’ who are physically more well than they are mentally. You can get stuck in that middle ground for a long time, and it’s not easy for people to understand the mental torture of it.",
      "created_utc": 1728494897.0,
      "score": 48,
      "context": []
    },
    {
      "id": "lr3zy3d",
      "author": "Pumpkinwaterfall",
      "body": "Thank you. Genuinely.",
      "created_utc": 1728490436.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lr60mp9",
      "author": "NotAThrowAway28",
      "body": "Need to add that malnutrition can kill at any weight. You can be any weight and your organs can stop working from it. Atypical anorexia can go on for longer and be hidden for longer, and be celebrated; so often times people with atypical anorexia can be much sicker than someone with a DX of anorexia.",
      "created_utc": 1728514167.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lr7b8m1",
      "author": "Asharqi",
      "body": "Some additions:\n\n- Clothes still won't fit. They're the wrong size on everybody, it's just different things that make you miserable in the dressing room. Everyone seems to think we have it easier in a smaller body (and we do, fatphobia is a societal bitch) but that bit is universal. \n\n- It seems like only the privileged can ever really recover. The rest of us get stuck in this middle place or die from it.\n\n- The literal majority of people in treatment centers are LGBTQIA+ and their gender-performance and sexuality directly link into their eating disorder, whether because a starved body appears more gender affirming or because queer spaces have yet to be decolonized.\n\n- Scare tactics don't work to motivate us to recover. We know that when you're in the trenches your hair falls out, you're constantly shivering, your veins bulge out, and every thought feels like you had to pull it through a yard of treacle just to have it. Then when you start to recover to a functional level again, you have a whole host of other issues, be they hormonal, medical, mental, etc. We know! To avoid these, my solution was always just \"well then I just won't ever recover!\" but at some point it was that or die and my loved ones didn't let me be the one to pick which it was gonna be. \n\n- Even your damn feet shrink when you starve and you have to buy new shoes, which is expensive. Might as well light all the cute thing's you've already got on fire. \n\n- That stereotype of a skinny person seeing a fat person in the mirror? Not always true. My elbows are wider than my upper arms: I know I am skinny. But the only finish line the ED is satisfied with is your grave. \n\n-Needing to sleep 12 hours a day is not a choice; it is something your body WILL enforce and it WILL put a crimp in any kind of life you are trying to have. We are not being lazy. We have to do everything on a fraction of the energy resources. \n\n- All the books seem to portray ED cropping up in childhood or early adolescence, which can feel really alienating and disconnecting if you develop one as an adult. ED doesn't care about your age. \n\n- Grocery stores are already bright and crowded and loud and busy, so walking into one with an ED is a recipe for a panic attack. Ever needed exposure therapy to be able to walk past the cereal aisle? Have some empathy. \n\n- Some of us will want to show off the body we have shrank into, others not so much! We lose fat, muscle, bone density, and the will to live but that excess skin is still convinced there should be many more pounds in here and won't shift for love or money. I've got tits like fried eggs nailed to a wall, get that bikini away from me.",
      "created_utc": 1728532645.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lrgt489",
      "author": "sad_potat_07",
      "body": "\nI completely agree with all of these. \nSome I have to add: anorexics STILL EAT. Some eat daily, some of us even have 3 meals a day. Not all anorexics only eat salad and egg whites, some of us survive on \"junk\" food, or even a little bit of everything. \n-If you see someone with an ED eating a normal sized meal, that doesn't mean they're cured or doing any better mentally. -Also, if someone gains weight in recovery (including forced recovery) it doesn't mean they're better. They can still suffer tremendously mentally. \n-And not all females with AN will lose their period. If you still menstruate, you're valid too.",
      "created_utc": 1728678152.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lr7n55u",
      "author": "alienprincess111",
      "body": "Thank you for writing this to educate people.  I have been struggling for more than 26 years.  It's impossible to explain the disorder to people who have not experienced it.",
      "created_utc": 1728539096.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lrcxml0",
      "author": "unitedthursday",
      "body": "Thank you so much, I needed this.",
      "created_utc": 1728616613.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lrhxczs",
      "author": "Nex_Nova_",
      "body": "I am back to normal weight from NG, blood work is fine but I am dying in soooo many other ways.\n\nFinally made the decision to maintain (for a while).",
      "created_utc": 1728693432.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lr4j17s",
      "author": "Coffeegreysky12",
      "body": "Well said. Being treated against your will is so distressing",
      "created_utc": 1728496508.0,
      "score": 23,
      "context": [
        {
          "id": "lr4dyin",
          "author": "Mean_Ad_4762",
          "body": "I would add that what is probably even more common than atypical anorexia, are people who were treated against their will or made to gain weight - or people in ‘semi-recovery’ who are physically more well than they are mentally. You can get stuck in that middle ground for a long time, and it’s not easy for people to understand the mental torture of it.",
          "created_utc": 1728494897.0
        }
      ]
    },
    {
      "id": "lrgtb8l",
      "author": "sad_potat_07",
      "body": "This is what happened to me. After being forced into the hospital and to gain weight, I've been worse mentally and relapsed even harder this time.",
      "created_utc": 1728678217.0,
      "score": 2,
      "context": [
        {
          "id": "lr4dyin",
          "author": "Mean_Ad_4762",
          "body": "I would add that what is probably even more common than atypical anorexia, are people who were treated against their will or made to gain weight - or people in ‘semi-recovery’ who are physically more well than they are mentally. You can get stuck in that middle ground for a long time, and it’s not easy for people to understand the mental torture of it.",
          "created_utc": 1728494897.0
        }
      ]
    },
    {
      "id": "lr41fdf",
      "author": "Coffeegreysky12",
      "body": "You are welcome",
      "created_utc": 1728490912.0,
      "score": 7,
      "context": [
        {
          "id": "lr3zy3d",
          "author": "Pumpkinwaterfall",
          "body": "Thank you. Genuinely.",
          "created_utc": 1728490436.0
        }
      ]
    },
    {
      "id": "lr6193t",
      "author": "NotAThrowAway28",
      "body": "I also would like to add that people of any age or gender can have this disorder too.\n\nSo people who have developed it and are not the stereotypical white cis girl teenager in the movies.. you are valid too. And I am sending you love. \n\nI am sending love to the sterotypical white cis teenagers who have it too. You are suffering just as much.\n\nAge doesn't negate your struggles. It isn't more or less valid.",
      "created_utc": 1728514401.0,
      "score": 10,
      "context": [
        {
          "id": "lr60mp9",
          "author": "NotAThrowAway28",
          "body": "Need to add that malnutrition can kill at any weight. You can be any weight and your organs can stop working from it. Atypical anorexia can go on for longer and be hidden for longer, and be celebrated; so often times people with atypical anorexia can be much sicker than someone with a DX of anorexia.",
          "created_utc": 1728514167.0
        }
      ]
    },
    {
      "id": "lr60xkk",
      "author": "Coffeegreysky12",
      "body": "So true",
      "created_utc": 1728514282.0,
      "score": 5,
      "context": [
        {
          "id": "lr60mp9",
          "author": "NotAThrowAway28",
          "body": "Need to add that malnutrition can kill at any weight. You can be any weight and your organs can stop working from it. Atypical anorexia can go on for longer and be hidden for longer, and be celebrated; so often times people with atypical anorexia can be much sicker than someone with a DX of anorexia.",
          "created_utc": 1728514167.0
        }
      ]
    },
    {
      "id": "lr8m7fn",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing. These are very true",
      "created_utc": 1728561600.0,
      "score": 2,
      "context": [
        {
          "id": "lr7b8m1",
          "author": "Asharqi",
          "body": "Some additions:\n\n- Clothes still won't fit. They're the wrong size on everybody, it's just different things that make you miserable in the dressing room. Everyone seems to think we have it easier in a smaller body (and we do, fatphobia is a societal bitch) but that bit is universal. \n\n- It seems like only the privileged can ever really recover. The rest of us get stuck in this middle place or die from it.\n\n- The literal majority of people in treatment centers are LGBTQIA+ and their gender-performance and sexuality directly link into their eating disorder, whether because a starved body appears more gender affirming or because queer spaces have yet to be decolonized.\n\n- Scare tactics don't work to motivate us to recover. We know that when you're in the trenches your hair falls out, you're constantly shivering, your veins bulge out, and every thought feels like you had to pull it through a yard of treacle just to have it. Then when you start to recover to a functional level again, you have a whole host of other issues, be they hormonal, medical, mental, etc. We know! To avoid these, my solution was always just \"well then I just won't ever recover!\" but at some point it was that or die and my loved ones didn't let me be the one to pick which it was gonna be. \n\n- Even your damn feet shrink when you starve and you have to buy new shoes, which is expensive. Might as well light all the cute thing's you've already got on fire. \n\n- That stereotype of a skinny person seeing a fat person in the mirror? Not always true. My elbows are wider than my upper arms: I know I am skinny. But the only finish line the ED is satisfied with is your grave. \n\n-Needing to sleep 12 hours a day is not a choice; it is something your body WILL enforce and it WILL put a crimp in any kind of life you are trying to have. We are not being lazy. We have to do everything on a fraction of the energy resources. \n\n- All the books seem to portray ED cropping up in childhood or early adolescence, which can feel really alienating and disconnecting if you develop one as an adult. ED doesn't care about your age. \n\n- Grocery stores are already bright and crowded and loud and busy, so walking into one with an ED is a recipe for a panic attack. Ever needed exposure therapy to be able to walk past the cereal aisle? Have some empathy. \n\n- Some of us will want to show off the body we have shrank into, others not so much! We lose fat, muscle, bone density, and the will to live but that excess skin is still convinced there should be many more pounds in here and won't shift for love or money. I've got tits like fried eggs nailed to a wall, get that bikini away from me.",
          "created_utc": 1728532645.0
        }
      ]
    },
    {
      "id": "lrgtyum",
      "author": "Coffeegreysky12",
      "body": "All valid points. Thank you for sharing",
      "created_utc": 1728678438.0,
      "score": 2,
      "context": [
        {
          "id": "lrgt489",
          "author": "sad_potat_07",
          "body": "\nI completely agree with all of these. \nSome I have to add: anorexics STILL EAT. Some eat daily, some of us even have 3 meals a day. Not all anorexics only eat salad and egg whites, some of us survive on \"junk\" food, or even a little bit of everything. \n-If you see someone with an ED eating a normal sized meal, that doesn't mean they're cured or doing any better mentally. -Also, if someone gains weight in recovery (including forced recovery) it doesn't mean they're better. They can still suffer tremendously mentally. \n-And not all females with AN will lose their period. If you still menstruate, you're valid too.",
          "created_utc": 1728678152.0
        }
      ]
    },
    {
      "id": "lxv7lji",
      "author": "Shopalot92",
      "body": "100% truth",
      "created_utc": 1731984758.0,
      "score": 1,
      "context": [
        {
          "id": "lrgt489",
          "author": "sad_potat_07",
          "body": "\nI completely agree with all of these. \nSome I have to add: anorexics STILL EAT. Some eat daily, some of us even have 3 meals a day. Not all anorexics only eat salad and egg whites, some of us survive on \"junk\" food, or even a little bit of everything. \n-If you see someone with an ED eating a normal sized meal, that doesn't mean they're cured or doing any better mentally. -Also, if someone gains weight in recovery (including forced recovery) it doesn't mean they're better. They can still suffer tremendously mentally. \n-And not all females with AN will lose their period. If you still menstruate, you're valid too.",
          "created_utc": 1728678152.0
        }
      ]
    },
    {
      "id": "lr8m9zw",
      "author": "Coffeegreysky12",
      "body": "You are welcome. I am glad this post was helpful to you",
      "created_utc": 1728561634.0,
      "score": 2,
      "context": [
        {
          "id": "lr7n55u",
          "author": "alienprincess111",
          "body": "Thank you for writing this to educate people.  I have been struggling for more than 26 years.  It's impossible to explain the disorder to people who have not experienced it.",
          "created_utc": 1728539096.0
        }
      ]
    },
    {
      "id": "lrcxwy4",
      "author": "Coffeegreysky12",
      "body": "You are welcome",
      "created_utc": 1728616735.0,
      "score": 1,
      "context": [
        {
          "id": "lrcxml0",
          "author": "unitedthursday",
          "body": "Thank you so much, I needed this.",
          "created_utc": 1728616613.0
        }
      ]
    },
    {
      "id": "lrhxsam",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing",
      "created_utc": 1728693605.0,
      "score": 2,
      "context": [
        {
          "id": "lrhxczs",
          "author": "Nex_Nova_",
          "body": "I am back to normal weight from NG, blood work is fine but I am dying in soooo many other ways.\n\nFinally made the decision to maintain (for a while).",
          "created_utc": 1728693432.0
        }
      ]
    },
    {
      "id": "lr6kshl",
      "author": "Coffeegreysky12",
      "body": "Well said",
      "created_utc": 1728521727.0,
      "score": 5,
      "context": [
        {
          "id": "lr60mp9",
          "author": "NotAThrowAway28",
          "body": "Need to add that malnutrition can kill at any weight. You can be any weight and your organs can stop working from it. Atypical anorexia can go on for longer and be hidden for longer, and be celebrated; so often times people with atypical anorexia can be much sicker than someone with a DX of anorexia.",
          "created_utc": 1728514167.0
        },
        {
          "id": "lr6193t",
          "author": "NotAThrowAway28",
          "body": "I also would like to add that people of any age or gender can have this disorder too.\n\nSo people who have developed it and are not the stereotypical white cis girl teenager in the movies.. you are valid too. And I am sending you love. \n\nI am sending love to the sterotypical white cis teenagers who have it too. You are suffering just as much.\n\nAge doesn't negate your struggles. It isn't more or less valid.",
          "created_utc": 1728514401.0
        }
      ]
    }
  ]
}