{
  "id": "1g1l40e",
  "subreddit": "AnorexiaNervosa",
  "author": "Kattorimu",
  "created_utc": 1728683537.0,
  "title": "A very hard but wholesome interaction at the store",
  "selftext": "I have a pretty hard time actually buying food at the grocery store and spend most of my time longingly staring at food. Particularly at sweets like baked goods, cookies, icecream, etc. \n\nWell earlier I was doing just that in the food lion  icecream section. I was slowly pacing the aisle, painfully pondering their wide variety of delicious sounding icecreams, wanting nothing more than to buy every flavor and scarf down in the car but alas, I told myself no - I can't - and went to turn and walk away. \n\n\"Have you ever had this flavor?\" an older man asks me while pointing at the mint chocolate chip Tillamook flavor. He already had 3 different gallon tubs of the same brand in his cart. \n\n\"Huh?\" I deadpanned, not processed what he asked me for a moment until I realized, \"Oh, no. But I do like that brand, and mint chocolate chip. I'm sure it's good.\" \n\n\"It's my favorite. If I had nothing but a five this is what I'd get.\" He notes the price tag and proceeds while pulling out his wallet. \"Here look. If I'll have a five in here you should try it.\" \n\nI internally panicked. I can't get icecream. There are too many calories and I'll probably eat the whole tub at once. This cannot be happening to me. I think the world might actually end right here right now. I am going to die.\n\n\"No, no, no, it's fine really - you don't have to!\" \n\nHe wouldn't take no for an answer and handed me the five dollar bill he found from his wallet. \"It's fine really, get yourself something. Even if it's not mint. I don't work here or nothing, I just love this stuff.\" He smiled and walked off without giving me any time to do anything other than sheepishly smile and thank him. \n\nHe wasn't judging me, my appearance, thinking I look grotesque and undeserving of icecream. He was unashamed to have 3 full tubs in his own cart and was only trying to spread some joy. It's moments like this that make me DESPISE my disorder because it takes moments of happiness and can absolutely kill my mood. \n\nThe thought of buying this icecream now feels like an unbearable pressure and I feel so scared. There's a million disordered thoughts going through my head and this extremely kind interaction with a stranger now holds so much potential to ruin my day. \n\nI didn't know what to do and stood there frozen for what felt like an eternity trying to navigate the absolute warzone in my mind. I could feel my heart in my chest and the only thing that brought me back to reality was realized I kept forgetting to breathe and now feel faint.\n\nIt might sit in the freezer till it's bad, I might binge and purge the whole thing. I don't know. But I do know I don't want this disorder to ruin kind moments where all someone wants to do is spread a little happiness, and to share something they enjoy with another person. \n\nSo today I came home with a tub of tillamook campfire peanut butter cup. Maybe next time I'll get mint. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1g1l40e/a_very_hard_but_wholesome_interaction_at_the_store/",
  "score": 156,
  "num_comments": 13,
  "comments": [
    {
      "id": "lrh8jlr",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1728683538.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lrik5ws",
      "author": "fuckedupceiling",
      "body": "If I was you I'd probably be thinking I met god.",
      "created_utc": 1728703341.0,
      "score": 61,
      "context": []
    },
    {
      "id": "lrjnk1g",
      "author": "madieish",
      "body": "could cry reading this. this man was an angel sent to YOU!  🥹",
      "created_utc": 1728728363.0,
      "score": 22,
      "context": []
    },
    {
      "id": "lriu30u",
      "author": "emptyestri",
      "body": "there’s so much i could say about this and for how wholesome it is to be able to read this little moment you shared here and feel for both of you - but i can’t help but say this sounds like a good page in a book ❤️ it’s hauntly relatable and sweet. i wish you luck with your ice cream xx",
      "created_utc": 1728708484.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lrijp6g",
      "author": "None",
      "body": "that's so sweet",
      "created_utc": 1728703118.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lrkms37",
      "author": "Nononoemie",
      "body": "I absolutely agree with others that something or someone somewhere sent him to you ✨💖",
      "created_utc": 1728744627.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lrkwmnw",
      "author": "terrorbagoly",
      "body": "What a beautiful moment between two strangers ❤️ Somebody out there is looking out for you. I hope you learn to be kind to yourself and enjoy some of that ice cream eventually.",
      "created_utc": 1728748022.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lrqs0pw",
      "author": "Sweaty-Payment-7175",
      "body": "I just teared up reading this🥺 I’m so happy that you were able to take that as a positive experience. Best wishes !\nEdit- I’ve been thinking about this post all day, just want to say that I’m so proud of you <3",
      "created_utc": 1728838434.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lrzcmgh",
      "author": "unitedthursday",
      "body": "you aren’t grotesque and you absolutely deserve ice cream because you’re amazing and you’re a brave person.  I don’t really know how to not binge on stuff so I don’t have any advice but I hope you find a way to enjoy your tillamook campfire peanut butter cup to the fullest. And it was definitely a sign. I don’t know what of, but it sounded meaningful. \nyou aren’t anorexia itself, and i believe you can overcome it. don’t let it beat you. you’re better than it. ah i’m prolly not good at commenting stuff like this but yeah i hope your ice cream is yummy and i hope you have a nice day",
      "created_utc": 1728960583.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lrlzm41",
      "author": "Kittyquts",
      "body": "that was definitely a sign ❤️",
      "created_utc": 1728760991.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrimyri",
      "author": "Kattorimu",
      "body": "It definitely feels like a sign of some sort",
      "created_utc": 1728704703.0,
      "score": 24,
      "context": [
        {
          "id": "lrik5ws",
          "author": "fuckedupceiling",
          "body": "If I was you I'd probably be thinking I met god.",
          "created_utc": 1728703341.0
        }
      ]
    },
    {
      "id": "lrzdkow",
      "author": "Kattorimu",
      "body": "You are so very sweet and i wish all the same to you. Whatever part of your journey you're on i wish you all the best. Fuck the ed.",
      "created_utc": 1728960949.0,
      "score": 2,
      "context": [
        {
          "id": "lrzcmgh",
          "author": "unitedthursday",
          "body": "you aren’t grotesque and you absolutely deserve ice cream because you’re amazing and you’re a brave person.  I don’t really know how to not binge on stuff so I don’t have any advice but I hope you find a way to enjoy your tillamook campfire peanut butter cup to the fullest. And it was definitely a sign. I don’t know what of, but it sounded meaningful. \nyou aren’t anorexia itself, and i believe you can overcome it. don’t let it beat you. you’re better than it. ah i’m prolly not good at commenting stuff like this but yeah i hope your ice cream is yummy and i hope you have a nice day",
          "created_utc": 1728960583.0
        }
      ]
    },
    {
      "id": "lrzeopx",
      "author": "unitedthursday",
      "body": "thank you so much and yeah fuck the ed!",
      "created_utc": 1728961397.0,
      "score": 1,
      "context": [
        {
          "id": "lrzcmgh",
          "author": "unitedthursday",
          "body": "you aren’t grotesque and you absolutely deserve ice cream because you’re amazing and you’re a brave person.  I don’t really know how to not binge on stuff so I don’t have any advice but I hope you find a way to enjoy your tillamook campfire peanut butter cup to the fullest. And it was definitely a sign. I don’t know what of, but it sounded meaningful. \nyou aren’t anorexia itself, and i believe you can overcome it. don’t let it beat you. you’re better than it. ah i’m prolly not good at commenting stuff like this but yeah i hope your ice cream is yummy and i hope you have a nice day",
          "created_utc": 1728960583.0
        },
        {
          "id": "lrzdkow",
          "author": "Kattorimu",
          "body": "You are so very sweet and i wish all the same to you. Whatever part of your journey you're on i wish you all the best. Fuck the ed.",
          "created_utc": 1728960949.0
        }
      ]
    }
  ]
}