{
  "id": "1g7afat",
  "subreddit": "AnorexiaNervosa",
  "author": "BalletandBooks14",
  "created_utc": 1729349061.0,
  "title": "Why does weight gain genuinely make me suicidal",
  "selftext": "I want to die because of my weight. That sounds so stupid, it’s just my outward appearance, but I still think that way. It’s all I want. I just want to be fucking skinny and I want to die because I’m not.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1g7afat/why_does_weight_gain_genuinely_make_me_suicidal/",
  "score": 150,
  "num_comments": 17,
  "comments": [
    {
      "id": "lsowo0p",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1729349061.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsoyh2c",
      "author": "unitedthursday",
      "body": "It’s not stupid, I’ve attempted suicide due to binges before",
      "created_utc": 1729349688.0,
      "score": 45,
      "context": []
    },
    {
      "id": "lsrroic",
      "author": "Baring-My-Heart",
      "body": "God this is such a real post. The constant passive suicidal thoughts in my head because of anorexia drive me INSANE",
      "created_utc": 1729385042.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lsp1n2t",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1729350777.0,
      "score": 19,
      "context": []
    },
    {
      "id": "lssna6k",
      "author": "hollypoplove",
      "body": "Have some post recovery weight gain and I feel the same",
      "created_utc": 1729398071.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lsqgk6s",
      "author": "Ennaira88",
      "body": "Same",
      "created_utc": 1729367841.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lss1p3k",
      "author": "rilatooma444",
      "body": "i’m dealing with this so much lately, eating a single cookie makes me want to fucking end it all, it’s so exhausting",
      "created_utc": 1729389008.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lt1tlw1",
      "author": "to_tired_to_clare",
      "body": "I can relate though for me it isn’t about being skinny it’s because I cant bear the change. I am not scared of the end result but I am of the individual weight gains and feeling in my body which I am forced to when I feel full and uncomfortable. Feeling empty helps me to detach from my body and this is why weight gain makes me feel suicidal. Though if I am honest with myself when I am using ED behaviours I still feel suicidal.",
      "created_utc": 1729537090.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lsqwpl1",
      "author": "Little-Weight-7251",
      "body": "Same. My eating disorder is very intertwined with all my other diagnoses. Some times I’ll be losing my shit, but I’m too scared to admit that it’s because I ate too much or I’m looking bloated/fat. \nSo I just say it’s a panic attack.",
      "created_utc": 1729373426.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lsxw7j2",
      "author": "kingjuliensbitch",
      "body": "It’s not stupid, it’s obviously not okay but it can be part of the disorder for some. I’m definitely there quite regularly",
      "created_utc": 1729475345.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ltau6tu",
      "author": "PlanktonKey9623",
      "body": "I feel you. My entire mood depends on what i look like, if its a skinny day i feel great but then i see my reflection in a window or something and my mood is ruined and all i think about is if i gained and how i dont deserve to eat for looking so fat.",
      "created_utc": 1729663025.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lsw0f5r",
      "author": "EssayLeading8265",
      "body": "Tried to make my own post but..\n\n\nHow does everyone deal with relapse I'm 34 and my last flair up was 28 but I'm battling now. What can I do ",
      "created_utc": 1729452176.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsoyirb",
      "author": "unitedthursday",
      "body": "like don’t do that obviously, but your feelings aren’t stupid",
      "created_utc": 1729349704.0,
      "score": 26,
      "context": [
        {
          "id": "lsoyh2c",
          "author": "unitedthursday",
          "body": "It’s not stupid, I’ve attempted suicide due to binges before",
          "created_utc": 1729349688.0
        }
      ]
    },
    {
      "id": "lstidug",
      "author": "universallyround",
      "body": "my worst episodes of sh were if i couldn’t get a binge up, and several attempts were because i hadn’t dropped enough weight. BPD + ED things",
      "created_utc": 1729417584.0,
      "score": 3,
      "context": [
        {
          "id": "lsoyh2c",
          "author": "unitedthursday",
          "body": "It’s not stupid, I’ve attempted suicide due to binges before",
          "created_utc": 1729349688.0
        }
      ]
    },
    {
      "id": "lsqodcs",
      "author": "_-ollie",
      "body": "this is all true and very well said.\n\ni hope your daughter is doing better now.",
      "created_utc": 1729370525.0,
      "score": 4,
      "context": [
        {
          "id": "lsp1n2t",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1729350777.0
        }
      ]
    },
    {
      "id": "lss3gui",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1729389709.0,
      "score": 1,
      "context": [
        {
          "id": "lsp1n2t",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1729350777.0
        }
      ]
    },
    {
      "id": "lsqp1p5",
      "author": "Actual_Atmosphere_93",
      "body": "She takes every day one step at a time, but she is currently doing well.",
      "created_utc": 1729370756.0,
      "score": 6,
      "context": [
        {
          "id": "lsp1n2t",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1729350777.0
        },
        {
          "id": "lsqodcs",
          "author": "_-ollie",
          "body": "this is all true and very well said.\n\ni hope your daughter is doing better now.",
          "created_utc": 1729370525.0
        }
      ]
    }
  ]
}