{
  "id": "1g84vql",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1729447508.0,
  "title": "I got my recovery medallion!",
  "selftext": "I got a recovery medallion with the day I decided to commit to recovery stamped on it. It has the NEDA symbol stamped on it with \"Still I Rise.\" This will remind me that I'm strong and still wake up every day despite what I've gone through. That I'm unstoppable!  It's made of solid silver and I carry it in a pouch with me wherever I go. \n\nI have had a couple bad days since I committed to recovery,  but that doesn't erase any progress. Relapse never erases recovery and I'm going to continue to fight! \n\nI really wanted to share this medallion with this community :) People that know me irl aren't as supportive since they don't understand. I posted my medallion on social media and had people asking what I'm recovering from. That hurt... (I talk about anorexia with people.) But they don't see it as serious. \n\nAnyways,  I really wanted to share this recovery win with you guys ❤️❤️",
  "url": "https://www.reddit.com/gallery/1g84vql",
  "score": 170,
  "num_comments": 10,
  "comments": [
    {
      "id": "lsvl0uw",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1729447508.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsvoi0d",
      "author": "RATMAN000",
      "body": "Wow, congrats! I wish you a lot of luck on your road in recovery. I wish I also had something physical like this to remind me of my road on hard days. Keep it close!🫶🏼",
      "created_utc": 1729448537.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lszj8hs",
      "author": "NatureWeary7686",
      "body": "So proud of you!!!!!!!!!! Congratulations! 💘",
      "created_utc": 1729508108.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lszxwaz",
      "author": "EnidnamaMidisah",
      "body": "Congratulations",
      "created_utc": 1729515078.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt1zxg0",
      "author": "Baring-My-Heart",
      "body": "Congrats on it!!! Wishing you the best <3",
      "created_utc": 1729539035.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ltjo896",
      "author": "AstroVespers",
      "body": "Congratulations!!I'm so proud of you <333\nAlso the quote\"relapes never erases recovery\" resonated so much with me.I needed to hear this quote.Thank you kind stranger for sharing your journy.",
      "created_utc": 1729791339.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m3wgcde",
      "author": "Available-Swan7701",
      "body": "So good to hear. We all have our cross to bear. I've been sober since 1987",
      "created_utc": 1735234131.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lsvp7fh",
      "author": "None",
      "body": "Thank you so much!! I've looked at it every day so far and it really helps :) There are bracelets,  medallions, necklaces and rings available from several Etsy shops :) \n\n*sends hugs* \n\nHow long have you been in your recovery journey ? :3",
      "created_utc": 1729448747.0,
      "score": 3,
      "context": [
        {
          "id": "lsvoi0d",
          "author": "RATMAN000",
          "body": "Wow, congrats! I wish you a lot of luck on your road in recovery. I wish I also had something physical like this to remind me of my road on hard days. Keep it close!🫶🏼",
          "created_utc": 1729448537.0
        }
      ]
    },
    {
      "id": "lt08nof",
      "author": "None",
      "body": "Thank you dear",
      "created_utc": 1729519143.0,
      "score": 1,
      "context": [
        {
          "id": "lszj8hs",
          "author": "NatureWeary7686",
          "body": "So proud of you!!!!!!!!!! Congratulations! 💘",
          "created_utc": 1729508108.0
        }
      ]
    },
    {
      "id": "lszziey",
      "author": "None",
      "body": "Thank you ❤️",
      "created_utc": 1729515725.0,
      "score": 3,
      "context": [
        {
          "id": "lszxwaz",
          "author": "EnidnamaMidisah",
          "body": "Congratulations",
          "created_utc": 1729515078.0
        }
      ]
    }
  ]
}