{
  "id": "1g9c9mh",
  "subreddit": "AnorexiaNervosa",
  "author": "v4mpire_g1rl_09",
  "created_utc": 1729581072.0,
  "title": "I'm tired of \"not looking\" like I have anorexia",
  "selftext": "I know that being anorexic is not about being super skinny. It's about the mindset it's a MENTAL illness. But even though I know all that I still feel the need to \"look\" Anorexic. I'm still at an early stage, It's been at its worse for a few months and I used to be overweight (not talking about how I see myself I literally was more than the average weight that I needed to be) so now with this whole thing getting worse and loosing weight I've been at normal for my age and height weight but I still don't look \"skinny\". And it's really hard having to say \" And yes I know I don't look like it \" Whenever I'm talking to someone about my disorder. Also a lot of people are not very educated on the subject and they think anorexia is only being very very thin so they think I'm faking it. I'm just tired of all these, I want to be able to talk freely about my problem without feeling judged. And I always have this mindset, that of course it's very usual for the disorder , that I need to get worse and then maybe they will care. And now it's my chance to choose because my therapist said that considering it's at an early stage I can get better soon if I try. But do I want to get better? Of course I'll have to say yes because if I say no I feel like there is not going to be a way back then. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1g9c9mh/im_tired_of_not_looking_like_i_have_anorexia/",
  "score": 124,
  "num_comments": 28,
  "comments": [
    {
      "id": "lt4yhvl",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1729581073.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt4zrym",
      "author": "_-ollie",
      "body": "that's the thing about AN, no matter how much weight you'll lose, you'll never \"feel sick enough\".\n\ni am underweight and still don't feel like i look sick enough/ anorexic despite others telling me i do.\n\nthat's what makes this illness so deadly.",
      "created_utc": 1729581942.0,
      "score": 63,
      "context": []
    },
    {
      "id": "lt55r9l",
      "author": "EnvironmentalBag7798",
      "body": "This is too relatable unfortunately",
      "created_utc": 1729586139.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lt9czxz",
      "author": "duckfruits",
      "body": "Part of being anorexic is wanting to look anorexic. It's a hell of a disease man. I'm sorry you're going through this. I really struggled with the validation aspect of it too.",
      "created_utc": 1729641208.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lt8wcef",
      "author": "xbrosia93",
      "body": "“Anorexia consumes a lot of time form ppls potential; one can never develop their talents …”\n\nOMG THIS. Is soo FREAKIN True. OP. Idk how old you are but I wanted an eating disorder when I was 15. It started with a simple want to loose weight bought my first strawberry slim fast with my first paycheck at my first job, eveything went down hill. The following years, I did MULTIPLE FAD DIETS, restriction, THE ABC DIET , consuming my mind and its pro Ana websites, had a journal with cutouts of none thin white girls , like with bones showing, lost my period for 4 months because I only had carrot sticks 5 slices of deli meat and Diet Pepsi. GUrl! I wanted an ED. And now I’m 31; I freakin have an ED! I was actually surprised that they clinical dx me with Ana because I looked normal but this illlness is sooo mental. FIFTEEN Years of controlling my food, body checking , wearing oversized clothes to hide myself, extreme exercise , starving myself, food noise, over analyzing my calories then depression heavy heavy depression. God! Looking back , I’ve wasted soo soo much potential and time! I could have had a different life right now, . \n\nEveryday I always wonder and have that feeling that I’m not living up to my full potential and why and I feel like it’s this eating disorder that’s consuming my mind and thoughts, and that’s all I think about literally every single second of the day and I wish no one to have to deal with this because literally, it’s so hard to recover, because every little thing is trigger “oh your healthy size you’re being healthy” that equates to fat to me and then I start to restrict again. If someone’s not eating around me, my mom says she wants to lose weight that triggers me. \n\nI can’t remember the last time I wasnt consumed with my body and weight and being thin. I wished I had an eating disorder 15 years ago(almost 16) and I got my wish and I still am chasing that goal of being thin and I’m a mom on top of that, thankful to a boy but boys do get EDs too. 🙁",
      "created_utc": 1729635399.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ltav35m",
      "author": "Internal-State-2365",
      "body": "I know how you feel, I started off pretty overweight and now I’m a normal weight but I’ve lost a significant amount of weight over a year. I’m diagnosed with atypical anorexia and I hate it, makes me feel like I’m labelled as a “fat anorexic” or “not proper” cause not many people are educated about it. But studies show that the health risks are very similar in anorexia vs atypical anorexia as well as the fact it’s a mental disorder not physical. I always get thoughts like you about wanting to at least look thin so if I tell people that I have anorexia it doesn’t feel like a joke. So instead I just say I have an eating disorder. But I just can’t bring my self to say I have anorexia cause it feels so wrong? It’s so confusing and as everyone said, we probably won’t ever feel thin enough for anorexia anyway.",
      "created_utc": 1729663573.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lti42cx",
      "author": "Actual_Reception2610",
      "body": "I agree with everything and deeply relate. I Hope you can get better before it gets worst to a point of no return. It will slowly eat you from the inside like a parasite until your entire life circle around the disorder. \n\nThe public(normies) are not educated about EDs, I mean good for them why would they be unless they suffer from it. Even most mental health professionals are not very educated. We hear all sort of triggering comment said by therapists people post here and there. I would say to avoid second hand damage to keep those things to yourself. I’m sure they are trying to help but they will just trigger you more.",
      "created_utc": 1729773441.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ltacr4x",
      "author": "mr-tls",
      "body": "OP, I’m sorry you feel this way 🫶🏼 unfortunately, once you are LW… they mostly still don’t care. And if they do, there’s nothing they can do about it or say about it to change anything for you. Life goes on for you and for other people but you’re the only one left struggling with this in the end and it’s not worth it. I’ve found being lower in weight pushes people away even more bc nobody wants to be made “uncomfortable” by a visibly sick body. Most people want to be with healthy people. The people that don’t understand or willingly accept that you’re struggling NOW don’t need to understand. You’re valid NOW.",
      "created_utc": 1729654264.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lt58o1h",
      "author": "Izumi_cho",
      "body": "it's good that you discovered it before you reached the point of health issues... you still have plenty of time to stabilise before you realise you can get even lighter before more serious health issues pop up",
      "created_utc": 1729588176.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lt5u3gp",
      "author": "None",
      "body": "The essence of your post seems to be this: \n\nYou want other people, who are not medical professionals, to see you as anorexic and acknowledge and care about it. \n\n-So, you seem to want your personality to be associated with anorexia, first and foremost. \n\nWhy? \n\nAm I seeing this correctly? \n\nAnorexia is indeed a deadly disorder; and sorry that you are entrapped in this condition.\n\nHowever, most anorexics hide it and don’t make it their personality. It is not a personality or an identity; it is an illness. And there is nothing romantic or cool about it. \n\nI almost died from it many years ago and I had a dread that anyone in the outside world will see me as one.\nThere is a lot secrecy in it and shame. \n\nWhy would you want to be an anorexic? And more importantly be identified as one? \n\nWhy there is so much care from your side to announce   it to other people since a regular person cannot help or cure this condition? \n\nAnorexia consumes a lot of time from people’s potential; one can never develop their talents, it is a horrid waste of life and time. \nI don’t recommend going that route.",
      "created_utc": 1729599976.0,
      "score": -5,
      "context": []
    },
    {
      "id": "lt8kb6q",
      "author": "Bigmama-k",
      "body": "When I was a teen you had to qualify weight wise or it was a generalized ED or they said Bulimia if you used laxatives but didn’t have a low enough BMI. You can just be who you are flaws and not and just be okay with who you are no matter a number.",
      "created_utc": 1729631463.0,
      "score": -1,
      "context": []
    },
    {
      "id": "lt8kkcc",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1729631541.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lt8un2v",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1729634817.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lt4zvlv",
      "author": "v4mpire_g1rl_09",
      "body": "Fr it's exhausting",
      "created_utc": 1729582012.0,
      "score": 15,
      "context": [
        {
          "id": "lt4zrym",
          "author": "_-ollie",
          "body": "that's the thing about AN, no matter how much weight you'll lose, you'll never \"feel sick enough\".\n\ni am underweight and still don't feel like i look sick enough/ anorexic despite others telling me i do.\n\nthat's what makes this illness so deadly.",
          "created_utc": 1729581942.0
        }
      ]
    },
    {
      "id": "ltiaaer",
      "author": "v4mpire_g1rl_09",
      "body": "Omg I feel you a lot I wish the best for you hope we can all fully recover one day 💓",
      "created_utc": 1729775807.0,
      "score": 2,
      "context": [
        {
          "id": "lt8wcef",
          "author": "xbrosia93",
          "body": "“Anorexia consumes a lot of time form ppls potential; one can never develop their talents …”\n\nOMG THIS. Is soo FREAKIN True. OP. Idk how old you are but I wanted an eating disorder when I was 15. It started with a simple want to loose weight bought my first strawberry slim fast with my first paycheck at my first job, eveything went down hill. The following years, I did MULTIPLE FAD DIETS, restriction, THE ABC DIET , consuming my mind and its pro Ana websites, had a journal with cutouts of none thin white girls , like with bones showing, lost my period for 4 months because I only had carrot sticks 5 slices of deli meat and Diet Pepsi. GUrl! I wanted an ED. And now I’m 31; I freakin have an ED! I was actually surprised that they clinical dx me with Ana because I looked normal but this illlness is sooo mental. FIFTEEN Years of controlling my food, body checking , wearing oversized clothes to hide myself, extreme exercise , starving myself, food noise, over analyzing my calories then depression heavy heavy depression. God! Looking back , I’ve wasted soo soo much potential and time! I could have had a different life right now, . \n\nEveryday I always wonder and have that feeling that I’m not living up to my full potential and why and I feel like it’s this eating disorder that’s consuming my mind and thoughts, and that’s all I think about literally every single second of the day and I wish no one to have to deal with this because literally, it’s so hard to recover, because every little thing is trigger “oh your healthy size you’re being healthy” that equates to fat to me and then I start to restrict again. If someone’s not eating around me, my mom says she wants to lose weight that triggers me. \n\nI can’t remember the last time I wasnt consumed with my body and weight and being thin. I wished I had an eating disorder 15 years ago(almost 16) and I got my wish and I still am chasing that goal of being thin and I’m a mom on top of that, thankful to a boy but boys do get EDs too. 🙁",
          "created_utc": 1729635399.0
        }
      ]
    },
    {
      "id": "lti9qcz",
      "author": "v4mpire_g1rl_09",
      "body": "Literally my exact thoughts hope you recover too 💕",
      "created_utc": 1729775605.0,
      "score": 2,
      "context": [
        {
          "id": "ltav35m",
          "author": "Internal-State-2365",
          "body": "I know how you feel, I started off pretty overweight and now I’m a normal weight but I’ve lost a significant amount of weight over a year. I’m diagnosed with atypical anorexia and I hate it, makes me feel like I’m labelled as a “fat anorexic” or “not proper” cause not many people are educated about it. But studies show that the health risks are very similar in anorexia vs atypical anorexia as well as the fact it’s a mental disorder not physical. I always get thoughts like you about wanting to at least look thin so if I tell people that I have anorexia it doesn’t feel like a joke. So instead I just say I have an eating disorder. But I just can’t bring my self to say I have anorexia cause it feels so wrong? It’s so confusing and as everyone said, we probably won’t ever feel thin enough for anorexia anyway.",
          "created_utc": 1729663573.0
        }
      ]
    },
    {
      "id": "lt5diah",
      "author": "TiredSock_02",
      "body": "You can have health issues at any weight with AN...",
      "created_utc": 1729591454.0,
      "score": 12,
      "context": [
        {
          "id": "lt58o1h",
          "author": "Izumi_cho",
          "body": "it's good that you discovered it before you reached the point of health issues... you still have plenty of time to stabilise before you realise you can get even lighter before more serious health issues pop up",
          "created_utc": 1729588176.0
        }
      ]
    },
    {
      "id": "lt60nxv",
      "author": "_-ollie",
      "body": ">So, you seem to want your personality to be associated with anorexia, first and foremost. \n\nOP does not *want* to make it their personality. they just don't feel like a \"real\" anorexic if nobody else can see their suffering. anorexia nervosa drives us to the brink of dying.",
      "created_utc": 1729602604.0,
      "score": 16,
      "context": [
        {
          "id": "lt5u3gp",
          "author": "None",
          "body": "The essence of your post seems to be this: \n\nYou want other people, who are not medical professionals, to see you as anorexic and acknowledge and care about it. \n\n-So, you seem to want your personality to be associated with anorexia, first and foremost. \n\nWhy? \n\nAm I seeing this correctly? \n\nAnorexia is indeed a deadly disorder; and sorry that you are entrapped in this condition.\n\nHowever, most anorexics hide it and don’t make it their personality. It is not a personality or an identity; it is an illness. And there is nothing romantic or cool about it. \n\nI almost died from it many years ago and I had a dread that anyone in the outside world will see me as one.\nThere is a lot secrecy in it and shame. \n\nWhy would you want to be an anorexic? And more importantly be identified as one? \n\nWhy there is so much care from your side to announce   it to other people since a regular person cannot help or cure this condition? \n\nAnorexia consumes a lot of time from people’s potential; one can never develop their talents, it is a horrid waste of life and time. \nI don’t recommend going that route.",
          "created_utc": 1729599976.0
        }
      ]
    },
    {
      "id": "lt6g1e4",
      "author": "v4mpire_g1rl_09",
      "body": "I'm sorry if you think that I'm romanticizing it or making it my whole personality but it's unfortunately completely wrong. I don't just go up to people and start talking about it. My own mother refused to come to a meeting with my therapist (wich he requested btw because he was concerned about my health) because she said I'm lying and I don't even look anorexic . So yeah it's kind of harsh. Also yes I've been hiding it too for as much as I could but after some point you can't hide it anymore. Also I never wished to have it, I wasn't happy that I have it and of course I didn't \"announce\" It to anyone. But when my family or my really close friends ask me and I tell them what's going on and they don't believe me it's quite sad",
      "created_utc": 1729607968.0,
      "score": 9,
      "context": [
        {
          "id": "lt5u3gp",
          "author": "None",
          "body": "The essence of your post seems to be this: \n\nYou want other people, who are not medical professionals, to see you as anorexic and acknowledge and care about it. \n\n-So, you seem to want your personality to be associated with anorexia, first and foremost. \n\nWhy? \n\nAm I seeing this correctly? \n\nAnorexia is indeed a deadly disorder; and sorry that you are entrapped in this condition.\n\nHowever, most anorexics hide it and don’t make it their personality. It is not a personality or an identity; it is an illness. And there is nothing romantic or cool about it. \n\nI almost died from it many years ago and I had a dread that anyone in the outside world will see me as one.\nThere is a lot secrecy in it and shame. \n\nWhy would you want to be an anorexic? And more importantly be identified as one? \n\nWhy there is so much care from your side to announce   it to other people since a regular person cannot help or cure this condition? \n\nAnorexia consumes a lot of time from people’s potential; one can never develop their talents, it is a horrid waste of life and time. \nI don’t recommend going that route.",
          "created_utc": 1729599976.0
        }
      ]
    },
    {
      "id": "lt9xq9t",
      "author": "Particular-Run2159",
      "body": "That's exactly what I saw in OP post because if not why she is trying to get everybody attention and be  acknowledge about it?",
      "created_utc": 1729648505.0,
      "score": -1,
      "context": [
        {
          "id": "lt5u3gp",
          "author": "None",
          "body": "The essence of your post seems to be this: \n\nYou want other people, who are not medical professionals, to see you as anorexic and acknowledge and care about it. \n\n-So, you seem to want your personality to be associated with anorexia, first and foremost. \n\nWhy? \n\nAm I seeing this correctly? \n\nAnorexia is indeed a deadly disorder; and sorry that you are entrapped in this condition.\n\nHowever, most anorexics hide it and don’t make it their personality. It is not a personality or an identity; it is an illness. And there is nothing romantic or cool about it. \n\nI almost died from it many years ago and I had a dread that anyone in the outside world will see me as one.\nThere is a lot secrecy in it and shame. \n\nWhy would you want to be an anorexic? And more importantly be identified as one? \n\nWhy there is so much care from your side to announce   it to other people since a regular person cannot help or cure this condition? \n\nAnorexia consumes a lot of time from people’s potential; one can never develop their talents, it is a horrid waste of life and time. \nI don’t recommend going that route.",
          "created_utc": 1729599976.0
        }
      ]
    },
    {
      "id": "lt92baq",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 8: Don't give medical advice in any way, shape, or form. \n\nWe cannot diagnose or give critical advice over an online subreddit. Doing this can be harmful for the community of r/AnorexiaNervosa. It will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1729637478.0,
      "score": 1,
      "context": [
        {
          "id": "lt8kkcc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1729631541.0
        }
      ]
    },
    {
      "id": "lt8v1ub",
      "author": "getmeoutthere",
      "body": "Also don’t listen to anyone who says that you don’t have it or question you about it. It’s your diagnosis, your business.",
      "created_utc": 1729634957.0,
      "score": 2,
      "context": [
        {
          "id": "lt8un2v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1729634817.0
        }
      ]
    },
    {
      "id": "lt55huj",
      "author": "_-ollie",
      "body": "it is, you're right. that's why you should try your best to not go down this spiral. you said you're at an \"early stage\"; i urge you to listen to your therapist and fix your relationship with food before it starts to consume you.\n\nyour struggles are valid, no matter how much you weigh, but please seek help before it gets worse. \"early stage\" or not, you deserve help.",
      "created_utc": 1729585957.0,
      "score": 16,
      "context": [
        {
          "id": "lt4zrym",
          "author": "_-ollie",
          "body": "that's the thing about AN, no matter how much weight you'll lose, you'll never \"feel sick enough\".\n\ni am underweight and still don't feel like i look sick enough/ anorexic despite others telling me i do.\n\nthat's what makes this illness so deadly.",
          "created_utc": 1729581942.0
        },
        {
          "id": "lt4zvlv",
          "author": "v4mpire_g1rl_09",
          "body": "Fr it's exhausting",
          "created_utc": 1729582012.0
        }
      ]
    },
    {
      "id": "lt5nzdp",
      "author": "Izumi_cho",
      "body": "yes but generally when you realise it early enough, you can still force yourself to eat a somewhat balanced meal instead of just \n\nonly red meat\n\nwhich I don't really like anymore because of both texture/digestion and nutrition (I inherently don't want to consume fat or protein because muscle and fat gain)",
      "created_utc": 1729597246.0,
      "score": -9,
      "context": [
        {
          "id": "lt58o1h",
          "author": "Izumi_cho",
          "body": "it's good that you discovered it before you reached the point of health issues... you still have plenty of time to stabilise before you realise you can get even lighter before more serious health issues pop up",
          "created_utc": 1729588176.0
        },
        {
          "id": "lt5diah",
          "author": "TiredSock_02",
          "body": "You can have health issues at any weight with AN...",
          "created_utc": 1729591454.0
        }
      ]
    },
    {
      "id": "lt6nelw",
      "author": "None",
      "body": "I see; I am so sorry. \nI obviously should not have written what I wrote. \n\nWhat jumped out to me is your mother. \nMore often than not anorexia is triggered by the disfuncional behavior of parents or relatives. \n\n\nI don’t know how old you are. It might be worth for a moment to look at the people who are raising you and ask yourself whether they are truly connected to you and love you unconditionally. \nIf not, unfortunately there is not much you can do except for finding your own individual goal in life and striving for independence without seeking their validation. \n\nI am talking about this because in my case anorexia was completely gone once I moved away and separated from the person who was raising me while wrecking my childhood and adolescence. \n\nMaybe you have a different situation but having a clear and strong  goal in life based on your dreams and what you truly love independent from parent’s validation could be something to consider. \n\nWishing you to heal soon",
      "created_utc": 1729610303.0,
      "score": 11,
      "context": [
        {
          "id": "lt5u3gp",
          "author": "None",
          "body": "The essence of your post seems to be this: \n\nYou want other people, who are not medical professionals, to see you as anorexic and acknowledge and care about it. \n\n-So, you seem to want your personality to be associated with anorexia, first and foremost. \n\nWhy? \n\nAm I seeing this correctly? \n\nAnorexia is indeed a deadly disorder; and sorry that you are entrapped in this condition.\n\nHowever, most anorexics hide it and don’t make it their personality. It is not a personality or an identity; it is an illness. And there is nothing romantic or cool about it. \n\nI almost died from it many years ago and I had a dread that anyone in the outside world will see me as one.\nThere is a lot secrecy in it and shame. \n\nWhy would you want to be an anorexic? And more importantly be identified as one? \n\nWhy there is so much care from your side to announce   it to other people since a regular person cannot help or cure this condition? \n\nAnorexia consumes a lot of time from people’s potential; one can never develop their talents, it is a horrid waste of life and time. \nI don’t recommend going that route.",
          "created_utc": 1729599976.0
        },
        {
          "id": "lt6g1e4",
          "author": "v4mpire_g1rl_09",
          "body": "I'm sorry if you think that I'm romanticizing it or making it my whole personality but it's unfortunately completely wrong. I don't just go up to people and start talking about it. My own mother refused to come to a meeting with my therapist (wich he requested btw because he was concerned about my health) because she said I'm lying and I don't even look anorexic . So yeah it's kind of harsh. Also yes I've been hiding it too for as much as I could but after some point you can't hide it anymore. Also I never wished to have it, I wasn't happy that I have it and of course I didn't \"announce\" It to anyone. But when my family or my really close friends ask me and I tell them what's going on and they don't believe me it's quite sad",
          "created_utc": 1729607968.0
        }
      ]
    },
    {
      "id": "lt55n9y",
      "author": "v4mpire_g1rl_09",
      "body": "Thank you I wish the best for you too 🙏",
      "created_utc": 1729586063.0,
      "score": 5,
      "context": [
        {
          "id": "lt4zrym",
          "author": "_-ollie",
          "body": "that's the thing about AN, no matter how much weight you'll lose, you'll never \"feel sick enough\".\n\ni am underweight and still don't feel like i look sick enough/ anorexic despite others telling me i do.\n\nthat's what makes this illness so deadly.",
          "created_utc": 1729581942.0
        },
        {
          "id": "lt4zvlv",
          "author": "v4mpire_g1rl_09",
          "body": "Fr it's exhausting",
          "created_utc": 1729582012.0
        },
        {
          "id": "lt55huj",
          "author": "_-ollie",
          "body": "it is, you're right. that's why you should try your best to not go down this spiral. you said you're at an \"early stage\"; i urge you to listen to your therapist and fix your relationship with food before it starts to consume you.\n\nyour struggles are valid, no matter how much you weigh, but please seek help before it gets worse. \"early stage\" or not, you deserve help.",
          "created_utc": 1729585957.0
        }
      ]
    },
    {
      "id": "lt6b34c",
      "author": "None",
      "body": "lol what. you can be anorexic at any weight... just because you're a healthy weight doesn't mean you can just force yourself to eat properly?",
      "created_utc": 1729606329.0,
      "score": 11,
      "context": [
        {
          "id": "lt58o1h",
          "author": "Izumi_cho",
          "body": "it's good that you discovered it before you reached the point of health issues... you still have plenty of time to stabilise before you realise you can get even lighter before more serious health issues pop up",
          "created_utc": 1729588176.0
        },
        {
          "id": "lt5diah",
          "author": "TiredSock_02",
          "body": "You can have health issues at any weight with AN...",
          "created_utc": 1729591454.0
        },
        {
          "id": "lt5nzdp",
          "author": "Izumi_cho",
          "body": "yes but generally when you realise it early enough, you can still force yourself to eat a somewhat balanced meal instead of just \n\nonly red meat\n\nwhich I don't really like anymore because of both texture/digestion and nutrition (I inherently don't want to consume fat or protein because muscle and fat gain)",
          "created_utc": 1729597246.0
        }
      ]
    },
    {
      "id": "lt7od53",
      "author": "mossybuggirl",
      "body": "you may not realize it but your comments are coming off like you have it the worst, youre the best ana, youre the sickest, and are very competitive and comparative which is beyond unhelpful for OP and anyone else reading.",
      "created_utc": 1729621728.0,
      "score": 7,
      "context": [
        {
          "id": "lt58o1h",
          "author": "Izumi_cho",
          "body": "it's good that you discovered it before you reached the point of health issues... you still have plenty of time to stabilise before you realise you can get even lighter before more serious health issues pop up",
          "created_utc": 1729588176.0
        },
        {
          "id": "lt5diah",
          "author": "TiredSock_02",
          "body": "You can have health issues at any weight with AN...",
          "created_utc": 1729591454.0
        },
        {
          "id": "lt5nzdp",
          "author": "Izumi_cho",
          "body": "yes but generally when you realise it early enough, you can still force yourself to eat a somewhat balanced meal instead of just \n\nonly red meat\n\nwhich I don't really like anymore because of both texture/digestion and nutrition (I inherently don't want to consume fat or protein because muscle and fat gain)",
          "created_utc": 1729597246.0
        }
      ]
    },
    {
      "id": "lt6o841",
      "author": "v4mpire_g1rl_09",
      "body": "Thank you for all that you said it's so nice when u have actual conversations with people instead of arguing nonsense 😭 wishing the best for u too",
      "created_utc": 1729610556.0,
      "score": 3,
      "context": [
        {
          "id": "lt5u3gp",
          "author": "None",
          "body": "The essence of your post seems to be this: \n\nYou want other people, who are not medical professionals, to see you as anorexic and acknowledge and care about it. \n\n-So, you seem to want your personality to be associated with anorexia, first and foremost. \n\nWhy? \n\nAm I seeing this correctly? \n\nAnorexia is indeed a deadly disorder; and sorry that you are entrapped in this condition.\n\nHowever, most anorexics hide it and don’t make it their personality. It is not a personality or an identity; it is an illness. And there is nothing romantic or cool about it. \n\nI almost died from it many years ago and I had a dread that anyone in the outside world will see me as one.\nThere is a lot secrecy in it and shame. \n\nWhy would you want to be an anorexic? And more importantly be identified as one? \n\nWhy there is so much care from your side to announce   it to other people since a regular person cannot help or cure this condition? \n\nAnorexia consumes a lot of time from people’s potential; one can never develop their talents, it is a horrid waste of life and time. \nI don’t recommend going that route.",
          "created_utc": 1729599976.0
        },
        {
          "id": "lt6g1e4",
          "author": "v4mpire_g1rl_09",
          "body": "I'm sorry if you think that I'm romanticizing it or making it my whole personality but it's unfortunately completely wrong. I don't just go up to people and start talking about it. My own mother refused to come to a meeting with my therapist (wich he requested btw because he was concerned about my health) because she said I'm lying and I don't even look anorexic . So yeah it's kind of harsh. Also yes I've been hiding it too for as much as I could but after some point you can't hide it anymore. Also I never wished to have it, I wasn't happy that I have it and of course I didn't \"announce\" It to anyone. But when my family or my really close friends ask me and I tell them what's going on and they don't believe me it's quite sad",
          "created_utc": 1729607968.0
        },
        {
          "id": "lt6nelw",
          "author": "None",
          "body": "I see; I am so sorry. \nI obviously should not have written what I wrote. \n\nWhat jumped out to me is your mother. \nMore often than not anorexia is triggered by the disfuncional behavior of parents or relatives. \n\n\nI don’t know how old you are. It might be worth for a moment to look at the people who are raising you and ask yourself whether they are truly connected to you and love you unconditionally. \nIf not, unfortunately there is not much you can do except for finding your own individual goal in life and striving for independence without seeking their validation. \n\nI am talking about this because in my case anorexia was completely gone once I moved away and separated from the person who was raising me while wrecking my childhood and adolescence. \n\nMaybe you have a different situation but having a clear and strong  goal in life based on your dreams and what you truly love independent from parent’s validation could be something to consider. \n\nWishing you to heal soon",
          "created_utc": 1729610303.0
        }
      ]
    },
    {
      "id": "lta3csv",
      "author": "Izumi_cho",
      "body": "??\nit's better when you realise it before you get worse and develop worse habits and health issues due to malnutrition takes a lot of time to recover from, discovering it early gives you more leeway before said health issues show up which I didn't have because asian parents refused to believe my suspicion for 6 months",
      "created_utc": 1729650557.0,
      "score": -3,
      "context": [
        {
          "id": "lt58o1h",
          "author": "Izumi_cho",
          "body": "it's good that you discovered it before you reached the point of health issues... you still have plenty of time to stabilise before you realise you can get even lighter before more serious health issues pop up",
          "created_utc": 1729588176.0
        },
        {
          "id": "lt5diah",
          "author": "TiredSock_02",
          "body": "You can have health issues at any weight with AN...",
          "created_utc": 1729591454.0
        },
        {
          "id": "lt5nzdp",
          "author": "Izumi_cho",
          "body": "yes but generally when you realise it early enough, you can still force yourself to eat a somewhat balanced meal instead of just \n\nonly red meat\n\nwhich I don't really like anymore because of both texture/digestion and nutrition (I inherently don't want to consume fat or protein because muscle and fat gain)",
          "created_utc": 1729597246.0
        },
        {
          "id": "lt7od53",
          "author": "mossybuggirl",
          "body": "you may not realize it but your comments are coming off like you have it the worst, youre the best ana, youre the sickest, and are very competitive and comparative which is beyond unhelpful for OP and anyone else reading.",
          "created_utc": 1729621728.0
        }
      ]
    }
  ]
}