{
  "id": "1gablcz",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1729692875.0,
  "title": "I wish people who do not have anorexia would be more sympathetic to those who suffer from it",
  "selftext": "Anorexia nervosa is a difficult disorder to live with\n\nIt's not easy for others to understand\n\nThere are a lot of misconceptions about it. It's not an illness that can be cured by demanding the person eat more\n\nJust because the person eats more food, doesn't mean the illness in their mind is cured or has gone away\n\nMany people have chronic anorexia and have a hard time fully recovering\n\nAnorexic people still eat\n\nWe don't always eat health food or salads\n\nWe can eat junk food and sweets. We can like the taste of ice cream and chocolate\n\nAnorexia is a mental illness. It's not about the types of food you eat.\n\nAtypical anorexia is a serious disorder. But because people with atypical anorexia are not severely underweight, they don't always get the help they need or the support they need\n\nThere are many severely ill people who do not look severely ill\n\nThere are very underweight anorexic people. The ones who when you first glance at them, you know they have an illness.\n\nBut not everyone is going to look severely emaciated.\n\nSome people with anorexia have never had a feeding tube or stayed in an inpatient facility\n\nYou can still die from anorexia. At any weight, because it causes damage to your body\n\nEven if you stay in an inpatient facility, even if it gets so bad to where you need to use a feeding tube, even if you lose so much weight that you are constantly freezing, and even if people start worrying over you and asking you to eat more\n\nIt will never be enough\n\nThe ed will never be satisfied\n\nAs soon as you reach the number you have in your head, you will change your mind\n\nAnd go even lower\n\nBut no matter how low the number goes, you are never going to be truly happy\n\nAt my worst, I hid my body in oversized sweaters. I would use a heavy blanket or stand near a heater, in summertime, because I couldn't stay warm\n\nI'm not happy about being underweight. I didn't reach a low weight and go \"This has made me feel better.\"\n\nIt didn't make me feel better\n\nBefore anorexia, I was a naturally skinny person. A naturally healthy weight. I had a body that I never felt bad about. I liked myself. I had no problem with the way I looked before anorexia. I would wake up in the morning and fix my hair and put on a nice outfit and go on with my day\n\nI struggled with social anxiety and depression before I was anorexic. People in school were mean to me. I was bullied for being quiet and had a hard time making friends in school\n\nNever once thought about losing weight while growing up though. Not as a child. Not as a teenager. It just wasn't something I focused on.\n\nAll that changed, when I stood on the scale one day. Got intensely focused on the number and decided I wanted it to be lower\n\nIt made me into a different person. But I didn't choose my disorder. No one chooses anorexia. It just happens. My reason was because I was feeling anxious and controlling my weight/food intake relieved some of the anxiety and depression I felt. But only temporarily\n\nI found that losing more weight actually made me more depressed. It made me more obsessive. It made me stop focusing on certain things\n\nAll my time, energy and thoughts were devoted to checking the scale. Seeing the number\n\nYet no matter how low it went, I still felt sad\n\nEven when I almost died from anorexia, I didn't feel happy. Even when I almost got a feeding tube, I didn't feel sick enough. Even when my mom would cry when she would notice how much weight I was losing\n\nEven when I got multiple warnings from doctors that anorexia is serious and I needed treatment, I just wouldn't listen\n\nWe all go through different experiences with this disorder. We all have our reasons for falling into it. We don't choose it. And we aren't happy about it\n\nSome people make a fully recovery. Some do not\n\nSome people will look visibly sick. Even if you look visibly sick, you won't feel good about yourself. The number takes up a lot of your time. Is it the right number?\n\nWhat is the right or correct number? The truth is there is no right or correct or perfect number\n\nI am more than a number. Even when my eating disorder is shouting at me to restrict, lose more weight, to hurt myself more\n\nYou are more than a number and you deserve more than being consumed with thoughts about food, your body and your weight\n\nI wish people who have never suffered from this illness would feel more empathy for those who struggle. If someone with anorexia is having a difficult time completing their meal in inpatient treatment, scolding them or shaming them isn't going to help them\n\nCompassion is what people with anorexia need. Even if you don't understand everything about the disorder, it always helps to be compassionate. We often have a hard time showing ourselves the love and compassion we deserve. And when others around us treat us like our illness is a choice, or like we can simply get over it if we just eat more, it really doesn't help.\n\nAnorexia doesn't have an off switch. You can't just turn it off if you get tired of it\n\nThat's why learning and being understanding about this illness, and being patient with the person suffering, is so important",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1gablcz/i_wish_people_who_do_not_have_anorexia_would_be/",
  "score": 113,
  "num_comments": 13,
  "comments": [
    {
      "id": "ltcf1ix",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1729692875.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ltgfslb",
      "author": "alienprincess111",
      "body": "I think the problem is people don't understand anorexia.  They don't understand that it's a mental disease and an addiction.  They dismiss it, saying why don't you just eat?",
      "created_utc": 1729740135.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ltfdz2f",
      "author": "EnvironmentalBag7798",
      "body": "I hope everyone in here reads this",
      "created_utc": 1729726325.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lte0oab",
      "author": "LeastPay0",
      "body": "I'm surprised the big pharma hasn't come up with a medication to treat such a mental illness. They have for every other mental illness except this one. There's a show I used to watch called supersize vs superskinny. Quite interesting to say the least. It was a show from the UK. A must see for those that can withstand it.",
      "created_utc": 1729710639.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ltgg0t8",
      "author": "Coffeegreysky12",
      "body": "So true. People say \"Just eat\" and think it's that simple or that easy to be solved.",
      "created_utc": 1729740233.0,
      "score": 5,
      "context": [
        {
          "id": "ltgfslb",
          "author": "alienprincess111",
          "body": "I think the problem is people don't understand anorexia.  They don't understand that it's a mental disease and an addiction.  They dismiss it, saying why don't you just eat?",
          "created_utc": 1729740135.0
        }
      ]
    },
    {
      "id": "ltqz45j",
      "author": "lrina_",
      "body": "yeah, they see it as more of a choice than anything, and act as though you're stupid for \"choosing\" to have it.",
      "created_utc": 1729890740.0,
      "score": 2,
      "context": [
        {
          "id": "ltgfslb",
          "author": "alienprincess111",
          "body": "I think the problem is people don't understand anorexia.  They don't understand that it's a mental disease and an addiction.  They dismiss it, saying why don't you just eat?",
          "created_utc": 1729740135.0
        }
      ]
    },
    {
      "id": "ltfe9qr",
      "author": "Coffeegreysky12",
      "body": "Thank you. I am glad you like the post",
      "created_utc": 1729726430.0,
      "score": 5,
      "context": [
        {
          "id": "ltfdz2f",
          "author": "EnvironmentalBag7798",
          "body": "I hope everyone in here reads this",
          "created_utc": 1729726325.0
        }
      ]
    },
    {
      "id": "ltegsr7",
      "author": "WriteOrDie1997",
      "body": "There are so many variables to this disease. Scientists haven't even been able to pinpoint which specific genes cause the genetic predisposition needed to develop an ED. There's biological, genetic, environmental, and psychological factors. It would be extremely difficult to fix all that with a pill.",
      "created_utc": 1729715485.0,
      "score": 15,
      "context": [
        {
          "id": "lte0oab",
          "author": "LeastPay0",
          "body": "I'm surprised the big pharma hasn't come up with a medication to treat such a mental illness. They have for every other mental illness except this one. There's a show I used to watch called supersize vs superskinny. Quite interesting to say the least. It was a show from the UK. A must see for those that can withstand it.",
          "created_utc": 1729710639.0
        }
      ]
    },
    {
      "id": "lte12k0",
      "author": "Coffeegreysky12",
      "body": "Yes, it's a complex illness and not easy to treat.",
      "created_utc": 1729710764.0,
      "score": 8,
      "context": [
        {
          "id": "lte0oab",
          "author": "LeastPay0",
          "body": "I'm surprised the big pharma hasn't come up with a medication to treat such a mental illness. They have for every other mental illness except this one. There's a show I used to watch called supersize vs superskinny. Quite interesting to say the least. It was a show from the UK. A must see for those that can withstand it.",
          "created_utc": 1729710639.0
        }
      ]
    },
    {
      "id": "lteqwir",
      "author": "VirtualApricot",
      "body": "I think pcilocybin is promising!",
      "created_utc": 1729718517.0,
      "score": 2,
      "context": [
        {
          "id": "lte0oab",
          "author": "LeastPay0",
          "body": "I'm surprised the big pharma hasn't come up with a medication to treat such a mental illness. They have for every other mental illness except this one. There's a show I used to watch called supersize vs superskinny. Quite interesting to say the least. It was a show from the UK. A must see for those that can withstand it.",
          "created_utc": 1729710639.0
        }
      ]
    },
    {
      "id": "m456oc1",
      "author": "pessimistic_witch",
      "body": "Technically they say some antipsychotics “treat it” but it actually just makes the person incredibly hungry and doesn’t help with the actual mental illness",
      "created_utc": 1735358418.0,
      "score": 1,
      "context": [
        {
          "id": "lte0oab",
          "author": "LeastPay0",
          "body": "I'm surprised the big pharma hasn't come up with a medication to treat such a mental illness. They have for every other mental illness except this one. There's a show I used to watch called supersize vs superskinny. Quite interesting to say the least. It was a show from the UK. A must see for those that can withstand it.",
          "created_utc": 1729710639.0
        }
      ]
    },
    {
      "id": "ltr8kpr",
      "author": "alienprincess111",
      "body": "Exactly!",
      "created_utc": 1729893985.0,
      "score": 2,
      "context": [
        {
          "id": "ltgfslb",
          "author": "alienprincess111",
          "body": "I think the problem is people don't understand anorexia.  They don't understand that it's a mental disease and an addiction.  They dismiss it, saying why don't you just eat?",
          "created_utc": 1729740135.0
        },
        {
          "id": "ltqz45j",
          "author": "lrina_",
          "body": "yeah, they see it as more of a choice than anything, and act as though you're stupid for \"choosing\" to have it.",
          "created_utc": 1729890740.0
        }
      ]
    },
    {
      "id": "ltehbnd",
      "author": "Coffeegreysky12",
      "body": "Well said",
      "created_utc": 1729715640.0,
      "score": 4,
      "context": [
        {
          "id": "lte0oab",
          "author": "LeastPay0",
          "body": "I'm surprised the big pharma hasn't come up with a medication to treat such a mental illness. They have for every other mental illness except this one. There's a show I used to watch called supersize vs superskinny. Quite interesting to say the least. It was a show from the UK. A must see for those that can withstand it.",
          "created_utc": 1729710639.0
        },
        {
          "id": "ltegsr7",
          "author": "WriteOrDie1997",
          "body": "There are so many variables to this disease. Scientists haven't even been able to pinpoint which specific genes cause the genetic predisposition needed to develop an ED. There's biological, genetic, environmental, and psychological factors. It would be extremely difficult to fix all that with a pill.",
          "created_utc": 1729715485.0
        }
      ]
    }
  ]
}