{
  "id": "1gb5o2l",
  "subreddit": "AnorexiaNervosa",
  "author": "Substantial_Honey309",
  "created_utc": 1729784493.0,
  "title": "unpopular opinion: recovery obsessed people are still sick",
  "selftext": "hear me out: i think all these creators specially on tiktok that are in recovery and all the content they post is like “things i used to do during my ed” or things like that and then go and “mock” those behaviors for a hot minute are not recovered at all. like yes maybe “physically” or behavior-wise you ate bcs you don’t do that thing anymore, but you are living 24/7 thinking about how you’re life used to be when you were and i don’t see the healthy on that at all. and it fucks me up bcs i feel like they judge from a place of “i’m wise bcs i’m out of it and you’re not” when in reality at least i acknowledge the fact that i can’t let go, you still hold onto in from a different place but that’s all. i don’t know it just pisses me off and i wanna say i don’t think all recovery creators are like this but most of them tend to fall in this category. does that make sense?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1gb5o2l/unpopular_opinion_recovery_obsessed_people_are/",
  "score": 233,
  "num_comments": 19,
  "comments": [
    {
      "id": "ltj170s",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1729784493.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ltj31vl",
      "author": "Lilypetals0",
      "body": "Some people need to pour their obsessive thoughts and competitiveness somewhere. That's why they get in a dynamic in which they HAVE to be the most healthy person ever.",
      "created_utc": 1729785042.0,
      "score": 75,
      "context": []
    },
    {
      "id": "ltj2hv2",
      "author": "alora99",
      "body": "Or when they’re gym/muscle obsessed instead of skinny obsessed but say they’re recovered and promote their new lifestyle",
      "created_utc": 1729784879.0,
      "score": 76,
      "context": []
    },
    {
      "id": "ltj2vr6",
      "author": "interntangel",
      "body": "i also see a lot of “recovery” pages posting current bc’s or their old ones? like paying attention to and posting your weight/body online will not help you…",
      "created_utc": 1729784992.0,
      "score": 34,
      "context": []
    },
    {
      "id": "ltj5793",
      "author": "_-ollie",
      "body": "i unfollowed a LOT of recovery pages when i was at my lowest.\n\ni used to follow someone named ella daisey almost two years ago when she was actively recovering, unfollowed her along with every other recovery page, and then found her page again recently.\n\nshe completely embraces her post recovery body, she's absolutely stunning. she's one of the only people i follow that didn't go down the ana-ortho route. i suggest following her for some body positivity.",
      "created_utc": 1729785682.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ltjc6hl",
      "author": "runninginbubbles",
      "body": "Totally agree. In order to recover you have to let go of that ED identity.",
      "created_utc": 1729787783.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ltkawok",
      "author": "None",
      "body": "I feel like real recovery happens offline",
      "created_utc": 1729798094.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ltjkpws",
      "author": "Punk_Boi4737",
      "body": "this is so true! r/EDrecoverysnark",
      "created_utc": 1729790305.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ltlm8i7",
      "author": "Safetychick92",
      "body": "I think, even in recovery, if your life still revolves around food and weighing your food and posting your food on insta and running a recovery account etc then you’re still sick. I get at the start, you need to be focused on that. But if your whole life is revolved around your recovery you’re still sick. Just in a different way.",
      "created_utc": 1729813469.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ltkurx7",
      "author": "turnipkitty112",
      "body": "I totally agree. There’s more to recovery than just physical healing and behavioural remission. You also have to let go of your ED identity, and find other interests and things to fill your life. If you are still thinking about your ED all the time or revolve your whole personality - or, god forbid, career - around your past ED… then, while you may be in remission, and you may have a wonderful life, that’s not for me to judge… I’d still hesitate to call such a person fully recovered.\n\nThe people in my life who I know are fully recovered for real, they don’t talk about it, they don’t base their identity around their illness OR their recovery. I wouldn’t have even know they’d ever been ill unless they’d told me.",
      "created_utc": 1729804064.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ltl0xw9",
      "author": "m0rganfailure",
      "body": "recovery page 😁 then it's just body checks",
      "created_utc": 1729806026.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ltjfgjg",
      "author": "None",
      "body": "Oh 100% - 99% of recovery ‚influencers‘ are awful, toxic, harmful etc. regardless of how they present themselves. It always feels like „oh I’ve been SO much sicker than you and I recovered so of course you can“ which is really belittling and obvs competitive, or „I’m compensating for my eating with excessive exercise but I promise it’s healthy so don’t question it“, or simply „hi there I’m in a major relapse and I’m gonna document every second of it because it just HAS to be seen by the world pls make me feel valid!!1!“\n\nEven those who have made a ‚career‘ out of it eg Ro Mitchel are PROFITING off their poor mental health and it becomes not only their personality but also their entire career - when you monetise it like that you have to keep one foot in it or you have no money coming in. It’s crazy!\n\nI think Dora Tomlinson is a good example of someone who did start out documenting their recovery and now almost never makes any sort of allusion towards her having an ED - it’s no longer part of her identity and that is an indicator that she’s actually recovered - she’s to busy living her life to give it any brain space, let alone air time online",
      "created_utc": 1729788751.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ltmq1oj",
      "author": "alienprincess111",
      "body": "1000% agree.  I recently started following some recovery accounts on ig and find them fascinating. The people who post all the time about how they used to have an ED and what they eat now are not recovered.  If you're recovered you move on.  You don't keep reliving your ED. The only real accounts are those that ended with the person saying they are not posting anymore because they don't identify with their ED self anymore.\n\nI could see though how having a recovery account might help some people stay accountable as they are recovering.",
      "created_utc": 1729828503.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ltm1cwl",
      "author": "RATMAN000",
      "body": "I find these pages sometimes even more triggering than just the regular ed pages because those people really show off their sickness and glorify it and they’re usually people that were let’s call it more “traditionally” sick, and it feels like they post about their “lows” (e.g being very emaciated, or hospitalised, or tube-fed..) only for anyone’s who’s ever struggled with this disorder and for themselves to show off how successful they were at being sick.",
      "created_utc": 1729818950.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ltk9dha",
      "author": "throwaway2733729283",
      "body": "Honestly sometimes I think those people are in quasi and legitimately, consciously jealous of active AN’s or have never actually had an ED. Some people are WAYYY to insensitive abt it to have ever actually been through this fucking hell. Only other possibility is these ppl consumed too much BOPO content with no critical thinking and think their health kick 3 years ago was an ED.",
      "created_utc": 1729797633.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ltmyvbr",
      "author": "Signal_Energy_7283",
      "body": "agree.",
      "created_utc": 1729832848.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ltptadj",
      "author": "jazzmagik",
      "body": "💯 nailed it.",
      "created_utc": 1729877658.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ltnm0pj",
      "author": "sjjaewoo",
      "body": "this!!!omg",
      "created_utc": 1729847313.0,
      "score": 3,
      "context": [
        {
          "id": "ltj2hv2",
          "author": "alora99",
          "body": "Or when they’re gym/muscle obsessed instead of skinny obsessed but say they’re recovered and promote their new lifestyle",
          "created_utc": 1729784879.0
        }
      ]
    },
    {
      "id": "ltm0qt6",
      "author": "RATMAN000",
      "body": "You’ve hit the nail on the head.",
      "created_utc": 1729818724.0,
      "score": 3,
      "context": [
        {
          "id": "ltkurx7",
          "author": "turnipkitty112",
          "body": "I totally agree. There’s more to recovery than just physical healing and behavioural remission. You also have to let go of your ED identity, and find other interests and things to fill your life. If you are still thinking about your ED all the time or revolve your whole personality - or, god forbid, career - around your past ED… then, while you may be in remission, and you may have a wonderful life, that’s not for me to judge… I’d still hesitate to call such a person fully recovered.\n\nThe people in my life who I know are fully recovered for real, they don’t talk about it, they don’t base their identity around their illness OR their recovery. I wouldn’t have even know they’d ever been ill unless they’d told me.",
          "created_utc": 1729804064.0
        }
      ]
    }
  ]
}