{
  "id": "1gnxj92",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1731233415.0,
  "title": "how to get over identifying with anorexia ",
  "selftext": "Ive been doing really great in terms of breaking food rules and bullshit lies i tell myself about calories, but ive noticed as ive slowly started to recover that my biggest struggle is still feeling \"sick enough\" does anyone struggle with this? Why on earth do I want to look sick?? for attention? like??? Im just so tired and i want this shit to be over, its pathetic and I feel like everyday im just drowning. \n\n\n\n\n\nAlso idk if this helps anyone but here are some meals ive made :) ",
  "url": "https://www.reddit.com/gallery/1gnxj92",
  "score": 123,
  "num_comments": 20,
  "comments": [
    {
      "id": "lwe3niz",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1731233415.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lwe5hka",
      "author": "None",
      "body": "Well done on your recovery path! I fully understand where you’re coming from with this, I’m nearly back to where I was before this, but still feel the exact same way you’ve described. It’s almost like a, “why am I still having care”, but also a “I miss those times and wish I could go back”? I guess in a way, it’s some kind of sick nostalgia, the illness teasing you the things you felt were good at the time, tempting you to go back.\n\nJust keep reminding yourself about the truth of those times (what you were missing out on, how much small things affected your life, etc.). I know you can fully get past this is the end 🤍\n\n(Also those all look delicious!)",
      "created_utc": 1731234642.0,
      "score": 20,
      "context": []
    },
    {
      "id": "lwekmr6",
      "author": "milkisterrifying",
      "body": "so although i’ve gotten back into a bad spot lately, there was a time last year where i was actually doing pretty well. what worked for me was to find a new ‘thing’ to base my identity around that was more important to me then the disorder. it must be more important, to the extent that you will prioritize meeting that goal/ideal over disordered behaviours. i also distanced myself from ed spaces (like this sub and other ed subreddits) so i didn’t feel like i was ‘missing out’ by not engaging in disordered behaviours. i trained my algorithm to not show me food or ed related posts, and in some cases made entirely new accounts.",
      "created_utc": 1731243464.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lwgeer1",
      "author": "teengreen",
      "body": "I tend to hold things inside, so anorexia has been a way to scream without screaming: “I need help! Everything is not OK!” I use my body looking sick so I don’t have to speak up. I’m learning to share what I’m feeling and ask for what I need in other ways. But I hear you and understand. Sometimes I think, “People notice me more and pay attention when I’m sick.” Honestly though, they also pay attention when I speak up and ask for what I need. I have a lot of hope for you!",
      "created_utc": 1731265596.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lwgk07j",
      "author": "58740452",
      "body": "Congrats on starting recovery!\n\nI think the need to feel/look sick enough comes down to needing a sense of safety. Starving is familiar, the knowledge that you have full control over an aspect of your life (food intake) is comforting and your body reflecting these efforts makes you feel powerful and capable. Once you start to recover, you begin acting against your perceived core beliefs which makes you question many things. Anorexia is very validating and when you deviate from familiar behaviors, everything becomes confusing. \nBut keep in mind that this will pass with time. The initial refeeding period is horrible, but you eventually get used to eating and eating enough and eating multiple times a day. Over time you start to find validation in other things, for example your accomplishments. \n\nWhat helped me was understanding why I still wanted to look/feel/be as sick as possible and then to find reasons why I can’t be in that state anymore. So if you have access to professional help, please use it - it really makes a world of a difference. \n\nThis article from Psychology Today helped me put things into perspective when I first started to recover two and a half years ago: https://www.psychologytoday.com/us/blog/a-hunger-artist/201808/the-six-seductions-of-anorexia",
      "created_utc": 1731267270.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lwh18t1",
      "author": "bellzies",
      "body": "Something that helped me was actually identifying positive role models and body models. I struggled a lot with this too but what helped was thinking about what I really really wanted a sustainable future to look like and I realized it didn’t involve me being sick all the time, just not horrendously (large bmi) and also started looking instead of women who looked nothing like me and were horribly thin, at images of women who were thinner but healthy and looked a lot more similar to my body type. Helped me realize there were better things than being sick.",
      "created_utc": 1731272385.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lwj586x",
      "author": "dolewhipzombie",
      "body": "I don’t know you. But I’m really proud of you. Please keep this up, your body will thank you, and so will your mental health. \n\nProud of you!",
      "created_utc": 1731298745.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lwoc55h",
      "author": "Scared_Manager_8181",
      "body": "currently struggling with this in recovery too, im in an outpatient treatment program where i eat and do therapy on weekdays. Everyday it crosses my mind that “im taking up a spot for somebody who really needs this” and feeling like im “not sick enough” and that i “dont deserve to recover”. Ik these thoughts are all bullshit and i just keep ignoring them, but they get louder the further i get in my recovery. \n\none thing that does help me tho, I try to think about myself as a little kid and ask myself if she doesn’t deserve happiness and to live a life without an ed, it reminds me that i am not my anorexia, i am a person, and was once a child with dreams bigger than this",
      "created_utc": 1731373331.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lwh7pd3",
      "author": "OlsenLuvr",
      "body": "First of all- amazing job working towards healing! I’ve been in the kind of relapse-recovery loop before, and this time my recovery has lasted a while, and I’m feeling optimistic. \n\nI think what helped with me to weaken my identity towards the ED was a few things: \n\nI made an effort to avoid ED related communities (although I absolutely agree there are benefits to some in some ways, sometimes. Use discretion). Doing this helped me to limit ED thoughts and open me up to replacing that time with other things: art, video games, movies, learning other things, etc. \n\nI also tried to place more emphasis on the benefits of any food I was eating, even if it was a “safe” food or not. Olive oil? Healthy fat now- great for hair and skin! Bread? Satiating boost of energy to power me though what I wanna work on!\n\nI also found it helpful to be intentional about who was around me when I was weaker and more likely to slip. Even people with good intentions maybe could trigger me into identifying with the disorder more when they’d bring up supporting me in different ways. Instead, it was so much more beneficial to spend time around people who love me and knew about it, but managed to remain neutral about slips and successes related to my eating. This does add a need for accountability on my end, but the neutrality demonstrated that these people trusted ME to recover.  The more freedom I had to pace my own recovery helped me feel so much safer losing my ed identity. \n\nI also found comfort wearing loose clothes during weight restoration of recovery to make the body changes less scary.\n\nI also limited access and use of my scale.\n\nAs I shift my energy to other things, the voice just started to not come in anymore. I appreciate my healthy body and the things I can do with my whole heart so much more fully now. \n\nI recognize everyone’s recovery journey is different, and these are just the things that worked with me, but I hope you can find hope in these things too. \nThe identifying with anorexia part was absolutely the hardest part for me too, and I believe in you!!!!!",
      "created_utc": 1731274288.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lwhphpx",
      "author": "maddieebobaddiee",
      "body": "those all look so good omg",
      "created_utc": 1731279992.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lwi3l3g",
      "author": "None",
      "body": "Hey! From my experience wanting to look “sick” really just has to do with you wanting to feel sorry for yourself. My anorexia was directly connected to depression so I think I really just wanted to feel sorry for myself and have an excuse to do so. A type of “I hate my life” kind of thing. It’s basically an excuse to keep on with the eating disorder and not having the energy or want really to recover.",
      "created_utc": 1731284894.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lwouso5",
      "author": "worriedgirl03",
      "body": "Absolutely same boat",
      "created_utc": 1731380034.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lwe5xa2",
      "author": "None",
      "body": "yes, thank you oh my god its so nice to finally relate to someone on this, its like apart of me doesnt feel worthy yet apart of me loves feeling sick bc it gives me that validation i so despretely chased after for so long from other people. It just feels like apart of me is gone and I feel so empty.",
      "created_utc": 1731234936.0,
      "score": 7,
      "context": [
        {
          "id": "lwe5hka",
          "author": "None",
          "body": "Well done on your recovery path! I fully understand where you’re coming from with this, I’m nearly back to where I was before this, but still feel the exact same way you’ve described. It’s almost like a, “why am I still having care”, but also a “I miss those times and wish I could go back”? I guess in a way, it’s some kind of sick nostalgia, the illness teasing you the things you felt were good at the time, tempting you to go back.\n\nJust keep reminding yourself about the truth of those times (what you were missing out on, how much small things affected your life, etc.). I know you can fully get past this is the end 🤍\n\n(Also those all look delicious!)",
          "created_utc": 1731234642.0
        }
      ]
    },
    {
      "id": "lwf0v3y",
      "author": "None",
      "body": "thank you, im definetly going to try to start doing this. Ive started journaling as well which has been helpful. Im sorry that youre struggling again now, If you ever need anyone to talk too, im a great listener, im always here :)",
      "created_utc": 1731250122.0,
      "score": 2,
      "context": [
        {
          "id": "lwekmr6",
          "author": "milkisterrifying",
          "body": "so although i’ve gotten back into a bad spot lately, there was a time last year where i was actually doing pretty well. what worked for me was to find a new ‘thing’ to base my identity around that was more important to me then the disorder. it must be more important, to the extent that you will prioritize meeting that goal/ideal over disordered behaviours. i also distanced myself from ed spaces (like this sub and other ed subreddits) so i didn’t feel like i was ‘missing out’ by not engaging in disordered behaviours. i trained my algorithm to not show me food or ed related posts, and in some cases made entirely new accounts.",
          "created_utc": 1731243464.0
        }
      ]
    },
    {
      "id": "lwk25gj",
      "author": "None",
      "body": "thank you💕💕",
      "created_utc": 1731317544.0,
      "score": 2,
      "context": [
        {
          "id": "lwj586x",
          "author": "dolewhipzombie",
          "body": "I don’t know you. But I’m really proud of you. Please keep this up, your body will thank you, and so will your mental health. \n\nProud of you!",
          "created_utc": 1731298745.0
        }
      ]
    },
    {
      "id": "lwomqfb",
      "author": "None",
      "body": "i agree, im sorry that youre struggling with this as well, tysm for your tips  :) i wish i could go back to when i was little, when calories didnt exist.",
      "created_utc": 1731377097.0,
      "score": 2,
      "context": [
        {
          "id": "lwoc55h",
          "author": "Scared_Manager_8181",
          "body": "currently struggling with this in recovery too, im in an outpatient treatment program where i eat and do therapy on weekdays. Everyday it crosses my mind that “im taking up a spot for somebody who really needs this” and feeling like im “not sick enough” and that i “dont deserve to recover”. Ik these thoughts are all bullshit and i just keep ignoring them, but they get louder the further i get in my recovery. \n\none thing that does help me tho, I try to think about myself as a little kid and ask myself if she doesn’t deserve happiness and to live a life without an ed, it reminds me that i am not my anorexia, i am a person, and was once a child with dreams bigger than this",
          "created_utc": 1731373331.0
        }
      ]
    },
    {
      "id": "lwe8x0s",
      "author": "None",
      "body": "Well to some extent a part of you is gone, just a part that really needed to be. It’s like losing a toxic and abusive partner. They’ll remind you of all the good times and promise it’ll be different this time when you threaten to leave, but when you go back it’s the same thing over again.",
      "created_utc": 1731236898.0,
      "score": 8,
      "context": [
        {
          "id": "lwe5hka",
          "author": "None",
          "body": "Well done on your recovery path! I fully understand where you’re coming from with this, I’m nearly back to where I was before this, but still feel the exact same way you’ve described. It’s almost like a, “why am I still having care”, but also a “I miss those times and wish I could go back”? I guess in a way, it’s some kind of sick nostalgia, the illness teasing you the things you felt were good at the time, tempting you to go back.\n\nJust keep reminding yourself about the truth of those times (what you were missing out on, how much small things affected your life, etc.). I know you can fully get past this is the end 🤍\n\n(Also those all look delicious!)",
          "created_utc": 1731234642.0
        },
        {
          "id": "lwe5xa2",
          "author": "None",
          "body": "yes, thank you oh my god its so nice to finally relate to someone on this, its like apart of me doesnt feel worthy yet apart of me loves feeling sick bc it gives me that validation i so despretely chased after for so long from other people. It just feels like apart of me is gone and I feel so empty.",
          "created_utc": 1731234936.0
        }
      ]
    },
    {
      "id": "lwf10ma",
      "author": "milkisterrifying",
      "body": "i really appreciate the offer, and whilst i would normally welcome the companionship, i fear that wouldn’t be very good for your recovery",
      "created_utc": 1731250175.0,
      "score": 1,
      "context": [
        {
          "id": "lwekmr6",
          "author": "milkisterrifying",
          "body": "so although i’ve gotten back into a bad spot lately, there was a time last year where i was actually doing pretty well. what worked for me was to find a new ‘thing’ to base my identity around that was more important to me then the disorder. it must be more important, to the extent that you will prioritize meeting that goal/ideal over disordered behaviours. i also distanced myself from ed spaces (like this sub and other ed subreddits) so i didn’t feel like i was ‘missing out’ by not engaging in disordered behaviours. i trained my algorithm to not show me food or ed related posts, and in some cases made entirely new accounts.",
          "created_utc": 1731243464.0
        },
        {
          "id": "lwf0v3y",
          "author": "None",
          "body": "thank you, im definetly going to try to start doing this. Ive started journaling as well which has been helpful. Im sorry that youre struggling again now, If you ever need anyone to talk too, im a great listener, im always here :)",
          "created_utc": 1731250122.0
        }
      ]
    },
    {
      "id": "lwf1bgm",
      "author": "None",
      "body": "god thats such a good analogy i didnt really even think about that. Having this illness sucks.",
      "created_utc": 1731250281.0,
      "score": 2,
      "context": [
        {
          "id": "lwe5hka",
          "author": "None",
          "body": "Well done on your recovery path! I fully understand where you’re coming from with this, I’m nearly back to where I was before this, but still feel the exact same way you’ve described. It’s almost like a, “why am I still having care”, but also a “I miss those times and wish I could go back”? I guess in a way, it’s some kind of sick nostalgia, the illness teasing you the things you felt were good at the time, tempting you to go back.\n\nJust keep reminding yourself about the truth of those times (what you were missing out on, how much small things affected your life, etc.). I know you can fully get past this is the end 🤍\n\n(Also those all look delicious!)",
          "created_utc": 1731234642.0
        },
        {
          "id": "lwe5xa2",
          "author": "None",
          "body": "yes, thank you oh my god its so nice to finally relate to someone on this, its like apart of me doesnt feel worthy yet apart of me loves feeling sick bc it gives me that validation i so despretely chased after for so long from other people. It just feels like apart of me is gone and I feel so empty.",
          "created_utc": 1731234936.0
        },
        {
          "id": "lwe8x0s",
          "author": "None",
          "body": "Well to some extent a part of you is gone, just a part that really needed to be. It’s like losing a toxic and abusive partner. They’ll remind you of all the good times and promise it’ll be different this time when you threaten to leave, but when you go back it’s the same thing over again.",
          "created_utc": 1731236898.0
        }
      ]
    },
    {
      "id": "lwf150t",
      "author": "None",
      "body": "i getcha. And youre probably right 😭 but again, the offers always open❤️",
      "created_utc": 1731250218.0,
      "score": 1,
      "context": [
        {
          "id": "lwekmr6",
          "author": "milkisterrifying",
          "body": "so although i’ve gotten back into a bad spot lately, there was a time last year where i was actually doing pretty well. what worked for me was to find a new ‘thing’ to base my identity around that was more important to me then the disorder. it must be more important, to the extent that you will prioritize meeting that goal/ideal over disordered behaviours. i also distanced myself from ed spaces (like this sub and other ed subreddits) so i didn’t feel like i was ‘missing out’ by not engaging in disordered behaviours. i trained my algorithm to not show me food or ed related posts, and in some cases made entirely new accounts.",
          "created_utc": 1731243464.0
        },
        {
          "id": "lwf0v3y",
          "author": "None",
          "body": "thank you, im definetly going to try to start doing this. Ive started journaling as well which has been helpful. Im sorry that youre struggling again now, If you ever need anyone to talk too, im a great listener, im always here :)",
          "created_utc": 1731250122.0
        },
        {
          "id": "lwf10ma",
          "author": "milkisterrifying",
          "body": "i really appreciate the offer, and whilst i would normally welcome the companionship, i fear that wouldn’t be very good for your recovery",
          "created_utc": 1731250175.0
        }
      ]
    }
  ]
}