{
  "id": "1gqej0s",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1731509309.0,
  "title": "The reality of anorexia nervosa",
  "selftext": "Anorexia nervosa is not a diet. It's not a weight loss method. It's a devastating mental illness. It is not about being superficial, or trying to look a certain way. It's about being in extreme mental and emotional pain, feeling uncomfortable and not knowing how to cope with those feelings. It's not something you choose to do. Everyone develops the illness for different reasons. Everyone struggles in different ways. At first, you start off wanting to lose a few pounds. You get locked into the habit of constantly checking your weight. You see the number on the scale go down, and yet, you are never satisfied. For some reason, when you reach one number, you set the goal lower. And you keep losing weight. And that is why it is unhelpful to shame or scold a person with an eating disorder and demand they eat more. It is not that easy. And because it's a mental illness, it takes lots of support and treatment to overcome it. Even with treatment, many people with anorexia wind up relapsing. It is often a very isolating disorder. I think a person has to be very unhappy in order to continue to starve themselves. But no one chooses this disorder. It can cause severe medical complications. And it has one of the highest mortality rates of any mental illness. Even though I now experience painful and severe complications from my disorder, I find it very difficult to fully recover. Everyone has their own definition of what recovery looks like. Some people find inpatient treatment helpful and some people recover quickly. And some people are chronic sufferers and will struggle with this disorder for years. There is one thing we all have in common. Everyone with this disorder is hurting, mentally, emotionally, physically. No number will ever be good enough. No number is perfect. Reaching a certain number won't suddenly make you a happier person. Whatever was driving you to starve yourself at the beginning, will not suddenly go away, because you become sicker. For me, focusing so much on losing weight just made me more obsessive. I miss the days where I woke up and didn't think about or worry about my weight or the number on the scale. But those days seem so far away now, like a distant memory. I was happier before I was anorexic. I became more depressed, with the more weight I lost. Yet, I still can't let go of my disorder, even though it's caused me awful medical issues and pain. Whatever the person's reasons are for starving themselves, they aren't choosing it. And I wish people who have never experienced anorexia for themselves, wouldn't be so quick to judge those who suffer from it. What people with anorexia need is compassion and understanding. The illness already makes the person feel alone. Shaming them for something they didn't choose to develop is never the answer. This illness isn't your fault",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1gqej0s/the_reality_of_anorexia_nervosa/",
  "score": 108,
  "num_comments": 11,
  "comments": [
    {
      "id": "lwx97eq",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1731509310.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lwxdsor",
      "author": "fineboifranz",
      "body": "this is indeed a good description of this disorder. hope you will fully recover one day 🩷",
      "created_utc": 1731510856.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lwxwltv",
      "author": "sunnyskiezzz",
      "body": "People who think it's a diet drive me crazy. If it were a diet, I'd be fine to stop well before I became physically unwell. If it were a diet, I'd be able to recognize that constant fatigue, depression, and symptoms of basically every micronutrient deficiency out there were unhealthy, and change my intake to make my body feel good. If it were a diet, I'd be able to be satisfied, physically and emotionally.\n\nThere are times where I convince myself it's just a diet, or that I'm doing this because I want to. It's a defense mechanism so that I don't have to look at all the pain that caused my eating disorder, or the pain it's causing me now. But it's not-- it's a disease. A disease that could kill any one of us, a disease that *will* kill many of us, whether it's this month or 20 years from now. I wish it were that easy to just stop. I wish it were just about vanity.",
      "created_utc": 1731516737.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lx1096r",
      "author": "Safetychick92",
      "body": "I started a new job and I’m walking like 30 000 steps a day and on concrete all day (construction) and wow the amount of damage I’ve done to my bones it’s insane. My hips ache, my knees, my back. I’m in pain 24/7 because of what having an ED did to my body",
      "created_utc": 1731552853.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lwx9pxr",
      "author": "Fenekkuni",
      "body": "Well said!",
      "created_utc": 1731509486.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lwxdwcf",
      "author": "Coffeegreysky12",
      "body": "Thank you",
      "created_utc": 1731510888.0,
      "score": 5,
      "context": [
        {
          "id": "lwxdsor",
          "author": "fineboifranz",
          "body": "this is indeed a good description of this disorder. hope you will fully recover one day 🩷",
          "created_utc": 1731510856.0
        }
      ]
    },
    {
      "id": "lwxx97h",
      "author": "Coffeegreysky12",
      "body": "Well said. It's not easy to stop and it's such a complex and painful disorder. No one chooses it. It really is such a painful thing to suffer from and a lot of people wonder why the person doesn't just simply get over it. But it's not easy at all to get better from anorexia. It's so much more than just wanting to lose weight. I think it's about being terribly unhappy and you just don't know any other way to cope with those feelings",
      "created_utc": 1731516933.0,
      "score": 6,
      "context": [
        {
          "id": "lwxwltv",
          "author": "sunnyskiezzz",
          "body": "People who think it's a diet drive me crazy. If it were a diet, I'd be fine to stop well before I became physically unwell. If it were a diet, I'd be able to recognize that constant fatigue, depression, and symptoms of basically every micronutrient deficiency out there were unhealthy, and change my intake to make my body feel good. If it were a diet, I'd be able to be satisfied, physically and emotionally.\n\nThere are times where I convince myself it's just a diet, or that I'm doing this because I want to. It's a defense mechanism so that I don't have to look at all the pain that caused my eating disorder, or the pain it's causing me now. But it's not-- it's a disease. A disease that could kill any one of us, a disease that *will* kill many of us, whether it's this month or 20 years from now. I wish it were that easy to just stop. I wish it were just about vanity.",
          "created_utc": 1731516737.0
        }
      ]
    },
    {
      "id": "lwy0faw",
      "author": "None",
      "body": "I'd like to argue as well that most people who \"diet\" will end up with an eating disorder. intentional weight loss is just so dangerous.",
      "created_utc": 1731517898.0,
      "score": 4,
      "context": [
        {
          "id": "lwxwltv",
          "author": "sunnyskiezzz",
          "body": "People who think it's a diet drive me crazy. If it were a diet, I'd be fine to stop well before I became physically unwell. If it were a diet, I'd be able to recognize that constant fatigue, depression, and symptoms of basically every micronutrient deficiency out there were unhealthy, and change my intake to make my body feel good. If it were a diet, I'd be able to be satisfied, physically and emotionally.\n\nThere are times where I convince myself it's just a diet, or that I'm doing this because I want to. It's a defense mechanism so that I don't have to look at all the pain that caused my eating disorder, or the pain it's causing me now. But it's not-- it's a disease. A disease that could kill any one of us, a disease that *will* kill many of us, whether it's this month or 20 years from now. I wish it were that easy to just stop. I wish it were just about vanity.",
          "created_utc": 1731516737.0
        }
      ]
    },
    {
      "id": "lx10iyn",
      "author": "Coffeegreysky12",
      "body": "I'm sorry you are in pain. Eating disorders are difficult disorders to have",
      "created_utc": 1731552951.0,
      "score": 2,
      "context": [
        {
          "id": "lx1096r",
          "author": "Safetychick92",
          "body": "I started a new job and I’m walking like 30 000 steps a day and on concrete all day (construction) and wow the amount of damage I’ve done to my bones it’s insane. My hips ache, my knees, my back. I’m in pain 24/7 because of what having an ED did to my body",
          "created_utc": 1731552853.0
        }
      ]
    },
    {
      "id": "lwxa616",
      "author": "Coffeegreysky12",
      "body": "Thanks",
      "created_utc": 1731509639.0,
      "score": 5,
      "context": [
        {
          "id": "lwx9pxr",
          "author": "Fenekkuni",
          "body": "Well said!",
          "created_utc": 1731509486.0
        }
      ]
    },
    {
      "id": "lwy0log",
      "author": "Coffeegreysky12",
      "body": "Yes, that is true",
      "created_utc": 1731517952.0,
      "score": 2,
      "context": [
        {
          "id": "lwxwltv",
          "author": "sunnyskiezzz",
          "body": "People who think it's a diet drive me crazy. If it were a diet, I'd be fine to stop well before I became physically unwell. If it were a diet, I'd be able to recognize that constant fatigue, depression, and symptoms of basically every micronutrient deficiency out there were unhealthy, and change my intake to make my body feel good. If it were a diet, I'd be able to be satisfied, physically and emotionally.\n\nThere are times where I convince myself it's just a diet, or that I'm doing this because I want to. It's a defense mechanism so that I don't have to look at all the pain that caused my eating disorder, or the pain it's causing me now. But it's not-- it's a disease. A disease that could kill any one of us, a disease that *will* kill many of us, whether it's this month or 20 years from now. I wish it were that easy to just stop. I wish it were just about vanity.",
          "created_utc": 1731516737.0
        },
        {
          "id": "lwy0faw",
          "author": "None",
          "body": "I'd like to argue as well that most people who \"diet\" will end up with an eating disorder. intentional weight loss is just so dangerous.",
          "created_utc": 1731517898.0
        }
      ]
    }
  ]
}