{
  "id": "1gr2sag",
  "subreddit": "AnorexiaNervosa",
  "author": "Theicyblonde",
  "created_utc": 1731583998.0,
  "title": "Believe what they tell you - the long term consequences of anorexia ",
  "selftext": "I’ve been weight restored since 2021, I’ve had minor relapses and dips in weight (but no where near my lowest weight) \n\nWhen I got out of hospital I started lifting again, I’ve trained ALL my life, I used to swim, I started competing at the age of 7 and carried on until 17/18 and after that, weights & cardio (running, swimming but not as much cardio as my swimming days) \n\nI’ve recently been diagnosed with advanced osteopenia. I’m also starting HRT. I haven’t had my period since I was 16 (now 23) and I feel like I have ruined my body :( \n\nWhen I first lost my period, I was happy, it made my ED brain happy, it felt like a good thing (and honestly not having to worry about random bleeds or running out of tampons was great) but now I’m sitting here, wishing I had jumped into action sooner, wishing I had recovered faster, wishing I didn’t hang on to my anorexia for so long. \n\nWhen I was in the depths of my anorexia, osteoporosis, infertility & other issues were brought up a lot, to me it always felt like a ‘fear mongering’ tactic to scare me into recovery, and obviously back then, I did not care and also believed nothing like that would ever happen to me.\n\nTbh I believed I would never be sectioned but I was… \n\nI’m already on medication for things like acid reflux and stomach issues, which I can deal with, yes it’s annoying but that’s it, it’s just annoying.\n\nI’m heartbroken at the fact I have done this to myself. But god am I thankful that I got myself back into lifting after I got discharged, I have a feeling that it would have been a lot worse if I hadn’t got myself back into lifting. \n\nBut still, heartbroken. \n\nIf you’re sitting there, reading this, contemplating recovery or you’re struggling to keep up recovery, please, take it from me and many other people, you need to get your body into a healthier place as soon as you can. Because there are very real long term consequences. I wish I listened, I wish I crawled out of that hole sooner than I did. \n\nI know it’s hard, it feels impossible at times to recover, but you can, you can do it. Do it for future you, future memories, do it for your family, future adventures, do it for the you that wants to be healthy and happy. Because if the time comes where you have red flag after red flag with your health (even when you’re a healthy weight) you’ll wish you started sooner. \n",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1gr2sag/believe_what_they_tell_you_the_long_term/",
  "score": 217,
  "num_comments": 21,
  "comments": [
    {
      "id": "lx2ldtm",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1731583998.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lx2nxm2",
      "author": "Jbeth74",
      "body": "Thank you for this. I’m a nurse who works mostly with an over 60 population and as we age so many sins of our youth come home to roost- please don’t add to it if you can help it. Losing mobility due to fragile bones/fractures is life changing and potentially life ending.",
      "created_utc": 1731585354.0,
      "score": 53,
      "context": []
    },
    {
      "id": "lx52s9s",
      "author": "scrolling-for-fifi",
      "body": "this really hit home. i’m in a very similar situation, i lost my period at 15, it’s now been around 4 years and i still don’t have it back. i have osteopenia, severe GERD/acid reflux and digestive issues - it almost feels like i’m reading this post about myself!!!\n\ni’m heavily considering HRT - do you mind if i ask a few questions about it? does it actually directly support bone health/reduce further deterioration? will it give you an ‘artificial period’? will it reduce risk of infertility? i’m in such a similar position to you and heavily considering taking the step towards HRT!! would appreciate if you could share your views and thoughts!! thank you for sharing, this is a cruel cruel illness x",
      "created_utc": 1731614716.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lx2nhy1",
      "author": "Choice-Stop9886",
      "body": "thank you",
      "created_utc": 1731585133.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lx48tld",
      "author": "MyDMThrowawayPF",
      "body": "Yes, please take your health seriously with this! I'm in my 30s and have struggled in varying degrees with this for 20 years.  My digestive system is a mess, my kidneys are in stage 1 failure now, and I learned that numerous autoimmune conditions have epigenetic triggers in the worst way imaginable. \n\nI feel like a cautionary tale when I'm in HLOC, but honestly it's fair. Treatment in the early 00s was the wild west and its so SO much better now so if you have the opportunity,  take it seriously.",
      "created_utc": 1731605600.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lx3jwyq",
      "author": "Sudden_Lie8782",
      "body": "tysm i am struggling with oteoarthiris even though i am a higher weight because i recovered and relapsed and am terrified of injuring my body further",
      "created_utc": 1731597866.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lx4iywg",
      "author": "_dadragon",
      "body": "Thank you for taking the time to write this. I hope this puts things in a very real light for people struggling with starting their recovery!  It’s never too late or too early to begin healing your body (and your mind!)",
      "created_utc": 1731608666.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lx4krlu",
      "author": "Shaxx_69",
      "body": "I have lost my period about 4 years ago and I know I need to weight more to get it back but I'm scared if it's even possible at this point and I have 0 idea how much must I gain, not having it for such a long time makes me uneasy while I think about the health problems I might have caused for myself in the future.",
      "created_utc": 1731609206.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lx7s6zg",
      "author": "zillabirdblue",
      "body": "This makes me feel like I need to be following this kind of advice much more closely.",
      "created_utc": 1731647349.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lx8ekro",
      "author": "sunnyskiezzz",
      "body": "The whole reason I'm fighting this relapse I'm experiencing right now is because I don't want my health issues to be worse when I eventually recover from it. I already have chronic circulation and digestive problems from my last relapse, even a year in recovery. I don't want my bones, my hormones, or my heart to suffer for the rest of my life too. Even if you recover, it doesn't always fully go away. That terrifies me. I don't want to have horrific health issues in my 20s, because then what is my body going to feel like in my 30s? My 50s? My 70s?\n\nI hope you can heal, both mentally and physically. Sending you love.",
      "created_utc": 1731659044.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lx7xcg6",
      "author": "NinaTHG",
      "body": "my large intestine is FUCKED and I wasn’t dangerously overweight for more than a couple months… I am weight restored for 3 years and every day is worse lol",
      "created_utc": 1731649732.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lx9ostm",
      "author": "No_Sprinkles_2309",
      "body": "I have had my Ed for 10 years now. Fatty liver disease, mitral valve prolapse, thin bones, low white blood cell count, acid reflux, digestion issues, yellow teeth and thin hair, and i haven’t even been underweight for most of it. Depriving yourself of essential nutrients will harm you not matter what your weight or how long you’ve been sick. I’m scared I’ll never recover",
      "created_utc": 1731681165.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxa2zhm",
      "author": "callmeanightmare",
      "body": "Does anyone know if birth control helps? I never lost my period because I’ve been on hormonal bc since 14…",
      "created_utc": 1731685603.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0pram3",
      "author": "ZtoA_Limited",
      "body": "Thank you for this. I’m old (38 now) and realizing the damage I’ve done over the years. Lost my period 4 1/2 years ago, and after almost two years of being weight restored (or close to it), I’ve finally had two periods this year but have to accept that the baby maker is probably retired. I’m lucky I have two healthy children from before I got so ill. I’m not completely recovered but I’m so much better than I was even 8 months ago. I could barely walk up my driveway but now I’m making efforts to take vitamins and stay hydrated on top of eating as well as I can, and I can outrun my 8 year old (in short bursts lol). \n\nBut yes, I have severe gastric issues now that cause severe illness/knocks me out of commission for 3 days every 6-8 weeks. I am extremely worried about my bones because of all my neck, back, and knee pain, and I have neuropathy in my hands and feet which is getting worse by the days. Minor heart complications…but my major wake-up was when I almost died two januarys back (‘23), I’d passed out from low potassium for 17 hours and they found me unresponsive, 90 degrees F, gave me chest compressions and intubated me. They said I was lucky to be alive.\n\nEvery day can bring struggles but when I think I feel heavy or want to restrict, I have a long think about how I’ll feel in a few weeks if I continue a bad behavior. It satisfies the ED brain immediately but I think about barely walking up my driveway, stopping halfway gasping for breath. Then I think about running in the yard. It’s so difficult but it helps me (usually) make the worthwhile choice. \n\nMuch love to all of you 💜",
      "created_utc": 1733497179.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lx8dx5a",
      "author": "None",
      "body": "Thank you.",
      "created_utc": 1731658654.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mcd9lql",
      "author": "wheredafuqismymind",
      "body": "I’m in treatment for Anorexia in a specialized hospital and one of my friends who was way older (45 years old) passed away because she had this disease since 15 years old! Her body couldn’t handle anymore even being at a health weight. This scaried the hell out me and I miss her, she lost her whole life stuck with this fucked up disease :(",
      "created_utc": 1739369872.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lx2o9ni",
      "author": "Theicyblonde",
      "body": "Going to be doing everything I can to keep my body as healthy as possible for as long as possible!",
      "created_utc": 1731585524.0,
      "score": 11,
      "context": [
        {
          "id": "lx2nxm2",
          "author": "Jbeth74",
          "body": "Thank you for this. I’m a nurse who works mostly with an over 60 population and as we age so many sins of our youth come home to roost- please don’t add to it if you can help it. Losing mobility due to fragile bones/fractures is life changing and potentially life ending.",
          "created_utc": 1731585354.0
        }
      ]
    },
    {
      "id": "lxbc3hw",
      "author": "Theicyblonde",
      "body": "Hey! HRT is definitely supposed to help (even a 1% increase a year is a great thing) \nI’m definitely not an expert but: Oestrogen helps with calcium absorption and utilisation and women who use HRT often see an increase in bone density and it can potentially slow the progression from osteopenia and help manage it. I’m not too sure about fertility but I know it’ll help with hormone regulation and help with the symptoms you get from having low hormone levels! \n\nBefore HRT (for amenorrhea) they may suggest you do it naturally (I got told to halt all extreme exercise (for me that’s lifting & cardio) and eat a minimum of 2500) \n\nAnother route I tried was a 10 day course of Medroxyprogesterone to try and induce a period but it didn’t work. \n\nObviously talk in depth with a medical professional about all of this because this is just what I’ve learnt :)",
      "created_utc": 1731699010.0,
      "score": 3,
      "context": [
        {
          "id": "lx52s9s",
          "author": "scrolling-for-fifi",
          "body": "this really hit home. i’m in a very similar situation, i lost my period at 15, it’s now been around 4 years and i still don’t have it back. i have osteopenia, severe GERD/acid reflux and digestive issues - it almost feels like i’m reading this post about myself!!!\n\ni’m heavily considering HRT - do you mind if i ask a few questions about it? does it actually directly support bone health/reduce further deterioration? will it give you an ‘artificial period’? will it reduce risk of infertility? i’m in such a similar position to you and heavily considering taking the step towards HRT!! would appreciate if you could share your views and thoughts!! thank you for sharing, this is a cruel cruel illness x",
          "created_utc": 1731614716.0
        }
      ]
    },
    {
      "id": "lx959oc",
      "author": "MemphisGirl93",
      "body": "I was about to post almost the exact same thing. I’m 31 and just had a conversation with my doctor yesterday about how I feel like I’m dying. I have so many issues now and also needed to do IVF to have my son. I was extremely healthy when I pursued IVF but my reproductive system was damaged. Treatment in the 2000s and 2010s was indeed the wild west, but sometimes I think I did better back then because I had more hope. I remember meeting a woman who had been to treatment four times on my first admission. She begged me to not end up like her and I remember thinking “I will do good and never have to go to treatment again.” I’ve had probably over 20 treatment stays and during one of the last ones I remember looking over at the adolescents feeling the same sense of urgency. Please don’t end up like me.",
      "created_utc": 1731673927.0,
      "score": 2,
      "context": [
        {
          "id": "lx48tld",
          "author": "MyDMThrowawayPF",
          "body": "Yes, please take your health seriously with this! I'm in my 30s and have struggled in varying degrees with this for 20 years.  My digestive system is a mess, my kidneys are in stage 1 failure now, and I learned that numerous autoimmune conditions have epigenetic triggers in the worst way imaginable. \n\nI feel like a cautionary tale when I'm in HLOC, but honestly it's fair. Treatment in the early 00s was the wild west and its so SO much better now so if you have the opportunity,  take it seriously.",
          "created_utc": 1731605600.0
        }
      ]
    },
    {
      "id": "lxq0wcx",
      "author": "Remarkable-Pirate214",
      "body": "Take it as a sign if it will help ♥️",
      "created_utc": 1731913777.0,
      "score": 1,
      "context": [
        {
          "id": "lx7s6zg",
          "author": "zillabirdblue",
          "body": "This makes me feel like I need to be following this kind of advice much more closely.",
          "created_utc": 1731647349.0
        }
      ]
    },
    {
      "id": "lxbccm2",
      "author": "Theicyblonde",
      "body": "I hope this helps! And I’m sorry you’re also going through this stuff, if you want to talk more about it then feel free to drop me a message! Sending hugs and I hope you know you’re not alone with this xx",
      "created_utc": 1731699088.0,
      "score": 2,
      "context": [
        {
          "id": "lx52s9s",
          "author": "scrolling-for-fifi",
          "body": "this really hit home. i’m in a very similar situation, i lost my period at 15, it’s now been around 4 years and i still don’t have it back. i have osteopenia, severe GERD/acid reflux and digestive issues - it almost feels like i’m reading this post about myself!!!\n\ni’m heavily considering HRT - do you mind if i ask a few questions about it? does it actually directly support bone health/reduce further deterioration? will it give you an ‘artificial period’? will it reduce risk of infertility? i’m in such a similar position to you and heavily considering taking the step towards HRT!! would appreciate if you could share your views and thoughts!! thank you for sharing, this is a cruel cruel illness x",
          "created_utc": 1731614716.0
        },
        {
          "id": "lxbc3hw",
          "author": "Theicyblonde",
          "body": "Hey! HRT is definitely supposed to help (even a 1% increase a year is a great thing) \nI’m definitely not an expert but: Oestrogen helps with calcium absorption and utilisation and women who use HRT often see an increase in bone density and it can potentially slow the progression from osteopenia and help manage it. I’m not too sure about fertility but I know it’ll help with hormone regulation and help with the symptoms you get from having low hormone levels! \n\nBefore HRT (for amenorrhea) they may suggest you do it naturally (I got told to halt all extreme exercise (for me that’s lifting & cardio) and eat a minimum of 2500) \n\nAnother route I tried was a 10 day course of Medroxyprogesterone to try and induce a period but it didn’t work. \n\nObviously talk in depth with a medical professional about all of this because this is just what I’ve learnt :)",
          "created_utc": 1731699010.0
        }
      ]
    }
  ]
}