{
  "id": "1grrlkl",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1731658099.0,
  "title": "I'm done. I'm committing to recovery to the point it makes me sick. ",
  "selftext": "I’m fucking tired.\n\n\n\nI will never starve myself again. There’s no point. I’ve wasted years of my life attempting to be anorexic again. What’s the point? To waste my muscles away? To become emaciated? To be SMALL? Who fucking cares?\n\n\n\nMy mother and father instilled into me that I must be as frail as possible, otherwise I’ll never find a “good man.” \n\n\n\nYeah, right. When I was sick, I’ve only ever been abused by sick, disgusting excuses of men. \n\n\n\nNow, I do have someone who loves me. And he loves me for who I am now. My personality. My thoughts, my fucking thoughts. I am known to be stubborn and loud. I have opinions. And he listens to me. He listens, instead of telling me to just quiet down and smile.\n\n\n\nI’ll never starve myself again. From this point forward, I’m going to the gym and building back what was taken from me through my illness. I deserve a life. I’m 22. I’m not letting my youth slip through my fingers. I have real life goals. I want to be an actress. How am I honest to god supposed to achieve that when I’m hiding away in my apartment every day, ashamed from my binges, purges, vomit stench, and faintness from laxative abuse?\n\n\n\nI swear to myself, I deserve life. I deserve to love myself. Surely I’m worth love if I was raised by parents who hated me, who don’t love me, and someone can still look at me and treat me like I am his whole entire world. Not that I need a man to prove any of this to me. But I see now. And I’m just fucking tired. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1grrlkl/im_done_im_committing_to_recovery_to_the_point_it/",
  "score": 121,
  "num_comments": 6,
  "comments": [
    {
      "id": "lx8czmd",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1731658100.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lx8qyfo",
      "author": "existentialismsim",
      "body": "thank you for posting this, I hope you know how much this saved me today.",
      "created_utc": 1731666626.0,
      "score": 25,
      "context": []
    },
    {
      "id": "lx9qf4n",
      "author": "Wrong-Tell8996",
      "body": "!!! This. Good for you.  \nAt my skinniest, I also was targeted by really sick guys. And have learned that healthy, supportive guys don't want to see wasting away. They want to a shining bright light. And that's what you are! Stick to it girl (or guy)! You got this",
      "created_utc": 1731681701.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lxab02l",
      "author": "None",
      "body": "OMG. I don’t even know you but I am so so soooo happy for you ! This is the best thing I’ve read today ! I wish you to recover and be happy, you can definitely do it ♡",
      "created_utc": 1731687992.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lxarmid",
      "author": "hipieeeeeeeee",
      "body": "I'm so happy for you! you deserve the world. good luck in your recovery <3",
      "created_utc": 1731692921.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lxdvbg8",
      "author": "Catboy-666",
      "body": "yes!!!!! yes yes yes!!!!! it’s time to move on from this and live your life!!!!!",
      "created_utc": 1731731364.0,
      "score": 3,
      "context": []
    }
  ]
}