{
  "id": "1gsogpw",
  "subreddit": "AnorexiaNervosa",
  "author": "cranialnerve12",
  "created_utc": 1731767483.0,
  "title": "DAE",
  "selftext": "I weighed myself this morning and hit a new low…. Decided to have 10 cookies for breakfast (still in my range of acceptable calories tho). I feel like this happens every time my weight drops. Does anyone else semi binge when they see the number drop?? I feel bad…like my body is deteriorating and instead of feeding it something of value I just throw sugar and carbs at it. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1gsogpw/dae/",
  "score": 113,
  "num_comments": 16,
  "comments": [
    {
      "id": "lxfpv41",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1731767483.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxfxk9t",
      "author": "Lucidlove44",
      "body": "Yes, I’m like “YAY! Still need to lose more but good enough for now!! Cake and Mac and cheese time!!!!”",
      "created_utc": 1731770335.0,
      "score": 60,
      "context": []
    },
    {
      "id": "lxgbdda",
      "author": "Miserable_Thought933",
      "body": "Yes every time I weigh myself and I see a new low weight I always tell myself I am allowed to have a mini binge today and then I regret it big time the next morning as my body really hurt and I feel so sluggish",
      "created_utc": 1731774954.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lxfxkto",
      "author": "Lucidlove44",
      "body": "So felt",
      "created_utc": 1731770341.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lxg1v0q",
      "author": "None",
      "body": "well only when ik if it drops anymore ill be admitted, and im scared.",
      "created_utc": 1731771826.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lxgs7nt",
      "author": "starrymoonkitty",
      "body": "Literally had a taco bell quesadilla and 2 huge waffles this morning. Just got out of my binging phase and losing weight so Im like, fuck me lol. Not happy but we’ll get through it.",
      "created_utc": 1731780358.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lxg851i",
      "author": "duckfruits",
      "body": "Damn. Relatable af.",
      "created_utc": 1731773896.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lxit4f1",
      "author": "Slow_Influence6453",
      "body": "This post almost made me cry lol. I’ve been feeling invalid in my own disorder bcus I saw a drastic physical change after intentionally not looking at my body for a few weeks and my brain was like “good job, restrictions eased for a min”",
      "created_utc": 1731805158.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxlege4",
      "author": "zillabirdblue",
      "body": "Yes!!! I’ll do it once or twice before I go back to the program as usual. It’s like I have to “earn” it.",
      "created_utc": 1731852701.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxi044y",
      "author": "haybails720",
      "body": "My college does its big parties on Saturdays and my only hobby outside of studying is barely eating so I can wear nothing, getting whatever I want from tacobell as a reward after a long week of not eating and taking laxatives and rinse and repeat😭lowk we might have lost parties cause someone brought fireworks and I’m kinda looking forward to a break from that cycle",
      "created_utc": 1731794616.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxlx4cx",
      "author": "Yacintje",
      "body": "For me those are the days i actually get a half decent meal, still not much or anything with sugar or high in carb but the days I'm at a lower weight i can feel less guilty to eat half of the diet plan i had made for me... But most of those days i feel so sad afterward that i go downhill even faster the next day because i feel disappointed in  myself for dropping as much as i did the day before...",
      "created_utc": 1731859554.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mtui3xd",
      "author": "ProfessorThis4264",
      "body": "yeah i always treat myself if the number is lower. but not too much bc i dont want to gain lol",
      "created_utc": 1748012738.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxfzip2",
      "author": "cranialnerve12",
      "body": "It’s like a reward but instead of helping my body I’m speed running diabetes ;_;",
      "created_utc": 1731771018.0,
      "score": 13,
      "context": [
        {
          "id": "lxfxk9t",
          "author": "Lucidlove44",
          "body": "Yes, I’m like “YAY! Still need to lose more but good enough for now!! Cake and Mac and cheese time!!!!”",
          "created_utc": 1731770335.0
        }
      ]
    },
    {
      "id": "lxg4jit",
      "author": "cranialnerve12",
      "body": "Yeah I’m reaching the point where I’m just trying to maintain my weight for my health even though I’m still mentally not recovered :/",
      "created_utc": 1731772713.0,
      "score": 4,
      "context": [
        {
          "id": "lxg1v0q",
          "author": "None",
          "body": "well only when ik if it drops anymore ill be admitted, and im scared.",
          "created_utc": 1731771826.0
        }
      ]
    },
    {
      "id": "lxmr1cv",
      "author": "cranialnerve12",
      "body": "Yeah I usually end up fasting the next day bc the guilt is overwhelming and the thought of food terrifies me",
      "created_utc": 1731869340.0,
      "score": 1,
      "context": [
        {
          "id": "lxlx4cx",
          "author": "Yacintje",
          "body": "For me those are the days i actually get a half decent meal, still not much or anything with sugar or high in carb but the days I'm at a lower weight i can feel less guilty to eat half of the diet plan i had made for me... But most of those days i feel so sad afterward that i go downhill even faster the next day because i feel disappointed in  myself for dropping as much as i did the day before...",
          "created_utc": 1731859554.0
        }
      ]
    },
    {
      "id": "lxgzupk",
      "author": "None",
      "body": "im not even allowed to maintain it otherwise ill be admitted, its \"too low\" apparently",
      "created_utc": 1731782791.0,
      "score": 1,
      "context": [
        {
          "id": "lxg1v0q",
          "author": "None",
          "body": "well only when ik if it drops anymore ill be admitted, and im scared.",
          "created_utc": 1731771826.0
        },
        {
          "id": "lxg4jit",
          "author": "cranialnerve12",
          "body": "Yeah I’m reaching the point where I’m just trying to maintain my weight for my health even though I’m still mentally not recovered :/",
          "created_utc": 1731772713.0
        }
      ]
    }
  ]
}