{
  "id": "1gtkrym",
  "subreddit": "AnorexiaNervosa",
  "author": "Odd_Theme_3294",
  "created_utc": 1731869943.0,
  "title": "Why is TikTok so triggering ",
  "selftext": "I’d been hyping myself up all day for dinner \nI ordered a take away (subway)\nAnd I sat down opened tiktok to a video that said \n‘Learn to say no’\nWith pictures of ice cream, and cake and takeaways.\n\nAnd I’m still trying to eat my sandwich \nBut why do people post that?\nWhy would you wanna encourage others to be as miserable as you are\n\nI genuinely don’t understand \n\nWhen I was younger I wanted people to relate yeah - but wouldn’t post blatantly triggering content like that\nWhy?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1gtkrym/why_is_tiktok_so_triggering/",
  "score": 174,
  "num_comments": 19,
  "comments": [
    {
      "id": "lxmsyli",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1731869943.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxmtqby",
      "author": "None",
      "body": "Because the people posting those aren't good at restricting; they're so miserable that they're trying to convince themselves, and innocent bystanders, that starvation is some moral good. It's not. Eat your sandwich (and delete TikTok)",
      "created_utc": 1731870182.0,
      "score": 83,
      "context": []
    },
    {
      "id": "lxmyz9p",
      "author": "halfhaize",
      "body": "Why... because every social media I know, is used both as proana and recovery.\n\nYou probably interacted with some related content, as the recovery videos. I recommend avoiding recovery content in TT, because the same tags are used in wltok: ed, wieiad, prorecovery, foodtok...\n\nTiktok algorithm is inmaculate. Any like, comment, tags, or even watching a whole video, gets registered into your personal data (that you can download if you're curious)\n\nSo you need to curate your fyp again. Block tags, search different videos you like, and interact with that other content **like crazy.** Everything will go back to normal eventually",
      "created_utc": 1731871840.0,
      "score": 29,
      "context": []
    },
    {
      "id": "lxmukv9",
      "author": "cranialnerve12",
      "body": "Get off tik tok as much as possible. it’s actually so insane how much of a bad influence it has become for ppl vulnerable to disordered eating :/",
      "created_utc": 1731870445.0,
      "score": 24,
      "context": []
    },
    {
      "id": "lxn0n5v",
      "author": "dolewhipzombie",
      "body": "As an older lurker of this sub, social media in present day is so very much like the late 90’s/2000’s magazines we had waved in our faces. I remember realizing years into my ED how toxic and influential (in a negative way) those covers and stories had on me and how I looked at food/dealt with food etc. \n\nPLEASE delete all socials for the first 30 days of trying to gain some of YOU back, tiktok especially is absolutely terrible. It’s why I literally ONLY comment on videos of cats/animals and horror film related things so my algorithm gives me very minimal triggers. \n\nPlease eat your sandwich, you deserve it!",
      "created_utc": 1731872378.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lxmvt6q",
      "author": "None",
      "body": "NO SERIOUSLY WHY IS NOBODY TALKING ABOUT THIS!!! TikTok has turnt into an entire anorexia promotion site. Video after video is about restricting and unhealthy weight loss, people body checking (unhealthily) and EVEN USING IT AS A WEIGHT DIARY!!! When you report the videos and accounts, TikTok does nothing and says it is not a violation. I had to delete it because it's becoming too much.",
      "created_utc": 1731870828.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lxoorpg",
      "author": "SafeAnt3596",
      "body": "Because TikTok is manufactured to notice EXACTLY what catches your attention. Hovering on a video for even a millisecond longer than normal gets noted as something to recommend to you. Unfortunately, the algorithm seems to have more control over what we consume than we do at this point. The only solution is to METICULOUSLY choose “not interested” when u see posts like that (still doesn’t prevent it completely), or just delete social media. Honestly, it’s hard, but after the first hump, being social media free has made my life so much better many times!",
      "created_utc": 1731892642.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lxn0nmk",
      "author": "None",
      "body": "Outrage gets clicks. People suck, also.",
      "created_utc": 1731872382.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxq77eh",
      "author": "slawdh",
      "body": "Because nobody cares if it triggers us, anorexia is not a topic that is talked about so much on social media and nobody thinks about us, anorexics",
      "created_utc": 1731917835.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxnopu2",
      "author": "PoopTartsU",
      "body": "I saw that same tik tok~",
      "created_utc": 1731880160.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxo2w0g",
      "author": "belen-69",
      "body": "i hate tiktok but pretty much have like an addiction to it try not to use social media much especially tiktok it’s genuinely like the worst social medias out there",
      "created_utc": 1731884935.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxps2nd",
      "author": "StrongEntrepreneur99",
      "body": "they prolly post it coz most people have the opposite problem where they eat too much of this stuff",
      "created_utc": 1731908710.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxrctg3",
      "author": "FriedLipstick",
      "body": "Could it be that such posts are made for people suffering from obesity? Where I live it’s an increasing issue and AN is less common. \n\nNevertheless I’m sorry you’ve encountered this and got triggered. Big virtual hug🌸",
      "created_utc": 1731940009.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxsa9h4",
      "author": "runchmunch",
      "body": "I will never relate to people who promote proana content/fat-shaming to others (even though I do it to myself). It feels evil. I don’t understand the desire to bring other people down into their misery.",
      "created_utc": 1731950812.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxse4ij",
      "author": "shuadeonu",
      "body": "this is so true, TikTok is more triggering than edtwt at this point",
      "created_utc": 1731951969.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxt2v48",
      "author": "Objective-Area-7980",
      "body": "YES and no one talks about this. I see tumblr ED shit on there on days where i’m doing okay and it’s sooo annoying. I’m 22 and it affects me i can’t imagine young girls and teenagers seeing stuff like this.",
      "created_utc": 1731959416.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxnq6sx",
      "author": "Odd_Theme_3294",
      "body": "Usually I’d let it blow over\nBut it’s the fact there was a subway there whilst I was eating a subway.\nNot great really",
      "created_utc": 1731880641.0,
      "score": 2,
      "context": [
        {
          "id": "lxnopu2",
          "author": "PoopTartsU",
          "body": "I saw that same tik tok~",
          "created_utc": 1731880160.0
        }
      ]
    },
    {
      "id": "lxrfrp0",
      "author": "Odd_Theme_3294",
      "body": "It was a pro-ana post unfortunately \nAs they had posted thinspo at the end 😖",
      "created_utc": 1731941081.0,
      "score": 1,
      "context": [
        {
          "id": "lxrctg3",
          "author": "FriedLipstick",
          "body": "Could it be that such posts are made for people suffering from obesity? Where I live it’s an increasing issue and AN is less common. \n\nNevertheless I’m sorry you’ve encountered this and got triggered. Big virtual hug🌸",
          "created_utc": 1731940009.0
        }
      ]
    },
    {
      "id": "lxt361w",
      "author": "Odd_Theme_3294",
      "body": "Literally I’m 20 \nAnd managed to have my subway anyway \nBut my sisters are 16 and 11 \nWould dread for them to see something like that",
      "created_utc": 1731959507.0,
      "score": 1,
      "context": [
        {
          "id": "lxt2v48",
          "author": "Objective-Area-7980",
          "body": "YES and no one talks about this. I see tumblr ED shit on there on days where i’m doing okay and it’s sooo annoying. I’m 22 and it affects me i can’t imagine young girls and teenagers seeing stuff like this.",
          "created_utc": 1731959416.0
        }
      ]
    }
  ]
}