{
  "id": "1h06fob",
  "subreddit": "AnorexiaNervosa",
  "author": "BuddySevere7585",
  "created_utc": 1732606505.0,
  "title": "Is anyone else’s reason for their anorexia because they wanted to be prettier?",
  "selftext": "Im genuinely curious and feel alone on this because i noticed most people always say theirs is because they need control in their lives or its a coping mechanism etc. I think mine started because i was scared to gain weight after i went on this weight loss journey. I lost the weight healthily (and it was A LOT OF WEIGHT) but a lot of the compliments from coworkers, my dance friends, family i guess got to me? Now im scared to get fat and ugly again and losing weight just feels safer for me now. The goal weight just keeps getting lower. Idk… i hope at least one person relates to me in this community so i dont feel so alone. 🥲",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1h06fob/is_anyone_elses_reason_for_their_anorexia_because/",
  "score": 130,
  "num_comments": 30,
  "comments": [
    {
      "id": "lz1jv4q",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1732606505.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz1u4fe",
      "author": "Conscious_Custard588",
      "body": "Controlling your appearance is a way of controlling how people perceive and relate to you, I’d argue it’s not so distinct from a basic need for control when you break it down :)",
      "created_utc": 1732613291.0,
      "score": 48,
      "context": []
    },
    {
      "id": "lz22zdx",
      "author": "Safetychick92",
      "body": "I think eating disorders always start out this way honestly. Then they become more.",
      "created_utc": 1732619058.0,
      "score": 31,
      "context": []
    },
    {
      "id": "lz1nngl",
      "author": "None",
      "body": "Yep yep yep I hate my chubby cheeks I feel so ugly with the fat in my face even though my weight is ‘normal’ and I want to lose it even if it’s at an unhealthy level",
      "created_utc": 1732608923.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lz1ps9e",
      "author": "entomoblonde",
      "body": "I think having the merit of being skinnier than absolutely everyone to show for myself certainly helps me lash out against the fact that there are other women with more beautiful faces by nature than I, even when I was thin in the first place. Receiving the most praise related to my appearance in my entire life upon reaching a very unhealthily low weight for my body despite already being thin before was especially stimulating as well as bleak, as it seemed to confirm my preexisting beliefs about being utterly irrelevant except in how I appeared no matter how often I was told I was wrong in these throughout my life, being that I was mortally ill.",
      "created_utc": 1732610354.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lz1vyd9",
      "author": "adaylightdream",
      "body": "Yes! I look so much better when I’m skinny, at least in my opinion. My family doesn’t think that, but it’s because they’re used to chubby girls. But for me, I feel so much better being skinny.",
      "created_utc": 1732614539.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lz43dbk",
      "author": "Cahya_Dechen",
      "body": "Unfortunately, as you said in your post, losing weight and being skinny is heavily reinforced by the people around us. Being perceived as fat, or putting on weight is punished either very explicitly, or we see others punished for it or people withdraw their reinforcement.\n\nThis is basic behavioural psychology here. What’s rewarded is repeated!!\n\nBut eating is a basic bodily need, so all this introduces a helluva lot of conflict into our lives.\n\nThen add the addictive nature of restricting, the high from running on adrenaline, and the sense of control it can give us over our lives, any autism or adhd with those tendencies, sensory difficulties… \n\nIt’s no wonder so many people end up struggling.",
      "created_utc": 1732645478.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lz24ttx",
      "author": "EpicPlaces",
      "body": "I grew up in the 1990s where that was the exact look.  I’ve always had the mind set that if I’m thin enough I’m pretty enough. It’s been a life long struggle mentally but only recently have i started my ED",
      "created_utc": 1732620158.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lz2rbvk",
      "author": "lisa6547",
      "body": "No... It's because I absolutely hate the way that I feel in my skin. I want to rip it all away and throw it in the trash 🤮\n\nJUST RIP IT ALL OFF, fuck this shit 😭",
      "created_utc": 1732630237.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lz395mz",
      "author": "pocketbuilder06",
      "body": "100% \n\nIt was a lot of different reasons for me, but when I started purging and losing weight, people complimented me a lot more. I look at pictures from when I was deep in my behavior, and I thought I looked so attractive. \n\nIm at a healthy weight for my body now, BMI says overweight (fuck that) but my vitals/blood tests are stable for the first time in YEARS because of my weight gain. I feel hideous though. I still get compliments, but it doesn't feel the same I guess. I still struggle mentally, but physically I look okay. Its such a struggle, because I don't want to get back into my ed behavior, but I also hate my body now. I'm practicing acceptance because Im finally healthy, but its hard.",
      "created_utc": 1732636262.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lz2cwee",
      "author": "spicyyymcnuggets",
      "body": "Yup. I got chubby around age 9 and proceeded to get bullied and called fat and ugly. I’ve been wishing I was skinnier and prettier since I was 9 bc of this and still feel exactly the same today nearly 20 yrs later",
      "created_utc": 1732624361.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lz3udix",
      "author": "poloclodau",
      "body": "Yes I always thought Id be prettier when i get skinny. But not too skinny. But once there its like a drug. The habit just grows. It was confirmed as I seem to get more looks, but i had no real issues on that either. \n\nI also thought, when my ex-gf, who was very skinny (unhealthy), dumped me, that i would make anything to get as skinny or worse. As a way to still get to her",
      "created_utc": 1732642775.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lz50gng",
      "author": "Mistii222",
      "body": "yes mine stemmed a lot from wanting to look pretty",
      "created_utc": 1732655622.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lz22k3q",
      "author": "None",
      "body": "Yes",
      "created_utc": 1732618795.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lz327t6",
      "author": "username248124",
      "body": "Yes",
      "created_utc": 1732634041.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lz3gn4d",
      "author": "jessiecolborne",
      "body": "Yes, this is how my eating disorder started. I wanted to look conventionally attractive as I once did when I was at a lower weight. I wanted people to like me. I know that sounds kinda shallow now though.",
      "created_utc": 1732638583.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lz3xwyp",
      "author": "b1u3brdm",
      "body": "Yes, I call it early exposure to America’s Next Top Model. But wanting to be pretty is a form of control, in my opinion - controlling what you look like gives you a false sense of control in terms of how you are perceived/how you want to be perceived by others",
      "created_utc": 1732643830.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lz5q83i",
      "author": "None",
      "body": "yeah pretty much. i hated how i was looked at as fat and i always had a desire to be skinny. its so fucked to think about but when i was at my lowest weight i was praised and complimented the most. apparently you’re only “pretty” if you’re dangerously underweight. i’m almost 2 years recovered and i have not been praised like that ever again. atp idgaf but when i first started to recover it was incredibly unsettling. even to this day sometimes people tell me that i looked better back then and it hurts",
      "created_utc": 1732664138.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lz6i1xm",
      "author": "rodricksimp",
      "body": "Me! I’m a trans guy and it feels like everyone thinks that my anorexia is related to my gender dysphoria and it feels like no one will listen to me when I say it’s not :/",
      "created_utc": 1732674543.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lz9wupx",
      "author": "Responsible_Menu3708",
      "body": "i’d say mine was more of an aspect to control something when things in my life, felt out of my control. even though things are fine now, i’m still trying to control it.",
      "created_utc": 1732729714.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lz5xsx8",
      "author": "strugglingbitch",
      "body": "My reason also has much to do with feeling prettier/thinner but with lots of therapy I've realized it's really about using thinness to control how much people like me. I seem to think the thinner I am, the more people will like me. My issues socially, we know now, actually trace back to issues I have due to my neurodevelopmental social and communication disorder.",
      "created_utc": 1732666941.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz79fvr",
      "author": "gapthat21",
      "body": "yep! this was how mine started out for me. i got out of my first serious relationship and my ex started calling me ugly and fat. so this was how i felt pretty again by losing weight.",
      "created_utc": 1732686246.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz79xlq",
      "author": "CorrectDiscount4657",
      "body": "Yep. Exactly that and the skinnier I got the prettier I felt until I couldn’t even recognize myself anymore. The body dysmorphia hitting hard. But honestly I think I look prettiest the less I weigh.",
      "created_utc": 1732686499.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz7bd69",
      "author": "CommissionRegular100",
      "body": "mine definitely contributed to more than just wanting to be pretty. at the beginning of my ed, i wasn’t necessarily insecure, in fact, at my heaviest weight, i felt great about myself. unfortunately, at the time, i had an asshole of a boyfriend who was a gym rat and didn’t like my body. he manipulated me to go to the gym, count my calories, and neglect me, which in turn, accumulated into a full blown ed without even realizing. i was doing omad essentially, and if i wasn’t i was strict with calories. he wouldn’t even let me keep those fiber 1 90 calorie snacks in the house lol. he was all for meat, rice, protein shakes, and eggs. i went from around 190 (possibly heavier, not over 200 though) to now, around 138 (this happened from the mid-end of 2021- the beginning of 2022). i broke up with him in june of 2022 after he put his hands on me in april of 2022 (ik im an idiot for staying for those few months, but i mentally broke up with him and although we lived together, our work schedules were polar opposites so we didn’t see each other often. this gave me time to cry my tears, be depressed, and deal with my broken heart). i entered a new relationship soon after. i am still with him and he is an amazing soul who has aided in my recovery. i was maintaining at 145ish. in the beginning of this year, i went through an extremely bad depression. this time it was the way i looked, and also my emetophobia. i have developed arfid as well from this, so i don’t eat meat, and i am very very picky. i also found out i have pcos (yay me) and although my insulin and glucose were fine, im terrified it will spike up and i will gain weight. i have the idea engraved in my head that if i get heavier, i wont be loved and i would just hate myself. i maintain my weight now, but recently i just haven’t been feeling like myself. i feel like i let go, and the eating problems are comfortable to me. i felt my best at my worst (unfortunately). it’s so odd how so many things impact our eating habits and how we view ourselves/the world. sorry this was so long i think i needed the vent haha",
      "created_utc": 1732687255.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz7fk3y",
      "author": "soda-pops",
      "body": "mine was because I had been overweight my entire life, watching the people around me get asked out and start dating and... i was just never even being *seen* by people as an option. I just wanted to feel like someone could love me.",
      "created_utc": 1732689575.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz86t84",
      "author": "Pink_Bread_76",
      "body": "I feel like this is the #1 stereotypical reason ed’s start that we usually hear",
      "created_utc": 1732706875.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzberrb",
      "author": "Helpful_Freedom2138",
      "body": "Yes because I was always the big sister and my sister who was tiny was the one my mom always said was gorgeous so in my head being small would make me pretty",
      "created_utc": 1732746689.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzeg751",
      "author": "ExactElection1483",
      "body": "It doesn‘t help that almost every female influencer who is gaining traction IS really skinny, even if not that outstanding face wise, it‘s obvious that the algorithm and in turn society prefers skinniness. So yes, to me ED is also the highest state if conformity I could push myself into, because I was never raised to draw confidence from within.",
      "created_utc": 1732799293.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzgnp0d",
      "author": "klurble",
      "body": "yepppp i call 2022 my “fat and ugly” phase. i have a base need to feel pretty or i can’t function",
      "created_utc": 1732827049.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz3uifh",
      "author": "mossybuggirl",
      "body": "this is a great way to put it",
      "created_utc": 1732642816.0,
      "score": 4,
      "context": [
        {
          "id": "lz1u4fe",
          "author": "Conscious_Custard588",
          "body": "Controlling your appearance is a way of controlling how people perceive and relate to you, I’d argue it’s not so distinct from a basic need for control when you break it down :)",
          "created_utc": 1732613291.0
        }
      ]
    }
  ]
}