{
  "id": "1h3o2bi",
  "subreddit": "AnorexiaNervosa",
  "author": "soshingi",
  "created_utc": 1733005484.0,
  "title": "Life is too fucking short. ",
  "selftext": "Eat the food. Have the experiences. Spend good time with good people. Life is too short to care about being skinny. No one cares. Well, you care. But you are the only person who cares. Your feelings are real and they matter, but two things can be true at the same time. You are wasting time. Life is too short to miss out because of food. \n\nToday I met up with a friend and we ate cake and had coffee and had a wonderful time. Food is not just fuel; it is culture, it is experiences, it is people. How many things do we miss out on because we are scared of the food that will be there? And how many people do we know that only like us because we are skinny? None. No one. People want you there. They want you around. They wish you'd see food for what it is; fuel, but something with the propensity for so much more. It is what you make of it.\n\nPlease, please, please, please. Don't give yourself things to regret. Life is too short. Like, for example - everyone only gets to be a teenager once, right? How did I spend my one chance? Depressed, lonely, hungry, thinking about food. And you know what? D'you know how much better my life was because I was skinny, how much nicer everyone was because I was skinny, how everyone complimented me on how I was skinny? IT FUCKING WASN'T. NO ONE GAVE A SHIT. NO. ONE. GAVE. A. SHIT. I KILLED MYSELF OVER SOMETHING ONLY I GAVE A SHIT ABOUT, AND IN THE END? IN THE END I GOT NOTHING OUT OF IT EXCEPT TRAUMA AND SCARS AND MISSED OPPORTUNITIES. \n\nPlease. Eat the fucking food. Be fucking happy. YOU DESERVE TO BE HAPPY. I AM SCREAMING THROUGH MY SCREEN RIGHT NOW BECAUSE I CANNOT SAY IT CLEARLY ENOUGH. YOU DESERVE HAPPINESS. \n\nIt is not easy. But literally what is? Nothing that is good is easy. Please. Think about life. YOU DESERVE A FULL AND JOYOUS LIFE.\n\n- from someone who is happy and content with a life that does not care about anything except feeling happy and healthy. And who regrets all the time they lost not feeling that way. And who knows that it feels fucking impossible (it still feels impossible!!!! I will forever be marred by this disorder!!!!!!) but has discovered that maybe it is possible. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1h3o2bi/life_is_too_fucking_short/",
  "score": 113,
  "num_comments": 18,
  "comments": [
    {
      "id": "lzs4jvv",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1733005485.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzs8qto",
      "author": "_ThatsTicketyBoo_",
      "body": "I am sitting here hungry. I promised my 2 best friends I wouldn't do this to myself anymore. I'm finding reasons in bad faith to circumvent my promise.\n\nI ate last night \n\nI've only been up 7 hours\n\nI've had 3 sugar free monsters \n\nI've not done anything today\n\nIt's not like I've gone *days* without food.\n\nI'm fucking hungry, why do I do this to myself?",
      "created_utc": 1733007001.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lztcow9",
      "author": "Accomplished-Tackle2",
      "body": "This post is so helpful it could be pinned.",
      "created_utc": 1733021930.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lzt6lqp",
      "author": "NeverEnough2be1",
      "body": "Thank you so much for posting this. Can you just come scream this in my face 5 times a day so my brain believes it? 30 years of this freaking nonsense 😓. \nPlease, if you are young /new with your ED, please, please get help. If you are well in to your ED, please get help. I will speak from experience, you will regret the times you avoided events /times with friends and family because of the food, feeling judged, shame, guilt, and everything else that keeps you in your little lonely bubble. \nKeep fighting the demons… they say it is worth it. I will let you know when (if) I ever get there 🫤",
      "created_utc": 1733019535.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lzv14mu",
      "author": "NinjaSuperb7977",
      "body": "I wish it was just about being skinny, it would make recovery so much easier. Even if I’m happy with how my body looks, I hate how it feels. The sensory feeling of it existing is too much. But also, it is so overwhelming to have to be able to feed myself consistently. To think of things to eat, every day. I don’t have the capacity on top of working and looking after my house and caring for my kids. I have too many things and it pushes me over the edge & the easiest thing to quit is eating. My head is suddenly so much clearer, my body doesn’t feel so ‘wrong’ all of the time. I can put my focus on so many other things. If I could live and never eat again, I would.",
      "created_utc": 1733056107.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lzun7c2",
      "author": "yuru2323",
      "body": "Well I believe people care. So many people noticed my weight loss and complimented me. I also want to be on stage and sing but I feel like I need to be skinny to do it. It's been so recent that I realized I was shy because of my body, because I felt that I'd never be skinny, bc it was an issue everytime I tried to lose weight. But yeah I only live once and I want to be skinny in this short life. I never believed in myself that I could lose weight, I would never succeed, but I finally do believe in myself.\n\nBut it's important to be social as well, maybe I can eat most of my meals with people, I think that's what I'm gonna do, at least for a while. It's challenging but I don't want to lose my friendships over some goal. That goal could also be studying. I could study for so hard bc I'm afraid of failing and never make time for my friends. Then I miss out on them and many great memories. Remembering that life is too short helps me take my obsessions to side. Thank you ❤.",
      "created_utc": 1733047130.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzuy7mm",
      "author": "emmymyangel",
      "body": "how do i upvote this 100 times ??",
      "created_utc": 1733054405.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lztfye5",
      "author": "Queenofwands1212",
      "body": "For me it’s not always that easy to just choose to eat. This is so engrained in my body and mind and being. It’s engrained in me and my mind. I also have colitis and other autoimmune gut disorders and it plays a huge role in my anorexia. And when my body reacts to even my safe foods or if I god forbid feel a tiny bit of weight gain, I complete spiral.",
      "created_utc": 1733023231.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lztw1no",
      "author": "Stardust_427",
      "body": "I think about picking up some disordered habits again. My form is way to feminine now and I just got informed that the Hormonblockers aren’t an option for me anymore. I feel my body changing, I don’t like the fat on my hips and my growing chest. This is not me. U are right but with or without disorder, as long as my body is this way it’s hard for me to be happy with it. Exercising and eating a shit tone of vegetables is better than committing suicide cause of dysphoria",
      "created_utc": 1733030391.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzupk41",
      "author": "Key-Amount-4249",
      "body": "THANKS MY FRIEND",
      "created_utc": 1733048731.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzwjdbb",
      "author": "thetenthdentist_",
      "body": "oh this made me cry thank you so much",
      "created_utc": 1733076209.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0162dx",
      "author": "emtypes",
      "body": "Thank u 🙏❤️",
      "created_utc": 1733146169.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzx4ma3",
      "author": "SnooPeppers8723",
      "body": "M sorry to break the mood but society cares. Family treats u like garbage when u gain weight, friends look at u weirdly and everyone starts acting like u became undisciplined when in reality u re fighting ur own mind who s try a get u killed",
      "created_utc": 1733082661.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzsar9p",
      "author": "soshingi",
      "body": "You do it for reasons only you understand. \n\nBut in that same sense, you will recover for reasons only you will understand. \n\nYou will live for yourself because you want to live for yourself. You will find a reason. You *will*. It doesn't have to be some profound reason. It can be as simple as not wanting to live the shit life that is this fucking disorder. \n\nIt's so hard. It's so fucking hard. No words can make it easier. It's your own journey and no one can influence it but you. You know what you want. What you truly want. You will find the life that follows in accordance with that.\n\nYou will find your reason.",
      "created_utc": 1733007738.0,
      "score": 11,
      "context": [
        {
          "id": "lzs8qto",
          "author": "_ThatsTicketyBoo_",
          "body": "I am sitting here hungry. I promised my 2 best friends I wouldn't do this to myself anymore. I'm finding reasons in bad faith to circumvent my promise.\n\nI ate last night \n\nI've only been up 7 hours\n\nI've had 3 sugar free monsters \n\nI've not done anything today\n\nIt's not like I've gone *days* without food.\n\nI'm fucking hungry, why do I do this to myself?",
          "created_utc": 1733007001.0
        }
      ]
    },
    {
      "id": "lzv1por",
      "author": "soshingi",
      "body": "You have the mindset! You have the knowledge! You know what you are missing out on and you want to change it! \n\nIf that's not a sign that with time you will get to where you deserve to be then I don't know what is. Thirty years is a long fucking time but there is no amount of time that can make it too late for change. You don't need me to scream this in your face! You already know it! If you can be so genuine in wanting others to avoid what you have experienced then you will find what you need to let yourself avoid it too.\n\nYou are going to get there!!",
      "created_utc": 1733056434.0,
      "score": 3,
      "context": [
        {
          "id": "lzt6lqp",
          "author": "NeverEnough2be1",
          "body": "Thank you so much for posting this. Can you just come scream this in my face 5 times a day so my brain believes it? 30 years of this freaking nonsense 😓. \nPlease, if you are young /new with your ED, please, please get help. If you are well in to your ED, please get help. I will speak from experience, you will regret the times you avoided events /times with friends and family because of the food, feeling judged, shame, guilt, and everything else that keeps you in your little lonely bubble. \nKeep fighting the demons… they say it is worth it. I will let you know when (if) I ever get there 🫤",
          "created_utc": 1733019535.0
        }
      ]
    },
    {
      "id": "lzv2dms",
      "author": "soshingi",
      "body": "I feel for you. And I know that if it was just about being skinny it would be so much easier. But I also know that the desire to be skinny is not the only thing to do with this disorder that you can seek help for. Your reasons for having with this disorder are as important as they are utterly irrelevant; you deserve better regardless. You deserve relief from a life that sounds incredibly stressful and taxing, you deserve relief from sensory issues that make it difficult to even simply exist. You always deserve better. Always.\n\nSending love.",
      "created_utc": 1733056801.0,
      "score": 3,
      "context": [
        {
          "id": "lzv14mu",
          "author": "NinjaSuperb7977",
          "body": "I wish it was just about being skinny, it would make recovery so much easier. Even if I’m happy with how my body looks, I hate how it feels. The sensory feeling of it existing is too much. But also, it is so overwhelming to have to be able to feed myself consistently. To think of things to eat, every day. I don’t have the capacity on top of working and looking after my house and caring for my kids. I have too many things and it pushes me over the edge & the easiest thing to quit is eating. My head is suddenly so much clearer, my body doesn’t feel so ‘wrong’ all of the time. I can put my focus on so many other things. If I could live and never eat again, I would.",
          "created_utc": 1733056107.0
        }
      ]
    },
    {
      "id": "lzsb3zq",
      "author": "_ThatsTicketyBoo_",
      "body": "Thanks mate.",
      "created_utc": 1733007868.0,
      "score": 1,
      "context": [
        {
          "id": "lzs8qto",
          "author": "_ThatsTicketyBoo_",
          "body": "I am sitting here hungry. I promised my 2 best friends I wouldn't do this to myself anymore. I'm finding reasons in bad faith to circumvent my promise.\n\nI ate last night \n\nI've only been up 7 hours\n\nI've had 3 sugar free monsters \n\nI've not done anything today\n\nIt's not like I've gone *days* without food.\n\nI'm fucking hungry, why do I do this to myself?",
          "created_utc": 1733007001.0
        },
        {
          "id": "lzsar9p",
          "author": "soshingi",
          "body": "You do it for reasons only you understand. \n\nBut in that same sense, you will recover for reasons only you will understand. \n\nYou will live for yourself because you want to live for yourself. You will find a reason. You *will*. It doesn't have to be some profound reason. It can be as simple as not wanting to live the shit life that is this fucking disorder. \n\nIt's so hard. It's so fucking hard. No words can make it easier. It's your own journey and no one can influence it but you. You know what you want. What you truly want. You will find the life that follows in accordance with that.\n\nYou will find your reason.",
          "created_utc": 1733007738.0
        }
      ]
    },
    {
      "id": "lzv2wd4",
      "author": "NeverEnough2be1",
      "body": "You are so sweet. Thank you. You are so thoughtful and a great inspiration. Keep doing great things. You are what is going to help make change in this crazy world.",
      "created_utc": 1733057082.0,
      "score": 1,
      "context": [
        {
          "id": "lzt6lqp",
          "author": "NeverEnough2be1",
          "body": "Thank you so much for posting this. Can you just come scream this in my face 5 times a day so my brain believes it? 30 years of this freaking nonsense 😓. \nPlease, if you are young /new with your ED, please, please get help. If you are well in to your ED, please get help. I will speak from experience, you will regret the times you avoided events /times with friends and family because of the food, feeling judged, shame, guilt, and everything else that keeps you in your little lonely bubble. \nKeep fighting the demons… they say it is worth it. I will let you know when (if) I ever get there 🫤",
          "created_utc": 1733019535.0
        },
        {
          "id": "lzv1por",
          "author": "soshingi",
          "body": "You have the mindset! You have the knowledge! You know what you are missing out on and you want to change it! \n\nIf that's not a sign that with time you will get to where you deserve to be then I don't know what is. Thirty years is a long fucking time but there is no amount of time that can make it too late for change. You don't need me to scream this in your face! You already know it! If you can be so genuine in wanting others to avoid what you have experienced then you will find what you need to let yourself avoid it too.\n\nYou are going to get there!!",
          "created_utc": 1733056434.0
        }
      ]
    }
  ]
}