{
  "id": "1h6v2uo",
  "subreddit": "AnorexiaNervosa",
  "author": "Rhyme_orange_",
  "created_utc": 1733356202.0,
  "title": "Why is anorexia so popular?",
  "selftext": "I honestly didn’t know that so many people struggled with this disorder. I hope my question is ok, I personally have my own reasons and diagnosis but want to hear from others about this. Thanks for your thoughts and understanding. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1h6v2uo/why_is_anorexia_so_popular/",
  "score": 120,
  "num_comments": 125,
  "comments": [
    {
      "id": "m0gf343",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1733356202.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0gft92",
      "author": "w1tchyb1tchy-",
      "body": "I had a history of mental illness, hospitalizations not related to EDs at all, and was overweight at one point and decided to lose weight, at first it was healthy. However somewhere along the way it became an obsession and I was fixated on it, even once I was at a healthy weight I just couldnt stop. I cant remember when the lines started to blur but I believe I was already susceptible to developing an ED because of my medical history and losing weight just triggered that course of events.",
      "created_utc": 1733356458.0,
      "score": 131,
      "context": []
    },
    {
      "id": "m0gla0c",
      "author": "throwawayforlemoi",
      "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
      "created_utc": 1733358399.0,
      "score": 118,
      "context": []
    },
    {
      "id": "m0hq9dk",
      "author": "pebblesandmarbless",
      "body": "Binge eating disorder is actually the most common eating disorder. I think it might seem like more people have anorexia because it’s generally more societally accepted to be underweight than overweight. There’s a lot more shame around binging (and purging) behaviors so it’s not as widely talked about because of how it’s viewed by most people. On the other hand, weight loss is usually praised and complimented. It’s all really fucked up",
      "created_utc": 1733373901.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m0gjnom",
      "author": "KristiSoko",
      "body": "I think with the rise of communication technology, we hear there’s more people like us as opposed to being in a cave in a third world country thinking you’re the only one that has something wrong with you",
      "created_utc": 1733357824.0,
      "score": 31,
      "context": []
    },
    {
      "id": "m0hxy5y",
      "author": "spicytexan",
      "body": "I think it’s because it’s relatively easy to hide. At least initially. I was able to brush it off as though my medication finally worked for me and I stopped “stress eating.” In reality the truth was I was suffering from major pre-loss grief when my mom was diagnosed with stage IV breast cancer and felt like the only thing I *could* control was what I ate. \n\nWhen the weight started shedding—quickly—it was like an addiction to something that felt “successful” in a way. I was good at eating just enough in front of people to not raise suspicions but really I was basically not eating anything. I’m currently less than a year recovered right now and pregnant with our first child. I still have urges to restrict because of how I feel in a body bigger than I’ve ever had. But I work hard to remind myself that if I don’t eat, our son won’t eat, and that’s a terrifying thought I refuse to give into. So far we’re both healthy and hope it only continues!",
      "created_utc": 1733377557.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m0gyypg",
      "author": "crisebdl",
      "body": "I was always thinner, and society rewarded me for it. When I got to puberty and my body began to change, I couldn’t cope with the idea of not having the « right » body anymore. It’s been 16 years and I still am unable to recover.",
      "created_utc": 1733363264.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m0h3rzt",
      "author": "unnamedfae",
      "body": "Idk if its popular or you're just in a corner of the world wide web tm where we all gather",
      "created_utc": 1733365018.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m0ggzk4",
      "author": "alienprincess111",
      "body": "The way you phrase the question makes it sound like anorexia is a choice or a trend. It is not! It is a mental disease.",
      "created_utc": 1733356870.0,
      "score": 55,
      "context": []
    },
    {
      "id": "m0ida18",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1733386569.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m0hyjir",
      "author": "sbrown_13",
      "body": "It’s not popular. It’s a bloody death sentence. I wouldn’t wish this disease on my worst enemy…",
      "created_utc": 1733377867.0,
      "score": 14,
      "context": []
    },
    {
      "id": "m0gms2r",
      "author": "None",
      "body": "I don't think it's 'popular' but its an illness that can be difficult to hide. People notice when someone has a peculiar or different diet or eating habits, out of the ordinary obsessive compulsions, if they exercise a lot or if their weight decreases. The insecurities and depression can lead a lot of sufferers to feel isolated and they want to discuss all these confusing thoughts online where it feels safe and you don't feel so alone or weird. I think thats why communities about eating disorders thrive (in healthy and unhealthy ways) because it is so isolating in the real world.",
      "created_utc": 1733358935.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m0gibep",
      "author": "BookishBeauty_",
      "body": "For me it started with wanting to look like everyone else in my class when I was 12, I noticed how much bigger I was than everyone else. Since then it's evolved, I've been through multiple 'recoveries', I guess now I'm in my 20s it comes more from a place of control? Idk my relationship with food has been so messed up since I was so young that I'm not sure I even know how to live without some form of an ED. I also have a lot of other mental health issues and everything just kind of bunched into one big ball of issues lol. If I could choose to be normal I would, cos man it sucks",
      "created_utc": 1733357343.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m0h3vo1",
      "author": "jun3_bugz",
      "body": "well it’s not. It makes up only 5% of eating disorders. Remember as anorexics we do as humans create our own echo chambers. it is still a rare mental disorder",
      "created_utc": 1733365056.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m0i4aal",
      "author": "Rectangular_Bird",
      "body": "It is quite a rare eating disorder actually. Ednos and disordered eating are way more common.",
      "created_utc": 1733381029.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m0hc5ch",
      "author": "Autam",
      "body": "I don’t think it’s AN that’s “popular”. It’s more so that the method they use, restricting foods, is. Lots of people have disordered eating or have done extreme diets but don’t have an eating disorder.\n\nFor me it came late. I grew up with my AN grandmother and obese mother. My grandma was always telling me I need to eat less and “boys won’t like you if you eat” (I was already right above underweight), while my mom was constantly talking about how fat and ugly she was and that she’s worthless because of it. I had bad body image but didn’t really do much about it. Then I got my first job and started binging on food like crazy. Gained weight and that just made my imagine worse. I definitely already had disordered eating mostly from anxiety and depression long before this too.\n\nIt wasn’t until I was 20 and me and my fiancé split after he cheated 13 times, my best friend died, and I fell into such a huge depression I just stopped eating basically. My grandma would tell me she was so proud and I looked great constantly after I started losing from this, and my mom would tell me how jealous she was of how small I was. It felt good, so even after I started feeling better, I continued to restricted and it became the only thing I cared about or would make me feel good about myself. I recovered, then a few years later developed an alcohol addiction and once I was out of that I relapsed. One of the things that was keeping me from drinking again was telling myself how much calories were in it and that drinking makes you gain weight like crazy. Still stuck in that relapse at 27 now",
      "created_utc": 1733368100.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m0hvdy0",
      "author": "Vegetable-Try9263",
      "body": "I think it’s the IDEA of anorexia that’s popular, mostly because of how society and so many people value thinness in general. Thinness isn’t just perceived as a physical trait, it’s also seen as a virtue. I think this is why AN is perceived SO differently on a societal level compared to any other eating disorder.\n\nWhen most people think of AN, the first thing that comes to mind isn’t that it’s a debilitating mental illness. Most people just think that anorexia means that someone has successfully made themselves very very thin. A lot of people just see restriction as a means to an end, and that it takes a lot of self-discipline and suffering to reach this “ideal” body type. Anorexia is alluring to people in a way that other eating disorders generally aren’t.",
      "created_utc": 1733376276.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m0golva",
      "author": "gingerkitttie",
      "body": "Im 25F & growing up chronically online & with no parental supervision & being called fat by my orthorexic father, I would go online and look up quick ways to loose weight and I just kinda fell in the hole at age 13. It later progressed to bulimia. \nFrom my experience, back in the 2010s, thigh gaps & chain smoking instead of eating seemed to be glorified on the side of social media & forums I was on. I've heard of lots of people my age who had dang near the same exact experience as I. Of course with added on mental illness I was not aware of at the time, which may have been the case for most as well. \nIt's just wanting to lose a little, then it progressed and became an obsession & it was kind of socially acceptable & when I tried to get better it was a challenge. I'm about 3 years clean thankfully, but it did take a while..",
      "created_utc": 1733359592.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m0gpsqi",
      "author": "Excellent-World-476",
      "body": "It’s a mental illness not a fad.  That’s like asking why is high blood pressure so popular.",
      "created_utc": 1733360019.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m0hl71x",
      "author": "j_p96",
      "body": "Not sure why it’s so popular (other than societal standards and all of that, which sucks). I personally feel that my anorexia developed mainly from my own “expectations” of myself, how I *should look*, etc. and an overwhelming feeling of lack of control over my own life, emotions, behaviors… absolutely everything. My disordered eating started when I was a preteen and has now advanced to anorexia 10+ years later. \n\nI do want recovery in order to feel better physically, but I do not want recovery due to the mental challenges along the way. I have tried and it consumed *all* of my energy, emotionally and physically. I believe the people trying to help me were not the “right” people. Idk.",
      "created_utc": 1733371702.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m0hqu94",
      "author": "skintbinch",
      "body": "they were always reasonably prevalent, they’re just easier to see now because people aren’t being hidden away as a sign of shame by their families, people aren’t more open to talking about this stuff and we’re in the digital age so we can connect with each other despite being a very small subset of the general population.",
      "created_utc": 1733374162.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m0i81wq",
      "author": "Dunkleosteus666",
      "body": "Popular? Depends. Youre are unlucky if predisposed, lucky if diagnosed and even luckier if recivered. Some never do. Death rate is high. And many comorbidities (in my case, diagnosed adh, suspected aspergers, + substance abuse).\n\n I was unlucky to one of the few males which had anorexia (+ selfcutting), but it diagnosed, treated, and i recovered. 12-13M, it was 13 years ago, dont wish that to my worst enemy. Still struggled with (poly) substance abuse, but nothing gripped my mind and distorted reality as hard as anorexia did. If my parents hadnt forced an intervention i would have likely died because i lost weight ver, very fast (+ compulsive physical exertion). \n\nIts not a choice. Its not fancy. Its cruel, disgusting and takes everything from you.Wish i didnt have to write this. Same as addiction or depression or schizophrenia, its not a choice.\n\nIm not a doctor, but from what ive read the reasons diagnoses surged (absolute and relative) is because 1) psychiatrist etc get better at diagnosing and recognizing early stages 2) taboo to talk about mental health disappears. Its not really becoming more prevalent but science gets better.\n\nedit: Finishing my M.Sc. in Biology now, 13 years later. Addiction issues but hey theres light at the end of the tunnel.",
      "created_utc": 1733383256.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m0iitnb",
      "author": "Cautious_Effort8014",
      "body": "popular is not a great choice of words",
      "created_utc": 1733390300.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m0ku2kw",
      "author": "Temporary-Chef4663",
      "body": "For me, genetics. My mom and brother both had bad EDs. And I tried focusing the obsession and control on the gym, but I ended up gaining weight from muscle and tons of protein and cals so I flipped.",
      "created_utc": 1733423635.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0kv9n1",
      "author": "Rough_Ad2102",
      "body": "I fell down the rabbit hole as a teen who was just trying to lose a few kgs. Even though I was never very overweight, I noticed how much better I was treated as I continued losing and somewhere along the way it became an obsession. Pretty cliche but here we are like 9 years later lol",
      "created_utc": 1733424000.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0gvky2",
      "author": "Deepspacechris",
      "body": "After years and years of mental issues it all peaked when I saw that my marriage and personal life was failing, and in an attempt to regain some control of my life, dieting became an obsession. Probably because the only thing you can really have some sort of control over is exactly that; your own body. Fast forward a couple of months and it’s all I can think about, and now, a couple of years later, I’m deep in and honestly I see no way out without any drastic change in my life.",
      "created_utc": 1733362071.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m0hdg1q",
      "author": "ThrowRA-sicksad",
      "body": "Because we live in a fatphobic bodyshaming society that tells us we’re disgusting for having healthy bodies.",
      "created_utc": 1733368595.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m0gqlj4",
      "author": "themostdownbad",
      "body": "It’s undeniably glorified in the media for women. High fashion runway models are the most popular example.",
      "created_utc": 1733360306.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0gt004",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1733361154.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m11tptx",
      "author": "CommercialMachine920",
      "body": "I suffer from obesity, i wish i were anorexic, they are so cool to me, i admire them.",
      "created_utc": 1733675661.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0gznds",
      "author": "I_Love_Pride",
      "body": "A main reason is because of how much fatphobia there is in our society (especially on the internet)",
      "created_utc": 1733363506.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0gtq2e",
      "author": "None",
      "body": "I definitely get what you meant with 'popular' even though it might not be the best choice of wording it :p\nIn my opinion social media is to blame. These days I open twitter or any social media and easily find disturbing content, it didn't use to be like this. When I was younger I could find it online but I had to dig if it makes any sense. Last year I found out there's a community on twitter and it was awful, it seems as if it's only getting worse each day. To be clear, I don't blame these people and for what I've seen they're teens. I get incredibly sad though when I think about everything they are going through.\n\nEvery now and then there's a new trend on tiktok that makes me baffle and it's so normalized. The fatphobia and bodyshaming, the bodychecking...it's all so sad.",
      "created_utc": 1733361413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0hxuma",
      "author": "None",
      "body": "I guess the same reason why you see a lot of obese and overweight binge eaters walking around.. Because we all have our struggles, right? Lmao\n\nPeople get shamed for being skinny, I hardly see a skinny person in public, let alone one that looks “sickly”.. I’m probably the only one with this POV though🤷🏼‍♀️",
      "created_utc": 1733377507.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0iksps",
      "author": "None",
      "body": "I honestly feel like vaping has really influenced it. Since vaping causes a significant decline in appetite + more youth are vaping = more youth are not taking care of their bodies :(",
      "created_utc": 1733391650.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0k6r7n",
      "author": "berryfriddles",
      "body": "When I was very young I saw a PETA propaganda movie and it made me go vegetarian. Then, I was told that it wasn't enough and I went Vegan. Then, I noticed I had lost a significant amount of weight and my family started being so much nicer to me. \nAnd little by little I spiraled into a full-on ED. It took so much will power to get back into not being afraid of food. \nTo this day its really hard for me to just not-think about what I'm eating, but at least now I'm eating. \nSo, I'm not saying PETA gave me anorexia, but they sure as hell started the chain reaction.",
      "created_utc": 1733416529.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0m5uru",
      "author": "None",
      "body": "Society! So much pressure on being thin at a young age.",
      "created_utc": 1733438581.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0lkij7",
      "author": "areydellan",
      "body": "I downloaded the anorexia pdf from the internet after seeing an increased popularity in low rise jeans as well as noticing how the 2000s skinny seemed to have come back. I'm joking I just wanna be skinny.",
      "created_utc": 1733431845.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m0gp0wm",
      "author": "jessiecolborne",
      "body": "This is exactly how mine started in 2020. I've always had body image issues but trying to lose extra weight during the pandemic lead to the obsession.",
      "created_utc": 1733359742.0,
      "score": 24,
      "context": [
        {
          "id": "m0gft92",
          "author": "w1tchyb1tchy-",
          "body": "I had a history of mental illness, hospitalizations not related to EDs at all, and was overweight at one point and decided to lose weight, at first it was healthy. However somewhere along the way it became an obsession and I was fixated on it, even once I was at a healthy weight I just couldnt stop. I cant remember when the lines started to blur but I believe I was already susceptible to developing an ED because of my medical history and losing weight just triggered that course of events.",
          "created_utc": 1733356458.0
        }
      ]
    },
    {
      "id": "m0ghg2n",
      "author": "Rhyme_orange_",
      "body": "Oh geez I’m so sorry. Thank you for explaining this to me. That sounds very similar to my experience as well. How are you doing now?",
      "created_utc": 1733357032.0,
      "score": 8,
      "context": [
        {
          "id": "m0gft92",
          "author": "w1tchyb1tchy-",
          "body": "I had a history of mental illness, hospitalizations not related to EDs at all, and was overweight at one point and decided to lose weight, at first it was healthy. However somewhere along the way it became an obsession and I was fixated on it, even once I was at a healthy weight I just couldnt stop. I cant remember when the lines started to blur but I believe I was already susceptible to developing an ED because of my medical history and losing weight just triggered that course of events.",
          "created_utc": 1733356458.0
        }
      ]
    },
    {
      "id": "m0iw70m",
      "author": "mouse-bites",
      "body": "I try to say this all the time. Anorexia is not a common disease. Everyone’s version of reality and what’s “cool” is totally based on how the algorithm feeds you content.",
      "created_utc": 1733398889.0,
      "score": 10,
      "context": [
        {
          "id": "m0gla0c",
          "author": "throwawayforlemoi",
          "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
          "created_utc": 1733358399.0
        }
      ]
    },
    {
      "id": "m0gt6sb",
      "author": "lemonlovelimes",
      "body": "I think it’s also important to recognize that some people don’t get diagnoses due to lack of health insurance, other barriers to care, and systemic anti-fat bias. \nWe are also in the cultural return to obsession over skinniness so unfortunately the official rates would miss more folks who would benefit from diagnoses.",
      "created_utc": 1733361222.0,
      "score": 35,
      "context": [
        {
          "id": "m0gla0c",
          "author": "throwawayforlemoi",
          "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
          "created_utc": 1733358399.0
        }
      ]
    },
    {
      "id": "m0h91a8",
      "author": "brownguyinthecorner",
      "body": "Facts",
      "created_utc": 1733366947.0,
      "score": 3,
      "context": [
        {
          "id": "m0gla0c",
          "author": "throwawayforlemoi",
          "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
          "created_utc": 1733358399.0
        }
      ]
    },
    {
      "id": "m0p45f8",
      "author": "NaiveRatio4705",
      "body": "I don’t think them using the word “popular” is a bad word choice as it’s pretty much trending on social media. Tik tok is full of “thin-spo” and skinny goal BS. I have seen multiple posts on Reddit in different subs that have nothing to do with ED about how this type of content is popping up quite frequently.",
      "created_utc": 1733487894.0,
      "score": 3,
      "context": [
        {
          "id": "m0gla0c",
          "author": "throwawayforlemoi",
          "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
          "created_utc": 1733358399.0
        }
      ]
    },
    {
      "id": "m0gyww6",
      "author": "Necessary-News-4006",
      "body": "I would say it is popular indeed, because it is “sold” as the perfect body, and people try to buy it. But I agree that is a mental illness, sometimes related to depression and body dysmorphia",
      "created_utc": 1733363246.0,
      "score": 13,
      "context": [
        {
          "id": "m0gla0c",
          "author": "throwawayforlemoi",
          "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
          "created_utc": 1733358399.0
        }
      ]
    },
    {
      "id": "m0p4c64",
      "author": "NaiveRatio4705",
      "body": "Great comment. I agree with every single point.",
      "created_utc": 1733487986.0,
      "score": 1,
      "context": [
        {
          "id": "m0hq9dk",
          "author": "pebblesandmarbless",
          "body": "Binge eating disorder is actually the most common eating disorder. I think it might seem like more people have anorexia because it’s generally more societally accepted to be underweight than overweight. There’s a lot more shame around binging (and purging) behaviors so it’s not as widely talked about because of how it’s viewed by most people. On the other hand, weight loss is usually praised and complimented. It’s all really fucked up",
          "created_utc": 1733373901.0
        }
      ]
    },
    {
      "id": "m0kpm8r",
      "author": "Rhyme_orange_",
      "body": "This is true to my knowledge. It’s so hard and I don’t agree with societal norms. I hesitate to even post this but I have a therapist who struggles with binge/purge and even this I don’t think should be judged as anything but a disordered mentality as well.",
      "created_utc": 1733422283.0,
      "score": 1,
      "context": [
        {
          "id": "m0hq9dk",
          "author": "pebblesandmarbless",
          "body": "Binge eating disorder is actually the most common eating disorder. I think it might seem like more people have anorexia because it’s generally more societally accepted to be underweight than overweight. There’s a lot more shame around binging (and purging) behaviors so it’s not as widely talked about because of how it’s viewed by most people. On the other hand, weight loss is usually praised and complimented. It’s all really fucked up",
          "created_utc": 1733373901.0
        }
      ]
    },
    {
      "id": "m0gzxzt",
      "author": "Rhyme_orange_",
      "body": "Yeah that sounds right to me. I’m sorry that we’re struggling I’m only trying to understand in a poorly worded way ya know? I just didn’t realize how many of us there were, and I know I’m soooo late and all but it makes sense too. Please be good to yourself.",
      "created_utc": 1733363611.0,
      "score": 4,
      "context": [
        {
          "id": "m0gjnom",
          "author": "KristiSoko",
          "body": "I think with the rise of communication technology, we hear there’s more people like us as opposed to being in a cave in a third world country thinking you’re the only one that has something wrong with you",
          "created_utc": 1733357824.0
        }
      ]
    },
    {
      "id": "m0kpwyf",
      "author": "Rhyme_orange_",
      "body": "I’m so happy for you two! That’s an amazing story and so inspiring. I’m grateful for you. I totally can understand that feeling of it being almost addictive like a symptom of a medication almost?",
      "created_utc": 1733422376.0,
      "score": 2,
      "context": [
        {
          "id": "m0hxy5y",
          "author": "spicytexan",
          "body": "I think it’s because it’s relatively easy to hide. At least initially. I was able to brush it off as though my medication finally worked for me and I stopped “stress eating.” In reality the truth was I was suffering from major pre-loss grief when my mom was diagnosed with stage IV breast cancer and felt like the only thing I *could* control was what I ate. \n\nWhen the weight started shedding—quickly—it was like an addiction to something that felt “successful” in a way. I was good at eating just enough in front of people to not raise suspicions but really I was basically not eating anything. I’m currently less than a year recovered right now and pregnant with our first child. I still have urges to restrict because of how I feel in a body bigger than I’ve ever had. But I work hard to remind myself that if I don’t eat, our son won’t eat, and that’s a terrifying thought I refuse to give into. So far we’re both healthy and hope it only continues!",
          "created_utc": 1733377557.0
        }
      ]
    },
    {
      "id": "m0h1nn0",
      "author": "Rhyme_orange_",
      "body": "I’m so sorry friend. Same here sadly. It’s been 15 years for me and mostly my weight loss is due to a methadone taper. I’m worried about my boyfriend right now though.",
      "created_utc": 1733364236.0,
      "score": 2,
      "context": [
        {
          "id": "m0gyypg",
          "author": "crisebdl",
          "body": "I was always thinner, and society rewarded me for it. When I got to puberty and my body began to change, I couldn’t cope with the idea of not having the « right » body anymore. It’s been 16 years and I still am unable to recover.",
          "created_utc": 1733363264.0
        }
      ]
    },
    {
      "id": "m0kqe25",
      "author": "Rhyme_orange_",
      "body": "Yes this too. Thank you.",
      "created_utc": 1733422520.0,
      "score": 1,
      "context": [
        {
          "id": "m0h3rzt",
          "author": "unnamedfae",
          "body": "Idk if its popular or you're just in a corner of the world wide web tm where we all gather",
          "created_utc": 1733365018.0
        }
      ]
    },
    {
      "id": "m0ghmnk",
      "author": "Rhyme_orange_",
      "body": "Well I don’t know I just am asking a question on Reddit. I don’t think it’s a trend but it is a whole community here isn’t it? And we’re all following this community every day?",
      "created_utc": 1733357098.0,
      "score": -36,
      "context": [
        {
          "id": "m0ggzk4",
          "author": "alienprincess111",
          "body": "The way you phrase the question makes it sound like anorexia is a choice or a trend. It is not! It is a mental disease.",
          "created_utc": 1733356870.0
        }
      ]
    },
    {
      "id": "m0kqnjr",
      "author": "Rhyme_orange_",
      "body": "Yeah I think so. It’s a difficult mental illness that seems to be a walking contradiction right? Like the more I lose the more I don’t win. So sorry I don’t mean to trigger anyone.",
      "created_utc": 1733422600.0,
      "score": 3,
      "context": [
        {
          "id": "m0ida18",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733386569.0
        }
      ]
    },
    {
      "id": "m0kp95j",
      "author": "Rhyme_orange_",
      "body": "Same here. I’m sorry yo. It’s so competitive and no matter what we always lose. However I’m still proud of you for being here at all.",
      "created_utc": 1733422175.0,
      "score": 1,
      "context": [
        {
          "id": "m0hyjir",
          "author": "sbrown_13",
          "body": "It’s not popular. It’s a bloody death sentence. I wouldn’t wish this disease on my worst enemy…",
          "created_utc": 1733377867.0
        }
      ]
    },
    {
      "id": "m0h0igw",
      "author": "Rhyme_orange_",
      "body": "Yeah I agree with you. Thanks for helping me to understand.",
      "created_utc": 1733363819.0,
      "score": 7,
      "context": [
        {
          "id": "m0gms2r",
          "author": "None",
          "body": "I don't think it's 'popular' but its an illness that can be difficult to hide. People notice when someone has a peculiar or different diet or eating habits, out of the ordinary obsessive compulsions, if they exercise a lot or if their weight decreases. The insecurities and depression can lead a lot of sufferers to feel isolated and they want to discuss all these confusing thoughts online where it feels safe and you don't feel so alone or weird. I think thats why communities about eating disorders thrive (in healthy and unhealthy ways) because it is so isolating in the real world.",
          "created_utc": 1733358935.0
        }
      ]
    },
    {
      "id": "m0gk6qt",
      "author": "Rhyme_orange_",
      "body": "Hey, I’m so sorry and thanks for taking the time to explain this to me. I totally feel for you and with you. It started for me too around that age. Did you also start dissociation around that time too?",
      "created_utc": 1733358011.0,
      "score": 2,
      "context": [
        {
          "id": "m0gibep",
          "author": "BookishBeauty_",
          "body": "For me it started with wanting to look like everyone else in my class when I was 12, I noticed how much bigger I was than everyone else. Since then it's evolved, I've been through multiple 'recoveries', I guess now I'm in my 20s it comes more from a place of control? Idk my relationship with food has been so messed up since I was so young that I'm not sure I even know how to live without some form of an ED. I also have a lot of other mental health issues and everything just kind of bunched into one big ball of issues lol. If I could choose to be normal I would, cos man it sucks",
          "created_utc": 1733357343.0
        }
      ]
    },
    {
      "id": "m0icl6w",
      "author": "zillabirdblue",
      "body": "The percentage is actually a lot smaller.",
      "created_utc": 1733386109.0,
      "score": 4,
      "context": [
        {
          "id": "m0h3vo1",
          "author": "jun3_bugz",
          "body": "well it’s not. It makes up only 5% of eating disorders. Remember as anorexics we do as humans create our own echo chambers. it is still a rare mental disorder",
          "created_utc": 1733365056.0
        }
      ]
    },
    {
      "id": "m0kuibt",
      "author": "Rhyme_orange_",
      "body": "That makes sense. What about ARFID?",
      "created_utc": 1733423768.0,
      "score": 1,
      "context": [
        {
          "id": "m0i4aal",
          "author": "Rectangular_Bird",
          "body": "It is quite a rare eating disorder actually. Ednos and disordered eating are way more common.",
          "created_utc": 1733381029.0
        }
      ]
    },
    {
      "id": "m0ks7f5",
      "author": "Rhyme_orange_",
      "body": "Hey, I’m so sorry to hear all that. That’s SO MUCH for any one person to ever have to go through. I can’t offer you much advice. Only that you’re not alone. \n     My dad was diagnosed with pancreatic cancer my sophomore year of hs. My parents stopped verbally abusing each other only then. My little sister learned to cut. I learned how to restrict then binge and over exercise. My dad was given a few months to live. I slipped up more and got into his anti anxiety pills. \n      Fast forward to now and I’ve still been struggling with anorexia. Im a clean addict. My dad’s alive somewhere, happy even. But I lost him and he doesn’t want to reconnect. My sister maybe one day. Im on probation and after five psychotic breakdowns and a seizure last week im lucky just to be alive. \nThis disorder takes everything from us. I f****ing hate Ana and yet I don’t know how to live without her and I’m sorry for the venting. Just know you’re not alone.",
      "created_utc": 1733423069.0,
      "score": 1,
      "context": [
        {
          "id": "m0hc5ch",
          "author": "Autam",
          "body": "I don’t think it’s AN that’s “popular”. It’s more so that the method they use, restricting foods, is. Lots of people have disordered eating or have done extreme diets but don’t have an eating disorder.\n\nFor me it came late. I grew up with my AN grandmother and obese mother. My grandma was always telling me I need to eat less and “boys won’t like you if you eat” (I was already right above underweight), while my mom was constantly talking about how fat and ugly she was and that she’s worthless because of it. I had bad body image but didn’t really do much about it. Then I got my first job and started binging on food like crazy. Gained weight and that just made my imagine worse. I definitely already had disordered eating mostly from anxiety and depression long before this too.\n\nIt wasn’t until I was 20 and me and my fiancé split after he cheated 13 times, my best friend died, and I fell into such a huge depression I just stopped eating basically. My grandma would tell me she was so proud and I looked great constantly after I started losing from this, and my mom would tell me how jealous she was of how small I was. It felt good, so even after I started feeling better, I continued to restricted and it became the only thing I cared about or would make me feel good about myself. I recovered, then a few years later developed an alcohol addiction and once I was out of that I relapsed. One of the things that was keeping me from drinking again was telling myself how much calories were in it and that drinking makes you gain weight like crazy. Still stuck in that relapse at 27 now",
          "created_utc": 1733368100.0
        }
      ]
    },
    {
      "id": "m0icr00",
      "author": "zillabirdblue",
      "body": "It’s like people feel sorry for someone with anorexia but are disgusted by those with BED.",
      "created_utc": 1733386217.0,
      "score": 4,
      "context": [
        {
          "id": "m0hvdy0",
          "author": "Vegetable-Try9263",
          "body": "I think it’s the IDEA of anorexia that’s popular, mostly because of how society and so many people value thinness in general. Thinness isn’t just perceived as a physical trait, it’s also seen as a virtue. I think this is why AN is perceived SO differently on a societal level compared to any other eating disorder.\n\nWhen most people think of AN, the first thing that comes to mind isn’t that it’s a debilitating mental illness. Most people just think that anorexia means that someone has successfully made themselves very very thin. A lot of people just see restriction as a means to an end, and that it takes a lot of self-discipline and suffering to reach this “ideal” body type. Anorexia is alluring to people in a way that other eating disorders generally aren’t.",
          "created_utc": 1733376276.0
        }
      ]
    },
    {
      "id": "m0ksex5",
      "author": "Rhyme_orange_",
      "body": "Unfortunately this seems right. I agree.",
      "created_utc": 1733423132.0,
      "score": 2,
      "context": [
        {
          "id": "m0hvdy0",
          "author": "Vegetable-Try9263",
          "body": "I think it’s the IDEA of anorexia that’s popular, mostly because of how society and so many people value thinness in general. Thinness isn’t just perceived as a physical trait, it’s also seen as a virtue. I think this is why AN is perceived SO differently on a societal level compared to any other eating disorder.\n\nWhen most people think of AN, the first thing that comes to mind isn’t that it’s a debilitating mental illness. Most people just think that anorexia means that someone has successfully made themselves very very thin. A lot of people just see restriction as a means to an end, and that it takes a lot of self-discipline and suffering to reach this “ideal” body type. Anorexia is alluring to people in a way that other eating disorders generally aren’t.",
          "created_utc": 1733376276.0
        }
      ]
    },
    {
      "id": "m0gz836",
      "author": "Rhyme_orange_",
      "body": "I’m almost 29F, and just was re-diagnosed this month. I’m so sorry about your father, that’s so hard and not fair to you. What else could you have done? I can’t imagine and I hope you have better support now. I’m dealing with addiction and disassociation which I’m just finding out about. It’s so much huh? How are you doing now?",
      "created_utc": 1733363356.0,
      "score": 1,
      "context": [
        {
          "id": "m0golva",
          "author": "gingerkitttie",
          "body": "Im 25F & growing up chronically online & with no parental supervision & being called fat by my orthorexic father, I would go online and look up quick ways to loose weight and I just kinda fell in the hole at age 13. It later progressed to bulimia. \nFrom my experience, back in the 2010s, thigh gaps & chain smoking instead of eating seemed to be glorified on the side of social media & forums I was on. I've heard of lots of people my age who had dang near the same exact experience as I. Of course with added on mental illness I was not aware of at the time, which may have been the case for most as well. \nIt's just wanting to lose a little, then it progressed and became an obsession & it was kind of socially acceptable & when I tried to get better it was a challenge. I'm about 3 years clean thankfully, but it did take a while..",
          "created_utc": 1733359592.0
        }
      ]
    },
    {
      "id": "m0gyqk1",
      "author": "Rhyme_orange_",
      "body": "Sorry I could have worded it differently but it does seem to speak to a lot of people right now right?",
      "created_utc": 1733363184.0,
      "score": 0,
      "context": [
        {
          "id": "m0gpsqi",
          "author": "Excellent-World-476",
          "body": "It’s a mental illness not a fad.  That’s like asking why is high blood pressure so popular.",
          "created_utc": 1733360019.0
        }
      ]
    },
    {
      "id": "m0ku1js",
      "author": "Rhyme_orange_",
      "body": "Same here. I’m sorry you’re struggling with this too. It’s such an endless struggle every day. Do you have treatment options?",
      "created_utc": 1733423627.0,
      "score": 1,
      "context": [
        {
          "id": "m0hl71x",
          "author": "j_p96",
          "body": "Not sure why it’s so popular (other than societal standards and all of that, which sucks). I personally feel that my anorexia developed mainly from my own “expectations” of myself, how I *should look*, etc. and an overwhelming feeling of lack of control over my own life, emotions, behaviors… absolutely everything. My disordered eating started when I was a preteen and has now advanced to anorexia 10+ years later. \n\nI do want recovery in order to feel better physically, but I do not want recovery due to the mental challenges along the way. I have tried and it consumed *all* of my energy, emotionally and physically. I believe the people trying to help me were not the “right” people. Idk.",
          "created_utc": 1733371702.0
        }
      ]
    },
    {
      "id": "m0kuef5",
      "author": "Rhyme_orange_",
      "body": "I think that’s actually a good thing in a way. Depending on how you want to look at it. I guess this disorder has cost me everything almost except my own life. And that might just be a matter of time before it gets worse. I don’t know what to do. I’ve been inpatient and I don’t know if it will help.",
      "created_utc": 1733423735.0,
      "score": 1,
      "context": [
        {
          "id": "m0hqu94",
          "author": "skintbinch",
          "body": "they were always reasonably prevalent, they’re just easier to see now because people aren’t being hidden away as a sign of shame by their families, people aren’t more open to talking about this stuff and we’re in the digital age so we can connect with each other despite being a very small subset of the general population.",
          "created_utc": 1733374162.0
        }
      ]
    },
    {
      "id": "m0kuzow",
      "author": "Rhyme_orange_",
      "body": "Well thank God. I’m so grateful for you. You give me hope for myself and my boyfriend. I’m worried about him but I don’t know how to bring it up to him. Do you have any advice? (We’re both tapering off methadone and have lost weight from that. However I am the one who has time for therapy etc… any advice would be crucial at this point.)",
      "created_utc": 1733423916.0,
      "score": 2,
      "context": [
        {
          "id": "m0i81wq",
          "author": "Dunkleosteus666",
          "body": "Popular? Depends. Youre are unlucky if predisposed, lucky if diagnosed and even luckier if recivered. Some never do. Death rate is high. And many comorbidities (in my case, diagnosed adh, suspected aspergers, + substance abuse).\n\n I was unlucky to one of the few males which had anorexia (+ selfcutting), but it diagnosed, treated, and i recovered. 12-13M, it was 13 years ago, dont wish that to my worst enemy. Still struggled with (poly) substance abuse, but nothing gripped my mind and distorted reality as hard as anorexia did. If my parents hadnt forced an intervention i would have likely died because i lost weight ver, very fast (+ compulsive physical exertion). \n\nIts not a choice. Its not fancy. Its cruel, disgusting and takes everything from you.Wish i didnt have to write this. Same as addiction or depression or schizophrenia, its not a choice.\n\nIm not a doctor, but from what ive read the reasons diagnoses surged (absolute and relative) is because 1) psychiatrist etc get better at diagnosing and recognizing early stages 2) taboo to talk about mental health disappears. Its not really becoming more prevalent but science gets better.\n\nedit: Finishing my M.Sc. in Biology now, 13 years later. Addiction issues but hey theres light at the end of the tunnel.",
          "created_utc": 1733383256.0
        }
      ]
    },
    {
      "id": "m0kv18m",
      "author": "Rhyme_orange_",
      "body": "How would you have worded it??",
      "created_utc": 1733423929.0,
      "score": 0,
      "context": [
        {
          "id": "m0iitnb",
          "author": "Cautious_Effort8014",
          "body": "popular is not a great choice of words",
          "created_utc": 1733390300.0
        }
      ]
    },
    {
      "id": "m0lgl8o",
      "author": "Rhyme_orange_",
      "body": "Oh geez that makes sense. That’s so unfortunate and unfair. You don’t deserve that. I’m sorry how are you doing now?",
      "created_utc": 1733430616.0,
      "score": 1,
      "context": [
        {
          "id": "m0ku2kw",
          "author": "Temporary-Chef4663",
          "body": "For me, genetics. My mom and brother both had bad EDs. And I tried focusing the obsession and control on the gym, but I ended up gaining weight from muscle and tons of protein and cals so I flipped.",
          "created_utc": 1733423635.0
        }
      ]
    },
    {
      "id": "m0lgejs",
      "author": "Rhyme_orange_",
      "body": "Same here. I’m lucky in a sense because I can’t make myself purge. I guess it depends on the definition of ‘purge’ as I over-exercised in a compensatory way when I used to binge after restriction. Now though it’s at a whole different level. It’s like a novel competition that I’m competing against myself daily and know I’m only going to lose more. More weight. More time. Struggle. I don’t know what else to do as I don’t know my own weight. And I need to be outpatient for probation UAs, at least until my birthday. Maybe it’s worth getting a scale to just monitor it in case?",
      "created_utc": 1733430558.0,
      "score": 1,
      "context": [
        {
          "id": "m0kv9n1",
          "author": "Rough_Ad2102",
          "body": "I fell down the rabbit hole as a teen who was just trying to lose a few kgs. Even though I was never very overweight, I noticed how much better I was treated as I continued losing and somewhere along the way it became an obsession. Pretty cliche but here we are like 9 years later lol",
          "created_utc": 1733424000.0
        }
      ]
    },
    {
      "id": "m0h1hzf",
      "author": "Rhyme_orange_",
      "body": "I’m so sorry, that’s so much to struggle with. It makes sense too but that doesn’t mean you deserve that. You’re worth so much more than your body. I believe in you. Have you looked into therapy yet?",
      "created_utc": 1733364178.0,
      "score": 2,
      "context": [
        {
          "id": "m0gvky2",
          "author": "Deepspacechris",
          "body": "After years and years of mental issues it all peaked when I saw that my marriage and personal life was failing, and in an attempt to regain some control of my life, dieting became an obsession. Probably because the only thing you can really have some sort of control over is exactly that; your own body. Fast forward a couple of months and it’s all I can think about, and now, a couple of years later, I’m deep in and honestly I see no way out without any drastic change in my life.",
          "created_utc": 1733362071.0
        }
      ]
    },
    {
      "id": "m0kvatg",
      "author": "Rhyme_orange_",
      "body": "Ugh really? This sucks. I don’t even know what a healthy body is anymore yo.",
      "created_utc": 1733424010.0,
      "score": 1,
      "context": [
        {
          "id": "m0hdg1q",
          "author": "ThrowRA-sicksad",
          "body": "Because we live in a fatphobic bodyshaming society that tells us we’re disgusting for having healthy bodies.",
          "created_utc": 1733368595.0
        }
      ]
    },
    {
      "id": "m0gyez5",
      "author": "Rhyme_orange_",
      "body": "Oh ok gotcha. Yeah that makes sense to me too.",
      "created_utc": 1733363071.0,
      "score": 1,
      "context": [
        {
          "id": "m0gqlj4",
          "author": "themostdownbad",
          "body": "It’s undeniably glorified in the media for women. High fashion runway models are the most popular example.",
          "created_utc": 1733360306.0
        }
      ]
    },
    {
      "id": "m0gybom",
      "author": "Rhyme_orange_",
      "body": "Hey thanks so much for commenting. It seems to be everywhere if we join the community you know?",
      "created_utc": 1733363038.0,
      "score": 1,
      "context": [
        {
          "id": "m0gt004",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733361154.0
        }
      ]
    },
    {
      "id": "m12qjnl",
      "author": "Rhyme_orange_",
      "body": "I’m so sorry but anyone can be anorexic at any weight.",
      "created_utc": 1733685882.0,
      "score": 1,
      "context": [
        {
          "id": "m11tptx",
          "author": "CommercialMachine920",
          "body": "I suffer from obesity, i wish i were anorexic, they are so cool to me, i admire them.",
          "created_utc": 1733675661.0
        }
      ]
    },
    {
      "id": "m0h1uq9",
      "author": "Rhyme_orange_",
      "body": "Really? I’ve stopped using all social media forms other than Reddit right now. Yeah I could follow more communities on Reddit, I am just doing the best I can though.",
      "created_utc": 1733364309.0,
      "score": 2,
      "context": [
        {
          "id": "m0gznds",
          "author": "I_Love_Pride",
          "body": "A main reason is because of how much fatphobia there is in our society (especially on the internet)",
          "created_utc": 1733363506.0
        }
      ]
    },
    {
      "id": "m0h145d",
      "author": "Rhyme_orange_",
      "body": "I so agree with you. I’m sorry for my wording but I’m just trying to better understand for my partner and myself. It’s a stupid scary disorder and I’ve been a part of this community for a while now. I just learned last week I disassociate and don’t know what to do anymore ya know?",
      "created_utc": 1733364035.0,
      "score": 2,
      "context": [
        {
          "id": "m0gtq2e",
          "author": "None",
          "body": "I definitely get what you meant with 'popular' even though it might not be the best choice of wording it :p\nIn my opinion social media is to blame. These days I open twitter or any social media and easily find disturbing content, it didn't use to be like this. When I was younger I could find it online but I had to dig if it makes any sense. Last year I found out there's a community on twitter and it was awful, it seems as if it's only getting worse each day. To be clear, I don't blame these people and for what I've seen they're teens. I get incredibly sad though when I think about everything they are going through.\n\nEvery now and then there's a new trend on tiktok that makes me baffle and it's so normalized. The fatphobia and bodyshaming, the bodychecking...it's all so sad.",
          "created_utc": 1733361413.0
        }
      ]
    },
    {
      "id": "m0kvyjr",
      "author": "Rhyme_orange_",
      "body": "I can understand this. I feel like this disorder is over-glamorized and to those of us out there who have been struggling with this for years and years, it’s not even worthwhile at a certain point. But it does exist and those who are diagnosed also need to be careful as to when and how much they shed light on this controversial topic.",
      "created_utc": 1733424210.0,
      "score": 1,
      "context": [
        {
          "id": "m0hxuma",
          "author": "None",
          "body": "I guess the same reason why you see a lot of obese and overweight binge eaters walking around.. Because we all have our struggles, right? Lmao\n\nPeople get shamed for being skinny, I hardly see a skinny person in public, let alone one that looks “sickly”.. I’m probably the only one with this POV though🤷🏼‍♀️",
          "created_utc": 1733377507.0
        }
      ]
    },
    {
      "id": "m0kw0ld",
      "author": "Rhyme_orange_",
      "body": "Whoa totally agreed yes!",
      "created_utc": 1733424228.0,
      "score": 1,
      "context": [
        {
          "id": "m0iksps",
          "author": "None",
          "body": "I honestly feel like vaping has really influenced it. Since vaping causes a significant decline in appetite + more youth are vaping = more youth are not taking care of their bodies :(",
          "created_utc": 1733391650.0
        }
      ]
    },
    {
      "id": "m0kw9j7",
      "author": "Rhyme_orange_",
      "body": "Wow, that sounds very similar in a way to myself. I went vegan and then keto. But then it gets out of control and I don’t know what I’m doing anymore. It’s like an addiction to competition.",
      "created_utc": 1733424305.0,
      "score": 2,
      "context": [
        {
          "id": "m0k6r7n",
          "author": "berryfriddles",
          "body": "When I was very young I saw a PETA propaganda movie and it made me go vegetarian. Then, I was told that it wasn't enough and I went Vegan. Then, I noticed I had lost a significant amount of weight and my family started being so much nicer to me. \nAnd little by little I spiraled into a full-on ED. It took so much will power to get back into not being afraid of food. \nTo this day its really hard for me to just not-think about what I'm eating, but at least now I'm eating. \nSo, I'm not saying PETA gave me anorexia, but they sure as hell started the chain reaction.",
          "created_utc": 1733416529.0
        }
      ]
    },
    {
      "id": "m0gqc3d",
      "author": "w1tchyb1tchy-",
      "body": "Ive definitely been worse than I am now for sure. I am maintaining the lower end of a healthy weight, but I just recently got my period back after it being absent for around 6-8 months. I do have periods of restriction still that I do bounce back from, and its still a mental battle every day. But maintaining is better than losing ☺️ having a support system has been a big role in making the steps towards recovery as well!",
      "created_utc": 1733360211.0,
      "score": 5,
      "context": [
        {
          "id": "m0gft92",
          "author": "w1tchyb1tchy-",
          "body": "I had a history of mental illness, hospitalizations not related to EDs at all, and was overweight at one point and decided to lose weight, at first it was healthy. However somewhere along the way it became an obsession and I was fixated on it, even once I was at a healthy weight I just couldnt stop. I cant remember when the lines started to blur but I believe I was already susceptible to developing an ED because of my medical history and losing weight just triggered that course of events.",
          "created_utc": 1733356458.0
        },
        {
          "id": "m0ghg2n",
          "author": "Rhyme_orange_",
          "body": "Oh geez I’m so sorry. Thank you for explaining this to me. That sounds very similar to my experience as well. How are you doing now?",
          "created_utc": 1733357032.0
        }
      ]
    },
    {
      "id": "m0kox4i",
      "author": "Rhyme_orange_",
      "body": "So well stated thank you for saying this. Agreed.",
      "created_utc": 1733422072.0,
      "score": 2,
      "context": [
        {
          "id": "m0gla0c",
          "author": "throwawayforlemoi",
          "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
          "created_utc": 1733358399.0
        },
        {
          "id": "m0iw70m",
          "author": "mouse-bites",
          "body": "I try to say this all the time. Anorexia is not a common disease. Everyone’s version of reality and what’s “cool” is totally based on how the algorithm feeds you content.",
          "created_utc": 1733398889.0
        }
      ]
    },
    {
      "id": "m0ijehf",
      "author": "fuschiaoctopus",
      "body": "The lifetime rates weren't calculated in the last 5 months, those stats go back longer than this random obsession with insisting we're in some intense heroin chic era where everyone is wasting away despite the fact that statistically 2/3 of the *entire* US population is medically overweight and almost half are obese. If people got off insta, went outside, and looked around at what people really look like, I know they wouldn't be seeing that. AN is not all that common, especially not in our obesogenic society. \n\nNote that they also said prevalence of AN specifically, not eds in general. The other eds are much more common, with ednos making up the biggest percentage by far iirc. I don't know if they include atypical AN in that statistic since it is under the EDNOS umbrella but as upsetting as it is, I personally think it is best to go off professional diagnoses for an attempt at a statistic like that (which will never be perfectly accurate anyway) rather than going off self reported polls that include self diagnosers, people that simply don't meet the diagnostic criteria, people that crash dieted a week before prom and talk the rest of their life about that \"time they were anorexic\", etc. You wouldn't get accurate results, especially since AN is put on a pedestal compared to other eds so a significant portion of people who clinically fit the diagnostic criteria for a different ed would likely self report AN instead, especially ednos sufferers, and especially ones that aren't professionally diagnosed.",
      "created_utc": 1733390690.0,
      "score": 15,
      "context": [
        {
          "id": "m0gla0c",
          "author": "throwawayforlemoi",
          "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
          "created_utc": 1733358399.0
        },
        {
          "id": "m0gt6sb",
          "author": "lemonlovelimes",
          "body": "I think it’s also important to recognize that some people don’t get diagnoses due to lack of health insurance, other barriers to care, and systemic anti-fat bias. \nWe are also in the cultural return to obsession over skinniness so unfortunately the official rates would miss more folks who would benefit from diagnoses.",
          "created_utc": 1733361222.0
        }
      ]
    },
    {
      "id": "m0h04eg",
      "author": "Rhyme_orange_",
      "body": "I agree with you. I’m sorry and yes I could’ve worded my question better. I’m just trying to better understand this disorder for myself and my boyfriend.",
      "created_utc": 1733363676.0,
      "score": 9,
      "context": [
        {
          "id": "m0gla0c",
          "author": "throwawayforlemoi",
          "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
          "created_utc": 1733358399.0
        },
        {
          "id": "m0gt6sb",
          "author": "lemonlovelimes",
          "body": "I think it’s also important to recognize that some people don’t get diagnoses due to lack of health insurance, other barriers to care, and systemic anti-fat bias. \nWe are also in the cultural return to obsession over skinniness so unfortunately the official rates would miss more folks who would benefit from diagnoses.",
          "created_utc": 1733361222.0
        }
      ]
    },
    {
      "id": "m0hfkqn",
      "author": "AdBeautiful3783",
      "body": "Agreed. I suppose it's popular in the sense that it receives a lot of media coverage and it is very common in the entertainment industry (not to mention celebrities' bodies with ana eg models are often glorified for the same reason mentioned) so the amount of press that ana gets compared to other EDs is very skewed",
      "created_utc": 1733369423.0,
      "score": 10,
      "context": [
        {
          "id": "m0gla0c",
          "author": "throwawayforlemoi",
          "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
          "created_utc": 1733358399.0
        },
        {
          "id": "m0gyww6",
          "author": "Necessary-News-4006",
          "body": "I would say it is popular indeed, because it is “sold” as the perfect body, and people try to buy it. But I agree that is a mental illness, sometimes related to depression and body dysmorphia",
          "created_utc": 1733363246.0
        }
      ]
    },
    {
      "id": "m0h0b14",
      "author": "Rhyme_orange_",
      "body": "Thank you for this SO MUCH. You said it friend. You’re literally the first person to even mention body dysmorphia at all today and I’ve been lurking all day on Reddit. Do you think body dysmorphia has any relation to disassociation?",
      "created_utc": 1733363743.0,
      "score": 0,
      "context": [
        {
          "id": "m0gla0c",
          "author": "throwawayforlemoi",
          "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
          "created_utc": 1733358399.0
        },
        {
          "id": "m0gyww6",
          "author": "Necessary-News-4006",
          "body": "I would say it is popular indeed, because it is “sold” as the perfect body, and people try to buy it. But I agree that is a mental illness, sometimes related to depression and body dysmorphia",
          "created_utc": 1733363246.0
        }
      ]
    },
    {
      "id": "m0lejw9",
      "author": "starrymoonkitty",
      "body": "Wait what? Im sorry, your therapist isn’t actively struggling with an ED are they? I feel like that would be some sort of weird conflict of interest since you are in therapy trying to get help for that, not trigger it. Hope that makes sense",
      "created_utc": 1733429973.0,
      "score": 4,
      "context": [
        {
          "id": "m0hq9dk",
          "author": "pebblesandmarbless",
          "body": "Binge eating disorder is actually the most common eating disorder. I think it might seem like more people have anorexia because it’s generally more societally accepted to be underweight than overweight. There’s a lot more shame around binging (and purging) behaviors so it’s not as widely talked about because of how it’s viewed by most people. On the other hand, weight loss is usually praised and complimented. It’s all really fucked up",
          "created_utc": 1733373901.0
        },
        {
          "id": "m0kpm8r",
          "author": "Rhyme_orange_",
          "body": "This is true to my knowledge. It’s so hard and I don’t agree with societal norms. I hesitate to even post this but I have a therapist who struggles with binge/purge and even this I don’t think should be judged as anything but a disordered mentality as well.",
          "created_utc": 1733422283.0
        }
      ]
    },
    {
      "id": "m0l1dsz",
      "author": "spicytexan",
      "body": "My meds made it easier to lose my appetite at the time but when my doctor would ask me about it during our check-ups I would say I didn’t notice any change. I’m honestly surprised he didn’t notice the drastic weight loss at the time. But yes it absolutely did feel like a symptom at times.",
      "created_utc": 1733425880.0,
      "score": 2,
      "context": [
        {
          "id": "m0hxy5y",
          "author": "spicytexan",
          "body": "I think it’s because it’s relatively easy to hide. At least initially. I was able to brush it off as though my medication finally worked for me and I stopped “stress eating.” In reality the truth was I was suffering from major pre-loss grief when my mom was diagnosed with stage IV breast cancer and felt like the only thing I *could* control was what I ate. \n\nWhen the weight started shedding—quickly—it was like an addiction to something that felt “successful” in a way. I was good at eating just enough in front of people to not raise suspicions but really I was basically not eating anything. I’m currently less than a year recovered right now and pregnant with our first child. I still have urges to restrict because of how I feel in a body bigger than I’ve ever had. But I work hard to remind myself that if I don’t eat, our son won’t eat, and that’s a terrifying thought I refuse to give into. So far we’re both healthy and hope it only continues!",
          "created_utc": 1733377557.0
        },
        {
          "id": "m0kpwyf",
          "author": "Rhyme_orange_",
          "body": "I’m so happy for you two! That’s an amazing story and so inspiring. I’m grateful for you. I totally can understand that feeling of it being almost addictive like a symptom of a medication almost?",
          "created_utc": 1733422376.0
        }
      ]
    },
    {
      "id": "m2cl7v5",
      "author": "crisebdl",
      "body": "Méthadone is rough, good luck. Im also an ex opiates user x",
      "created_utc": 1734366747.0,
      "score": 2,
      "context": [
        {
          "id": "m0gyypg",
          "author": "crisebdl",
          "body": "I was always thinner, and society rewarded me for it. When I got to puberty and my body began to change, I couldn’t cope with the idea of not having the « right » body anymore. It’s been 16 years and I still am unable to recover.",
          "created_utc": 1733363264.0
        },
        {
          "id": "m0h1nn0",
          "author": "Rhyme_orange_",
          "body": "I’m so sorry friend. Same here sadly. It’s been 15 years for me and mostly my weight loss is due to a methadone taper. I’m worried about my boyfriend right now though.",
          "created_utc": 1733364236.0
        }
      ]
    },
    {
      "id": "m0gn6qy",
      "author": "redthumb",
      "body": "Because we can get help from those that know.  And we are able to talk about it without judgment",
      "created_utc": 1733359080.0,
      "score": 25,
      "context": [
        {
          "id": "m0ggzk4",
          "author": "alienprincess111",
          "body": "The way you phrase the question makes it sound like anorexia is a choice or a trend. It is not! It is a mental disease.",
          "created_utc": 1733356870.0
        },
        {
          "id": "m0ghmnk",
          "author": "Rhyme_orange_",
          "body": "Well I don’t know I just am asking a question on Reddit. I don’t think it’s a trend but it is a whole community here isn’t it? And we’re all following this community every day?",
          "created_utc": 1733357098.0
        }
      ]
    },
    {
      "id": "m0go23d",
      "author": "la_chancla360",
      "body": "Don't worry I understand what you mean, why is it very popular particularly with young women i suppose? I think for some like me it is a form of control. I have OCD and since I was little I didn't live a very stable childhood. Moving around, financial instabilities etc. I was taken advantage of as a very young girl by someone who was friends with my parents and I believe since then that was when I started developing an ED. I know a lot of women who develop all kinds of eating disorders after occurrences like that. It's kind of like feeling that you're finally in control of something in your life, especially over your own body",
      "created_utc": 1733359393.0,
      "score": 8,
      "context": [
        {
          "id": "m0ggzk4",
          "author": "alienprincess111",
          "body": "The way you phrase the question makes it sound like anorexia is a choice or a trend. It is not! It is a mental disease.",
          "created_utc": 1733356870.0
        },
        {
          "id": "m0ghmnk",
          "author": "Rhyme_orange_",
          "body": "Well I don’t know I just am asking a question on Reddit. I don’t think it’s a trend but it is a whole community here isn’t it? And we’re all following this community every day?",
          "created_utc": 1733357098.0
        }
      ]
    },
    {
      "id": "m0lggrz",
      "author": "sbrown_13",
      "body": "I’m proud of every single person who gets up each day like me and fights, hoping for a better life xx",
      "created_utc": 1733430578.0,
      "score": 2,
      "context": [
        {
          "id": "m0hyjir",
          "author": "sbrown_13",
          "body": "It’s not popular. It’s a bloody death sentence. I wouldn’t wish this disease on my worst enemy…",
          "created_utc": 1733377867.0
        },
        {
          "id": "m0kp95j",
          "author": "Rhyme_orange_",
          "body": "Same here. I’m sorry yo. It’s so competitive and no matter what we always lose. However I’m still proud of you for being here at all.",
          "created_utc": 1733422175.0
        }
      ]
    },
    {
      "id": "m0k66rq",
      "author": "BookishBeauty_",
      "body": "I did yeah, I've gotten better recently. It wasn't till I turned 21 that I kind of worked out how to help myself. I don't remember much from 13-18 to be honest, it's like a sea of fog. I guess as a coping mechanism my brain just went into survival mode. Now when I dissociate it's when I'm not doing great, mostly during depressive episodes. I think it's really common for everyone who struggles with an ED for it to begin at a young age. My first memory of realising it was an issue was around 13yrs old when my mum sat me down and cried about how one of her friends died from ana, it didn't help much but that was when I realised I probably had an ED. And ngl, I felt proud? Like I must be getting thinner if people are noticing. It's obviously a messed up way of thinking but it's all part of the illness lol",
      "created_utc": 1733416353.0,
      "score": 2,
      "context": [
        {
          "id": "m0gibep",
          "author": "BookishBeauty_",
          "body": "For me it started with wanting to look like everyone else in my class when I was 12, I noticed how much bigger I was than everyone else. Since then it's evolved, I've been through multiple 'recoveries', I guess now I'm in my 20s it comes more from a place of control? Idk my relationship with food has been so messed up since I was so young that I'm not sure I even know how to live without some form of an ED. I also have a lot of other mental health issues and everything just kind of bunched into one big ball of issues lol. If I could choose to be normal I would, cos man it sucks",
          "created_utc": 1733357343.0
        },
        {
          "id": "m0gk6qt",
          "author": "Rhyme_orange_",
          "body": "Hey, I’m so sorry and thanks for taking the time to explain this to me. I totally feel for you and with you. It started for me too around that age. Did you also start dissociation around that time too?",
          "created_utc": 1733358011.0
        }
      ]
    },
    {
      "id": "m0pwkb0",
      "author": "jun3_bugz",
      "body": "yeah probably I’m just going off the stats from my mental health team. whether it’s 5% or less ultimately it’s a very rare mental health disorder and having some food noise or skipping a couple meals should not be conflated with anorexic cognition",
      "created_utc": 1733498933.0,
      "score": 2,
      "context": [
        {
          "id": "m0h3vo1",
          "author": "jun3_bugz",
          "body": "well it’s not. It makes up only 5% of eating disorders. Remember as anorexics we do as humans create our own echo chambers. it is still a rare mental disorder",
          "created_utc": 1733365056.0
        },
        {
          "id": "m0icl6w",
          "author": "zillabirdblue",
          "body": "The percentage is actually a lot smaller.",
          "created_utc": 1733386109.0
        }
      ]
    },
    {
      "id": "m0kqz1r",
      "author": "Rhyme_orange_",
      "body": "Can you tell me more about what it’s been like for you? It doesn’t seem as rare as I once thought. I know that’s so messed up. But I’m just trying to better understand ya know? But yeah it is a mental illness and stats only go so far in treating us.",
      "created_utc": 1733422697.0,
      "score": 1,
      "context": [
        {
          "id": "m0h3vo1",
          "author": "jun3_bugz",
          "body": "well it’s not. It makes up only 5% of eating disorders. Remember as anorexics we do as humans create our own echo chambers. it is still a rare mental disorder",
          "created_utc": 1733365056.0
        },
        {
          "id": "m0icl6w",
          "author": "zillabirdblue",
          "body": "The percentage is actually a lot smaller.",
          "created_utc": 1733386109.0
        }
      ]
    },
    {
      "id": "m0llhji",
      "author": "Rectangular_Bird",
      "body": "I don't know about that",
      "created_utc": 1733432141.0,
      "score": 2,
      "context": [
        {
          "id": "m0i4aal",
          "author": "Rectangular_Bird",
          "body": "It is quite a rare eating disorder actually. Ednos and disordered eating are way more common.",
          "created_utc": 1733381029.0
        },
        {
          "id": "m0kuibt",
          "author": "Rhyme_orange_",
          "body": "That makes sense. What about ARFID?",
          "created_utc": 1733423768.0
        }
      ]
    },
    {
      "id": "m0ksmvw",
      "author": "Rhyme_orange_",
      "body": "I guess it just depends on our society and cultural norms. I’m lucky to have therapist that diagnosed me and I have the ability to access treatment if and when I need.",
      "created_utc": 1733423200.0,
      "score": 2,
      "context": [
        {
          "id": "m0hvdy0",
          "author": "Vegetable-Try9263",
          "body": "I think it’s the IDEA of anorexia that’s popular, mostly because of how society and so many people value thinness in general. Thinness isn’t just perceived as a physical trait, it’s also seen as a virtue. I think this is why AN is perceived SO differently on a societal level compared to any other eating disorder.\n\nWhen most people think of AN, the first thing that comes to mind isn’t that it’s a debilitating mental illness. Most people just think that anorexia means that someone has successfully made themselves very very thin. A lot of people just see restriction as a means to an end, and that it takes a lot of self-discipline and suffering to reach this “ideal” body type. Anorexia is alluring to people in a way that other eating disorders generally aren’t.",
          "created_utc": 1733376276.0
        },
        {
          "id": "m0icr00",
          "author": "zillabirdblue",
          "body": "It’s like people feel sorry for someone with anorexia but are disgusted by those with BED.",
          "created_utc": 1733386217.0
        }
      ]
    },
    {
      "id": "m1c1ymy",
      "author": "Vegetable-Try9263",
      "body": "EXACTLY… I think that’s also maybe why anorexia seems more common as an eating disorder than it is, because it’s often seen as the only “valid” one (which is total bs). It’s the only ED that most people are willing to acknowledge because they have a fundamental misunderstanding of what EDs actually are.",
      "created_utc": 1733821754.0,
      "score": 2,
      "context": [
        {
          "id": "m0hvdy0",
          "author": "Vegetable-Try9263",
          "body": "I think it’s the IDEA of anorexia that’s popular, mostly because of how society and so many people value thinness in general. Thinness isn’t just perceived as a physical trait, it’s also seen as a virtue. I think this is why AN is perceived SO differently on a societal level compared to any other eating disorder.\n\nWhen most people think of AN, the first thing that comes to mind isn’t that it’s a debilitating mental illness. Most people just think that anorexia means that someone has successfully made themselves very very thin. A lot of people just see restriction as a means to an end, and that it takes a lot of self-discipline and suffering to reach this “ideal” body type. Anorexia is alluring to people in a way that other eating disorders generally aren’t.",
          "created_utc": 1733376276.0
        },
        {
          "id": "m0icr00",
          "author": "zillabirdblue",
          "body": "It’s like people feel sorry for someone with anorexia but are disgusted by those with BED.",
          "created_utc": 1733386217.0
        }
      ]
    },
    {
      "id": "m0hpcze",
      "author": "catsinsunglassess",
      "body": "It’s not a good choice of wording and it is NOT a popular mental illness for people to have. It’s just a mental illness. I will say it is glorified by a lot of people, especially people in fat activist communities (fat activists tend to claim they have anorexia but will never admit to having binge eating disorder, for example). It being a glorified mental illness (epitome of daydream pixie girl) does not make it “popular”.",
      "created_utc": 1733373496.0,
      "score": 7,
      "context": [
        {
          "id": "m0gpsqi",
          "author": "Excellent-World-476",
          "body": "It’s a mental illness not a fad.  That’s like asking why is high blood pressure so popular.",
          "created_utc": 1733360019.0
        },
        {
          "id": "m0gyqk1",
          "author": "Rhyme_orange_",
          "body": "Sorry I could have worded it differently but it does seem to speak to a lot of people right now right?",
          "created_utc": 1733363184.0
        }
      ]
    },
    {
      "id": "m0nffzp",
      "author": "j_p96",
      "body": "It’s definitely exhausting. And I have sought out some help. Last year my insurance covered (+/-) 5 appointments with a Dietician/Nutritionist, along with a therapist who specializes in ED’s and Addiction. It’s hard honestly… sometimes I want to put in the work but it’s like my brain keeps fighting against it. Making certain changes is really, really difficult. \n\nI no longer see a Nutritionist, but would like to try again if my insurance agrees to cover it. I’m still seeing the therapist. She’s good but it’s getting repetitive. Doesn’t feel like I’m getting anywhere. And I just keep on losing weight. :(",
      "created_utc": 1733454995.0,
      "score": 2,
      "context": [
        {
          "id": "m0hl71x",
          "author": "j_p96",
          "body": "Not sure why it’s so popular (other than societal standards and all of that, which sucks). I personally feel that my anorexia developed mainly from my own “expectations” of myself, how I *should look*, etc. and an overwhelming feeling of lack of control over my own life, emotions, behaviors… absolutely everything. My disordered eating started when I was a preteen and has now advanced to anorexia 10+ years later. \n\nI do want recovery in order to feel better physically, but I do not want recovery due to the mental challenges along the way. I have tried and it consumed *all* of my energy, emotionally and physically. I believe the people trying to help me were not the “right” people. Idk.",
          "created_utc": 1733371702.0
        },
        {
          "id": "m0ku1js",
          "author": "Rhyme_orange_",
          "body": "Same here. I’m sorry you’re struggling with this too. It’s such an endless struggle every day. Do you have treatment options?",
          "created_utc": 1733423627.0
        }
      ]
    },
    {
      "id": "m0kvhad",
      "author": "Dunkleosteus666",
      "body": "Psychedelics helped me a lot (ego death). But it can also backfire heavily if you try to escape in daily life and it comes back. I rarely used opioids so.. idk\n\nI helped a sister from a friend of mine a lot using the anorexia is an addiction analogy. Its like battling against yourself. But you must eat to survive. But food is everywhere. You strive for idealistic self and you never reach it bc ana takes and never gives. Chasing the dragon. \n\nBut i feel im out of my depth here. Relapse happens. The only reason i recovered was at first bc i feared social exclusion due to skipping school. My relationsship with food is still not perfect 13 years later - but hey i never relapsed. I dont envy you, opioid withdrawals and this shit. You seem much stronger than me. You can do this.\n\nReally get theraphy.",
      "created_utc": 1733424064.0,
      "score": 2,
      "context": [
        {
          "id": "m0i81wq",
          "author": "Dunkleosteus666",
          "body": "Popular? Depends. Youre are unlucky if predisposed, lucky if diagnosed and even luckier if recivered. Some never do. Death rate is high. And many comorbidities (in my case, diagnosed adh, suspected aspergers, + substance abuse).\n\n I was unlucky to one of the few males which had anorexia (+ selfcutting), but it diagnosed, treated, and i recovered. 12-13M, it was 13 years ago, dont wish that to my worst enemy. Still struggled with (poly) substance abuse, but nothing gripped my mind and distorted reality as hard as anorexia did. If my parents hadnt forced an intervention i would have likely died because i lost weight ver, very fast (+ compulsive physical exertion). \n\nIts not a choice. Its not fancy. Its cruel, disgusting and takes everything from you.Wish i didnt have to write this. Same as addiction or depression or schizophrenia, its not a choice.\n\nIm not a doctor, but from what ive read the reasons diagnoses surged (absolute and relative) is because 1) psychiatrist etc get better at diagnosing and recognizing early stages 2) taboo to talk about mental health disappears. Its not really becoming more prevalent but science gets better.\n\nedit: Finishing my M.Sc. in Biology now, 13 years later. Addiction issues but hey theres light at the end of the tunnel.",
          "created_utc": 1733383256.0
        },
        {
          "id": "m0kuzow",
          "author": "Rhyme_orange_",
          "body": "Well thank God. I’m so grateful for you. You give me hope for myself and my boyfriend. I’m worried about him but I don’t know how to bring it up to him. Do you have any advice? (We’re both tapering off methadone and have lost weight from that. However I am the one who has time for therapy etc… any advice would be crucial at this point.)",
          "created_utc": 1733423916.0
        }
      ]
    },
    {
      "id": "m0ln0aq",
      "author": "Cautious_Effort8014",
      "body": "popular makes it sound like a trend or smth. no hate ofc.",
      "created_utc": 1733432609.0,
      "score": 2,
      "context": [
        {
          "id": "m0iitnb",
          "author": "Cautious_Effort8014",
          "body": "popular is not a great choice of words",
          "created_utc": 1733390300.0
        },
        {
          "id": "m0kv18m",
          "author": "Rhyme_orange_",
          "body": "How would you have worded it??",
          "created_utc": 1733423929.0
        }
      ]
    },
    {
      "id": "m0ilhhu",
      "author": "Deepspacechris",
      "body": "Thanks fam! Yeah, I finally started therapy a few months ago so fingers crossed!",
      "created_utc": 1733392118.0,
      "score": 2,
      "context": [
        {
          "id": "m0gvky2",
          "author": "Deepspacechris",
          "body": "After years and years of mental issues it all peaked when I saw that my marriage and personal life was failing, and in an attempt to regain some control of my life, dieting became an obsession. Probably because the only thing you can really have some sort of control over is exactly that; your own body. Fast forward a couple of months and it’s all I can think about, and now, a couple of years later, I’m deep in and honestly I see no way out without any drastic change in my life.",
          "created_utc": 1733362071.0
        },
        {
          "id": "m0h1hzf",
          "author": "Rhyme_orange_",
          "body": "I’m so sorry, that’s so much to struggle with. It makes sense too but that doesn’t mean you deserve that. You’re worth so much more than your body. I believe in you. Have you looked into therapy yet?",
          "created_utc": 1733364178.0
        }
      ]
    },
    {
      "id": "m0mog34",
      "author": "ThrowRA-sicksad",
      "body": "I don’t think society does either. BMI is bullshit and often people who are labeled overweight or obese are actually healthy, while “normal weight” people such as myself don’t eat nearly enough.",
      "created_utc": 1733445163.0,
      "score": 1,
      "context": [
        {
          "id": "m0hdg1q",
          "author": "ThrowRA-sicksad",
          "body": "Because we live in a fatphobic bodyshaming society that tells us we’re disgusting for having healthy bodies.",
          "created_utc": 1733368595.0
        },
        {
          "id": "m0kvatg",
          "author": "Rhyme_orange_",
          "body": "Ugh really? This sucks. I don’t even know what a healthy body is anymore yo.",
          "created_utc": 1733424010.0
        }
      ]
    },
    {
      "id": "m0h5lrt",
      "author": "None",
      "body": "It's okay <3 I wish you and your partner the best",
      "created_utc": 1733365688.0,
      "score": 3,
      "context": [
        {
          "id": "m0gtq2e",
          "author": "None",
          "body": "I definitely get what you meant with 'popular' even though it might not be the best choice of wording it :p\nIn my opinion social media is to blame. These days I open twitter or any social media and easily find disturbing content, it didn't use to be like this. When I was younger I could find it online but I had to dig if it makes any sense. Last year I found out there's a community on twitter and it was awful, it seems as if it's only getting worse each day. To be clear, I don't blame these people and for what I've seen they're teens. I get incredibly sad though when I think about everything they are going through.\n\nEvery now and then there's a new trend on tiktok that makes me baffle and it's so normalized. The fatphobia and bodyshaming, the bodychecking...it's all so sad.",
          "created_utc": 1733361413.0
        },
        {
          "id": "m0h145d",
          "author": "Rhyme_orange_",
          "body": "I so agree with you. I’m sorry for my wording but I’m just trying to better understand for my partner and myself. It’s a stupid scary disorder and I’ve been a part of this community for a while now. I just learned last week I disassociate and don’t know what to do anymore ya know?",
          "created_utc": 1733364035.0
        }
      ]
    },
    {
      "id": "m0gyn46",
      "author": "Rhyme_orange_",
      "body": "I totally understand thank you! I’m sorry and I feel you. Me too! I guess we’re lucky in a way right? But damn that’s a long time to lose your period for.",
      "created_utc": 1733363150.0,
      "score": 2,
      "context": [
        {
          "id": "m0gft92",
          "author": "w1tchyb1tchy-",
          "body": "I had a history of mental illness, hospitalizations not related to EDs at all, and was overweight at one point and decided to lose weight, at first it was healthy. However somewhere along the way it became an obsession and I was fixated on it, even once I was at a healthy weight I just couldnt stop. I cant remember when the lines started to blur but I believe I was already susceptible to developing an ED because of my medical history and losing weight just triggered that course of events.",
          "created_utc": 1733356458.0
        },
        {
          "id": "m0ghg2n",
          "author": "Rhyme_orange_",
          "body": "Oh geez I’m so sorry. Thank you for explaining this to me. That sounds very similar to my experience as well. How are you doing now?",
          "created_utc": 1733357032.0
        },
        {
          "id": "m0gqc3d",
          "author": "w1tchyb1tchy-",
          "body": "Ive definitely been worse than I am now for sure. I am maintaining the lower end of a healthy weight, but I just recently got my period back after it being absent for around 6-8 months. I do have periods of restriction still that I do bounce back from, and its still a mental battle every day. But maintaining is better than losing ☺️ having a support system has been a big role in making the steps towards recovery as well!",
          "created_utc": 1733360211.0
        }
      ]
    },
    {
      "id": "m0j00g3",
      "author": "lemonlovelimes",
      "body": "There is this thing called nuance where we can hold all of this information. \n\nBut also I recommend you look into the history of BMI, as it is a poor measure of health where the categorization of overweight and obese have shifted to benefit insurance companies, rather than function to measure health or health related outcomes.",
      "created_utc": 1733400917.0,
      "score": 3,
      "context": [
        {
          "id": "m0gla0c",
          "author": "throwawayforlemoi",
          "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
          "created_utc": 1733358399.0
        },
        {
          "id": "m0gt6sb",
          "author": "lemonlovelimes",
          "body": "I think it’s also important to recognize that some people don’t get diagnoses due to lack of health insurance, other barriers to care, and systemic anti-fat bias. \nWe are also in the cultural return to obsession over skinniness so unfortunately the official rates would miss more folks who would benefit from diagnoses.",
          "created_utc": 1733361222.0
        },
        {
          "id": "m0ijehf",
          "author": "fuschiaoctopus",
          "body": "The lifetime rates weren't calculated in the last 5 months, those stats go back longer than this random obsession with insisting we're in some intense heroin chic era where everyone is wasting away despite the fact that statistically 2/3 of the *entire* US population is medically overweight and almost half are obese. If people got off insta, went outside, and looked around at what people really look like, I know they wouldn't be seeing that. AN is not all that common, especially not in our obesogenic society. \n\nNote that they also said prevalence of AN specifically, not eds in general. The other eds are much more common, with ednos making up the biggest percentage by far iirc. I don't know if they include atypical AN in that statistic since it is under the EDNOS umbrella but as upsetting as it is, I personally think it is best to go off professional diagnoses for an attempt at a statistic like that (which will never be perfectly accurate anyway) rather than going off self reported polls that include self diagnosers, people that simply don't meet the diagnostic criteria, people that crash dieted a week before prom and talk the rest of their life about that \"time they were anorexic\", etc. You wouldn't get accurate results, especially since AN is put on a pedestal compared to other eds so a significant portion of people who clinically fit the diagnostic criteria for a different ed would likely self report AN instead, especially ednos sufferers, and especially ones that aren't professionally diagnosed.",
          "created_utc": 1733390690.0
        }
      ]
    },
    {
      "id": "m0h3g8p",
      "author": "Necessary-News-4006",
      "body": "No problem 🙏🏼 I’m not sure on how to relate it to disassociation. In my case, i was very depressed and mad about my father. So I got all this rage and took it on the food. When he offered sweets, or a big fat meal, I refused to make him mad. I don’t think in my case was like that., but I assume that they could be related to some cases.",
      "created_utc": 1733364899.0,
      "score": 5,
      "context": [
        {
          "id": "m0gla0c",
          "author": "throwawayforlemoi",
          "body": "Anorexia really isn't \"popular\" (bad choice of words, to be honest; it's a mental illness).\n\nThe lifetime prevalence of AN is about 0.2%, which really isn't a lot. You probably think it's more prevalent due to moving in spaces with people suffering from AN, which can give you a skewed view of how many people actually have it.",
          "created_utc": 1733358399.0
        },
        {
          "id": "m0gyww6",
          "author": "Necessary-News-4006",
          "body": "I would say it is popular indeed, because it is “sold” as the perfect body, and people try to buy it. But I agree that is a mental illness, sometimes related to depression and body dysmorphia",
          "created_utc": 1733363246.0
        },
        {
          "id": "m0h0b14",
          "author": "Rhyme_orange_",
          "body": "Thank you for this SO MUCH. You said it friend. You’re literally the first person to even mention body dysmorphia at all today and I’ve been lurking all day on Reddit. Do you think body dysmorphia has any relation to disassociation?",
          "created_utc": 1733363743.0
        }
      ]
    },
    {
      "id": "m0lnlue",
      "author": "Rhyme_orange_",
      "body": "Yes thank you for being honest. This is vey rare to find here lol. She is a good therapist and she is just 1 out of 3 I have. It’s a lot, but I’m glad she’s transparent I guess. Yes it does seem a little unprofessional coming from a therapist. Like I almost don’t want to say something that triggers her…",
      "created_utc": 1733432797.0,
      "score": 3,
      "context": [
        {
          "id": "m0hq9dk",
          "author": "pebblesandmarbless",
          "body": "Binge eating disorder is actually the most common eating disorder. I think it might seem like more people have anorexia because it’s generally more societally accepted to be underweight than overweight. There’s a lot more shame around binging (and purging) behaviors so it’s not as widely talked about because of how it’s viewed by most people. On the other hand, weight loss is usually praised and complimented. It’s all really fucked up",
          "created_utc": 1733373901.0
        },
        {
          "id": "m0kpm8r",
          "author": "Rhyme_orange_",
          "body": "This is true to my knowledge. It’s so hard and I don’t agree with societal norms. I hesitate to even post this but I have a therapist who struggles with binge/purge and even this I don’t think should be judged as anything but a disordered mentality as well.",
          "created_utc": 1733422283.0
        },
        {
          "id": "m0lejw9",
          "author": "starrymoonkitty",
          "body": "Wait what? Im sorry, your therapist isn’t actively struggling with an ED are they? I feel like that would be some sort of weird conflict of interest since you are in therapy trying to get help for that, not trigger it. Hope that makes sense",
          "created_utc": 1733429973.0
        }
      ]
    },
    {
      "id": "m0le6ul",
      "author": "Rhyme_orange_",
      "body": "Me too, I’m prescribed ADHD meds and honestly I don’t know if they help me maintain my anorexia (probably), but I have this whole system in place with a methadone taper that helps me lose weight almost without trying. I’ve still got two months left and I don’t know my weight. I’m diagnosed by two therapists.",
      "created_utc": 1733429859.0,
      "score": 2,
      "context": [
        {
          "id": "m0hxy5y",
          "author": "spicytexan",
          "body": "I think it’s because it’s relatively easy to hide. At least initially. I was able to brush it off as though my medication finally worked for me and I stopped “stress eating.” In reality the truth was I was suffering from major pre-loss grief when my mom was diagnosed with stage IV breast cancer and felt like the only thing I *could* control was what I ate. \n\nWhen the weight started shedding—quickly—it was like an addiction to something that felt “successful” in a way. I was good at eating just enough in front of people to not raise suspicions but really I was basically not eating anything. I’m currently less than a year recovered right now and pregnant with our first child. I still have urges to restrict because of how I feel in a body bigger than I’ve ever had. But I work hard to remind myself that if I don’t eat, our son won’t eat, and that’s a terrifying thought I refuse to give into. So far we’re both healthy and hope it only continues!",
          "created_utc": 1733377557.0
        },
        {
          "id": "m0kpwyf",
          "author": "Rhyme_orange_",
          "body": "I’m so happy for you two! That’s an amazing story and so inspiring. I’m grateful for you. I totally can understand that feeling of it being almost addictive like a symptom of a medication almost?",
          "created_utc": 1733422376.0
        },
        {
          "id": "m0l1dsz",
          "author": "spicytexan",
          "body": "My meds made it easier to lose my appetite at the time but when my doctor would ask me about it during our check-ups I would say I didn’t notice any change. I’m honestly surprised he didn’t notice the drastic weight loss at the time. But yes it absolutely did feel like a symptom at times.",
          "created_utc": 1733425880.0
        }
      ]
    },
    {
      "id": "m2ec8hy",
      "author": "Rhyme_orange_",
      "body": "Thanks I appreciate it. The clinic I go to is such a stupid place. They treat me super unfairly compared to my boyfriend omg.",
      "created_utc": 1734386462.0,
      "score": 1,
      "context": [
        {
          "id": "m0gyypg",
          "author": "crisebdl",
          "body": "I was always thinner, and society rewarded me for it. When I got to puberty and my body began to change, I couldn’t cope with the idea of not having the « right » body anymore. It’s been 16 years and I still am unable to recover.",
          "created_utc": 1733363264.0
        },
        {
          "id": "m0h1nn0",
          "author": "Rhyme_orange_",
          "body": "I’m so sorry friend. Same here sadly. It’s been 15 years for me and mostly my weight loss is due to a methadone taper. I’m worried about my boyfriend right now though.",
          "created_utc": 1733364236.0
        },
        {
          "id": "m2cl7v5",
          "author": "crisebdl",
          "body": "Méthadone is rough, good luck. Im also an ex opiates user x",
          "created_utc": 1734366747.0
        }
      ]
    },
    {
      "id": "m0gzn5r",
      "author": "Rhyme_orange_",
      "body": "Ok thank you for explaining this to me. I’m sorry I am just trying to better understand and communicate how this disorder feels ya know? I’m obviously not the best at it. I hate this disorder, the competitiveness of it, it’s contradictions, and how it’s like some stupid secret friend that we carry around and it’s never fair or right. But still it’s a struggle every day.",
      "created_utc": 1733363504.0,
      "score": 8,
      "context": [
        {
          "id": "m0ggzk4",
          "author": "alienprincess111",
          "body": "The way you phrase the question makes it sound like anorexia is a choice or a trend. It is not! It is a mental disease.",
          "created_utc": 1733356870.0
        },
        {
          "id": "m0ghmnk",
          "author": "Rhyme_orange_",
          "body": "Well I don’t know I just am asking a question on Reddit. I don’t think it’s a trend but it is a whole community here isn’t it? And we’re all following this community every day?",
          "created_utc": 1733357098.0
        },
        {
          "id": "m0go23d",
          "author": "la_chancla360",
          "body": "Don't worry I understand what you mean, why is it very popular particularly with young women i suppose? I think for some like me it is a form of control. I have OCD and since I was little I didn't live a very stable childhood. Moving around, financial instabilities etc. I was taken advantage of as a very young girl by someone who was friends with my parents and I believe since then that was when I started developing an ED. I know a lot of women who develop all kinds of eating disorders after occurrences like that. It's kind of like feeling that you're finally in control of something in your life, especially over your own body",
          "created_utc": 1733359393.0
        }
      ]
    },
    {
      "id": "m0lgpta",
      "author": "Rhyme_orange_",
      "body": "I’m proud of you too thank you xmillion for this post.",
      "created_utc": 1733430656.0,
      "score": 1,
      "context": [
        {
          "id": "m0hyjir",
          "author": "sbrown_13",
          "body": "It’s not popular. It’s a bloody death sentence. I wouldn’t wish this disease on my worst enemy…",
          "created_utc": 1733377867.0
        },
        {
          "id": "m0kp95j",
          "author": "Rhyme_orange_",
          "body": "Same here. I’m sorry yo. It’s so competitive and no matter what we always lose. However I’m still proud of you for being here at all.",
          "created_utc": 1733422175.0
        },
        {
          "id": "m0lggrz",
          "author": "sbrown_13",
          "body": "I’m proud of every single person who gets up each day like me and fights, hoping for a better life xx",
          "created_utc": 1733430578.0
        }
      ]
    },
    {
      "id": "m0kqc87",
      "author": "Rhyme_orange_",
      "body": "Thank you. I agree. It is part of the illness and I’m so sorry you struggled with that as well. Me too. I’m not sure how to dissociate in a healthy way anymore. Everyday just feels like a dumb competition.",
      "created_utc": 1733422505.0,
      "score": 2,
      "context": [
        {
          "id": "m0gibep",
          "author": "BookishBeauty_",
          "body": "For me it started with wanting to look like everyone else in my class when I was 12, I noticed how much bigger I was than everyone else. Since then it's evolved, I've been through multiple 'recoveries', I guess now I'm in my 20s it comes more from a place of control? Idk my relationship with food has been so messed up since I was so young that I'm not sure I even know how to live without some form of an ED. I also have a lot of other mental health issues and everything just kind of bunched into one big ball of issues lol. If I could choose to be normal I would, cos man it sucks",
          "created_utc": 1733357343.0
        },
        {
          "id": "m0gk6qt",
          "author": "Rhyme_orange_",
          "body": "Hey, I’m so sorry and thanks for taking the time to explain this to me. I totally feel for you and with you. It started for me too around that age. Did you also start dissociation around that time too?",
          "created_utc": 1733358011.0
        },
        {
          "id": "m0k66rq",
          "author": "BookishBeauty_",
          "body": "I did yeah, I've gotten better recently. It wasn't till I turned 21 that I kind of worked out how to help myself. I don't remember much from 13-18 to be honest, it's like a sea of fog. I guess as a coping mechanism my brain just went into survival mode. Now when I dissociate it's when I'm not doing great, mostly during depressive episodes. I think it's really common for everyone who struggles with an ED for it to begin at a young age. My first memory of realising it was an issue was around 13yrs old when my mum sat me down and cried about how one of her friends died from ana, it didn't help much but that was when I realised I probably had an ED. And ngl, I felt proud? Like I must be getting thinner if people are noticing. It's obviously a messed up way of thinking but it's all part of the illness lol",
          "created_utc": 1733416353.0
        }
      ]
    },
    {
      "id": "m0pwxah",
      "author": "jun3_bugz",
      "body": "I think of it as a medical, biological genetically induced condition. It was not a choice, it has been documented even in ancient times and has nothing to do with the beauty standard even if you think it does. I’m of the school of thought that starvation causes anorexic cognition. If your starvation comes from a desire to be thin sure but you can develop anorexic cognition and brain damage from the stomach flu. The only thing that helps me truly recover is knowing my brain was irreversibly damaged and thoughts and feelings do not help, only animal fat and brain restoration",
      "created_utc": 1733499050.0,
      "score": 3,
      "context": [
        {
          "id": "m0h3vo1",
          "author": "jun3_bugz",
          "body": "well it’s not. It makes up only 5% of eating disorders. Remember as anorexics we do as humans create our own echo chambers. it is still a rare mental disorder",
          "created_utc": 1733365056.0
        },
        {
          "id": "m0icl6w",
          "author": "zillabirdblue",
          "body": "The percentage is actually a lot smaller.",
          "created_utc": 1733386109.0
        },
        {
          "id": "m0kqz1r",
          "author": "Rhyme_orange_",
          "body": "Can you tell me more about what it’s been like for you? It doesn’t seem as rare as I once thought. I know that’s so messed up. But I’m just trying to better understand ya know? But yeah it is a mental illness and stats only go so far in treating us.",
          "created_utc": 1733422697.0
        }
      ]
    },
    {
      "id": "m0lofuc",
      "author": "Rhyme_orange_",
      "body": "I used to be friends with one person who had this. It was a sad ED as well.",
      "created_utc": 1733433056.0,
      "score": 2,
      "context": [
        {
          "id": "m0i4aal",
          "author": "Rectangular_Bird",
          "body": "It is quite a rare eating disorder actually. Ednos and disordered eating are way more common.",
          "created_utc": 1733381029.0
        },
        {
          "id": "m0kuibt",
          "author": "Rhyme_orange_",
          "body": "That makes sense. What about ARFID?",
          "created_utc": 1733423768.0
        },
        {
          "id": "m0llhji",
          "author": "Rectangular_Bird",
          "body": "I don't know about that",
          "created_utc": 1733432141.0
        }
      ]
    },
    {
      "id": "m0ktm06",
      "author": "Rhyme_orange_",
      "body": "Ok yeah I understand thank you for clarifying. I’ve also had BED so I’m not trying to judge or anything. Just am trying to better understand.",
      "created_utc": 1733423496.0,
      "score": 1,
      "context": [
        {
          "id": "m0gpsqi",
          "author": "Excellent-World-476",
          "body": "It’s a mental illness not a fad.  That’s like asking why is high blood pressure so popular.",
          "created_utc": 1733360019.0
        },
        {
          "id": "m0gyqk1",
          "author": "Rhyme_orange_",
          "body": "Sorry I could have worded it differently but it does seem to speak to a lot of people right now right?",
          "created_utc": 1733363184.0
        },
        {
          "id": "m0hpcze",
          "author": "catsinsunglassess",
          "body": "It’s not a good choice of wording and it is NOT a popular mental illness for people to have. It’s just a mental illness. I will say it is glorified by a lot of people, especially people in fat activist communities (fat activists tend to claim they have anorexia but will never admit to having binge eating disorder, for example). It being a glorified mental illness (epitome of daydream pixie girl) does not make it “popular”.",
          "created_utc": 1733373496.0
        }
      ]
    },
    {
      "id": "m0xh3xj",
      "author": "Rhyme_orange_",
      "body": "I totally can understand to an extent. I’m sorry though. Do you know why you’re losing weight? Is it alright I asked that? For me, I’m on a taper off methadone and it messed with my metabolism so it’s a weird place to be in. Honestly I’m not complaining except I feel like I’m not worthy of the weight loss.",
      "created_utc": 1733605835.0,
      "score": 1,
      "context": [
        {
          "id": "m0hl71x",
          "author": "j_p96",
          "body": "Not sure why it’s so popular (other than societal standards and all of that, which sucks). I personally feel that my anorexia developed mainly from my own “expectations” of myself, how I *should look*, etc. and an overwhelming feeling of lack of control over my own life, emotions, behaviors… absolutely everything. My disordered eating started when I was a preteen and has now advanced to anorexia 10+ years later. \n\nI do want recovery in order to feel better physically, but I do not want recovery due to the mental challenges along the way. I have tried and it consumed *all* of my energy, emotionally and physically. I believe the people trying to help me were not the “right” people. Idk.",
          "created_utc": 1733371702.0
        },
        {
          "id": "m0ku1js",
          "author": "Rhyme_orange_",
          "body": "Same here. I’m sorry you’re struggling with this too. It’s such an endless struggle every day. Do you have treatment options?",
          "created_utc": 1733423627.0
        },
        {
          "id": "m0nffzp",
          "author": "j_p96",
          "body": "It’s definitely exhausting. And I have sought out some help. Last year my insurance covered (+/-) 5 appointments with a Dietician/Nutritionist, along with a therapist who specializes in ED’s and Addiction. It’s hard honestly… sometimes I want to put in the work but it’s like my brain keeps fighting against it. Making certain changes is really, really difficult. \n\nI no longer see a Nutritionist, but would like to try again if my insurance agrees to cover it. I’m still seeing the therapist. She’s good but it’s getting repetitive. Doesn’t feel like I’m getting anywhere. And I just keep on losing weight. :(",
          "created_utc": 1733454995.0
        }
      ]
    },
    {
      "id": "m0lflgi",
      "author": "Rhyme_orange_",
      "body": "Thank you for your understanding. Back at you too. He says he doesn’t have anorexia so I’m hoping that’s true at this point.",
      "created_utc": 1733430302.0,
      "score": 1,
      "context": [
        {
          "id": "m0i81wq",
          "author": "Dunkleosteus666",
          "body": "Popular? Depends. Youre are unlucky if predisposed, lucky if diagnosed and even luckier if recivered. Some never do. Death rate is high. And many comorbidities (in my case, diagnosed adh, suspected aspergers, + substance abuse).\n\n I was unlucky to one of the few males which had anorexia (+ selfcutting), but it diagnosed, treated, and i recovered. 12-13M, it was 13 years ago, dont wish that to my worst enemy. Still struggled with (poly) substance abuse, but nothing gripped my mind and distorted reality as hard as anorexia did. If my parents hadnt forced an intervention i would have likely died because i lost weight ver, very fast (+ compulsive physical exertion). \n\nIts not a choice. Its not fancy. Its cruel, disgusting and takes everything from you.Wish i didnt have to write this. Same as addiction or depression or schizophrenia, its not a choice.\n\nIm not a doctor, but from what ive read the reasons diagnoses surged (absolute and relative) is because 1) psychiatrist etc get better at diagnosing and recognizing early stages 2) taboo to talk about mental health disappears. Its not really becoming more prevalent but science gets better.\n\nedit: Finishing my M.Sc. in Biology now, 13 years later. Addiction issues but hey theres light at the end of the tunnel.",
          "created_utc": 1733383256.0
        },
        {
          "id": "m0kuzow",
          "author": "Rhyme_orange_",
          "body": "Well thank God. I’m so grateful for you. You give me hope for myself and my boyfriend. I’m worried about him but I don’t know how to bring it up to him. Do you have any advice? (We’re both tapering off methadone and have lost weight from that. However I am the one who has time for therapy etc… any advice would be crucial at this point.)",
          "created_utc": 1733423916.0
        },
        {
          "id": "m0kvhad",
          "author": "Dunkleosteus666",
          "body": "Psychedelics helped me a lot (ego death). But it can also backfire heavily if you try to escape in daily life and it comes back. I rarely used opioids so.. idk\n\nI helped a sister from a friend of mine a lot using the anorexia is an addiction analogy. Its like battling against yourself. But you must eat to survive. But food is everywhere. You strive for idealistic self and you never reach it bc ana takes and never gives. Chasing the dragon. \n\nBut i feel im out of my depth here. Relapse happens. The only reason i recovered was at first bc i feared social exclusion due to skipping school. My relationsship with food is still not perfect 13 years later - but hey i never relapsed. I dont envy you, opioid withdrawals and this shit. You seem much stronger than me. You can do this.\n\nReally get theraphy.",
          "created_utc": 1733424064.0
        }
      ]
    },
    {
      "id": "m0loa7h",
      "author": "Rhyme_orange_",
      "body": "Hmm I could’ve said something like how prevalent is the AN R subtype in the ED community?",
      "created_utc": 1733433008.0,
      "score": 1,
      "context": [
        {
          "id": "m0iitnb",
          "author": "Cautious_Effort8014",
          "body": "popular is not a great choice of words",
          "created_utc": 1733390300.0
        },
        {
          "id": "m0kv18m",
          "author": "Rhyme_orange_",
          "body": "How would you have worded it??",
          "created_utc": 1733423929.0
        },
        {
          "id": "m0ln0aq",
          "author": "Cautious_Effort8014",
          "body": "popular makes it sound like a trend or smth. no hate ofc.",
          "created_utc": 1733432609.0
        }
      ]
    },
    {
      "id": "m0kv44a",
      "author": "Rhyme_orange_",
      "body": "Me too! Good luck to you.",
      "created_utc": 1733423953.0,
      "score": 2,
      "context": [
        {
          "id": "m0gvky2",
          "author": "Deepspacechris",
          "body": "After years and years of mental issues it all peaked when I saw that my marriage and personal life was failing, and in an attempt to regain some control of my life, dieting became an obsession. Probably because the only thing you can really have some sort of control over is exactly that; your own body. Fast forward a couple of months and it’s all I can think about, and now, a couple of years later, I’m deep in and honestly I see no way out without any drastic change in my life.",
          "created_utc": 1733362071.0
        },
        {
          "id": "m0h1hzf",
          "author": "Rhyme_orange_",
          "body": "I’m so sorry, that’s so much to struggle with. It makes sense too but that doesn’t mean you deserve that. You’re worth so much more than your body. I believe in you. Have you looked into therapy yet?",
          "created_utc": 1733364178.0
        },
        {
          "id": "m0ilhhu",
          "author": "Deepspacechris",
          "body": "Thanks fam! Yeah, I finally started therapy a few months ago so fingers crossed!",
          "created_utc": 1733392118.0
        }
      ]
    },
    {
      "id": "m0xgnkg",
      "author": "Rhyme_orange_",
      "body": "I’m sorry. That’s so f***ing f***ed",
      "created_utc": 1733605683.0,
      "score": 2,
      "context": [
        {
          "id": "m0hdg1q",
          "author": "ThrowRA-sicksad",
          "body": "Because we live in a fatphobic bodyshaming society that tells us we’re disgusting for having healthy bodies.",
          "created_utc": 1733368595.0
        },
        {
          "id": "m0kvatg",
          "author": "Rhyme_orange_",
          "body": "Ugh really? This sucks. I don’t even know what a healthy body is anymore yo.",
          "created_utc": 1733424010.0
        },
        {
          "id": "m0mog34",
          "author": "ThrowRA-sicksad",
          "body": "I don’t think society does either. BMI is bullshit and often people who are labeled overweight or obese are actually healthy, while “normal weight” people such as myself don’t eat nearly enough.",
          "created_utc": 1733445163.0
        }
      ]
    },
    {
      "id": "m0kvd84",
      "author": "Rhyme_orange_",
      "body": "Thank you I appreciate you.",
      "created_utc": 1733424030.0,
      "score": 1,
      "context": [
        {
          "id": "m0gtq2e",
          "author": "None",
          "body": "I definitely get what you meant with 'popular' even though it might not be the best choice of wording it :p\nIn my opinion social media is to blame. These days I open twitter or any social media and easily find disturbing content, it didn't use to be like this. When I was younger I could find it online but I had to dig if it makes any sense. Last year I found out there's a community on twitter and it was awful, it seems as if it's only getting worse each day. To be clear, I don't blame these people and for what I've seen they're teens. I get incredibly sad though when I think about everything they are going through.\n\nEvery now and then there's a new trend on tiktok that makes me baffle and it's so normalized. The fatphobia and bodyshaming, the bodychecking...it's all so sad.",
          "created_utc": 1733361413.0
        },
        {
          "id": "m0h145d",
          "author": "Rhyme_orange_",
          "body": "I so agree with you. I’m sorry for my wording but I’m just trying to better understand for my partner and myself. It’s a stupid scary disorder and I’ve been a part of this community for a while now. I just learned last week I disassociate and don’t know what to do anymore ya know?",
          "created_utc": 1733364035.0
        },
        {
          "id": "m0h5lrt",
          "author": "None",
          "body": "It's okay <3 I wish you and your partner the best",
          "created_utc": 1733365688.0
        }
      ]
    },
    {
      "id": "m0r8by1",
      "author": "Rhyme_orange_",
      "body": "Wow ok, yeah thank you, that’s right. This word, totally, can I use it? 😂 I’m just being honest. This and you are brilliant!",
      "created_utc": 1733513999.0,
      "score": 1,
      "context": [
        {
          "id": "m0h3vo1",
          "author": "jun3_bugz",
          "body": "well it’s not. It makes up only 5% of eating disorders. Remember as anorexics we do as humans create our own echo chambers. it is still a rare mental disorder",
          "created_utc": 1733365056.0
        },
        {
          "id": "m0icl6w",
          "author": "zillabirdblue",
          "body": "The percentage is actually a lot smaller.",
          "created_utc": 1733386109.0
        },
        {
          "id": "m0kqz1r",
          "author": "Rhyme_orange_",
          "body": "Can you tell me more about what it’s been like for you? It doesn’t seem as rare as I once thought. I know that’s so messed up. But I’m just trying to better understand ya know? But yeah it is a mental illness and stats only go so far in treating us.",
          "created_utc": 1733422697.0
        },
        {
          "id": "m0pwxah",
          "author": "jun3_bugz",
          "body": "I think of it as a medical, biological genetically induced condition. It was not a choice, it has been documented even in ancient times and has nothing to do with the beauty standard even if you think it does. I’m of the school of thought that starvation causes anorexic cognition. If your starvation comes from a desire to be thin sure but you can develop anorexic cognition and brain damage from the stomach flu. The only thing that helps me truly recover is knowing my brain was irreversibly damaged and thoughts and feelings do not help, only animal fat and brain restoration",
          "created_utc": 1733499050.0
        }
      ]
    },
    {
      "id": "m0lr6x5",
      "author": "Rectangular_Bird",
      "body": "It is. But unfortunately people don't really recognise it as an ed and many don't know about it much",
      "created_utc": 1733433913.0,
      "score": 2,
      "context": [
        {
          "id": "m0i4aal",
          "author": "Rectangular_Bird",
          "body": "It is quite a rare eating disorder actually. Ednos and disordered eating are way more common.",
          "created_utc": 1733381029.0
        },
        {
          "id": "m0kuibt",
          "author": "Rhyme_orange_",
          "body": "That makes sense. What about ARFID?",
          "created_utc": 1733423768.0
        },
        {
          "id": "m0llhji",
          "author": "Rectangular_Bird",
          "body": "I don't know about that",
          "created_utc": 1733432141.0
        },
        {
          "id": "m0lofuc",
          "author": "Rhyme_orange_",
          "body": "I used to be friends with one person who had this. It was a sad ED as well.",
          "created_utc": 1733433056.0
        }
      ]
    },
    {
      "id": "m0yk099",
      "author": "j_p96",
      "body": "Omg. I couldn’t imagine tapering off Methadone *and* dealing with an ED (whether actively struggling, in recovery, or recovered) so I commend you for that. I have been on Subs for 10+ years, so I’m very familiar with the physical and mental aspects of being on an opioid for maintenance. \n\nAside from that, it’s totally okay that you ask! To be honest I know I’m losing the weight because of restriction. I haven’t been able to correct those behaviors completely. At times I eat more regularly and most of the time I restrict. I also use laxatives, quite often. So there’s several factors involved. I’m trying to get over the “control” aspect of the restriction, but my god is it difficult. I want to give it up but it just isn’t that simple. My brain is wired to restrict and control to the detriment of my own health, and the associated behaviors are extremely hard to change.",
      "created_utc": 1733619407.0,
      "score": 2,
      "context": [
        {
          "id": "m0hl71x",
          "author": "j_p96",
          "body": "Not sure why it’s so popular (other than societal standards and all of that, which sucks). I personally feel that my anorexia developed mainly from my own “expectations” of myself, how I *should look*, etc. and an overwhelming feeling of lack of control over my own life, emotions, behaviors… absolutely everything. My disordered eating started when I was a preteen and has now advanced to anorexia 10+ years later. \n\nI do want recovery in order to feel better physically, but I do not want recovery due to the mental challenges along the way. I have tried and it consumed *all* of my energy, emotionally and physically. I believe the people trying to help me were not the “right” people. Idk.",
          "created_utc": 1733371702.0
        },
        {
          "id": "m0ku1js",
          "author": "Rhyme_orange_",
          "body": "Same here. I’m sorry you’re struggling with this too. It’s such an endless struggle every day. Do you have treatment options?",
          "created_utc": 1733423627.0
        },
        {
          "id": "m0nffzp",
          "author": "j_p96",
          "body": "It’s definitely exhausting. And I have sought out some help. Last year my insurance covered (+/-) 5 appointments with a Dietician/Nutritionist, along with a therapist who specializes in ED’s and Addiction. It’s hard honestly… sometimes I want to put in the work but it’s like my brain keeps fighting against it. Making certain changes is really, really difficult. \n\nI no longer see a Nutritionist, but would like to try again if my insurance agrees to cover it. I’m still seeing the therapist. She’s good but it’s getting repetitive. Doesn’t feel like I’m getting anywhere. And I just keep on losing weight. :(",
          "created_utc": 1733454995.0
        },
        {
          "id": "m0xh3xj",
          "author": "Rhyme_orange_",
          "body": "I totally can understand to an extent. I’m sorry though. Do you know why you’re losing weight? Is it alright I asked that? For me, I’m on a taper off methadone and it messed with my metabolism so it’s a weird place to be in. Honestly I’m not complaining except I feel like I’m not worthy of the weight loss.",
          "created_utc": 1733605835.0
        }
      ]
    },
    {
      "id": "m0uyg77",
      "author": "jun3_bugz",
      "body": "feel free! thank u",
      "created_utc": 1733574578.0,
      "score": 2,
      "context": [
        {
          "id": "m0h3vo1",
          "author": "jun3_bugz",
          "body": "well it’s not. It makes up only 5% of eating disorders. Remember as anorexics we do as humans create our own echo chambers. it is still a rare mental disorder",
          "created_utc": 1733365056.0
        },
        {
          "id": "m0icl6w",
          "author": "zillabirdblue",
          "body": "The percentage is actually a lot smaller.",
          "created_utc": 1733386109.0
        },
        {
          "id": "m0kqz1r",
          "author": "Rhyme_orange_",
          "body": "Can you tell me more about what it’s been like for you? It doesn’t seem as rare as I once thought. I know that’s so messed up. But I’m just trying to better understand ya know? But yeah it is a mental illness and stats only go so far in treating us.",
          "created_utc": 1733422697.0
        },
        {
          "id": "m0pwxah",
          "author": "jun3_bugz",
          "body": "I think of it as a medical, biological genetically induced condition. It was not a choice, it has been documented even in ancient times and has nothing to do with the beauty standard even if you think it does. I’m of the school of thought that starvation causes anorexic cognition. If your starvation comes from a desire to be thin sure but you can develop anorexic cognition and brain damage from the stomach flu. The only thing that helps me truly recover is knowing my brain was irreversibly damaged and thoughts and feelings do not help, only animal fat and brain restoration",
          "created_utc": 1733499050.0
        },
        {
          "id": "m0r8by1",
          "author": "Rhyme_orange_",
          "body": "Wow ok, yeah thank you, that’s right. This word, totally, can I use it? 😂 I’m just being honest. This and you are brilliant!",
          "created_utc": 1733513999.0
        }
      ]
    },
    {
      "id": "m125xtn",
      "author": "Rhyme_orange_",
      "body": "Hey thanks friend. It’s almost like a systematic thing that’s in place right now and it’s because of the bad choices I made. The methadone made me gain weight. I couldn’t lose no matter what I did. Now, it’s just falling off and I’m barely trying. (Btw I accidentally on purpose bought a scale yesterday…it’s my birthday today and I haven’t yet opened it. It’s a present for myself but I don’t want my bf to know).\n     It seems that almost all the people I’ve talked to on here with anorexia or any ED have that aspect as well, the control piece. It’s so huge and so unfair. I’m sorry you’re struggling with that too. It’s just how this disorder works. It’s like how can we control what controls us every single day? \nDo you also find that it’s competitive? Like a competition against yourself to a certain level? \n     Like I’m barely able to keep up. And I know it’s a losing battle but it’s barely worth it at this point but I do feel that it’s all I have now.\nI’ve lost so much. Friends, family. Peace, trust. \n     I have literally 3 therapists at this point and it’s so much f***ing work. And I’ve already been through too much trauma. It’s like my whole identity right now. \nThanks for your time and understanding. I hope you’re doing ok today. \nToday’s my birthday, I’m turning 29. I’m not sure how today is going to go.",
      "created_utc": 1733679554.0,
      "score": 1,
      "context": [
        {
          "id": "m0hl71x",
          "author": "j_p96",
          "body": "Not sure why it’s so popular (other than societal standards and all of that, which sucks). I personally feel that my anorexia developed mainly from my own “expectations” of myself, how I *should look*, etc. and an overwhelming feeling of lack of control over my own life, emotions, behaviors… absolutely everything. My disordered eating started when I was a preteen and has now advanced to anorexia 10+ years later. \n\nI do want recovery in order to feel better physically, but I do not want recovery due to the mental challenges along the way. I have tried and it consumed *all* of my energy, emotionally and physically. I believe the people trying to help me were not the “right” people. Idk.",
          "created_utc": 1733371702.0
        },
        {
          "id": "m0ku1js",
          "author": "Rhyme_orange_",
          "body": "Same here. I’m sorry you’re struggling with this too. It’s such an endless struggle every day. Do you have treatment options?",
          "created_utc": 1733423627.0
        },
        {
          "id": "m0nffzp",
          "author": "j_p96",
          "body": "It’s definitely exhausting. And I have sought out some help. Last year my insurance covered (+/-) 5 appointments with a Dietician/Nutritionist, along with a therapist who specializes in ED’s and Addiction. It’s hard honestly… sometimes I want to put in the work but it’s like my brain keeps fighting against it. Making certain changes is really, really difficult. \n\nI no longer see a Nutritionist, but would like to try again if my insurance agrees to cover it. I’m still seeing the therapist. She’s good but it’s getting repetitive. Doesn’t feel like I’m getting anywhere. And I just keep on losing weight. :(",
          "created_utc": 1733454995.0
        },
        {
          "id": "m0xh3xj",
          "author": "Rhyme_orange_",
          "body": "I totally can understand to an extent. I’m sorry though. Do you know why you’re losing weight? Is it alright I asked that? For me, I’m on a taper off methadone and it messed with my metabolism so it’s a weird place to be in. Honestly I’m not complaining except I feel like I’m not worthy of the weight loss.",
          "created_utc": 1733605835.0
        },
        {
          "id": "m0yk099",
          "author": "j_p96",
          "body": "Omg. I couldn’t imagine tapering off Methadone *and* dealing with an ED (whether actively struggling, in recovery, or recovered) so I commend you for that. I have been on Subs for 10+ years, so I’m very familiar with the physical and mental aspects of being on an opioid for maintenance. \n\nAside from that, it’s totally okay that you ask! To be honest I know I’m losing the weight because of restriction. I haven’t been able to correct those behaviors completely. At times I eat more regularly and most of the time I restrict. I also use laxatives, quite often. So there’s several factors involved. I’m trying to get over the “control” aspect of the restriction, but my god is it difficult. I want to give it up but it just isn’t that simple. My brain is wired to restrict and control to the detriment of my own health, and the associated behaviors are extremely hard to change.",
          "created_utc": 1733619407.0
        }
      ]
    }
  ]
}