{
  "id": "1h9t9el",
  "subreddit": "AnorexiaNervosa",
  "author": "AwkwardShrimp0",
  "created_utc": 1733693115.0,
  "title": "I hate showering",
  "selftext": "I hate showering so much because I honestly just cannot stand having to touch my own body. I find it so disgusting and it brings me to tears every time. \n\nI know this is kind of weird, but does anyone else relate?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1h9t9el/i_hate_showering/",
  "score": 184,
  "num_comments": 24,
  "comments": [
    {
      "id": "m13djm7",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1733693115.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m13iymv",
      "author": "Sao_118",
      "body": "I completely relate. Even when laying down in bed I hate feeling my body against the bedsheets, sometimes I even hug myself to make sure I can feel my rib and hip bones.",
      "created_utc": 1733694877.0,
      "score": 54,
      "context": []
    },
    {
      "id": "m13q5qz",
      "author": "runchmunch",
      "body": "I’m the same, absolutely hate it. I had a period where I could only shower with all of the lights off because I couldn’t stand to look at myself. When I put lotion on after showering, I try to be super fast so I don’t have to touch my skin for too long.",
      "created_utc": 1733697289.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m149alu",
      "author": "AngryPandaz",
      "body": "I really relate and struggle with this too. I hate having a bath or shower or having to get changed because it makes me so aware of my body. I usually hide my body under layers of baggy clothes so anything that forces me to be confronted with it is really difficult.",
      "created_utc": 1733704081.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m1408qr",
      "author": "Brianmayswifee",
      "body": "i was literally thinking this earlier whilst showering. I feel so gross and just hate it",
      "created_utc": 1733700837.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m15uxy1",
      "author": "Reasonable_Box_72",
      "body": "Not at all weird, it’s a part of the reason anytime I shower or bathe I have to have the lights off. Didn’t help with the residential in treatment you couldn’t have peace by yourself. This was in regards to showering specifically. However being monitored 24/7 wasn't too comfortable haha. I felt like Eleven from stranger things.( I understand it’s technically for the best, however it made me feel like crap.)",
      "created_utc": 1733729165.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m18vmyz",
      "author": "i-got-bored69",
      "body": "i get it. i use a loofah so my hands dont come in contact with my body and i cant try and decipher shapes if that makes sense?",
      "created_utc": 1733774865.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m15jeo7",
      "author": "KristiSoko",
      "body": "Yeah me too. It’s hard. Just gotta take it one second at a time, in my case at least. Sometimes, it helps when the water gets warm enough coz it feels more like a game of how long can I last in how hot of water, ya know?",
      "created_utc": 1733722560.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m19cd6n",
      "author": "FriedLipstick",
      "body": "To me it works to shower with a soft and not bright light, (I love colours). So the bathroom becomes a bit more safe for me. To not touch the body you might be interested in using a sponge or a wash cloth or to just spray the water over the body. Idk if this is helpful but I hope so. Wish you all the best 🙏",
      "created_utc": 1733780047.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m14dx84",
      "author": "jazzysteak",
      "body": "i very much relate",
      "created_utc": 1733705745.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m16kt6b",
      "author": "StrangeFroggyFriend",
      "body": "Yeah, but it’s also linked to a lot of gender dysphoria for me which never helps.",
      "created_utc": 1733746266.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m179zvh",
      "author": "fireflower0",
      "body": "Relate",
      "created_utc": 1733756758.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m18l2mx",
      "author": "Rhyme_orange_",
      "body": "I like to shower when I know I need it. Especially after a day where I have exercised and it was cold and my hands go numb. Then the hot water feels too hot and eventually I melt and can feel again. \n     Some days when I don’t have time to exercise (like today yet so far), I haven’t showered because I don’t feel like I’ve earned it. \nToday I somehow got a kitten with my boyfriend, started the adoption process last night for my birthday yesterday. Today has been amazing, I’m lucky that I don’t have a real job, so my full time job in addition to three therapists, anorexia, disassociation, is now a bird and a kitten.\n     I’m so lucky and grateful though that it worked out. We barely had enough money. I’m so happy this kitten is literally purrfect! \nI hope I’ll still find time to exercise so that I can feel that I’ve earned the shower.",
      "created_utc": 1733771600.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m19je8t",
      "author": "areydellan",
      "body": "Real I have to sleep with clothes now because I can't stand having to look at my body",
      "created_utc": 1733782291.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1694w9",
      "author": "reggiesunmoon",
      "body": "this is so real omg",
      "created_utc": 1733738989.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m16q29b",
      "author": "Turbulent_Shower_501",
      "body": "It's a struggle. Can't tell if I look better with my glasses on or off 😵",
      "created_utc": 1733748882.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1ft90w",
      "author": "Major_Rush_6844",
      "body": "same. i spend more time body checking than actually in the shower. i play with my fat rolls when im nervous",
      "created_utc": 1733872546.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m238ooe",
      "author": "None",
      "body": "Showering does suck, but I found distractions make it more manageable. This may be weird but bringing a rubber duck or other water toy to mess around helps me not focus so much on my body, Bath bombs and bubbly soups could also do something. But I hope you have more manageable days in future, op.",
      "created_utc": 1734219105.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1a5q1a",
      "author": "None",
      "body": "I hate looking in the mirror. Especially with other people around.",
      "created_utc": 1733790058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1d00vl",
      "author": "PerceptionOk8022",
      "body": "I know this is more about feeling but, have you ever showered with the lights off? It might sound ridiculous but I've been doing it for years and not being able to see yourself might help you too",
      "created_utc": 1733840127.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1dazz3",
      "author": "Yeksus420",
      "body": "same",
      "created_utc": 1733844055.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m15xkiv",
      "author": "Upstairs_Ad_9419",
      "body": "Take baths then and soak in anti bacterial soap and just let the bubbles run through your body",
      "created_utc": 1733730885.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m13nlqw",
      "author": "AwkwardShrimp0",
      "body": "Yes!! I'm so relieved someone else relates. There's no one in my life I can talk to about this and this illness can be so lonely sometimes. But I'm so sorry you have to go through it as well.",
      "created_utc": 1733696427.0,
      "score": 10,
      "context": [
        {
          "id": "m13iymv",
          "author": "Sao_118",
          "body": "I completely relate. Even when laying down in bed I hate feeling my body against the bedsheets, sometimes I even hug myself to make sure I can feel my rib and hip bones.",
          "created_utc": 1733694877.0
        }
      ]
    },
    {
      "id": "m13z039",
      "author": "Sao_118",
      "body": "I’m relieved I’m not alone on this, hugs for you!",
      "created_utc": 1733700393.0,
      "score": 7,
      "context": [
        {
          "id": "m13iymv",
          "author": "Sao_118",
          "body": "I completely relate. Even when laying down in bed I hate feeling my body against the bedsheets, sometimes I even hug myself to make sure I can feel my rib and hip bones.",
          "created_utc": 1733694877.0
        },
        {
          "id": "m13nlqw",
          "author": "AwkwardShrimp0",
          "body": "Yes!! I'm so relieved someone else relates. There's no one in my life I can talk to about this and this illness can be so lonely sometimes. But I'm so sorry you have to go through it as well.",
          "created_utc": 1733696427.0
        }
      ]
    }
  ]
}