{
  "id": "1ha9bsj",
  "subreddit": "AnorexiaNervosa",
  "author": "Bubbly_Midnightt",
  "created_utc": 1733749684.0,
  "title": "My cousin died from starving herself yesterday ",
  "selftext": "I don’t even know what to say… \n\nNo one knew it was this bad. She was at an inpatient treatment center out of state. She died in the ICU yesterday after she kept pulling out her feeding tube and went comatose. By the time they restrained her and kept the tube in, her kidneys were already shutting down then everything else followed. \n\nI don’t know what I’m feeling, but I haven’t been able to stop thinking about it since then. Just replaying those words over and over. She starved herself to death. \n\nI’ve had to bury family members before, but this… this isn’t a reason to have to bury someone. She shouldn’t have died. She had so many years ahead of her. She wasn’t even at a low BMI. \n\nI get she was sick. Hell, I’m right here with her in that sense. It’s terrifying. \n\nI don’t know. I guess I came here to try and help myself feel better. Process it in some way. Ultimately though, I hope some of you take this as a sobering sentiment. \n\nIt’s easy to forget that death is still a looming danger even when you aren’t at a lower BMI. You’re just as much at risk. Take care of yourself. You have to. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ha9bsj/my_cousin_died_from_starving_herself_yesterday/",
  "score": 776,
  "num_comments": 38,
  "comments": [
    {
      "id": "m16rto0",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1733749684.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m16u0zi",
      "author": "Kuzukawa-san",
      "body": "It’s not exactly the same, but my bosses sister died from long-term effects of anorexia I was in the room as she got the call so I was the fist of my coworkers to hear. As she talked about her sisters Ed I felt like throwing up… I kept thinking about how one day that could be me",
      "created_utc": 1733750636.0,
      "score": 277,
      "context": []
    },
    {
      "id": "m16vak2",
      "author": "None",
      "body": "I just want to thank you for being vulnerable and coming here to process some of what you’re experiencing. Losing someone is never easy and i hope you can take care of yourself.\n\nI also just want to thank you because I think I needed a bit of a reality check. Malnutrition and starvation can be a danger to anyone. I’ve been struggling but have been brushing it off because i’m at a “healthy” weight. This helps put it into perspective so thank you again.",
      "created_utc": 1733751165.0,
      "score": 192,
      "context": []
    },
    {
      "id": "m16vxqk",
      "author": "OldNewSwiftie",
      "body": "Oh no, I am so sorry for your loss. That's a terrible way to die.\n\nI hope you're taking care of yourself as best you can. I'm so sorry.",
      "created_utc": 1733751432.0,
      "score": 61,
      "context": []
    },
    {
      "id": "m18okhc",
      "author": "ActiveEuphoric3919",
      "body": "I am so sorry for your loss. \n\nIt doesn’t ever feel like enough. People said that to me, but I didn’t believe them. I thought it would be different for me, I thought I could outsmart my body by taking certain supplements and vitamins etc. You cannot cheat your own health or body like that. You are not a unique person who is invincible because you do x, y, or z. You are not a unique case where you actually will be happy once you reach a certain goal. \n\nLuckily I was forced into treatment (which I used to adamantly disagree with until it saved me from dying at 16-20 years old at different points and I recognize in hindsight I needed it). My family and me all thought I would never recover, just live with symptoms and die young. But I did recover, and I look back at how I felt just a year ago and cannot fathom or even try to explain how convinced I was that I NEEDED to keep my ed. \n\nIf you are reading this and struggling, I cannot even put into words how much I urge you to recover. I truly never wanted to recover, my ed genuinely had many benefits in my life. It was grief and a major loss to recover, on top of that, I was so deep in my ed that I couldn’t even conceive WHY I would ever want to recover. But one day I tried anyways, I did something I had never done which was put all my trust into someone else’s hands (my team). Scariest thing I have ever done, but I am on the other side. I can see the “great filter” so to speak that I passed through, that I couldn’t see before. I like my life even though I still have problems sometimes in life. I wish I could put just a fraction of what it feels like to realize that you CAN live without an ed into everyone’s minds who struggle. Like truly, genuinely, can live without an ed. Even typing this I have a frustrating battle in my mind because I know the old and sick me just wouldn’t let what I am saying truly sink in the way me now wants it to. \n\nAnyways, all that to say, I am so sorry for your loss OP. Your cousin will not be forgotten, and remember to take care yourself right now. Ed’s are so complicated and they aren’t any one person’s “fault”. I hope your family and you can find comfort and care during this time. Feel free to message me if you need anything.\n\nTo anyone else with an ed reading this, or any other mental health struggle. There is something to hang on for and something to get better for even if you don’t see it now, even if you don’t see it in recovery, trust me because something will come make life worth living. Everyone said that to me and I never believed it until it did. I love you all, I don’t just say that. I truly know how this disorder feels and how much of a battle it is just to see the next day, but I want to see ALL of you the next day with me.",
      "created_utc": 1733772684.0,
      "score": 38,
      "context": []
    },
    {
      "id": "m16ss2a",
      "author": "None",
      "body": "I nearly died from Anorexia. Was hospitalised for a month. It is not worth it. At all. I'm much better now after 3 years. (Healthy, got menses back)",
      "created_utc": 1733750101.0,
      "score": 132,
      "context": []
    },
    {
      "id": "m16zp3v",
      "author": "izzy4ya",
      "body": "My anorexia has caused me to be pulled from my job as a Marine to be hospitalized for three months. Feeding tubes was my life for a while and while I still relapse from time to time I can wholeheartedly say it's not worth it. The pain and strain you put on those around you combined with the deviation and havoc that is wreaked upon your body. It's just not worth it. But at the end of the day... I keep going back. It's truly an illness. I know it's wrong... Heck, my Staff Sergeant and the barracks corpsman both had to feeding tube me and pump ensure into me yesterday because I hadn't eaten in three days... You're cousin was I'll and I'm so sorry for your loss but know that even though she may have known that it was harmful it may not have been in her control. It's addictive.",
      "created_utc": 1733752943.0,
      "score": 82,
      "context": []
    },
    {
      "id": "m19hbk9",
      "author": "anonchicago7",
      "body": "Low bmi isn't what kills you. What kills most people is heart attacks. That's how I've had friends go and almost went",
      "created_utc": 1733781614.0,
      "score": 25,
      "context": []
    },
    {
      "id": "m176jx4",
      "author": "Odd_Theme_3294",
      "body": "I am so sorry 💔 that’s so heart breaking.\nLook after yourself and with grief it’s okay to feel whatever you feel - anger, guilt, confusion (it’s normal and it’s okay) it’s tough x",
      "created_utc": 1733755541.0,
      "score": 14,
      "context": []
    },
    {
      "id": "m19x3ad",
      "author": "emziestone",
      "body": "She fought to control it thru her final seconds. That's how powerful this is, guys. Until your body fails in a significantly scary way, things feel relatively ok. This is a reminder that it's great at  playing provocative mind games. ♡",
      "created_utc": 1733786978.0,
      "score": 14,
      "context": []
    },
    {
      "id": "m19x1t3",
      "author": "belen-69",
      "body": "i hope everything turns out okay for you and your families and thank you for sharing this. i’m sending you all the love i can through this screen because even burying someone close to you who passed naturally is difficult. \n\ni just got out of the hospital early today from not eating. it was the worst feeling ever and not the first time it’s happened only this time took a lot more IV, time in the hospital and forcing to eat and drink just to end up vomiting it all back up over and over again. your cousins story and my hospital experience is definitely a little bit of a wake up call but still will take work. so again thank you for sharing i hope all is well for you.",
      "created_utc": 1733786963.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m176fxg",
      "author": "StaringBlnklyAtMyNVL",
      "body": "I'm sorry for your loss, I can't imagine.",
      "created_utc": 1733755500.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m17fbum",
      "author": "FLAluv86",
      "body": "I’m so sorry for ur loss! 😞 May she RIP! ❤️",
      "created_utc": 1733758567.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m1935yw",
      "author": "iisadaora",
      "body": "I'm so sorry. she deserved recovery and you do too. we all do. hope your heart may find peace and comfort, be assured she will rest in peace now.",
      "created_utc": 1733777206.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m190ekk",
      "author": "Historical-Jello-931",
      "body": "They should really discard the whole BMI system because it doesn't account for the fact that some people have more muscle, denser bone, etc. I'm really sorry they based her health on that metric and it cost her life.",
      "created_utc": 1733776357.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m19qynj",
      "author": "Individual_Craft_514",
      "body": "This is truly a heartbreaking case and I’m so sorry for your loss. She was lucky to have a family that cared for her as much as you do. I hope we can all recover and move on from this disorder.",
      "created_utc": 1733784823.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m19d9om",
      "author": "lydmit",
      "body": "I’m so sorry ❤️❤️❤️",
      "created_utc": 1733780332.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m1bjyqx",
      "author": "Outrageous-Let4612",
      "body": "And this is why doctors everywhere need to stop denying people proper treatment because they have a BMI higher than 13. The system is so messed up. I'm very sorry to hear about your cousin.",
      "created_utc": 1733810309.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m181d3t",
      "author": "tryingtorec0v3r",
      "body": "i'm beyond sorry for your loss, i'm sending you hugs, prayers, strength and whatever else you need to \"get through\" this unimaginable time💔",
      "created_utc": 1733765548.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m18x087",
      "author": "MetalingusMikeII",
      "body": "That’s heartbreaking. Really sorry for your loss 💔",
      "created_utc": 1733775295.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m19p1fv",
      "author": "runninginbubbles",
      "body": "Holy shit, I am so so sorry to hear this. Such a devastating loss, heartbreaking. Sending love to you and your family.",
      "created_utc": 1733784170.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1g0k85",
      "author": "princessuuke",
      "body": "Im so sorry. But also thank you for sharing... I fear if this disorder kills me im just going to hurt people worse than when i attempted to take my life as a teen. Sometimes i need that reminder",
      "created_utc": 1733875143.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1beszt",
      "author": "TheBeaniestBeans",
      "body": "My condolences to you during these times. I'm not sure what else to say. This is rough.",
      "created_utc": 1733807686.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m16sk1r",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1733750004.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mtiesll",
      "author": "AccessOk6501",
      "body": "RIP",
      "created_utc": 1747849624.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m19bt3f",
      "author": "BasOutten",
      "body": "hating food so much you pull out your own g tube. that is something i have never heard of before. Did she have any other mental illnesses by chance?",
      "created_utc": 1733779871.0,
      "score": -22,
      "context": []
    },
    {
      "id": "m16tkc6",
      "author": "Bubbly_Midnightt",
      "body": "I’m so, so proud of you. You’re so resilient. I’m so glad you’re still here.",
      "created_utc": 1733750439.0,
      "score": 60,
      "context": [
        {
          "id": "m16ss2a",
          "author": "None",
          "body": "I nearly died from Anorexia. Was hospitalised for a month. It is not worth it. At all. I'm much better now after 3 years. (Healthy, got menses back)",
          "created_utc": 1733750101.0
        }
      ]
    },
    {
      "id": "m186dxg",
      "author": "Dammit234",
      "body": "What are the marines doing to help you? You seem to be in very active AN. I am former military and there has to be some program they could get you in to help.",
      "created_utc": 1733767076.0,
      "score": 16,
      "context": [
        {
          "id": "m16zp3v",
          "author": "izzy4ya",
          "body": "My anorexia has caused me to be pulled from my job as a Marine to be hospitalized for three months. Feeding tubes was my life for a while and while I still relapse from time to time I can wholeheartedly say it's not worth it. The pain and strain you put on those around you combined with the deviation and havoc that is wreaked upon your body. It's just not worth it. But at the end of the day... I keep going back. It's truly an illness. I know it's wrong... Heck, my Staff Sergeant and the barracks corpsman both had to feeding tube me and pump ensure into me yesterday because I hadn't eaten in three days... You're cousin was I'll and I'm so sorry for your loss but know that even though she may have known that it was harmful it may not have been in her control. It's addictive.",
          "created_utc": 1733752943.0
        }
      ]
    },
    {
      "id": "m16zxvp",
      "author": "izzy4ya",
      "body": "I'm still fighting for my life every day just as I hope we all do.",
      "created_utc": 1733753040.0,
      "score": 18,
      "context": [
        {
          "id": "m16zp3v",
          "author": "izzy4ya",
          "body": "My anorexia has caused me to be pulled from my job as a Marine to be hospitalized for three months. Feeding tubes was my life for a while and while I still relapse from time to time I can wholeheartedly say it's not worth it. The pain and strain you put on those around you combined with the deviation and havoc that is wreaked upon your body. It's just not worth it. But at the end of the day... I keep going back. It's truly an illness. I know it's wrong... Heck, my Staff Sergeant and the barracks corpsman both had to feeding tube me and pump ensure into me yesterday because I hadn't eaten in three days... You're cousin was I'll and I'm so sorry for your loss but know that even though she may have known that it was harmful it may not have been in her control. It's addictive.",
          "created_utc": 1733752943.0
        }
      ]
    },
    {
      "id": "m16tej3",
      "author": "Bubbly_Midnightt",
      "body": "I saw her in January. She looked fine and seemed to be eating totally normal. But at the same time she had gone from overweight to healthy over the last two years. \n\nShe went on a cruise this summer and came back around September, saying she needed to lose weight because she ate too much on the cruise. \n\nShe wasn’t right in the head after that cruise. It got pretty bad since then. So only around 2-3 months from what we know.",
      "created_utc": 1733750371.0,
      "score": 38,
      "context": [
        {
          "id": "m16sk1r",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733750004.0
        }
      ]
    },
    {
      "id": "m1a6lfd",
      "author": "winter_dreams",
      "body": "Huh? An extreme fear of weight gain is a very basic symptom of anorexia…",
      "created_utc": 1733790369.0,
      "score": 23,
      "context": [
        {
          "id": "m19bt3f",
          "author": "BasOutten",
          "body": "hating food so much you pull out your own g tube. that is something i have never heard of before. Did she have any other mental illnesses by chance?",
          "created_utc": 1733779871.0
        }
      ]
    },
    {
      "id": "m16tvcq",
      "author": "None",
      "body": "Thank you. The journey was terrifying and heartbreaking and just pure hell. The worst time in my life. But there IS light at the end of the tunnel.",
      "created_utc": 1733750569.0,
      "score": 28,
      "context": [
        {
          "id": "m16ss2a",
          "author": "None",
          "body": "I nearly died from Anorexia. Was hospitalised for a month. It is not worth it. At all. I'm much better now after 3 years. (Healthy, got menses back)",
          "created_utc": 1733750101.0
        },
        {
          "id": "m16tkc6",
          "author": "Bubbly_Midnightt",
          "body": "I’m so, so proud of you. You’re so resilient. I’m so glad you’re still here.",
          "created_utc": 1733750439.0
        }
      ]
    },
    {
      "id": "m187uqj",
      "author": "izzy4ya",
      "body": "The Marines have provided me with both a dietitian and therapist as well as a psychiatrist and I have just completed the med board process receiving 80% disability. Don't get me wrong, I love the Marine Corps and wish I could have served longer but between my anorexia and other disabilities it is time for me to get out.",
      "created_utc": 1733767528.0,
      "score": 30,
      "context": [
        {
          "id": "m16zp3v",
          "author": "izzy4ya",
          "body": "My anorexia has caused me to be pulled from my job as a Marine to be hospitalized for three months. Feeding tubes was my life for a while and while I still relapse from time to time I can wholeheartedly say it's not worth it. The pain and strain you put on those around you combined with the deviation and havoc that is wreaked upon your body. It's just not worth it. But at the end of the day... I keep going back. It's truly an illness. I know it's wrong... Heck, my Staff Sergeant and the barracks corpsman both had to feeding tube me and pump ensure into me yesterday because I hadn't eaten in three days... You're cousin was I'll and I'm so sorry for your loss but know that even though she may have known that it was harmful it may not have been in her control. It's addictive.",
          "created_utc": 1733752943.0
        },
        {
          "id": "m186dxg",
          "author": "Dammit234",
          "body": "What are the marines doing to help you? You seem to be in very active AN. I am former military and there has to be some program they could get you in to help.",
          "created_utc": 1733767076.0
        }
      ]
    },
    {
      "id": "m16tnp2",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1733750479.0,
      "score": 23,
      "context": [
        {
          "id": "m16sk1r",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733750004.0
        },
        {
          "id": "m16tej3",
          "author": "Bubbly_Midnightt",
          "body": "I saw her in January. She looked fine and seemed to be eating totally normal. But at the same time she had gone from overweight to healthy over the last two years. \n\nShe went on a cruise this summer and came back around September, saying she needed to lose weight because she ate too much on the cruise. \n\nShe wasn’t right in the head after that cruise. It got pretty bad since then. So only around 2-3 months from what we know.",
          "created_utc": 1733750371.0
        }
      ]
    },
    {
      "id": "m1b4849",
      "author": "BasOutten",
      "body": "Okay, aaaand? I said that I'd never heard about somebody ripping their own g tube out, not that anorexic patients didn't have a fear of weight gain.",
      "created_utc": 1733802982.0,
      "score": -15,
      "context": [
        {
          "id": "m19bt3f",
          "author": "BasOutten",
          "body": "hating food so much you pull out your own g tube. that is something i have never heard of before. Did she have any other mental illnesses by chance?",
          "created_utc": 1733779871.0
        },
        {
          "id": "m1a6lfd",
          "author": "winter_dreams",
          "body": "Huh? An extreme fear of weight gain is a very basic symptom of anorexia…",
          "created_utc": 1733790369.0
        }
      ]
    },
    {
      "id": "m2fuqn5",
      "author": "Dammit234",
      "body": "Well, this random internet person is praying for you and really hoping you find a route that helps you fight this evil demon.  I never had an ED but my best friend did so i went through  it vicariously. She didn’t find the route to health and i miss her everyday. Use the military - push them to help don’t let them ignore you or act like it isn’t a big deal. Few people (outside of this group) know that AN is the most deadly of all mental illnesses. Semper Fi sister",
      "created_utc": 1734406010.0,
      "score": 3,
      "context": [
        {
          "id": "m16zp3v",
          "author": "izzy4ya",
          "body": "My anorexia has caused me to be pulled from my job as a Marine to be hospitalized for three months. Feeding tubes was my life for a while and while I still relapse from time to time I can wholeheartedly say it's not worth it. The pain and strain you put on those around you combined with the deviation and havoc that is wreaked upon your body. It's just not worth it. But at the end of the day... I keep going back. It's truly an illness. I know it's wrong... Heck, my Staff Sergeant and the barracks corpsman both had to feeding tube me and pump ensure into me yesterday because I hadn't eaten in three days... You're cousin was I'll and I'm so sorry for your loss but know that even though she may have known that it was harmful it may not have been in her control. It's addictive.",
          "created_utc": 1733752943.0
        },
        {
          "id": "m186dxg",
          "author": "Dammit234",
          "body": "What are the marines doing to help you? You seem to be in very active AN. I am former military and there has to be some program they could get you in to help.",
          "created_utc": 1733767076.0
        },
        {
          "id": "m187uqj",
          "author": "izzy4ya",
          "body": "The Marines have provided me with both a dietitian and therapist as well as a psychiatrist and I have just completed the med board process receiving 80% disability. Don't get me wrong, I love the Marine Corps and wish I could have served longer but between my anorexia and other disabilities it is time for me to get out.",
          "created_utc": 1733767528.0
        }
      ]
    },
    {
      "id": "m17t3jw",
      "author": "Rhyme_orange_",
      "body": "Same here. It sounds like the hospital did everything they could. But if she was ripping out her NG tubes, could they not have given her something to ease the anxiety at the very least? I’ve had seizures and they restrained me. If Anorexia is a physics and mental illness then it would make sense to use physical and mental measures like medications when needed and physical restraints when needed. Maybe least to most intrusive.",
      "created_utc": 1733762975.0,
      "score": 18,
      "context": [
        {
          "id": "m16sk1r",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733750004.0
        },
        {
          "id": "m16tej3",
          "author": "Bubbly_Midnightt",
          "body": "I saw her in January. She looked fine and seemed to be eating totally normal. But at the same time she had gone from overweight to healthy over the last two years. \n\nShe went on a cruise this summer and came back around September, saying she needed to lose weight because she ate too much on the cruise. \n\nShe wasn’t right in the head after that cruise. It got pretty bad since then. So only around 2-3 months from what we know.",
          "created_utc": 1733750371.0
        },
        {
          "id": "m16tnp2",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733750479.0
        }
      ]
    },
    {
      "id": "m1gyeay",
      "author": "winter_dreams",
      "body": "… right, so it’s not a stretch to imagine that someone with an extreme fear of weight gain would want to remove a device that’s pumping nutrient dense feed into them. You asked if they had any other mental illness as if you couldn’t believe anorexia was sufficient to make someone want to do that. That’s all.",
      "created_utc": 1733887839.0,
      "score": 5,
      "context": [
        {
          "id": "m19bt3f",
          "author": "BasOutten",
          "body": "hating food so much you pull out your own g tube. that is something i have never heard of before. Did she have any other mental illnesses by chance?",
          "created_utc": 1733779871.0
        },
        {
          "id": "m1a6lfd",
          "author": "winter_dreams",
          "body": "Huh? An extreme fear of weight gain is a very basic symptom of anorexia…",
          "created_utc": 1733790369.0
        },
        {
          "id": "m1b4849",
          "author": "BasOutten",
          "body": "Okay, aaaand? I said that I'd never heard about somebody ripping their own g tube out, not that anorexic patients didn't have a fear of weight gain.",
          "created_utc": 1733802982.0
        }
      ]
    },
    {
      "id": "m2gi1hn",
      "author": "izzy4ya",
      "body": "Semper Fi",
      "created_utc": 1734416877.0,
      "score": 2,
      "context": [
        {
          "id": "m16zp3v",
          "author": "izzy4ya",
          "body": "My anorexia has caused me to be pulled from my job as a Marine to be hospitalized for three months. Feeding tubes was my life for a while and while I still relapse from time to time I can wholeheartedly say it's not worth it. The pain and strain you put on those around you combined with the deviation and havoc that is wreaked upon your body. It's just not worth it. But at the end of the day... I keep going back. It's truly an illness. I know it's wrong... Heck, my Staff Sergeant and the barracks corpsman both had to feeding tube me and pump ensure into me yesterday because I hadn't eaten in three days... You're cousin was I'll and I'm so sorry for your loss but know that even though she may have known that it was harmful it may not have been in her control. It's addictive.",
          "created_utc": 1733752943.0
        },
        {
          "id": "m186dxg",
          "author": "Dammit234",
          "body": "What are the marines doing to help you? You seem to be in very active AN. I am former military and there has to be some program they could get you in to help.",
          "created_utc": 1733767076.0
        },
        {
          "id": "m187uqj",
          "author": "izzy4ya",
          "body": "The Marines have provided me with both a dietitian and therapist as well as a psychiatrist and I have just completed the med board process receiving 80% disability. Don't get me wrong, I love the Marine Corps and wish I could have served longer but between my anorexia and other disabilities it is time for me to get out.",
          "created_utc": 1733767528.0
        },
        {
          "id": "m2fuqn5",
          "author": "Dammit234",
          "body": "Well, this random internet person is praying for you and really hoping you find a route that helps you fight this evil demon.  I never had an ED but my best friend did so i went through  it vicariously. She didn’t find the route to health and i miss her everyday. Use the military - push them to help don’t let them ignore you or act like it isn’t a big deal. Few people (outside of this group) know that AN is the most deadly of all mental illnesses. Semper Fi sister",
          "created_utc": 1734406010.0
        }
      ]
    },
    {
      "id": "m2vwpck",
      "author": "BasOutten",
      "body": "Ok, and I'm saying I've never heard of somebody doing that before. Why does that statement offend you say much? \n\nAnd yeah, I can't believe anorexia alone is enough to do that. I generally only see patients with profound intellectual disabilities, violent psychotic disorders, and dementia pull g tubes.",
      "created_utc": 1734644096.0,
      "score": 1,
      "context": [
        {
          "id": "m19bt3f",
          "author": "BasOutten",
          "body": "hating food so much you pull out your own g tube. that is something i have never heard of before. Did she have any other mental illnesses by chance?",
          "created_utc": 1733779871.0
        },
        {
          "id": "m1a6lfd",
          "author": "winter_dreams",
          "body": "Huh? An extreme fear of weight gain is a very basic symptom of anorexia…",
          "created_utc": 1733790369.0
        },
        {
          "id": "m1b4849",
          "author": "BasOutten",
          "body": "Okay, aaaand? I said that I'd never heard about somebody ripping their own g tube out, not that anorexic patients didn't have a fear of weight gain.",
          "created_utc": 1733802982.0
        },
        {
          "id": "m1gyeay",
          "author": "winter_dreams",
          "body": "… right, so it’s not a stretch to imagine that someone with an extreme fear of weight gain would want to remove a device that’s pumping nutrient dense feed into them. You asked if they had any other mental illness as if you couldn’t believe anorexia was sufficient to make someone want to do that. That’s all.",
          "created_utc": 1733887839.0
        }
      ]
    }
  ]
}