{
  "id": "1hamnxk",
  "subreddit": "AnorexiaNervosa",
  "author": "No_Necessary_8424",
  "created_utc": 1733784113.0,
  "title": "DAE stutter and/or slur their words when speaking? ",
  "selftext": "So I’ve been heavily restricting for almost four months now. Like this is the worst my anorexia has ever been. And I’m noticing that when I talk to people at work I end up stuttering and not being able to say a word or phrase properly. I find myself having to repeat the last part of what I said a lot. And for the slurring of words, it’s not so bad as to where people are gonna think I’m inebriated, more so like talking more slowly and dragging out words occasionally. It’s so strange and I hate it.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1hamnxk/dae_stutter_andor_slur_their_words_when_speaking/",
  "score": 108,
  "num_comments": 33,
  "comments": [
    {
      "id": "m19ovi8",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1733784114.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m19v6pw",
      "author": "Practical-Ad2512",
      "body": "This is an issue I experience as well. People are now constantly asking me to repeat myself, when I’ve always been told I’m an excellent speaker. \nWhat has kinda helped me is bringing a couple cold bottles of water to work. I keep them in the fridge, and since I’m so drowsy the water kinda wakes me up momentarily. It’s obviously not a permanent fix, but it helps me :) \nI’m sorry your dealing with this and wish you well!",
      "created_utc": 1733786305.0,
      "score": 39,
      "context": []
    },
    {
      "id": "m19r6oh",
      "author": "Odd_Theme_3294",
      "body": "I can’t write or speak fluently anymore really\nA few sentences at a time are okay\nBut anything more and it’s a mess",
      "created_utc": 1733784901.0,
      "score": 30,
      "context": []
    },
    {
      "id": "m1a3ehj",
      "author": "oyroo",
      "body": "yeah, anorexia literally reduces your brain matter which will disrupt functional connections between regions necessary for speech generation. the brain is a ball of fat, so it's pretty susceptible to deterioration from restriction",
      "created_utc": 1733789230.0,
      "score": 27,
      "context": []
    },
    {
      "id": "m19v7eo",
      "author": "fineok_17",
      "body": "I get this too! I'm glad I'm not the only one. I keep stumbling my words or completely.forgetting what I'm talking about. It's embarrassing and I don't want people thinking I'm inebriated or something but yeah my brain is losing a lot of functioning and it freaks me out",
      "created_utc": 1733786311.0,
      "score": 20,
      "context": []
    },
    {
      "id": "m19ukge",
      "author": "operaling",
      "body": "It’s becoming a problem for me, like people sometimes ask me if I’m high. I’m also having a lot more trouble forming sentences and remembering words.",
      "created_utc": 1733786087.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m19yhr2",
      "author": "HerElectronicHaze",
      "body": "I didn’t think I slurred words, but my family keeps telling me I do :-(\n\nMy brain also feels like it’s working way too slowly and I can’t remember words/events. It takes a lot of time and effort to remember things, if I even do",
      "created_utc": 1733787480.0,
      "score": 14,
      "context": []
    },
    {
      "id": "m1a3bdu",
      "author": "Chaerin_Sistas",
      "body": "Oh me too. Someone this one guy asked me if I’m high before cuz I looked so out of it and spoke slurred. I just can’t spare any energy to speak articulately and my brain is sludge",
      "created_utc": 1733789199.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m1aquxh",
      "author": "beautifulchaos22",
      "body": "Hey, just wanted to chime in to say your experiences are valid and understandable. I commented on a similar post a bit ago regarding speech and anorexia.\n\nI'm a registered Speech Language Pathologist (SLP) and I also have anorexia. Preface that I'm not giving medical advice or anything, just an SLP who happened to see this post and thought I'd comment as an ally who happens to work in the SLP field.\n\nI've also dealt with slurring speech, and it's likely because expressive language (like verbal speech) is mainly controlled in what's called Broca's area of the brain. This is in the frontal cortex, which is responsible for higher-level thinking and decision-making- including language. When our brains are starved, they will pull function from the \"less\" crucial areas like speech and language, to keep survival functions going, to keep you alive. So you may find you have a harder time making decisions, rationalizing, and expressing yourself. \n\nThere are also speech and language conditions that are a result of planning issues and miscommunication between the brain and the muscles used to make sounds. Producing speech is actually an incredibly complex process but in most of us, it's automatic and so we don't think about the steps it takes from thinking of a word to say, to moving your muscles to produce the sounds. When your brain is starved, there can be a mix-up in this process, and so it may be harder for your brain to produce words. It's commonly referred to as apraxia of speech, and in these cases, actual motor movement of the speech muscles is not usually impaired, rather its a problem within that pathway of your brain thinking of the target sounds and actually controlling the muscles to say them (motor planning). Not saying you have that, just wanted to illustrate that there are speech issues that are more about motor planning vs problems with the muscles themselves. \n\nOf course, with anorexia and muscle wasting in some cases, there can be wasting of the mouth, esophagus and pharyngeal muscles and this can also cause issues with physically moving your mouth to produce sounds too.\n\nIt's likely that with nutritional and physical rehabilitation, you'll find it easier to speak and that the slurring will lessen, but consult an SLP if it persists even with weight restoration (if required) and nutritional rehabilitation.\n\n  \nI know that I have problems making decisions, expressing myself and even rate of speech is lower when I'm not doing well ED wise.\n\n  \nWishing you all the best and I hope this helped some!",
      "created_utc": 1733797776.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m1a36jk",
      "author": "Peanut2ur_Tostito",
      "body": "I do this all the time, but it's not because of my weight. I think it's cause of my ADHD. It's very embarrassing & frustrating to me.",
      "created_utc": 1733789150.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m1c5wtx",
      "author": "lauriebunnie",
      "body": "Yeh as well as forgetting what I was even talking about halfway through a sentence and giving up on finishing what I was going to say because I try hard to remember but it’s gone and the sentence isn’t worth saying anymore. Same with text or typing, I forget to add random words sometimes (like: and, the, I, you) so when I’m rereading it I’m like “hs how did I forget to add like four words?!” 💀",
      "created_utc": 1733824566.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m1agl17",
      "author": "Temporary-Chef4663",
      "body": "Me too and I can’t comprehend anything. At work (in retail) my boss asked if I can work Wednesday, and I was completely convinced she wanted me to zone section Wednesday 😭",
      "created_utc": 1733793988.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1akodt",
      "author": "Excellent-World-476",
      "body": "Organic brain syndrome due to malnutrition.",
      "created_utc": 1733795474.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1ap3kr",
      "author": "Commercial_Affect113",
      "body": "Yes, I thought I was going crazy. It’s like my tongue is too big sometimes!",
      "created_utc": 1733797112.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1bhldb",
      "author": "pathologicalprotest",
      "body": "Yes. I speak and write for a living. I’ve been asked if I’m intoxicated. It’s embarrassing.",
      "created_utc": 1733809065.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1biqam",
      "author": "dark_humor_to_cope",
      "body": "I stutter a lot and I think it’s because of my anorexia. I’ve never heard of anyone else experiencing this, so thank you for bringing it up. I’m sorry you’re going through it too :(",
      "created_utc": 1733809653.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1bjc7a",
      "author": "Outrageous-Let4612",
      "body": "Yes, it's like my body and brain both move in slow motion but aren't synced up with each other. Anorexia causes your brain matter to shrivel up along with everything else, including the muscles required for speech.",
      "created_utc": 1733809973.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1bxl9p",
      "author": "Deepspacechris",
      "body": "Yeah, stammering/stuttering and not being able to say certain words is something I’m struggling with a lot. Granted, this started before my anorexia took over most aspects of my life, but it definitely got worse as I got more and more rigid in restricting. Maybe it’s a nutrition related issue? But I guess it’s more likely just another symptom of my broken mind and frail mental state.",
      "created_utc": 1733818694.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1c6oca",
      "author": "Skythebluestars",
      "body": "Yes! Or half way \"black out\" i dont remember what i was talking about. Or what i was gonna say. I dont remember certain words. Its like my brain forgets to function .",
      "created_utc": 1733825103.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1dyw20",
      "author": "gardenfaiiri",
      "body": "I slur and speak quite a lot slowly when I’m struggling with restriction. It’s a lot worse when I’m fasting or not eating adequately for a few days. Never happened before my ED, and those closest to me can always tell when I haven’t been eating enough because I start slurring.",
      "created_utc": 1733851721.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1bz2ab",
      "author": "None",
      "body": "yeah i also got to the point where it was hard to talk. a lot of the time i didn’t have the energy to do it and whenever i did it was hard",
      "created_utc": 1733819707.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m1t3inf",
      "author": "doe_eyed_jane",
      "body": "oh my gosh i thought i was crazy. it’s so relieving to hear that other people are experiencing this??? i feel like sometimes i can’t even speak anymore or i’m attempting to speak a foreign language that idk.  i mix up my words, stumble over sentences, and mispronounce things. it’s so embarrassing and i worry about people catching on.",
      "created_utc": 1734062323.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1ebs7d",
      "author": "hagr0216",
      "body": "get a gum with a strong mint flavor! i get an energy boost from it because the mint is so strong it kinda shocks the senses awake",
      "created_utc": 1733855716.0,
      "score": 3,
      "context": [
        {
          "id": "m19v6pw",
          "author": "Practical-Ad2512",
          "body": "This is an issue I experience as well. People are now constantly asking me to repeat myself, when I’ve always been told I’m an excellent speaker. \nWhat has kinda helped me is bringing a couple cold bottles of water to work. I keep them in the fridge, and since I’m so drowsy the water kinda wakes me up momentarily. It’s obviously not a permanent fix, but it helps me :) \nI’m sorry your dealing with this and wish you well!",
          "created_utc": 1733786305.0
        }
      ]
    },
    {
      "id": "m1a6xm5",
      "author": "61114311536123511",
      "body": "✨ swiss cheese brain ✨",
      "created_utc": 1733790490.0,
      "score": 8,
      "context": [
        {
          "id": "m1a3bdu",
          "author": "Chaerin_Sistas",
          "body": "Oh me too. Someone this one guy asked me if I’m high before cuz I looked so out of it and spoke slurred. I just can’t spare any energy to speak articulately and my brain is sludge",
          "created_utc": 1733789199.0
        }
      ]
    },
    {
      "id": "m1h2ta4",
      "author": "amorphousbeingg_3",
      "body": "Whoa this is so so interesting! Thank you so much for sharing. I've been having a hard time getting words out/choking on my words out of nowhere, also laughing louder than I mean to and letting out extremely bizarre laughs. This makes so much sense!",
      "created_utc": 1733889654.0,
      "score": 2,
      "context": [
        {
          "id": "m1aquxh",
          "author": "beautifulchaos22",
          "body": "Hey, just wanted to chime in to say your experiences are valid and understandable. I commented on a similar post a bit ago regarding speech and anorexia.\n\nI'm a registered Speech Language Pathologist (SLP) and I also have anorexia. Preface that I'm not giving medical advice or anything, just an SLP who happened to see this post and thought I'd comment as an ally who happens to work in the SLP field.\n\nI've also dealt with slurring speech, and it's likely because expressive language (like verbal speech) is mainly controlled in what's called Broca's area of the brain. This is in the frontal cortex, which is responsible for higher-level thinking and decision-making- including language. When our brains are starved, they will pull function from the \"less\" crucial areas like speech and language, to keep survival functions going, to keep you alive. So you may find you have a harder time making decisions, rationalizing, and expressing yourself. \n\nThere are also speech and language conditions that are a result of planning issues and miscommunication between the brain and the muscles used to make sounds. Producing speech is actually an incredibly complex process but in most of us, it's automatic and so we don't think about the steps it takes from thinking of a word to say, to moving your muscles to produce the sounds. When your brain is starved, there can be a mix-up in this process, and so it may be harder for your brain to produce words. It's commonly referred to as apraxia of speech, and in these cases, actual motor movement of the speech muscles is not usually impaired, rather its a problem within that pathway of your brain thinking of the target sounds and actually controlling the muscles to say them (motor planning). Not saying you have that, just wanted to illustrate that there are speech issues that are more about motor planning vs problems with the muscles themselves. \n\nOf course, with anorexia and muscle wasting in some cases, there can be wasting of the mouth, esophagus and pharyngeal muscles and this can also cause issues with physically moving your mouth to produce sounds too.\n\nIt's likely that with nutritional and physical rehabilitation, you'll find it easier to speak and that the slurring will lessen, but consult an SLP if it persists even with weight restoration (if required) and nutritional rehabilitation.\n\n  \nI know that I have problems making decisions, expressing myself and even rate of speech is lower when I'm not doing well ED wise.\n\n  \nWishing you all the best and I hope this helped some!",
          "created_utc": 1733797776.0
        }
      ]
    },
    {
      "id": "m1abbft",
      "author": "Rhyme_orange_",
      "body": "Me too. And I just adopted a kitten with my boyfriend. I have a bird as well. It’s literally been a full time job today alone. We picked the most sensitive kitten omg he needs a mommy. \n     And I never thought of myself as a mother to my bird haha. And now that I have a moment at all to be on Reddit today, I totally can relate. I’m lucky I take ADHD meds. And have some benzos saved for maybe myself today.\n      I was on my knees on the tile floor like all day. With a kitten falling asleep literally in my arms three times. It was so precious. Haven’t even had time to eat or shower yet. Any noise and it disturbs this little guy Frankl.\n      Should I take the benzos? I’ve got a new psychiatrist appointment tomorrow morning first thing. I have no idea what they’ll say.",
      "created_utc": 1733792070.0,
      "score": 3,
      "context": [
        {
          "id": "m1a36jk",
          "author": "Peanut2ur_Tostito",
          "body": "I do this all the time, but it's not because of my weight. I think it's cause of my ADHD. It's very embarrassing & frustrating to me.",
          "created_utc": 1733789150.0
        }
      ]
    },
    {
      "id": "m1h7h3o",
      "author": "beautifulchaos22",
      "body": "You’re welcome! I get excited talking about SLP stuff haha, my responses end up being longer than planned! I’m glad you found it interesting, the brain is such an adaptive organ.",
      "created_utc": 1733891692.0,
      "score": 2,
      "context": [
        {
          "id": "m1aquxh",
          "author": "beautifulchaos22",
          "body": "Hey, just wanted to chime in to say your experiences are valid and understandable. I commented on a similar post a bit ago regarding speech and anorexia.\n\nI'm a registered Speech Language Pathologist (SLP) and I also have anorexia. Preface that I'm not giving medical advice or anything, just an SLP who happened to see this post and thought I'd comment as an ally who happens to work in the SLP field.\n\nI've also dealt with slurring speech, and it's likely because expressive language (like verbal speech) is mainly controlled in what's called Broca's area of the brain. This is in the frontal cortex, which is responsible for higher-level thinking and decision-making- including language. When our brains are starved, they will pull function from the \"less\" crucial areas like speech and language, to keep survival functions going, to keep you alive. So you may find you have a harder time making decisions, rationalizing, and expressing yourself. \n\nThere are also speech and language conditions that are a result of planning issues and miscommunication between the brain and the muscles used to make sounds. Producing speech is actually an incredibly complex process but in most of us, it's automatic and so we don't think about the steps it takes from thinking of a word to say, to moving your muscles to produce the sounds. When your brain is starved, there can be a mix-up in this process, and so it may be harder for your brain to produce words. It's commonly referred to as apraxia of speech, and in these cases, actual motor movement of the speech muscles is not usually impaired, rather its a problem within that pathway of your brain thinking of the target sounds and actually controlling the muscles to say them (motor planning). Not saying you have that, just wanted to illustrate that there are speech issues that are more about motor planning vs problems with the muscles themselves. \n\nOf course, with anorexia and muscle wasting in some cases, there can be wasting of the mouth, esophagus and pharyngeal muscles and this can also cause issues with physically moving your mouth to produce sounds too.\n\nIt's likely that with nutritional and physical rehabilitation, you'll find it easier to speak and that the slurring will lessen, but consult an SLP if it persists even with weight restoration (if required) and nutritional rehabilitation.\n\n  \nI know that I have problems making decisions, expressing myself and even rate of speech is lower when I'm not doing well ED wise.\n\n  \nWishing you all the best and I hope this helped some!",
          "created_utc": 1733797776.0
        },
        {
          "id": "m1h2ta4",
          "author": "amorphousbeingg_3",
          "body": "Whoa this is so so interesting! Thank you so much for sharing. I've been having a hard time getting words out/choking on my words out of nowhere, also laughing louder than I mean to and letting out extremely bizarre laughs. This makes so much sense!",
          "created_utc": 1733889654.0
        }
      ]
    },
    {
      "id": "m1aepex",
      "author": "Peanut2ur_Tostito",
      "body": "I'm on Benzo's for sleep. I bet the kitten is adorable! Yea, I take Vyvanse & though it works, it doesn't last all day for me. So I still slur & studder sometimes. It sucks!",
      "created_utc": 1733793302.0,
      "score": 6,
      "context": [
        {
          "id": "m1a36jk",
          "author": "Peanut2ur_Tostito",
          "body": "I do this all the time, but it's not because of my weight. I think it's cause of my ADHD. It's very embarrassing & frustrating to me.",
          "created_utc": 1733789150.0
        },
        {
          "id": "m1abbft",
          "author": "Rhyme_orange_",
          "body": "Me too. And I just adopted a kitten with my boyfriend. I have a bird as well. It’s literally been a full time job today alone. We picked the most sensitive kitten omg he needs a mommy. \n     And I never thought of myself as a mother to my bird haha. And now that I have a moment at all to be on Reddit today, I totally can relate. I’m lucky I take ADHD meds. And have some benzos saved for maybe myself today.\n      I was on my knees on the tile floor like all day. With a kitten falling asleep literally in my arms three times. It was so precious. Haven’t even had time to eat or shower yet. Any noise and it disturbs this little guy Frankl.\n      Should I take the benzos? I’ve got a new psychiatrist appointment tomorrow morning first thing. I have no idea what they’ll say.",
          "created_utc": 1733792070.0
        }
      ]
    },
    {
      "id": "m1es8gj",
      "author": "Rhyme_orange_",
      "body": "I’m so sorry! How long have you been on it?",
      "created_utc": 1733860813.0,
      "score": 2,
      "context": [
        {
          "id": "m1a36jk",
          "author": "Peanut2ur_Tostito",
          "body": "I do this all the time, but it's not because of my weight. I think it's cause of my ADHD. It's very embarrassing & frustrating to me.",
          "created_utc": 1733789150.0
        },
        {
          "id": "m1abbft",
          "author": "Rhyme_orange_",
          "body": "Me too. And I just adopted a kitten with my boyfriend. I have a bird as well. It’s literally been a full time job today alone. We picked the most sensitive kitten omg he needs a mommy. \n     And I never thought of myself as a mother to my bird haha. And now that I have a moment at all to be on Reddit today, I totally can relate. I’m lucky I take ADHD meds. And have some benzos saved for maybe myself today.\n      I was on my knees on the tile floor like all day. With a kitten falling asleep literally in my arms three times. It was so precious. Haven’t even had time to eat or shower yet. Any noise and it disturbs this little guy Frankl.\n      Should I take the benzos? I’ve got a new psychiatrist appointment tomorrow morning first thing. I have no idea what they’ll say.",
          "created_utc": 1733792070.0
        },
        {
          "id": "m1aepex",
          "author": "Peanut2ur_Tostito",
          "body": "I'm on Benzo's for sleep. I bet the kitten is adorable! Yea, I take Vyvanse & though it works, it doesn't last all day for me. So I still slur & studder sometimes. It sucks!",
          "created_utc": 1733793302.0
        }
      ]
    },
    {
      "id": "m1eswwr",
      "author": "Peanut2ur_Tostito",
      "body": "This time around a year. But I've taken it before when I lived in a different place for about 6 months.",
      "created_utc": 1733861026.0,
      "score": 2,
      "context": [
        {
          "id": "m1a36jk",
          "author": "Peanut2ur_Tostito",
          "body": "I do this all the time, but it's not because of my weight. I think it's cause of my ADHD. It's very embarrassing & frustrating to me.",
          "created_utc": 1733789150.0
        },
        {
          "id": "m1abbft",
          "author": "Rhyme_orange_",
          "body": "Me too. And I just adopted a kitten with my boyfriend. I have a bird as well. It’s literally been a full time job today alone. We picked the most sensitive kitten omg he needs a mommy. \n     And I never thought of myself as a mother to my bird haha. And now that I have a moment at all to be on Reddit today, I totally can relate. I’m lucky I take ADHD meds. And have some benzos saved for maybe myself today.\n      I was on my knees on the tile floor like all day. With a kitten falling asleep literally in my arms three times. It was so precious. Haven’t even had time to eat or shower yet. Any noise and it disturbs this little guy Frankl.\n      Should I take the benzos? I’ve got a new psychiatrist appointment tomorrow morning first thing. I have no idea what they’ll say.",
          "created_utc": 1733792070.0
        },
        {
          "id": "m1aepex",
          "author": "Peanut2ur_Tostito",
          "body": "I'm on Benzo's for sleep. I bet the kitten is adorable! Yea, I take Vyvanse & though it works, it doesn't last all day for me. So I still slur & studder sometimes. It sucks!",
          "created_utc": 1733793302.0
        },
        {
          "id": "m1es8gj",
          "author": "Rhyme_orange_",
          "body": "I’m so sorry! How long have you been on it?",
          "created_utc": 1733860813.0
        }
      ]
    },
    {
      "id": "m1lz6qv",
      "author": "Rhyme_orange_",
      "body": "Gotcha. I hope they help you. I used to be prescribed too much and then kind of abused them. I’m basically off them now but take them 2-3 times a month without issue. \nI hope you’re doing well. Thanks for the reply. 💛",
      "created_utc": 1733960599.0,
      "score": 2,
      "context": [
        {
          "id": "m1a36jk",
          "author": "Peanut2ur_Tostito",
          "body": "I do this all the time, but it's not because of my weight. I think it's cause of my ADHD. It's very embarrassing & frustrating to me.",
          "created_utc": 1733789150.0
        },
        {
          "id": "m1abbft",
          "author": "Rhyme_orange_",
          "body": "Me too. And I just adopted a kitten with my boyfriend. I have a bird as well. It’s literally been a full time job today alone. We picked the most sensitive kitten omg he needs a mommy. \n     And I never thought of myself as a mother to my bird haha. And now that I have a moment at all to be on Reddit today, I totally can relate. I’m lucky I take ADHD meds. And have some benzos saved for maybe myself today.\n      I was on my knees on the tile floor like all day. With a kitten falling asleep literally in my arms three times. It was so precious. Haven’t even had time to eat or shower yet. Any noise and it disturbs this little guy Frankl.\n      Should I take the benzos? I’ve got a new psychiatrist appointment tomorrow morning first thing. I have no idea what they’ll say.",
          "created_utc": 1733792070.0
        },
        {
          "id": "m1aepex",
          "author": "Peanut2ur_Tostito",
          "body": "I'm on Benzo's for sleep. I bet the kitten is adorable! Yea, I take Vyvanse & though it works, it doesn't last all day for me. So I still slur & studder sometimes. It sucks!",
          "created_utc": 1733793302.0
        },
        {
          "id": "m1es8gj",
          "author": "Rhyme_orange_",
          "body": "I’m so sorry! How long have you been on it?",
          "created_utc": 1733860813.0
        },
        {
          "id": "m1eswwr",
          "author": "Peanut2ur_Tostito",
          "body": "This time around a year. But I've taken it before when I lived in a different place for about 6 months.",
          "created_utc": 1733861026.0
        }
      ]
    },
    {
      "id": "m1mj9to",
      "author": "Peanut2ur_Tostito",
      "body": "Take care!",
      "created_utc": 1733967848.0,
      "score": 2,
      "context": [
        {
          "id": "m1a36jk",
          "author": "Peanut2ur_Tostito",
          "body": "I do this all the time, but it's not because of my weight. I think it's cause of my ADHD. It's very embarrassing & frustrating to me.",
          "created_utc": 1733789150.0
        },
        {
          "id": "m1abbft",
          "author": "Rhyme_orange_",
          "body": "Me too. And I just adopted a kitten with my boyfriend. I have a bird as well. It’s literally been a full time job today alone. We picked the most sensitive kitten omg he needs a mommy. \n     And I never thought of myself as a mother to my bird haha. And now that I have a moment at all to be on Reddit today, I totally can relate. I’m lucky I take ADHD meds. And have some benzos saved for maybe myself today.\n      I was on my knees on the tile floor like all day. With a kitten falling asleep literally in my arms three times. It was so precious. Haven’t even had time to eat or shower yet. Any noise and it disturbs this little guy Frankl.\n      Should I take the benzos? I’ve got a new psychiatrist appointment tomorrow morning first thing. I have no idea what they’ll say.",
          "created_utc": 1733792070.0
        },
        {
          "id": "m1aepex",
          "author": "Peanut2ur_Tostito",
          "body": "I'm on Benzo's for sleep. I bet the kitten is adorable! Yea, I take Vyvanse & though it works, it doesn't last all day for me. So I still slur & studder sometimes. It sucks!",
          "created_utc": 1733793302.0
        },
        {
          "id": "m1es8gj",
          "author": "Rhyme_orange_",
          "body": "I’m so sorry! How long have you been on it?",
          "created_utc": 1733860813.0
        },
        {
          "id": "m1eswwr",
          "author": "Peanut2ur_Tostito",
          "body": "This time around a year. But I've taken it before when I lived in a different place for about 6 months.",
          "created_utc": 1733861026.0
        },
        {
          "id": "m1lz6qv",
          "author": "Rhyme_orange_",
          "body": "Gotcha. I hope they help you. I used to be prescribed too much and then kind of abused them. I’m basically off them now but take them 2-3 times a month without issue. \nI hope you’re doing well. Thanks for the reply. 💛",
          "created_utc": 1733960599.0
        }
      ]
    }
  ]
}