{
  "id": "1hb4q5c",
  "subreddit": "AnorexiaNervosa",
  "author": "internetcatalliance",
  "created_utc": 1733845652.0,
  "title": "How many of you arent UW?",
  "selftext": "Seriously, never been and probably never will, Im in the higher normal range, it feels like I'm the only one.\n\nEverywhere I turn its always underweight this underweight that, underweight underweight ....\n\nI feel forgotten by the medical world, and overall kinda alone amongst fellow anorexics even.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1hb4q5c/how_many_of_you_arent_uw/",
  "score": 173,
  "num_comments": 122,
  "comments": [
    {
      "id": "m1dfskc",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1733845652.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1dnqnu",
      "author": "ButtNugget96",
      "body": "Me. Even had a therapist say to me that I don’t have an ED because I’m not underweight.",
      "created_utc": 1733848222.0,
      "score": 104,
      "context": []
    },
    {
      "id": "m1dgedm",
      "author": "None",
      "body": "anorexia is a psychological illness not physical",
      "created_utc": 1733845851.0,
      "score": 104,
      "context": []
    },
    {
      "id": "m1djgfi",
      "author": "ohmylungs",
      "body": "Only 8% of people with eating disorders are underweight",
      "created_utc": 1733846847.0,
      "score": 70,
      "context": []
    },
    {
      "id": "m1dj4wa",
      "author": "Odd_Theme_3294",
      "body": "A stupid number is not a sign of suffering - and it’s stupid, and the system is so so wrong refusing to help people who aren’t UW.\nPeople can die from an ED at any weight and the leading cause of deaths in eating disorders is suicide - not weight related problems.\nAnd refusing ppl help because of their weight just worsens that problem.\nIt’s sad and it makes me mad",
      "created_utc": 1733846743.0,
      "score": 34,
      "context": []
    },
    {
      "id": "m1dpmao",
      "author": "CheesecakeExotic5713",
      "body": "I’m actually overweight so the medical world hates me lol. I’m constantly told the answer to all my problems is to lose weight like y’all I’m telling you I’m trying 😭",
      "created_utc": 1733848815.0,
      "score": 55,
      "context": []
    },
    {
      "id": "m1e02uq",
      "author": "bustednut92",
      "body": "I’ve been diagnosed since 17(32 now) and that was the last time I was uw. I had to be hospitalized. I have a life now and I can’t risk that happening again which is how I check myself when I feel like I’m slipping. I still have disordered thoughts/eating so it’s a daily struggle. I try to maintain around a weight I’m comfy in aka one that doesn’t raise the alarms of my family and boyfriend but also doesn’t make me feel like 💩🙃",
      "created_utc": 1733852087.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m1dqiz4",
      "author": "Nia_KR",
      "body": "I’ve had anorexia for 9 years and have only been underweight for about a third of that time",
      "created_utc": 1733849097.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m1e3pw9",
      "author": "Cavatopme",
      "body": "I’m currently considered “obese,” and it sucks. I feel like my struggles aren’t valid. I used to be UW, and I miss it tbh.",
      "created_utc": 1733853215.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m1duun8",
      "author": "FLAluv86",
      "body": "I’m not (anymore)! I’ve been “recovered” since the age of 19. Which means I’ve been at a healthy weight and have NOT restricted since that age. I just turned 38. My anorexia was at its very  WORST at age 14, going on 15 and I was *very* UW. Had to be admitted to hospital. \n\nTo all of you out there who may be suffering as of right now; if I can do it- YOU can do it too! Much love! ✌🏻❤️",
      "created_utc": 1733850447.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m1gx6eq",
      "author": "juuljuniper",
      "body": "Tbh, the majority of the ed community’s  I’ve been in was overweight. Only a few were actually underweight and they had their own corner of the community. I’m overweight and the desperation to be thinner forced me into extremely unhealthy habits because I was so upset abt myself, and so were the other people I would talk to.",
      "created_utc": 1733887349.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1ftr6w",
      "author": "StrangeAir6637",
      "body": "isn’t being underweight a diagnostic criteria for anorexia nervosa? if you’re not UW then you have atypical",
      "created_utc": 1733872722.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m1dk7cq",
      "author": "avasefullofnations",
      "body": "Without going into details, my lowest weight to this point was still within my normal range for BMI.\nNote: I don't know this as a fact as at that point I wasn't allowed to know my weight so I'm going off the weight my dad wrote on my driver's license \n\n Its frustrating because doctors don't take you seriously unless you are very visibility uw and almost go 🤷but she's not /underweight/ sooooo (at least in my experience).",
      "created_utc": 1733847090.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m1dsn0g",
      "author": "None",
      "body": "I got to the lower end of healthy weight.. but I lost hair (still am loosing even though I'm doing alot better) SEVERE brain fog, dizzy spells, so yeah. Not about the number",
      "created_utc": 1733849749.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m1mfdz0",
      "author": "AdditionalChange6734",
      "body": "mostly recovered now, but for most of my ed i was flickering between healthy and underweight bmi. but also i'm very short so bmi doesn't work as accurately for me 🤷",
      "created_utc": 1733966432.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1i3u5b",
      "author": "Deepspacechris",
      "body": "I’m a bit underweight but that really shouldn’t have anything to do with the diagnosis itself. Anorexia is 100% a mental disorder and bodyweight is just one of many possible outcomes that stem from the disorder. People with all sorts of different bodies struggle with anorexia and the fact that we’re in 2024 and having such an archaic symptom requirement list in the DSM is laughable. Time to demand an update for sure, because having so many people go undiagnosed is dangerous.",
      "created_utc": 1733910942.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1iu20m",
      "author": "areydellan",
      "body": "I went from obese to simply overweight but now I'm almost at a normal bmi. So I'm not underweight but dw I'll be there soon bestie 😍",
      "created_utc": 1733924830.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1drgsi",
      "author": "NiceGuy1020",
      "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
      "created_utc": 1733849387.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m1dq09x",
      "author": "Dependent_Setting415",
      "body": "I'm at a 'healthy' BMI now but I've been OW for most of my time struggling with AN, which is something I really struggle to admit because the shame is so intense. I struggled with BED previously so while I lost a lot of weight very rapidly, I was starting higher. I still binge on occasion but my daily routine is now characterised by extreme restriction. I'm sure we can't be that rare.",
      "created_utc": 1733848936.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1ef4fk",
      "author": "jessiecolborne",
      "body": "Not underweight, I’m overweight right now actually.  Only a minority of those with an eating disorder are underweight. Your ED symptoms can be severe even at a healthy weight.",
      "created_utc": 1733856744.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1e1vm9",
      "author": "Shaxx_69",
      "body": "In spring I was severely UW, had very very low BMI, it was so bad inpatient programs didn't want to take me in because my BMI was less than 15, but my body was still functioning well (I was walking around a lot, doing yoga being completely oblivious to what danger I'm currently in because of my ED) but soon I started to feel very unwell and started slowly eating more now my BMI is around 16.",
      "created_utc": 1733852648.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1gzsiz",
      "author": "worriedgirl03",
      "body": "Same as u to a t! Sucks so much",
      "created_utc": 1733888403.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1huanq",
      "author": "broccolie_",
      "body": "with the way i feel and look already, not even uw, it is crazy to imagine myself if i was. part of me wants to know",
      "created_utc": 1733904317.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1ltr29",
      "author": "EasternTip1930",
      "body": "I almost am but unfortunately I still have a lot of muscle",
      "created_utc": 1733958681.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1o1m5c",
      "author": "immaculatewap",
      "body": "im not. im also not ow tho",
      "created_utc": 1733994517.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1om7se",
      "author": "ginger_marmot",
      "body": "I’m not. And it’s one of the reasons that I don’t tell anytime, even close friends, that I’ve been diagnosed with an eating disorder. I feel like they will think that I’m just saying it for attention or they’ll tell me that I’m wrong, because I’m not underweight.  I feel like I’m a “bad anorexic,” and not being underweight is just another failure. It’s incredibly invalidating. There are also times where I tell myself that I don’t even have an eating disorder because I don’t look the part. My therapist wants me to start telling people that I trust what’s going on with me but I’m so concerned that they’ll just laugh or not believe me.",
      "created_utc": 1734007117.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1qgyjx",
      "author": "Excellent_Gur_9249",
      "body": "I’m always fluctuating btwn barely underweight and normal so when I’m struggling people are just like wow you look incredible lmao.",
      "created_utc": 1734029864.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3jp0nk",
      "author": "None",
      "body": "I am. My BMI kinda hovers around 18.3-18.6 ish. I believe 18.5 is considered underweight.",
      "created_utc": 1735013724.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1eu2ba",
      "author": "yuru2323",
      "body": "I'm not underweight. But I'm obsessed with food, exercise, calories, my body so much it affects my daily life. Like it's even hard for me to watch a movie with thinking of these things. I managed to watch a movie today but it happened with being on the treadmill. It's just a matter of time that all of these will also reflect on the physical aspect of food intake, exercise etc. I've been dropping my cal intake each week and I fast on some days.",
      "created_utc": 1733861392.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1dggug",
      "author": "poisonedminds",
      "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
      "created_utc": 1733845873.0,
      "score": -7,
      "context": []
    },
    {
      "id": "m1dy9a8",
      "author": "M61N",
      "body": "I’m currently UW but I’ve been up as high as overweight when put on meds that made me gain weight no matter what I did. It’s a weird feeling especially when I would talk about having ana when overweight",
      "created_utc": 1733851521.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1f99cj",
      "author": "Fah_zu-u_los_fahliil",
      "body": "Grl, my weight is jumping +10 -10 every so often but always in \"healthy\" range and therefore even after being to few shrinks and ward no one bothwred to diagnose so :)))",
      "created_utc": 1733866073.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1fgdxf",
      "author": "countyourcalories",
      "body": "Currently overweight 🤚🏼",
      "created_utc": 1733868282.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1hhq8x",
      "author": "Anxious-Mechanic-249",
      "body": "Most with anorexia aren’t under weight u belive it’s 6% of those w Ed’s are underweight? Something like that. So you’re not alone, 94% of us are like you",
      "created_utc": 1733896728.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1eyq7c",
      "author": "Kinsey_Millhone",
      "body": "Diagnosed with osfed rn bc bmi wasn't at a low point",
      "created_utc": 1733862847.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1f4kjq",
      "author": "GurReady",
      "body": "I am so sorry that you feel forgotten and alone. Dealing with this on your own for so long must be discouraging. The therapist in me is curious if you don't mind sharing. What would make you feel remembered or seen by the medical world?",
      "created_utc": 1733864639.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1fbval",
      "author": "Lynn20022002",
      "body": "I was underweight when I struggled when I was younger. This is from age 17 to 18. I then weight restored in treatment. I’ve been struggling off and on since then and I’m 22 now. I haven’t been underweight since I was 18. Currently I’m at the low end of being overweight but I’m struggling a lot with my ed at the moment.",
      "created_utc": 1733866872.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1fzwa4",
      "author": "princessuuke",
      "body": "Ironically when i was younger at my current height i was without even trying, then my metabolism slowed a bunch and i didn't make any good changes until recently. Im considered lower end of \"normal\" and im trying to stay that way for now",
      "created_utc": 1733874905.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1gvhjl",
      "author": "ihatethewordoof",
      "body": "I was never underweight. I’m overweight now.",
      "created_utc": 1733886676.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1h78mh",
      "author": "lord-ofthe-flies",
      "body": "I am considered obese due to my size.. I don't think I'll ever not be.",
      "created_utc": 1733891590.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1ds4z7",
      "author": "Proper_Salamander_84",
      "body": "Yes, I’m not specifically ‘underweight’ \nYou are not alone. It’s the addiction/mentality for restricting. What is your ‘why’ type of thing. \nMine is from trauma with an awful illness and I couldn’t eat food… my brain processes like this: food equals pain… so, it depends on the battle.",
      "created_utc": 1733849594.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1fkqta",
      "author": "mystery0030",
      "body": "I’m only a few pounds UW and that’s simply because i started at a LW. I look no different and i haven’t been able to get help from my family because they see me eat often and think i’m fine. It’s frustrating and so invalidating",
      "created_utc": 1733869696.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1fmysn",
      "author": "religion_wya",
      "body": "Well, I'm not UW *anymore* but still face relapses. Last major relapse I was OW. Does that count? Lol",
      "created_utc": 1733870427.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1gi3rn",
      "author": "MyDMThrowawayPF",
      "body": "I haven't been UW since my early 20s, but I've relapsed several times since then. Mid-late 30s now. \n\nI think that with the state of my health, after so many years of this on-and-off, falling back to a 'clinical' AN weight might actually kill me.",
      "created_utc": 1733881553.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1i3mt7",
      "author": "Rhianael",
      "body": "I carry a lot of weight in my boobs and during my previous relapse was accused of lying about my weight (not underweight) because I \"looked thinner than that\" and underweight, but I wasn't! I've barely been underweight by the scale in my adult life despite whatever is going on with my ED. Got diagnosed anyway, despite that and not ever losing my period.",
      "created_utc": 1733910800.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1if5y8",
      "author": "belen-69",
      "body": "we’re in the same boat i’m at a normal weight for my height and age and literally nobody including doctors, therapists or psychiatrists will take my problems regarding food seriously because of it.",
      "created_utc": 1733918040.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1ede3q",
      "author": "oatmelody",
      "body": "meeee i'm ow",
      "created_utc": 1733856210.0,
      "score": -1,
      "context": []
    },
    {
      "id": "m1e2q0d",
      "author": "brodeine-goth-syrup",
      "body": "Me. I’ve only been UW once when I was hypomanic for 3 months",
      "created_utc": 1733852908.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m1g0vli",
      "author": "Chemical-Cow1274",
      "body": "Im not underweight but bmi means nothing. \"Atypical anorexic\" is bs and the number of people who are actually UW is low",
      "created_utc": 1733875255.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m1fix51",
      "author": "ThrowRA-petuniapants",
      "body": "me. I’m overweight, borderline obese. And that’s not the body dysmorphia talking, doctors note had “obese” in red next to my height and weight😅",
      "created_utc": 1733869100.0,
      "score": -1,
      "context": []
    },
    {
      "id": "m1fs3zz",
      "author": "Eh_Alright___",
      "body": "I'm not uw either",
      "created_utc": 1733872151.0,
      "score": -1,
      "context": []
    },
    {
      "id": "m1gbpf6",
      "author": "constantIy_drunk",
      "body": "🙋‍♀️🙋‍♀️",
      "created_utc": 1733879177.0,
      "score": -1,
      "context": []
    },
    {
      "id": "m1g8lfb",
      "author": "Worried_Brilliant939",
      "body": "I’m not right now but I have been many times—and severely. The 8% statistic needs to expand to accommodate prior underweight status and the length of remission periods etc if professionals really want a holistic longitudinal understanding of the pathology (which, they don’t, they just want to push us through haphazard treatment conglomerates who make sure insurance gets their money)…and, for those not in US, they want to ignore it because it’s a chronic, costly disorder that scares people lol. Easier to ignore. It’s infuriating",
      "created_utc": 1733878045.0,
      "score": -2,
      "context": []
    },
    {
      "id": "m1du9hq",
      "author": "sad_potat_07",
      "body": "that's an awful therapist, I'm so sorry. I hope you aren't seeing them anymore",
      "created_utc": 1733850261.0,
      "score": 42,
      "context": [
        {
          "id": "m1dnqnu",
          "author": "ButtNugget96",
          "body": "Me. Even had a therapist say to me that I don’t have an ED because I’m not underweight.",
          "created_utc": 1733848222.0
        }
      ]
    },
    {
      "id": "m1e0w1k",
      "author": "cutebunny1996",
      "body": "I’m sorry she said that- what a terrible thing to say, does she not realize that for aneroxia is psychological.",
      "created_utc": 1733852340.0,
      "score": 13,
      "context": [
        {
          "id": "m1dnqnu",
          "author": "ButtNugget96",
          "body": "Me. Even had a therapist say to me that I don’t have an ED because I’m not underweight.",
          "created_utc": 1733848222.0
        }
      ]
    },
    {
      "id": "m1ect8g",
      "author": "NiceGuy1020",
      "body": "If they don’t specialize in ED they shouldn’t form an opinion. That statement assumes like people with BN, ARFID, and BED have vanished into thin air. The only person that should tell you whether you got one or not is a doctor or psychologist from an ED clinic.",
      "created_utc": 1733856032.0,
      "score": 4,
      "context": [
        {
          "id": "m1dnqnu",
          "author": "ButtNugget96",
          "body": "Me. Even had a therapist say to me that I don’t have an ED because I’m not underweight.",
          "created_utc": 1733848222.0
        }
      ]
    },
    {
      "id": "m1gzuuo",
      "author": "worriedgirl03",
      "body": "My psychiatrist said this to me 😭😭 I was just like okay👍👍",
      "created_utc": 1733888429.0,
      "score": 2,
      "context": [
        {
          "id": "m1dnqnu",
          "author": "ButtNugget96",
          "body": "Me. Even had a therapist say to me that I don’t have an ED because I’m not underweight.",
          "created_utc": 1733848222.0
        }
      ]
    },
    {
      "id": "m1ftkxh",
      "author": "StrangeAir6637",
      "body": "what about anorexia nervosa",
      "created_utc": 1733872660.0,
      "score": 5,
      "context": [
        {
          "id": "m1dgedm",
          "author": "None",
          "body": "anorexia is a psychological illness not physical",
          "created_utc": 1733845851.0
        }
      ]
    },
    {
      "id": "m1gny7e",
      "author": "Phantasmortuary",
      "body": "It's a psychological illness with physical criteria. The mental illness leads to the behaviors, which leads to physical side-effects.",
      "created_utc": 1733883775.0,
      "score": 2,
      "context": [
        {
          "id": "m1dgedm",
          "author": "None",
          "body": "anorexia is a psychological illness not physical",
          "created_utc": 1733845851.0
        }
      ]
    },
    {
      "id": "m1h0mae",
      "author": "NiceGuy1020",
      "body": "Well that I did not know about the cause of death part",
      "created_utc": 1733888739.0,
      "score": 2,
      "context": [
        {
          "id": "m1dj4wa",
          "author": "Odd_Theme_3294",
          "body": "A stupid number is not a sign of suffering - and it’s stupid, and the system is so so wrong refusing to help people who aren’t UW.\nPeople can die from an ED at any weight and the leading cause of deaths in eating disorders is suicide - not weight related problems.\nAnd refusing ppl help because of their weight just worsens that problem.\nIt’s sad and it makes me mad",
          "created_utc": 1733846743.0
        }
      ]
    },
    {
      "id": "m1e676f",
      "author": "Happy_Recognition441",
      "body": "Same.. it sucks a lot. And they don’t see the signs of the ED. Because they are only focused on weight and bmi.. I always feel so invisible and insecure when I have an appointment with a medical.",
      "created_utc": 1733853986.0,
      "score": 11,
      "context": [
        {
          "id": "m1dpmao",
          "author": "CheesecakeExotic5713",
          "body": "I’m actually overweight so the medical world hates me lol. I’m constantly told the answer to all my problems is to lose weight like y’all I’m telling you I’m trying 😭",
          "created_utc": 1733848815.0
        }
      ]
    },
    {
      "id": "m1gvy17",
      "author": "buddys_rendezvous",
      "body": "do you have any advice on getting back on track when you catch yourself slipping? \n\ni’m early on in my recovery. haven’t truly embraced extreme hunger bc my therapist told me i shouldn’t gain weight quickly and scare myself out of recovery. but then i realize im still restricting and i can’t seem to stop myself from it.",
      "created_utc": 1733886859.0,
      "score": 2,
      "context": [
        {
          "id": "m1e02uq",
          "author": "bustednut92",
          "body": "I’ve been diagnosed since 17(32 now) and that was the last time I was uw. I had to be hospitalized. I have a life now and I can’t risk that happening again which is how I check myself when I feel like I’m slipping. I still have disordered thoughts/eating so it’s a daily struggle. I try to maintain around a weight I’m comfy in aka one that doesn’t raise the alarms of my family and boyfriend but also doesn’t make me feel like 💩🙃",
          "created_utc": 1733852087.0
        }
      ]
    },
    {
      "id": "m1guyra",
      "author": "buddys_rendezvous",
      "body": "your struggles are absolutely valid. just because they’re different doesn’t make them not real. i’m a couple months into my recovery and i miss it sometimes too, but it’s not worth the mental and physical torture. hang in there /:",
      "created_utc": 1733886469.0,
      "score": 5,
      "context": [
        {
          "id": "m1e3pw9",
          "author": "Cavatopme",
          "body": "I’m currently considered “obese,” and it sucks. I feel like my struggles aren’t valid. I used to be UW, and I miss it tbh.",
          "created_utc": 1733853215.0
        }
      ]
    },
    {
      "id": "m1eyxrp",
      "author": "Kinsey_Millhone",
      "body": "Comments like this give me hope that one day I'll break free",
      "created_utc": 1733862912.0,
      "score": 8,
      "context": [
        {
          "id": "m1duun8",
          "author": "FLAluv86",
          "body": "I’m not (anymore)! I’ve been “recovered” since the age of 19. Which means I’ve been at a healthy weight and have NOT restricted since that age. I just turned 38. My anorexia was at its very  WORST at age 14, going on 15 and I was *very* UW. Had to be admitted to hospital. \n\nTo all of you out there who may be suffering as of right now; if I can do it- YOU can do it too! Much love! ✌🏻❤️",
          "created_utc": 1733850447.0
        }
      ]
    },
    {
      "id": "mr304cj",
      "author": "Initial-Froyo-9661",
      "body": "it’s isn’t exactly as straightforward as that",
      "created_utc": 1746632654.0,
      "score": 1,
      "context": [
        {
          "id": "m1ftr6w",
          "author": "StrangeAir6637",
          "body": "isn’t being underweight a diagnostic criteria for anorexia nervosa? if you’re not UW then you have atypical",
          "created_utc": 1733872722.0
        }
      ]
    },
    {
      "id": "m1dtir1",
      "author": "internetcatalliance",
      "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
      "created_utc": 1733850024.0,
      "score": -2,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        }
      ]
    },
    {
      "id": "m1fjj0s",
      "author": "bpa23",
      "body": "I am you and you are me. I relate hard",
      "created_utc": 1733869298.0,
      "score": 2,
      "context": [
        {
          "id": "m1dq09x",
          "author": "Dependent_Setting415",
          "body": "I'm at a 'healthy' BMI now but I've been OW for most of my time struggling with AN, which is something I really struggle to admit because the shame is so intense. I struggled with BED previously so while I lost a lot of weight very rapidly, I was starting higher. I still binge on occasion but my daily routine is now characterised by extreme restriction. I'm sure we can't be that rare.",
          "created_utc": 1733848936.0
        }
      ]
    },
    {
      "id": "m1dtoi1",
      "author": "internetcatalliance",
      "body": "I was for 50% of my shitty ED journey either obese or overweight, and tbh although doctors cared, I even managed to get tubed twice, its still funny how googling anything anorexia related always brings up underweight as a \"must\" almost",
      "created_utc": 1733850075.0,
      "score": -1,
      "context": [
        {
          "id": "m1dq09x",
          "author": "Dependent_Setting415",
          "body": "I'm at a 'healthy' BMI now but I've been OW for most of my time struggling with AN, which is something I really struggle to admit because the shame is so intense. I struggled with BED previously so while I lost a lot of weight very rapidly, I was starting higher. I still binge on occasion but my daily routine is now characterised by extreme restriction. I'm sure we can't be that rare.",
          "created_utc": 1733848936.0
        }
      ]
    },
    {
      "id": "m1ltsd0",
      "author": "SokkaHaikuBot",
      "body": "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^EasternTip1930:\n\n*I almost am but*\n\n*Unfortunately I still*\n\n*Have a lot of muscle*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
      "created_utc": 1733958694.0,
      "score": 1,
      "context": [
        {
          "id": "m1ltr29",
          "author": "EasternTip1930",
          "body": "I almost am but unfortunately I still have a lot of muscle",
          "created_utc": 1733958681.0
        }
      ]
    },
    {
      "id": "m1dkcn8",
      "author": "ccbabs97",
      "body": "Not exactly. That is according to the DSM V and that is ignoring ATYPICAL Anorexia, which is also a recognized disorder by the DSM V. Speaking of, the DSM V is not the only manual to identify and diagnose mental health disorders. For example, we have the ICD, created by WHO and favored in Europe (as opposed to the DSM V in Canada and America). the ICD definitely mentions a low weight as a criteria for diagnosing anorexia, but they add this: \n\n“Rapid weight loss (e.g., more than 20% of total body weight within 6 months) may replace the low body weight guideline as long as other diagnostic requirements are met.” \n\nI’m not UW and I’ve been formally diagnosed with AN. My care team said my weight was the least important factor given that: \n\n1) I lost like 80lbs in 6months. \n2) I have a persistent fear of gaining weight. \n3) I restrict(ed) my intake to the point of fainting, having heart palpitations and low blood pressure & sugar. \n4) I have an excessive preoccupation with my body shape. \n5) I overexercise constantly.\n6) Obsessively count calories. \n\nMy team explained that the behaviors and how they affect me matter a lot more than the scale.\n\nSo yes, while low weight is one criterion for being diagnosed with AN, there are anorexics who are not underweight.",
      "created_utc": 1733847138.0,
      "score": 10,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        }
      ]
    },
    {
      "id": "m1dj9to",
      "author": "desolatedetonate",
      "body": "This is misinformation and no longer part of the criteria. Anorexia is primarily about restricting intake or not eating at all to try and achieve weight loss and it's only that leads to a significantly low weight or being uw, you can be anorexic at any size. This person shouldn't have to go to a general ED community because anorexia isn't just about being underweight. I understand you're trying to help but I think OP is trying to find relation in people who also struggle with specifically anorexia not general eating disorder stuff. A lot of stuff about eds are misunderstood in the first place I'm sure you're well aware of this. A lot of anorexic ppl do fluctuate greatly in weight anyway.",
      "created_utc": 1733846787.0,
      "score": 16,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        }
      ]
    },
    {
      "id": "m1f3wja",
      "author": "HospitalAcrobatic155",
      "body": "ur right idk why people are mad i mean how can you be restricting for so long and still not uw?  this mental disorder is all about torturing urself to be “thin” enough",
      "created_utc": 1733864432.0,
      "score": 4,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        }
      ]
    },
    {
      "id": "m1dktr8",
      "author": "internetcatalliance",
      "body": "I'm diagnosed with AN, Europe's different",
      "created_utc": 1733847291.0,
      "score": 3,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        }
      ]
    },
    {
      "id": "m1drptb",
      "author": "JacobAndEsauDamnYou",
      "body": "I’m diagnosed with anorexia purging subtype by a psychiatrist in the US. I’m not underweight, never have been, I’m not even a normal bmi yet. This notion is exactly why I was worried about her changing it from my original diagnosis of bulimia. \n\nI have the symptoms and behaviors of someone with anorexia according to the psych, but just because I started at a higher weight it’s somehow seen as different. Makes me feel like a faker and like I shouldn’t even take it seriously.",
      "created_utc": 1733849465.0,
      "score": -6,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        }
      ]
    },
    {
      "id": "m1e2ahg",
      "author": "throwawayforlemoi",
      "body": "Tell me you don't know shit about AN and the diagnostic criteria without telling me you don't know shit about AN and the diagnostic criteria.\n\nedit: since some people are downvoting me for whatever reason; while BMI is part of the diagnostic criteria, it is not one that has to be met to be diagnosed with AN. There are other ways to be diagnosed with AN.\n\n1. If we're going off the ICD-11, you may also get diagnosed with AN if you experience rapid weight loss. \"Rapid weight loss [...] may replace the low body weight guideline as long as other diagnostic requirements are met.\" (source: ICD-11). \n\n2. If we're going off the DSM-V, the equivalent would be a diagnosis of atypical anorexia nervosa, which says \"All of the criteria for anorexia nervosa are met, except that despite significant weight loss, the individual’s weight is within or above the normal range.\" (source: DSM-V) Atypical anorexia nervosa is still very much anorexia nervosa. \n\n3. If we're going off the ICD-10, it's pretty similar to the DSM-V. There is the option to diagnose someone with atypical anorexia nervosa: \"Disorders that fulfil some of the features of anorexia nervosa but in which the overall clinical picture does not justify that diagnosis.\" (source: ICD-10)\n\n4. There is also the option of doctors diagnosing someone outside of the guidelines if they think the diagnosis is appropriate. For example, in Germany, some places will diagnose you with ASD instead of a \"subtype\", despite ASD not being recognized as a diagnosis in the currently used guideline (ICD-10). They recognize that the subtypes are outdated, as is diagnosing people with them. They will still use them to bill health insurances since they are forced to, but yeah. \n\nRegarding not knowing anything about AN, anorexia nervosa isn't a weight based disorder. People are sick at any weight, they suffer at any weight, it can be fatal at any weight. Thinking otherwise is outdated, and spreading that kind of attitude will get people hurt or even killed because they'll think they aren't sick enough—something a lot of us are already struggling with. \n\nComing onto a post and essentially saying \"you don't belong here, you weigh too much\" is so incredibly misguided, demeaning, and harmful. Saying the diagnostic criteria don't allow for diagnosis of AN unless you're severely underweight is wrong. \n\nAnorexia nervosa is a mental disorder characterized by thoughts and behavior, not by weight. Diagnostic guidelines are oftentimes years, if not decades, behind on research (as evidenced by lots of stuff, for example ASD). Using them to justify keeping people who struggle and need help out is plain wrong, especially when you don't even seem to know the diagnostic criteria you're talking about, because, as I've hopefully made clear, you can, in fact, get diagnosed with AN at any weight.",
      "created_utc": 1733852775.0,
      "score": -7,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        }
      ]
    },
    {
      "id": "m1hubig",
      "author": "oatmelody",
      "body": "downvoted for being ow 😅 thanks guys",
      "created_utc": 1733904332.0,
      "score": 4,
      "context": [
        {
          "id": "m1ede3q",
          "author": "oatmelody",
          "body": "meeee i'm ow",
          "created_utc": 1733856210.0
        }
      ]
    },
    {
      "id": "m1ebi0i",
      "author": "KissinKateBarl0w",
      "body": "I had a psyche phd candidate tell me this. Of course she's a gym rat and felt it was super important to say it's \"atypical anorexia\" at best and is considered \"OSFED\" (other specified feeding or eating disorder) by the DSM-5. Not sure why semantics matter when it's literally the same pathology",
      "created_utc": 1733855628.0,
      "score": 26,
      "context": [
        {
          "id": "m1dnqnu",
          "author": "ButtNugget96",
          "body": "Me. Even had a therapist say to me that I don’t have an ED because I’m not underweight.",
          "created_utc": 1733848222.0
        },
        {
          "id": "m1du9hq",
          "author": "sad_potat_07",
          "body": "that's an awful therapist, I'm so sorry. I hope you aren't seeing them anymore",
          "created_utc": 1733850261.0
        }
      ]
    },
    {
      "id": "m1gcejg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1733879431.0,
      "score": 6,
      "context": [
        {
          "id": "m1dgedm",
          "author": "None",
          "body": "anorexia is a psychological illness not physical",
          "created_utc": 1733845851.0
        },
        {
          "id": "m1ftkxh",
          "author": "StrangeAir6637",
          "body": "what about anorexia nervosa",
          "created_utc": 1733872660.0
        }
      ]
    },
    {
      "id": "m1i42p6",
      "author": "Deepspacechris",
      "body": "As far as I know, it’s the mental illness with the highest death rate. Makes you think that the medical world would take it more seriously, but I guess not…",
      "created_utc": 1733911107.0,
      "score": 5,
      "context": [
        {
          "id": "m1dj4wa",
          "author": "Odd_Theme_3294",
          "body": "A stupid number is not a sign of suffering - and it’s stupid, and the system is so so wrong refusing to help people who aren’t UW.\nPeople can die from an ED at any weight and the leading cause of deaths in eating disorders is suicide - not weight related problems.\nAnd refusing ppl help because of their weight just worsens that problem.\nIt’s sad and it makes me mad",
          "created_utc": 1733846743.0
        },
        {
          "id": "m1h0mae",
          "author": "NiceGuy1020",
          "body": "Well that I did not know about the cause of death part",
          "created_utc": 1733888739.0
        }
      ]
    },
    {
      "id": "m1f4a9j",
      "author": "FLAluv86",
      "body": "I’m glad I can at least give u some hope! 💕",
      "created_utc": 1733864549.0,
      "score": 2,
      "context": [
        {
          "id": "m1duun8",
          "author": "FLAluv86",
          "body": "I’m not (anymore)! I’ve been “recovered” since the age of 19. Which means I’ve been at a healthy weight and have NOT restricted since that age. I just turned 38. My anorexia was at its very  WORST at age 14, going on 15 and I was *very* UW. Had to be admitted to hospital. \n\nTo all of you out there who may be suffering as of right now; if I can do it- YOU can do it too! Much love! ✌🏻❤️",
          "created_utc": 1733850447.0
        },
        {
          "id": "m1eyxrp",
          "author": "Kinsey_Millhone",
          "body": "Comments like this give me hope that one day I'll break free",
          "created_utc": 1733862912.0
        }
      ]
    },
    {
      "id": "m1e5h0x",
      "author": "NiceGuy1020",
      "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
      "created_utc": 1733853758.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        }
      ]
    },
    {
      "id": "m1fmae4",
      "author": "Dependent_Setting415",
      "body": "lol who is downvoting me for this. Someone that thinks they get to gatekeep anorexia I guess. Must be a sad life. If someone would upvote me to balance it back out I'd appreciate it 😅",
      "created_utc": 1733870204.0,
      "score": 2,
      "context": [
        {
          "id": "m1dq09x",
          "author": "Dependent_Setting415",
          "body": "I'm at a 'healthy' BMI now but I've been OW for most of my time struggling with AN, which is something I really struggle to admit because the shame is so intense. I struggled with BED previously so while I lost a lot of weight very rapidly, I was starting higher. I still binge on occasion but my daily routine is now characterised by extreme restriction. I'm sure we can't be that rare.",
          "created_utc": 1733848936.0
        },
        {
          "id": "m1fjj0s",
          "author": "bpa23",
          "body": "I am you and you are me. I relate hard",
          "created_utc": 1733869298.0
        }
      ]
    },
    {
      "id": "m1fndwy",
      "author": "Dependent_Setting415",
      "body": "I obviously can't use numbers but I went from borderline obese to borderline healthy in a shockingly short space of time, like shouldn't-be-possible when you do the maths kind of shockingly short. That was around the time I went to my doctor seeking help, and I never heard anything back. I don't know this for sure, but I've been telling myself that it's because I'm too big to qualify for help so the answer is to keep losing weight until I'm \"sick enough\" for them.",
      "created_utc": 1733870567.0,
      "score": 2,
      "context": [
        {
          "id": "m1dq09x",
          "author": "Dependent_Setting415",
          "body": "I'm at a 'healthy' BMI now but I've been OW for most of my time struggling with AN, which is something I really struggle to admit because the shame is so intense. I struggled with BED previously so while I lost a lot of weight very rapidly, I was starting higher. I still binge on occasion but my daily routine is now characterised by extreme restriction. I'm sure we can't be that rare.",
          "created_utc": 1733848936.0
        },
        {
          "id": "m1dtoi1",
          "author": "internetcatalliance",
          "body": "I was for 50% of my shitty ED journey either obese or overweight, and tbh although doctors cared, I even managed to get tubed twice, its still funny how googling anything anorexia related always brings up underweight as a \"must\" almost",
          "created_utc": 1733850075.0
        }
      ]
    },
    {
      "id": "m1efjgu",
      "author": "NiceGuy1020",
      "body": "This is very informative. I was not aware of the ICD. I thought everyone used DSM lmao. Sounds like ICD  doesn’t do the Atypical term but lumps it with AN. That’s nice though because I think many view it invalidating to be labelled Atypical.",
      "created_utc": 1733856875.0,
      "score": 2,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        },
        {
          "id": "m1dkcn8",
          "author": "ccbabs97",
          "body": "Not exactly. That is according to the DSM V and that is ignoring ATYPICAL Anorexia, which is also a recognized disorder by the DSM V. Speaking of, the DSM V is not the only manual to identify and diagnose mental health disorders. For example, we have the ICD, created by WHO and favored in Europe (as opposed to the DSM V in Canada and America). the ICD definitely mentions a low weight as a criteria for diagnosing anorexia, but they add this: \n\n“Rapid weight loss (e.g., more than 20% of total body weight within 6 months) may replace the low body weight guideline as long as other diagnostic requirements are met.” \n\nI’m not UW and I’ve been formally diagnosed with AN. My care team said my weight was the least important factor given that: \n\n1) I lost like 80lbs in 6months. \n2) I have a persistent fear of gaining weight. \n3) I restrict(ed) my intake to the point of fainting, having heart palpitations and low blood pressure & sugar. \n4) I have an excessive preoccupation with my body shape. \n5) I overexercise constantly.\n6) Obsessively count calories. \n\nMy team explained that the behaviors and how they affect me matter a lot more than the scale.\n\nSo yes, while low weight is one criterion for being diagnosed with AN, there are anorexics who are not underweight.",
          "created_utc": 1733847138.0
        }
      ]
    },
    {
      "id": "m1dwpp0",
      "author": "None",
      "body": "Atypical anorexia is still anorexia, it doesn't matter??\nAll I'm hearing is \"I did this and this and therefore I'm a real anorexic\"",
      "created_utc": 1733851036.0,
      "score": -5,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        },
        {
          "id": "m1dkcn8",
          "author": "ccbabs97",
          "body": "Not exactly. That is according to the DSM V and that is ignoring ATYPICAL Anorexia, which is also a recognized disorder by the DSM V. Speaking of, the DSM V is not the only manual to identify and diagnose mental health disorders. For example, we have the ICD, created by WHO and favored in Europe (as opposed to the DSM V in Canada and America). the ICD definitely mentions a low weight as a criteria for diagnosing anorexia, but they add this: \n\n“Rapid weight loss (e.g., more than 20% of total body weight within 6 months) may replace the low body weight guideline as long as other diagnostic requirements are met.” \n\nI’m not UW and I’ve been formally diagnosed with AN. My care team said my weight was the least important factor given that: \n\n1) I lost like 80lbs in 6months. \n2) I have a persistent fear of gaining weight. \n3) I restrict(ed) my intake to the point of fainting, having heart palpitations and low blood pressure & sugar. \n4) I have an excessive preoccupation with my body shape. \n5) I overexercise constantly.\n6) Obsessively count calories. \n\nMy team explained that the behaviors and how they affect me matter a lot more than the scale.\n\nSo yes, while low weight is one criterion for being diagnosed with AN, there are anorexics who are not underweight.",
          "created_utc": 1733847138.0
        }
      ]
    },
    {
      "id": "m1dwv3u",
      "author": "desolatedetonate",
      "body": "I'm sorry this happened! I wish you the best with everything and you are valid no matter what others say",
      "created_utc": 1733851084.0,
      "score": 3,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        },
        {
          "id": "m1drptb",
          "author": "JacobAndEsauDamnYou",
          "body": "I’m diagnosed with anorexia purging subtype by a psychiatrist in the US. I’m not underweight, never have been, I’m not even a normal bmi yet. This notion is exactly why I was worried about her changing it from my original diagnosis of bulimia. \n\nI have the symptoms and behaviors of someone with anorexia according to the psych, but just because I started at a higher weight it’s somehow seen as different. Makes me feel like a faker and like I shouldn’t even take it seriously.",
          "created_utc": 1733849465.0
        }
      ]
    },
    {
      "id": "m1p5yml",
      "author": "Eh_Alright___",
      "body": "Someone is downvoting everyone seemingly. Don't take it too hard. Your comment is valid. Mine was downvoted too.",
      "created_utc": 1734015018.0,
      "score": 3,
      "context": [
        {
          "id": "m1ede3q",
          "author": "oatmelody",
          "body": "meeee i'm ow",
          "created_utc": 1733856210.0
        },
        {
          "id": "m1hubig",
          "author": "oatmelody",
          "body": "downvoted for being ow 😅 thanks guys",
          "created_utc": 1733904332.0
        }
      ]
    },
    {
      "id": "m1gyvxz",
      "author": "NiceGuy1020",
      "body": "She was speaking factual but it sounds like she could’ve been less snobby about it lol. I think we’re so focused on delivering knowledge to others that we forget in some instances to handle it with more care.",
      "created_utc": 1733888036.0,
      "score": 10,
      "context": [
        {
          "id": "m1dnqnu",
          "author": "ButtNugget96",
          "body": "Me. Even had a therapist say to me that I don’t have an ED because I’m not underweight.",
          "created_utc": 1733848222.0
        },
        {
          "id": "m1du9hq",
          "author": "sad_potat_07",
          "body": "that's an awful therapist, I'm so sorry. I hope you aren't seeing them anymore",
          "created_utc": 1733850261.0
        },
        {
          "id": "m1ebi0i",
          "author": "KissinKateBarl0w",
          "body": "I had a psyche phd candidate tell me this. Of course she's a gym rat and felt it was super important to say it's \"atypical anorexia\" at best and is considered \"OSFED\" (other specified feeding or eating disorder) by the DSM-5. Not sure why semantics matter when it's literally the same pathology",
          "created_utc": 1733855628.0
        }
      ]
    },
    {
      "id": "m1gj5va",
      "author": "StrangeAir6637",
      "body": "doesn’t AN have a weight criteria? i was diagnosed with one…",
      "created_utc": 1733881948.0,
      "score": 5,
      "context": [
        {
          "id": "m1dgedm",
          "author": "None",
          "body": "anorexia is a psychological illness not physical",
          "created_utc": 1733845851.0
        },
        {
          "id": "m1ftkxh",
          "author": "StrangeAir6637",
          "body": "what about anorexia nervosa",
          "created_utc": 1733872660.0
        },
        {
          "id": "m1gcejg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733879431.0
        }
      ]
    },
    {
      "id": "m1joemo",
      "author": "NiceGuy1020",
      "body": "I guess because of that very reason: suicide is leading the cause rather than ED complications itself. So I guess it’s like they don’t take your problems as urgently unless you’ve got an emergency or at risk of harming yourself",
      "created_utc": 1733935213.0,
      "score": 1,
      "context": [
        {
          "id": "m1dj4wa",
          "author": "Odd_Theme_3294",
          "body": "A stupid number is not a sign of suffering - and it’s stupid, and the system is so so wrong refusing to help people who aren’t UW.\nPeople can die from an ED at any weight and the leading cause of deaths in eating disorders is suicide - not weight related problems.\nAnd refusing ppl help because of their weight just worsens that problem.\nIt’s sad and it makes me mad",
          "created_utc": 1733846743.0
        },
        {
          "id": "m1h0mae",
          "author": "NiceGuy1020",
          "body": "Well that I did not know about the cause of death part",
          "created_utc": 1733888739.0
        },
        {
          "id": "m1i42p6",
          "author": "Deepspacechris",
          "body": "As far as I know, it’s the mental illness with the highest death rate. Makes you think that the medical world would take it more seriously, but I guess not…",
          "created_utc": 1733911107.0
        }
      ]
    },
    {
      "id": "m1f55sd",
      "author": "Kinsey_Millhone",
      "body": "I've been really struggling lately. Can't go without work for treatment at the moment. I want to let the ED go and don't know how. I don't know how to just start eating normally again because the idea is so stressful but I wish I could enjoy food again. \n\nWhat keeps you motivated to keep going in recovery? What motivated you to start? I feel like I've learned on the ED so much that it'll be worse without it? It's not even body image for me it's just an anxiety coping thing now",
      "created_utc": 1733864821.0,
      "score": 4,
      "context": [
        {
          "id": "m1duun8",
          "author": "FLAluv86",
          "body": "I’m not (anymore)! I’ve been “recovered” since the age of 19. Which means I’ve been at a healthy weight and have NOT restricted since that age. I just turned 38. My anorexia was at its very  WORST at age 14, going on 15 and I was *very* UW. Had to be admitted to hospital. \n\nTo all of you out there who may be suffering as of right now; if I can do it- YOU can do it too! Much love! ✌🏻❤️",
          "created_utc": 1733850447.0
        },
        {
          "id": "m1eyxrp",
          "author": "Kinsey_Millhone",
          "body": "Comments like this give me hope that one day I'll break free",
          "created_utc": 1733862912.0
        },
        {
          "id": "m1f4a9j",
          "author": "FLAluv86",
          "body": "I’m glad I can at least give u some hope! 💕",
          "created_utc": 1733864549.0
        }
      ]
    },
    {
      "id": "m1f56tq",
      "author": "AwayConfidence",
      "body": "Yes, I'm also familiar with the DSM-5, and the clinical criteria for anorexia is that someone has to be underweight, otherwise they have atypical AN or OSFED. Not to disparage anyone here, but I think it is helpful to put people into subcategories so that they can get a tailored support plan to get the help they need as individuals. Someone who is UW is more at risk of certain issues than someone who is average BMI or overweight (who have their own separate high risk issues in comparison to someone who is UW).",
      "created_utc": 1733864830.0,
      "score": 6,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        }
      ]
    },
    {
      "id": "m1f6p53",
      "author": "internetcatalliance",
      "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
      "created_utc": 1733865297.0,
      "score": 0,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        }
      ]
    },
    {
      "id": "m1ehs44",
      "author": "ccbabs97",
      "body": "From what I’ve discussed with my team “Atypical AN” is just early onstage AN. Behaviors are still present and a patient’s body can very much suffer from malnutrition. I lost my period and I was not underweight. I would get dizzy and my BP and sugar would drop when I weighed more than I do now. The ICD’s definition I feel is more realistic. \n\nAs my therapist, nutritionist and psychiatrist have said, you don’t have to be skin and bones to suffer from AN or its consequences.",
      "created_utc": 1733857570.0,
      "score": -3,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        },
        {
          "id": "m1dkcn8",
          "author": "ccbabs97",
          "body": "Not exactly. That is according to the DSM V and that is ignoring ATYPICAL Anorexia, which is also a recognized disorder by the DSM V. Speaking of, the DSM V is not the only manual to identify and diagnose mental health disorders. For example, we have the ICD, created by WHO and favored in Europe (as opposed to the DSM V in Canada and America). the ICD definitely mentions a low weight as a criteria for diagnosing anorexia, but they add this: \n\n“Rapid weight loss (e.g., more than 20% of total body weight within 6 months) may replace the low body weight guideline as long as other diagnostic requirements are met.” \n\nI’m not UW and I’ve been formally diagnosed with AN. My care team said my weight was the least important factor given that: \n\n1) I lost like 80lbs in 6months. \n2) I have a persistent fear of gaining weight. \n3) I restrict(ed) my intake to the point of fainting, having heart palpitations and low blood pressure & sugar. \n4) I have an excessive preoccupation with my body shape. \n5) I overexercise constantly.\n6) Obsessively count calories. \n\nMy team explained that the behaviors and how they affect me matter a lot more than the scale.\n\nSo yes, while low weight is one criterion for being diagnosed with AN, there are anorexics who are not underweight.",
          "created_utc": 1733847138.0
        },
        {
          "id": "m1efjgu",
          "author": "NiceGuy1020",
          "body": "This is very informative. I was not aware of the ICD. I thought everyone used DSM lmao. Sounds like ICD  doesn’t do the Atypical term but lumps it with AN. That’s nice though because I think many view it invalidating to be labelled Atypical.",
          "created_utc": 1733856875.0
        }
      ]
    },
    {
      "id": "m1e0skv",
      "author": "ccbabs97",
      "body": "I literally argued at the end of my comment that weight is the least important factor in diagnosing anorexia. It is A criterion, not the only one. As a matter of fact, as I argued before, the behavioral aspect is a lot more important than the scale. \n\nI also said I am NOT UW, meaning I myself have what the DSM V terms as Atypical Anorexia. My country uses the ICD so my team has diagnosed me with just AN.",
      "created_utc": 1733852310.0,
      "score": 4,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        },
        {
          "id": "m1dkcn8",
          "author": "ccbabs97",
          "body": "Not exactly. That is according to the DSM V and that is ignoring ATYPICAL Anorexia, which is also a recognized disorder by the DSM V. Speaking of, the DSM V is not the only manual to identify and diagnose mental health disorders. For example, we have the ICD, created by WHO and favored in Europe (as opposed to the DSM V in Canada and America). the ICD definitely mentions a low weight as a criteria for diagnosing anorexia, but they add this: \n\n“Rapid weight loss (e.g., more than 20% of total body weight within 6 months) may replace the low body weight guideline as long as other diagnostic requirements are met.” \n\nI’m not UW and I’ve been formally diagnosed with AN. My care team said my weight was the least important factor given that: \n\n1) I lost like 80lbs in 6months. \n2) I have a persistent fear of gaining weight. \n3) I restrict(ed) my intake to the point of fainting, having heart palpitations and low blood pressure & sugar. \n4) I have an excessive preoccupation with my body shape. \n5) I overexercise constantly.\n6) Obsessively count calories. \n\nMy team explained that the behaviors and how they affect me matter a lot more than the scale.\n\nSo yes, while low weight is one criterion for being diagnosed with AN, there are anorexics who are not underweight.",
          "created_utc": 1733847138.0
        },
        {
          "id": "m1dwpp0",
          "author": "None",
          "body": "Atypical anorexia is still anorexia, it doesn't matter??\nAll I'm hearing is \"I did this and this and therefore I'm a real anorexic\"",
          "created_utc": 1733851036.0
        }
      ]
    },
    {
      "id": "m1egnr3",
      "author": "NiceGuy1020",
      "body": "That’s not what they meant. The commenter explains that Atypical doesn’t exist in the ICD which is similar to DSM. They write that the docs gave her the AN term because they fulfill all criteria despite being in normal weight range. If the docs followed DSM then they would have gotten the Atypical term.",
      "created_utc": 1733857221.0,
      "score": 2,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        },
        {
          "id": "m1dkcn8",
          "author": "ccbabs97",
          "body": "Not exactly. That is according to the DSM V and that is ignoring ATYPICAL Anorexia, which is also a recognized disorder by the DSM V. Speaking of, the DSM V is not the only manual to identify and diagnose mental health disorders. For example, we have the ICD, created by WHO and favored in Europe (as opposed to the DSM V in Canada and America). the ICD definitely mentions a low weight as a criteria for diagnosing anorexia, but they add this: \n\n“Rapid weight loss (e.g., more than 20% of total body weight within 6 months) may replace the low body weight guideline as long as other diagnostic requirements are met.” \n\nI’m not UW and I’ve been formally diagnosed with AN. My care team said my weight was the least important factor given that: \n\n1) I lost like 80lbs in 6months. \n2) I have a persistent fear of gaining weight. \n3) I restrict(ed) my intake to the point of fainting, having heart palpitations and low blood pressure & sugar. \n4) I have an excessive preoccupation with my body shape. \n5) I overexercise constantly.\n6) Obsessively count calories. \n\nMy team explained that the behaviors and how they affect me matter a lot more than the scale.\n\nSo yes, while low weight is one criterion for being diagnosed with AN, there are anorexics who are not underweight.",
          "created_utc": 1733847138.0
        },
        {
          "id": "m1dwpp0",
          "author": "None",
          "body": "Atypical anorexia is still anorexia, it doesn't matter??\nAll I'm hearing is \"I did this and this and therefore I'm a real anorexic\"",
          "created_utc": 1733851036.0
        }
      ]
    },
    {
      "id": "m1es968",
      "author": "JacobAndEsauDamnYou",
      "body": "Thanks I appreciate it",
      "created_utc": 1733860819.0,
      "score": 1,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        },
        {
          "id": "m1drptb",
          "author": "JacobAndEsauDamnYou",
          "body": "I’m diagnosed with anorexia purging subtype by a psychiatrist in the US. I’m not underweight, never have been, I’m not even a normal bmi yet. This notion is exactly why I was worried about her changing it from my original diagnosis of bulimia. \n\nI have the symptoms and behaviors of someone with anorexia according to the psych, but just because I started at a higher weight it’s somehow seen as different. Makes me feel like a faker and like I shouldn’t even take it seriously.",
          "created_utc": 1733849465.0
        },
        {
          "id": "m1dwv3u",
          "author": "desolatedetonate",
          "body": "I'm sorry this happened! I wish you the best with everything and you are valid no matter what others say",
          "created_utc": 1733851084.0
        }
      ]
    },
    {
      "id": "m1glpee",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1733882916.0,
      "score": 3,
      "context": [
        {
          "id": "m1dgedm",
          "author": "None",
          "body": "anorexia is a psychological illness not physical",
          "created_utc": 1733845851.0
        },
        {
          "id": "m1ftkxh",
          "author": "StrangeAir6637",
          "body": "what about anorexia nervosa",
          "created_utc": 1733872660.0
        },
        {
          "id": "m1gcejg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733879431.0
        },
        {
          "id": "m1gj5va",
          "author": "StrangeAir6637",
          "body": "doesn’t AN have a weight criteria? i was diagnosed with one…",
          "created_utc": 1733881948.0
        }
      ]
    },
    {
      "id": "m1kmomm",
      "author": "Deepspacechris",
      "body": "Yeah, suicide is the main cause of death as far as I can understand. ED complications are no joke though. So much can happen to the body and organs (dealing with a few hiccups myself), and it’s so unpredictable.",
      "created_utc": 1733945477.0,
      "score": 2,
      "context": [
        {
          "id": "m1dj4wa",
          "author": "Odd_Theme_3294",
          "body": "A stupid number is not a sign of suffering - and it’s stupid, and the system is so so wrong refusing to help people who aren’t UW.\nPeople can die from an ED at any weight and the leading cause of deaths in eating disorders is suicide - not weight related problems.\nAnd refusing ppl help because of their weight just worsens that problem.\nIt’s sad and it makes me mad",
          "created_utc": 1733846743.0
        },
        {
          "id": "m1h0mae",
          "author": "NiceGuy1020",
          "body": "Well that I did not know about the cause of death part",
          "created_utc": 1733888739.0
        },
        {
          "id": "m1i42p6",
          "author": "Deepspacechris",
          "body": "As far as I know, it’s the mental illness with the highest death rate. Makes you think that the medical world would take it more seriously, but I guess not…",
          "created_utc": 1733911107.0
        },
        {
          "id": "m1joemo",
          "author": "NiceGuy1020",
          "body": "I guess because of that very reason: suicide is leading the cause rather than ED complications itself. So I guess it’s like they don’t take your problems as urgently unless you’ve got an emergency or at risk of harming yourself",
          "created_utc": 1733935213.0
        }
      ]
    },
    {
      "id": "m1fi9v5",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1733868888.0,
      "score": 2,
      "context": [
        {
          "id": "m1duun8",
          "author": "FLAluv86",
          "body": "I’m not (anymore)! I’ve been “recovered” since the age of 19. Which means I’ve been at a healthy weight and have NOT restricted since that age. I just turned 38. My anorexia was at its very  WORST at age 14, going on 15 and I was *very* UW. Had to be admitted to hospital. \n\nTo all of you out there who may be suffering as of right now; if I can do it- YOU can do it too! Much love! ✌🏻❤️",
          "created_utc": 1733850447.0
        },
        {
          "id": "m1eyxrp",
          "author": "Kinsey_Millhone",
          "body": "Comments like this give me hope that one day I'll break free",
          "created_utc": 1733862912.0
        },
        {
          "id": "m1f4a9j",
          "author": "FLAluv86",
          "body": "I’m glad I can at least give u some hope! 💕",
          "created_utc": 1733864549.0
        },
        {
          "id": "m1f55sd",
          "author": "Kinsey_Millhone",
          "body": "I've been really struggling lately. Can't go without work for treatment at the moment. I want to let the ED go and don't know how. I don't know how to just start eating normally again because the idea is so stressful but I wish I could enjoy food again. \n\nWhat keeps you motivated to keep going in recovery? What motivated you to start? I feel like I've learned on the ED so much that it'll be worse without it? It's not even body image for me it's just an anxiety coping thing now",
          "created_utc": 1733864821.0
        }
      ]
    },
    {
      "id": "m1jv0oq",
      "author": "FLAluv86",
      "body": "I wasn’t “motivated” to recover at all! I was forced into inpatient at a hospital bc I was underage. \n\nAnd it was always an anxiety thing for me as well! Been struggling with anxiety pretty much all of my life, like since as long as I can remember really.. 🫤. Also it didn’t help that I had a *very* controlling mother. And I felt like I was fat since I hit puberty at about the age of 10 I’d say.. And last, my aunt was big on dieting and her habits were ones that I wanted to emulate bc she was thin and I wanted to be thin too! So I copied her, like beginning to drink Diet Coke instead of reg. That’s how I think it all started. \n\nWell nothing in particular keeps me motivated to stay in recovery. I just am not that same person anymore. I grew up, along with my thoughts and feelings about my own body. I was only a kid/teenager back then I didn’t know wut I was even throwing myself into at very first. So anyway, nowadays I just don’t deprive myself. Like if I rlly want something, I eat it. And when I’m full enough, I stop. I don’t do “diets”. I don’t restrict calories or count them, if anything I eat in moderation. I actually lack that self control that I had when I was suffering with my ED, lol! Like I couldn’t even imagine myself being anorexic anymore! I love food too much, especially sweets! U just gotta know how much to have and when to stop. And never say no- that u CAN’T have something that u are craving! It’s ridiculous! No, I don’t ALWAYS love my body and no one is perfect. Also, my weight has def fluctuated throughout the yrs. So sometimes I’m considered thin, other times average or curvy. It doesn’t matter tho. Don’t go by a number on the scale or a number on a pair of pants ever! Bc they don’t matter either! Just love yourself for who U are and not wut ur body looks like or wut other ppl say!✌🏻❤️",
      "created_utc": 1733937253.0,
      "score": 2,
      "context": [
        {
          "id": "m1duun8",
          "author": "FLAluv86",
          "body": "I’m not (anymore)! I’ve been “recovered” since the age of 19. Which means I’ve been at a healthy weight and have NOT restricted since that age. I just turned 38. My anorexia was at its very  WORST at age 14, going on 15 and I was *very* UW. Had to be admitted to hospital. \n\nTo all of you out there who may be suffering as of right now; if I can do it- YOU can do it too! Much love! ✌🏻❤️",
          "created_utc": 1733850447.0
        },
        {
          "id": "m1eyxrp",
          "author": "Kinsey_Millhone",
          "body": "Comments like this give me hope that one day I'll break free",
          "created_utc": 1733862912.0
        },
        {
          "id": "m1f4a9j",
          "author": "FLAluv86",
          "body": "I’m glad I can at least give u some hope! 💕",
          "created_utc": 1733864549.0
        },
        {
          "id": "m1f55sd",
          "author": "Kinsey_Millhone",
          "body": "I've been really struggling lately. Can't go without work for treatment at the moment. I want to let the ED go and don't know how. I don't know how to just start eating normally again because the idea is so stressful but I wish I could enjoy food again. \n\nWhat keeps you motivated to keep going in recovery? What motivated you to start? I feel like I've learned on the ED so much that it'll be worse without it? It's not even body image for me it's just an anxiety coping thing now",
          "created_utc": 1733864821.0
        }
      ]
    },
    {
      "id": "m1fe89p",
      "author": "NiceGuy1020",
      "body": "Yeah I understand the purpose for the categorization. From a professional perspective it makes sense. But from a patient view it can seem invalidating and competitive. I bet many read OSFED-AAN as like *We’re gonna give you this Other label because yeah you’re kinda anorexic but not fully. You don’t have these problems that they do.* Then it feels like *Ok bet I’ll get there*. \n\nBy no means is it the criteria fault. We just have to be better at interpreting and addressing it in the real world. For patients, we have to not read it as some sort of hierarchy. And for professionals, they need to make sure patients don’t feel unimportant, not to downplay it, and to give them appropriate-level treatment asap. We all deserve care at any given time, but with the levels/intensity varying. This just has to be better reflected in reality. \n\nI think the easier it is to navigate the system and access treatment, the less it’ll matter about the classification. I think people’s experience with the system reflects how they feel about it.",
      "created_utc": 1733867603.0,
      "score": 2,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f56tq",
          "author": "AwayConfidence",
          "body": "Yes, I'm also familiar with the DSM-5, and the clinical criteria for anorexia is that someone has to be underweight, otherwise they have atypical AN or OSFED. Not to disparage anyone here, but I think it is helpful to put people into subcategories so that they can get a tailored support plan to get the help they need as individuals. Someone who is UW is more at risk of certain issues than someone who is average BMI or overweight (who have their own separate high risk issues in comparison to someone who is UW).",
          "created_utc": 1733864830.0
        }
      ]
    },
    {
      "id": "m1fi6te",
      "author": "NiceGuy1020",
      "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
      "created_utc": 1733868861.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        }
      ]
    },
    {
      "id": "m1fkv3w",
      "author": "NiceGuy1020",
      "body": "Early onset is a nice way of putting it. It’s just from a higher weight it doesn’t seem as apparent. Better to detect sooner than later, like cancer. Yeah I think it’s just the picture we see when we think of someone with AN.. But the better we get at dispelling myths about who can have the illness, the more supportive we can all be of each other.",
      "created_utc": 1733869736.0,
      "score": 2,
      "context": [
        {
          "id": "m1dggug",
          "author": "poisonedminds",
          "body": "Being underweight is one of the main diagnostic criteria of anorexia. Maybe you'll have more success at finding community in general eating disorder subreddits where the focus isn't on anorexia specifically but all EDs.",
          "created_utc": 1733845873.0
        },
        {
          "id": "m1dkcn8",
          "author": "ccbabs97",
          "body": "Not exactly. That is according to the DSM V and that is ignoring ATYPICAL Anorexia, which is also a recognized disorder by the DSM V. Speaking of, the DSM V is not the only manual to identify and diagnose mental health disorders. For example, we have the ICD, created by WHO and favored in Europe (as opposed to the DSM V in Canada and America). the ICD definitely mentions a low weight as a criteria for diagnosing anorexia, but they add this: \n\n“Rapid weight loss (e.g., more than 20% of total body weight within 6 months) may replace the low body weight guideline as long as other diagnostic requirements are met.” \n\nI’m not UW and I’ve been formally diagnosed with AN. My care team said my weight was the least important factor given that: \n\n1) I lost like 80lbs in 6months. \n2) I have a persistent fear of gaining weight. \n3) I restrict(ed) my intake to the point of fainting, having heart palpitations and low blood pressure & sugar. \n4) I have an excessive preoccupation with my body shape. \n5) I overexercise constantly.\n6) Obsessively count calories. \n\nMy team explained that the behaviors and how they affect me matter a lot more than the scale.\n\nSo yes, while low weight is one criterion for being diagnosed with AN, there are anorexics who are not underweight.",
          "created_utc": 1733847138.0
        },
        {
          "id": "m1efjgu",
          "author": "NiceGuy1020",
          "body": "This is very informative. I was not aware of the ICD. I thought everyone used DSM lmao. Sounds like ICD  doesn’t do the Atypical term but lumps it with AN. That’s nice though because I think many view it invalidating to be labelled Atypical.",
          "created_utc": 1733856875.0
        },
        {
          "id": "m1ehs44",
          "author": "ccbabs97",
          "body": "From what I’ve discussed with my team “Atypical AN” is just early onstage AN. Behaviors are still present and a patient’s body can very much suffer from malnutrition. I lost my period and I was not underweight. I would get dizzy and my BP and sugar would drop when I weighed more than I do now. The ICD’s definition I feel is more realistic. \n\nAs my therapist, nutritionist and psychiatrist have said, you don’t have to be skin and bones to suffer from AN or its consequences.",
          "created_utc": 1733857570.0
        }
      ]
    },
    {
      "id": "m1n8puo",
      "author": "Bitter-Major-5595",
      "body": "Even the words AN-BP & BN are deceiving. I never really “binge”, but rather purged after “normal sized” meals…",
      "created_utc": 1733977853.0,
      "score": 1,
      "context": [
        {
          "id": "m1dgedm",
          "author": "None",
          "body": "anorexia is a psychological illness not physical",
          "created_utc": 1733845851.0
        },
        {
          "id": "m1ftkxh",
          "author": "StrangeAir6637",
          "body": "what about anorexia nervosa",
          "created_utc": 1733872660.0
        },
        {
          "id": "m1gcejg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733879431.0
        },
        {
          "id": "m1gj5va",
          "author": "StrangeAir6637",
          "body": "doesn’t AN have a weight criteria? i was diagnosed with one…",
          "created_utc": 1733881948.0
        },
        {
          "id": "m1glpee",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733882916.0
        }
      ]
    },
    {
      "id": "m1gvlro",
      "author": "buddys_rendezvous",
      "body": "can i ask you a question? feel free not to answer if it’s not appropriate, but did you ever relapse as an adult? i feel like mine got so much worse over time. i thought i was recovered for like a decade ):",
      "created_utc": 1733886723.0,
      "score": 2,
      "context": [
        {
          "id": "m1duun8",
          "author": "FLAluv86",
          "body": "I’m not (anymore)! I’ve been “recovered” since the age of 19. Which means I’ve been at a healthy weight and have NOT restricted since that age. I just turned 38. My anorexia was at its very  WORST at age 14, going on 15 and I was *very* UW. Had to be admitted to hospital. \n\nTo all of you out there who may be suffering as of right now; if I can do it- YOU can do it too! Much love! ✌🏻❤️",
          "created_utc": 1733850447.0
        },
        {
          "id": "m1eyxrp",
          "author": "Kinsey_Millhone",
          "body": "Comments like this give me hope that one day I'll break free",
          "created_utc": 1733862912.0
        },
        {
          "id": "m1f4a9j",
          "author": "FLAluv86",
          "body": "I’m glad I can at least give u some hope! 💕",
          "created_utc": 1733864549.0
        },
        {
          "id": "m1f55sd",
          "author": "Kinsey_Millhone",
          "body": "I've been really struggling lately. Can't go without work for treatment at the moment. I want to let the ED go and don't know how. I don't know how to just start eating normally again because the idea is so stressful but I wish I could enjoy food again. \n\nWhat keeps you motivated to keep going in recovery? What motivated you to start? I feel like I've learned on the ED so much that it'll be worse without it? It's not even body image for me it's just an anxiety coping thing now",
          "created_utc": 1733864821.0
        },
        {
          "id": "m1fi9v5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733868888.0
        }
      ]
    },
    {
      "id": "m1fwled",
      "author": "AwayConfidence",
      "body": "Yes - I completely agree with you, and you can see evidence of that in this thread alone! By no means is any eating disorder less or more than another one. I'm a provisional psychologist, so I'm very early in my career, and it's difficult for me to find a balance between providing evidence-based treatment informed by the diagnosis (DSM-5) vs focussing treatment on the symptoms regardless of diagnosis (like a lot of people in this thread who are engaging in ED behaviours typical of AN, but they are not UW). I hope that makes sense!",
      "created_utc": 1733873727.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f56tq",
          "author": "AwayConfidence",
          "body": "Yes, I'm also familiar with the DSM-5, and the clinical criteria for anorexia is that someone has to be underweight, otherwise they have atypical AN or OSFED. Not to disparage anyone here, but I think it is helpful to put people into subcategories so that they can get a tailored support plan to get the help they need as individuals. Someone who is UW is more at risk of certain issues than someone who is average BMI or overweight (who have their own separate high risk issues in comparison to someone who is UW).",
          "created_utc": 1733864830.0
        },
        {
          "id": "m1fe89p",
          "author": "NiceGuy1020",
          "body": "Yeah I understand the purpose for the categorization. From a professional perspective it makes sense. But from a patient view it can seem invalidating and competitive. I bet many read OSFED-AAN as like *We’re gonna give you this Other label because yeah you’re kinda anorexic but not fully. You don’t have these problems that they do.* Then it feels like *Ok bet I’ll get there*. \n\nBy no means is it the criteria fault. We just have to be better at interpreting and addressing it in the real world. For patients, we have to not read it as some sort of hierarchy. And for professionals, they need to make sure patients don’t feel unimportant, not to downplay it, and to give them appropriate-level treatment asap. We all deserve care at any given time, but with the levels/intensity varying. This just has to be better reflected in reality. \n\nI think the easier it is to navigate the system and access treatment, the less it’ll matter about the classification. I think people’s experience with the system reflects how they feel about it.",
          "created_utc": 1733867603.0
        }
      ]
    },
    {
      "id": "m1mkvwn",
      "author": "internetcatalliance",
      "body": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...",
      "created_utc": 1733968434.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        },
        {
          "id": "m1fi6te",
          "author": "NiceGuy1020",
          "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
          "created_utc": 1733868861.0
        }
      ]
    },
    {
      "id": "m1hxhtb",
      "author": "FLAluv86",
      "body": "Of course! The last time I relapsed was at the age of 19. But that was the last age that I truly starved myself.",
      "created_utc": 1733906501.0,
      "score": 1,
      "context": [
        {
          "id": "m1duun8",
          "author": "FLAluv86",
          "body": "I’m not (anymore)! I’ve been “recovered” since the age of 19. Which means I’ve been at a healthy weight and have NOT restricted since that age. I just turned 38. My anorexia was at its very  WORST at age 14, going on 15 and I was *very* UW. Had to be admitted to hospital. \n\nTo all of you out there who may be suffering as of right now; if I can do it- YOU can do it too! Much love! ✌🏻❤️",
          "created_utc": 1733850447.0
        },
        {
          "id": "m1eyxrp",
          "author": "Kinsey_Millhone",
          "body": "Comments like this give me hope that one day I'll break free",
          "created_utc": 1733862912.0
        },
        {
          "id": "m1f4a9j",
          "author": "FLAluv86",
          "body": "I’m glad I can at least give u some hope! 💕",
          "created_utc": 1733864549.0
        },
        {
          "id": "m1f55sd",
          "author": "Kinsey_Millhone",
          "body": "I've been really struggling lately. Can't go without work for treatment at the moment. I want to let the ED go and don't know how. I don't know how to just start eating normally again because the idea is so stressful but I wish I could enjoy food again. \n\nWhat keeps you motivated to keep going in recovery? What motivated you to start? I feel like I've learned on the ED so much that it'll be worse without it? It's not even body image for me it's just an anxiety coping thing now",
          "created_utc": 1733864821.0
        },
        {
          "id": "m1fi9v5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733868888.0
        },
        {
          "id": "m1gvlro",
          "author": "buddys_rendezvous",
          "body": "can i ask you a question? feel free not to answer if it’s not appropriate, but did you ever relapse as an adult? i feel like mine got so much worse over time. i thought i was recovered for like a decade ):",
          "created_utc": 1733886723.0
        }
      ]
    },
    {
      "id": "m1fz90d",
      "author": "NiceGuy1020",
      "body": "Oh that’s nice! I wish you all the best on becoming a fully certified psychologist. Sounds like you’re working in the ED field?",
      "created_utc": 1733874679.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f56tq",
          "author": "AwayConfidence",
          "body": "Yes, I'm also familiar with the DSM-5, and the clinical criteria for anorexia is that someone has to be underweight, otherwise they have atypical AN or OSFED. Not to disparage anyone here, but I think it is helpful to put people into subcategories so that they can get a tailored support plan to get the help they need as individuals. Someone who is UW is more at risk of certain issues than someone who is average BMI or overweight (who have their own separate high risk issues in comparison to someone who is UW).",
          "created_utc": 1733864830.0
        },
        {
          "id": "m1fe89p",
          "author": "NiceGuy1020",
          "body": "Yeah I understand the purpose for the categorization. From a professional perspective it makes sense. But from a patient view it can seem invalidating and competitive. I bet many read OSFED-AAN as like *We’re gonna give you this Other label because yeah you’re kinda anorexic but not fully. You don’t have these problems that they do.* Then it feels like *Ok bet I’ll get there*. \n\nBy no means is it the criteria fault. We just have to be better at interpreting and addressing it in the real world. For patients, we have to not read it as some sort of hierarchy. And for professionals, they need to make sure patients don’t feel unimportant, not to downplay it, and to give them appropriate-level treatment asap. We all deserve care at any given time, but with the levels/intensity varying. This just has to be better reflected in reality. \n\nI think the easier it is to navigate the system and access treatment, the less it’ll matter about the classification. I think people’s experience with the system reflects how they feel about it.",
          "created_utc": 1733867603.0
        },
        {
          "id": "m1fwled",
          "author": "AwayConfidence",
          "body": "Yes - I completely agree with you, and you can see evidence of that in this thread alone! By no means is any eating disorder less or more than another one. I'm a provisional psychologist, so I'm very early in my career, and it's difficult for me to find a balance between providing evidence-based treatment informed by the diagnosis (DSM-5) vs focussing treatment on the symptoms regardless of diagnosis (like a lot of people in this thread who are engaging in ED behaviours typical of AN, but they are not UW). I hope that makes sense!",
          "created_utc": 1733873727.0
        }
      ]
    },
    {
      "id": "m1n2t0h",
      "author": "NiceGuy1020",
      "body": "Aw do you think about giving it a try? I think worst case scenario is that you don’t find it helpful or you feel overwhelmed and you just tell em “ok guys I don’t think this is working”.",
      "created_utc": 1733975276.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        },
        {
          "id": "m1fi6te",
          "author": "NiceGuy1020",
          "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
          "created_utc": 1733868861.0
        },
        {
          "id": "m1mkvwn",
          "author": "internetcatalliance",
          "body": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...",
          "created_utc": 1733968434.0
        }
      ]
    },
    {
      "id": "m1guin4",
      "author": "AwayConfidence",
      "body": "Thank you and kind of! I'm most interested in working with young people, and I know that AN is most common in teenage girls. I also feel that treatment for AN and EDs overall is very lacking. I come to forums like this to read the perspectives and lived experiences of others and very rarely comment because I'm personally not in this space. I also want to be able to improve my support for people with EDs by understanding their unmet needs and also to get further information on the types of therapy/support/medications have actually helped in a meaningful way.\n\nI just felt like I needed to reply to your post because I have the best understanding of the DSM-5 and also have not had experience with the ICD. I feel like this is something I'll have to look into because it seems like many people on these forums are getting extremely attached to the specific diagnosis of AN even when people who have other eating disorders (and anyone experiencing MH issues) are still worthy of best practice treatment and care.",
      "created_utc": 1733886292.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f56tq",
          "author": "AwayConfidence",
          "body": "Yes, I'm also familiar with the DSM-5, and the clinical criteria for anorexia is that someone has to be underweight, otherwise they have atypical AN or OSFED. Not to disparage anyone here, but I think it is helpful to put people into subcategories so that they can get a tailored support plan to get the help they need as individuals. Someone who is UW is more at risk of certain issues than someone who is average BMI or overweight (who have their own separate high risk issues in comparison to someone who is UW).",
          "created_utc": 1733864830.0
        },
        {
          "id": "m1fe89p",
          "author": "NiceGuy1020",
          "body": "Yeah I understand the purpose for the categorization. From a professional perspective it makes sense. But from a patient view it can seem invalidating and competitive. I bet many read OSFED-AAN as like *We’re gonna give you this Other label because yeah you’re kinda anorexic but not fully. You don’t have these problems that they do.* Then it feels like *Ok bet I’ll get there*. \n\nBy no means is it the criteria fault. We just have to be better at interpreting and addressing it in the real world. For patients, we have to not read it as some sort of hierarchy. And for professionals, they need to make sure patients don’t feel unimportant, not to downplay it, and to give them appropriate-level treatment asap. We all deserve care at any given time, but with the levels/intensity varying. This just has to be better reflected in reality. \n\nI think the easier it is to navigate the system and access treatment, the less it’ll matter about the classification. I think people’s experience with the system reflects how they feel about it.",
          "created_utc": 1733867603.0
        },
        {
          "id": "m1fwled",
          "author": "AwayConfidence",
          "body": "Yes - I completely agree with you, and you can see evidence of that in this thread alone! By no means is any eating disorder less or more than another one. I'm a provisional psychologist, so I'm very early in my career, and it's difficult for me to find a balance between providing evidence-based treatment informed by the diagnosis (DSM-5) vs focussing treatment on the symptoms regardless of diagnosis (like a lot of people in this thread who are engaging in ED behaviours typical of AN, but they are not UW). I hope that makes sense!",
          "created_utc": 1733873727.0
        },
        {
          "id": "m1fz90d",
          "author": "NiceGuy1020",
          "body": "Oh that’s nice! I wish you all the best on becoming a fully certified psychologist. Sounds like you’re working in the ED field?",
          "created_utc": 1733874679.0
        }
      ]
    },
    {
      "id": "m1o6unp",
      "author": "internetcatalliance",
      "body": "I know, I agree, but I have a lot to lose\n\nI have a realistic chance of getting adhd meds from my psych, something I've been trying to get for years\n\nThink confessing to an ED would ruin that",
      "created_utc": 1733998154.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        },
        {
          "id": "m1fi6te",
          "author": "NiceGuy1020",
          "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
          "created_utc": 1733868861.0
        },
        {
          "id": "m1mkvwn",
          "author": "internetcatalliance",
          "body": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...",
          "created_utc": 1733968434.0
        },
        {
          "id": "m1n2t0h",
          "author": "NiceGuy1020",
          "body": "Aw do you think about giving it a try? I think worst case scenario is that you don’t find it helpful or you feel overwhelmed and you just tell em “ok guys I don’t think this is working”.",
          "created_utc": 1733975276.0
        }
      ]
    },
    {
      "id": "m1jzcjm",
      "author": "NiceGuy1020",
      "body": "Well that’s very nice of you and a smart thing to do. What better way to understand something than to go to the source. \n\nI think the efficacy of adolescent treatment is key to best outcomes and relapse prevention. I think EDs first happen in adolescence.. at least this is true for me. When I was inpatient one time, all the focus was on eating and nothing else. I was made to feel like I had done something wrong and to be ashamed of it. I wasn’t made to understand why it was wrong except that I needed to follow a bunch of rules while in the hospital. So all I focused on was just being obedient to gtf out of there. But if the program had a more intimate experience than being cold, then I think I could’ve been a lot better than I am today, where years later I have relapsed as an adult. \n\nWhat do I mean by that… Well we had groups stuff but it was mostly relaxation based: arts, meditation, goals for the week, reading, very elementary school-esque. I think what I needed more was for someone to act as a mentor, to sit with me, talk to me, and help me understand more about myself and the disorder. I still don’t even know wtf I did the first time around as a kid. I just started restricting for almost no reason and wound up X pounds unintentionally lol. I needed someone to help me sort that out. More importantly, I needed someone to help me realize that there was more to life than following a bunch of self-imposed rules. But how do you know there is more to something if all you know is what you’re used to? So to help me know what I wanted out of life, to know an ED would never let me get there, that’s what I feel I could’ve used most as an adolescent. \n\nThe problem was that much of the communication of my treatment went to my parents. I guess legally and logically the responsibility was on them to help me navigate these things. And the only thing that was communicated to me was about how much more food I would need to eat. But that was the flaw… bless my parents but they were knuckleheads lmao. My mom told me she barely could absorb everything the doctors threw at her at meetings and my dad may as well have just been in space for the whole thing. So now you have a breakdown because if the docs expect parents to do x and y but the parents don’t understand what they’re really doing and the intricacies of it all, then none of it gets relayed to the kid and certain things are left unaddressed. \n\nI wish I was more involved in my own treatment as an adolescent in that critical time. If I was treated like an adult in terms of direct doc to patient communication, being on par with my parents rather than my parents being middlemen for me, then I could’ve been more empowered. And again if there was more of an individual-intimate-therapeutic emphasis, where we dig deep and talk deep things like future and life goals, I could’ve easily left this thing in the dust. If we do our best to make kids realize just how much worthy they are and the untapped potential they have when unbothered by an ED, and not make them feel that recovery is just about shoving food in their mouth, they can go on to leave this thing behind and never think twice about it ever again. \n\nDid not plan to write all this, but as you said you want to know more about the unmet needs and what is most helpful - I hope you find this insightful.",
      "created_utc": 1733938582.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f56tq",
          "author": "AwayConfidence",
          "body": "Yes, I'm also familiar with the DSM-5, and the clinical criteria for anorexia is that someone has to be underweight, otherwise they have atypical AN or OSFED. Not to disparage anyone here, but I think it is helpful to put people into subcategories so that they can get a tailored support plan to get the help they need as individuals. Someone who is UW is more at risk of certain issues than someone who is average BMI or overweight (who have their own separate high risk issues in comparison to someone who is UW).",
          "created_utc": 1733864830.0
        },
        {
          "id": "m1fe89p",
          "author": "NiceGuy1020",
          "body": "Yeah I understand the purpose for the categorization. From a professional perspective it makes sense. But from a patient view it can seem invalidating and competitive. I bet many read OSFED-AAN as like *We’re gonna give you this Other label because yeah you’re kinda anorexic but not fully. You don’t have these problems that they do.* Then it feels like *Ok bet I’ll get there*. \n\nBy no means is it the criteria fault. We just have to be better at interpreting and addressing it in the real world. For patients, we have to not read it as some sort of hierarchy. And for professionals, they need to make sure patients don’t feel unimportant, not to downplay it, and to give them appropriate-level treatment asap. We all deserve care at any given time, but with the levels/intensity varying. This just has to be better reflected in reality. \n\nI think the easier it is to navigate the system and access treatment, the less it’ll matter about the classification. I think people’s experience with the system reflects how they feel about it.",
          "created_utc": 1733867603.0
        },
        {
          "id": "m1fwled",
          "author": "AwayConfidence",
          "body": "Yes - I completely agree with you, and you can see evidence of that in this thread alone! By no means is any eating disorder less or more than another one. I'm a provisional psychologist, so I'm very early in my career, and it's difficult for me to find a balance between providing evidence-based treatment informed by the diagnosis (DSM-5) vs focussing treatment on the symptoms regardless of diagnosis (like a lot of people in this thread who are engaging in ED behaviours typical of AN, but they are not UW). I hope that makes sense!",
          "created_utc": 1733873727.0
        },
        {
          "id": "m1fz90d",
          "author": "NiceGuy1020",
          "body": "Oh that’s nice! I wish you all the best on becoming a fully certified psychologist. Sounds like you’re working in the ED field?",
          "created_utc": 1733874679.0
        },
        {
          "id": "m1guin4",
          "author": "AwayConfidence",
          "body": "Thank you and kind of! I'm most interested in working with young people, and I know that AN is most common in teenage girls. I also feel that treatment for AN and EDs overall is very lacking. I come to forums like this to read the perspectives and lived experiences of others and very rarely comment because I'm personally not in this space. I also want to be able to improve my support for people with EDs by understanding their unmet needs and also to get further information on the types of therapy/support/medications have actually helped in a meaningful way.\n\nI just felt like I needed to reply to your post because I have the best understanding of the DSM-5 and also have not had experience with the ICD. I feel like this is something I'll have to look into because it seems like many people on these forums are getting extremely attached to the specific diagnosis of AN even when people who have other eating disorders (and anyone experiencing MH issues) are still worthy of best practice treatment and care.",
          "created_utc": 1733886292.0
        }
      ]
    },
    {
      "id": "m1odpky",
      "author": "Advanced-Secretary-3",
      "body": "As your partner I wanted to say hi. We live together and yeah you have a lot to lose. We make all these grand plans for a beautiful and long lasting future, but you don't want to get helped regarding this life destroying disorder. We have lived together for 4 months and I almost hear you say daily how you want to starve and be skinny. Like it's the 2nd most important thing in your life only a little below me. \n\nI have given you so much advice regarding all of this, I have told you to go into therapy, but every time you tell me that you are doing fine and not having any thoughts. This post and your comments here are the total opposite of what you always tell me, so you make me wonder right now how much of the things you tell me are actually true. I worry about you and you try to take the worry away, but yet you are posting these things. Babe, it's time for therapy.",
      "created_utc": 1734002592.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        },
        {
          "id": "m1fi6te",
          "author": "NiceGuy1020",
          "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
          "created_utc": 1733868861.0
        },
        {
          "id": "m1mkvwn",
          "author": "internetcatalliance",
          "body": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...",
          "created_utc": 1733968434.0
        },
        {
          "id": "m1n2t0h",
          "author": "NiceGuy1020",
          "body": "Aw do you think about giving it a try? I think worst case scenario is that you don’t find it helpful or you feel overwhelmed and you just tell em “ok guys I don’t think this is working”.",
          "created_utc": 1733975276.0
        },
        {
          "id": "m1o6unp",
          "author": "internetcatalliance",
          "body": "I know, I agree, but I have a lot to lose\n\nI have a realistic chance of getting adhd meds from my psych, something I've been trying to get for years\n\nThink confessing to an ED would ruin that",
          "created_utc": 1733998154.0
        }
      ]
    },
    {
      "id": "m1pij83",
      "author": "NiceGuy1020",
      "body": "Why might presence of ED disqualify you for ADHD meds?",
      "created_utc": 1734019207.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        },
        {
          "id": "m1fi6te",
          "author": "NiceGuy1020",
          "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
          "created_utc": 1733868861.0
        },
        {
          "id": "m1mkvwn",
          "author": "internetcatalliance",
          "body": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...",
          "created_utc": 1733968434.0
        },
        {
          "id": "m1n2t0h",
          "author": "NiceGuy1020",
          "body": "Aw do you think about giving it a try? I think worst case scenario is that you don’t find it helpful or you feel overwhelmed and you just tell em “ok guys I don’t think this is working”.",
          "created_utc": 1733975276.0
        },
        {
          "id": "m1o6unp",
          "author": "internetcatalliance",
          "body": "I know, I agree, but I have a lot to lose\n\nI have a realistic chance of getting adhd meds from my psych, something I've been trying to get for years\n\nThink confessing to an ED would ruin that",
          "created_utc": 1733998154.0
        }
      ]
    },
    {
      "id": "m1ruc5d",
      "author": "AwayConfidence",
      "body": "Thank you for telling your story, I really appreciate it! From the outside, it sounds like you and your family were given a treatment plan of family based treatment (FBT). I suggest looking that up and seeing if it resonates with you. I can understand why this treatment plan really didn't work for you, particularly if you really needed that individual support.\n\nFBT is often a really difficult treatment plan if everyone isn't on board (particularly the young person) as this is a treatment mostly done by the family at home, with some support offered by health professionals. The main tenants are weight restoration and restoring control of eating to the young person. However, this is mostly achieved by parents policing how much food the young person eats, when they eat, and trying to prevent the young person from engaging in behaviours that they were either engaging in before, or new behaviours that the young person has learned to engage with their eating disorder (e.g. purging, extreme food restriction, avoidance of eating in front of others). Parents should be taught how to do this, but obviously as your parents said, it is a lot of information, and stressful for everyone at home.\n\nThe health professionals involved should be able to assess if FBT isn't actually working for the family and the young person, and should work towards tailoring the program towards strategies that will actually help. This is where you should have definitely been included in the involved in the treatment process (probably even earlier, right at the start) and been receiving your own tailored support. Everything should have been explored with you and you should have given your consent to be involved in any therapies that you needed.\n\nJust to touch on your earlier comments about the hospital and relaxation-based therapies, again options should have been explored with you. Peer-support can be amazing for some people, and I'm disappointed that it wasn't offered to you when a mentor could have been critical as a support person. It's also important for a clinician to understand the story of the person and their ED to be able to provide the best treatments possible. Do they need to be the best evidence-based treatments (like FBT)? I don't think so if they don't actually help the person. I find it frustrating when it could be easier by just treating the patient like a person, and ask what they want and what they think might help them!\n\nI'm very sorry, it sounds like these health professionals and the system really let you down. Unfortunately, its not uncommon for people to feel this way, and it really is a shame that when people are at a point that they really support, and have access to it, they don't actually receive needed treatment.",
      "created_utc": 1734045640.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f56tq",
          "author": "AwayConfidence",
          "body": "Yes, I'm also familiar with the DSM-5, and the clinical criteria for anorexia is that someone has to be underweight, otherwise they have atypical AN or OSFED. Not to disparage anyone here, but I think it is helpful to put people into subcategories so that they can get a tailored support plan to get the help they need as individuals. Someone who is UW is more at risk of certain issues than someone who is average BMI or overweight (who have their own separate high risk issues in comparison to someone who is UW).",
          "created_utc": 1733864830.0
        },
        {
          "id": "m1fe89p",
          "author": "NiceGuy1020",
          "body": "Yeah I understand the purpose for the categorization. From a professional perspective it makes sense. But from a patient view it can seem invalidating and competitive. I bet many read OSFED-AAN as like *We’re gonna give you this Other label because yeah you’re kinda anorexic but not fully. You don’t have these problems that they do.* Then it feels like *Ok bet I’ll get there*. \n\nBy no means is it the criteria fault. We just have to be better at interpreting and addressing it in the real world. For patients, we have to not read it as some sort of hierarchy. And for professionals, they need to make sure patients don’t feel unimportant, not to downplay it, and to give them appropriate-level treatment asap. We all deserve care at any given time, but with the levels/intensity varying. This just has to be better reflected in reality. \n\nI think the easier it is to navigate the system and access treatment, the less it’ll matter about the classification. I think people’s experience with the system reflects how they feel about it.",
          "created_utc": 1733867603.0
        },
        {
          "id": "m1fwled",
          "author": "AwayConfidence",
          "body": "Yes - I completely agree with you, and you can see evidence of that in this thread alone! By no means is any eating disorder less or more than another one. I'm a provisional psychologist, so I'm very early in my career, and it's difficult for me to find a balance between providing evidence-based treatment informed by the diagnosis (DSM-5) vs focussing treatment on the symptoms regardless of diagnosis (like a lot of people in this thread who are engaging in ED behaviours typical of AN, but they are not UW). I hope that makes sense!",
          "created_utc": 1733873727.0
        },
        {
          "id": "m1fz90d",
          "author": "NiceGuy1020",
          "body": "Oh that’s nice! I wish you all the best on becoming a fully certified psychologist. Sounds like you’re working in the ED field?",
          "created_utc": 1733874679.0
        },
        {
          "id": "m1guin4",
          "author": "AwayConfidence",
          "body": "Thank you and kind of! I'm most interested in working with young people, and I know that AN is most common in teenage girls. I also feel that treatment for AN and EDs overall is very lacking. I come to forums like this to read the perspectives and lived experiences of others and very rarely comment because I'm personally not in this space. I also want to be able to improve my support for people with EDs by understanding their unmet needs and also to get further information on the types of therapy/support/medications have actually helped in a meaningful way.\n\nI just felt like I needed to reply to your post because I have the best understanding of the DSM-5 and also have not had experience with the ICD. I feel like this is something I'll have to look into because it seems like many people on these forums are getting extremely attached to the specific diagnosis of AN even when people who have other eating disorders (and anyone experiencing MH issues) are still worthy of best practice treatment and care.",
          "created_utc": 1733886292.0
        },
        {
          "id": "m1jzcjm",
          "author": "NiceGuy1020",
          "body": "Well that’s very nice of you and a smart thing to do. What better way to understand something than to go to the source. \n\nI think the efficacy of adolescent treatment is key to best outcomes and relapse prevention. I think EDs first happen in adolescence.. at least this is true for me. When I was inpatient one time, all the focus was on eating and nothing else. I was made to feel like I had done something wrong and to be ashamed of it. I wasn’t made to understand why it was wrong except that I needed to follow a bunch of rules while in the hospital. So all I focused on was just being obedient to gtf out of there. But if the program had a more intimate experience than being cold, then I think I could’ve been a lot better than I am today, where years later I have relapsed as an adult. \n\nWhat do I mean by that… Well we had groups stuff but it was mostly relaxation based: arts, meditation, goals for the week, reading, very elementary school-esque. I think what I needed more was for someone to act as a mentor, to sit with me, talk to me, and help me understand more about myself and the disorder. I still don’t even know wtf I did the first time around as a kid. I just started restricting for almost no reason and wound up X pounds unintentionally lol. I needed someone to help me sort that out. More importantly, I needed someone to help me realize that there was more to life than following a bunch of self-imposed rules. But how do you know there is more to something if all you know is what you’re used to? So to help me know what I wanted out of life, to know an ED would never let me get there, that’s what I feel I could’ve used most as an adolescent. \n\nThe problem was that much of the communication of my treatment went to my parents. I guess legally and logically the responsibility was on them to help me navigate these things. And the only thing that was communicated to me was about how much more food I would need to eat. But that was the flaw… bless my parents but they were knuckleheads lmao. My mom told me she barely could absorb everything the doctors threw at her at meetings and my dad may as well have just been in space for the whole thing. So now you have a breakdown because if the docs expect parents to do x and y but the parents don’t understand what they’re really doing and the intricacies of it all, then none of it gets relayed to the kid and certain things are left unaddressed. \n\nI wish I was more involved in my own treatment as an adolescent in that critical time. If I was treated like an adult in terms of direct doc to patient communication, being on par with my parents rather than my parents being middlemen for me, then I could’ve been more empowered. And again if there was more of an individual-intimate-therapeutic emphasis, where we dig deep and talk deep things like future and life goals, I could’ve easily left this thing in the dust. If we do our best to make kids realize just how much worthy they are and the untapped potential they have when unbothered by an ED, and not make them feel that recovery is just about shoving food in their mouth, they can go on to leave this thing behind and never think twice about it ever again. \n\nDid not plan to write all this, but as you said you want to know more about the unmet needs and what is most helpful - I hope you find this insightful.",
          "created_utc": 1733938582.0
        }
      ]
    },
    {
      "id": "m1pir3i",
      "author": "internetcatalliance",
      "body": "They make you skinny",
      "created_utc": 1734019275.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        },
        {
          "id": "m1fi6te",
          "author": "NiceGuy1020",
          "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
          "created_utc": 1733868861.0
        },
        {
          "id": "m1mkvwn",
          "author": "internetcatalliance",
          "body": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...",
          "created_utc": 1733968434.0
        },
        {
          "id": "m1n2t0h",
          "author": "NiceGuy1020",
          "body": "Aw do you think about giving it a try? I think worst case scenario is that you don’t find it helpful or you feel overwhelmed and you just tell em “ok guys I don’t think this is working”.",
          "created_utc": 1733975276.0
        },
        {
          "id": "m1o6unp",
          "author": "internetcatalliance",
          "body": "I know, I agree, but I have a lot to lose\n\nI have a realistic chance of getting adhd meds from my psych, something I've been trying to get for years\n\nThink confessing to an ED would ruin that",
          "created_utc": 1733998154.0
        },
        {
          "id": "m1pij83",
          "author": "NiceGuy1020",
          "body": "Why might presence of ED disqualify you for ADHD meds?",
          "created_utc": 1734019207.0
        }
      ]
    },
    {
      "id": "m1ppfgr",
      "author": "NiceGuy1020",
      "body": "As in suppresses appetite / induces weight loss? I can see how that would be conflicting. But wouldn’t it still be at your detriment to not disclose it? I mean what happens after you get these meds and they make you skinny? You said that you’re not exactly good right now while trying to hide this. \n\nSure you may be able to use the adhd meds as a front for having lost weight. But in your case you have something else going on. I would think that’s gonna have an added effect. I wonder if your psych will catch on that something isn’t adding up, or if not they’ll be confused why some things are happening with you. \n\nI just think it’s best to be honest. It causes less confusion.. And if they were to find out it could cause some awkwardness. I’d like to think they could work with you to make sure the meds don’t exasperate the ED. Maybe there are other meds that don’t have that side effect. Or this might be where you could consider working with the Outpatient concurrently. \n\nI’m not familiar with ADHD so I might not be the best person to comment on it. I just think the best way to get the most effective help is that everyone on your healthcare team is aware of your comorbidity.",
      "created_utc": 1734021383.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        },
        {
          "id": "m1fi6te",
          "author": "NiceGuy1020",
          "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
          "created_utc": 1733868861.0
        },
        {
          "id": "m1mkvwn",
          "author": "internetcatalliance",
          "body": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...",
          "created_utc": 1733968434.0
        },
        {
          "id": "m1n2t0h",
          "author": "NiceGuy1020",
          "body": "Aw do you think about giving it a try? I think worst case scenario is that you don’t find it helpful or you feel overwhelmed and you just tell em “ok guys I don’t think this is working”.",
          "created_utc": 1733975276.0
        },
        {
          "id": "m1o6unp",
          "author": "internetcatalliance",
          "body": "I know, I agree, but I have a lot to lose\n\nI have a realistic chance of getting adhd meds from my psych, something I've been trying to get for years\n\nThink confessing to an ED would ruin that",
          "created_utc": 1733998154.0
        },
        {
          "id": "m1pij83",
          "author": "NiceGuy1020",
          "body": "Why might presence of ED disqualify you for ADHD meds?",
          "created_utc": 1734019207.0
        },
        {
          "id": "m1pir3i",
          "author": "internetcatalliance",
          "body": "They make you skinny",
          "created_utc": 1734019275.0
        }
      ]
    },
    {
      "id": "m1puxkr",
      "author": "internetcatalliance",
      "body": "Maybe you're right.....\n\nMy gf and i have been talking, maybe I will give a recovery attempt a try again, my third\n\nI am growing tired of the thoughts, I admit\n\nBut im scared, my life feels more full with those ambitions",
      "created_utc": 1734023087.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        },
        {
          "id": "m1fi6te",
          "author": "NiceGuy1020",
          "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
          "created_utc": 1733868861.0
        },
        {
          "id": "m1mkvwn",
          "author": "internetcatalliance",
          "body": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...",
          "created_utc": 1733968434.0
        },
        {
          "id": "m1n2t0h",
          "author": "NiceGuy1020",
          "body": "Aw do you think about giving it a try? I think worst case scenario is that you don’t find it helpful or you feel overwhelmed and you just tell em “ok guys I don’t think this is working”.",
          "created_utc": 1733975276.0
        },
        {
          "id": "m1o6unp",
          "author": "internetcatalliance",
          "body": "I know, I agree, but I have a lot to lose\n\nI have a realistic chance of getting adhd meds from my psych, something I've been trying to get for years\n\nThink confessing to an ED would ruin that",
          "created_utc": 1733998154.0
        },
        {
          "id": "m1pij83",
          "author": "NiceGuy1020",
          "body": "Why might presence of ED disqualify you for ADHD meds?",
          "created_utc": 1734019207.0
        },
        {
          "id": "m1pir3i",
          "author": "internetcatalliance",
          "body": "They make you skinny",
          "created_utc": 1734019275.0
        },
        {
          "id": "m1ppfgr",
          "author": "NiceGuy1020",
          "body": "As in suppresses appetite / induces weight loss? I can see how that would be conflicting. But wouldn’t it still be at your detriment to not disclose it? I mean what happens after you get these meds and they make you skinny? You said that you’re not exactly good right now while trying to hide this. \n\nSure you may be able to use the adhd meds as a front for having lost weight. But in your case you have something else going on. I would think that’s gonna have an added effect. I wonder if your psych will catch on that something isn’t adding up, or if not they’ll be confused why some things are happening with you. \n\nI just think it’s best to be honest. It causes less confusion.. And if they were to find out it could cause some awkwardness. I’d like to think they could work with you to make sure the meds don’t exasperate the ED. Maybe there are other meds that don’t have that side effect. Or this might be where you could consider working with the Outpatient concurrently. \n\nI’m not familiar with ADHD so I might not be the best person to comment on it. I just think the best way to get the most effective help is that everyone on your healthcare team is aware of your comorbidity.",
          "created_utc": 1734021383.0
        }
      ]
    },
    {
      "id": "m1qtqdy",
      "author": "NiceGuy1020",
      "body": "I strongly recommend doing this attempt in a program. Doing it alone is usually difficult. There’s a lot you’ll experience physically and mentally, and you may not be equipped to handle it by yourself. You’ll have conflicting emotions, and your initial thoughts will grow loud. It’ll be good to have professionals to bounce everything off of and to get reassurance that you’re on the right track. Particularly, you’ll want someone to bounce thoughts off of as it pertains to your fears, motivations, and ambitions, in of terms both being for and against having an ED. \n\nAnd I imagine your gf will be happy to be on this journey with you. You might want to consider what is more ambitious: having a life with an ED or having a life with your gf. If that’s not a troll account - it appears your gf shared her thoughts under our comment thread. She’s as distraught as you are, but as long as you don’t give up she sounds willing to be by your side in all this. I don’t think there’s a stronger motivator for anything than love. But that’s not to say you should recover solely for the sake of someone else. You should try again mainly because you love yourself enough to believe that you deserve something better in life. Wanting to spend your life with someone else is usually a good catalyst for that.",
      "created_utc": 1734033827.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        },
        {
          "id": "m1fi6te",
          "author": "NiceGuy1020",
          "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
          "created_utc": 1733868861.0
        },
        {
          "id": "m1mkvwn",
          "author": "internetcatalliance",
          "body": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...",
          "created_utc": 1733968434.0
        },
        {
          "id": "m1n2t0h",
          "author": "NiceGuy1020",
          "body": "Aw do you think about giving it a try? I think worst case scenario is that you don’t find it helpful or you feel overwhelmed and you just tell em “ok guys I don’t think this is working”.",
          "created_utc": 1733975276.0
        },
        {
          "id": "m1o6unp",
          "author": "internetcatalliance",
          "body": "I know, I agree, but I have a lot to lose\n\nI have a realistic chance of getting adhd meds from my psych, something I've been trying to get for years\n\nThink confessing to an ED would ruin that",
          "created_utc": 1733998154.0
        },
        {
          "id": "m1pij83",
          "author": "NiceGuy1020",
          "body": "Why might presence of ED disqualify you for ADHD meds?",
          "created_utc": 1734019207.0
        },
        {
          "id": "m1pir3i",
          "author": "internetcatalliance",
          "body": "They make you skinny",
          "created_utc": 1734019275.0
        },
        {
          "id": "m1ppfgr",
          "author": "NiceGuy1020",
          "body": "As in suppresses appetite / induces weight loss? I can see how that would be conflicting. But wouldn’t it still be at your detriment to not disclose it? I mean what happens after you get these meds and they make you skinny? You said that you’re not exactly good right now while trying to hide this. \n\nSure you may be able to use the adhd meds as a front for having lost weight. But in your case you have something else going on. I would think that’s gonna have an added effect. I wonder if your psych will catch on that something isn’t adding up, or if not they’ll be confused why some things are happening with you. \n\nI just think it’s best to be honest. It causes less confusion.. And if they were to find out it could cause some awkwardness. I’d like to think they could work with you to make sure the meds don’t exasperate the ED. Maybe there are other meds that don’t have that side effect. Or this might be where you could consider working with the Outpatient concurrently. \n\nI’m not familiar with ADHD so I might not be the best person to comment on it. I just think the best way to get the most effective help is that everyone on your healthcare team is aware of your comorbidity.",
          "created_utc": 1734021383.0
        },
        {
          "id": "m1puxkr",
          "author": "internetcatalliance",
          "body": "Maybe you're right.....\n\nMy gf and i have been talking, maybe I will give a recovery attempt a try again, my third\n\nI am growing tired of the thoughts, I admit\n\nBut im scared, my life feels more full with those ambitions",
          "created_utc": 1734023087.0
        }
      ]
    },
    {
      "id": "m23mm6k",
      "author": "Traditional-Milk-467",
      "body": "Let's do it!",
      "created_utc": 1734224530.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        },
        {
          "id": "m1fi6te",
          "author": "NiceGuy1020",
          "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
          "created_utc": 1733868861.0
        },
        {
          "id": "m1mkvwn",
          "author": "internetcatalliance",
          "body": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...",
          "created_utc": 1733968434.0
        },
        {
          "id": "m1n2t0h",
          "author": "NiceGuy1020",
          "body": "Aw do you think about giving it a try? I think worst case scenario is that you don’t find it helpful or you feel overwhelmed and you just tell em “ok guys I don’t think this is working”.",
          "created_utc": 1733975276.0
        },
        {
          "id": "m1o6unp",
          "author": "internetcatalliance",
          "body": "I know, I agree, but I have a lot to lose\n\nI have a realistic chance of getting adhd meds from my psych, something I've been trying to get for years\n\nThink confessing to an ED would ruin that",
          "created_utc": 1733998154.0
        },
        {
          "id": "m1pij83",
          "author": "NiceGuy1020",
          "body": "Why might presence of ED disqualify you for ADHD meds?",
          "created_utc": 1734019207.0
        },
        {
          "id": "m1pir3i",
          "author": "internetcatalliance",
          "body": "They make you skinny",
          "created_utc": 1734019275.0
        },
        {
          "id": "m1ppfgr",
          "author": "NiceGuy1020",
          "body": "As in suppresses appetite / induces weight loss? I can see how that would be conflicting. But wouldn’t it still be at your detriment to not disclose it? I mean what happens after you get these meds and they make you skinny? You said that you’re not exactly good right now while trying to hide this. \n\nSure you may be able to use the adhd meds as a front for having lost weight. But in your case you have something else going on. I would think that’s gonna have an added effect. I wonder if your psych will catch on that something isn’t adding up, or if not they’ll be confused why some things are happening with you. \n\nI just think it’s best to be honest. It causes less confusion.. And if they were to find out it could cause some awkwardness. I’d like to think they could work with you to make sure the meds don’t exasperate the ED. Maybe there are other meds that don’t have that side effect. Or this might be where you could consider working with the Outpatient concurrently. \n\nI’m not familiar with ADHD so I might not be the best person to comment on it. I just think the best way to get the most effective help is that everyone on your healthcare team is aware of your comorbidity.",
          "created_utc": 1734021383.0
        },
        {
          "id": "m1puxkr",
          "author": "internetcatalliance",
          "body": "Maybe you're right.....\n\nMy gf and i have been talking, maybe I will give a recovery attempt a try again, my third\n\nI am growing tired of the thoughts, I admit\n\nBut im scared, my life feels more full with those ambitions",
          "created_utc": 1734023087.0
        }
      ]
    },
    {
      "id": "m23sabk",
      "author": "internetcatalliance",
      "body": "Its so scary, still on the fence",
      "created_utc": 1734226801.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        },
        {
          "id": "m1fi6te",
          "author": "NiceGuy1020",
          "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
          "created_utc": 1733868861.0
        },
        {
          "id": "m1mkvwn",
          "author": "internetcatalliance",
          "body": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...",
          "created_utc": 1733968434.0
        },
        {
          "id": "m1n2t0h",
          "author": "NiceGuy1020",
          "body": "Aw do you think about giving it a try? I think worst case scenario is that you don’t find it helpful or you feel overwhelmed and you just tell em “ok guys I don’t think this is working”.",
          "created_utc": 1733975276.0
        },
        {
          "id": "m1o6unp",
          "author": "internetcatalliance",
          "body": "I know, I agree, but I have a lot to lose\n\nI have a realistic chance of getting adhd meds from my psych, something I've been trying to get for years\n\nThink confessing to an ED would ruin that",
          "created_utc": 1733998154.0
        },
        {
          "id": "m1pij83",
          "author": "NiceGuy1020",
          "body": "Why might presence of ED disqualify you for ADHD meds?",
          "created_utc": 1734019207.0
        },
        {
          "id": "m1pir3i",
          "author": "internetcatalliance",
          "body": "They make you skinny",
          "created_utc": 1734019275.0
        },
        {
          "id": "m1ppfgr",
          "author": "NiceGuy1020",
          "body": "As in suppresses appetite / induces weight loss? I can see how that would be conflicting. But wouldn’t it still be at your detriment to not disclose it? I mean what happens after you get these meds and they make you skinny? You said that you’re not exactly good right now while trying to hide this. \n\nSure you may be able to use the adhd meds as a front for having lost weight. But in your case you have something else going on. I would think that’s gonna have an added effect. I wonder if your psych will catch on that something isn’t adding up, or if not they’ll be confused why some things are happening with you. \n\nI just think it’s best to be honest. It causes less confusion.. And if they were to find out it could cause some awkwardness. I’d like to think they could work with you to make sure the meds don’t exasperate the ED. Maybe there are other meds that don’t have that side effect. Or this might be where you could consider working with the Outpatient concurrently. \n\nI’m not familiar with ADHD so I might not be the best person to comment on it. I just think the best way to get the most effective help is that everyone on your healthcare team is aware of your comorbidity.",
          "created_utc": 1734021383.0
        },
        {
          "id": "m1puxkr",
          "author": "internetcatalliance",
          "body": "Maybe you're right.....\n\nMy gf and i have been talking, maybe I will give a recovery attempt a try again, my third\n\nI am growing tired of the thoughts, I admit\n\nBut im scared, my life feels more full with those ambitions",
          "created_utc": 1734023087.0
        },
        {
          "id": "m23mm6k",
          "author": "Traditional-Milk-467",
          "body": "Let's do it!",
          "created_utc": 1734224530.0
        }
      ]
    },
    {
      "id": "m23yil5",
      "author": "Traditional-Milk-467",
      "body": "Yeah I've been absent but I'm not fully gone. You've done it before you can do it again.",
      "created_utc": 1734229338.0,
      "score": 1,
      "context": [
        {
          "id": "m1drgsi",
          "author": "NiceGuy1020",
          "body": "A long time ago - I don’t remember how - there was an app I came across called AvoMD. It helps medical professionals screen and treat many different conditions. It follows only the clinical guidelines made by reputable bodies. \n\nSearch for “Eating Disorders (APA)” and select for an assessment. You will act as a professional assessing yourself. Answer the questions, which will ask you about your symptoms and behaviours that you have presented in the past 3 months. After, it will generate a suggested diagnosis and provide an explanation.\n\nGiven the brief information you post, my guess is you fall under the Other Specified Feeding Eating Disorder (OSFED) umbrella, subcategory Atypical Anorexia Nervosa. This term is used for those who have impacts similar to those with pure AN but have not been underweight. \n\nRemember, however, using that app and my preceeding thought is not to be used as a self-diagnosis. I recommend using the app but only as a tool to aid in your medical advocacy. You can use the results to discuss with a doctor to help them understand your issue. You could hopefully then be referred to an ED specialized provider who will provide a proper assessment. \n\nFor educational purposes, I’ll share briefly about myself… I was once underweight due to AN, but now I am not. However, certain thoughts and behaviours remain. My label is now upgraded to AN Partial Remission. You can see how the ED diagnostic criteria is complex… Ironically it’s set up this way to be inclusive to a variety of struggles and differentiate levels of psycho-physiological states.",
          "created_utc": 1733849387.0
        },
        {
          "id": "m1dtir1",
          "author": "internetcatalliance",
          "body": "I have been diagnosed with AN, in Europe with the icd11 its now possible, thank god, cant imagine how i'd lose my mind if I was diagnosed with atypical anorexia.....",
          "created_utc": 1733850024.0
        },
        {
          "id": "m1e5h0x",
          "author": "NiceGuy1020",
          "body": "I am usually ignorant to the fact that other places exist outside of North America haha. I’m not familiar with ICD-11; rather I know of the DSM-5. \n\nPardon the barrage of questions; only to get a better comprehension… So in ICD-11, for AN, it does not regard weight; is it only based on thoughts and actions? Since you did receive a diagnosis, why have you felt forgotten in the medical world? Is it that  professionals don’t take you as seriously since you aren’t underweight? \n\nAN is synonymous with underweight, so I think it’s natural to see that pop up as you describe. I do sympathize with you in your isolation from others. Though we should all be supportive and inclusive regardless of how we present this problem. The overarching theme is we all have the same disorder.",
          "created_utc": 1733853758.0
        },
        {
          "id": "m1f6p53",
          "author": "internetcatalliance",
          "body": "Yes basically, it's still plastered with the word underweight everywhere, but you can be diagnosed if you simply lost a shitton of weight together with other symptoms\n\nYou can literally find the ice11 online, it's made by the world health organisation, find the criteria for An there if you want the details as I can't exactly quote it\n\nI feel forgotten by the medical world overall, despite it being possible to get the diagnosis at any weight now, it's still filled with assumptions about weight and good luck finding anything about the disorder that doesn't mention \"low weight\"\n\nStill, took hospitals and an NG to get diagnosed, so really... That's what it took lol",
          "created_utc": 1733865297.0
        },
        {
          "id": "m1fi6te",
          "author": "NiceGuy1020",
          "body": "Thanks for the sharing. I will look up ICD since I’m curious about it now and how it compares to DSM. \n\nI’m saddened that it had to go that far - where admission for NG was needed - to get seen. Are there no outpatient clinics around? I imagine this process should’ve been a lot easier: you would have consulted your doctor, get a referral to a place, and they would work with you in a weekly therapy setting with other forms of counselling as needed. Bothers me that you have to wait until it gets really bad to then get something rolling. \n\nWhere are you now in terms of progress and treatment? I imagine you got discharged from the hospital and living independently. Are you doing any kind of follow-ups?",
          "created_utc": 1733868861.0
        },
        {
          "id": "m1mkvwn",
          "author": "internetcatalliance",
          "body": "I refused outpatient help... I'm now currently trying to bullshit and hide my ED so I'm not exactly good...",
          "created_utc": 1733968434.0
        },
        {
          "id": "m1n2t0h",
          "author": "NiceGuy1020",
          "body": "Aw do you think about giving it a try? I think worst case scenario is that you don’t find it helpful or you feel overwhelmed and you just tell em “ok guys I don’t think this is working”.",
          "created_utc": 1733975276.0
        },
        {
          "id": "m1o6unp",
          "author": "internetcatalliance",
          "body": "I know, I agree, but I have a lot to lose\n\nI have a realistic chance of getting adhd meds from my psych, something I've been trying to get for years\n\nThink confessing to an ED would ruin that",
          "created_utc": 1733998154.0
        },
        {
          "id": "m1pij83",
          "author": "NiceGuy1020",
          "body": "Why might presence of ED disqualify you for ADHD meds?",
          "created_utc": 1734019207.0
        },
        {
          "id": "m1pir3i",
          "author": "internetcatalliance",
          "body": "They make you skinny",
          "created_utc": 1734019275.0
        },
        {
          "id": "m1ppfgr",
          "author": "NiceGuy1020",
          "body": "As in suppresses appetite / induces weight loss? I can see how that would be conflicting. But wouldn’t it still be at your detriment to not disclose it? I mean what happens after you get these meds and they make you skinny? You said that you’re not exactly good right now while trying to hide this. \n\nSure you may be able to use the adhd meds as a front for having lost weight. But in your case you have something else going on. I would think that’s gonna have an added effect. I wonder if your psych will catch on that something isn’t adding up, or if not they’ll be confused why some things are happening with you. \n\nI just think it’s best to be honest. It causes less confusion.. And if they were to find out it could cause some awkwardness. I’d like to think they could work with you to make sure the meds don’t exasperate the ED. Maybe there are other meds that don’t have that side effect. Or this might be where you could consider working with the Outpatient concurrently. \n\nI’m not familiar with ADHD so I might not be the best person to comment on it. I just think the best way to get the most effective help is that everyone on your healthcare team is aware of your comorbidity.",
          "created_utc": 1734021383.0
        },
        {
          "id": "m1puxkr",
          "author": "internetcatalliance",
          "body": "Maybe you're right.....\n\nMy gf and i have been talking, maybe I will give a recovery attempt a try again, my third\n\nI am growing tired of the thoughts, I admit\n\nBut im scared, my life feels more full with those ambitions",
          "created_utc": 1734023087.0
        },
        {
          "id": "m23mm6k",
          "author": "Traditional-Milk-467",
          "body": "Let's do it!",
          "created_utc": 1734224530.0
        },
        {
          "id": "m23sabk",
          "author": "internetcatalliance",
          "body": "Its so scary, still on the fence",
          "created_utc": 1734226801.0
        }
      ]
    }
  ]
}