{
  "id": "1hbaivk",
  "subreddit": "AnorexiaNervosa",
  "author": "LilaVargas03",
  "created_utc": 1733860300.0,
  "title": "Anorexia food hoarding is not a joke🥲",
  "selftext": "I swear I feel so guilty and I try to share my food when I can, but I literally can’t stop hoarding food because of this disorder. Doesn’t help the fact that I grew up not always being able to afford food. \nI’ve wasted so much money because of this disorder… ",
  "url": "https://www.reddit.com/gallery/1hbaivk",
  "score": 835,
  "num_comments": 71,
  "comments": [
    {
      "id": "m1eql5i",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1733860300.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1esvy7",
      "author": "None",
      "body": "I buy so much food and what someone else doesnt eat just goes bad. But if i don't have the food I panic.",
      "created_utc": 1733861018.0,
      "score": 182,
      "context": []
    },
    {
      "id": "m1f6erm",
      "author": "nnushk",
      "body": "having food in the house gives me so much anxiety. \nI just buy fresh when I need it. this is my worst nightmare. anyone else here relate? or am I a weirdo?",
      "created_utc": 1733865209.0,
      "score": 124,
      "context": []
    },
    {
      "id": "m1ezwi2",
      "author": "thrwaysweetie",
      "body": "can we pls share that GLORIOUS protein bar collection?",
      "created_utc": 1733863210.0,
      "score": 40,
      "context": []
    },
    {
      "id": "m1gfx6x",
      "author": "Blu3Ski3",
      "body": "This is a symptom of starvation. Your brain wants to make sure there is food when it senses famine. This is not only common in eating disorders but also extremely common when you foster kids who have experienced poverty/lack of food, many of them hoard food like this as a result.",
      "created_utc": 1733880735.0,
      "score": 34,
      "context": []
    },
    {
      "id": "m1fb73m",
      "author": "xbrosia93",
      "body": "LOL this post made me smile! I have a whole college size storage container in my closet filled with snacks cookies chips candy sweets, that I allow myself to have sometimes, if I’m good during the day. But I can’t stop buying, EVERYTIME I go to the store and I see my favorite cookies, I buy multiple of them. Some\nOf my snacks have been there since August and I have not touched.  I one knows about this; it’s like a 711 convenient store in My closet",
      "created_utc": 1733866663.0,
      "score": 25,
      "context": []
    },
    {
      "id": "m1f5oph",
      "author": "rilatooma444",
      "body": "i do this too but i kept binging for a while so i bring things to give with my coworkers and they let me have few bites haha",
      "created_utc": 1733864985.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m1fpqpk",
      "author": "soul-aliens",
      "body": "i hoard the snacks people give me 😭 its like thank you! but no thank you!",
      "created_utc": 1733871346.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m1g5r49",
      "author": "Queenofwands1212",
      "body": "I feel seen and heard. The amount of safe foods I have hoarded in my cupboards and drawers and even on the top of my kitchen shelves is insane. Feels good not being the only crazy one",
      "created_utc": 1733877026.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m1f7vqr",
      "author": "Fluttery_Soul",
      "body": "I used to do this but I started binging and inhaled my whole collection in 2-3 days...at some point, I had enough and threw away the rest of it.",
      "created_utc": 1733865653.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m1gky1s",
      "author": "justcallmedrzoidberg",
      "body": "😭 the starvation brain is something crazy. I hate it so much. And I hate it for you.",
      "created_utc": 1733882626.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m1g5vxc",
      "author": "abused_blade",
      "body": "Literally omg I have a whole drawer of my shi",
      "created_utc": 1733877074.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m1g7rss",
      "author": "hwa-young-kim-06",
      "body": "wait i thought it was just a me thing-",
      "created_utc": 1733877750.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m1hydag",
      "author": "mimillamaa",
      "body": "i hoard food too! i didnt know that is something other people with anorexia do. i feel like knowing that i have this much food accessible to me and im not eating it makes me feel like im in control",
      "created_utc": 1733907112.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m1fh0ua",
      "author": "dudecass",
      "body": "I go to the grocery store every single day idk why I get it",
      "created_utc": 1733868487.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m1fob9b",
      "author": "odette9",
      "body": "I've collected an assortment of tomato ketchup packets, canderel packets and protein bars over the last few years",
      "created_utc": 1733870873.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m1fd9li",
      "author": "nm791",
      "body": "I do this too. I get anxiety when there’s not a lot of food to look at",
      "created_utc": 1733867305.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m1g2zm9",
      "author": "Interesting-Cow8131",
      "body": "I disguise it as being a low-key prepper. 😅. \nBut seriously, why do we do this? Besides chips, I'm not even hoarding specific foods (i.e. only safe foods).",
      "created_utc": 1733876024.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m1fhirm",
      "author": "lydmit",
      "body": "I love the Caramel Barbell too 😂😂😍",
      "created_utc": 1733868647.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1fsowt",
      "author": "Major_Rush_6844",
      "body": "same there is food in my desk drawer that i wouldn’t eat but it’s still there",
      "created_utc": 1733872353.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1glarz",
      "author": "Adventurous-Earth328",
      "body": "Oh my gosh!! I thought I was alone, and it never made sense to me. I spend the most money at the grocery store when i'm eating the least!! Then the food just goes bad, or i try to freeze it.",
      "created_utc": 1733882761.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1iu7hk",
      "author": "SatisfactionBitter34",
      "body": "i used to do this shit all the damn time wow this just threw me back. I would make a collection of protein bars and things i would plan to eat on my birthday (would eventually come to get sick)",
      "created_utc": 1733924889.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1jcbb7",
      "author": "goal0x",
      "body": "i keep having to write in my calendar every month “CHECK EXPIRATION DATES” 😫",
      "created_utc": 1733931367.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1fqstl",
      "author": "Ok-Bug-3449",
      "body": "I feel this post so hard and also didn’t know it was a thing. It all makes so much sense now",
      "created_utc": 1733871702.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1fyaqn",
      "author": "Miserable_Thought933",
      "body": "I used to hoard chocolates biscuits peanuts, but now thank god I don't do that anymore",
      "created_utc": 1733874340.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1g70qe",
      "author": "AssociationNorth4228",
      "body": "The new misfits bars are SO SO good!!",
      "created_utc": 1733877481.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1gcxtg",
      "author": "Lemonadeo1",
      "body": "Had to take a double take that this wasn’t my own cupboard",
      "created_utc": 1733879626.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1gf9iz",
      "author": "Anniecchan",
      "body": "se mai dovessi beccare una con 50kg di yogurt al carrefour saprai che sono io, la tizia che ha capito che sei italiana dalla marca della camomilla, e ti sentirai meno sola 🥰",
      "created_utc": 1733880490.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1gj6xi",
      "author": "ssamja88",
      "body": "Off topic but one time I met someone from Twitter n we were eating a soft barebell and I was choking on it 😭😭 couldn’t swallow that thing",
      "created_utc": 1733881959.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1gta2u",
      "author": "Throwaway55557783",
      "body": "Wow….are you me. I swear this is what 2 whole DRAWERS of my pantry looks like",
      "created_utc": 1733885813.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1h28hv",
      "author": "BoringRelationship91",
      "body": "i tell myself i'll make myself food and be healthier. but i never do.",
      "created_utc": 1733889410.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1h4lgn",
      "author": "None",
      "body": "I do the same ...I have a snack cupboard of shit I never touch. I usually end up giving it away to people or donating it. But if I'm struggling with feeling bingey the shit goes right into the bin. I have a hoard of chocolate,  nuts, and sweets in a designated cupboard...",
      "created_utc": 1733890424.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1ifeyu",
      "author": "its_Sad_Opal",
      "body": "Omg is that a thing?!\nI always end up with lots of food getting wasted \nI called it \" raccoon habit\" but didn't realise other people do it , I feel like I need to wait till I'm hungry enough to eat it.",
      "created_utc": 1733918175.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1isclh",
      "author": "Pink_Bread_76",
      "body": "I hav ana b/p subtype and I spend an ungodly amount of money on food (100s per day) I am in so much debt this disease sucks",
      "created_utc": 1733924150.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m90x585",
      "author": "RidiculousSheep14",
      "body": "This! It’s so annoying because I have things that will expire and I end up wasting them cause I have to throw them out at that point.",
      "created_utc": 1737771462.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mohsdax",
      "author": "Independent-Shoe594",
      "body": "Yep. My nightstand looks like a 7/11",
      "created_utc": 1745353995.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1gw1uu",
      "author": "Harmonyinheart",
      "body": "I also have ocd preceding my twenty five year ed and I need to ensure I have at least a few days worth of all foods I consume. It is real and serious. I am on SSDI and don’t have the money to keep this up but I panic and freak and have relentless obsessive thoughts about not being able to restock in time. Sugar snap peas for instance are an everyday thing for me. The last eight weeks or so they have been packaging only peas that are not ripe for the picking. So I’m constantly in panic. I try to collect other veggies but none compare. I’ve been like this since I was very little. Only allowed a very small amount of certain foods. May have had Afrid before my anorexia and bulimia",
      "created_utc": 1733886900.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1i44e9",
      "author": "Cassie_sh",
      "body": "I do this with my save foods",
      "created_utc": 1733911139.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1ittps",
      "author": "areydellan",
      "body": "Me with buldak noodles (they're the only thing I eat, the spice is my favorite form of sh)😍",
      "created_utc": 1733924737.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1iu76c",
      "author": "Copperlaces20",
      "body": "Me with ramen 🤦🏽‍♀️",
      "created_utc": 1733924886.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1ka0g4",
      "author": "None",
      "body": "I've been doin it for 10 years. Anorexic for 20. It's just part of it..my brain told me to keep safe it's the smartest thing to do.",
      "created_utc": 1733941757.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1kbcvv",
      "author": "andriantha",
      "body": "I hoard protein bars too",
      "created_utc": 1733942152.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1kegw9",
      "author": "None",
      "body": "oh god i thought it was just me i ate some but have hidden the rest away under my bed. fuck this fucking disorder i keep wasting my money on foods. foods i can eat when \"skinny\" and \"safe foods\" 😭",
      "created_utc": 1733943061.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1kf83g",
      "author": "opalumarupaul",
      "body": "Omg I have a stash of teas",
      "created_utc": 1733943282.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1lp0sx",
      "author": "Pans_Lost_Girl",
      "body": "I used to do this and had to throw out so much food I got because it went stale or past it's best by date by a few years 🥲",
      "created_utc": 1733957089.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1luxun",
      "author": "None",
      "body": "wait i do this i had no idea it was connected to my ed",
      "created_utc": 1733959093.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1mowux",
      "author": "LeatherRespect2650",
      "body": "I hoard protein bars, shakes, and diet sodas. That’s all I can handle though bc I am recovering from BED as well and I will eat anything else",
      "created_utc": 1733969912.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1nnrq1",
      "author": "kying0",
      "body": "Once i hoarded lots of sweets and snacks, after months of hoarding i really wanted to eat something sweet, then i binge ate my WHOLE food \"collection\". I was very sad after doing it.",
      "created_utc": 1733985539.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1nrf8y",
      "author": "Legitimate_Plant2374",
      "body": "I have so much protein as protein is more comfortable to eat !",
      "created_utc": 1733987734.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1okfxe",
      "author": "ginger_marmot",
      "body": "I constantly am buying low calorie food online and having it shipped to my house, but hurrying to get home before my husband to hide it! Often I don’t even eat it, but between spending time down food shopping rabbit holes online and hours at the store filling my cart (and half the time panicking and walking out empty handed), it’s like a second job!",
      "created_utc": 1734006251.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m265mif",
      "author": "Aggressive_Flow492",
      "body": "I thought I was the only one! I feel so heard!",
      "created_utc": 1734272756.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgw8r0t",
      "author": "ComplexImportance992",
      "body": "My closet be like",
      "created_utc": 1741546331.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1eu5g6",
      "author": "LilaVargas03",
      "body": "Omg yeah the panic feeling! I just went grocery shopping and I’m already thinking about going tomorrow “just in case”",
      "created_utc": 1733861420.0,
      "score": 68,
      "context": [
        {
          "id": "m1esvy7",
          "author": "None",
          "body": "I buy so much food and what someone else doesnt eat just goes bad. But if i don't have the food I panic.",
          "created_utc": 1733861018.0
        }
      ]
    },
    {
      "id": "m1l15ns",
      "author": "Bitter-Major-5595",
      "body": "I’m 48yo & new to this form of ED, but I thought I was the only one!! I buy more low cal protein bars than I’m ever going to eat, but they’re like a kind of “security blanket” for me. Why do we do this????",
      "created_utc": 1733949768.0,
      "score": 3,
      "context": [
        {
          "id": "m1esvy7",
          "author": "None",
          "body": "I buy so much food and what someone else doesnt eat just goes bad. But if i don't have the food I panic.",
          "created_utc": 1733861018.0
        }
      ]
    },
    {
      "id": "m1f82sn",
      "author": "No_Particular1870",
      "body": "I relate don’t worry, if I have food in I’ll eat it all I have really bad self control",
      "created_utc": 1733865713.0,
      "score": 57,
      "context": [
        {
          "id": "m1f6erm",
          "author": "nnushk",
          "body": "having food in the house gives me so much anxiety. \nI just buy fresh when I need it. this is my worst nightmare. anyone else here relate? or am I a weirdo?",
          "created_utc": 1733865209.0
        }
      ]
    },
    {
      "id": "m1gamfy",
      "author": "runchmunch",
      "body": "im the same. if food is available, ive already eaten it lol",
      "created_utc": 1733878782.0,
      "score": 8,
      "context": [
        {
          "id": "m1f6erm",
          "author": "nnushk",
          "body": "having food in the house gives me so much anxiety. \nI just buy fresh when I need it. this is my worst nightmare. anyone else here relate? or am I a weirdo?",
          "created_utc": 1733865209.0
        }
      ]
    },
    {
      "id": "m1gdbbv",
      "author": "duckfruits",
      "body": "I'm with you. These photos stress me out! I hate having that much food around. It clutters my mind and overwhelms me. I like having exactly what I need to make food I'm already prepared to make and have spent all day encouraging myself to be able to eat, and nothing more.  But I also have the kind of AN that is control based and also related to my autism. So this feels chaotic and overstimulating. Plus, I would feel like I was living like a fat person so I must be fat and it would push me to restrict more. God, this disease is so messed up.",
      "created_utc": 1733879764.0,
      "score": 14,
      "context": [
        {
          "id": "m1f6erm",
          "author": "nnushk",
          "body": "having food in the house gives me so much anxiety. \nI just buy fresh when I need it. this is my worst nightmare. anyone else here relate? or am I a weirdo?",
          "created_utc": 1733865209.0
        }
      ]
    },
    {
      "id": "m1gv4pz",
      "author": "FeatherWorld",
      "body": "I hate it because I have major anxiety if there is no food but also having a lot of food around triggers me and it's hard for me to stay strong and not binge. It's like I can't win. I'm used to food scarcity and It's hard to regain control. ",
      "created_utc": 1733886535.0,
      "score": 2,
      "context": [
        {
          "id": "m1f6erm",
          "author": "nnushk",
          "body": "having food in the house gives me so much anxiety. \nI just buy fresh when I need it. this is my worst nightmare. anyone else here relate? or am I a weirdo?",
          "created_utc": 1733865209.0
        }
      ]
    },
    {
      "id": "m1lcf8h",
      "author": "Hopeless-Cause",
      "body": "Same. Lots of food in the house gives me anxiety",
      "created_utc": 1733953116.0,
      "score": 2,
      "context": [
        {
          "id": "m1f6erm",
          "author": "nnushk",
          "body": "having food in the house gives me so much anxiety. \nI just buy fresh when I need it. this is my worst nightmare. anyone else here relate? or am I a weirdo?",
          "created_utc": 1733865209.0
        }
      ]
    },
    {
      "id": "m1ksxvx",
      "author": "Prettyfromhell",
      "body": "Same . Sometimes i cant controll my eating and i eat to mutch and feel guilty after",
      "created_utc": 1733947321.0,
      "score": 1,
      "context": [
        {
          "id": "m1f6erm",
          "author": "nnushk",
          "body": "having food in the house gives me so much anxiety. \nI just buy fresh when I need it. this is my worst nightmare. anyone else here relate? or am I a weirdo?",
          "created_utc": 1733865209.0
        }
      ]
    },
    {
      "id": "m1hxdq8",
      "author": "LilaVargas03",
      "body": "🫡🫡🫡 https://imgur.com/a/hboqGv4",
      "created_utc": 1733906419.0,
      "score": 4,
      "context": [
        {
          "id": "m1ezwi2",
          "author": "thrwaysweetie",
          "body": "can we pls share that GLORIOUS protein bar collection?",
          "created_utc": 1733863210.0
        }
      ]
    },
    {
      "id": "mtyhee2",
      "author": "Beautiful_Feed5185",
      "body": "ahh dang that makes more sense, coming from a forster kid lmao",
      "created_utc": 1748060432.0,
      "score": 2,
      "context": [
        {
          "id": "m1gfx6x",
          "author": "Blu3Ski3",
          "body": "This is a symptom of starvation. Your brain wants to make sure there is food when it senses famine. This is not only common in eating disorders but also extremely common when you foster kids who have experienced poverty/lack of food, many of them hoard food like this as a result.",
          "created_utc": 1733880735.0
        }
      ]
    },
    {
      "id": "m1hxh3o",
      "author": "LilaVargas03",
      "body": "ahahah, ti giuro è buonissima, tra l’altro adoro il Carrefour🥰💖",
      "created_utc": 1733906486.0,
      "score": 2,
      "context": [
        {
          "id": "m1gf9iz",
          "author": "Anniecchan",
          "body": "se mai dovessi beccare una con 50kg di yogurt al carrefour saprai che sono io, la tizia che ha capito che sei italiana dalla marca della camomilla, e ti sentirai meno sola 🥰",
          "created_utc": 1733880490.0
        }
      ]
    },
    {
      "id": "m1fgb64",
      "author": "AngryPandaz",
      "body": "I relate to this. I feel the need to always have things stocked up and I constantly buy more of things even though I'm no where near running out.",
      "created_utc": 1733868257.0,
      "score": 34,
      "context": [
        {
          "id": "m1esvy7",
          "author": "None",
          "body": "I buy so much food and what someone else doesnt eat just goes bad. But if i don't have the food I panic.",
          "created_utc": 1733861018.0
        },
        {
          "id": "m1eu5g6",
          "author": "LilaVargas03",
          "body": "Omg yeah the panic feeling! I just went grocery shopping and I’m already thinking about going tomorrow “just in case”",
          "created_utc": 1733861420.0
        }
      ]
    },
    {
      "id": "m1gyld7",
      "author": "nnushk",
      "body": "you have no idea how much I relate to your experience... have you been diagnosed with autism before your ed? as the way you enunciate it, makes me innerstand the ed and autism parallel from a different perspective. \nas for years now I have been questioning my pattern of behaviour and wondering if there is something more than just my ed. I have discussed it with my doctor,  but a autism diagnosis waiting list, takes a long time to get through... or cost a lot to get it done.\nas sometimes I observe myself and say ,what the f are we actually doing, this is insane,. this whole ed is just insane though. in a cathartic kinda way",
      "created_utc": 1733887918.0,
      "score": 5,
      "context": [
        {
          "id": "m1f6erm",
          "author": "nnushk",
          "body": "having food in the house gives me so much anxiety. \nI just buy fresh when I need it. this is my worst nightmare. anyone else here relate? or am I a weirdo?",
          "created_utc": 1733865209.0
        },
        {
          "id": "m1gdbbv",
          "author": "duckfruits",
          "body": "I'm with you. These photos stress me out! I hate having that much food around. It clutters my mind and overwhelms me. I like having exactly what I need to make food I'm already prepared to make and have spent all day encouraging myself to be able to eat, and nothing more.  But I also have the kind of AN that is control based and also related to my autism. So this feels chaotic and overstimulating. Plus, I would feel like I was living like a fat person so I must be fat and it would push me to restrict more. God, this disease is so messed up.",
          "created_utc": 1733879764.0
        }
      ]
    },
    {
      "id": "m237pwi",
      "author": "thrwaysweetie",
      "body": "it’s like finding the holy grail…..",
      "created_utc": 1734218727.0,
      "score": 1,
      "context": [
        {
          "id": "m1ezwi2",
          "author": "thrwaysweetie",
          "body": "can we pls share that GLORIOUS protein bar collection?",
          "created_utc": 1733863210.0
        },
        {
          "id": "m1hxdq8",
          "author": "LilaVargas03",
          "body": "🫡🫡🫡 https://imgur.com/a/hboqGv4",
          "created_utc": 1733906419.0
        }
      ]
    },
    {
      "id": "m1fwc36",
      "author": "oyroo",
      "body": "omg i do this, and before now had never connected it to the disorder , now i see it's common - my mind is blown",
      "created_utc": 1733873635.0,
      "score": 23,
      "context": [
        {
          "id": "m1esvy7",
          "author": "None",
          "body": "I buy so much food and what someone else doesnt eat just goes bad. But if i don't have the food I panic.",
          "created_utc": 1733861018.0
        },
        {
          "id": "m1eu5g6",
          "author": "LilaVargas03",
          "body": "Omg yeah the panic feeling! I just went grocery shopping and I’m already thinking about going tomorrow “just in case”",
          "created_utc": 1733861420.0
        },
        {
          "id": "m1fgb64",
          "author": "AngryPandaz",
          "body": "I relate to this. I feel the need to always have things stocked up and I constantly buy more of things even though I'm no where near running out.",
          "created_utc": 1733868257.0
        }
      ]
    },
    {
      "id": "m1ge1nx",
      "author": "None",
      "body": "I think mine actually stems from being poor and the habits of my grandma(she did this too) and not an ED but it certainly doesn't help",
      "created_utc": 1733880035.0,
      "score": 4,
      "context": [
        {
          "id": "m1esvy7",
          "author": "None",
          "body": "I buy so much food and what someone else doesnt eat just goes bad. But if i don't have the food I panic.",
          "created_utc": 1733861018.0
        },
        {
          "id": "m1eu5g6",
          "author": "LilaVargas03",
          "body": "Omg yeah the panic feeling! I just went grocery shopping and I’m already thinking about going tomorrow “just in case”",
          "created_utc": 1733861420.0
        },
        {
          "id": "m1fgb64",
          "author": "AngryPandaz",
          "body": "I relate to this. I feel the need to always have things stocked up and I constantly buy more of things even though I'm no where near running out.",
          "created_utc": 1733868257.0
        }
      ]
    },
    {
      "id": "m1kilv4",
      "author": "duckfruits",
      "body": "No i got diagnosed with autism as an adult after struggling with various forms of an ed for years. Looking back it was extreamly obvious i was autistic but i was a people pleasing girl in the 90s and early 2000s so i went under the radar. A lot of my later food struggles stemmed from food aversions. So many foods gross me out or are inedible. I got diagnosed with AFRID around age 12. Then a lot of it stemmed from my mom. She was abusive and controlling and impossible to please. She controlled every aspect of my life and nothing was ever good enough. I wasn't ever good enough. She also made me sick on purpose when I was really young and only treated me kindly and lovingly when I was actually sick or went along with her stories about made up symptoms. She liked getting sympathy attention. I think i started restricting to feel a sense of control over something in my life. My mom often tried to feed me foods I just couldn't handle from AFRID/autism and I felt like I had no control over anything but aside from take me to the hospital to be force fed she couldn't make me eat. She did take me to the hospital and even 5150ed me. It was the right call but her motives weren't good. She loved how sick I was. So I believe my ed got worse because my mom treated me better than ever before when I was so thin you could see every bone in my body. You could even see my heart pumping in my chest at one point. I think she wanted me to die from it to get the sympathy from that. Because she stopped taking me to doctors and kind of encouraged my ed in later years. I was totally dependent on her too. \n\nGetting better in my late 20s was the biggest \"f you\" to her.",
      "created_utc": 1733944279.0,
      "score": 4,
      "context": [
        {
          "id": "m1f6erm",
          "author": "nnushk",
          "body": "having food in the house gives me so much anxiety. \nI just buy fresh when I need it. this is my worst nightmare. anyone else here relate? or am I a weirdo?",
          "created_utc": 1733865209.0
        },
        {
          "id": "m1gdbbv",
          "author": "duckfruits",
          "body": "I'm with you. These photos stress me out! I hate having that much food around. It clutters my mind and overwhelms me. I like having exactly what I need to make food I'm already prepared to make and have spent all day encouraging myself to be able to eat, and nothing more.  But I also have the kind of AN that is control based and also related to my autism. So this feels chaotic and overstimulating. Plus, I would feel like I was living like a fat person so I must be fat and it would push me to restrict more. God, this disease is so messed up.",
          "created_utc": 1733879764.0
        },
        {
          "id": "m1gyld7",
          "author": "nnushk",
          "body": "you have no idea how much I relate to your experience... have you been diagnosed with autism before your ed? as the way you enunciate it, makes me innerstand the ed and autism parallel from a different perspective. \nas for years now I have been questioning my pattern of behaviour and wondering if there is something more than just my ed. I have discussed it with my doctor,  but a autism diagnosis waiting list, takes a long time to get through... or cost a lot to get it done.\nas sometimes I observe myself and say ,what the f are we actually doing, this is insane,. this whole ed is just insane though. in a cathartic kinda way",
          "created_utc": 1733887918.0
        }
      ]
    }
  ]
}