{
  "id": "1hhvg1z",
  "subreddit": "AnorexiaNervosa",
  "author": "ExaminationLow3957",
  "created_utc": 1734622331.0,
  "title": "I hate it when people stare at me while eating.",
  "selftext": "I was just trying to eat breakfast for once, and my sister (who is already a huge trigger) just kept staring at me and what I was eating, and I just felt like a fucking pig. I asked her many times to stop staring, but she wouldn’t stop and got upset every time I told her to stop, or asked her why she kept staring. Fuck her.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1hhvg1z/i_hate_it_when_people_stare_at_me_while_eating/",
  "score": 129,
  "num_comments": 15,
  "comments": [
    {
      "id": "m2u2r87",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1734622332.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2u4jmg",
      "author": "Shaxx_69",
      "body": "Hehe I hate that too. I would ask her 'want some of my food?? Seems like it! Here, have some!' It annoys me too I just wanna eat in peace/alone as well I just got so used to eating my meals alone because of the food I eat - nobody in my family eats like me so I'm cooking for myself all the time 🥲",
      "created_utc": 1734622915.0,
      "score": 34,
      "context": []
    },
    {
      "id": "m2uf3c8",
      "author": "Objective-Area-7980",
      "body": "me too my boyfriend doesn’t stare but he’ll look  over at me while we’re eating a meal and it literally makes me want to spit out whatever i’m chewing and not eat any more. I don’t know why it makes me so uncomfortable. He also doesn’t really know i have an ED i think he just assumes i naturally don’t eat much, like he thinks it’s not intentional.",
      "created_utc": 1734626312.0,
      "score": 19,
      "context": []
    },
    {
      "id": "m2udts7",
      "author": "No-Detective5258",
      "body": "Ugh my dad does the same thing! It’s so frustrating because it makes me feel so gross but ik he’s just trying to not seem super outwardly excited that I’m eating. Doesn’t make it any less annoying :(",
      "created_utc": 1734625910.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m2uxfkz",
      "author": "ifalldownandgetup",
      "body": "Me too I hate it. I think some people don’t even realize they are staring but it bothers me so much ughhhh",
      "created_utc": 1734632838.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m2vi696",
      "author": "melancolique_verush",
      "body": "Me too, I stopped eating in public a while back and if I’m going for a drink somewhere (like a coffee) I have a hard time sipping it. It literally feels like heavy lifting and fighting for your life to overcome all the feelings and have a damn sip of coffee when I assume someone might take a glance at me when I do… feels ridiculous.\nWhen at home, I make sure to be all alone while I eat and if someone accidentally walks in (like entering the kitchen for a glass of water at 5am, cause I don’t sleep at night just to be alone and have a quiet time) I have to stop and go away to wait. This is rough",
      "created_utc": 1734639481.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m2wvk68",
      "author": "Pink_Bread_76",
      "body": "literally at acute they sit and stare at you eating and take notes on it 6 times a day. for months. I thought that was the worst ever but then I remembered they also listen to you and sometimes watch you pee and poop. horrible",
      "created_utc": 1734656506.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m2yvndc",
      "author": "mimillamaa",
      "body": "that’s why i hate eating around people or in public.. it’s like people are shocked im eating. it’s so triggering",
      "created_utc": 1734694654.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m2wr7hb",
      "author": "haybails720",
      "body": "Sooo incredibly real",
      "created_utc": 1734654879.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m338niw",
      "author": "Fluttery_Soul",
      "body": "Oh my God, me too. And I hate so much too when I'm cooking or baking something and someone comes up and starts asking what I'm doing.\n\n\nLike, I spend so much time planning what I'm gonna eat and when so when I finally sit down to have it, I wanna enjoy it, not be stared at...makes me wanna throw my food sometimes :/",
      "created_utc": 1734754484.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m2zofwv",
      "author": "lilbabyhoneyy",
      "body": "same",
      "created_utc": 1734707348.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2xck0l",
      "author": "FantomexLive",
      "body": "If she never or rarely sees you eat it makes sense that she would stare because it’s like a rare event in her eyes.  Either that or she wanted some of the food.",
      "created_utc": 1734663021.0,
      "score": -1,
      "context": []
    },
    {
      "id": "m2u6wls",
      "author": "ExaminationLow3957",
      "body": "Exactly!!! Like, why do people have to bother us so much?!?! And thanks, I’ll say that next time anyone stares at my food. And I’ll be super generous about it too. Maybe they’ll stop then.",
      "created_utc": 1734623680.0,
      "score": 16,
      "context": [
        {
          "id": "m2u4jmg",
          "author": "Shaxx_69",
          "body": "Hehe I hate that too. I would ask her 'want some of my food?? Seems like it! Here, have some!' It annoys me too I just wanna eat in peace/alone as well I just got so used to eating my meals alone because of the food I eat - nobody in my family eats like me so I'm cooking for myself all the time 🥲",
          "created_utc": 1734622915.0
        }
      ]
    },
    {
      "id": "m33ax6t",
      "author": "ExaminationLow3957",
      "body": "Yeah… I feel that way too….",
      "created_utc": 1734755545.0,
      "score": 1,
      "context": [
        {
          "id": "m338niw",
          "author": "Fluttery_Soul",
          "body": "Oh my God, me too. And I hate so much too when I'm cooking or baking something and someone comes up and starts asking what I'm doing.\n\n\nLike, I spend so much time planning what I'm gonna eat and when so when I finally sit down to have it, I wanna enjoy it, not be stared at...makes me wanna throw my food sometimes :/",
          "created_utc": 1734754484.0
        }
      ]
    }
  ]
}