{
  "id": "1hm81g7",
  "subreddit": "AnorexiaNervosa",
  "author": "starzz_51",
  "created_utc": 1735157575.0,
  "title": "What’s the top thing you regret doing when you were deep in your ed?",
  "selftext": "Personally for me is \n\n1. Making my family miserable \n2. All the lying \n3. Restricting all the amazing foods\n4.not enjoying life\nEtc…",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1hm81g7/whats_the_top_thing_you_regret_doing_when_you/",
  "score": 117,
  "num_comments": 59,
  "comments": [
    {
      "id": "m3s0tbw",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1735157575.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3sd07s",
      "author": "fuckyoudeath",
      "body": "Telling my former partner about my disorder. Not only did he refuse to do anything that could help me, even simple stuff like asking if I've eaten because \"I shouldn't have to do that, just eat,\" he also actively encouraged my disorder because he found my skinnier body more attractive.",
      "created_utc": 1735162252.0,
      "score": 55,
      "context": []
    },
    {
      "id": "m3s2trc",
      "author": "MelodicFriendship262",
      "body": "Wasting money on chew spit",
      "created_utc": 1735158328.0,
      "score": 85,
      "context": []
    },
    {
      "id": "m3sdqmh",
      "author": "InevitableAd4193",
      "body": "I dropped out of my dream ballet school which i can't return to. Years of work and dreams gone.",
      "created_utc": 1735162540.0,
      "score": 38,
      "context": []
    },
    {
      "id": "m3siy49",
      "author": "OkPermission9759",
      "body": "I was engaged at 23 to a guy I had dated a long while. He said, \"You need to choose me or your eating disorder.\" I chose the eating disorder, then quietly moved out of our shared apartment. \nAlmost ten years later, I met a fantastic man with real kindness. But, he, too, worried about me dying and not being able to have kids due to my eating disorder. This was after living w me for 6 months. We dated 2 more years and got engaged. The moment we did, I just knew it was over. I didn't want to be anyone's mother or wife.\n(I come from an abusive home and was parentified my whole childhood)\nI ended up telling him to leave. He moved out while i was at work and and took our dog. I see him now, in our small town, with kids and a wife. He seems really happy. I'm still stuck in this hell of anorexia at age 47. And because I don't present as emaciated looking, everyone thinks I'm fine. 🙄",
      "created_utc": 1735164584.0,
      "score": 35,
      "context": []
    },
    {
      "id": "m3s1wyv",
      "author": "forvirraforverra",
      "body": "• worrying my family and friends \n\n• missing out on career opportunities \n\n• skipping food-related events with people i love\n\n• isolating myself\n\n• not turning things around in time to avoid osteoporosis\n\n• wasting literal years on being miserable",
      "created_utc": 1735157992.0,
      "score": 42,
      "context": []
    },
    {
      "id": "m3s6yvy",
      "author": "sage-green-lover",
      "body": "Canceling social plans to engage in my ED or due to me feeling too sick to go. Plus not being able to take my dog on long walks when she needed exercise as I couldn’t engage in much movement at my worst. Thankfully my friends were very understanding and I reconnected with most people after some recovery progress",
      "created_utc": 1735159896.0,
      "score": 24,
      "context": []
    },
    {
      "id": "m3saazr",
      "author": "Cavatopme",
      "body": "Making my partner feel like they couldn't trust that I was taking care of myself. EDs, and other addictions, are so secretive.",
      "created_utc": 1735161191.0,
      "score": 16,
      "context": []
    },
    {
      "id": "m3sc6kk",
      "author": "queefula",
      "body": "I wasted so much money throwing away food or flushing it",
      "created_utc": 1735161926.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m3snc5l",
      "author": "PoopTartsU",
      "body": "Genuinely being so tired and drained all the time",
      "created_utc": 1735166357.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m3s5xr0",
      "author": "turnipkitty112",
      "body": "Spending incredible amounts of my parents’ time and money on private treatment while I had absolutely no intention of even trying to recover. My mom took time off work, it was incredibly hard on everyone, and I lied and said I was trying my hardest and really wanted to get better. The truth eventually came out, of course, but far too late. I wish I’d just found a way to have an honest conversation about it sooner to spare us all that hardship.",
      "created_utc": 1735159506.0,
      "score": 37,
      "context": []
    },
    {
      "id": "m3s3mk6",
      "author": "Excellent-World-476",
      "body": "Withdrawing from University rather than deferring. Spending so much money on food. Lying. Losing relationships.",
      "created_utc": 1735158631.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m3s3sa1",
      "author": "lepid0ptera_",
      "body": "-Wasting money on throwing out food and buying low calorie shit that wasn't even tasty\n-Missing out on events \n-Wasting my whole youth on literally doing nothing besides being sad and lying all the time\n-Damaging my health forever \n-Not committing to my hobbies and things i love, instead i just chose to focus on things that literally don't matter\n\nPlease choose recovery. Being ill is not worth it.",
      "created_utc": 1735158692.0,
      "score": 24,
      "context": []
    },
    {
      "id": "m3si5ah",
      "author": "shecallsmeherangel",
      "body": "Fighting so much with other people. I was always irritable and angry.",
      "created_utc": 1735164270.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m3tfder",
      "author": "I_Am_Worthy1011",
      "body": "Pushed the love of my life away. We Are divorced. He’s moved on, and I’m struggling to let go.",
      "created_utc": 1735178050.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m3s69i4",
      "author": "Party_Book_2370",
      "body": "lying, losing relationships, destroying my health forever, worrying about things that really didn't matter, losing all of my hobbies and interests",
      "created_utc": 1735159628.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m3svl1k",
      "author": "None",
      "body": "Top thing would without a doubt be the way I kept cancelling plans with people because I was either terrified to go somewhere without control over food or I was so deep in my BDD during a higher weight fluctuation that I refused to let people see me.\n\nNow in my 30s I basically have no friends at all and no romantic relationship that lasted more than 2 years",
      "created_utc": 1735169740.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m3txr3e",
      "author": "SageSparrow12",
      "body": "1. Losing several of my most competitive years of running due to either malnourishment injuries or complete lack of energy & motivation to do anything but sit on my bed\n\n2. How many times I have humiliated myself in front of family by acting childish or angry or irritated directly because of this disorder",
      "created_utc": 1735186584.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m3sed05",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1735162785.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m3sf4zb",
      "author": "SoupNo2785",
      "body": "stealing money to buy food. It makes me feel SO guilty",
      "created_utc": 1735163092.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m3svaa0",
      "author": "None",
      "body": "Ignored important subjects at school, I was all the time so nutrientless and sleepy... it became impossible to simply focus and study",
      "created_utc": 1735169620.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m3tlj8w",
      "author": "purpleunicorn5",
      "body": "How much time I wasted. Between faking things and thinking about food, faking enjoying time with my ldr bf, I only see him every 6 weeks or so and he's a massive foodie so a lot of our time is and was around food. I wanted to enjoy it so badly because let's not lie, food is amazing and good food with the person you love is perfect, but the anxiety around it exhausts you. I would spend the night before he came to see me, calculating all the potential food we would eat to make sure I could do damage control, it's actually mad.\n\nYou'd think cutting out meals would give you so much more time to do things but instead of being productive or enjoying life, I'd spend hours planning my next meal. I'd have more time if I just ate like a normal fucking person. \n\nI also regret how angry I was when I was DEEP in it. I'd have extended family compliment me, come home and my mum would go on about how I'm gonna end up putting myself in hospital if I kept going the way I was. I remember the pain and anger in her voice till this day and I remember how angry I was at her for saying that. It kinda hurts me now thinking back. I remember thinking \"everyone else is so jealous of me and thinks I look amazing, why can't you just be happy about that\". \n\nAll in all, I regret being such a bitch to everyone, in some ways it wasn't their fault and they were just worried about me, but on the flip side it's like, why would you say shit to me over the years then decide to be worried?",
      "created_utc": 1735180863.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m3s4nhe",
      "author": "summerssleeping",
      "body": "all the food waste. i come from a very poor family and i'm ashamed of c/sing and sabotaging the little food i DID have. i know i'm sick but it's still inexcusable :/",
      "created_utc": 1735159019.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m3s72n7",
      "author": "Capital_Ad1318",
      "body": "Hating myself. Being a bitch because I was pushing everyone away.",
      "created_utc": 1735159936.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m3svczp",
      "author": "BookishBeauty_",
      "body": "Isolating myself from everything food related lmao, I had like no friends in high school cos I refused to go to the canteen 😭",
      "created_utc": 1735169651.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m3t1sio",
      "author": "deathdroptyler",
      "body": "purging genuinely ruined my health to this day. I skipped so many events with people I care about because of food. I didn’t fix things before my bones have been permanently ruined. food waste :/",
      "created_utc": 1735172270.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m3tbz11",
      "author": "temmietastics",
      "body": "Not making friends in middle school. In high school now and it’s so hard to wipe off the reputation I made for myself. I want to make more friends so badly but it’s so hard when everyone already has a (false) perception of you as a loner.",
      "created_utc": 1735176558.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m3ug3le",
      "author": "MaryEn_",
      "body": "1- Wasting money on homeopathic products. They were all sugar, but made me feel less guilty than a normal meal...\n2- make my mother cry... I think it explains itself\n3- Giving up friends, going out and so on for fear of many things\n4- I wasted my eighteen and twenty years and now at thirty I suffer the 'consequences'...",
      "created_utc": 1735197129.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m3shlx5",
      "author": "soda-pops",
      "body": "doing it in the first place. i lost nothing the entire time and gained a ton of weight when i recovered... i was already overweight before, and now i break the damn scale.\n\ni wanted to be pretty before, but now i just want my chance at being healthy back :/",
      "created_utc": 1735164055.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m3ucc8n",
      "author": "CoolSir1453",
      "body": "Missing 1/3 of middle school because I was hospitalized. When I finally came back to school I was a freshman and was so lost. Not only in academics but also the crazy changes that happened in my peers. I still felt like I was in middle school and wasn’t allowed to say “potty words” while my friends were drinking and cussing",
      "created_utc": 1735194653.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m3uijlu",
      "author": "brainyart050722",
      "body": "i regret all the lying i did and ruining my health. i have struggled with my relationship with food for as long as i can remember, and it stunted my growth. when i was as in high school it got really bad. my junior year when i got my first job, i spent my first paycheck on diet pills on the internet and hid them in my room. i stopped eating at all except at dinner with my family every night. i lost 20 pounds in a month and was having nosebleeds every day. my mom had a really tough conversation with me about my eating habits after a couple of months of this. i was so angry at the time but i realize now that she was just trying to get me healthy again. \n\ni have had a couple of bad relapses since then but i’m mostly recovering now and repairing my relationship with food. having friends that care about me and will make sure i’m eating has really helped with that.",
      "created_utc": 1735198870.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m3vivg1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1735221844.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m3x0uyh",
      "author": "petewentzpetegoez",
      "body": "wasting money on food to bp, lying to everyone about food, wanting to do meth because it made the hunger go away, and not eating my grandma's food. she died and i don't have most of her recipes so i only now have memories of the delicious foods she'd make from scratch",
      "created_utc": 1735240903.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m403mk1",
      "author": "Shoddy_Concern8981",
      "body": "refusing to eat with my family at Christmas or at any meal time really i probably missed out on so much",
      "created_utc": 1735285154.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m3w8ty1",
      "author": "None",
      "body": "Wasting $ on laxatives and cigarettes",
      "created_utc": 1735231619.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m3x38yt",
      "author": "ihatethewordoof",
      "body": "Stressing out my friends and family. I didn’t realize how bad it had gotten until it was too late. And then everyone had to stand by and watch me turn into a walking skeleton. It makes me sad and I wish I could go back and take those memories away.",
      "created_utc": 1735241683.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m3x4n4t",
      "author": "strassburgagz",
      "body": "losing two years of my life. two whole years just depressed in bed. the fact it was 2020-2021 didn't help either",
      "created_utc": 1735242146.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m3xiyhs",
      "author": "Anxious-Mechanic-249",
      "body": "Engaging in a behavior in the middle of the night outdoors by the tennis courts then walking to the lake. I will never let that go",
      "created_utc": 1735246964.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m3t9ysh",
      "author": "FantomexLive",
      "body": "Honestly I wish I was doing more cardio. My face looked so good but the lack of any exercise caused me to lose all muscle tone. It was the most attention I’d ever gotten for my face but the least good my body has ever looked.",
      "created_utc": 1735175675.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3txw79",
      "author": "OkPermission9759",
      "body": "I dated a guy like this at age 29. Turned out he was into kids and liked how small and childlike I looked. He was a Christian youth pastor. 🤮",
      "created_utc": 1735186655.0,
      "score": 29,
      "context": [
        {
          "id": "m3sd07s",
          "author": "fuckyoudeath",
          "body": "Telling my former partner about my disorder. Not only did he refuse to do anything that could help me, even simple stuff like asking if I've eaten because \"I shouldn't have to do that, just eat,\" he also actively encouraged my disorder because he found my skinnier body more attractive.",
          "created_utc": 1735162252.0
        }
      ]
    },
    {
      "id": "m3web2p",
      "author": "starzz_51",
      "body": "That’s messed up",
      "created_utc": 1735233446.0,
      "score": 4,
      "context": [
        {
          "id": "m3sd07s",
          "author": "fuckyoudeath",
          "body": "Telling my former partner about my disorder. Not only did he refuse to do anything that could help me, even simple stuff like asking if I've eaten because \"I shouldn't have to do that, just eat,\" he also actively encouraged my disorder because he found my skinnier body more attractive.",
          "created_utc": 1735162252.0
        }
      ]
    },
    {
      "id": "m3s3pai",
      "author": "_-ollie",
      "body": "heavy on this. i waste so much food by chew/spit.",
      "created_utc": 1735158660.0,
      "score": 20,
      "context": [
        {
          "id": "m3s2trc",
          "author": "MelodicFriendship262",
          "body": "Wasting money on chew spit",
          "created_utc": 1735158328.0
        }
      ]
    },
    {
      "id": "m3sditc",
      "author": "InevitableAd4193",
      "body": "I always thought i was the only one. I've wasted so much money on food that i was gonna chew spit",
      "created_utc": 1735162455.0,
      "score": 9,
      "context": [
        {
          "id": "m3s2trc",
          "author": "MelodicFriendship262",
          "body": "Wasting money on chew spit",
          "created_utc": 1735158328.0
        }
      ]
    },
    {
      "id": "m3uw0hf",
      "author": "brownguyinthecorner",
      "body": "My goodness this must be so difficult, I can't even begin to imagine what that did to you. How are you doing now?",
      "created_utc": 1735208619.0,
      "score": 3,
      "context": [
        {
          "id": "m3sdqmh",
          "author": "InevitableAd4193",
          "body": "I dropped out of my dream ballet school which i can't return to. Years of work and dreams gone.",
          "created_utc": 1735162540.0
        }
      ]
    },
    {
      "id": "m3z8qd9",
      "author": "Significant_Arm_2818",
      "body": "I’m so sorry :( hope you’re doing better now..",
      "created_utc": 1735269759.0,
      "score": 2,
      "context": [
        {
          "id": "m3sdqmh",
          "author": "InevitableAd4193",
          "body": "I dropped out of my dream ballet school which i can't return to. Years of work and dreams gone.",
          "created_utc": 1735162540.0
        }
      ]
    },
    {
      "id": "m3u87ll",
      "author": "coldhardash",
      "body": "oh my god this is heartbreaking im so so sorry :( i truly hope you will be able to escape from this hell soon, you deserve so much better <3",
      "created_utc": 1735192146.0,
      "score": 10,
      "context": [
        {
          "id": "m3siy49",
          "author": "OkPermission9759",
          "body": "I was engaged at 23 to a guy I had dated a long while. He said, \"You need to choose me or your eating disorder.\" I chose the eating disorder, then quietly moved out of our shared apartment. \nAlmost ten years later, I met a fantastic man with real kindness. But, he, too, worried about me dying and not being able to have kids due to my eating disorder. This was after living w me for 6 months. We dated 2 more years and got engaged. The moment we did, I just knew it was over. I didn't want to be anyone's mother or wife.\n(I come from an abusive home and was parentified my whole childhood)\nI ended up telling him to leave. He moved out while i was at work and and took our dog. I see him now, in our small town, with kids and a wife. He seems really happy. I'm still stuck in this hell of anorexia at age 47. And because I don't present as emaciated looking, everyone thinks I'm fine. 🙄",
          "created_utc": 1735164584.0
        }
      ]
    },
    {
      "id": "m3wf88s",
      "author": "starzz_51",
      "body": "I fear this might happen to me",
      "created_utc": 1735233757.0,
      "score": 2,
      "context": [
        {
          "id": "m3sed05",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735162785.0
        }
      ]
    },
    {
      "id": "m3tqqs7",
      "author": "melancolique_verush",
      "body": "I’ve been through this in school and just wanted to cheer you up a little if that’s alright. Thing is, I was a very isolated person and thought no one would like to be friends with me (approaching later years of hs) but some folks happened to have similar interests and I kinda started showing curiosity about it. They turned out to be chill people (even tho they looked like a cool-type high school kids) and invited me to watch movies from time to time. I’m saying all this as an example of how things can go during these years even if it seems you won’t befriend anyone. Some people would be surprised if you’ll show (just s little) interest in them and might be glad to develop relationships. I hope you’ll find good friends if you want to, it’s never too late",
      "created_utc": 1735183238.0,
      "score": 3,
      "context": [
        {
          "id": "m3tbz11",
          "author": "temmietastics",
          "body": "Not making friends in middle school. In high school now and it’s so hard to wipe off the reputation I made for myself. I want to make more friends so badly but it’s so hard when everyone already has a (false) perception of you as a loner.",
          "created_utc": 1735176558.0
        }
      ]
    },
    {
      "id": "m3wew95",
      "author": "starzz_51",
      "body": "Your still pretty no matter you weight💗 you shouldn’t let a came decid if ur pretty or not/healthy or not💋",
      "created_utc": 1735233644.0,
      "score": 3,
      "context": [
        {
          "id": "m3shlx5",
          "author": "soda-pops",
          "body": "doing it in the first place. i lost nothing the entire time and gained a ton of weight when i recovered... i was already overweight before, and now i break the damn scale.\n\ni wanted to be pretty before, but now i just want my chance at being healthy back :/",
          "created_utc": 1735164055.0
        }
      ]
    },
    {
      "id": "m3wchu4",
      "author": "starzz_51",
      "body": "Hope ur relationship with ur mum is better aswell",
      "created_utc": 1735232833.0,
      "score": 1,
      "context": [
        {
          "id": "m3uijlu",
          "author": "brainyart050722",
          "body": "i regret all the lying i did and ruining my health. i have struggled with my relationship with food for as long as i can remember, and it stunted my growth. when i was as in high school it got really bad. my junior year when i got my first job, i spent my first paycheck on diet pills on the internet and hid them in my room. i stopped eating at all except at dinner with my family every night. i lost 20 pounds in a month and was having nosebleeds every day. my mom had a really tough conversation with me about my eating habits after a couple of months of this. i was so angry at the time but i realize now that she was just trying to get me healthy again. \n\ni have had a couple of bad relapses since then but i’m mostly recovering now and repairing my relationship with food. having friends that care about me and will make sure i’m eating has really helped with that.",
          "created_utc": 1735198870.0
        }
      ]
    },
    {
      "id": "m3wcc8m",
      "author": "starzz_51",
      "body": "Aww that’s so sad I hope this year will be better for u",
      "created_utc": 1735232782.0,
      "score": 3,
      "context": [
        {
          "id": "m3vivg1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735221844.0
        }
      ]
    },
    {
      "id": "m3tethc",
      "author": "Automatic_Ad5097",
      "body": "I did cardio obsessively and lost muscle tone too and looked horrifying, you only build muscle when you have enough calories; once your body has burned its fat stores, it eats your muscle just the same as if you aren't doing cardio. I promise there is no \"right\" way to have the ed, it all ends up horrifying.",
      "created_utc": 1735177805.0,
      "score": 4,
      "context": [
        {
          "id": "m3t9ysh",
          "author": "FantomexLive",
          "body": "Honestly I wish I was doing more cardio. My face looked so good but the lack of any exercise caused me to lose all muscle tone. It was the most attention I’d ever gotten for my face but the least good my body has ever looked.",
          "created_utc": 1735175675.0
        }
      ]
    },
    {
      "id": "m3wdu9f",
      "author": "starzz_51",
      "body": "I did alooootttt of cardio I looked like a skeleton zombie",
      "created_utc": 1735233289.0,
      "score": 3,
      "context": [
        {
          "id": "m3t9ysh",
          "author": "FantomexLive",
          "body": "Honestly I wish I was doing more cardio. My face looked so good but the lack of any exercise caused me to lose all muscle tone. It was the most attention I’d ever gotten for my face but the least good my body has ever looked.",
          "created_utc": 1735175675.0
        }
      ]
    },
    {
      "id": "m3tysa5",
      "author": "fuckyoudeath",
      "body": "Wow that is horrifying. I'm sorry you had to go through that. Fetishizing an eating disorder is bad enough but to do so because he's a pedophile is absolutely disgusting.",
      "created_utc": 1735187105.0,
      "score": 16,
      "context": [
        {
          "id": "m3sd07s",
          "author": "fuckyoudeath",
          "body": "Telling my former partner about my disorder. Not only did he refuse to do anything that could help me, even simple stuff like asking if I've eaten because \"I shouldn't have to do that, just eat,\" he also actively encouraged my disorder because he found my skinnier body more attractive.",
          "created_utc": 1735162252.0
        },
        {
          "id": "m3txw79",
          "author": "OkPermission9759",
          "body": "I dated a guy like this at age 29. Turned out he was into kids and liked how small and childlike I looked. He was a Christian youth pastor. 🤮",
          "created_utc": 1735186655.0
        }
      ]
    },
    {
      "id": "m40ektq",
      "author": "mimillamaa",
      "body": "same experience here..",
      "created_utc": 1735292493.0,
      "score": 2,
      "context": [
        {
          "id": "m3sd07s",
          "author": "fuckyoudeath",
          "body": "Telling my former partner about my disorder. Not only did he refuse to do anything that could help me, even simple stuff like asking if I've eaten because \"I shouldn't have to do that, just eat,\" he also actively encouraged my disorder because he found my skinnier body more attractive.",
          "created_utc": 1735162252.0
        },
        {
          "id": "m3txw79",
          "author": "OkPermission9759",
          "body": "I dated a guy like this at age 29. Turned out he was into kids and liked how small and childlike I looked. He was a Christian youth pastor. 🤮",
          "created_utc": 1735186655.0
        }
      ]
    },
    {
      "id": "m3s42fl",
      "author": "MelodicFriendship262",
      "body": "Dude I felt retroactively guilty for doing it to so much food my parents had bought over the years when I was a kid. It wasn’t until I got older that I realized how much money I waste doing that",
      "created_utc": 1735158799.0,
      "score": 15,
      "context": [
        {
          "id": "m3s2trc",
          "author": "MelodicFriendship262",
          "body": "Wasting money on chew spit",
          "created_utc": 1735158328.0
        },
        {
          "id": "m3s3pai",
          "author": "_-ollie",
          "body": "heavy on this. i waste so much food by chew/spit.",
          "created_utc": 1735158660.0
        }
      ]
    },
    {
      "id": "m3w3749",
      "author": "OkPermission9759",
      "body": "Thanks. The problem is, I did recover. For 2.5 years. Got into plus-size clothing, restored my brain, and then this May, I fell back into it after my dog passed away. I thought I would never fall back into it. That's how sure I was. Also, my anorexia has never been scary emaciated looking, so I suppose it's easier to hide in plain sight. Now people congratulate me on the loss. Ugh",
      "created_utc": 1735229691.0,
      "score": 7,
      "context": [
        {
          "id": "m3siy49",
          "author": "OkPermission9759",
          "body": "I was engaged at 23 to a guy I had dated a long while. He said, \"You need to choose me or your eating disorder.\" I chose the eating disorder, then quietly moved out of our shared apartment. \nAlmost ten years later, I met a fantastic man with real kindness. But, he, too, worried about me dying and not being able to have kids due to my eating disorder. This was after living w me for 6 months. We dated 2 more years and got engaged. The moment we did, I just knew it was over. I didn't want to be anyone's mother or wife.\n(I come from an abusive home and was parentified my whole childhood)\nI ended up telling him to leave. He moved out while i was at work and and took our dog. I see him now, in our small town, with kids and a wife. He seems really happy. I'm still stuck in this hell of anorexia at age 47. And because I don't present as emaciated looking, everyone thinks I'm fine. 🙄",
          "created_utc": 1735164584.0
        },
        {
          "id": "m3u87ll",
          "author": "coldhardash",
          "body": "oh my god this is heartbreaking im so so sorry :( i truly hope you will be able to escape from this hell soon, you deserve so much better <3",
          "created_utc": 1735192146.0
        }
      ]
    },
    {
      "id": "m77xlsk",
      "author": "temmietastics",
      "body": "Thank you so much!! I do have a few amazing friends at school but I do wish I was invited to parties and stuff. It gets lonely, I’m a really social person naturally. I feel like I screwed myself over a lot and I hate sitting alone in classes where my friends aren’t there. I go to a pretty small school so almost everyone there unfortunately already knows me and knows me for who I was before. I just want to get out of here ASAP and go to college. 2 more years of this crap I guess",
      "created_utc": 1736913942.0,
      "score": 2,
      "context": [
        {
          "id": "m3tbz11",
          "author": "temmietastics",
          "body": "Not making friends in middle school. In high school now and it’s so hard to wipe off the reputation I made for myself. I want to make more friends so badly but it’s so hard when everyone already has a (false) perception of you as a loner.",
          "created_utc": 1735176558.0
        },
        {
          "id": "m3tqqs7",
          "author": "melancolique_verush",
          "body": "I’ve been through this in school and just wanted to cheer you up a little if that’s alright. Thing is, I was a very isolated person and thought no one would like to be friends with me (approaching later years of hs) but some folks happened to have similar interests and I kinda started showing curiosity about it. They turned out to be chill people (even tho they looked like a cool-type high school kids) and invited me to watch movies from time to time. I’m saying all this as an example of how things can go during these years even if it seems you won’t befriend anyone. Some people would be surprised if you’ll show (just s little) interest in them and might be glad to develop relationships. I hope you’ll find good friends if you want to, it’s never too late",
          "created_utc": 1735183238.0
        }
      ]
    },
    {
      "id": "m3xh7nq",
      "author": "soda-pops",
      "body": "i'm definitely okay with how i look now, thank you!\n\nbut when i say im not healthy, i mean it. my family has heart disease and several other conditions that are affected by weight, and i can already feel the stress on my joints. my feet have been hurting horribly ever since i gained.",
      "created_utc": 1735246377.0,
      "score": 3,
      "context": [
        {
          "id": "m3shlx5",
          "author": "soda-pops",
          "body": "doing it in the first place. i lost nothing the entire time and gained a ton of weight when i recovered... i was already overweight before, and now i break the damn scale.\n\ni wanted to be pretty before, but now i just want my chance at being healthy back :/",
          "created_utc": 1735164055.0
        },
        {
          "id": "m3wew95",
          "author": "starzz_51",
          "body": "Your still pretty no matter you weight💗 you shouldn’t let a came decid if ur pretty or not/healthy or not💋",
          "created_utc": 1735233644.0
        }
      ]
    },
    {
      "id": "m3s62fr",
      "author": "_-ollie",
      "body": "i understand you. i do live with my parents and always feel guilty about C/S, like if i weren't consuming any of this food, someone else would've eaten it. \n\nit's just like throwing cash in the trash.",
      "created_utc": 1735159555.0,
      "score": 11,
      "context": [
        {
          "id": "m3s2trc",
          "author": "MelodicFriendship262",
          "body": "Wasting money on chew spit",
          "created_utc": 1735158328.0
        },
        {
          "id": "m3s3pai",
          "author": "_-ollie",
          "body": "heavy on this. i waste so much food by chew/spit.",
          "created_utc": 1735158660.0
        },
        {
          "id": "m3s42fl",
          "author": "MelodicFriendship262",
          "body": "Dude I felt retroactively guilty for doing it to so much food my parents had bought over the years when I was a kid. It wasn’t until I got older that I realized how much money I waste doing that",
          "created_utc": 1735158799.0
        }
      ]
    },
    {
      "id": "m3t38fi",
      "author": "MelodicFriendship262",
      "body": "Literally but it’s just so  addicting. I will eat like 1/4 of whatever it is & c/s the rest",
      "created_utc": 1735172846.0,
      "score": 6,
      "context": [
        {
          "id": "m3s2trc",
          "author": "MelodicFriendship262",
          "body": "Wasting money on chew spit",
          "created_utc": 1735158328.0
        },
        {
          "id": "m3s3pai",
          "author": "_-ollie",
          "body": "heavy on this. i waste so much food by chew/spit.",
          "created_utc": 1735158660.0
        },
        {
          "id": "m3s42fl",
          "author": "MelodicFriendship262",
          "body": "Dude I felt retroactively guilty for doing it to so much food my parents had bought over the years when I was a kid. It wasn’t until I got older that I realized how much money I waste doing that",
          "created_utc": 1735158799.0
        },
        {
          "id": "m3s62fr",
          "author": "_-ollie",
          "body": "i understand you. i do live with my parents and always feel guilty about C/S, like if i weren't consuming any of this food, someone else would've eaten it. \n\nit's just like throwing cash in the trash.",
          "created_utc": 1735159555.0
        }
      ]
    }
  ]
}