{
  "id": "1hng62q",
  "subreddit": "AnorexiaNervosa",
  "author": "Medium-Experience861",
  "created_utc": 1735310165.0,
  "title": "anorexics who almost died, what were the warning signs?",
  "selftext": "not vent, just conversation ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1hng62q/anorexics_who_almost_died_what_were_the_warning/",
  "score": 217,
  "num_comments": 83,
  "comments": [
    {
      "id": "m41bq1r",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1735310165.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m41iohv",
      "author": "Same_Dingo_596",
      "body": "when i reached my lowest point i was in a deep psychotic state, and dont even realized the seriousness. Made a post in an ed forum and the comments were worrying. I read them, thought about them but didnt take any move forward and few days later i was hospitalized (against my will🥲) for months.\nSymptoms were: serious oedema in ankles; it took for an hour to get my clothes on; couldnt make ponytail cause i lost all my muscles; couldnt sit up in my bed without help (at my worst i couldnt get up my head so they held it while take medicines) and so on and its soooo embarasing but i couldnt sit on the toilet, had to stand/squat cause my muscle loss.\n I lived alone, lost all my relationships so no one knows about me and yes, i cant believe i was that sick that i didnt realized how miserable i am.\nAnd the most scary experience was when i felt im dying. Couldnt explain but i felt my last breathe and how my strenght go away.",
      "created_utc": 1735312706.0,
      "score": 232,
      "context": []
    },
    {
      "id": "m41phps",
      "author": "Solal-King-Raccoon",
      "body": "Very low heart rate and I couldn’t form coherent sentences. I avoided talking because I didn’t manage to string together a sentence that was more complex than « yeah. » or « no »",
      "created_utc": 1735315010.0,
      "score": 104,
      "context": []
    },
    {
      "id": "m41i02z",
      "author": "Evening_Island_8026",
      "body": "Yellow skin and eyes not being able to take a shower or even stand up without almost fainting",
      "created_utc": 1735312472.0,
      "score": 99,
      "context": []
    },
    {
      "id": "m41r655",
      "author": "olivep224",
      "body": "My teeth were falling out and my heart rate was low, labs were apparently scary",
      "created_utc": 1735315572.0,
      "score": 63,
      "context": []
    },
    {
      "id": "m432l9d",
      "author": "scrolling-for-fifi",
      "body": "everything slowed down. it took me almost half an hour to drag myself out of bed to use the toilet, my heart rate dropped massively, my speech was slow and a little slurred/nonsensical from what others have told me. \n\ni was constantly freezing cold from the inside out, nothing helped. blankets, hot water bottles, warm drinks, gloves, layered clothing - nothing.\n\nmy skin started yellowing and passing out became more frequent. i felt nauseous constantly and i can’t be sure, but some occasions of passing out felt more like they had been seizures.\n\ni had a horrible feeling of impending doom, i think i knew subconsciously that it was almost the end. i was thinking about death a lot. i think deep down, i just knew",
      "created_utc": 1735330762.0,
      "score": 61,
      "context": []
    },
    {
      "id": "m42m15x",
      "author": "penguinsrevenge",
      "body": "Terrible awful sense of doom, feeling so anxious and scared, feeling dizzy and breathless when walking more than a few steps I would lose vision if I didn't stop walking from the head spins and breathlessness. I was very sad too my heart felt funny all the time, fluttering and sore, or beating way too hard especially when standing. I was trying to do prayers and I just couldn't stand long enough for one set. Insomnia too",
      "created_utc": 1735325437.0,
      "score": 52,
      "context": []
    },
    {
      "id": "m42lcsh",
      "author": "Consistent_Smell_786",
      "body": "My mom did die from anorexic, bulimia, and laxatives abuse. She died for 3-5 mins then the paramedics brought her back to life with a filbuilter (spelling?). That time without oxygen left with a hypoxic brain injury, she now has a brain capacity of a 11-year-old with down syndrome (that is what the neurologist told us to try to explain it to us). This was five years ago now now that I look back on it and realize all the things she hid from us there was warning signs everywhere and we knew and she knew we were too scared to tell her because if we did, it was an all out war it was always that way. She had mood swings. She had no idea who she was. She was severely unhappy, and we all saw this, but we were too scared to tell her due to the fact of how she would react, but I wish I could go back and be the “ horrible” daughter, and just lay out all her shit on the table and share my opinions in my worries and not care if she would react badly I feel like things would be different.",
      "created_utc": 1735325221.0,
      "score": 96,
      "context": []
    },
    {
      "id": "m430fx5",
      "author": "Objective-Area-7980",
      "body": "thank you all for sharing this. This was my wake up call. I have not gotten this bad yet but i know it’s what will come if i keep going this way. I wish you all so much peace and healing❤️‍🩹",
      "created_utc": 1735330064.0,
      "score": 44,
      "context": []
    },
    {
      "id": "m42y1wj",
      "author": "Sunshineheart02",
      "body": "I couldn’t stand or even almost move I had to start using a wheelchair and my bones started to protrude so much that it was breaking skin and I was in a lot of paid and by the time I got to the hospital they weren’t sure if I was even going to make it",
      "created_utc": 1735329286.0,
      "score": 31,
      "context": []
    },
    {
      "id": "m43leoa",
      "author": "None",
      "body": "Oddly I was still doing 15-22km long runs once a week at my lowest but it would take me like 2 days to recover and I was in a constant state of anxiety. To the point I would sleep maybe 2 hours a night. I’d wake up after 90-120 mins and just not be able to get back to sleep even if I took benzos. My body was fighting to keep me alive and my specialist explain that it’s a response when you’re extremely malnourished, the brain is trying to keep you awake to help increase the opportunity to find and consume food.\n\nI was so unbelievably anxious and depressed, like I don’t even recognise my moods and thoughts back then. I lost my relationship and my two closest friends because things would send me into these irrational states and it resulted in some big issues.\n\nThe wake up call was when I went to bed one night (lived alone at this point) and I felt my breathing keep stopping not just slowing. And then I’d suddenly take a gasp, I was told I was going into respiratory failure and a lot of people die in their sleep so I started recovery.",
      "created_utc": 1735336909.0,
      "score": 29,
      "context": []
    },
    {
      "id": "m41hu6j",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1735312414.0,
      "score": 27,
      "context": []
    },
    {
      "id": "m41xzva",
      "author": "yeaahhhhhhhhhhhh",
      "body": "Psychosis and then paralysis",
      "created_utc": 1735317798.0,
      "score": 27,
      "context": []
    },
    {
      "id": "m431vb9",
      "author": "sunnymoodring",
      "body": "Constant chest pain that was exacerbated by exercise, fatigue with walking, shortness of breath (I had an extreme case of myopericarditis, and the inflammation in my heart from being strained through lack of nutrition and too much exercise). I had elevated troponin levels, heart attack level.  I also had terrible brain fog and inability to think critically about anything except workout plans. My heart rate was 20s/30s and I had low blood pressure. Extreme dizziness and blurred vision on standing. Cold always. Despite all this, I thought I was fine until I wasn’t, and found myself in the ICU for a week. I was out of state and my mom had my dad fly out to say goodbye. Now I’m 11 months out from that, and doing much better thanks to a 7 month treatment stay at a fantastic center that saved my life.",
      "created_utc": 1735330529.0,
      "score": 25,
      "context": []
    },
    {
      "id": "m436q9y",
      "author": "None",
      "body": "Vomiting up water and blood because there was no actual food in me for so long. I remember getting scared by anything in my body that wasn't drugs or alcohol but got really close to an OD and starving to death",
      "created_utc": 1735332113.0,
      "score": 25,
      "context": []
    },
    {
      "id": "m43xoew",
      "author": "None",
      "body": "I started purging around the time I was admitted to the ICU the first time. I didn't have proper access to food and recall eating my vomit and then throwing up again at my lowest point. I was young, but the drive was primal. \n\nGenerally, vomit isn't on my favorite food list. It disgusts me to have done so, still. It's been well over a decade... \n\nLater, I identified the need to make changes by similar primal urges.",
      "created_utc": 1735341133.0,
      "score": 19,
      "context": []
    },
    {
      "id": "m43vcev",
      "author": "Turbulent-Ability271",
      "body": "Confusion, my heart doing this thing where it would go into really funny rhythms and I couldn't stop it, not being able to take a proper breath, tinnitus and losing vision, peristent pins and needles all over my hands.\n\nThe other time was a deep, dark sense of hopelessness. A sense of finality, like I was completely done and content with my decision.",
      "created_utc": 1735340303.0,
      "score": 16,
      "context": []
    },
    {
      "id": "m42jvz2",
      "author": "naboo_taboo",
      "body": "I couldn’t sleep at all and really felt my heart beat (even when it was painfully slow). Also fainting and seizures but those were more obvious/extreme signs.",
      "created_utc": 1735324753.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m45tmnj",
      "author": "runninginbubbles",
      "body": "I haven't been near that state but I know someone who died from this, and he documented it in a lot of detail. Some of the symptoms near the end included  \n\\- Extreme weakness. Started with things like struggling to lift legs to get up stairs, then being unable to bend down to pick something up (unable to stand back up) then struggling to stand from a sitting position, then having to physically pick up and move one leg at a time to get onto the bed, paralysis of one side of the body and eventually being unable to lie flat because he was certain he'd not beable to push himself back up. \n\n\\- Incontinence, bladder and bowels. \n\n\\- Heart rate irregularities - really slow to really fast\n\n\\- Difficulty swallowing, every swallow felt like choking. Eventually he'd just spit rather than swallow.\n\nIt is truly an awful, painful, scary way to die.",
      "created_utc": 1735369833.0,
      "score": 16,
      "context": []
    },
    {
      "id": "m43v8kl",
      "author": "vizziniproject",
      "body": "Extremely low BP, fainting all the time, needing a nap after having a shower, incoherent, bowel, and bladder incontinence, psychosis",
      "created_utc": 1735340267.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m44g2hu",
      "author": "Zealousideal-Cod7526",
      "body": "I wasn’t at my lowest weight, I wasn’t restricting at the lowest I have either. I kept waking up soaked in sweat, like soaked. But I was mostly okay when I got up and got breakfast. My doctor gave me a glucometer and it turned out I was having life threatening hypoglycaemic episodes while I was asleep, I didn’t wake up because I was on so many sleeping pills.",
      "created_utc": 1735347858.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m42wbob",
      "author": "purple0vibes",
      "body": "Low heartfrequenz ( went down up to 20-30bpm), irregular heartbeat, chest pain, I felt like I couldn't breathe even when I was laying, fainting, hypoglycemia, labs were shit, chest pain, I was extremely anxious and subconsciously I always had a fear of death, every muscle movement felt as I was doing weight lifting and I couldn't think a straight thought.\n\nEven though my life was never that horrible, hopeless and painful before, I actually miss that time. I was at my lowest weight I ever have been and I never felt that comfortable with my body shape in my entire life. I were finally in peace with my body and didn't had the urge to change something.\nNow I'm in recovery and neither did I received food freedom nor do I feel comfortable in my body now .\nMy biggest wish is food freedom and finally feeling comfortable in my body without having to starve myself to death. There must be another way.\n\nAnyways, dying due to anorexia is absolutely painful and degrading. try everything in your power to avoid it OP. Yes  Feel absolutely uncomfortable in body for now but I'm able to laugh with grandparents again, to race cycling, go into the woods, learn a new language and so much more things that I weren't able to when I was at my lowest. Life feels so much more fun when your body isn't actually dying",
      "created_utc": 1735328721.0,
      "score": 26,
      "context": []
    },
    {
      "id": "m45lae2",
      "author": "Haunting-Tutor-2797",
      "body": "the low heart rate is what scared me the most. I remember being so exhausted that I’d fall asleep at around 9PM every day, and my last thought before falling asleep was “this is going to be my last day on earth”. I could feel my heart skipping beats and pumping so slowly it triggered a huge anxiety in me, which then led to developing insomnia. So I would sleep for 2 hours and so, and then I’d wake up because I was scared of passing away in my sleep.",
      "created_utc": 1735365235.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m44uil7",
      "author": "GoddessEvangelista",
      "body": "The smell™️",
      "created_utc": 1735353451.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m41lvrp",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1735313797.0,
      "score": 18,
      "context": []
    },
    {
      "id": "m43tz9s",
      "author": "tbh-val",
      "body": "low heart and blood pressure, sleeping nearly 16 hours of the day because even being awake was so energy draining, not being able to eat from exhaustion, heart palpitations that could be felt by easily standing, fainting, not having energy to shower, liver enzymes, etc. just because your vitals look normal doesn’t mean you’re okay",
      "created_utc": 1735339829.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m4300aa",
      "author": "FutureUnique365",
      "body": "Fainting randomly. Alot of fainting.",
      "created_utc": 1735329923.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m437367",
      "author": "Nickrules69",
      "body": "You can’t move and feel sick till you eat something. It’s horrible",
      "created_utc": 1735332230.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m43pw7t",
      "author": "UrMomGei666",
      "body": "Fainting, low heart rate, terrible pain and dizziness when standing up/sitting down. I had to stand still or lay still to not feel in pain.\n\nI also lost my gallbladder, but by then I was already recovering",
      "created_utc": 1735338426.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m44rtzt",
      "author": "Big_Youth_7979",
      "body": "Everything was slow. My body, my movement, my thoughts. Everything hurt. Like more than the usual muscle aches. Hideous amounts of hurt that makes you cry out. And I wasn't able to leave the house because I just didn't have the strength or the stamina. Shallow breathing even when I was sedentary. And also that sense of doom others have mentioned.",
      "created_utc": 1735352377.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m452zy8",
      "author": "OneImagination8920",
      "body": "i was constantly passing out and throwing up nothing. my liver was failing and i was in constant pain. i couldn’t even walk to the bathroom without seeing black dots in my vision. i couldn’t remember anything i was told. i was constantly shivering and my blood pressure was extremely low.",
      "created_utc": 1735356872.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m45711p",
      "author": "Nex_Nova_",
      "body": "Felt like I was having a heart attack and eventually called the ambulance and was rushed to hospital with >! 40% blood oxygen and multiple severe electrolyte Imbalances !<\n\nBecause of this I now have >! Peripheral neuropathy in my legs (permanent nerve damage) !<",
      "created_utc": 1735358568.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m47qgd1",
      "author": "xhazymind",
      "body": "my heartbeat was either scarily low or extremely high. every time i stood up i got extremely dizzy, lost my vision and my heart started racing like crazy. even when i sat down, my heart was racing. i had zero strength, every step was one too much. my legs and muscles (also my heart) hurt all the time. also i had problems with keeping my balance.\n\nmy body was covert in bruises. i got asked if I had problems at home because my legs were full of them. it took super long for them to go away because my perfusion was super bad.\n\ni’ve had a high compulsion to move. there has been a very interesting study (minnesota starvation experiment), which showed, that study participants experienced the same and your body starts to „search for food“ resulting from undernourishment.\n\ni had problems with incontinence and couldn’t hold my pee.\n\nwhen i ate, i threw up - I couldn’t tolerate anything at a point.\n\ni am diagnosed with epilepsy (mainly with focal seizures). despite taking medication, i had seizures like every two days.\n\ni was always dreaming and thinking about food. the dreams felt so real at a point, i really thought i ate and woke up and was crying and panicking.\n\nmentally it was hell. i became so lonely because i didn’t even had the strength to talk or answer messages. i was super anxious and mostly couldn’t feel anything anymore. i was super numb. sometimes i was able to cry but this took all my energy and i was extremely exhausted and sleepy. literally anything made me exhausted. one day i was so exhausted, i couldn’t really open my eyes anymore and this was kind of a waking call.\n\ni started to try eating more, but got refeeding syndrome and pericardial effusion. i went to my doctor, she called an ambulance and I was admitted to ICU. it was hard to treat and I got worse. i developed a massive electrolyte imbalance, so my heart stopped. I can’t remember a thing of it and the whole time was traumatic for me.\n\n\neven though i know how bad i was, how lucky i am to have survived this and how close i was to death, i miss being at my lowest. this damn illness takes everything from you.",
      "created_utc": 1735404936.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m43ekrh",
      "author": "cautionfreshpaint",
      "body": "migraines, fainting, chest pain, jaundice",
      "created_utc": 1735334672.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m45rbky",
      "author": "Spaceqwe",
      "body": "I don’t know if I nearly died but I did have this feeling of my body no longer being able to function for its basic needs. I didn’t look like anywhere near some of those people you see on the web when you search for Anorexia Nervosa but I had developed another infection which has happened multiple times in the past few years of the said event.",
      "created_utc": 1735368492.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m4616z5",
      "author": "littlecupcakekitten1",
      "body": "psychosis, detachment from reality, absolute exhaustion, and inability to function on most basic level. also some milder hallucinations, I think from lack of proper sleep and exhaustion",
      "created_utc": 1735374654.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m47i7ll",
      "author": "lizzxcat",
      "body": "i have a friend who experienced a heart attack and severe bloodwork imbalances. then her kidneys began failing — she’s on dialysis now.\n\nanother friend has had severe mental decline. safety is currently a huge concern which she has never really struggled with in the past as much as now. she is miserable. extremely freezing cold all of the time even under multiple layers and blankets. no energy to do anything except sleep/rest/act on behaviors/repeat.",
      "created_utc": 1735402181.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m47p83t",
      "author": "whos_skelly",
      "body": "i had gotten super sick. i was so dizzy and pale and i was so slow when walking. i would shake 24/7. and then finally my parents found me with my heart rate so low that they took me to the hospital and my potassium had been in the ones. 4 doctors told me i should be dead and that really was the turning point for me. it’s not even about weight or what you look like. if you’re sick, you’re sick. please keep yourself safe to the best of your ability. you matter🩷",
      "created_utc": 1735404530.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m48huwn",
      "author": "MartiVenegas",
      "body": "Nothing made any sense. I was extremely depressed. I was desperate to go out and do sth but at the same time I was so scared because of how fragile I felt .",
      "created_utc": 1735413847.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m48pmuj",
      "author": "revolution_a",
      "body": "I couldn’t get up, like genuinely. I could NOT get up. It would hurt every single bit of my body and whenever I would get up, no matter how slow or how quick, I would pass out immediately. My heart rate was super low too, my nails would go blue and skin turn yellow and my muscles would ACHE like never before at the slightest moving. So glad I don’t feel this anymore.",
      "created_utc": 1735416399.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m45cmfx",
      "author": "2bciah5factng",
      "body": "Electrolyte imbalance",
      "created_utc": 1735361056.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m498lfs",
      "author": "neosoba",
      "body": "I wasn't able to write using a pen or put my lenses on. My arms were shaking so much. I remember when i wasn't able to put off my lenses and was crying in bathroom trying to take them out for 6 hours at night STRAIGHT.\nalso, not being able to hold my arms up while playing cello, i was near passing out every time.\n\nBtw it was my cello teacher who noticed first",
      "created_utc": 1735422692.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m49szc5",
      "author": "apij",
      "body": "I became incontinent, didn't have the muscles to hold anything. I even had prolapse which apparently is common when you're severely malnourished. \n\nAt the time I also had serious pitting edema and my heart rate was dropping into the 20s and 30s when I slept, lots of palpitations too. Eating was very painful which was ironic and made things even worse, I also had trouble swallowing. I didn't have muscle to help push myself up to sit up in bed, and relatedly, I had bruises and bed sores on my back. Would not recommend, it was a dark time.\n\nI wasn't thinking clearly either, which is maybe obvious at that point. But I was completely irrational and paranoid, even experienced hallucinations and it eventually led into my first episode of psychosis.",
      "created_utc": 1735429725.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4a04bf",
      "author": "sasz_ko",
      "body": "I couldn't stop vomiting...",
      "created_utc": 1735432175.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4zjt9m",
      "author": "Pink_Bread_76",
      "body": "I broke my leg and has multiple surgeries in february/march (due to pre osteoporosis). I was wheelchair bound. the heavy drugs I was on caused me to further lose my appetite and develop other things like jaundice where my skin and eyes turned yellow. I was so cold and couldn’t move. my parents would check on me at night to make sure I wasn’t dead. multiple times my heart was slowing down or pumping way too hard and dealt with deadly electrolyte imbalance. the brain fog was insane. kept passing out. couldn’t even really stay awake",
      "created_utc": 1735811566.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m41zdrq",
      "author": "anothershthrowaway",
      "body": "I relate so much. Not being able to hold your arms up, not being able to sit up or lift your head, muscle wastage everywhere. The delusions and anosognosia are terrifying.",
      "created_utc": 1735318243.0,
      "score": 76,
      "context": [
        {
          "id": "m41iohv",
          "author": "Same_Dingo_596",
          "body": "when i reached my lowest point i was in a deep psychotic state, and dont even realized the seriousness. Made a post in an ed forum and the comments were worrying. I read them, thought about them but didnt take any move forward and few days later i was hospitalized (against my will🥲) for months.\nSymptoms were: serious oedema in ankles; it took for an hour to get my clothes on; couldnt make ponytail cause i lost all my muscles; couldnt sit up in my bed without help (at my worst i couldnt get up my head so they held it while take medicines) and so on and its soooo embarasing but i couldnt sit on the toilet, had to stand/squat cause my muscle loss.\n I lived alone, lost all my relationships so no one knows about me and yes, i cant believe i was that sick that i didnt realized how miserable i am.\nAnd the most scary experience was when i felt im dying. Couldnt explain but i felt my last breathe and how my strenght go away.",
          "created_utc": 1735312706.0
        }
      ]
    },
    {
      "id": "m42qmyg",
      "author": "johnkcorso",
      "body": "I was very similar, but extremely low heart rate, had jaundice as liver was failing and went blind and lost my hearing towards the very end stage........I had no one at the time and went through a lot of that alone, the blindness and loss of hearing frightened me so much that I reached out......I'm still recovering, the worst of it was 9 years ago...\nWe do recover 💯🙏🥰",
      "created_utc": 1735326904.0,
      "score": 36,
      "context": [
        {
          "id": "m41iohv",
          "author": "Same_Dingo_596",
          "body": "when i reached my lowest point i was in a deep psychotic state, and dont even realized the seriousness. Made a post in an ed forum and the comments were worrying. I read them, thought about them but didnt take any move forward and few days later i was hospitalized (against my will🥲) for months.\nSymptoms were: serious oedema in ankles; it took for an hour to get my clothes on; couldnt make ponytail cause i lost all my muscles; couldnt sit up in my bed without help (at my worst i couldnt get up my head so they held it while take medicines) and so on and its soooo embarasing but i couldnt sit on the toilet, had to stand/squat cause my muscle loss.\n I lived alone, lost all my relationships so no one knows about me and yes, i cant believe i was that sick that i didnt realized how miserable i am.\nAnd the most scary experience was when i felt im dying. Couldnt explain but i felt my last breathe and how my strenght go away.",
          "created_utc": 1735312706.0
        }
      ]
    },
    {
      "id": "m451xdz",
      "author": "cyberdoritos",
      "body": "Honestly I'd like to hear your story. It's not curiosity, I'm genuinely worried and I think that it'd be good if you shared it. Of course only if you're comfy enough AND think it is good and non-triggering for you.",
      "created_utc": 1735356432.0,
      "score": 13,
      "context": [
        {
          "id": "m41iohv",
          "author": "Same_Dingo_596",
          "body": "when i reached my lowest point i was in a deep psychotic state, and dont even realized the seriousness. Made a post in an ed forum and the comments were worrying. I read them, thought about them but didnt take any move forward and few days later i was hospitalized (against my will🥲) for months.\nSymptoms were: serious oedema in ankles; it took for an hour to get my clothes on; couldnt make ponytail cause i lost all my muscles; couldnt sit up in my bed without help (at my worst i couldnt get up my head so they held it while take medicines) and so on and its soooo embarasing but i couldnt sit on the toilet, had to stand/squat cause my muscle loss.\n I lived alone, lost all my relationships so no one knows about me and yes, i cant believe i was that sick that i didnt realized how miserable i am.\nAnd the most scary experience was when i felt im dying. Couldnt explain but i felt my last breathe and how my strenght go away.",
          "created_utc": 1735312706.0
        }
      ]
    },
    {
      "id": "m44m6d9",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1735350168.0,
      "score": 29,
      "context": [
        {
          "id": "m41phps",
          "author": "Solal-King-Raccoon",
          "body": "Very low heart rate and I couldn’t form coherent sentences. I avoided talking because I didn’t manage to string together a sentence that was more complex than « yeah. » or « no »",
          "created_utc": 1735315010.0
        }
      ]
    },
    {
      "id": "m4kdn4o",
      "author": "Suspicious-Use1056",
      "body": "Wait.....this is my symptoms but I just thought I was a teen😭😭 dawg im in recovery am I not eating enough still",
      "created_utc": 1735585279.0,
      "score": 1,
      "context": [
        {
          "id": "m41phps",
          "author": "Solal-King-Raccoon",
          "body": "Very low heart rate and I couldn’t form coherent sentences. I avoided talking because I didn’t manage to string together a sentence that was more complex than « yeah. » or « no »",
          "created_utc": 1735315010.0
        }
      ]
    },
    {
      "id": "m42sk0d",
      "author": "No-Trade-1386",
      "body": "that sounds like me but instead I'm just an anti social teen",
      "created_utc": 1735327514.0,
      "score": -86,
      "context": [
        {
          "id": "m41phps",
          "author": "Solal-King-Raccoon",
          "body": "Very low heart rate and I couldn’t form coherent sentences. I avoided talking because I didn’t manage to string together a sentence that was more complex than « yeah. » or « no »",
          "created_utc": 1735315010.0
        }
      ]
    },
    {
      "id": "m41umzv",
      "author": "None",
      "body": "You had liver failure?",
      "created_utc": 1735316713.0,
      "score": 23,
      "context": [
        {
          "id": "m41i02z",
          "author": "Evening_Island_8026",
          "body": "Yellow skin and eyes not being able to take a shower or even stand up without almost fainting",
          "created_utc": 1735312472.0
        }
      ]
    },
    {
      "id": "m4zjwko",
      "author": "Pink_Bread_76",
      "body": "this 💯💯💯",
      "created_utc": 1735811625.0,
      "score": 1,
      "context": [
        {
          "id": "m41i02z",
          "author": "Evening_Island_8026",
          "body": "Yellow skin and eyes not being able to take a shower or even stand up without almost fainting",
          "created_utc": 1735312472.0
        }
      ]
    },
    {
      "id": "m42m6zx",
      "author": "_-ollie",
      "body": "defibrillator* yes.\n\nplease know that not being able to tell the warning signs or not knowing how to act on them earlier was not your fault. i hope you're doing well.",
      "created_utc": 1735325488.0,
      "score": 59,
      "context": [
        {
          "id": "m42lcsh",
          "author": "Consistent_Smell_786",
          "body": "My mom did die from anorexic, bulimia, and laxatives abuse. She died for 3-5 mins then the paramedics brought her back to life with a filbuilter (spelling?). That time without oxygen left with a hypoxic brain injury, she now has a brain capacity of a 11-year-old with down syndrome (that is what the neurologist told us to try to explain it to us). This was five years ago now now that I look back on it and realize all the things she hid from us there was warning signs everywhere and we knew and she knew we were too scared to tell her because if we did, it was an all out war it was always that way. She had mood swings. She had no idea who she was. She was severely unhappy, and we all saw this, but we were too scared to tell her due to the fact of how she would react, but I wish I could go back and be the “ horrible” daughter, and just lay out all her shit on the table and share my opinions in my worries and not care if she would react badly I feel like things would be different.",
          "created_utc": 1735325221.0
        }
      ]
    },
    {
      "id": "m42vbv3",
      "author": "kellisto1",
      "body": "I'm so sorry. I'm sure you have regrets but please remember that you are definitely not to blame. At all.",
      "created_utc": 1735328403.0,
      "score": 26,
      "context": [
        {
          "id": "m42lcsh",
          "author": "Consistent_Smell_786",
          "body": "My mom did die from anorexic, bulimia, and laxatives abuse. She died for 3-5 mins then the paramedics brought her back to life with a filbuilter (spelling?). That time without oxygen left with a hypoxic brain injury, she now has a brain capacity of a 11-year-old with down syndrome (that is what the neurologist told us to try to explain it to us). This was five years ago now now that I look back on it and realize all the things she hid from us there was warning signs everywhere and we knew and she knew we were too scared to tell her because if we did, it was an all out war it was always that way. She had mood swings. She had no idea who she was. She was severely unhappy, and we all saw this, but we were too scared to tell her due to the fact of how she would react, but I wish I could go back and be the “ horrible” daughter, and just lay out all her shit on the table and share my opinions in my worries and not care if she would react badly I feel like things would be different.",
          "created_utc": 1735325221.0
        }
      ]
    },
    {
      "id": "m44lefd",
      "author": "Healthy_Pineapple296",
      "body": "No matter what, I hope you don’t blame yourself. <3",
      "created_utc": 1735349872.0,
      "score": 10,
      "context": [
        {
          "id": "m42lcsh",
          "author": "Consistent_Smell_786",
          "body": "My mom did die from anorexic, bulimia, and laxatives abuse. She died for 3-5 mins then the paramedics brought her back to life with a filbuilter (spelling?). That time without oxygen left with a hypoxic brain injury, she now has a brain capacity of a 11-year-old with down syndrome (that is what the neurologist told us to try to explain it to us). This was five years ago now now that I look back on it and realize all the things she hid from us there was warning signs everywhere and we knew and she knew we were too scared to tell her because if we did, it was an all out war it was always that way. She had mood swings. She had no idea who she was. She was severely unhappy, and we all saw this, but we were too scared to tell her due to the fact of how she would react, but I wish I could go back and be the “ horrible” daughter, and just lay out all her shit on the table and share my opinions in my worries and not care if she would react badly I feel like things would be different.",
          "created_utc": 1735325221.0
        }
      ]
    },
    {
      "id": "m43axnz",
      "author": "pdt666",
      "body": "it’s okay girl you didn’t know. if you had, you would have done that. you wanted to do the thing to keep her safest and had no way of knowing 💕 her behavior was unpredictable then and you literally had no idea what to do. i can tell how much you love and care for your mom💜",
      "created_utc": 1735333483.0,
      "score": 19,
      "context": [
        {
          "id": "m42lcsh",
          "author": "Consistent_Smell_786",
          "body": "My mom did die from anorexic, bulimia, and laxatives abuse. She died for 3-5 mins then the paramedics brought her back to life with a filbuilter (spelling?). That time without oxygen left with a hypoxic brain injury, she now has a brain capacity of a 11-year-old with down syndrome (that is what the neurologist told us to try to explain it to us). This was five years ago now now that I look back on it and realize all the things she hid from us there was warning signs everywhere and we knew and she knew we were too scared to tell her because if we did, it was an all out war it was always that way. She had mood swings. She had no idea who she was. She was severely unhappy, and we all saw this, but we were too scared to tell her due to the fact of how she would react, but I wish I could go back and be the “ horrible” daughter, and just lay out all her shit on the table and share my opinions in my worries and not care if she would react badly I feel like things would be different.",
          "created_utc": 1735325221.0
        }
      ]
    },
    {
      "id": "m47ltcy",
      "author": "xhazymind",
      "body": "wishing you all the best, i hope you’ll reach out soon. you have a place in this world 🤍",
      "created_utc": 1735403396.0,
      "score": 3,
      "context": [
        {
          "id": "m430fx5",
          "author": "Objective-Area-7980",
          "body": "thank you all for sharing this. This was my wake up call. I have not gotten this bad yet but i know it’s what will come if i keep going this way. I wish you all so much peace and healing❤️‍🩹",
          "created_utc": 1735330064.0
        }
      ]
    },
    {
      "id": "m42nhd2",
      "author": "to_tired_to_clare",
      "body": "This happened to me too and resulted in my heart stopping twice",
      "created_utc": 1735325898.0,
      "score": 6,
      "context": [
        {
          "id": "m41hu6j",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735312414.0
        }
      ]
    },
    {
      "id": "m42s1la",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1735327350.0,
      "score": -7,
      "context": [
        {
          "id": "m41hu6j",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735312414.0
        }
      ]
    },
    {
      "id": "m45bgfc",
      "author": "NiiShieldBJJ",
      "body": "What did the psychosis feel like",
      "created_utc": 1735360521.0,
      "score": 5,
      "context": [
        {
          "id": "m41xzva",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Psychosis and then paralysis",
          "created_utc": 1735317798.0
        }
      ]
    },
    {
      "id": "m47m6at",
      "author": "xhazymind",
      "body": "so glad to hear you’re better, wishing you all the best for the future and hope you’ll make it out of this terrible illness one day.",
      "created_utc": 1735403515.0,
      "score": 2,
      "context": [
        {
          "id": "m431vb9",
          "author": "sunnymoodring",
          "body": "Constant chest pain that was exacerbated by exercise, fatigue with walking, shortness of breath (I had an extreme case of myopericarditis, and the inflammation in my heart from being strained through lack of nutrition and too much exercise). I had elevated troponin levels, heart attack level.  I also had terrible brain fog and inability to think critically about anything except workout plans. My heart rate was 20s/30s and I had low blood pressure. Extreme dizziness and blurred vision on standing. Cold always. Despite all this, I thought I was fine until I wasn’t, and found myself in the ICU for a week. I was out of state and my mom had my dad fly out to say goodbye. Now I’m 11 months out from that, and doing much better thanks to a 7 month treatment stay at a fantastic center that saved my life.",
          "created_utc": 1735330529.0
        }
      ]
    },
    {
      "id": "m4s6en7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1735693609.0,
      "score": 1,
      "context": [
        {
          "id": "m44uil7",
          "author": "GoddessEvangelista",
          "body": "The smell™️",
          "created_utc": 1735353451.0
        }
      ]
    },
    {
      "id": "m4212ft",
      "author": "candyfloss08",
      "body": "Sending you a virtuel hug ❤️‍🩹",
      "created_utc": 1735318782.0,
      "score": 7,
      "context": [
        {
          "id": "m41lvrp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735313797.0
        }
      ]
    },
    {
      "id": "m42s49l",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1735327374.0,
      "score": -1,
      "context": [
        {
          "id": "m41lvrp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735313797.0
        }
      ]
    },
    {
      "id": "m47ppsm",
      "author": "whos_skelly",
      "body": "that’s what happened to me. they thought i had bulimia from my electrolytes.",
      "created_utc": 1735404692.0,
      "score": 3,
      "context": [
        {
          "id": "m45711p",
          "author": "Nex_Nova_",
          "body": "Felt like I was having a heart attack and eventually called the ambulance and was rushed to hospital with >! 40% blood oxygen and multiple severe electrolyte Imbalances !<\n\nBecause of this I now have >! Peripheral neuropathy in my legs (permanent nerve damage) !<",
          "created_utc": 1735358568.0
        }
      ]
    },
    {
      "id": "m498qvd",
      "author": "neosoba",
      "body": "Also yellow/orange skin and fainting frequently",
      "created_utc": 1735422742.0,
      "score": 1,
      "context": [
        {
          "id": "m498lfs",
          "author": "neosoba",
          "body": "I wasn't able to write using a pen or put my lenses on. My arms were shaking so much. I remember when i wasn't able to put off my lenses and was crying in bathroom trying to take them out for 6 hours at night STRAIGHT.\nalso, not being able to hold my arms up while playing cello, i was near passing out every time.\n\nBtw it was my cello teacher who noticed first",
          "created_utc": 1735422692.0
        }
      ]
    },
    {
      "id": "m42cx3b",
      "author": "Fit1108-",
      "body": "I experienced this as well. I was not physically able to get myself up after laying down and was unable to even hold my curling iron because it was too heavy. I also experienced nerve damage in my leg (apparently related to the pressure of sleeping on my side and not having enough subcutaneous tissue).",
      "created_utc": 1735322549.0,
      "score": 36,
      "context": [
        {
          "id": "m41iohv",
          "author": "Same_Dingo_596",
          "body": "when i reached my lowest point i was in a deep psychotic state, and dont even realized the seriousness. Made a post in an ed forum and the comments were worrying. I read them, thought about them but didnt take any move forward and few days later i was hospitalized (against my will🥲) for months.\nSymptoms were: serious oedema in ankles; it took for an hour to get my clothes on; couldnt make ponytail cause i lost all my muscles; couldnt sit up in my bed without help (at my worst i couldnt get up my head so they held it while take medicines) and so on and its soooo embarasing but i couldnt sit on the toilet, had to stand/squat cause my muscle loss.\n I lived alone, lost all my relationships so no one knows about me and yes, i cant believe i was that sick that i didnt realized how miserable i am.\nAnd the most scary experience was when i felt im dying. Couldnt explain but i felt my last breathe and how my strenght go away.",
          "created_utc": 1735312706.0
        },
        {
          "id": "m41zdrq",
          "author": "anothershthrowaway",
          "body": "I relate so much. Not being able to hold your arms up, not being able to sit up or lift your head, muscle wastage everywhere. The delusions and anosognosia are terrifying.",
          "created_utc": 1735318243.0
        }
      ]
    },
    {
      "id": "m42fqjw",
      "author": "Same_Dingo_596",
      "body": "hope u are better now🩷",
      "created_utc": 1735323439.0,
      "score": 7,
      "context": [
        {
          "id": "m41iohv",
          "author": "Same_Dingo_596",
          "body": "when i reached my lowest point i was in a deep psychotic state, and dont even realized the seriousness. Made a post in an ed forum and the comments were worrying. I read them, thought about them but didnt take any move forward and few days later i was hospitalized (against my will🥲) for months.\nSymptoms were: serious oedema in ankles; it took for an hour to get my clothes on; couldnt make ponytail cause i lost all my muscles; couldnt sit up in my bed without help (at my worst i couldnt get up my head so they held it while take medicines) and so on and its soooo embarasing but i couldnt sit on the toilet, had to stand/squat cause my muscle loss.\n I lived alone, lost all my relationships so no one knows about me and yes, i cant believe i was that sick that i didnt realized how miserable i am.\nAnd the most scary experience was when i felt im dying. Couldnt explain but i felt my last breathe and how my strenght go away.",
          "created_utc": 1735312706.0
        },
        {
          "id": "m41zdrq",
          "author": "anothershthrowaway",
          "body": "I relate so much. Not being able to hold your arms up, not being able to sit up or lift your head, muscle wastage everywhere. The delusions and anosognosia are terrifying.",
          "created_utc": 1735318243.0
        }
      ]
    },
    {
      "id": "m44omjk",
      "author": "Same_Dingo_596",
      "body": "oo yes, the hear loss. When it started i thought my new shampoo caused it🥲😂\nhappy for ur recovery and wish the best🩷✨",
      "created_utc": 1735351109.0,
      "score": 16,
      "context": [
        {
          "id": "m41iohv",
          "author": "Same_Dingo_596",
          "body": "when i reached my lowest point i was in a deep psychotic state, and dont even realized the seriousness. Made a post in an ed forum and the comments were worrying. I read them, thought about them but didnt take any move forward and few days later i was hospitalized (against my will🥲) for months.\nSymptoms were: serious oedema in ankles; it took for an hour to get my clothes on; couldnt make ponytail cause i lost all my muscles; couldnt sit up in my bed without help (at my worst i couldnt get up my head so they held it while take medicines) and so on and its soooo embarasing but i couldnt sit on the toilet, had to stand/squat cause my muscle loss.\n I lived alone, lost all my relationships so no one knows about me and yes, i cant believe i was that sick that i didnt realized how miserable i am.\nAnd the most scary experience was when i felt im dying. Couldnt explain but i felt my last breathe and how my strenght go away.",
          "created_utc": 1735312706.0
        },
        {
          "id": "m42qmyg",
          "author": "johnkcorso",
          "body": "I was very similar, but extremely low heart rate, had jaundice as liver was failing and went blind and lost my hearing towards the very end stage........I had no one at the time and went through a lot of that alone, the blindness and loss of hearing frightened me so much that I reached out......I'm still recovering, the worst of it was 9 years ago...\nWe do recover 💯🙏🥰",
          "created_utc": 1735326904.0
        }
      ]
    },
    {
      "id": "m4c8zv0",
      "author": "Same_Dingo_596",
      "body": "I can tell you about it, I'm not triggered ( a lot😂) by the story anymore.\nFor me it started relatively late compared to the average, because I was about 20-21 years old. it didn't come out of nowhere, so I had been exercising too much, doing x cal diets etc. before but they never had much effect.\nAnd then during covid I started to train at home and keep fit, but then I moved back to my university dorm and that's where all hell broke loose.\n In the meantime I wasn't on good terms with my family, my best friend moved out of town etc so I was really lonely.\nWhat's probably different in my case than what I go through on social media is that in the end I couldn't function at all. And i really don't understand how others can walk with x bmi for example. (No shame or something of course!! I just cant accept that i wasnt able to do a lot of things and cant see where i screwed it)\nIn the meantime I did a lot of shit, I mean I drank a lot of alcohol and tried other things. (But in the meantime I did the same at school and had good results) Looking back, it was all very sad. \nThen it got to the point where I had to leave an hour early for the university 20 minutes away, and I was afraid of freezing to death on the street because I couldn't walk up the hill to the dormitory and as i write before i was so slow, faint in public places etc \nThen I had to go home to my parents for something and they decided to call an ambulance. And even though I was 21 years old, I got a court order like that saying that I had to have compulsory psychiatric treatment. And that lasted for 3 months.\nIn my country there is no proper care for people with eating disorders so those months were disastrous. Partly because the first half was spent trying to keep me alive and I had terrible pain and really just wanted it to be over. Shame or not, at 21 I was being changed by nurses barely older than me. The hospital stay was awful, no one came to see me. And because the care was so shit they gave me enough formula to get me to the required weight and discharged me. So mental recovery was 0.\nIt's actually been years since then anyway, I've tried to put it completely behind me but I just can't. \nNow writing this I have ambivalent feelings, because on the one hand I'm glad I survived all this shit, but on the other hand I miss the discipline and the way of thinking I had back then.\n\nEdit: and i had to add that i know proA forums can be harmful but when i did my post when started to realise that something is wrong i got incredible support, they were so worried and so nice to me. \nI was soo delusional and i swear im not that dumb but when it was me i didnt see the signs. Its kinda akward and slightly funny after that i was that naive😂",
      "created_utc": 1735471109.0,
      "score": 6,
      "context": [
        {
          "id": "m41iohv",
          "author": "Same_Dingo_596",
          "body": "when i reached my lowest point i was in a deep psychotic state, and dont even realized the seriousness. Made a post in an ed forum and the comments were worrying. I read them, thought about them but didnt take any move forward and few days later i was hospitalized (against my will🥲) for months.\nSymptoms were: serious oedema in ankles; it took for an hour to get my clothes on; couldnt make ponytail cause i lost all my muscles; couldnt sit up in my bed without help (at my worst i couldnt get up my head so they held it while take medicines) and so on and its soooo embarasing but i couldnt sit on the toilet, had to stand/squat cause my muscle loss.\n I lived alone, lost all my relationships so no one knows about me and yes, i cant believe i was that sick that i didnt realized how miserable i am.\nAnd the most scary experience was when i felt im dying. Couldnt explain but i felt my last breathe and how my strenght go away.",
          "created_utc": 1735312706.0
        },
        {
          "id": "m451xdz",
          "author": "cyberdoritos",
          "body": "Honestly I'd like to hear your story. It's not curiosity, I'm genuinely worried and I think that it'd be good if you shared it. Of course only if you're comfy enough AND think it is good and non-triggering for you.",
          "created_utc": 1735356432.0
        }
      ]
    },
    {
      "id": "m45bd1y",
      "author": "NiiShieldBJJ",
      "body": "Terrifying",
      "created_utc": 1735360477.0,
      "score": 5,
      "context": [
        {
          "id": "m41phps",
          "author": "Solal-King-Raccoon",
          "body": "Very low heart rate and I couldn’t form coherent sentences. I avoided talking because I didn’t manage to string together a sentence that was more complex than « yeah. » or « no »",
          "created_utc": 1735315010.0
        },
        {
          "id": "m44m6d9",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735350168.0
        }
      ]
    },
    {
      "id": "m4zjv6v",
      "author": "Pink_Bread_76",
      "body": "same!!",
      "created_utc": 1735811600.0,
      "score": 1,
      "context": [
        {
          "id": "m41phps",
          "author": "Solal-King-Raccoon",
          "body": "Very low heart rate and I couldn’t form coherent sentences. I avoided talking because I didn’t manage to string together a sentence that was more complex than « yeah. » or « no »",
          "created_utc": 1735315010.0
        },
        {
          "id": "m44m6d9",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735350168.0
        }
      ]
    },
    {
      "id": "m4kf2fw",
      "author": "Solal-King-Raccoon",
      "body": "Idk about you but for me it was a direct symptom of being extremely UW. Im usually a chatterbox and when I was literally close to death I just didn’t have the energy to actually think about non ED stuff let alone speak in a normal way",
      "created_utc": 1735585716.0,
      "score": 2,
      "context": [
        {
          "id": "m41phps",
          "author": "Solal-King-Raccoon",
          "body": "Very low heart rate and I couldn’t form coherent sentences. I avoided talking because I didn’t manage to string together a sentence that was more complex than « yeah. » or « no »",
          "created_utc": 1735315010.0
        },
        {
          "id": "m4kdn4o",
          "author": "Suspicious-Use1056",
          "body": "Wait.....this is my symptoms but I just thought I was a teen😭😭 dawg im in recovery am I not eating enough still",
          "created_utc": 1735585279.0
        }
      ]
    },
    {
      "id": "m41usaw",
      "author": "Evening_Island_8026",
      "body": "Almost very close fortunately I had a wake up call from a doctor because I didn’t believe I was unwell at all",
      "created_utc": 1735316761.0,
      "score": 36,
      "context": [
        {
          "id": "m41i02z",
          "author": "Evening_Island_8026",
          "body": "Yellow skin and eyes not being able to take a shower or even stand up without almost fainting",
          "created_utc": 1735312472.0
        },
        {
          "id": "m41umzv",
          "author": "None",
          "body": "You had liver failure?",
          "created_utc": 1735316713.0
        }
      ]
    },
    {
      "id": "m47loyx",
      "author": "xhazymind",
      "body": "what did they wrote?",
      "created_utc": 1735403355.0,
      "score": 1,
      "context": [
        {
          "id": "m41hu6j",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735312414.0
        },
        {
          "id": "m42nhd2",
          "author": "to_tired_to_clare",
          "body": "This happened to me too and resulted in my heart stopping twice",
          "created_utc": 1735325898.0
        }
      ]
    },
    {
      "id": "m47el2v",
      "author": "DivinityBeach",
      "body": "everything is upside down, time isn’t a thing anymore, everything bends and twists, you can trust nobody and nothing",
      "created_utc": 1735400923.0,
      "score": 8,
      "context": [
        {
          "id": "m41xzva",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Psychosis and then paralysis",
          "created_utc": 1735317798.0
        },
        {
          "id": "m45bgfc",
          "author": "NiiShieldBJJ",
          "body": "What did the psychosis feel like",
          "created_utc": 1735360521.0
        }
      ]
    },
    {
      "id": "m4cixti",
      "author": "yeaahhhhhhhhhhhh",
      "body": "I didn’t feel real. Didn’t know if I was dead or alive. I lashed out on everyone and everything for no reason. I went to the doctor and made a scene because he told me to just eat. I’m a very reserved, shy person. But during that time. I was a Menace to everyone around me",
      "created_utc": 1735476927.0,
      "score": 4,
      "context": [
        {
          "id": "m41xzva",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Psychosis and then paralysis",
          "created_utc": 1735317798.0
        },
        {
          "id": "m45bgfc",
          "author": "NiiShieldBJJ",
          "body": "What did the psychosis feel like",
          "created_utc": 1735360521.0
        }
      ]
    },
    {
      "id": "m54j0b6",
      "author": "Athenx_x",
      "body": "There's normally a smell that you're able to smell due to your organ's practically rotting because they are eating themselves for you to be able to survive. for example it's kinda like the smell (i heard this from someone) is like when going into an elderly / nursing home and you get that awful smell of death kind of. depending on the person or the issue it can be stronger in smell than others",
      "created_utc": 1735874949.0,
      "score": 1,
      "context": [
        {
          "id": "m44uil7",
          "author": "GoddessEvangelista",
          "body": "The smell™️",
          "created_utc": 1735353451.0
        },
        {
          "id": "m4s6en7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735693609.0
        }
      ]
    },
    {
      "id": "m4819ce",
      "author": "Nex_Nova_",
      "body": "You poor thing!!! They did full protocol work up and I was very honest with my >! Intake !< and >! Recent three day binge and lax abuse !< and it basically a combination of both that made me >! Medically unstable !<\n\n\nOn Christmas Day I chose recovery because I want my life back. Almost dying is a massive wake up call.",
      "created_utc": 1735408472.0,
      "score": 4,
      "context": [
        {
          "id": "m45711p",
          "author": "Nex_Nova_",
          "body": "Felt like I was having a heart attack and eventually called the ambulance and was rushed to hospital with >! 40% blood oxygen and multiple severe electrolyte Imbalances !<\n\nBecause of this I now have >! Peripheral neuropathy in my legs (permanent nerve damage) !<",
          "created_utc": 1735358568.0
        },
        {
          "id": "m47ppsm",
          "author": "whos_skelly",
          "body": "that’s what happened to me. they thought i had bulimia from my electrolytes.",
          "created_utc": 1735404692.0
        }
      ]
    },
    {
      "id": "m43ag8x",
      "author": "pdt666",
      "body": "this happened to my best friend and it comes up again whenever she gets pregnant :( ",
      "created_utc": 1735333324.0,
      "score": 6,
      "context": [
        {
          "id": "m41iohv",
          "author": "Same_Dingo_596",
          "body": "when i reached my lowest point i was in a deep psychotic state, and dont even realized the seriousness. Made a post in an ed forum and the comments were worrying. I read them, thought about them but didnt take any move forward and few days later i was hospitalized (against my will🥲) for months.\nSymptoms were: serious oedema in ankles; it took for an hour to get my clothes on; couldnt make ponytail cause i lost all my muscles; couldnt sit up in my bed without help (at my worst i couldnt get up my head so they held it while take medicines) and so on and its soooo embarasing but i couldnt sit on the toilet, had to stand/squat cause my muscle loss.\n I lived alone, lost all my relationships so no one knows about me and yes, i cant believe i was that sick that i didnt realized how miserable i am.\nAnd the most scary experience was when i felt im dying. Couldnt explain but i felt my last breathe and how my strenght go away.",
          "created_utc": 1735312706.0
        },
        {
          "id": "m41zdrq",
          "author": "anothershthrowaway",
          "body": "I relate so much. Not being able to hold your arms up, not being able to sit up or lift your head, muscle wastage everywhere. The delusions and anosognosia are terrifying.",
          "created_utc": 1735318243.0
        },
        {
          "id": "m42cx3b",
          "author": "Fit1108-",
          "body": "I experienced this as well. I was not physically able to get myself up after laying down and was unable to even hold my curling iron because it was too heavy. I also experienced nerve damage in my leg (apparently related to the pressure of sleeping on my side and not having enough subcutaneous tissue).",
          "created_utc": 1735322549.0
        }
      ]
    },
    {
      "id": "m44owd2",
      "author": "xxninja33xx",
      "body": "i’m so sorry but the shampoo reasoning is so funny",
      "created_utc": 1735351217.0,
      "score": 25,
      "context": [
        {
          "id": "m41iohv",
          "author": "Same_Dingo_596",
          "body": "when i reached my lowest point i was in a deep psychotic state, and dont even realized the seriousness. Made a post in an ed forum and the comments were worrying. I read them, thought about them but didnt take any move forward and few days later i was hospitalized (against my will🥲) for months.\nSymptoms were: serious oedema in ankles; it took for an hour to get my clothes on; couldnt make ponytail cause i lost all my muscles; couldnt sit up in my bed without help (at my worst i couldnt get up my head so they held it while take medicines) and so on and its soooo embarasing but i couldnt sit on the toilet, had to stand/squat cause my muscle loss.\n I lived alone, lost all my relationships so no one knows about me and yes, i cant believe i was that sick that i didnt realized how miserable i am.\nAnd the most scary experience was when i felt im dying. Couldnt explain but i felt my last breathe and how my strenght go away.",
          "created_utc": 1735312706.0
        },
        {
          "id": "m42qmyg",
          "author": "johnkcorso",
          "body": "I was very similar, but extremely low heart rate, had jaundice as liver was failing and went blind and lost my hearing towards the very end stage........I had no one at the time and went through a lot of that alone, the blindness and loss of hearing frightened me so much that I reached out......I'm still recovering, the worst of it was 9 years ago...\nWe do recover 💯🙏🥰",
          "created_utc": 1735326904.0
        },
        {
          "id": "m44omjk",
          "author": "Same_Dingo_596",
          "body": "oo yes, the hear loss. When it started i thought my new shampoo caused it🥲😂\nhappy for ur recovery and wish the best🩷✨",
          "created_utc": 1735351109.0
        }
      ]
    },
    {
      "id": "m4f28q1",
      "author": "cyberdoritos",
      "body": "Oh, I'm deeply sorry things went like that. I honestly cannot imagine how hard and painful it was for you to go through everything you went and still be strong as you are (clearly).\n\n I cannot say I understand this shit completely (every experience is unique, lol) but fck it, I felt so mad whenever I was feeling bad/sick because I get that in order to be BMI x or y I HAD to be sick and unable to live my life. Pissed me off so bad I decided to recover, still do. No way I have to choose between my ideal looks and my life. \n\nSo I see you still have mixed feelings about this, but let's approach positively. Or stoic-ly. It is what it is and you're alive! And world's better because you are here. Honestly. You look good even though I know you're not worried about your looks, lol. \n\nThank you for sharing your story and thank you for being here today, thank you for being brave in all of your moves. If you ever think you're alone, remember you're not. You got lots of people with you (including a random stranger from Reddit). Rooting deeply.",
      "created_utc": 1735507737.0,
      "score": 3,
      "context": [
        {
          "id": "m41iohv",
          "author": "Same_Dingo_596",
          "body": "when i reached my lowest point i was in a deep psychotic state, and dont even realized the seriousness. Made a post in an ed forum and the comments were worrying. I read them, thought about them but didnt take any move forward and few days later i was hospitalized (against my will🥲) for months.\nSymptoms were: serious oedema in ankles; it took for an hour to get my clothes on; couldnt make ponytail cause i lost all my muscles; couldnt sit up in my bed without help (at my worst i couldnt get up my head so they held it while take medicines) and so on and its soooo embarasing but i couldnt sit on the toilet, had to stand/squat cause my muscle loss.\n I lived alone, lost all my relationships so no one knows about me and yes, i cant believe i was that sick that i didnt realized how miserable i am.\nAnd the most scary experience was when i felt im dying. Couldnt explain but i felt my last breathe and how my strenght go away.",
          "created_utc": 1735312706.0
        },
        {
          "id": "m451xdz",
          "author": "cyberdoritos",
          "body": "Honestly I'd like to hear your story. It's not curiosity, I'm genuinely worried and I think that it'd be good if you shared it. Of course only if you're comfy enough AND think it is good and non-triggering for you.",
          "created_utc": 1735356432.0
        },
        {
          "id": "m4c8zv0",
          "author": "Same_Dingo_596",
          "body": "I can tell you about it, I'm not triggered ( a lot😂) by the story anymore.\nFor me it started relatively late compared to the average, because I was about 20-21 years old. it didn't come out of nowhere, so I had been exercising too much, doing x cal diets etc. before but they never had much effect.\nAnd then during covid I started to train at home and keep fit, but then I moved back to my university dorm and that's where all hell broke loose.\n In the meantime I wasn't on good terms with my family, my best friend moved out of town etc so I was really lonely.\nWhat's probably different in my case than what I go through on social media is that in the end I couldn't function at all. And i really don't understand how others can walk with x bmi for example. (No shame or something of course!! I just cant accept that i wasnt able to do a lot of things and cant see where i screwed it)\nIn the meantime I did a lot of shit, I mean I drank a lot of alcohol and tried other things. (But in the meantime I did the same at school and had good results) Looking back, it was all very sad. \nThen it got to the point where I had to leave an hour early for the university 20 minutes away, and I was afraid of freezing to death on the street because I couldn't walk up the hill to the dormitory and as i write before i was so slow, faint in public places etc \nThen I had to go home to my parents for something and they decided to call an ambulance. And even though I was 21 years old, I got a court order like that saying that I had to have compulsory psychiatric treatment. And that lasted for 3 months.\nIn my country there is no proper care for people with eating disorders so those months were disastrous. Partly because the first half was spent trying to keep me alive and I had terrible pain and really just wanted it to be over. Shame or not, at 21 I was being changed by nurses barely older than me. The hospital stay was awful, no one came to see me. And because the care was so shit they gave me enough formula to get me to the required weight and discharged me. So mental recovery was 0.\nIt's actually been years since then anyway, I've tried to put it completely behind me but I just can't. \nNow writing this I have ambivalent feelings, because on the one hand I'm glad I survived all this shit, but on the other hand I miss the discipline and the way of thinking I had back then.\n\nEdit: and i had to add that i know proA forums can be harmful but when i did my post when started to realise that something is wrong i got incredible support, they were so worried and so nice to me. \nI was soo delusional and i swear im not that dumb but when it was me i didnt see the signs. Its kinda akward and slightly funny after that i was that naive😂",
          "created_utc": 1735471109.0
        }
      ]
    },
    {
      "id": "m4zp698",
      "author": "Suspicious-Use1056",
      "body": "Ah I see for me it's more of I fee my eyes shutting off  24/7 and I have to keep it open kinda shit and I i start slurring my words and just act drunk even though Im not",
      "created_utc": 1735815030.0,
      "score": 2,
      "context": [
        {
          "id": "m41phps",
          "author": "Solal-King-Raccoon",
          "body": "Very low heart rate and I couldn’t form coherent sentences. I avoided talking because I didn’t manage to string together a sentence that was more complex than « yeah. » or « no »",
          "created_utc": 1735315010.0
        },
        {
          "id": "m4kdn4o",
          "author": "Suspicious-Use1056",
          "body": "Wait.....this is my symptoms but I just thought I was a teen😭😭 dawg im in recovery am I not eating enough still",
          "created_utc": 1735585279.0
        },
        {
          "id": "m4kf2fw",
          "author": "Solal-King-Raccoon",
          "body": "Idk about you but for me it was a direct symptom of being extremely UW. Im usually a chatterbox and when I was literally close to death I just didn’t have the energy to actually think about non ED stuff let alone speak in a normal way",
          "created_utc": 1735585716.0
        }
      ]
    },
    {
      "id": "m48fej4",
      "author": "to_tired_to_clare",
      "body": "?",
      "created_utc": 1735413045.0,
      "score": 1,
      "context": [
        {
          "id": "m41hu6j",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735312414.0
        },
        {
          "id": "m42nhd2",
          "author": "to_tired_to_clare",
          "body": "This happened to me too and resulted in my heart stopping twice",
          "created_utc": 1735325898.0
        },
        {
          "id": "m47loyx",
          "author": "xhazymind",
          "body": "what did they wrote?",
          "created_utc": 1735403355.0
        }
      ]
    }
  ]
}