{
  "id": "1hpb4pz",
  "subreddit": "AnorexiaNervosa",
  "author": "grapesodamilk",
  "created_utc": 1735520910.0,
  "title": "You’d think that you’d save money on food…",
  "selftext": "You’d think that you’d save money on food when you’re restricting because you’d eat less right???\n\nNope 🙃 \n\nI actually spend more, on food that I think I’ll eat then I never do bc it doesn’t fit into my calorie budget. I bought a giant bag of oranges the other week that I haven’t even touched \n\nPlus a dozen expensive supplements and vitamins, ‘diet foods’ that I wouldn’t need if I just ate normal food. Expensive protein shakes that I have maybe once a week. Specialty ‘low calorie’ mayonnaise that I also haven’t touched\n\nI hate this",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1hpb4pz/youd_think_that_youd_save_money_on_food/",
  "score": 146,
  "num_comments": 25,
  "comments": [
    {
      "id": "m4g6cks",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1735520910.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4gg49b",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1735524381.0,
      "score": 41,
      "context": []
    },
    {
      "id": "m4g8dk0",
      "author": "klurble",
      "body": "funnily enough i think i do save money on food, i can avoid grocery shopping for two or three weeks at a time and im a picky eater so i don’t really buy a variety of food when i do, i basically live on beige foods & peas. i understand the food wastage tho bc i also buy a head of broccoli every week that i usually end up having to throw out 😅",
      "created_utc": 1735521631.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m4g797r",
      "author": "kuyariggedalley",
      "body": "🤣🤣 oh my God I feel this pain to my core!",
      "created_utc": 1735521233.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m4gfkxa",
      "author": "milkhaterz",
      "body": "when i first relapsed i went CRAZY!!!!! i actually would buy a whole cart of groceries, throw it out, buy it back the next day, AND KEEP DOING IT????? i eventually threw everything out and started hoarding junk food bc its the only thing i could stomach even though junk food is forbidden for me. yeah i cant really make it make sense and i feel horrible for all the money ive literally thrown in the trash",
      "created_utc": 1735524186.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m4ggtfz",
      "author": "Invisible2ewe",
      "body": "I totally feel you on this.  I do the exact same thing.  I feel so bad throwing out food, but I just can't fathom not going to buy more \"just in case\" I eat like normal people do.  The good side of it though is I rarely ever buy candy.  I have candy going stale in my cupboards because I refuse to eat it, but having it there means I don't have to buy more.  It's stupid, I know.",
      "created_utc": 1735524634.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m4gcpmc",
      "author": "Straight_Economist35",
      "body": "I always find it easier to restrict when I have more food. I waste so much of it because I only really eat carrots",
      "created_utc": 1735523159.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m4ggpx1",
      "author": "alienprincess111",
      "body": "I know, it's so ironic, isn't it!",
      "created_utc": 1735524600.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m4h56iz",
      "author": "justcallmedrzoidberg",
      "body": "I spend so much money on food I won’t eat cause I’m hoarding it…",
      "created_utc": 1735533806.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m4i5q3t",
      "author": "erigby004",
      "body": "I spend so much money on health foods! It’s so expensive I don’t understand 😭",
      "created_utc": 1735554403.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m4gj8uz",
      "author": "AssociationNorth4228",
      "body": "I literally just spent an ungodly amount on a detox that will be shipped to my house and pre-prepared in a few weeks. My wallet feels this to it’s core.",
      "created_utc": 1735525515.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m4gt6w7",
      "author": "HerrRotZwiebel",
      "body": "I'm actually a good cook. I have to put together simple things these days, because if I try anything time consuming, it just ain't gonna happen. In the spirit of this thread, one thing that often happens is that I'll go to the grocery store to buy stuff for dinner, and then my ED brains says f it and I eat one of my safe foods instead.\n\nBTW, protein shakes are shelf stable (at least the ones I buy). For better or for worse, they're one of my safe foods. So I do consume them. Also my protein needs are kind of high, so the shakes do serve a purpose for me. \n\nMayo lasts a long time in the fridge.",
      "created_utc": 1735529190.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m4hqwky",
      "author": "Deepspacechris",
      "body": "Same. I often make a few tiny ciabattas with delicious vegan margarine in the evenings when I almost haven’t eaten anything during the day and I still end up purging a bit after eating because bread scares me. Such a waste. I also have a frozen pizza and a couple of tiny ice cream cups in my freezer and they’ve been there for ages. Can’t really see myself daring to eat them any time soon…",
      "created_utc": 1735544854.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m4hud46",
      "author": "clairethebaby",
      "body": "i feel you, i basically only buy foods with a super long shelf life now 😭 cans of soup, canned vegetables, canned beans, pouches of starkist tuna and chicken, rice, prunes, wayyyy too many protein bars and shakes, oatmeal, and i’ll usually get one bag of apples and one loaf of bread that i can never seem to finish before they go bad lmaooo",
      "created_utc": 1735547016.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m4mgsor",
      "author": "Difficult_Chicken_78",
      "body": "Not you calling out me and my $16 box of protein bars 😭😭",
      "created_utc": 1735609576.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m4hy2jw",
      "author": "yuru2323",
      "body": "Yes vitamins etc cost. Also one time I had to go to the closest ER to check everything when my heart beat so fast bc of anxiety attack due to low blood sugar. I was worried of some heart problem. \n\nWith all the money I spent there at the hospital, I thought of all the beautiful activities I could've joined or meals I could've outside instead.",
      "created_utc": 1735549420.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4n8946",
      "author": "B0red2Death1536",
      "body": "This struck me right to my core. Everytime i got to a supermarket, i find myself cheking EVERYTHING and how many calories it has, to see If it will fit into my calorie budget, but almost everything low kcal (at least where i live) is overpriced. 🥲",
      "created_utc": 1735619658.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4syxr0",
      "author": "Fluttery_Soul",
      "body": "Omg yessss. It's even more of a waste when the food expires and you have to throw it out 🥲\n\n\nBuying expensive low calorie ice cream instead of normal ass ice cream. And expensive yogurts and cheese and hell yeah them protein Bars and omg the amount of coffee and soda I was consuming.",
      "created_utc": 1735705726.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4izud2",
      "author": "Odd_Theme_3294",
      "body": "I despise food waste - but create so much 😭 \nFeel so bad because there’s people who are involuntarily starving - and I’m here doing it intentionally 💀",
      "created_utc": 1735569417.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4k3z74",
      "author": "DueConsequence8605",
      "body": "Yep gotta work around it. I exclusively get my mom to get frozen vegetables now.",
      "created_utc": 1735582337.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4mlxoi",
      "author": "Peanut2ur_Tostito",
      "body": "I'm on the airhead diet",
      "created_utc": 1735611370.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4q573x",
      "author": "Excellent_Gur_9249",
      "body": "OMG I joke about this all the time… Like you’d think having a restrictive eating disorder my food spending would be limited. But NO I always have to have the same ridiculously overpriced safe foods in the home at all times. Or sometimes I’ll buy cookies and pastries while i’m at a cafe because I want them so badly and have a bite and throw the rest out.",
      "created_utc": 1735668230.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4gk7xg",
      "author": "tpwkluvr",
      "body": "exactly this i’m blowing all my money buying single serve protein stuff 😭",
      "created_utc": 1735525868.0,
      "score": 11,
      "context": [
        {
          "id": "m4gg49b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735524381.0
        }
      ]
    },
    {
      "id": "m5c9rut",
      "author": "grapesodamilk",
      "body": "Oh god, I just had my first hypoglycaemic attack 2 days ago, I’m glad I’m not alone. I’m sorry that happened to you, it’s so scary isn’t it??\n\nI find some relief in the fact that I know it’s temporary rather than meaning I have lifelong diabetes or something but then scared of the fact that I actually physically cannot starve myself any further. \n\nTo top it all off I just ordered $60 worth of different flavoured teas online to curb my cravings rather than doing something sensible like buying some protein and nutrient rich groceries that could feed me for a couple weeks :’)",
      "created_utc": 1735990919.0,
      "score": 2,
      "context": [
        {
          "id": "m4hy2jw",
          "author": "yuru2323",
          "body": "Yes vitamins etc cost. Also one time I had to go to the closest ER to check everything when my heart beat so fast bc of anxiety attack due to low blood sugar. I was worried of some heart problem. \n\nWith all the money I spent there at the hospital, I thought of all the beautiful activities I could've joined or meals I could've outside instead.",
          "created_utc": 1735549420.0
        }
      ]
    },
    {
      "id": "m4k4394",
      "author": "DueConsequence8605",
      "body": "The marketing on single serve protein things like Quest has me in an absolute chokehold",
      "created_utc": 1735582371.0,
      "score": 5,
      "context": [
        {
          "id": "m4gg49b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735524381.0
        },
        {
          "id": "m4gk7xg",
          "author": "tpwkluvr",
          "body": "exactly this i’m blowing all my money buying single serve protein stuff 😭",
          "created_utc": 1735525868.0
        }
      ]
    },
    {
      "id": "m61g0zk",
      "author": "yuru2323",
      "body": "Hey sorry I haven't been able to respond for a few days. \n\nBe careful, I know we are not supposed to give any health advice here but I'm just telling you what my friend went through: my very close friend almost got pre-diabetic because of starving herself so much. So it might be temporary right now and I'm glad you're doing okay but just please please be careful and take care of yourself in the best way possible ❤❤ you don't need to get worse first to get better ❤ you already deserve getting better ❤ enjoy your teas and maybe you could enjoy a meal alongside them, or some snacks you feel comfortable eating?? ☺ maybe let's have them both you know, I believe we deserve doing so! \n\nI've been eating for two weeks now I'm getting anxiety after I eat like my heart beat goes upbeat instantly. It's so hard to deal with. I have the cold after it's healed, I think I'll go back to dieting but I'll try to be careful like I will try to be gentle with myself and not harm myself in the process (I'll try my hardest to not starve). I hope I'll make it. I gained some amounts as a result of going back to eating after crazy restrictions. I know I was gonna gain some of the lost weight but I don't want to gain more weight 💔 let's see how it goes...",
      "created_utc": 1736339843.0,
      "score": 1,
      "context": [
        {
          "id": "m4hy2jw",
          "author": "yuru2323",
          "body": "Yes vitamins etc cost. Also one time I had to go to the closest ER to check everything when my heart beat so fast bc of anxiety attack due to low blood sugar. I was worried of some heart problem. \n\nWith all the money I spent there at the hospital, I thought of all the beautiful activities I could've joined or meals I could've outside instead.",
          "created_utc": 1735549420.0
        },
        {
          "id": "m5c9rut",
          "author": "grapesodamilk",
          "body": "Oh god, I just had my first hypoglycaemic attack 2 days ago, I’m glad I’m not alone. I’m sorry that happened to you, it’s so scary isn’t it??\n\nI find some relief in the fact that I know it’s temporary rather than meaning I have lifelong diabetes or something but then scared of the fact that I actually physically cannot starve myself any further. \n\nTo top it all off I just ordered $60 worth of different flavoured teas online to curb my cravings rather than doing something sensible like buying some protein and nutrient rich groceries that could feed me for a couple weeks :’)",
          "created_utc": 1735990919.0
        }
      ]
    }
  ]
}