{
  "id": "1hruwt1",
  "subreddit": "AnorexiaNervosa",
  "author": "Substantial-Base-698",
  "created_utc": 1735828148.0,
  "title": "Is it wrong to feel proud/happy that people are saying I look like I’m starving?",
  "selftext": "I honestly don’t know where I stand in the weight standards, because when I don’t suck in my stomach it’s obviously not the thinnest and my legs are decently chubby, but my ribs are incredibly visible for some reason. I made a post while sucking in my stomach asking if I looked overweight, underweight or normal weight and basically everyone said I looked severely underweight and needed help, and some people even skinnyshamed me. Is it weird that this makes me feel good about myself? Am I a bad person?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1hruwt1/is_it_wrong_to_feel_proudhappy_that_people_are/",
  "score": 130,
  "num_comments": 15,
  "comments": [
    {
      "id": "m50g4g9",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1735828149.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m50hlxq",
      "author": "wardog56",
      "body": "I’ve struggled with the same question. No I don’t think it’s “healthy” but I want you to know someone understands. Hope this helps in some way",
      "created_utc": 1735828703.0,
      "score": 23,
      "context": []
    },
    {
      "id": "m50ov1l",
      "author": "to_tired_to_clare",
      "body": "It isn't a normal way of thinking but I get it I feel this way to",
      "created_utc": 1735831249.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m50n0p9",
      "author": "Aggravating_Lake7850",
      "body": "You are absolutely not a bad person. I have the exact same thoughts and by the sounds of it I have the exact same body as you. i always feel good when someone says how skinny I look and that my ribs are showing",
      "created_utc": 1735830623.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m52neni",
      "author": "None",
      "body": "That's a hallmark of the disorder. I love it when people tell me I'm too skinny and need to put on weight. I was excited one time when a coworker said I was looking like a \"walking corpse.\" The opposite is also true. When I tell someone I struggle with anorexia and they respond by telling me I don't look anorexic. That's extremely triggering and makes me feel like a fake. \n\nI feel like a yo-yo that's very influenced by people's perceptions of how thin I look. It's pretty fucked up. Because there is no such thing as \"thin enough\" or \"sick enough\" for many of us, our perceptions are very warped. Most people don't want to look emaciated or sick. To them, that's not a good thing. To an anorexic, this is a compliment that could put us on cloud 9 for the rest of the day.\n\nOur brains are rewired and don't operate like most people... Remember, our brains are impacted by this. It's a mental illness after all. Also, the majority of the population is grossly uneducated about the serious condition of AN. It's a topic that doesn't receive the exposure and attention it deserves. Wishing you the best OP \\*hugs\\*",
      "created_utc": 1735852949.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m53opi5",
      "author": "knotnotme83",
      "body": "You are not a bad person. \n\nIt is weird. It is unhealthy. It is disordered.",
      "created_utc": 1735864449.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m52wqgn",
      "author": "Brave-Bus-4744",
      "body": "You’re not a bad person, but you should not feel proud for having those thoughts. They’re dangerous thoughts. While most of us understand in this sub, I gotta be honest how detrimental this kind of thinking is. We have to do better for ourselves and heal ❤️",
      "created_utc": 1735855711.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m50nllc",
      "author": "erigby004",
      "body": "No I believe it’s Normal",
      "created_utc": 1735830818.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m521kgq",
      "author": "turnipkitty112",
      "body": "It’s not a healthy or normal way to think, but it certainly doesn’t make you a bad or wrong person in any way. You have a mental illness that is distorting your thoughts. A lot of us with EDs feel the same way.",
      "created_utc": 1735846470.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m52dykq",
      "author": "unitedthursday",
      "body": "it's not a healthy thing to think that but it's common among people with eating disorders I would say. I definitely know I feel a ton of gratification when someone says that to me. You're a good person",
      "created_utc": 1735850157.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m52ebit",
      "author": "Party_Book_2370",
      "body": "It's not “wrong” per se but it's the disorder making you feel that way",
      "created_utc": 1735850265.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m52m2y4",
      "author": "Peanut2ur_Tostito",
      "body": "I love that compliment as well.",
      "created_utc": 1735852569.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m53443d",
      "author": "Lady-Jaguar",
      "body": "It's not wrong, part of the ED is the desire to look extremely thin. Some people say the same to me, trying to m ake me feel sad, but I actually love  to hear that!",
      "created_utc": 1735857951.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m54x421",
      "author": "soda-pops",
      "body": "It's not healthy but it doesn't mean you're a bad person. It just means youre struggling.",
      "created_utc": 1735880665.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m55fvlg",
      "author": "Shuyuya",
      "body": "It’s weird for a healthy person but not for someone with an ED. And you’re not a bad person, someone else said it in the comments but it’s particular for anorexia nervosa, it’s almost like it gets us off. \n\nAlso it’s a normal compliment in South Korea but again, they are too much on how skinny you should be there.",
      "created_utc": 1735890383.0,
      "score": 2,
      "context": []
    }
  ]
}