{
  "id": "1htsopm",
  "subreddit": "AnorexiaNervosa",
  "author": "marta_zcv",
  "created_utc": 1736036351.0,
  "title": "childlike body",
  "selftext": "reading posts ive noticed that a lot of females here want to achieve the thin but curvy womanly figure, bigger breasts and hips but a tiny flat waist, and that thats how the illness started. im here having the opposite ideal of wanting to keep my body looking childlike although i dont really consider myself anorexic, rather a high funcioning one as some people say (keeping the same underweight weight for years). i think it started because i was experiencing neglect thruought my whole childhood and now i want to feel small again. my body didnt even fully develop and when i noticed for the first time all of the girls my age looking different, having breasts and hips i felt insecure. now i have a different view because i found out what truly makes me happy. my feelings are also related to some sexual complexes i have, and i have no idea whats the root of them. ii would like for you guys to share ur experiences and to find out if this is a common thing or not",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1htsopm/childlike_body/",
  "score": 191,
  "num_comments": 42,
  "comments": [
    {
      "id": "m5fuuj6",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1736036352.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5g29eo",
      "author": "peachlavenderr",
      "body": "i was sexualized constantly and abused (verbally) when i was 12, ever since ive hated my curves. i want to be flat chested, i hate that i have wider hips and thighs. i was a chubby kid and went through puberty early so ive never really had a \"childlike body\" except for when i was very very young. the constant sexualization made me feel like my body is something to be ashamed of, and now the main motivation behind my ED is just to take up less space and have less body",
      "created_utc": 1736038832.0,
      "score": 84,
      "context": []
    },
    {
      "id": "m5fxxyz",
      "author": "Worried_Brilliant939",
      "body": "As someone who, as an 8 year old was morbidly obese and pre diabetic, then sexualized and SA’d at the same age, and menstruating by 10….yeah….my anorexia was always about reclaiming my childhood and getting to experience having a childlike body. I achieved it and even weight restored now get mistaken for a middle or high schooler. I’m 30 (yikes). \n\nWhat a mindfuck, honestly.",
      "created_utc": 1736037388.0,
      "score": 102,
      "context": []
    },
    {
      "id": "m5fwxq7",
      "author": "dippyhippy_",
      "body": "It was a common feeling for me but hell anorexia made me flat and saggy as a pancake. Didn't give me the 'cute' petite body i wanted. Made me look like a young child. It's admittedly the one thing now that I'm in a relationship that makes recovery so much harder. I'm scared of being unattractive by having no body parts if you get me.\n\nMy body shape has been ruined by yo yo ing up and down the scale. Sometimes I miss being flat and childlike, like yourself I have experienced a lot of sexual complexities that distorted the way I see myself.\n\nKind of hate that I couldn't have both 'nice' bodily features whilst being underweight. Just made me hate myself more.",
      "created_utc": 1736037055.0,
      "score": 28,
      "context": []
    },
    {
      "id": "m5g9b8w",
      "author": "forvirraforverra",
      "body": "i am very tall for a woman (almost 180cm), and have always been the tallest in my friend group. it has made me feel extremely uncomfortable throughout the years, especially when i was a shy and awkward adolescent who grew too fast and who wanted nothing more than to disappear but whose gangly body stood out like a sore thumb. \n\ncombined with childhood trauma, parental neglect, self-hatred, perfectionism, and being the oldest sibling who was expected to be responsible and to take care of everyone and everything (both in regards to my younger sibling and in my friend group) made me long to be small, girly and dainty – everything i was not. i wanted to feel protected and safe, and a subconscious part of me concluded that i could never achieve that with my height. i just wanted someone to care for me, or to let me rest for a moment, or to just see me for who i truly was, and i got obsessed with the idea of being small physically, to match how i felt inside. i can never be a cute, short, petite girl. but i CAN be fragile, and thus seen as worthy of protection. \n\nof course, it's a lot more complicated than that. my ed developed as a result of many things, plus genetic predisposition, but my hatred of my body + being uncomfortable with my height + wanting to be small and young and innocent and safe are definitely some of the root causes.\n\nanother factor worth mentioning is, as always, society's judgement of bodies. i was born underweight and have always been underweight, and my whole life i've gotten a lot of comments on my body, both positive and negative. it's made it hard to gauge how i'm actually perceived. in gym class i'd get comments on how i wasn't just skinny, i was the skinniest. at home, my body was the butt of all jokes. i was reduced to my body, and so it became my thing. being thin was something i excelled at naturally, and, meaningless as it was, i began tying my self-worth to my physique. then my perfectionism and need to self-harm kicked in fully, and it was all downhill from there.\n\nconstant malnourishment meant i never really developed a sex drive, and so i stayed childlike while everyone around me grew up. now i'm an adult who has never been in a romantic relationship. i've never shared a bed with a partner. i haven't kissed anyone drunkenly in a decade. i haven't even dated anyone properly. no one has ever loved me non-platonically. i'm hard to look at too. i don't look like a child. again, too tall. i look like a goddamn alien.\n\nthat's the price you pay for chasing a safer childhood, i guess. but you'll never find innocence or protection in a childlike body, just brittle bones, thinning hair, misery, and a wasted life filled with missed opportunities.",
      "created_utc": 1736041250.0,
      "score": 28,
      "context": []
    },
    {
      "id": "m5gddud",
      "author": "hxrrorwitch",
      "body": "Yes, a big part for me was achieving a childlike body that I felt I never got to have, especially being AFAB and developing early (and being sexualised and SA'd young). \n\n\nAlso, for me, it's been a lot of complicated shit around gender - I'm nonbinary and achieving this kind of ambiguous body has always been a goal. \n\n\nThen there's a whole bit about taking up as little space as possible. Does anyone else relate to that? I'd be interested to know and hear your experiences. For me there's definitely something in there about becoming invisible, or taking up the least amount of space possible as I was brought up very much, \"children should be invisible and not interrupt the adults' lives\", and there's a lot of trauma around that I'm still unpacking with therapists well into my mid-late 30s.",
      "created_utc": 1736042685.0,
      "score": 18,
      "context": []
    },
    {
      "id": "m5gslut",
      "author": "AdZealousideal6804",
      "body": "Part of my eating disorder stems from the desire to have a flat chest because I feel disgusting having breasts",
      "created_utc": 1736048121.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m5h8bzt",
      "author": "ChanceInternal2",
      "body": "Yeah mine was all about being flat chested, having no hips, no butt, major thigh gap, no curves at all. Turns out most of the features that I hated and were trying to make disappear are the exact same features people with gender dysphoria are dysphoric about.",
      "created_utc": 1736054572.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m5i75ge",
      "author": "yyizzyz",
      "body": "this is normal!! (obviously not NORMAL but from an ed viewpoint) quite a lot of ppl developed their ed to feel more childlike due to sexual trauma/childhood neglect/abuse. but it also could be your ed developing more, a lot of ppl start off wanting the slim but curvy, “desirable” female body but as they fall deeper into their ed they just want to be smaller and smaller",
      "created_utc": 1736074850.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m5h3imm",
      "author": "bexxby",
      "body": "I’m asexual and being objectified and sexualized is one of the grossest things to me. Never liked having breasts or curves. Having a childlike body brings me comfort of not feeling overly sexualized when I wear tank tops or tight fitting clothes.",
      "created_utc": 1736052428.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m5i6ux5",
      "author": "UrMomGei666",
      "body": "I get it. I was very bullied in my childhood for being obese, I developed early so other children would make fun of my boobs too. There's nothing I've ever wanted more than to be completely flat, almost non existant. I may be thin now, but I still have boobs which makes me all the more insecure.",
      "created_utc": 1736074675.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m5ijmzv",
      "author": "Not_Ok_Yet",
      "body": "This is why I have a childlike body:\n\nI, too, was sexually abused as a child. (I never told, kept it a secret.) Then grew up in a pious religious home where I was taught that sex before marriage was a sin. As children do, I internalized the transgression. So I grew up thinking I was dirty and going to hell.\n\nSomehow this was blocked from my frontal mind for years… but this is what shaped my life.\n\nI do remember as a teen, being very subconscious of my curviness. The hourglass figure, big boobs, and what I thought was too big hips. So I stayed overweight. (So no one would look at me? This was not a conscious thing.)\n\nThen, in my twenties, and more weight conscious, I was still too curvy for my taste, but still getting positive comments about my body from older men. Eww, I thought, but I still went out with a few. Nobody else was asking. \n\nThus, the body image tables turned. Being fat was no longer acceptable, skinny was what you were supposed to be.\n\nThat’s how restricting started. Yada, yada. Full-on AN came on very late in life, but is something else to explore.\n\nED has been with me since I first understood what body image was, all those years ago. Since Twiggy first appeared and the world decided bone-skinny was how women were supposed to look in order to be pretty.\n\nI like how I look now. I still have boobs, but not as big. I have a bunch of bones I can feel. And my short legs look long!!!!!",
      "created_utc": 1736081800.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m5gx1js",
      "author": "None",
      "body": "my ed stems from having curves. i have a thinner roscoe and wider hips. “childbearing hips” as i’ve been told. i’ve also had a gyat. which usually women would want i guess? but people have been telling me i’ve had a big butt since childhood, and i just hate it. wearing anything tight on my butt makes me feel like a whore and i just want to be completely flat.",
      "created_utc": 1736049799.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m5h8e2n",
      "author": "lousepoints",
      "body": "i understand this. i was always bigger as a child and bullied for how i looked. a part of me feels i need to rid of the features i feel tie myself to that childhood body i hated so much. it’s also tied into the relation that smaller = better. i’m not sure why i make that association in my mind but i’m sure it’s common amongst other women.",
      "created_utc": 1736054598.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5v6mgp",
      "author": "Rare_Time_7725",
      "body": "I was SA'd and neglected as a child. I had to raise myself and my siblings. I ended up being abused and SA'd most of my adult life. I am now 40. I don't know a life without some kind of abuse, and I think this is my way of making myself feel as small as these people made me and to keep a form of abuse going... because I don't know what life would be like without it... sometimes I think i wanna be small enough so I feel invisible and unseen..",
      "created_utc": 1736255293.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5fxexz",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1736037212.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5hzjsf",
      "author": "adumbledorablee",
      "body": "I’ve been sexualised all. the. time. due to my body type (that most would probably deem ideal bc it is peak hourglass) and it has left me feeling absolutely worthless and only good as an accessory like a shiny new toy that gets presented and then, when everyone has seen it, gets thrown in a corner or away. I am so much more than my body so I am trying my hardest to look as flat, thin, sickly as possible so people would finally treat me like a human being. But it’s impossible with my genetics.",
      "created_utc": 1736070188.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5j1zuc",
      "author": "None",
      "body": "yes it's common, its actually a BIG part of ed/diet culture. women are shamed for, you know, being women and having womanly bodies (especially cellulite being demonized... even though it's just a part of being a woman, and not a child, I digress) which is why thinness is so desirable. \n\nit's also why men aren't into anorexic women. because they don't look like women.",
      "created_utc": 1736089346.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5kdtik",
      "author": "awwawwwwA",
      "body": "tw: all of the times ive been sexualized have been traumatic or non consensual which makes having a body & being noticed so emotionally taxing for me. it doesn’t help that i feel like if i had the body type ( child / pre puberty ) again that i could put the pieces back together again & be “pure” again. a do over. a chance to be protected. a chanced to be noticed but the right way this time. the entirety of my ed is a way to say “hi ! baby me is really hurting and doesn’t know how to show it, all she knows is she’s hurting, can you see it too ?”",
      "created_utc": 1736103857.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5khj2f",
      "author": "Professional-Plum822",
      "body": "I feel the same about wanting to feel small again. I didnt realise that about myself until acknowledging me ed and learning about it. Years of neglect from your family home can make you hyper independent from a young age which is why for me i want someone to give me back the lost youth by being percieved as small, cute and tiny. But unfortunately this is not realistic at all",
      "created_utc": 1736104896.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6ji7oa",
      "author": "Noiredante",
      "body": "I'm a man, but i do relate to this heavily. I had a pretty traumatic childhood and had to grow up quickly, causing me to turn to food and eat a lot and become obese at a young age, but also not get to live out my childhood as much as a \"normal\" kid would get to. I find myself wishing i were smaller like a child; fragile and delicate like one, and almost wanting to be taken care of like one. I feel disgusting for it, but i sometimes look at my niece or nephew and wish i were as tiny as them; not in a sexual way, but in a \"i wish i were that tiny, weight wise and just overall physically\" wise.",
      "created_utc": 1736578143.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m7bmlno",
      "author": "Xochi222queztal",
      "body": "as a kid I developed really fast and was a bit overweight, I’ve always felt like a monster compared to my peers since I was also tall for my age. I feel like that helps fuel my desire for the same thing. A flat thin body",
      "created_utc": 1736969365.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5jytp4",
      "author": "nervous_veggie",
      "body": "I developed an eating disorder when I was about 6, I’ve never known a healthy adult body tbh and I really do think that the fear of what that might look like is a massive factor in keeping me sick",
      "created_utc": 1736099699.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5lavis",
      "author": "ashtetice",
      "body": "I was like this and now im pretty sure im trans",
      "created_utc": 1736113312.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mipcrvp",
      "author": "Soft_Month7215",
      "body": "Hi I’m late. For me it wasn’t about achieving the “childlike” body. I always felt like I already had a childlike body and when I lost weight from a chronic illness that lead me to developing and Ed, my already very small chest got smaller but that didn’t matter to me because “at least I was skinny” and that led me down a very dark rabbit hole. So it wasn’t about achieving a “childlike” body it was me justifying it I guess.",
      "created_utc": 1742425401.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5g6uw7",
      "author": "Rhyme_orange_",
      "body": "I’m so sorry. I feel you.",
      "created_utc": 1736040408.0,
      "score": 18,
      "context": [
        {
          "id": "m5g29eo",
          "author": "peachlavenderr",
          "body": "i was sexualized constantly and abused (verbally) when i was 12, ever since ive hated my curves. i want to be flat chested, i hate that i have wider hips and thighs. i was a chubby kid and went through puberty early so ive never really had a \"childlike body\" except for when i was very very young. the constant sexualization made me feel like my body is something to be ashamed of, and now the main motivation behind my ED is just to take up less space and have less body",
          "created_utc": 1736038832.0
        }
      ]
    },
    {
      "id": "m5gdtuu",
      "author": "hxrrorwitch",
      "body": "I'm sorry you experienced that, and I'm sorry I can relate.",
      "created_utc": 1736042843.0,
      "score": 12,
      "context": [
        {
          "id": "m5g29eo",
          "author": "peachlavenderr",
          "body": "i was sexualized constantly and abused (verbally) when i was 12, ever since ive hated my curves. i want to be flat chested, i hate that i have wider hips and thighs. i was a chubby kid and went through puberty early so ive never really had a \"childlike body\" except for when i was very very young. the constant sexualization made me feel like my body is something to be ashamed of, and now the main motivation behind my ED is just to take up less space and have less body",
          "created_utc": 1736038832.0
        }
      ]
    },
    {
      "id": "m5kk7ct",
      "author": "NoResource9942",
      "body": "I very much understand. I’m pretty similar. I’m in recovery now…did inpatient treatment 6 years ago, which saved my life. Now I try to be fit and strong and not become obsessed with food and working out. It’s still a mental challenge most days.",
      "created_utc": 1736105661.0,
      "score": 2,
      "context": [
        {
          "id": "m5g29eo",
          "author": "peachlavenderr",
          "body": "i was sexualized constantly and abused (verbally) when i was 12, ever since ive hated my curves. i want to be flat chested, i hate that i have wider hips and thighs. i was a chubby kid and went through puberty early so ive never really had a \"childlike body\" except for when i was very very young. the constant sexualization made me feel like my body is something to be ashamed of, and now the main motivation behind my ED is just to take up less space and have less body",
          "created_utc": 1736038832.0
        }
      ]
    },
    {
      "id": "m5gcg3t",
      "author": "hxrrorwitch",
      "body": "Oooft, I'm so sorry for your experience. I can relate.",
      "created_utc": 1736042352.0,
      "score": 10,
      "context": [
        {
          "id": "m5fxxyz",
          "author": "Worried_Brilliant939",
          "body": "As someone who, as an 8 year old was morbidly obese and pre diabetic, then sexualized and SA’d at the same age, and menstruating by 10….yeah….my anorexia was always about reclaiming my childhood and getting to experience having a childlike body. I achieved it and even weight restored now get mistaken for a middle or high schooler. I’m 30 (yikes). \n\nWhat a mindfuck, honestly.",
          "created_utc": 1736037388.0
        }
      ]
    },
    {
      "id": "m5ht6z0",
      "author": "soda-pops",
      "body": "dyou think other methods of acting childlike would be helpful for you? like wearing onsies and cuddling with plushies? just a genuine idea :3",
      "created_utc": 1736066151.0,
      "score": 2,
      "context": [
        {
          "id": "m5fxxyz",
          "author": "Worried_Brilliant939",
          "body": "As someone who, as an 8 year old was morbidly obese and pre diabetic, then sexualized and SA’d at the same age, and menstruating by 10….yeah….my anorexia was always about reclaiming my childhood and getting to experience having a childlike body. I achieved it and even weight restored now get mistaken for a middle or high schooler. I’m 30 (yikes). \n\nWhat a mindfuck, honestly.",
          "created_utc": 1736037388.0
        }
      ]
    },
    {
      "id": "m5luh15",
      "author": "marta_zcv",
      "body": "wow you just put into words the unconcious feeling ive been experiencing in that last part. i love darker colored clothes to not draw too much attention, i never try to approach someone and make the first move, also i love corners lol, honestly i sometimes feel like a cat that communicates completely different than humans",
      "created_utc": 1736119334.0,
      "score": 3,
      "context": [
        {
          "id": "m5gddud",
          "author": "hxrrorwitch",
          "body": "Yes, a big part for me was achieving a childlike body that I felt I never got to have, especially being AFAB and developing early (and being sexualised and SA'd young). \n\n\nAlso, for me, it's been a lot of complicated shit around gender - I'm nonbinary and achieving this kind of ambiguous body has always been a goal. \n\n\nThen there's a whole bit about taking up as little space as possible. Does anyone else relate to that? I'd be interested to know and hear your experiences. For me there's definitely something in there about becoming invisible, or taking up the least amount of space possible as I was brought up very much, \"children should be invisible and not interrupt the adults' lives\", and there's a lot of trauma around that I'm still unpacking with therapists well into my mid-late 30s.",
          "created_utc": 1736042685.0
        }
      ]
    },
    {
      "id": "m5l18wb",
      "author": "Pure_Freedom_4466",
      "body": "what why did you wanna look like that?",
      "created_utc": 1736110578.0,
      "score": 0,
      "context": [
        {
          "id": "m5h8bzt",
          "author": "ChanceInternal2",
          "body": "Yeah mine was all about being flat chested, having no hips, no butt, major thigh gap, no curves at all. Turns out most of the features that I hated and were trying to make disappear are the exact same features people with gender dysphoria are dysphoric about.",
          "created_utc": 1736054572.0
        }
      ]
    },
    {
      "id": "m5lulk3",
      "author": "marta_zcv",
      "body": "oof",
      "created_utc": 1736119376.0,
      "score": 1,
      "context": [
        {
          "id": "m5i75ge",
          "author": "yyizzyz",
          "body": "this is normal!! (obviously not NORMAL but from an ed viewpoint) quite a lot of ppl developed their ed to feel more childlike due to sexual trauma/childhood neglect/abuse. but it also could be your ed developing more, a lot of ppl start off wanting the slim but curvy, “desirable” female body but as they fall deeper into their ed they just want to be smaller and smaller",
          "created_utc": 1736074850.0
        }
      ]
    },
    {
      "id": "m5lupas",
      "author": "marta_zcv",
      "body": "i also consider myself asexual :)",
      "created_utc": 1736119411.0,
      "score": 1,
      "context": [
        {
          "id": "m5h3imm",
          "author": "bexxby",
          "body": "I’m asexual and being objectified and sexualized is one of the grossest things to me. Never liked having breasts or curves. Having a childlike body brings me comfort of not feeling overly sexualized when I wear tank tops or tight fitting clothes.",
          "created_utc": 1736052428.0
        }
      ]
    },
    {
      "id": "m5g6b5f",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1736040220.0,
      "score": 2,
      "context": [
        {
          "id": "m5fxexz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736037212.0
        }
      ]
    },
    {
      "id": "m5l5pzg",
      "author": "AdSensitive4781",
      "body": ">\nit's also why men aren't into anorexic women. because they don't look like women\nI'd like to say this is true but there's a lot of weird men out there that like it, it's almost because you're more vulnerable and seen as being fragile they get a kick out of it. Makes you feel sick really.",
      "created_utc": 1736111825.0,
      "score": 1,
      "context": [
        {
          "id": "m5j1zuc",
          "author": "None",
          "body": "yes it's common, its actually a BIG part of ed/diet culture. women are shamed for, you know, being women and having womanly bodies (especially cellulite being demonized... even though it's just a part of being a woman, and not a child, I digress) which is why thinness is so desirable. \n\nit's also why men aren't into anorexic women. because they don't look like women.",
          "created_utc": 1736089346.0
        }
      ]
    },
    {
      "id": "m5iq6w7",
      "author": "Worried_Brilliant939",
      "body": "I kind of do that but in a cutesy “I’m 30 but can act like I’m an early 20 something who likes cute culture” kind of way. I regress constantly with my partner and have a kid-voice and persona, but it’s not adaptive at this point. It’s just a fractured part of me. When I lean into deliberate regression, like what you describe, honestly it feels a little…creepy? I don’t know why. Technically that’s healthy. Maybe some unresolved issues leftover from when I was in my 20s and playing Lolita to a bunch of older men. Sheesh",
      "created_utc": 1736084707.0,
      "score": 5,
      "context": [
        {
          "id": "m5fxxyz",
          "author": "Worried_Brilliant939",
          "body": "As someone who, as an 8 year old was morbidly obese and pre diabetic, then sexualized and SA’d at the same age, and menstruating by 10….yeah….my anorexia was always about reclaiming my childhood and getting to experience having a childlike body. I achieved it and even weight restored now get mistaken for a middle or high schooler. I’m 30 (yikes). \n\nWhat a mindfuck, honestly.",
          "created_utc": 1736037388.0
        },
        {
          "id": "m5ht6z0",
          "author": "soda-pops",
          "body": "dyou think other methods of acting childlike would be helpful for you? like wearing onsies and cuddling with plushies? just a genuine idea :3",
          "created_utc": 1736066151.0
        }
      ]
    },
    {
      "id": "m5mcemb",
      "author": "hxrrorwitch",
      "body": "This is definitely me too! Except I'm covered in tattoos (sticking stickers on myself to try and love my body) so my team always challenge me on the \"trying to disappear\" angle, but it's definitely there. I'm told I have black cat energy. I guess the takeaway is that, you're not alone, internet friend.",
      "created_utc": 1736125222.0,
      "score": 1,
      "context": [
        {
          "id": "m5gddud",
          "author": "hxrrorwitch",
          "body": "Yes, a big part for me was achieving a childlike body that I felt I never got to have, especially being AFAB and developing early (and being sexualised and SA'd young). \n\n\nAlso, for me, it's been a lot of complicated shit around gender - I'm nonbinary and achieving this kind of ambiguous body has always been a goal. \n\n\nThen there's a whole bit about taking up as little space as possible. Does anyone else relate to that? I'd be interested to know and hear your experiences. For me there's definitely something in there about becoming invisible, or taking up the least amount of space possible as I was brought up very much, \"children should be invisible and not interrupt the adults' lives\", and there's a lot of trauma around that I'm still unpacking with therapists well into my mid-late 30s.",
          "created_utc": 1736042685.0
        },
        {
          "id": "m5luh15",
          "author": "marta_zcv",
          "body": "wow you just put into words the unconcious feeling ive been experiencing in that last part. i love darker colored clothes to not draw too much attention, i never try to approach someone and make the first move, also i love corners lol, honestly i sometimes feel like a cat that communicates completely different than humans",
          "created_utc": 1736119334.0
        }
      ]
    },
    {
      "id": "m5nb43z",
      "author": "None",
      "body": "yes, this is true too!",
      "created_utc": 1736137060.0,
      "score": 1,
      "context": [
        {
          "id": "m5j1zuc",
          "author": "None",
          "body": "yes it's common, its actually a BIG part of ed/diet culture. women are shamed for, you know, being women and having womanly bodies (especially cellulite being demonized... even though it's just a part of being a woman, and not a child, I digress) which is why thinness is so desirable. \n\nit's also why men aren't into anorexic women. because they don't look like women.",
          "created_utc": 1736089346.0
        },
        {
          "id": "m5l5pzg",
          "author": "AdSensitive4781",
          "body": ">\nit's also why men aren't into anorexic women. because they don't look like women\nI'd like to say this is true but there's a lot of weird men out there that like it, it's almost because you're more vulnerable and seen as being fragile they get a kick out of it. Makes you feel sick really.",
          "created_utc": 1736111825.0
        }
      ]
    },
    {
      "id": "m5l2iaf",
      "author": "soda-pops",
      "body": "I can understand the creepy thing! Good luck on healing man, its rough.",
      "created_utc": 1736110936.0,
      "score": 2,
      "context": [
        {
          "id": "m5fxxyz",
          "author": "Worried_Brilliant939",
          "body": "As someone who, as an 8 year old was morbidly obese and pre diabetic, then sexualized and SA’d at the same age, and menstruating by 10….yeah….my anorexia was always about reclaiming my childhood and getting to experience having a childlike body. I achieved it and even weight restored now get mistaken for a middle or high schooler. I’m 30 (yikes). \n\nWhat a mindfuck, honestly.",
          "created_utc": 1736037388.0
        },
        {
          "id": "m5ht6z0",
          "author": "soda-pops",
          "body": "dyou think other methods of acting childlike would be helpful for you? like wearing onsies and cuddling with plushies? just a genuine idea :3",
          "created_utc": 1736066151.0
        },
        {
          "id": "m5iq6w7",
          "author": "Worried_Brilliant939",
          "body": "I kind of do that but in a cutesy “I’m 30 but can act like I’m an early 20 something who likes cute culture” kind of way. I regress constantly with my partner and have a kid-voice and persona, but it’s not adaptive at this point. It’s just a fractured part of me. When I lean into deliberate regression, like what you describe, honestly it feels a little…creepy? I don’t know why. Technically that’s healthy. Maybe some unresolved issues leftover from when I was in my 20s and playing Lolita to a bunch of older men. Sheesh",
          "created_utc": 1736084707.0
        }
      ]
    },
    {
      "id": "m5p1i3k",
      "author": "marta_zcv",
      "body": ":)",
      "created_utc": 1736171085.0,
      "score": 2,
      "context": [
        {
          "id": "m5gddud",
          "author": "hxrrorwitch",
          "body": "Yes, a big part for me was achieving a childlike body that I felt I never got to have, especially being AFAB and developing early (and being sexualised and SA'd young). \n\n\nAlso, for me, it's been a lot of complicated shit around gender - I'm nonbinary and achieving this kind of ambiguous body has always been a goal. \n\n\nThen there's a whole bit about taking up as little space as possible. Does anyone else relate to that? I'd be interested to know and hear your experiences. For me there's definitely something in there about becoming invisible, or taking up the least amount of space possible as I was brought up very much, \"children should be invisible and not interrupt the adults' lives\", and there's a lot of trauma around that I'm still unpacking with therapists well into my mid-late 30s.",
          "created_utc": 1736042685.0
        },
        {
          "id": "m5luh15",
          "author": "marta_zcv",
          "body": "wow you just put into words the unconcious feeling ive been experiencing in that last part. i love darker colored clothes to not draw too much attention, i never try to approach someone and make the first move, also i love corners lol, honestly i sometimes feel like a cat that communicates completely different than humans",
          "created_utc": 1736119334.0
        },
        {
          "id": "m5mcemb",
          "author": "hxrrorwitch",
          "body": "This is definitely me too! Except I'm covered in tattoos (sticking stickers on myself to try and love my body) so my team always challenge me on the \"trying to disappear\" angle, but it's definitely there. I'm told I have black cat energy. I guess the takeaway is that, you're not alone, internet friend.",
          "created_utc": 1736125222.0
        }
      ]
    },
    {
      "id": "m5mf6kr",
      "author": "Worried_Brilliant939",
      "body": "You too. Thank you!",
      "created_utc": 1736126160.0,
      "score": 2,
      "context": [
        {
          "id": "m5fxxyz",
          "author": "Worried_Brilliant939",
          "body": "As someone who, as an 8 year old was morbidly obese and pre diabetic, then sexualized and SA’d at the same age, and menstruating by 10….yeah….my anorexia was always about reclaiming my childhood and getting to experience having a childlike body. I achieved it and even weight restored now get mistaken for a middle or high schooler. I’m 30 (yikes). \n\nWhat a mindfuck, honestly.",
          "created_utc": 1736037388.0
        },
        {
          "id": "m5ht6z0",
          "author": "soda-pops",
          "body": "dyou think other methods of acting childlike would be helpful for you? like wearing onsies and cuddling with plushies? just a genuine idea :3",
          "created_utc": 1736066151.0
        },
        {
          "id": "m5iq6w7",
          "author": "Worried_Brilliant939",
          "body": "I kind of do that but in a cutesy “I’m 30 but can act like I’m an early 20 something who likes cute culture” kind of way. I regress constantly with my partner and have a kid-voice and persona, but it’s not adaptive at this point. It’s just a fractured part of me. When I lean into deliberate regression, like what you describe, honestly it feels a little…creepy? I don’t know why. Technically that’s healthy. Maybe some unresolved issues leftover from when I was in my 20s and playing Lolita to a bunch of older men. Sheesh",
          "created_utc": 1736084707.0
        },
        {
          "id": "m5l2iaf",
          "author": "soda-pops",
          "body": "I can understand the creepy thing! Good luck on healing man, its rough.",
          "created_utc": 1736110936.0
        }
      ]
    }
  ]
}