{
  "id": "1hx1h89",
  "subreddit": "AnorexiaNervosa",
  "author": "Confused_flower1706",
  "created_utc": 1736387541.0,
  "title": "How??",
  "selftext": "Sometimes I see people eat stuff and I’m literally awestruck cuz like I didn’t know you could just do that? For example I make my sister breakfast every morning and it’s usually like eggs and toast and sausage and cheese and onions but then sometimes while I’m cooking it she will just like grab a muffin and eat it as a pre breakfast snack and I’m literally just in awe cuz like In my mind I don’t know if I could ever just do that, like that’s a thing? You can just have a muffin BEFORE breakfast?? Like I genuinely forgot that was an option. Also when people will say they want a coffee and then order like a really elaborate latte with like syrup and whip cream and all the jazz, like you’re telling me you can just do that and not think twice about it? It feels like my brain is just so programmed to see calories and not flavours that I  genuinely have a hard time believing that other people aren’t the same because it just feels so like… normal? I guess for me. I’m in awe of these people I want to be like them but idk if it’s in the cards for me, maybe I’ll never un-learn the calories in my head and I’m forever cursed. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1hx1h89/how/",
  "score": 172,
  "num_comments": 17,
  "comments": [
    {
      "id": "m65md05",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1736387541.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m65uoog",
      "author": "2noserings",
      "body": "watching my best friend eat an entire large cheese pizza in a bikini one summer changed my brain chemistry.",
      "created_utc": 1736390492.0,
      "score": 105,
      "context": []
    },
    {
      "id": "m65qdxn",
      "author": "tpwkluvr",
      "body": "same and the weirdest part is i can remember being like that, but i feel like i’ll never be able to unknow ab the cals in everything",
      "created_utc": 1736388960.0,
      "score": 19,
      "context": []
    },
    {
      "id": "m66g461",
      "author": "alienprincess111",
      "body": "I feel exactly the same way. Seeing how much people eat and how often is bizarre to me.  3 meals a day seems like just incessant eating to me, yet normal people also have snacks on top of the meals!",
      "created_utc": 1736399060.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m66vsbw",
      "author": "GreetingCardShark",
      "body": "The struggle is real! I remember going to a work conference a few years ago, and just being astounded by how often we were eating. Three meals a day, plus snacks, plus a morning AND afternoon coffee breaks, plus a cocktail hour, plus late-night snacks and drinks… it felt like all we did was eat.\n\nI brought it up in a group of attendees that I knew, and they all were like “no, I actually thought they could have done more.” My mind was absolutely blown.",
      "created_utc": 1736407347.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m66pjfz",
      "author": "Interesting-Cow8131",
      "body": "Even when i wasn't consciously restricting, I didn't do that. My brain is broken, I've been suffering from this forever 😭",
      "created_utc": 1736403791.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m65sahx",
      "author": "ThrowRA-sicksad",
      "body": "I was a binge eater for a long time and it really got away from me. I got really big. Now my ED is generally managed. I don’t agonize over calories but I definitely think twice about impulsive food choices and make up for an excess of calories in one meal elsewhere in the day.",
      "created_utc": 1736389642.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m65qn1p",
      "author": "nervous_veggie",
      "body": "Food and eating is a basic necessary biological behaviour. Your brain isn’t healthy and your view isn’t ‘normal’, and sadly many people are affected by weird societal norms and attitudes towards food. But at its roots it is just part of life and should be no more biologically important than having a wee or sleeping",
      "created_utc": 1736389050.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m66bqcn",
      "author": "milkhaterz",
      "body": "my family be like \"yall ready for dessert?\" WHAT THE FUCK???? 😟\n\nlike its some foreign shit to me 😭",
      "created_utc": 1736397112.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m6d51ry",
      "author": "vivi_roblox",
      "body": "As I started to forget about calories, I started thinking about my hunger more. Turns out i’m not as hungry as my ED made me, and I actually started accidentally losing weight in recovery. \n\nOverall, it’s genetics and how many calories said person eats a day. You may see that your sister is eating a muffin pre breakfast, but she may eat small meals the rest of the day. Or she eats more calories that day, & is in a calorie deficit (without knowing) another day.",
      "created_utc": 1736491100.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6csexs",
      "author": "Most_Mammoth_426",
      "body": "(warning mentioning symptoms of bulimia) m(18) I can relate I grew up a food lover but when I developed an ed I couldn’t see food the same 😭there’s so much guilt around food now. like is it worth eating? does it taste good enough to have? or like how easy would it be to purge? idk how many other people can relate but I developed it because of a girl I used to like and everytime I see her my stomach gets so sick and being in a class of 40 it’s not the easiest to avoid😭",
      "created_utc": 1736484880.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m924n82",
      "author": "Efficient_Bite_1926",
      "body": "Well they’re fat so there’s that. Anorexia is bad but staying lean isn’t anorexia",
      "created_utc": 1737791054.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6757b2",
      "author": "thecowgirlchronicles",
      "body": "this would break and save me all in one",
      "created_utc": 1736413289.0,
      "score": 41,
      "context": [
        {
          "id": "m65uoog",
          "author": "2noserings",
          "body": "watching my best friend eat an entire large cheese pizza in a bikini one summer changed my brain chemistry.",
          "created_utc": 1736390492.0
        }
      ]
    },
    {
      "id": "m6az0do",
      "author": "Rhyme_orange_",
      "body": "Me too. Amen.",
      "created_utc": 1736462150.0,
      "score": 1,
      "context": [
        {
          "id": "m66pjfz",
          "author": "Interesting-Cow8131",
          "body": "Even when i wasn't consciously restricting, I didn't do that. My brain is broken, I've been suffering from this forever 😭",
          "created_utc": 1736403791.0
        }
      ]
    },
    {
      "id": "m66hkic",
      "author": "Confused_flower1706",
      "body": "Right like it’s just so unknown! And like tbh I would love to have some dessert I just don’t know how, I guess it’s since it brings me so much stress it’s like I’m doing it wrong in a way. Dessert should be fun and bring happiness not stress or anxiety!",
      "created_utc": 1736399735.0,
      "score": 5,
      "context": [
        {
          "id": "m66bqcn",
          "author": "milkhaterz",
          "body": "my family be like \"yall ready for dessert?\" WHAT THE FUCK???? 😟\n\nlike its some foreign shit to me 😭",
          "created_utc": 1736397112.0
        }
      ]
    },
    {
      "id": "m66ix82",
      "author": "milkhaterz",
      "body": "yeah exactly, and in my head its like if i were to have some its a reward i have to \"earn\" to counteract the \"consequences\". honestly goals to be able to not even think twice about dessert but i feel like i just know too much 😭",
      "created_utc": 1736400386.0,
      "score": 4,
      "context": [
        {
          "id": "m66bqcn",
          "author": "milkhaterz",
          "body": "my family be like \"yall ready for dessert?\" WHAT THE FUCK???? 😟\n\nlike its some foreign shit to me 😭",
          "created_utc": 1736397112.0
        },
        {
          "id": "m66hkic",
          "author": "Confused_flower1706",
          "body": "Right like it’s just so unknown! And like tbh I would love to have some dessert I just don’t know how, I guess it’s since it brings me so much stress it’s like I’m doing it wrong in a way. Dessert should be fun and bring happiness not stress or anxiety!",
          "created_utc": 1736399735.0
        }
      ]
    },
    {
      "id": "m6azbn3",
      "author": "Rhyme_orange_",
      "body": "Same. I still do challenge myself with dessert because I know I lose the competition with life or AN either way.",
      "created_utc": 1736462249.0,
      "score": 3,
      "context": [
        {
          "id": "m66bqcn",
          "author": "milkhaterz",
          "body": "my family be like \"yall ready for dessert?\" WHAT THE FUCK???? 😟\n\nlike its some foreign shit to me 😭",
          "created_utc": 1736397112.0
        },
        {
          "id": "m66hkic",
          "author": "Confused_flower1706",
          "body": "Right like it’s just so unknown! And like tbh I would love to have some dessert I just don’t know how, I guess it’s since it brings me so much stress it’s like I’m doing it wrong in a way. Dessert should be fun and bring happiness not stress or anxiety!",
          "created_utc": 1736399735.0
        },
        {
          "id": "m66ix82",
          "author": "milkhaterz",
          "body": "yeah exactly, and in my head its like if i were to have some its a reward i have to \"earn\" to counteract the \"consequences\". honestly goals to be able to not even think twice about dessert but i feel like i just know too much 😭",
          "created_utc": 1736400386.0
        }
      ]
    }
  ]
}