{
  "id": "1hxyhqj",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1736491332.0,
  "title": "Worst Depiction of AN in Media? ",
  "selftext": "Fuck you, To The Bone. You know what you did...",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1hxyhqj/worst_depiction_of_an_in_media/",
  "score": 110,
  "num_comments": 60,
  "comments": [
    {
      "id": "m6flevu",
      "author": "Shadowed-Heart",
      "body": "Let's keep this about the shows & their faults, not characters and their bodies.",
      "created_utc": 1736529723.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6dbctf",
      "author": "None",
      "body": "Was just about to comment to the bone. \n\nA little bit Cassie in Skins UK also. Feels like she has a bit of other issues with attachment etc but the show is aimed at 16yoS and in reality no 16yo has that emotional intelligence to fully understand her mental issues, they would rather think of her as crazy because of her ED. :(",
      "created_utc": 1736494727.0,
      "score": 89,
      "context": []
    },
    {
      "id": "m6db33m",
      "author": "vivi_roblox",
      "body": "To the bone kind of romanticized it a bit, and made it seem like a messy sad girl life instead of a girl struggling with anorexia.",
      "created_utc": 1736494566.0,
      "score": 103,
      "context": []
    },
    {
      "id": "m6dqhpu",
      "author": "Freezingcoldk",
      "body": "Starving in Suburbia all the way, nothing about that movie was realistic sorry that’s just not how it all works",
      "created_utc": 1736504307.0,
      "score": 54,
      "context": []
    },
    {
      "id": "m6diryi",
      "author": "None",
      "body": "like, in to the bone, I didn't like how they made an anorexic girl a person with \"asperger syndrome with calories \" it doesn't work like that.\nYou can memorise the calories of some foods, but not ALL foods, you can't tell (without knowing the grams especially) EXACTLY how many calories a meal has, that's so so wrong and messed up\nand, in addition, anorexic people actually eat.\nthey can starve, but not for this long damn! they just eat very few, but they eat",
      "created_utc": 1736499361.0,
      "score": 77,
      "context": []
    },
    {
      "id": "m6gnkft",
      "author": "odette9",
      "body": "I was so pissed with the scene where she hid the sick in a BROWN PAPER BAG just barely under her bed like COME ON",
      "created_utc": 1736540763.0,
      "score": 18,
      "context": []
    },
    {
      "id": "m6djfp8",
      "author": "TimeLecture580",
      "body": "to the bone or cassie from skins, i was literally in a gc full of girls and boys suffering from ed’s and we all agreed those shows/ movies “motivated us” 🤦‍♀️",
      "created_utc": 1736499791.0,
      "score": 33,
      "context": []
    },
    {
      "id": "m6frkos",
      "author": "Embarrassed_Visit277",
      "body": "To the bone. Most treatment centers, even nice residentials, would NEVER allow you to eat or use the bathroom unsupervised. You cant just choose whatever you want to eat. \n\nAlso, the whole “skinny-white-girl-with-AN” stereotype really pisses me off, because it pushes the idea that you only have AN/youre sick enough only if youre skinny, which is NOT true.",
      "created_utc": 1736531488.0,
      "score": 34,
      "context": []
    },
    {
      "id": "m6ir3yp",
      "author": "soshingi",
      "body": "I have to agree with you. To the Bone. Eli was just too... too good at suffering. No way she just didn't eat for that long without a single binge.",
      "created_utc": 1736565673.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m6gao3o",
      "author": "yyizzyz",
      "body": "cassie in skins. love her but i think she was just nuts in general and not a good depiction of ed- had a convo w one of my non-disordered friends and she basically thinks that ed’s are defined by being generally loopy and odd like cassie",
      "created_utc": 1736536992.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m6geoe3",
      "author": "to_tired_to_clare",
      "body": "I have never seen a good depiction in the media",
      "created_utc": 1736538161.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m6gzzdm",
      "author": "Guilty_Cookie2840",
      "body": "Starving in suburbia 🙄",
      "created_utc": 1736544444.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m6heinq",
      "author": "Important_Bite4087",
      "body": "has anyone seen the red band society?? ana is depicted AWFULLY in that show",
      "created_utc": 1736548945.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m6jxgho",
      "author": "urliterallysopretty",
      "body": "idk but when i watched to the bone i felt invalidated like i needed to be more sick if that makes sense",
      "created_utc": 1736587803.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m6ryxd4",
      "author": "BeepBeep-beeper",
      "body": "I know this isn’t actually an answer to the question… but has anyone seen Feed? From a purely cinematic point of view it’s definitely not a good movie (at least in my opinion), but to me it seemed like AN was not as romanticized as it is in other ED movies and shows. Also, it seemed like there was an obvious effort to depict AN in a more disturbing and “uncomfortable” way by focusing heavily on the psychological, social, and emotional aspects of the disorder. But still not actually a “good” movie in my opinion.",
      "created_utc": 1736703936.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6voms0",
      "author": "runchmunch",
      "body": "agreed with to the bone. sad girl hits breaking point & decides to recover incentivized by rekindling her relationship with lover boy. also what demographic is that movie for? it was a hard watch trigger-wise, but also a motivator in the worst ways (i never thought of fitting my hand around my upper arm as a goal, but ive thought about it ever since).",
      "created_utc": 1736747703.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6d5h4l",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1736491332.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m7ejtu9",
      "author": "Relevant_Stranger_20",
      "body": "it just pisses me off because there’s already a stigma around ed and how it works on social media, we don’t need it to represented through shows/movies and make the stigma EVEN worse. not to mention, how much social media romanticizes it: tiktok, twitter, etc. having tv on ed on top of that honestly never inspires me in a good way, just continues to motivate me, and i imagine it’s the same for many others. the stereotypes around ed are so annoying, and so overused, and i just don’t understand how they don’t realize that ed comes in so many different forms and it’s not all the same for everyone, as well as many other mental illnesses and physical problems in general. we do not all have the same restricting habits, etc. as well as every person with ana being skin and bone. it’s just not realistic. while we may have similar symptoms, ed is not the same for everyone at all, we all handle it differently. i’m so tired of it being glorified and the series on it just motivating people in bad ways. if you’re going to make something on ana, or anything else for that matter, either make it actually realistic and show the true reality of it or don’t make it at all. the stereotypes and stigmas around it only make people with ed feel worse, not better. they also never show the binging part/insatiable hunger with ana because they like to act like people never eat at all with it. if people never ever ate with it then ana wouldn’t be a problem that people have for YEARS. ",
      "created_utc": 1737003975.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mohrogn",
      "author": "Independent-Shoe594",
      "body": "I don’t know but Feed was a great movie to watch, I think Troian Bellisario wrote it. It had way less to do with wanting to be skinny than it was just mental illness and control loss. Very realistic",
      "created_utc": 1745353790.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6htdxk",
      "author": "Character_Quote_6889",
      "body": "charlie from heartstopper his ed is very badly written\nhe has literally 0 reason to starve he just does 😭 it pisses me off",
      "created_utc": 1736553936.0,
      "score": -1,
      "context": []
    },
    {
      "id": "m6dfa34",
      "author": "wckow",
      "body": "When I first watched skins at 13 I definitely did see Cassie just as a crazy anorexic. My 13 y.o. brain was romanticising her heavily lol. As I got older I realised that there was way more to her than just her struggle with food, and yeah seeing more of her personality disorder- she actually kinda gives me BPD vibes lol but maybe I'm projecting again. Anyways yeah it's always crazy with Skins characters how our perception of them changes with age",
      "created_utc": 1736497122.0,
      "score": 46,
      "context": [
        {
          "id": "m6dbctf",
          "author": "None",
          "body": "Was just about to comment to the bone. \n\nA little bit Cassie in Skins UK also. Feels like she has a bit of other issues with attachment etc but the show is aimed at 16yoS and in reality no 16yo has that emotional intelligence to fully understand her mental issues, they would rather think of her as crazy because of her ED. :(",
          "created_utc": 1736494727.0
        }
      ]
    },
    {
      "id": "m6if3wd",
      "author": "None",
      "body": "Yes!\n\nAnorexia isn't being like Cassie acting all loopy, wearing crazy but fashionable clothes, being quirky and just not eating. The reality of anorexia is probably not having a big group of friends who all still want to hang around you, not being invited to parties, probably leaving college because you're not well enough and people don't think you're a lovable, cute blonde who's a bit mad. It's lonely, not fun to be around, cold, strict, depressing and isolating.",
      "created_utc": 1736561339.0,
      "score": 11,
      "context": [
        {
          "id": "m6dbctf",
          "author": "None",
          "body": "Was just about to comment to the bone. \n\nA little bit Cassie in Skins UK also. Feels like she has a bit of other issues with attachment etc but the show is aimed at 16yoS and in reality no 16yo has that emotional intelligence to fully understand her mental issues, they would rather think of her as crazy because of her ED. :(",
          "created_utc": 1736494727.0
        }
      ]
    },
    {
      "id": "m6ivvvs",
      "author": "entomoblonde",
      "body": "I agree she's perhaps not among the best anorexia depictions, which I wouldn't be able to taxonomize the most effectively as I never engaged with fiction centered on anorexia as often as real stories about people and the high-water marks when they received assistance from their friends and families, although when I was like 15, and my anorexia started burgeoning, I would grant the character the praise that I was more so finding solace in her fundamental attachment issues and loneliness and their interactions with the manifestation of her anorexia than my simple curiosities about her anorexia. I also found the ending she received in Skins Pure to be comforting and inspiring. However, I would reflect that this depiction and others might not have necessarily encapsulated that being anorexic is even more hibernal and lonely than not, and I wish something had properly prewarned me",
      "created_utc": 1736567496.0,
      "score": 3,
      "context": [
        {
          "id": "m6dbctf",
          "author": "None",
          "body": "Was just about to comment to the bone. \n\nA little bit Cassie in Skins UK also. Feels like she has a bit of other issues with attachment etc but the show is aimed at 16yoS and in reality no 16yo has that emotional intelligence to fully understand her mental issues, they would rather think of her as crazy because of her ED. :(",
          "created_utc": 1736494727.0
        }
      ]
    },
    {
      "id": "m6div2a",
      "author": "BrowncoatIona",
      "body": "Sorry, bit of a rant here that I don't expect anyone to actually read -\n\nI always try to be cautious when discussing To the bone, because I know some people with EDs really felt seen by it and I don't want to invalidate that, but...\n\nTo the Bone really, *really* bothered me. It romanticized and infantilized AN. Created lots of thinspo to be spread around to vulnerable people in ED spaces. Had an already thin actress with a history of ED lose weight and claimed they \"did it in a healthy way\". \n\nThe RTC in the movie was a joke. And IIRC (though I definitely could be wrong) the only people who struggled with BED or bulimia were women of color, while all the AN patients were white.  \n\nThe relationship between Keanu Reeves' character and his patients/clients seemed inappropriate (which especially bummed me out because I actually think he could play a great ED therapist with the right script and directing). The romance between Luke & Ellen was unpleasant and pointless (even though that toxicity *could* have been utilized to benefit the story/character growth/etc). And how they handled the storyline of the woman who miscarried... There's so much more I could go on about but I'll stop now x . x\n\nIt just felt like so much wasted potential that resulted in a shallow film at best and an actively harmful film at worst.",
      "created_utc": 1736499417.0,
      "score": 89,
      "context": [
        {
          "id": "m6db33m",
          "author": "vivi_roblox",
          "body": "To the bone kind of romanticized it a bit, and made it seem like a messy sad girl life instead of a girl struggling with anorexia.",
          "created_utc": 1736494566.0
        }
      ]
    },
    {
      "id": "m6evr8n",
      "author": "MediumEstimate2804",
      "body": "God yeah, this one makes To the Bone even look not that bad. The dark lighting, the way the \"pro Ana\" people online are literally embodied by one person pushing her to have an ED is laughable and infuriating at the same time",
      "created_utc": 1736522148.0,
      "score": 28,
      "context": [
        {
          "id": "m6dqhpu",
          "author": "Freezingcoldk",
          "body": "Starving in Suburbia all the way, nothing about that movie was realistic sorry that’s just not how it all works",
          "created_utc": 1736504307.0
        }
      ]
    },
    {
      "id": "m6ds5vk",
      "author": "Odd_Theme_3294",
      "body": "Also how she does the calorie thing at the table with her sister. Who would actually do that to their sister - maybe they both found it fun?\nI don’t know about anyone else but I find calories insanely boring, and I am embarrassed of the fact I can know most stuff.\n\nBut I wouldn’t dream of playing a game like that with my sister (she’s 17 - so I hope she wouldn’t) because i wouldn’t want her to see it as good or funny thing.",
      "created_utc": 1736505338.0,
      "score": 47,
      "context": [
        {
          "id": "m6diryi",
          "author": "None",
          "body": "like, in to the bone, I didn't like how they made an anorexic girl a person with \"asperger syndrome with calories \" it doesn't work like that.\nYou can memorise the calories of some foods, but not ALL foods, you can't tell (without knowing the grams especially) EXACTLY how many calories a meal has, that's so so wrong and messed up\nand, in addition, anorexic people actually eat.\nthey can starve, but not for this long damn! they just eat very few, but they eat",
          "created_utc": 1736499361.0
        }
      ]
    },
    {
      "id": "m6fswzl",
      "author": "Melodramatic-anon876",
      "body": "That scene was the only part I related to honestly, as a person with autism and a super numbers focused brain I do have the knowledge needed to calculate within 95% accuracy all foods. \n\nIt definitely wasn’t accurate as far as her sister going through the count with her but as far as the actually breaking down the calories that’s exactly what my brain does no matter how hard I try to turn it off.",
      "created_utc": 1736531871.0,
      "score": 7,
      "context": [
        {
          "id": "m6diryi",
          "author": "None",
          "body": "like, in to the bone, I didn't like how they made an anorexic girl a person with \"asperger syndrome with calories \" it doesn't work like that.\nYou can memorise the calories of some foods, but not ALL foods, you can't tell (without knowing the grams especially) EXACTLY how many calories a meal has, that's so so wrong and messed up\nand, in addition, anorexic people actually eat.\nthey can starve, but not for this long damn! they just eat very few, but they eat",
          "created_utc": 1736499361.0
        }
      ]
    },
    {
      "id": "m7egeaf",
      "author": "Relevant_Stranger_20",
      "body": "EXACTLY! idk why in every single ed related movies/shows they always act like people with anorexia don’t eat at all. if we didn’t eat AT ALL, it wouldn’t be that people have anorexia for years, it would be that they died a long time before it even hit a month. I js feel like all the series are very misleading, and are more things that people who do not have it and have not dealt with it, would assume about how it actually is living with it. it really sucks to see how misrepresented it is on television, not inspiring at all, and quite frankly they shouldn’t make anything about it if they’re not even gonna get it right, and use typical stereotypes. not everyone falls into one category, and ed is soso different for everyone. ofc there’s similar symptoms that we all experience, but it’s still different for how ed works on us all.",
      "created_utc": 1737002447.0,
      "score": 2,
      "context": [
        {
          "id": "m6diryi",
          "author": "None",
          "body": "like, in to the bone, I didn't like how they made an anorexic girl a person with \"asperger syndrome with calories \" it doesn't work like that.\nYou can memorise the calories of some foods, but not ALL foods, you can't tell (without knowing the grams especially) EXACTLY how many calories a meal has, that's so so wrong and messed up\nand, in addition, anorexic people actually eat.\nthey can starve, but not for this long damn! they just eat very few, but they eat",
          "created_utc": 1736499361.0
        }
      ]
    },
    {
      "id": "m6dk9t2",
      "author": "None",
      "body": "I had the biggest relapse bc of Cassie and the protagonist of to the bone (can't remember her name sorry)",
      "created_utc": 1736500329.0,
      "score": 13,
      "context": [
        {
          "id": "m6djfp8",
          "author": "TimeLecture580",
          "body": "to the bone or cassie from skins, i was literally in a gc full of girls and boys suffering from ed’s and we all agreed those shows/ movies “motivated us” 🤦‍♀️",
          "created_utc": 1736499791.0
        }
      ]
    },
    {
      "id": "m6fwzqq",
      "author": "WhoHasntGivenUpYet",
      "body": "I’m in a really good residential center and while you do have to follow a meal plan, but you have a lot of say regarding what foods are on your meal plan (eg. I have Starbucks coffee) and they aren’t insanely strict/vigilant (it’s absolutely possible to cheat quite easily), and you can always use the bathroom alone, plus you aren’t bag checked so it’s very easy to bring anything. There are repercussions if you don’t gain weight, and if it gets too dangerous you’re sent to a closed facility, but the system generally works. I agree though to the bone is such bad rep",
      "created_utc": 1736533040.0,
      "score": 8,
      "context": [
        {
          "id": "m6frkos",
          "author": "Embarrassed_Visit277",
          "body": "To the bone. Most treatment centers, even nice residentials, would NEVER allow you to eat or use the bathroom unsupervised. You cant just choose whatever you want to eat. \n\nAlso, the whole “skinny-white-girl-with-AN” stereotype really pisses me off, because it pushes the idea that you only have AN/youre sick enough only if youre skinny, which is NOT true.",
          "created_utc": 1736531488.0
        }
      ]
    },
    {
      "id": "m6i56kl",
      "author": "skxnnyangel",
      "body": "omg yes i was waiting for this! emma made me romaticize ana so much bc she's depicted as the perfect skinny white girl next door. like i love her and relate to her so much but it's also just infuriating how it's portrayed.",
      "created_utc": 1736557939.0,
      "score": 6,
      "context": [
        {
          "id": "m6heinq",
          "author": "Important_Bite4087",
          "body": "has anyone seen the red band society?? ana is depicted AWFULLY in that show",
          "created_utc": 1736548945.0
        }
      ]
    },
    {
      "id": "m6uv3la",
      "author": "PensionHealthy",
      "body": "i tried several times to watch that movie and i just couldn’t get myself to care or pay attention to the characters lol it was so boring and confusing at the same time 💀",
      "created_utc": 1736735609.0,
      "score": 2,
      "context": [
        {
          "id": "m6ryxd4",
          "author": "BeepBeep-beeper",
          "body": "I know this isn’t actually an answer to the question… but has anyone seen Feed? From a purely cinematic point of view it’s definitely not a good movie (at least in my opinion), but to me it seemed like AN was not as romanticized as it is in other ED movies and shows. Also, it seemed like there was an obvious effort to depict AN in a more disturbing and “uncomfortable” way by focusing heavily on the psychological, social, and emotional aspects of the disorder. But still not actually a “good” movie in my opinion.",
          "created_utc": 1736703936.0
        }
      ]
    },
    {
      "id": "m6ie3zr",
      "author": "ManILoveFrogs69420",
      "body": "As a counter argument, they have it being a symptom of OCD which was the broader mental illness he was dealing with. I think it was well written when you view it through the eyes of OCD. Plus the fact that they depicted a young man with an ED with different reasons and motivations.",
      "created_utc": 1736560987.0,
      "score": 10,
      "context": [
        {
          "id": "m6htdxk",
          "author": "Character_Quote_6889",
          "body": "charlie from heartstopper his ed is very badly written\nhe has literally 0 reason to starve he just does 😭 it pisses me off",
          "created_utc": 1736553936.0
        }
      ]
    },
    {
      "id": "m6iwa0t",
      "author": "pipsqueak_pixie",
      "body": ">It's lonely, not fun to be around, cold, strict, depressing and isolating.\n\n100% nail on head. It's frustrating how few understand this.",
      "created_utc": 1736567647.0,
      "score": 10,
      "context": [
        {
          "id": "m6dbctf",
          "author": "None",
          "body": "Was just about to comment to the bone. \n\nA little bit Cassie in Skins UK also. Feels like she has a bit of other issues with attachment etc but the show is aimed at 16yoS and in reality no 16yo has that emotional intelligence to fully understand her mental issues, they would rather think of her as crazy because of her ED. :(",
          "created_utc": 1736494727.0
        },
        {
          "id": "m6if3wd",
          "author": "None",
          "body": "Yes!\n\nAnorexia isn't being like Cassie acting all loopy, wearing crazy but fashionable clothes, being quirky and just not eating. The reality of anorexia is probably not having a big group of friends who all still want to hang around you, not being invited to parties, probably leaving college because you're not well enough and people don't think you're a lovable, cute blonde who's a bit mad. It's lonely, not fun to be around, cold, strict, depressing and isolating.",
          "created_utc": 1736561339.0
        }
      ]
    },
    {
      "id": "m6mww29",
      "author": "HolidayOreo",
      "body": ">probably leaving college because you’re not well enough< \n\nLiterally me :/\nI was a freshmen and now my whole life is off track ",
      "created_utc": 1736629468.0,
      "score": 2,
      "context": [
        {
          "id": "m6dbctf",
          "author": "None",
          "body": "Was just about to comment to the bone. \n\nA little bit Cassie in Skins UK also. Feels like she has a bit of other issues with attachment etc but the show is aimed at 16yoS and in reality no 16yo has that emotional intelligence to fully understand her mental issues, they would rather think of her as crazy because of her ED. :(",
          "created_utc": 1736494727.0
        },
        {
          "id": "m6if3wd",
          "author": "None",
          "body": "Yes!\n\nAnorexia isn't being like Cassie acting all loopy, wearing crazy but fashionable clothes, being quirky and just not eating. The reality of anorexia is probably not having a big group of friends who all still want to hang around you, not being invited to parties, probably leaving college because you're not well enough and people don't think you're a lovable, cute blonde who's a bit mad. It's lonely, not fun to be around, cold, strict, depressing and isolating.",
          "created_utc": 1736561339.0
        }
      ]
    },
    {
      "id": "m6drh6y",
      "author": "Odd_Theme_3294",
      "body": "I also am not a big fan of TTB - and if I watch it it’s for the sole purpose of triggering myself.\n\nBut you cannot become underweight in a healthy way ever. Being underweight is not healthy - so intentionally getting there whether it’s for a film or other reasons, it’s still going to harm their bodies. \n\nAdditionally, like you said, that certain actors did have history of EDS - surely anything like that could trigger a massive relapse.",
      "created_utc": 1736504916.0,
      "score": 42,
      "context": [
        {
          "id": "m6db33m",
          "author": "vivi_roblox",
          "body": "To the bone kind of romanticized it a bit, and made it seem like a messy sad girl life instead of a girl struggling with anorexia.",
          "created_utc": 1736494566.0
        },
        {
          "id": "m6div2a",
          "author": "BrowncoatIona",
          "body": "Sorry, bit of a rant here that I don't expect anyone to actually read -\n\nI always try to be cautious when discussing To the bone, because I know some people with EDs really felt seen by it and I don't want to invalidate that, but...\n\nTo the Bone really, *really* bothered me. It romanticized and infantilized AN. Created lots of thinspo to be spread around to vulnerable people in ED spaces. Had an already thin actress with a history of ED lose weight and claimed they \"did it in a healthy way\". \n\nThe RTC in the movie was a joke. And IIRC (though I definitely could be wrong) the only people who struggled with BED or bulimia were women of color, while all the AN patients were white.  \n\nThe relationship between Keanu Reeves' character and his patients/clients seemed inappropriate (which especially bummed me out because I actually think he could play a great ED therapist with the right script and directing). The romance between Luke & Ellen was unpleasant and pointless (even though that toxicity *could* have been utilized to benefit the story/character growth/etc). And how they handled the storyline of the woman who miscarried... There's so much more I could go on about but I'll stop now x . x\n\nIt just felt like so much wasted potential that resulted in a shallow film at best and an actively harmful film at worst.",
          "created_utc": 1736499417.0
        }
      ]
    },
    {
      "id": "m6gs1vb",
      "author": "vivi_roblox",
      "body": "Exactly a great way to explain it!",
      "created_utc": 1736542084.0,
      "score": 1,
      "context": [
        {
          "id": "m6db33m",
          "author": "vivi_roblox",
          "body": "To the bone kind of romanticized it a bit, and made it seem like a messy sad girl life instead of a girl struggling with anorexia.",
          "created_utc": 1736494566.0
        },
        {
          "id": "m6div2a",
          "author": "BrowncoatIona",
          "body": "Sorry, bit of a rant here that I don't expect anyone to actually read -\n\nI always try to be cautious when discussing To the bone, because I know some people with EDs really felt seen by it and I don't want to invalidate that, but...\n\nTo the Bone really, *really* bothered me. It romanticized and infantilized AN. Created lots of thinspo to be spread around to vulnerable people in ED spaces. Had an already thin actress with a history of ED lose weight and claimed they \"did it in a healthy way\". \n\nThe RTC in the movie was a joke. And IIRC (though I definitely could be wrong) the only people who struggled with BED or bulimia were women of color, while all the AN patients were white.  \n\nThe relationship between Keanu Reeves' character and his patients/clients seemed inappropriate (which especially bummed me out because I actually think he could play a great ED therapist with the right script and directing). The romance between Luke & Ellen was unpleasant and pointless (even though that toxicity *could* have been utilized to benefit the story/character growth/etc). And how they handled the storyline of the woman who miscarried... There's so much more I could go on about but I'll stop now x . x\n\nIt just felt like so much wasted potential that resulted in a shallow film at best and an actively harmful film at worst.",
          "created_utc": 1736499417.0
        }
      ]
    },
    {
      "id": "m6dsfaw",
      "author": "None",
      "body": "exactly!! don't be embarrassed, I count calories everyday, but it literally doesn't work like that! ur so right!",
      "created_utc": 1736505498.0,
      "score": 10,
      "context": [
        {
          "id": "m6diryi",
          "author": "None",
          "body": "like, in to the bone, I didn't like how they made an anorexic girl a person with \"asperger syndrome with calories \" it doesn't work like that.\nYou can memorise the calories of some foods, but not ALL foods, you can't tell (without knowing the grams especially) EXACTLY how many calories a meal has, that's so so wrong and messed up\nand, in addition, anorexic people actually eat.\nthey can starve, but not for this long damn! they just eat very few, but they eat",
          "created_utc": 1736499361.0
        },
        {
          "id": "m6ds5vk",
          "author": "Odd_Theme_3294",
          "body": "Also how she does the calorie thing at the table with her sister. Who would actually do that to their sister - maybe they both found it fun?\nI don’t know about anyone else but I find calories insanely boring, and I am embarrassed of the fact I can know most stuff.\n\nBut I wouldn’t dream of playing a game like that with my sister (she’s 17 - so I hope she wouldn’t) because i wouldn’t want her to see it as good or funny thing.",
          "created_utc": 1736505338.0
        }
      ]
    },
    {
      "id": "m6z22eh",
      "author": "oaktreeandariver",
      "body": "In my family we used to quiz each other on the ingredients of different food products, so I don’t feel like it would be that u reasonable to quiz each other on the amount of calories, that would’ve been kind of similar for food in packaging.",
      "created_utc": 1736797845.0,
      "score": 1,
      "context": [
        {
          "id": "m6diryi",
          "author": "None",
          "body": "like, in to the bone, I didn't like how they made an anorexic girl a person with \"asperger syndrome with calories \" it doesn't work like that.\nYou can memorise the calories of some foods, but not ALL foods, you can't tell (without knowing the grams especially) EXACTLY how many calories a meal has, that's so so wrong and messed up\nand, in addition, anorexic people actually eat.\nthey can starve, but not for this long damn! they just eat very few, but they eat",
          "created_utc": 1736499361.0
        },
        {
          "id": "m6ds5vk",
          "author": "Odd_Theme_3294",
          "body": "Also how she does the calorie thing at the table with her sister. Who would actually do that to their sister - maybe they both found it fun?\nI don’t know about anyone else but I find calories insanely boring, and I am embarrassed of the fact I can know most stuff.\n\nBut I wouldn’t dream of playing a game like that with my sister (she’s 17 - so I hope she wouldn’t) because i wouldn’t want her to see it as good or funny thing.",
          "created_utc": 1736505338.0
        }
      ]
    },
    {
      "id": "m6gbqse",
      "author": "None",
      "body": "I'm sorry to hear that, I really hope that u are recovering, as a person who is also obsessed with calorie counting, I often have to check on the internet/calorie counting apps to see how many calories are in my meal, I can't memorise every single food, exactly like most people with an ed",
      "created_utc": 1736537302.0,
      "score": 2,
      "context": [
        {
          "id": "m6diryi",
          "author": "None",
          "body": "like, in to the bone, I didn't like how they made an anorexic girl a person with \"asperger syndrome with calories \" it doesn't work like that.\nYou can memorise the calories of some foods, but not ALL foods, you can't tell (without knowing the grams especially) EXACTLY how many calories a meal has, that's so so wrong and messed up\nand, in addition, anorexic people actually eat.\nthey can starve, but not for this long damn! they just eat very few, but they eat",
          "created_utc": 1736499361.0
        },
        {
          "id": "m6fswzl",
          "author": "Melodramatic-anon876",
          "body": "That scene was the only part I related to honestly, as a person with autism and a super numbers focused brain I do have the knowledge needed to calculate within 95% accuracy all foods. \n\nIt definitely wasn’t accurate as far as her sister going through the count with her but as far as the actually breaking down the calories that’s exactly what my brain does no matter how hard I try to turn it off.",
          "created_utc": 1736531871.0
        }
      ]
    },
    {
      "id": "m7f1cbd",
      "author": "None",
      "body": "couldn't explain it better, every movie about ed is too stereotypical and they just spread misinformation",
      "created_utc": 1737013354.0,
      "score": 2,
      "context": [
        {
          "id": "m6diryi",
          "author": "None",
          "body": "like, in to the bone, I didn't like how they made an anorexic girl a person with \"asperger syndrome with calories \" it doesn't work like that.\nYou can memorise the calories of some foods, but not ALL foods, you can't tell (without knowing the grams especially) EXACTLY how many calories a meal has, that's so so wrong and messed up\nand, in addition, anorexic people actually eat.\nthey can starve, but not for this long damn! they just eat very few, but they eat",
          "created_utc": 1736499361.0
        },
        {
          "id": "m7egeaf",
          "author": "Relevant_Stranger_20",
          "body": "EXACTLY! idk why in every single ed related movies/shows they always act like people with anorexia don’t eat at all. if we didn’t eat AT ALL, it wouldn’t be that people have anorexia for years, it would be that they died a long time before it even hit a month. I js feel like all the series are very misleading, and are more things that people who do not have it and have not dealt with it, would assume about how it actually is living with it. it really sucks to see how misrepresented it is on television, not inspiring at all, and quite frankly they shouldn’t make anything about it if they’re not even gonna get it right, and use typical stereotypes. not everyone falls into one category, and ed is soso different for everyone. ofc there’s similar symptoms that we all experience, but it’s still different for how ed works on us all.",
          "created_utc": 1737002447.0
        }
      ]
    },
    {
      "id": "m6dl4ba",
      "author": "TimeLecture580",
      "body": "same :/ i hope your healing now! ❤️‍🩹",
      "created_utc": 1736500874.0,
      "score": 6,
      "context": [
        {
          "id": "m6djfp8",
          "author": "TimeLecture580",
          "body": "to the bone or cassie from skins, i was literally in a gc full of girls and boys suffering from ed’s and we all agreed those shows/ movies “motivated us” 🤦‍♀️",
          "created_utc": 1736499791.0
        },
        {
          "id": "m6dk9t2",
          "author": "None",
          "body": "I had the biggest relapse bc of Cassie and the protagonist of to the bone (can't remember her name sorry)",
          "created_utc": 1736500329.0
        }
      ]
    },
    {
      "id": "m6gn4wb",
      "author": "MisantropicSnowflake",
      "body": "I've been to inpatient treatment, where they didn't put me on a mealplan at all. I had to write down, what I ate and at what times, but I was only requiered to eat the meals provided from the hospital and we would eat lunch together with a nutritionist. They still requiered me to gain weight. If I wouldn't, they would make me have snacks. (I had still ate snacks, because I wanted to get better and gain that amount). With each week not gaining enough, the rules would get more (less time allowed outside, being supervised for meals and / or after meals, less group therapy / more individual therapy, up until bedrest). But they tried giving you trust, that you want to get better and gain weight. It was the best approach for me and helped me so much being independent in my food choices. I had to show, what I wrote about my food and we discussed that. Really miss that therapist, she is a great lady and gave me so much trust back in treatment. I'm still struggeling, but doing so so much better than before.",
      "created_utc": 1736540637.0,
      "score": 3,
      "context": [
        {
          "id": "m6frkos",
          "author": "Embarrassed_Visit277",
          "body": "To the bone. Most treatment centers, even nice residentials, would NEVER allow you to eat or use the bathroom unsupervised. You cant just choose whatever you want to eat. \n\nAlso, the whole “skinny-white-girl-with-AN” stereotype really pisses me off, because it pushes the idea that you only have AN/youre sick enough only if youre skinny, which is NOT true.",
          "created_utc": 1736531488.0
        },
        {
          "id": "m6fwzqq",
          "author": "WhoHasntGivenUpYet",
          "body": "I’m in a really good residential center and while you do have to follow a meal plan, but you have a lot of say regarding what foods are on your meal plan (eg. I have Starbucks coffee) and they aren’t insanely strict/vigilant (it’s absolutely possible to cheat quite easily), and you can always use the bathroom alone, plus you aren’t bag checked so it’s very easy to bring anything. There are repercussions if you don’t gain weight, and if it gets too dangerous you’re sent to a closed facility, but the system generally works. I agree though to the bone is such bad rep",
          "created_utc": 1736533040.0
        }
      ]
    },
    {
      "id": "m6gemnt",
      "author": "New_Dragonfruit_592",
      "body": "Where are you? I have a friend currently looking",
      "created_utc": 1736538147.0,
      "score": 1,
      "context": [
        {
          "id": "m6frkos",
          "author": "Embarrassed_Visit277",
          "body": "To the bone. Most treatment centers, even nice residentials, would NEVER allow you to eat or use the bathroom unsupervised. You cant just choose whatever you want to eat. \n\nAlso, the whole “skinny-white-girl-with-AN” stereotype really pisses me off, because it pushes the idea that you only have AN/youre sick enough only if youre skinny, which is NOT true.",
          "created_utc": 1736531488.0
        },
        {
          "id": "m6fwzqq",
          "author": "WhoHasntGivenUpYet",
          "body": "I’m in a really good residential center and while you do have to follow a meal plan, but you have a lot of say regarding what foods are on your meal plan (eg. I have Starbucks coffee) and they aren’t insanely strict/vigilant (it’s absolutely possible to cheat quite easily), and you can always use the bathroom alone, plus you aren’t bag checked so it’s very easy to bring anything. There are repercussions if you don’t gain weight, and if it gets too dangerous you’re sent to a closed facility, but the system generally works. I agree though to the bone is such bad rep",
          "created_utc": 1736533040.0
        }
      ]
    },
    {
      "id": "m6jbk9a",
      "author": "rodricksimp",
      "body": "I completely agree with you. Also I don’t understand saying he had “no reason to starve” what does that even mean?",
      "created_utc": 1736574474.0,
      "score": 8,
      "context": [
        {
          "id": "m6htdxk",
          "author": "Character_Quote_6889",
          "body": "charlie from heartstopper his ed is very badly written\nhe has literally 0 reason to starve he just does 😭 it pisses me off",
          "created_utc": 1736553936.0
        },
        {
          "id": "m6ie3zr",
          "author": "ManILoveFrogs69420",
          "body": "As a counter argument, they have it being a symptom of OCD which was the broader mental illness he was dealing with. I think it was well written when you view it through the eyes of OCD. Plus the fact that they depicted a young man with an ED with different reasons and motivations.",
          "created_utc": 1736560987.0
        }
      ]
    },
    {
      "id": "m6h7qw5",
      "author": "BrowncoatIona",
      "body": "That was why I put it in quotation marks. Not only can you not become underweight in a healthy way, but it is doubly dangerous for someone with a history of EDs. It was so fucked up for them to claim otherwise. \n\nI wasn't meaning to imply there is a healthy way to become underweight because ofc there isn't, just highlighting that added layer. \n\nIt's especially upsetting because they should have known better **and** they had greater responsibility to *not* spread misinformation like that considering the topic of their film.",
      "created_utc": 1736546803.0,
      "score": 8,
      "context": [
        {
          "id": "m6db33m",
          "author": "vivi_roblox",
          "body": "To the bone kind of romanticized it a bit, and made it seem like a messy sad girl life instead of a girl struggling with anorexia.",
          "created_utc": 1736494566.0
        },
        {
          "id": "m6div2a",
          "author": "BrowncoatIona",
          "body": "Sorry, bit of a rant here that I don't expect anyone to actually read -\n\nI always try to be cautious when discussing To the bone, because I know some people with EDs really felt seen by it and I don't want to invalidate that, but...\n\nTo the Bone really, *really* bothered me. It romanticized and infantilized AN. Created lots of thinspo to be spread around to vulnerable people in ED spaces. Had an already thin actress with a history of ED lose weight and claimed they \"did it in a healthy way\". \n\nThe RTC in the movie was a joke. And IIRC (though I definitely could be wrong) the only people who struggled with BED or bulimia were women of color, while all the AN patients were white.  \n\nThe relationship between Keanu Reeves' character and his patients/clients seemed inappropriate (which especially bummed me out because I actually think he could play a great ED therapist with the right script and directing). The romance between Luke & Ellen was unpleasant and pointless (even though that toxicity *could* have been utilized to benefit the story/character growth/etc). And how they handled the storyline of the woman who miscarried... There's so much more I could go on about but I'll stop now x . x\n\nIt just felt like so much wasted potential that resulted in a shallow film at best and an actively harmful film at worst.",
          "created_utc": 1736499417.0
        },
        {
          "id": "m6drh6y",
          "author": "Odd_Theme_3294",
          "body": "I also am not a big fan of TTB - and if I watch it it’s for the sole purpose of triggering myself.\n\nBut you cannot become underweight in a healthy way ever. Being underweight is not healthy - so intentionally getting there whether it’s for a film or other reasons, it’s still going to harm their bodies. \n\nAdditionally, like you said, that certain actors did have history of EDS - surely anything like that could trigger a massive relapse.",
          "created_utc": 1736504916.0
        }
      ]
    },
    {
      "id": "m7v9kns",
      "author": "Melodramatic-anon876",
      "body": "I am, thank you. As far as the calorie counting, I’m just relaying my personal experience. I am not obsessed with calorie counting-as I expressed my brain automatically translates food into caloric value, it did this even when I was in solid recovery for 3 years. I’m obsessed with numbers and have a very easy time retaining information-I can name off by card numbers, all my relatives numbers, fractions to decimals  etc; without a second thought. \n\nI’m not going to provide instructions on how to easily get an accurate cal count on pretty much any food, but that’s how many people with autisms brain works-categories and numbers. It’s okay that your experience is different without dismissing other people’s experience",
      "created_utc": 1737235666.0,
      "score": 1,
      "context": [
        {
          "id": "m6diryi",
          "author": "None",
          "body": "like, in to the bone, I didn't like how they made an anorexic girl a person with \"asperger syndrome with calories \" it doesn't work like that.\nYou can memorise the calories of some foods, but not ALL foods, you can't tell (without knowing the grams especially) EXACTLY how many calories a meal has, that's so so wrong and messed up\nand, in addition, anorexic people actually eat.\nthey can starve, but not for this long damn! they just eat very few, but they eat",
          "created_utc": 1736499361.0
        },
        {
          "id": "m6fswzl",
          "author": "Melodramatic-anon876",
          "body": "That scene was the only part I related to honestly, as a person with autism and a super numbers focused brain I do have the knowledge needed to calculate within 95% accuracy all foods. \n\nIt definitely wasn’t accurate as far as her sister going through the count with her but as far as the actually breaking down the calories that’s exactly what my brain does no matter how hard I try to turn it off.",
          "created_utc": 1736531871.0
        },
        {
          "id": "m6gbqse",
          "author": "None",
          "body": "I'm sorry to hear that, I really hope that u are recovering, as a person who is also obsessed with calorie counting, I often have to check on the internet/calorie counting apps to see how many calories are in my meal, I can't memorise every single food, exactly like most people with an ed",
          "created_utc": 1736537302.0
        }
      ]
    },
    {
      "id": "m6ds9ga",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1736505398.0,
      "score": 5,
      "context": [
        {
          "id": "m6djfp8",
          "author": "TimeLecture580",
          "body": "to the bone or cassie from skins, i was literally in a gc full of girls and boys suffering from ed’s and we all agreed those shows/ movies “motivated us” 🤦‍♀️",
          "created_utc": 1736499791.0
        },
        {
          "id": "m6dk9t2",
          "author": "None",
          "body": "I had the biggest relapse bc of Cassie and the protagonist of to the bone (can't remember her name sorry)",
          "created_utc": 1736500329.0
        },
        {
          "id": "m6dl4ba",
          "author": "TimeLecture580",
          "body": "same :/ i hope your healing now! ❤️‍🩹",
          "created_utc": 1736500874.0
        }
      ]
    },
    {
      "id": "m6krixs",
      "author": "WhoHasntGivenUpYet",
      "body": "We also have people not following a meal plan! Usually they test out to see if it works when you’re left to your own devices, and you only get a meal plan if it doesn’t and you aren’t gaining weight.",
      "created_utc": 1736604269.0,
      "score": 2,
      "context": [
        {
          "id": "m6frkos",
          "author": "Embarrassed_Visit277",
          "body": "To the bone. Most treatment centers, even nice residentials, would NEVER allow you to eat or use the bathroom unsupervised. You cant just choose whatever you want to eat. \n\nAlso, the whole “skinny-white-girl-with-AN” stereotype really pisses me off, because it pushes the idea that you only have AN/youre sick enough only if youre skinny, which is NOT true.",
          "created_utc": 1736531488.0
        },
        {
          "id": "m6fwzqq",
          "author": "WhoHasntGivenUpYet",
          "body": "I’m in a really good residential center and while you do have to follow a meal plan, but you have a lot of say regarding what foods are on your meal plan (eg. I have Starbucks coffee) and they aren’t insanely strict/vigilant (it’s absolutely possible to cheat quite easily), and you can always use the bathroom alone, plus you aren’t bag checked so it’s very easy to bring anything. There are repercussions if you don’t gain weight, and if it gets too dangerous you’re sent to a closed facility, but the system generally works. I agree though to the bone is such bad rep",
          "created_utc": 1736533040.0
        },
        {
          "id": "m6gn4wb",
          "author": "MisantropicSnowflake",
          "body": "I've been to inpatient treatment, where they didn't put me on a mealplan at all. I had to write down, what I ate and at what times, but I was only requiered to eat the meals provided from the hospital and we would eat lunch together with a nutritionist. They still requiered me to gain weight. If I wouldn't, they would make me have snacks. (I had still ate snacks, because I wanted to get better and gain that amount). With each week not gaining enough, the rules would get more (less time allowed outside, being supervised for meals and / or after meals, less group therapy / more individual therapy, up until bedrest). But they tried giving you trust, that you want to get better and gain weight. It was the best approach for me and helped me so much being independent in my food choices. I had to show, what I wrote about my food and we discussed that. Really miss that therapist, she is a great lady and gave me so much trust back in treatment. I'm still struggeling, but doing so so much better than before.",
          "created_utc": 1736540637.0
        }
      ]
    },
    {
      "id": "m6krd7d",
      "author": "WhoHasntGivenUpYet",
      "body": "I don’t live in the US, sorry. It’s a private facility in Europe",
      "created_utc": 1736604206.0,
      "score": 1,
      "context": [
        {
          "id": "m6frkos",
          "author": "Embarrassed_Visit277",
          "body": "To the bone. Most treatment centers, even nice residentials, would NEVER allow you to eat or use the bathroom unsupervised. You cant just choose whatever you want to eat. \n\nAlso, the whole “skinny-white-girl-with-AN” stereotype really pisses me off, because it pushes the idea that you only have AN/youre sick enough only if youre skinny, which is NOT true.",
          "created_utc": 1736531488.0
        },
        {
          "id": "m6fwzqq",
          "author": "WhoHasntGivenUpYet",
          "body": "I’m in a really good residential center and while you do have to follow a meal plan, but you have a lot of say regarding what foods are on your meal plan (eg. I have Starbucks coffee) and they aren’t insanely strict/vigilant (it’s absolutely possible to cheat quite easily), and you can always use the bathroom alone, plus you aren’t bag checked so it’s very easy to bring anything. There are repercussions if you don’t gain weight, and if it gets too dangerous you’re sent to a closed facility, but the system generally works. I agree though to the bone is such bad rep",
          "created_utc": 1736533040.0
        },
        {
          "id": "m6gemnt",
          "author": "New_Dragonfruit_592",
          "body": "Where are you? I have a friend currently looking",
          "created_utc": 1736538147.0
        }
      ]
    },
    {
      "id": "m7ecmn3",
      "author": "Embarrassed_Visit277",
      "body": "If youre in the US, center for discovery is good for those who dont need medical stabilization, as its in a house, not a hospital. They have mealplans, groups, and you’re monitored during mealtimes. They allow a LOT more than an inpatient, but if your friend is too unstable (mentally or physically), id suggest they find a nearby inpatient ED program! It all depends on location and insurance. Best of luck",
      "created_utc": 1737000845.0,
      "score": 1,
      "context": [
        {
          "id": "m6frkos",
          "author": "Embarrassed_Visit277",
          "body": "To the bone. Most treatment centers, even nice residentials, would NEVER allow you to eat or use the bathroom unsupervised. You cant just choose whatever you want to eat. \n\nAlso, the whole “skinny-white-girl-with-AN” stereotype really pisses me off, because it pushes the idea that you only have AN/youre sick enough only if youre skinny, which is NOT true.",
          "created_utc": 1736531488.0
        },
        {
          "id": "m6fwzqq",
          "author": "WhoHasntGivenUpYet",
          "body": "I’m in a really good residential center and while you do have to follow a meal plan, but you have a lot of say regarding what foods are on your meal plan (eg. I have Starbucks coffee) and they aren’t insanely strict/vigilant (it’s absolutely possible to cheat quite easily), and you can always use the bathroom alone, plus you aren’t bag checked so it’s very easy to bring anything. There are repercussions if you don’t gain weight, and if it gets too dangerous you’re sent to a closed facility, but the system generally works. I agree though to the bone is such bad rep",
          "created_utc": 1736533040.0
        },
        {
          "id": "m6gemnt",
          "author": "New_Dragonfruit_592",
          "body": "Where are you? I have a friend currently looking",
          "created_utc": 1736538147.0
        }
      ]
    },
    {
      "id": "m6hc4t1",
      "author": "Odd_Theme_3294",
      "body": "Oh no no I know you weren’t I was kind of reiterating what you said to stress the importance. But i wrote this after a long shift at work so apologies if it came across that way.\n\nFully agree with everything you said - it’s awful and I can’t believe they actually allowed it to be made.",
      "created_utc": 1736548185.0,
      "score": 5,
      "context": [
        {
          "id": "m6db33m",
          "author": "vivi_roblox",
          "body": "To the bone kind of romanticized it a bit, and made it seem like a messy sad girl life instead of a girl struggling with anorexia.",
          "created_utc": 1736494566.0
        },
        {
          "id": "m6div2a",
          "author": "BrowncoatIona",
          "body": "Sorry, bit of a rant here that I don't expect anyone to actually read -\n\nI always try to be cautious when discussing To the bone, because I know some people with EDs really felt seen by it and I don't want to invalidate that, but...\n\nTo the Bone really, *really* bothered me. It romanticized and infantilized AN. Created lots of thinspo to be spread around to vulnerable people in ED spaces. Had an already thin actress with a history of ED lose weight and claimed they \"did it in a healthy way\". \n\nThe RTC in the movie was a joke. And IIRC (though I definitely could be wrong) the only people who struggled with BED or bulimia were women of color, while all the AN patients were white.  \n\nThe relationship between Keanu Reeves' character and his patients/clients seemed inappropriate (which especially bummed me out because I actually think he could play a great ED therapist with the right script and directing). The romance between Luke & Ellen was unpleasant and pointless (even though that toxicity *could* have been utilized to benefit the story/character growth/etc). And how they handled the storyline of the woman who miscarried... There's so much more I could go on about but I'll stop now x . x\n\nIt just felt like so much wasted potential that resulted in a shallow film at best and an actively harmful film at worst.",
          "created_utc": 1736499417.0
        },
        {
          "id": "m6drh6y",
          "author": "Odd_Theme_3294",
          "body": "I also am not a big fan of TTB - and if I watch it it’s for the sole purpose of triggering myself.\n\nBut you cannot become underweight in a healthy way ever. Being underweight is not healthy - so intentionally getting there whether it’s for a film or other reasons, it’s still going to harm their bodies. \n\nAdditionally, like you said, that certain actors did have history of EDS - surely anything like that could trigger a massive relapse.",
          "created_utc": 1736504916.0
        },
        {
          "id": "m6h7qw5",
          "author": "BrowncoatIona",
          "body": "That was why I put it in quotation marks. Not only can you not become underweight in a healthy way, but it is doubly dangerous for someone with a history of EDs. It was so fucked up for them to claim otherwise. \n\nI wasn't meaning to imply there is a healthy way to become underweight because ofc there isn't, just highlighting that added layer. \n\nIt's especially upsetting because they should have known better **and** they had greater responsibility to *not* spread misinformation like that considering the topic of their film.",
          "created_utc": 1736546803.0
        }
      ]
    },
    {
      "id": "m7yaj72",
      "author": "None",
      "body": "ofc I don't wanna put down your experience honey, dont misunderstand me, I think ur calorie counting is influenced by your autism (I count calories too, I know it's difficult to stop and very painful) I am just very against stereotypes cause they just make people feel invalid and less seen",
      "created_utc": 1737275362.0,
      "score": 1,
      "context": [
        {
          "id": "m6diryi",
          "author": "None",
          "body": "like, in to the bone, I didn't like how they made an anorexic girl a person with \"asperger syndrome with calories \" it doesn't work like that.\nYou can memorise the calories of some foods, but not ALL foods, you can't tell (without knowing the grams especially) EXACTLY how many calories a meal has, that's so so wrong and messed up\nand, in addition, anorexic people actually eat.\nthey can starve, but not for this long damn! they just eat very few, but they eat",
          "created_utc": 1736499361.0
        },
        {
          "id": "m6fswzl",
          "author": "Melodramatic-anon876",
          "body": "That scene was the only part I related to honestly, as a person with autism and a super numbers focused brain I do have the knowledge needed to calculate within 95% accuracy all foods. \n\nIt definitely wasn’t accurate as far as her sister going through the count with her but as far as the actually breaking down the calories that’s exactly what my brain does no matter how hard I try to turn it off.",
          "created_utc": 1736531871.0
        },
        {
          "id": "m6gbqse",
          "author": "None",
          "body": "I'm sorry to hear that, I really hope that u are recovering, as a person who is also obsessed with calorie counting, I often have to check on the internet/calorie counting apps to see how many calories are in my meal, I can't memorise every single food, exactly like most people with an ed",
          "created_utc": 1736537302.0
        },
        {
          "id": "m7v9kns",
          "author": "Melodramatic-anon876",
          "body": "I am, thank you. As far as the calorie counting, I’m just relaying my personal experience. I am not obsessed with calorie counting-as I expressed my brain automatically translates food into caloric value, it did this even when I was in solid recovery for 3 years. I’m obsessed with numbers and have a very easy time retaining information-I can name off by card numbers, all my relatives numbers, fractions to decimals  etc; without a second thought. \n\nI’m not going to provide instructions on how to easily get an accurate cal count on pretty much any food, but that’s how many people with autisms brain works-categories and numbers. It’s okay that your experience is different without dismissing other people’s experience",
          "created_utc": 1737235666.0
        }
      ]
    },
    {
      "id": "m6fld0s",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1736529708.0,
      "score": 1,
      "context": [
        {
          "id": "m6djfp8",
          "author": "TimeLecture580",
          "body": "to the bone or cassie from skins, i was literally in a gc full of girls and boys suffering from ed’s and we all agreed those shows/ movies “motivated us” 🤦‍♀️",
          "created_utc": 1736499791.0
        },
        {
          "id": "m6dk9t2",
          "author": "None",
          "body": "I had the biggest relapse bc of Cassie and the protagonist of to the bone (can't remember her name sorry)",
          "created_utc": 1736500329.0
        },
        {
          "id": "m6dl4ba",
          "author": "TimeLecture580",
          "body": "same :/ i hope your healing now! ❤️‍🩹",
          "created_utc": 1736500874.0
        },
        {
          "id": "m6ds9ga",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736505398.0
        }
      ]
    },
    {
      "id": "m6im8xs",
      "author": "BrowncoatIona",
      "body": "For sure! Sorry if I came across as defensive, too - I didn't intend that. Tone isn't always conveyed accurately over text. I hope you have a good rest of your day c:",
      "created_utc": 1736563875.0,
      "score": 2,
      "context": [
        {
          "id": "m6db33m",
          "author": "vivi_roblox",
          "body": "To the bone kind of romanticized it a bit, and made it seem like a messy sad girl life instead of a girl struggling with anorexia.",
          "created_utc": 1736494566.0
        },
        {
          "id": "m6div2a",
          "author": "BrowncoatIona",
          "body": "Sorry, bit of a rant here that I don't expect anyone to actually read -\n\nI always try to be cautious when discussing To the bone, because I know some people with EDs really felt seen by it and I don't want to invalidate that, but...\n\nTo the Bone really, *really* bothered me. It romanticized and infantilized AN. Created lots of thinspo to be spread around to vulnerable people in ED spaces. Had an already thin actress with a history of ED lose weight and claimed they \"did it in a healthy way\". \n\nThe RTC in the movie was a joke. And IIRC (though I definitely could be wrong) the only people who struggled with BED or bulimia were women of color, while all the AN patients were white.  \n\nThe relationship between Keanu Reeves' character and his patients/clients seemed inappropriate (which especially bummed me out because I actually think he could play a great ED therapist with the right script and directing). The romance between Luke & Ellen was unpleasant and pointless (even though that toxicity *could* have been utilized to benefit the story/character growth/etc). And how they handled the storyline of the woman who miscarried... There's so much more I could go on about but I'll stop now x . x\n\nIt just felt like so much wasted potential that resulted in a shallow film at best and an actively harmful film at worst.",
          "created_utc": 1736499417.0
        },
        {
          "id": "m6drh6y",
          "author": "Odd_Theme_3294",
          "body": "I also am not a big fan of TTB - and if I watch it it’s for the sole purpose of triggering myself.\n\nBut you cannot become underweight in a healthy way ever. Being underweight is not healthy - so intentionally getting there whether it’s for a film or other reasons, it’s still going to harm their bodies. \n\nAdditionally, like you said, that certain actors did have history of EDS - surely anything like that could trigger a massive relapse.",
          "created_utc": 1736504916.0
        },
        {
          "id": "m6h7qw5",
          "author": "BrowncoatIona",
          "body": "That was why I put it in quotation marks. Not only can you not become underweight in a healthy way, but it is doubly dangerous for someone with a history of EDs. It was so fucked up for them to claim otherwise. \n\nI wasn't meaning to imply there is a healthy way to become underweight because ofc there isn't, just highlighting that added layer. \n\nIt's especially upsetting because they should have known better **and** they had greater responsibility to *not* spread misinformation like that considering the topic of their film.",
          "created_utc": 1736546803.0
        },
        {
          "id": "m6hc4t1",
          "author": "Odd_Theme_3294",
          "body": "Oh no no I know you weren’t I was kind of reiterating what you said to stress the importance. But i wrote this after a long shift at work so apologies if it came across that way.\n\nFully agree with everything you said - it’s awful and I can’t believe they actually allowed it to be made.",
          "created_utc": 1736548185.0
        }
      ]
    }
  ]
}