{
  "id": "1i2nbzy",
  "subreddit": "AnorexiaNervosa",
  "author": "BipolarSkeleton",
  "created_utc": 1737028750.0,
  "title": "Not everything is a body check!",
  "selftext": "Possible TW \n\nI have had anorexia for nearly half my life and have been in ED spaced just as long but something that’s starting to absolutely piss me off is that people with EDs can hardly exist without others (with and without EDs) commenting on them body checking or promoting \n\nSimply having pictures of yourself is not automatically body checking \nPosting a video of yourself in the summer in a tank top is not automatically body checking \nExisting as someone on the internet is not promoting anorexia \n\n\nI follow as relatively small book reviewer who has anorexia but literally never mentions it or talks about it and yet they constantly get comments about how it’s not ok for them to body check in their videos how people find it triggering because she’s promoting anorexia \n\n\nSHES A BOOK REVIEW CHANNEL AND MAINLY REVIEWS CRIME SERIES! \n\nDo people expect anyone with anorexia to shut themselves away and never interact with the public \n\nI completely agree that there are some people out there who are very blatantly body checking in their videos but it seems that it’s now turned into anyone that’s got an ED is automatically body checking just by posting a picture ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1i2nbzy/not_everything_is_a_body_check/",
  "score": 134,
  "num_comments": 8,
  "comments": [
    {
      "id": "m7fqq05",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1737028751.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m7ftl7y",
      "author": "_-ollie",
      "body": "100% agree with you, though there is a fine line between existing in a body and body checking *on social media*.",
      "created_utc": 1737030120.0,
      "score": 68,
      "context": []
    },
    {
      "id": "m7gt2bi",
      "author": "soleil-americana",
      "body": "thank you for putting this into words. having a body is not body checking. also, having an ed can easily take over your life so imo it's really cruel to force someone's ed on their hobbies without their consent. the ed itself is alienating enough, no need to turn things sour.",
      "created_utc": 1737042614.0,
      "score": 21,
      "context": []
    },
    {
      "id": "m7i4hcu",
      "author": "alienprincess111",
      "body": "Thanks for posting this. I agree with you. I actually try to make myself look less thin in pictures because I don't want people to think they are body checks.",
      "created_utc": 1737056256.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m7ig01v",
      "author": "Straight_Economist35",
      "body": "Totally agree, society seems so unconvinced by our problems they expect us to just disappear until we fully recover. Even after recovery it's difficult to do anything normal like go for a walk without being accused of engaging in dangerous ED behaviour",
      "created_utc": 1737059625.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m7g62dw",
      "author": "pythonidaae",
      "body": "Yes!!! I think when people post obvious unnecessary shots like someone having to take a picture of the plate they're gonna eat ...in their lap for some reason showing a thigh gap. That's a body check.  \n\nWhen people put like energy drink cans in their lap right on their thigh to compare sizes. \n\nSomeone taking a photo of their coffee on a table and having to hold it and show their emaciated wrists. Even though they didn't need to hold it or stretch their arm like that while holding it \n\nMirror selfie standing sideways \n\nSomeone flexing and exaggerating the visibility of certain body parts \n\nEtc\n\nSome things are just blatant\n\nOther times people are just want to take a selfie and they should still be allowed to. Or they want to make content online as that's their hobby and/or job so they need to be on camera.\n\n\nI think it's a body check when the focus is clearly the body (and the sickness of it) or it was unnecessary and random there's for some reason limbs there. \n\nA selfie shows a vibe!, an emotion!, a day, a Person, an outfit, a location, a group of people, etc. Even when you're underweight. It's a grey area when someone is showing off an outfit but I can give the benefit of the doubt. \n\nA body check is ....the body.  Sometimes the face isn't even in and it's expressionless if it is in and it's clear the person taking the photo is focusing on how they look. \n\nIt's tough and whenever I'm underweight I worry about this and the ethics of sending selfies still. I don't even post my photos online and I wonder if some rando online would call it a body check. Idk. It's a grey area for certain things and other things you just know. Someone doing their job as a book reviewer isn't doing that.",
      "created_utc": 1737035133.0,
      "score": 20,
      "context": []
    },
    {
      "id": "m7jg9fl",
      "author": "helianthus_0",
      "body": "Thank you for this. This sub especially, it seems like if you’re thin, you can’t show any part of your body without someone accusing you of body-checking. It’s annoying.",
      "created_utc": 1737070524.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m7jyoka",
      "author": "FragileInside",
      "body": "I have been so disheartened by this. Being accused of body checking when I’m just existing makes me so much more ashamed of my body",
      "created_utc": 1737076703.0,
      "score": 4,
      "context": []
    }
  ]
}