{
  "id": "1i6izi7",
  "subreddit": "AnorexiaNervosa",
  "author": "v4mpire_g1rl_09",
  "created_utc": 1737467407.0,
  "title": "Why do people call everything ana related \"promoting anorexia\"",
  "selftext": "I was just watching a tiktok with 2 girls showing their outfits with a sound of a crumbling stomach behind saying \"when your outfit ate but you didn't\" which in my opinion is just a harmless joke. But everyone was saying stuff like \"thats insane\" And \"ohh that's not..\". Like yeah it's not funny the fact that you're starving yourself but if you want to deal with it with jokes you don't harm anyone. people joke about other mental disorders all the time like for example depression but I don't see anyone saying they are \"promoting depression\".The thing is that we've come to a point that we can't even mention ana without being accused of glamorizing it. And I'm not saying all that just for the tiktok it was just an example because I've seen this happening multiple times. There's a difference between sharing your experience (whether that's in humorous way or not) and just straight up saying \"yeah you should starve yourself it totally works for me\" And blah blah blah like that. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1i6izi7/why_do_people_call_everything_ana_related/",
  "score": 112,
  "num_comments": 38,
  "comments": [
    {
      "id": "m8cid3n",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1737467408.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m8e5dbj",
      "author": "nervous_veggie",
      "body": "It makes it seem less serious, less deadly, and even desirable. Which it’s not. I joke about my illness sometimes, but with people I know and who know how shit it really is. I would not do it on social media",
      "created_utc": 1737484646.0,
      "score": 99,
      "context": []
    },
    {
      "id": "m8dp1no",
      "author": "Solal-King-Raccoon",
      "body": "While i do think those jokes are hilarious and we should obviously be able to talk about ur ED and laugh about it without it being called « promoting anorexia », i also think that when those kind of memes cross over to regular social media or are directly posted there, it can give the wrong idea to impressionable teens. I think those memes should stay in ED community where we can have a good laugh about it and nobody that isn’t already disordered can develop « ideas »",
      "created_utc": 1737480203.0,
      "score": 46,
      "context": []
    },
    {
      "id": "m8e8zge",
      "author": "4foot11",
      "body": "Anorexia has been glamorized for so long, this is like the pendulum swinging the other way. And honestly, I don't think that's a bad thing. I'm glad people reacted the way they did in those comments. It'd be more alarming if they didn't.",
      "created_utc": 1737485623.0,
      "score": 30,
      "context": []
    },
    {
      "id": "m8ezpco",
      "author": "brookleiaway",
      "body": "i am especially against tiktok ed content because tiktok shows it to random people, not people actively searching for it like tumblr",
      "created_utc": 1737492907.0,
      "score": 22,
      "context": []
    },
    {
      "id": "m8cjpcv",
      "author": "TimeLecture580",
      "body": "i don’t really know, since those kind of videos are what kept me “motivated” while i was at my lowest, like i was admired by people like that online which led me to this disorder.\n\ni also understand your perspective i just think no mental illnesses should joked about at all not just anorexia.",
      "created_utc": 1737467886.0,
      "score": 65,
      "context": []
    },
    {
      "id": "m8d4ut6",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1737474564.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m8efzpb",
      "author": "FistsOfFury77",
      "body": "ANA and MIA websites PROMOTE eating disorders. Girls and guys share diet tips, weights, measures, pictures. Theses sites are NOT for people in recovery. These sites teach the sick to get sicker.  These sites are very dangerous bc people share all kinds of ways to hide your weight, how to starve, purge, etc. The pictures are probably the most damaging.  All of this stuff is considered “thinspiration”. \n\nIf you are in RECOVERY, there are support groups, threads, etc where people share inspiration in the journey to recovery. It’s a long road and a lot of work, but it is so worth it. \n\nEVERYONE DESERVES RECOVERY!",
      "created_utc": 1737487538.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m8ezjzn",
      "author": "brookleiaway",
      "body": "the video sounds cringe",
      "created_utc": 1737492867.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m8ct8gr",
      "author": "bluekii",
      "body": "It’s a very fine and delicate line. You don’t want to normalise it because let’s be real it’s definitely not fucking normal and shouldn’t be made to be normal lmao, but you also want to find humour and relation in content so you feel less alone in your pain and struggles. I personally find a lot of ED content online to be indirectly harmful or unnecessary as it can also reinforce competitiveness and trigger others to also reach a critical point or push themselves further. Like someone can indirectly be promoting/normalising something without blatantly saying so.",
      "created_utc": 1737471072.0,
      "score": 14,
      "context": []
    },
    {
      "id": "m8exp8g",
      "author": "riooodlop",
      "body": "A lot of people on social media are quick to accuse Ana promoting when it’s genuinely not there.\n\n\n\n- A thin (not underweight) and fit woman can share her what I eat in a day and the comment section is full of people accusing her of promoting Ana because “her portions are too small!” Meanwhile she ate a very normal amount of food the food was just healthy. \n\n\n\n\n- Seems everyone is accusing people of “body checking” when in reality most of those videos where people are accusing them are OOTD’s and outfit inspirations so you’re obviously going to see their body? \n\n\n\n\n- A underweight woman (who might not have any ED) can make a video about anything on tiktok and the comments are usually “You know what you’re doing…” or “You should seek help this isn’t healthy” \n\n\n\nPeople on social media are so quick to accuse people of Ana or promoting it.",
      "created_utc": 1737492372.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m8eg493",
      "author": "Pro_Ana_Online",
      "body": "This is what happens when a community gets to be totally defined by those outside the community, let alone defined by those actively against the community and that outside/anti- definition becomes adopted by society at large.",
      "created_utc": 1737487573.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m8jpjp5",
      "author": "theskymaid",
      "body": "I think it’s hilarious and I always think that for us stuck in the trenches of this disease being able to laugh about it every once in a while is a good thing, but at the same time, in such a public forum like TikTok this might have the unintended side effect of influencing people. Idk, it’s difficult.",
      "created_utc": 1737558848.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m8cpk0z",
      "author": "Competitive-Target95",
      "body": "the “sound of a crumbling stomach” that’s horrifying",
      "created_utc": 1737469879.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m8dh1gr",
      "author": "sikkerhet",
      "body": "Because they don't want to see it. ",
      "created_utc": 1737477994.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m8cqvgy",
      "author": "tpwkluvr",
      "body": "agreed it just makes the whole feeling of having to keep it a secret worse",
      "created_utc": 1737470316.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m8kjs0p",
      "author": "No-Draw7378",
      "body": "The same joke was just posted in ED anonomemes...\n\nTalking simumtaniously about fashion looking good *and* not eating has been an ED culture thing for a while. Lotta 2000s tv and movie jokes. \n\nSometimes having an ED can skew our perspective of what's normal. This is the kind of joke that is only funny if you don't think about it, or have an ED. If I cracked a joke like this to my partner or family, they would be upset and concerned.",
      "created_utc": 1737567209.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m8mfq9n",
      "author": "pessimistic_witch",
      "body": "I feel like it’s a double edged sword because it can be bad for impressionable people but at the same time social media has me feeling like an outcast and ashamed of my illness",
      "created_utc": 1737585599.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m8s58p2",
      "author": "tinyberry02",
      "body": "i absolutely hate seeing rude comments under peoples posts who are clearly struggling. \"i just ate fast food\" or sarcastic comments like \"you look big today\". it's not something we're showing off. it's a disease, no one who suffers started with a healthy mental state. it's a trauma response for most of us. people are the nastiest to us and it just pisses me off so bad",
      "created_utc": 1737662019.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m8e2ezo",
      "author": "tigergrad77",
      "body": "I worry that if we censor it too much, no one will ever talk about it and I think that’s worse.",
      "created_utc": 1737483847.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m8cwz57",
      "author": "FantomexLive",
      "body": "A girl I know said it best. “The people telling you what is okay or not okay to joke about are the hall monitors of life. Nobody likes them so they have to make everyone else’s life miserable.” \n\nIt is weird because you are right. Certain mental disorders get promoted and praised and others get shamed. Although I’ve never felt that Ana was anything more than a phase that I go in and out of, at least for me personally.",
      "created_utc": 1737472231.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m8ctkpg",
      "author": "None",
      "body": "I think some people act horrified about these jokes just because they want something to be offended by not because it’s actually that horrible.",
      "created_utc": 1737471178.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m8d3m2g",
      "author": "PheonixRising_2071",
      "body": "Controversial opinion. But I blame Fat Activists and Health At Every Size for this. They are so loud that anything that portrays dieting in any way shape or form is so violently detrimental to society that it must be shamed and banned at all costs.",
      "created_utc": 1737474204.0,
      "score": -9,
      "context": []
    },
    {
      "id": "m8f25rn",
      "author": "Worried_Brilliant939",
      "body": "Because people hate us openly and it’s ok because we maybe irritate others’ feelings of self loathing so to hell with being socially progressive—people love to be ableist and saneist about anorexics. I see that happen in this group all the time and those hypervigilant-to-the-point-of-discriminatory attitudes mirrored by mods here.",
      "created_utc": 1737493564.0,
      "score": -4,
      "context": []
    },
    {
      "id": "m8gwlv3",
      "author": "alienprincess111",
      "body": "This!",
      "created_utc": 1737513651.0,
      "score": 9,
      "context": [
        {
          "id": "m8e5dbj",
          "author": "nervous_veggie",
          "body": "It makes it seem less serious, less deadly, and even desirable. Which it’s not. I joke about my illness sometimes, but with people I know and who know how shit it really is. I would not do it on social media",
          "created_utc": 1737484646.0
        }
      ]
    },
    {
      "id": "m93ja1j",
      "author": "v4mpire_g1rl_09",
      "body": "Well yeah it should 100% not be glamorized but taking it to the exact opposite extend and portraying anorexic people as \"villains\" And horrible people doesn't really help anyone either",
      "created_utc": 1737817125.0,
      "score": 1,
      "context": [
        {
          "id": "m8e8zge",
          "author": "4foot11",
          "body": "Anorexia has been glamorized for so long, this is like the pendulum swinging the other way. And honestly, I don't think that's a bad thing. I'm glad people reacted the way they did in those comments. It'd be more alarming if they didn't.",
          "created_utc": 1737485623.0
        }
      ]
    },
    {
      "id": "m8finjh",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 13: posting about a celebrity's health, body, or mental health history. \n\nThis isn't allowed in this community for a myriad of reasons. The greatest of which being that these kinds of conversations are usually needlessly triggering and do not really hold any supportive value in the community. Casually mentioning a celebrity by name is fine, but going into detail on their mental health or physical health is not. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1737498051.0,
      "score": 2,
      "context": [
        {
          "id": "m8d4ut6",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1737474564.0
        }
      ]
    },
    {
      "id": "m93ixyg",
      "author": "v4mpire_g1rl_09",
      "body": "Well yeah it lowkey was but the outfits were good tho",
      "created_utc": 1737817011.0,
      "score": 1,
      "context": [
        {
          "id": "m8ezjzn",
          "author": "brookleiaway",
          "body": "the video sounds cringe",
          "created_utc": 1737492867.0
        }
      ]
    },
    {
      "id": "m8cqjak",
      "author": "slyviaa",
      "body": "i think it was a typo for grumbling",
      "created_utc": 1737470206.0,
      "score": 11,
      "context": [
        {
          "id": "m8cpk0z",
          "author": "Competitive-Target95",
          "body": "the “sound of a crumbling stomach” that’s horrifying",
          "created_utc": 1737469879.0
        }
      ]
    },
    {
      "id": "m93iuuv",
      "author": "v4mpire_g1rl_09",
      "body": "Scroll",
      "created_utc": 1737816981.0,
      "score": 1,
      "context": [
        {
          "id": "m8dh1gr",
          "author": "sikkerhet",
          "body": "Because they don't want to see it. ",
          "created_utc": 1737477994.0
        }
      ]
    },
    {
      "id": "m93iknp",
      "author": "v4mpire_g1rl_09",
      "body": "For real tho why are we so demonized by the public? Like yes just because I don't feel comfortable in my body I want everyone to die of starvation that's definitely my goal in life",
      "created_utc": 1737816885.0,
      "score": 1,
      "context": [
        {
          "id": "m8s58p2",
          "author": "tinyberry02",
          "body": "i absolutely hate seeing rude comments under peoples posts who are clearly struggling. \"i just ate fast food\" or sarcastic comments like \"you look big today\". it's not something we're showing off. it's a disease, no one who suffers started with a healthy mental state. it's a trauma response for most of us. people are the nastiest to us and it just pisses me off so bad",
          "created_utc": 1737662019.0
        }
      ]
    },
    {
      "id": "m8eix61",
      "author": "Pro_Ana_Online",
      "body": "It's already been censored to the maximum extent possible and thus only bits and pieces divorced from *any* tie to eating disorders and mental health continue to find expression (fitchecks, what I eat in a day, eugenia cooney, etc.).\n\nWhen mentioning/talking/existing with an eating disorder = promoting = banned, then talking about it doesn't happen and one is left when the \"glamour\" and nothing else.",
      "created_utc": 1737488332.0,
      "score": 1,
      "context": [
        {
          "id": "m8e2ezo",
          "author": "tigergrad77",
          "body": "I worry that if we censor it too much, no one will ever talk about it and I think that’s worse.",
          "created_utc": 1737483847.0
        }
      ]
    },
    {
      "id": "m93imnf",
      "author": "v4mpire_g1rl_09",
      "body": "Exactly thank you",
      "created_utc": 1737816904.0,
      "score": 2,
      "context": [
        {
          "id": "m8f25rn",
          "author": "Worried_Brilliant939",
          "body": "Because people hate us openly and it’s ok because we maybe irritate others’ feelings of self loathing so to hell with being socially progressive—people love to be ableist and saneist about anorexics. I see that happen in this group all the time and those hypervigilant-to-the-point-of-discriminatory attitudes mirrored by mods here.",
          "created_utc": 1737493564.0
        }
      ]
    },
    {
      "id": "m9cf4kz",
      "author": "4foot11",
      "body": "She wasn't portrayed as a villain or a horrible person though... At least from what I can tell in your description because I haven't seen the video or comments myself. People just reacted like that because it's a grim joke...",
      "created_utc": 1737929657.0,
      "score": 1,
      "context": [
        {
          "id": "m8e8zge",
          "author": "4foot11",
          "body": "Anorexia has been glamorized for so long, this is like the pendulum swinging the other way. And honestly, I don't think that's a bad thing. I'm glad people reacted the way they did in those comments. It'd be more alarming if they didn't.",
          "created_utc": 1737485623.0
        },
        {
          "id": "m93ja1j",
          "author": "v4mpire_g1rl_09",
          "body": "Well yeah it should 100% not be glamorized but taking it to the exact opposite extend and portraying anorexic people as \"villains\" And horrible people doesn't really help anyone either",
          "created_utc": 1737817125.0
        }
      ]
    },
    {
      "id": "m8d31mi",
      "author": "Competitive-Target95",
      "body": "i like how frightening it sounds, as if it’s caving in.",
      "created_utc": 1737474039.0,
      "score": 7,
      "context": [
        {
          "id": "m8cpk0z",
          "author": "Competitive-Target95",
          "body": "the “sound of a crumbling stomach” that’s horrifying",
          "created_utc": 1737469879.0
        },
        {
          "id": "m8cqjak",
          "author": "slyviaa",
          "body": "i think it was a typo for grumbling",
          "created_utc": 1737470206.0
        }
      ]
    },
    {
      "id": "m97utt4",
      "author": "sikkerhet",
      "body": "good advice! you should tell everyone!",
      "created_utc": 1737866987.0,
      "score": 2,
      "context": [
        {
          "id": "m8dh1gr",
          "author": "sikkerhet",
          "body": "Because they don't want to see it. ",
          "created_utc": 1737477994.0
        },
        {
          "id": "m93iuuv",
          "author": "v4mpire_g1rl_09",
          "body": "Scroll",
          "created_utc": 1737816981.0
        }
      ]
    },
    {
      "id": "m8earbc",
      "author": "WanderStrucketh",
      "body": "Poetry 😔",
      "created_utc": 1737486104.0,
      "score": 1,
      "context": [
        {
          "id": "m8cpk0z",
          "author": "Competitive-Target95",
          "body": "the “sound of a crumbling stomach” that’s horrifying",
          "created_utc": 1737469879.0
        },
        {
          "id": "m8cqjak",
          "author": "slyviaa",
          "body": "i think it was a typo for grumbling",
          "created_utc": 1737470206.0
        },
        {
          "id": "m8d31mi",
          "author": "Competitive-Target95",
          "body": "i like how frightening it sounds, as if it’s caving in.",
          "created_utc": 1737474039.0
        }
      ]
    }
  ]
}