{
  "id": "1ig61n5",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1738526287.0,
  "title": "Diagnosed with anorexia but I still eat",
  "selftext": "I have always disliked the sterotype that all anorexics don't eat. Thing is, I DO eat. I have the restrictive over exercising type. I do eat, every day. I just heavily restrict my calorie intake. No sugar, veggies are my besties, ew cheese, yay sushi. Despite eating every day, I definitely have the physical effects of malnutrition that comes with long term anorexia.\n\nEdit: some of these replies are making me mad. Just because some of you have never heard that anorexics never eat doesn't invalidate my experience hearing it. Just because some of you have never heard people say/think anorexics don't eat ever doesn't make my post pointless. I made this post to vent my frustration over poeple not understanding anorexia is a mental illness, not 'choosing/refusing not to eat' and that it's more than 'just eat something!'. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ig61n5/diagnosed_with_anorexia_but_i_still_eat/",
  "score": 208,
  "num_comments": 92,
  "comments": [
    {
      "id": "malzfds",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1738526287.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mam9hd7",
      "author": "Alternative-Rip7622",
      "body": "I eat mainly ”unhealty” tbh. Lots of carbs, sugar and snacks but I’m still in a deficit and very UW. It all comes down to cals in vs. Cals out",
      "created_utc": 1738529186.0,
      "score": 173,
      "context": []
    },
    {
      "id": "mam1ln1",
      "author": "JettReque",
      "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
      "created_utc": 1738526903.0,
      "score": 215,
      "context": []
    },
    {
      "id": "mam26sz",
      "author": "None",
      "body": "exactly anorexia, if u dont eat u will just be hospitalised or death, so the time u can only \"not eat' is very limited.  u will be surprised some of the \"sickest\"  people eat pretty normally from eye view",
      "created_utc": 1738527071.0,
      "score": 68,
      "context": []
    },
    {
      "id": "mamzvyp",
      "author": "None",
      "body": "There's also the stereotype that anorexics hate food. Some sufferers love feeding people, making food, talking about food, reading about food. Food is never not on your mind. \n\nI do hate food occasionally, but mainly I hate the fact I have to eat and the feelings that causes. But when it comes to my safe foods - I am obsessed with them, think about when I can eat them safely, plan them out accordingly and find them comforting. I know deep down that it's because I'm really hungry but I don't like to admit that to myself.",
      "created_utc": 1738537045.0,
      "score": 43,
      "context": []
    },
    {
      "id": "man6xer",
      "author": "Resident-Glove9230",
      "body": "I have anorexia and eat an amount that is considered normal daily intake, but I am UW, have ED symptoms, and it’s not enough to support my exercise habits. People are just uninformed.",
      "created_utc": 1738539298.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mam3hog",
      "author": "Lucidlove44",
      "body": "Literally have eaten frozen pizza past two days in a row and am still anorexic. The stereotypes are always so “extreme” that for so long I felt invalid (sometimes still do), but have to remind myself that it is a mental disorder that shows up in a MILLION different ways for each individual! The same goes for BED or Bulimia or ARFID or any other ED! I wish more people understood that there isn’t one specific look or rule for these disorders!",
      "created_utc": 1738527440.0,
      "score": 27,
      "context": []
    },
    {
      "id": "mam6qwb",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1738528390.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mapm1ya",
      "author": "JumpingGrace",
      "body": "I hear your experience and how difficult it is. I think k what I’m seeing within this thread is the community itself doesn’t say that, or rarely, but it’s whacko outsiders who say off hand comments like “wait you eat?” Or “you actually like food?”\n\nI have been on every spectrum of an eating disorder. Spent days on end without a calorie and have consumed enough calories for a week in one sitting. \n\nSuch a frustrating and difficult illness 😔",
      "created_utc": 1738574885.0,
      "score": 8,
      "context": []
    },
    {
      "id": "maqdb7x",
      "author": "Apprehensive_Spite97",
      "body": "Possible triggering, no numbers. \n\nYeah geard it a dozen of times. When I grew up, possibly a few years earlier than some of you in here (?) we didn't even hear that it was a 'mental disorder' when taught about it in school. We were shown photos of a severe anorexic in her twenties that had possibly had it for all her life/adulthood, she was severely malnourished (it was a miracle she was alive).\n\nI was in 6th grade and was naturally thin, but the skinniest in class. And picked on for it, by girls that was jealous and also those who were 'concerned'. We were told Anorexia Nervosa was an 'obsession with dieting and getting skinny as possible', like obsessed with it, and that it was sad because most of those who did it was already thin. Pay attention to 'did it', that's what they said. \n\nWe were also told anorexics refuse to eat, and stop eating. Which meant I wasn't one right? Because I did eat, and I wasn't as skinny as the woman in the photo.\n\nIt can be triggering when people don't understand or aren't educated. All mental illnesses suffer from stigma and people not able to understand unless they have it themselves.",
      "created_utc": 1738589032.0,
      "score": 6,
      "context": []
    },
    {
      "id": "matqhp9",
      "author": "Pale-Dragonfruit-765",
      "body": "omg i did not think the comments were going to misunderstand you so badly lol. the biggest stereotype of anorexia is someone absolutely refusing to eat, bedridden, feeding tubes, etc. any media that attempts to tackle eating disorders normally ends up playing into these stereotypes too lmao. and then it creates some kind of feedback loop where it seems we cant shift how society views ana",
      "created_utc": 1738624280.0,
      "score": 7,
      "context": []
    },
    {
      "id": "maqvkjy",
      "author": "lily_perret-",
      "body": "I know someone who suffered from anorexia without skipping a single meal,they just ate very small portions. But that doesn’t take away from the legitimacy of your diagnosis or your suffering. There isn’t just one pattern of anorexia.",
      "created_utc": 1738595323.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mas7945",
      "author": "dawnmoonbeam2000",
      "body": "i have a best friend i share p much everything with, and i used to show her my restriction meals and she’d usually say “well i’m glad you’re eating something :)”. while i understand she’s not an expert on EDs and just trying her best to be supportive, i could honestly never eat absolutely nothing at all. ive tried to do water fasts but gave up lmao. she’s a really good friend and it didn’t trigger me or anything, my point is that most ppl don’t know a lot about eds",
      "created_utc": 1738608835.0,
      "score": 5,
      "context": []
    },
    {
      "id": "masg5xj",
      "author": "NinjaSuperb7977",
      "body": "My gf made a comment about how I often eat more than some people dieting & oof, that hit fucking hard. I always feel so invalidated in myself when I eat, cos if I was good at this, I wouldn’t need to eat (giving myself side eye right now).",
      "created_utc": 1738611309.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mamjazg",
      "author": "Excellent-World-476",
      "body": "Of course you ear. I’ve never gone a day without eating something. The stereotype isn’t even a stereotype, it’s just wrong.",
      "created_utc": 1738532067.0,
      "score": 13,
      "context": []
    },
    {
      "id": "man2v4w",
      "author": "theskymaid",
      "body": "Are you looking for confirmation that your habits are anorexic or……?\n\nLike, I just don’t get the point of the post.",
      "created_utc": 1738537987.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mamknco",
      "author": "filigreeonleafndvine",
      "body": "girl im sorry but nobody thinks that. its obvious that if you dont eat then you die",
      "created_utc": 1738532457.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mao8s7n",
      "author": "-aquapixie-",
      "body": "Idk why you're getting downvoted. It's literally part of internet culture that people assume we don't eat, ever, and that anorexia = Eugenia Cooney emaciated.\n\nI've had people tell me I don't \"look\" anorexic and then check me with, \"but I've seen you eat! You finish all your lunch when we're out\"\n\nSo yes, misconceptions are super real",
      "created_utc": 1738551602.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mar1ohk",
      "author": "amski_gp",
      "body": "… all anorexic eat.  I mean some might eat zero food… on the way out if life.\n\nEveryone eats food, even anorexics.  It’s such a harmful ED stereotype to perpetuate.  \n\nThe diagnostic criteria for anorexia is other things.  ",
      "created_utc": 1738597173.0,
      "score": 5,
      "context": []
    },
    {
      "id": "map9iaw",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1738567251.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mamiug4",
      "author": "Condemned2Be",
      "body": "Hello fellow junkorexic! 👋🏻",
      "created_utc": 1738531932.0,
      "score": 84,
      "context": [
        {
          "id": "mam9hd7",
          "author": "Alternative-Rip7622",
          "body": "I eat mainly ”unhealty” tbh. Lots of carbs, sugar and snacks but I’m still in a deficit and very UW. It all comes down to cals in vs. Cals out",
          "created_utc": 1738529186.0
        }
      ]
    },
    {
      "id": "mamqtx4",
      "author": "wysteria222",
      "body": "KFC is my only safe food unfortunately and it feels so invaliding having an eating disorder while literally eating a burger every day T-T im also very UW and that's the only thing i'll have so it's still restriction but i feel like it sets me apart from many others",
      "created_utc": 1738534296.0,
      "score": 32,
      "context": [
        {
          "id": "mam9hd7",
          "author": "Alternative-Rip7622",
          "body": "I eat mainly ”unhealty” tbh. Lots of carbs, sugar and snacks but I’m still in a deficit and very UW. It all comes down to cals in vs. Cals out",
          "created_utc": 1738529186.0
        }
      ]
    },
    {
      "id": "mamlu3c",
      "author": "solardetect",
      "body": "me too",
      "created_utc": 1738532805.0,
      "score": 9,
      "context": [
        {
          "id": "mam9hd7",
          "author": "Alternative-Rip7622",
          "body": "I eat mainly ”unhealty” tbh. Lots of carbs, sugar and snacks but I’m still in a deficit and very UW. It all comes down to cals in vs. Cals out",
          "created_utc": 1738529186.0
        }
      ]
    },
    {
      "id": "mam29or",
      "author": "None",
      "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
      "created_utc": 1738527093.0,
      "score": -58,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        }
      ]
    },
    {
      "id": "mam2k5t",
      "author": "None",
      "body": "and don't forget the \"you don't LOOK anorexic!\" -\\_-",
      "created_utc": 1738527176.0,
      "score": 14,
      "context": [
        {
          "id": "mam26sz",
          "author": "None",
          "body": "exactly anorexia, if u dont eat u will just be hospitalised or death, so the time u can only \"not eat' is very limited.  u will be surprised some of the \"sickest\"  people eat pretty normally from eye view",
          "created_utc": 1738527071.0
        }
      ]
    },
    {
      "id": "man7gtr",
      "author": "Rhyme_orange_",
      "body": "Agreed. I feel in control of my anxiety when I’m restricting. It’s like the only thing I feel I’m good at lately. Maybe too good at…",
      "created_utc": 1738539474.0,
      "score": 5,
      "context": [
        {
          "id": "mamzvyp",
          "author": "None",
          "body": "There's also the stereotype that anorexics hate food. Some sufferers love feeding people, making food, talking about food, reading about food. Food is never not on your mind. \n\nI do hate food occasionally, but mainly I hate the fact I have to eat and the feelings that causes. But when it comes to my safe foods - I am obsessed with them, think about when I can eat them safely, plan them out accordingly and find them comforting. I know deep down that it's because I'm really hungry but I don't like to admit that to myself.",
          "created_utc": 1738537045.0
        }
      ]
    },
    {
      "id": "manzxc1",
      "author": "None",
      "body": ">*There's also the stereotype that anorexics hate food.*\n\nThat's not what I said. I said there's a misconception that anorexics don't eat ever. Where I'm from people think anorexics= never eating.",
      "created_utc": 1738548680.0,
      "score": 0,
      "context": [
        {
          "id": "mamzvyp",
          "author": "None",
          "body": "There's also the stereotype that anorexics hate food. Some sufferers love feeding people, making food, talking about food, reading about food. Food is never not on your mind. \n\nI do hate food occasionally, but mainly I hate the fact I have to eat and the feelings that causes. But when it comes to my safe foods - I am obsessed with them, think about when I can eat them safely, plan them out accordingly and find them comforting. I know deep down that it's because I'm really hungry but I don't like to admit that to myself.",
          "created_utc": 1738537045.0
        }
      ]
    },
    {
      "id": "masujm1",
      "author": "Bitter-Major-5595",
      "body": "Meanwhile, I drastically restrict, exercise, & have even purged; while my weight loss has halted (keeping me @ the low end of “normal” for BMI). People do not understand AN is not a “one size fits all” *mental illness* & mental torment & body dysmorphia are factors. Sadly, the general public will not educate themselves, until it affects them or someone they care about.",
      "created_utc": 1738615289.0,
      "score": 5,
      "context": [
        {
          "id": "man6xer",
          "author": "Resident-Glove9230",
          "body": "I have anorexia and eat an amount that is considered normal daily intake, but I am UW, have ED symptoms, and it’s not enough to support my exercise habits. People are just uninformed.",
          "created_utc": 1738539298.0
        }
      ]
    },
    {
      "id": "mam4one",
      "author": "None",
      "body": "This!  \n  \n...and people saying I can't possibly have anorexia because I don't look like \"those people on tv\". Those people on TV with anorexia are very extreme, NEAR DEATH cases.",
      "created_utc": 1738527788.0,
      "score": 15,
      "context": [
        {
          "id": "mam3hog",
          "author": "Lucidlove44",
          "body": "Literally have eaten frozen pizza past two days in a row and am still anorexic. The stereotypes are always so “extreme” that for so long I felt invalid (sometimes still do), but have to remind myself that it is a mental disorder that shows up in a MILLION different ways for each individual! The same goes for BED or Bulimia or ARFID or any other ED! I wish more people understood that there isn’t one specific look or rule for these disorders!",
          "created_utc": 1738527440.0
        }
      ]
    },
    {
      "id": "mamyh42",
      "author": "KateSommer",
      "body": "I think you’re over, estimating the intelligence of most people",
      "created_utc": 1738536611.0,
      "score": 9,
      "context": [
        {
          "id": "mam6qwb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738528390.0
        }
      ]
    },
    {
      "id": "manceiq",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1738541063.0,
      "score": 3,
      "context": [
        {
          "id": "mam6qwb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738528390.0
        }
      ]
    },
    {
      "id": "mancgec",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1738541081.0,
      "score": 1,
      "context": [
        {
          "id": "mam6qwb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738528390.0
        }
      ]
    },
    {
      "id": "mapoilf",
      "author": "None",
      "body": "I know the community and those with anorexia do NOT say that. I was talking about people who have never experienced it or know someone with it. People who think they are experts because they \"saw  that on TV once\". It is a frustrating and difficult ilness.",
      "created_utc": 1738576426.0,
      "score": 2,
      "context": [
        {
          "id": "mapm1ya",
          "author": "JumpingGrace",
          "body": "I hear your experience and how difficult it is. I think k what I’m seeing within this thread is the community itself doesn’t say that, or rarely, but it’s whacko outsiders who say off hand comments like “wait you eat?” Or “you actually like food?”\n\nI have been on every spectrum of an eating disorder. Spent days on end without a calorie and have consumed enough calories for a week in one sitting. \n\nSuch a frustrating and difficult illness 😔",
          "created_utc": 1738574885.0
        }
      ]
    },
    {
      "id": "marfgcz",
      "author": "neopronoun_dropper",
      "body": "I decided to take home my great-grandmother’s copy of the “American Medical Association Family Medical Guide” copyright 1982 from when she was moving out of her duplex and into a nursing home. On page 710 it discusses anorexia nervosa. It’s ridiculous the way they thought of it back then. At this time, they actually were blaming the mother as the reason for the disease. ",
      "created_utc": 1738601119.0,
      "score": 4,
      "context": [
        {
          "id": "maqdb7x",
          "author": "Apprehensive_Spite97",
          "body": "Possible triggering, no numbers. \n\nYeah geard it a dozen of times. When I grew up, possibly a few years earlier than some of you in here (?) we didn't even hear that it was a 'mental disorder' when taught about it in school. We were shown photos of a severe anorexic in her twenties that had possibly had it for all her life/adulthood, she was severely malnourished (it was a miracle she was alive).\n\nI was in 6th grade and was naturally thin, but the skinniest in class. And picked on for it, by girls that was jealous and also those who were 'concerned'. We were told Anorexia Nervosa was an 'obsession with dieting and getting skinny as possible', like obsessed with it, and that it was sad because most of those who did it was already thin. Pay attention to 'did it', that's what they said. \n\nWe were also told anorexics refuse to eat, and stop eating. Which meant I wasn't one right? Because I did eat, and I wasn't as skinny as the woman in the photo.\n\nIt can be triggering when people don't understand or aren't educated. All mental illnesses suffer from stigma and people not able to understand unless they have it themselves.",
          "created_utc": 1738589032.0
        }
      ]
    },
    {
      "id": "maqk4v3",
      "author": "None",
      "body": "I had no idea they even \"taught\" about anorexia in school! That's certainly something I never learned about. I don't remember how I heard about anorexia....",
      "created_utc": 1738591522.0,
      "score": 2,
      "context": [
        {
          "id": "maqdb7x",
          "author": "Apprehensive_Spite97",
          "body": "Possible triggering, no numbers. \n\nYeah geard it a dozen of times. When I grew up, possibly a few years earlier than some of you in here (?) we didn't even hear that it was a 'mental disorder' when taught about it in school. We were shown photos of a severe anorexic in her twenties that had possibly had it for all her life/adulthood, she was severely malnourished (it was a miracle she was alive).\n\nI was in 6th grade and was naturally thin, but the skinniest in class. And picked on for it, by girls that was jealous and also those who were 'concerned'. We were told Anorexia Nervosa was an 'obsession with dieting and getting skinny as possible', like obsessed with it, and that it was sad because most of those who did it was already thin. Pay attention to 'did it', that's what they said. \n\nWe were also told anorexics refuse to eat, and stop eating. Which meant I wasn't one right? Because I did eat, and I wasn't as skinny as the woman in the photo.\n\nIt can be triggering when people don't understand or aren't educated. All mental illnesses suffer from stigma and people not able to understand unless they have it themselves.",
          "created_utc": 1738589032.0
        }
      ]
    },
    {
      "id": "maqwxoh",
      "author": "None",
      "body": ">*I know someone who suffered from anorexia without skipping a single meal,they just ate very small portions.*\n\nThis describes me perfectly.  Apparently according to people in my life I couldn't possibly have anorexia because I eat.",
      "created_utc": 1738595745.0,
      "score": 4,
      "context": [
        {
          "id": "maqvkjy",
          "author": "lily_perret-",
          "body": "I know someone who suffered from anorexia without skipping a single meal,they just ate very small portions. But that doesn’t take away from the legitimacy of your diagnosis or your suffering. There isn’t just one pattern of anorexia.",
          "created_utc": 1738595323.0
        }
      ]
    },
    {
      "id": "me8hzoi",
      "author": "Brownie-Boi",
      "body": "Someone you say?",
      "created_utc": 1740260397.0,
      "score": 1,
      "context": [
        {
          "id": "maqvkjy",
          "author": "lily_perret-",
          "body": "I know someone who suffered from anorexia without skipping a single meal,they just ate very small portions. But that doesn’t take away from the legitimacy of your diagnosis or your suffering. There isn’t just one pattern of anorexia.",
          "created_utc": 1738595323.0
        }
      ]
    },
    {
      "id": "matsaxb",
      "author": "None",
      "body": ">*“well i’m glad you’re eating something :)”*\n\nThis is ***exactly*** what my yodeling buddy said when we went out to lunch together.  He did apologize for it.",
      "created_utc": 1738624827.0,
      "score": 3,
      "context": [
        {
          "id": "mas7945",
          "author": "dawnmoonbeam2000",
          "body": "i have a best friend i share p much everything with, and i used to show her my restriction meals and she’d usually say “well i’m glad you’re eating something :)”. while i understand she’s not an expert on EDs and just trying her best to be supportive, i could honestly never eat absolutely nothing at all. ive tried to do water fasts but gave up lmao. she’s a really good friend and it didn’t trigger me or anything, my point is that most ppl don’t know a lot about eds",
          "created_utc": 1738608835.0
        }
      ]
    },
    {
      "id": "md59jfx",
      "author": "smooth-operator411",
      "body": "what should someone say in that situation?",
      "created_utc": 1739743305.0,
      "score": 1,
      "context": [
        {
          "id": "mas7945",
          "author": "dawnmoonbeam2000",
          "body": "i have a best friend i share p much everything with, and i used to show her my restriction meals and she’d usually say “well i’m glad you’re eating something :)”. while i understand she’s not an expert on EDs and just trying her best to be supportive, i could honestly never eat absolutely nothing at all. ive tried to do water fasts but gave up lmao. she’s a really good friend and it didn’t trigger me or anything, my point is that most ppl don’t know a lot about eds",
          "created_utc": 1738608835.0
        }
      ]
    },
    {
      "id": "manz2v5",
      "author": "None",
      "body": "Then don't read or reply. I'm allowed to post and contribute as much as anyone else.",
      "created_utc": 1738548404.0,
      "score": 8,
      "context": [
        {
          "id": "man2v4w",
          "author": "theskymaid",
          "body": "Are you looking for confirmation that your habits are anorexic or……?\n\nLike, I just don’t get the point of the post.",
          "created_utc": 1738537987.0
        }
      ]
    },
    {
      "id": "man58e9",
      "author": "SparkleFrog_thelil",
      "body": "Exactly. \n\nNobody ever said anorexic people don’t eat.",
      "created_utc": 1738538750.0,
      "score": 11,
      "context": [
        {
          "id": "man2v4w",
          "author": "theskymaid",
          "body": "Are you looking for confirmation that your habits are anorexic or……?\n\nLike, I just don’t get the point of the post.",
          "created_utc": 1738537987.0
        }
      ]
    },
    {
      "id": "mammsfb",
      "author": "livv3ss",
      "body": "Ofc ppl w anorexia eat, but there's the stereotype that they all starve themselves or go long periods without food for long times. Which is true for some, but not all.",
      "created_utc": 1738533086.0,
      "score": 22,
      "context": [
        {
          "id": "mamknco",
          "author": "filigreeonleafndvine",
          "body": "girl im sorry but nobody thinks that. its obvious that if you dont eat then you die",
          "created_utc": 1738532457.0
        }
      ]
    },
    {
      "id": "mao9d36",
      "author": "-aquapixie-",
      "body": "Literally heaps of people think that. I've actively had people tell me they don't believe I'm anorexic because I eat in front of them",
      "created_utc": 1738551795.0,
      "score": 10,
      "context": [
        {
          "id": "mamknco",
          "author": "filigreeonleafndvine",
          "body": "girl im sorry but nobody thinks that. its obvious that if you dont eat then you die",
          "created_utc": 1738532457.0
        }
      ]
    },
    {
      "id": "mao0nix",
      "author": "None",
      "body": "Just because you've never heard that doesn't mean it doesn't happen.",
      "created_utc": 1738548920.0,
      "score": 7,
      "context": [
        {
          "id": "mamknco",
          "author": "filigreeonleafndvine",
          "body": "girl im sorry but nobody thinks that. its obvious that if you dont eat then you die",
          "created_utc": 1738532457.0
        }
      ]
    },
    {
      "id": "maoaxnz",
      "author": "None",
      "body": "I don't get compared to Eugenia but I do get compared to Karen Carpenter when I share my diagnosis. \"You know, Karen Carpenter died from anorexia.\" Is what I've heard a few times.\n\n\n!!!!\n\nThe first time I told a trusted friend I had anorexia he said \"you don't have an eating disorder, I've seen you eat!\" I put him in his place!",
      "created_utc": 1738552324.0,
      "score": 6,
      "context": [
        {
          "id": "mao8s7n",
          "author": "-aquapixie-",
          "body": "Idk why you're getting downvoted. It's literally part of internet culture that people assume we don't eat, ever, and that anorexia = Eugenia Cooney emaciated.\n\nI've had people tell me I don't \"look\" anorexic and then check me with, \"but I've seen you eat! You finish all your lunch when we're out\"\n\nSo yes, misconceptions are super real",
          "created_utc": 1738551602.0
        }
      ]
    },
    {
      "id": "mar3x72",
      "author": "None",
      "body": "I wish the people in my life telling me that anorexia meant you don't eat understood that!",
      "created_utc": 1738597832.0,
      "score": 2,
      "context": [
        {
          "id": "mar1ohk",
          "author": "amski_gp",
          "body": "… all anorexic eat.  I mean some might eat zero food… on the way out if life.\n\nEveryone eats food, even anorexics.  It’s such a harmful ED stereotype to perpetuate.  \n\nThe diagnostic criteria for anorexia is other things.  ",
          "created_utc": 1738597173.0
        }
      ]
    },
    {
      "id": "mapaksc",
      "author": "None",
      "body": ">*We can’t believe your words here.* \n\n???\n\nMy words are my experiences and what people think anorexia is where I live. The fact that people where I live and those I talk too about anorexia think it is where you don't eat at all tells me they don't understand what it is. \"*you don't have an eating disorder, I've seen you eat!*\"  is a very clear response of what the person who told me this thinks anorexia is. \n\nInvalidating my experiences isn't productive.",
      "created_utc": 1738567853.0,
      "score": 3,
      "context": [
        {
          "id": "map9iaw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738567251.0
        }
      ]
    },
    {
      "id": "mapexjg",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1738570419.0,
      "score": 1,
      "context": [
        {
          "id": "map9iaw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738567251.0
        }
      ]
    },
    {
      "id": "manc2u0",
      "author": "asexualdruid",
      "body": "My omad is a daily bowl of mr noodles spicy chicken and then nada. Its not about what you eat, its about how much you eat, why you eat so little, and how that affects your mind and body",
      "created_utc": 1738540958.0,
      "score": 27,
      "context": [
        {
          "id": "mam9hd7",
          "author": "Alternative-Rip7622",
          "body": "I eat mainly ”unhealty” tbh. Lots of carbs, sugar and snacks but I’m still in a deficit and very UW. It all comes down to cals in vs. Cals out",
          "created_utc": 1738529186.0
        },
        {
          "id": "mamqtx4",
          "author": "wysteria222",
          "body": "KFC is my only safe food unfortunately and it feels so invaliding having an eating disorder while literally eating a burger every day T-T im also very UW and that's the only thing i'll have so it's still restriction but i feel like it sets me apart from many others",
          "created_utc": 1738534296.0
        }
      ]
    },
    {
      "id": "man2i4n",
      "author": "Alternative-Rip7622",
      "body": "I feel u, but there is no ”ana-food”",
      "created_utc": 1738537872.0,
      "score": 10,
      "context": [
        {
          "id": "mam9hd7",
          "author": "Alternative-Rip7622",
          "body": "I eat mainly ”unhealty” tbh. Lots of carbs, sugar and snacks but I’m still in a deficit and very UW. It all comes down to cals in vs. Cals out",
          "created_utc": 1738529186.0
        },
        {
          "id": "mamqtx4",
          "author": "wysteria222",
          "body": "KFC is my only safe food unfortunately and it feels so invaliding having an eating disorder while literally eating a burger every day T-T im also very UW and that's the only thing i'll have so it's still restriction but i feel like it sets me apart from many others",
          "created_utc": 1738534296.0
        }
      ]
    },
    {
      "id": "mao0w0d",
      "author": "None",
      "body": "Olive Garden is mine T\\_\\_T",
      "created_utc": 1738548998.0,
      "score": 6,
      "context": [
        {
          "id": "mam9hd7",
          "author": "Alternative-Rip7622",
          "body": "I eat mainly ”unhealty” tbh. Lots of carbs, sugar and snacks but I’m still in a deficit and very UW. It all comes down to cals in vs. Cals out",
          "created_utc": 1738529186.0
        },
        {
          "id": "mamqtx4",
          "author": "wysteria222",
          "body": "KFC is my only safe food unfortunately and it feels so invaliding having an eating disorder while literally eating a burger every day T-T im also very UW and that's the only thing i'll have so it's still restriction but i feel like it sets me apart from many others",
          "created_utc": 1738534296.0
        }
      ]
    },
    {
      "id": "mamqpg8",
      "author": "nervous_veggie",
      "body": "Presumably anyone who says that is a total idiot/ isn’t thinking or understanding what that actually means",
      "created_utc": 1738534258.0,
      "score": 42,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        }
      ]
    },
    {
      "id": "manbmhx",
      "author": "PheonixRising_2071",
      "body": "This. I’ve actually had a coworker say “ohh good you’re eating. I thought you had a disorder or something”\n\nLike ma’am. Of course I eat. I just don’t eat enough. There’s a difference.",
      "created_utc": 1738540811.0,
      "score": 30,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        }
      ]
    },
    {
      "id": "man764e",
      "author": "wistfulensifer",
      "body": "I’ve heard this as well. For some reason, there are ignorant people who assume that a lot of us never eat and somehow stay alive. I’m sorry you got downvoted for sharing your legitimate experience. Just because other people haven’t seen it happen, doesn’t mean it hasn’t happened.",
      "created_utc": 1738539377.0,
      "score": 43,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        }
      ]
    },
    {
      "id": "mam2jgb",
      "author": "JettReque",
      "body": "Never heard of this, also 20+ years",
      "created_utc": 1738527170.0,
      "score": 68,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        }
      ]
    },
    {
      "id": "mawc89j",
      "author": "Ok_Victory_2977",
      "body": "dw I have totally heard this numerous times \"oh i thought u didn't eat\" \"oh ur eating something, are u better now then, that's great\" etc etc icl and say there's times, many times, I've used these people's complete ignorance to my advantage and let them think coz I'm eating I'm obviously recovered/recovering... But idk if it's maybe that younger sufferers haven't had to deal with so much ignorance of non sufferers, as people are more aware now? But as someone else who has also suffered for almost 2 decades also, I have heard this \"anorexics never eat\" or only eat 1 lettuce leaf a day bs, more times than I could possibly count xx 💜",
      "created_utc": 1738662701.0,
      "score": 3,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        }
      ]
    },
    {
      "id": "mavns0i",
      "author": "AdditionalCopy2435",
      "body": "i’m sorry people are hating. i’ve heard that before too when i relapsed as an adult. \n\ni ate VERY low calorie but still 2-3 meals a day (most of it was “water foods” ie cucumber, celery, etc.) but because i was eating everybody, praised me and my weight loss (unlike when i was younger and did attempt to eat just about nothing daily) they praised me up and down to the point i began to think my eating wasn’t restrictive but healthy! …until the weight loss continued and quickly to the point my illness was obvious yet i didn’t even notice because of how much praise i was getting for looking so “lean and healthy” so when those around me realized i looked unhealthy, i still saw this “lean, healthy” body that was achieved by “healthy eating & pilates” which would be great!… if i was actually eating a healthy amount.\n\ni’d argue it was actually more significant of a problem than before even though i was eating more because it was more sustainable yet the weight kept shedding off.\n\nfunny enough, i gained the weight back in recovery and when i felt ready to achieve a figure i could be proud of in a healthy way and actually feel alive and happy (true happiness not that dopamine boost from a good body check or weigh in), i achieved a similar looking figure (not at the worst point of course but when the praise was constant) by working out and fueling my body the right way! enough calories not just to sustain but burn without endangering my health so a good amount!! more than “recommended”. \n\ni may see a bigger number on the scale but frankly i look so much more desirable now than i ever did then and not just by my partner or friends or family (them too though!) but most importantly myself. i look alive, i have real sustainable energy, i have a reason to smile every day and have finally reached food freedom. \n\nit does get better and don’t let anyone tell you that you “eat too much” to be anorexic as that is certainly not true, i hope you get to the point where the calories don’t matter, only fuel matters and food=fuel :)\n\n(i know that was really long!! sorry! i tried to break it up a bit to be less overwhelming haha)",
      "created_utc": 1738648493.0,
      "score": 3,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        }
      ]
    },
    {
      "id": "mannz25",
      "author": "Shuyuya",
      "body": "I’ve heard that too",
      "created_utc": 1738544818.0,
      "score": 6,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        }
      ]
    },
    {
      "id": "maqdvca",
      "author": "Apprehensive_Spite97",
      "body": "I think those downvoting is in another age segment than you and me. Before downvoting read my reply if you will.",
      "created_utc": 1738589246.0,
      "score": 1,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        }
      ]
    },
    {
      "id": "maxfk5d",
      "author": "MacaroonMelodic4048",
      "body": "That statement is not true. It’s a stereotype👍🏻",
      "created_utc": 1738680174.0,
      "score": 0,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        }
      ]
    },
    {
      "id": "mapeodj",
      "author": "None",
      "body": "huh",
      "created_utc": 1738570266.0,
      "score": -1,
      "context": [
        {
          "id": "mam26sz",
          "author": "None",
          "body": "exactly anorexia, if u dont eat u will just be hospitalised or death, so the time u can only \"not eat' is very limited.  u will be surprised some of the \"sickest\"  people eat pretty normally from eye view",
          "created_utc": 1738527071.0
        },
        {
          "id": "mam2k5t",
          "author": "None",
          "body": "and don't forget the \"you don't LOOK anorexic!\" -\\_-",
          "created_utc": 1738527176.0
        }
      ]
    },
    {
      "id": "man8yts",
      "author": "None",
      "body": "Imagine if we pulled all this willpower and control into something else...we could rule the world!",
      "created_utc": 1738539957.0,
      "score": 7,
      "context": [
        {
          "id": "mamzvyp",
          "author": "None",
          "body": "There's also the stereotype that anorexics hate food. Some sufferers love feeding people, making food, talking about food, reading about food. Food is never not on your mind. \n\nI do hate food occasionally, but mainly I hate the fact I have to eat and the feelings that causes. But when it comes to my safe foods - I am obsessed with them, think about when I can eat them safely, plan them out accordingly and find them comforting. I know deep down that it's because I'm really hungry but I don't like to admit that to myself.",
          "created_utc": 1738537045.0
        },
        {
          "id": "man7gtr",
          "author": "Rhyme_orange_",
          "body": "Agreed. I feel in control of my anxiety when I’m restricting. It’s like the only thing I feel I’m good at lately. Maybe too good at…",
          "created_utc": 1738539474.0
        }
      ]
    },
    {
      "id": "maod0ia",
      "author": "None",
      "body": "I wasn't disagreeing with you, just adding another take to misconceptions about the illness, sorry!",
      "created_utc": 1738553035.0,
      "score": 13,
      "context": [
        {
          "id": "mamzvyp",
          "author": "None",
          "body": "There's also the stereotype that anorexics hate food. Some sufferers love feeding people, making food, talking about food, reading about food. Food is never not on your mind. \n\nI do hate food occasionally, but mainly I hate the fact I have to eat and the feelings that causes. But when it comes to my safe foods - I am obsessed with them, think about when I can eat them safely, plan them out accordingly and find them comforting. I know deep down that it's because I'm really hungry but I don't like to admit that to myself.",
          "created_utc": 1738537045.0
        },
        {
          "id": "manzxc1",
          "author": "None",
          "body": ">*There's also the stereotype that anorexics hate food.*\n\nThat's not what I said. I said there's a misconception that anorexics don't eat ever. Where I'm from people think anorexics= never eating.",
          "created_utc": 1738548680.0
        }
      ]
    },
    {
      "id": "maod39h",
      "author": "neopronoun_dropper",
      "body": "This just adds to the conversation. It’s weird to say that in this context.",
      "created_utc": 1738553061.0,
      "score": 9,
      "context": [
        {
          "id": "mamzvyp",
          "author": "None",
          "body": "There's also the stereotype that anorexics hate food. Some sufferers love feeding people, making food, talking about food, reading about food. Food is never not on your mind. \n\nI do hate food occasionally, but mainly I hate the fact I have to eat and the feelings that causes. But when it comes to my safe foods - I am obsessed with them, think about when I can eat them safely, plan them out accordingly and find them comforting. I know deep down that it's because I'm really hungry but I don't like to admit that to myself.",
          "created_utc": 1738537045.0
        },
        {
          "id": "manzxc1",
          "author": "None",
          "body": ">*There's also the stereotype that anorexics hate food.*\n\nThat's not what I said. I said there's a misconception that anorexics don't eat ever. Where I'm from people think anorexics= never eating.",
          "created_utc": 1738548680.0
        }
      ]
    },
    {
      "id": "mancg0l",
      "author": "Kittyquts",
      "body": "Maybe, I personally have only been told that I don’t eat enough or that I need to eat more, but nobody has ever said to me “You don’t eat.”",
      "created_utc": 1738541077.0,
      "score": 2,
      "context": [
        {
          "id": "mam6qwb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738528390.0
        },
        {
          "id": "mamyh42",
          "author": "KateSommer",
          "body": "I think you’re over, estimating the intelligence of most people",
          "created_utc": 1738536611.0
        }
      ]
    },
    {
      "id": "mao4k5i",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1738550204.0,
      "score": 1,
      "context": [
        {
          "id": "mam6qwb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738528390.0
        },
        {
          "id": "manceiq",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738541063.0
        }
      ]
    },
    {
      "id": "mar26tt",
      "author": "Apprehensive_Spite97",
      "body": "I'm from Scandinavia, that may be why it's different if you're not from here :) Also I'm not sure if it was on the curriculum or if the teacher did it as an extra lesson, I remember it was sheets and not in a book",
      "created_utc": 1738597324.0,
      "score": 3,
      "context": [
        {
          "id": "maqdb7x",
          "author": "Apprehensive_Spite97",
          "body": "Possible triggering, no numbers. \n\nYeah geard it a dozen of times. When I grew up, possibly a few years earlier than some of you in here (?) we didn't even hear that it was a 'mental disorder' when taught about it in school. We were shown photos of a severe anorexic in her twenties that had possibly had it for all her life/adulthood, she was severely malnourished (it was a miracle she was alive).\n\nI was in 6th grade and was naturally thin, but the skinniest in class. And picked on for it, by girls that was jealous and also those who were 'concerned'. We were told Anorexia Nervosa was an 'obsession with dieting and getting skinny as possible', like obsessed with it, and that it was sad because most of those who did it was already thin. Pay attention to 'did it', that's what they said. \n\nWe were also told anorexics refuse to eat, and stop eating. Which meant I wasn't one right? Because I did eat, and I wasn't as skinny as the woman in the photo.\n\nIt can be triggering when people don't understand or aren't educated. All mental illnesses suffer from stigma and people not able to understand unless they have it themselves.",
          "created_utc": 1738589032.0
        },
        {
          "id": "maqk4v3",
          "author": "None",
          "body": "I had no idea they even \"taught\" about anorexia in school! That's certainly something I never learned about. I don't remember how I heard about anorexia....",
          "created_utc": 1738591522.0
        }
      ]
    },
    {
      "id": "maqxy2l",
      "author": "lily_perret-",
      "body": "It’s so ridiculous, as if anorexia only comes down to not eating and never eating. It’s because people have this stereotype in their heads of the anorexic person, completely malnourished and on a feeding tube, when in reality, most people who suffer from anorexia are not underweight",
      "created_utc": 1738596056.0,
      "score": 4,
      "context": [
        {
          "id": "maqvkjy",
          "author": "lily_perret-",
          "body": "I know someone who suffered from anorexia without skipping a single meal,they just ate very small portions. But that doesn’t take away from the legitimacy of your diagnosis or your suffering. There isn’t just one pattern of anorexia.",
          "created_utc": 1738595323.0
        },
        {
          "id": "maqwxoh",
          "author": "None",
          "body": ">*I know someone who suffered from anorexia without skipping a single meal,they just ate very small portions.*\n\nThis describes me perfectly.  Apparently according to people in my life I couldn't possibly have anorexia because I eat.",
          "created_utc": 1738595745.0
        }
      ]
    },
    {
      "id": "manz7pn",
      "author": "None",
      "body": "That you've heard.  You don't know what people have said to me.  \n  \nI've heard it and wanted to share my experience hearing it.",
      "created_utc": 1738548448.0,
      "score": 10,
      "context": [
        {
          "id": "man2v4w",
          "author": "theskymaid",
          "body": "Are you looking for confirmation that your habits are anorexic or……?\n\nLike, I just don’t get the point of the post.",
          "created_utc": 1738537987.0
        },
        {
          "id": "man58e9",
          "author": "SparkleFrog_thelil",
          "body": "Exactly. \n\nNobody ever said anorexic people don’t eat.",
          "created_utc": 1738538750.0
        }
      ]
    },
    {
      "id": "mavoxc9",
      "author": "AdditionalCopy2435",
      "body": "i mean people definitely do. probably not others within the community but those without an ed have the wildest things to say. they just don’t get it",
      "created_utc": 1738649063.0,
      "score": 2,
      "context": [
        {
          "id": "man2v4w",
          "author": "theskymaid",
          "body": "Are you looking for confirmation that your habits are anorexic or……?\n\nLike, I just don’t get the point of the post.",
          "created_utc": 1738537987.0
        },
        {
          "id": "man58e9",
          "author": "SparkleFrog_thelil",
          "body": "Exactly. \n\nNobody ever said anorexic people don’t eat.",
          "created_utc": 1738538750.0
        }
      ]
    },
    {
      "id": "mamyt47",
      "author": "KateSommer",
      "body": "I think these days they just call it. Intermittent fasting. Anorexia seems sort of like a negative stereotype. They applied to skinny people.",
      "created_utc": 1738536714.0,
      "score": 9,
      "context": [
        {
          "id": "mamknco",
          "author": "filigreeonleafndvine",
          "body": "girl im sorry but nobody thinks that. its obvious that if you dont eat then you die",
          "created_utc": 1738532457.0
        },
        {
          "id": "mammsfb",
          "author": "livv3ss",
          "body": "Ofc ppl w anorexia eat, but there's the stereotype that they all starve themselves or go long periods without food for long times. Which is true for some, but not all.",
          "created_utc": 1738533086.0
        }
      ]
    },
    {
      "id": "maqkll9",
      "author": "Alternative-Rip7622",
      "body": "Honey u need to eat more❤️",
      "created_utc": 1738591686.0,
      "score": -6,
      "context": [
        {
          "id": "mam9hd7",
          "author": "Alternative-Rip7622",
          "body": "I eat mainly ”unhealty” tbh. Lots of carbs, sugar and snacks but I’m still in a deficit and very UW. It all comes down to cals in vs. Cals out",
          "created_utc": 1738529186.0
        },
        {
          "id": "mamqtx4",
          "author": "wysteria222",
          "body": "KFC is my only safe food unfortunately and it feels so invaliding having an eating disorder while literally eating a burger every day T-T im also very UW and that's the only thing i'll have so it's still restriction but i feel like it sets me apart from many others",
          "created_utc": 1738534296.0
        },
        {
          "id": "manc2u0",
          "author": "asexualdruid",
          "body": "My omad is a daily bowl of mr noodles spicy chicken and then nada. Its not about what you eat, its about how much you eat, why you eat so little, and how that affects your mind and body",
          "created_utc": 1738540958.0
        }
      ]
    },
    {
      "id": "mamvv5m",
      "author": "wigglywormdirt",
      "body": "they probably mean people outside of those struggling with ana, when ppl talk about it on social media they “scare” anorexic people with pictures of food since they “never eat” idk y op is getting downvoted so bad when it definitely is a common misconception among ppl",
      "created_utc": 1738535820.0,
      "score": 39,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        },
        {
          "id": "mamqpg8",
          "author": "nervous_veggie",
          "body": "Presumably anyone who says that is a total idiot/ isn’t thinking or understanding what that actually means",
          "created_utc": 1738534258.0
        }
      ]
    },
    {
      "id": "manyz53",
      "author": "None",
      "body": "I go out to lunch with a friend of mine and his wife and the first thing he said when we got our food was \"it's good to see you're eating\"....",
      "created_utc": 1738548371.0,
      "score": 9,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        },
        {
          "id": "manbmhx",
          "author": "PheonixRising_2071",
          "body": "This. I’ve actually had a coworker say “ohh good you’re eating. I thought you had a disorder or something”\n\nLike ma’am. Of course I eat. I just don’t eat enough. There’s a difference.",
          "created_utc": 1738540811.0
        }
      ]
    },
    {
      "id": "mao08wj",
      "author": "None",
      "body": "Thank you for saying this. \n\nI'm more upset some replies are flat out calling my post pointless. Why? It's not.",
      "created_utc": 1738548787.0,
      "score": 11,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        },
        {
          "id": "man764e",
          "author": "wistfulensifer",
          "body": "I’ve heard this as well. For some reason, there are ignorant people who assume that a lot of us never eat and somehow stay alive. I’m sorry you got downvoted for sharing your legitimate experience. Just because other people haven’t seen it happen, doesn’t mean it hasn’t happened.",
          "created_utc": 1738539377.0
        }
      ]
    },
    {
      "id": "mapemah",
      "author": "None",
      "body": "wdym?",
      "created_utc": 1738570232.0,
      "score": 1,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        },
        {
          "id": "mam2jgb",
          "author": "JettReque",
          "body": "Never heard of this, also 20+ years",
          "created_utc": 1738527170.0
        }
      ]
    },
    {
      "id": "mam2x39",
      "author": "None",
      "body": "okay.",
      "created_utc": 1738527277.0,
      "score": -49,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        },
        {
          "id": "mam2jgb",
          "author": "JettReque",
          "body": "Never heard of this, also 20+ years",
          "created_utc": 1738527170.0
        }
      ]
    },
    {
      "id": "mavo4lz",
      "author": "AdditionalCopy2435",
      "body": "that’s another thing people who want to invalidate you say. anorexia looks different on all but to those who are naive about it think it has one look and if you don’t fit that look, you must not struggle with it at all",
      "created_utc": 1738648665.0,
      "score": 2,
      "context": [
        {
          "id": "mam26sz",
          "author": "None",
          "body": "exactly anorexia, if u dont eat u will just be hospitalised or death, so the time u can only \"not eat' is very limited.  u will be surprised some of the \"sickest\"  people eat pretty normally from eye view",
          "created_utc": 1738527071.0
        },
        {
          "id": "mam2k5t",
          "author": "None",
          "body": "and don't forget the \"you don't LOOK anorexic!\" -\\_-",
          "created_utc": 1738527176.0
        },
        {
          "id": "mapeodj",
          "author": "None",
          "body": "huh",
          "created_utc": 1738570266.0
        }
      ]
    },
    {
      "id": "maodoqw",
      "author": "None",
      "body": "Yes yes! I added that to my edit :)",
      "created_utc": 1738553268.0,
      "score": 2,
      "context": [
        {
          "id": "mamzvyp",
          "author": "None",
          "body": "There's also the stereotype that anorexics hate food. Some sufferers love feeding people, making food, talking about food, reading about food. Food is never not on your mind. \n\nI do hate food occasionally, but mainly I hate the fact I have to eat and the feelings that causes. But when it comes to my safe foods - I am obsessed with them, think about when I can eat them safely, plan them out accordingly and find them comforting. I know deep down that it's because I'm really hungry but I don't like to admit that to myself.",
          "created_utc": 1738537045.0
        },
        {
          "id": "manzxc1",
          "author": "None",
          "body": ">*There's also the stereotype that anorexics hate food.*\n\nThat's not what I said. I said there's a misconception that anorexics don't eat ever. Where I'm from people think anorexics= never eating.",
          "created_utc": 1738548680.0
        },
        {
          "id": "maod0ia",
          "author": "None",
          "body": "I wasn't disagreeing with you, just adding another take to misconceptions about the illness, sorry!",
          "created_utc": 1738553035.0
        }
      ]
    },
    {
      "id": "maodbdj",
      "author": "None",
      "body": "The number of people in this sub for support trying to invalidate my thoughts and experiences is weird.",
      "created_utc": 1738553139.0,
      "score": 2,
      "context": [
        {
          "id": "mamzvyp",
          "author": "None",
          "body": "There's also the stereotype that anorexics hate food. Some sufferers love feeding people, making food, talking about food, reading about food. Food is never not on your mind. \n\nI do hate food occasionally, but mainly I hate the fact I have to eat and the feelings that causes. But when it comes to my safe foods - I am obsessed with them, think about when I can eat them safely, plan them out accordingly and find them comforting. I know deep down that it's because I'm really hungry but I don't like to admit that to myself.",
          "created_utc": 1738537045.0
        },
        {
          "id": "manzxc1",
          "author": "None",
          "body": ">*There's also the stereotype that anorexics hate food.*\n\nThat's not what I said. I said there's a misconception that anorexics don't eat ever. Where I'm from people think anorexics= never eating.",
          "created_utc": 1738548680.0
        },
        {
          "id": "maod39h",
          "author": "neopronoun_dropper",
          "body": "This just adds to the conversation. It’s weird to say that in this context.",
          "created_utc": 1738553061.0
        }
      ]
    },
    {
      "id": "mar4ii0",
      "author": "None",
      "body": "I think I heard about anorexia from a television show. The person was skeletalized which is  how anorexia is portrayed in the media here in the US. That's probably why many people think it means we don't eat at all.",
      "created_utc": 1738598004.0,
      "score": 2,
      "context": [
        {
          "id": "maqdb7x",
          "author": "Apprehensive_Spite97",
          "body": "Possible triggering, no numbers. \n\nYeah geard it a dozen of times. When I grew up, possibly a few years earlier than some of you in here (?) we didn't even hear that it was a 'mental disorder' when taught about it in school. We were shown photos of a severe anorexic in her twenties that had possibly had it for all her life/adulthood, she was severely malnourished (it was a miracle she was alive).\n\nI was in 6th grade and was naturally thin, but the skinniest in class. And picked on for it, by girls that was jealous and also those who were 'concerned'. We were told Anorexia Nervosa was an 'obsession with dieting and getting skinny as possible', like obsessed with it, and that it was sad because most of those who did it was already thin. Pay attention to 'did it', that's what they said. \n\nWe were also told anorexics refuse to eat, and stop eating. Which meant I wasn't one right? Because I did eat, and I wasn't as skinny as the woman in the photo.\n\nIt can be triggering when people don't understand or aren't educated. All mental illnesses suffer from stigma and people not able to understand unless they have it themselves.",
          "created_utc": 1738589032.0
        },
        {
          "id": "maqk4v3",
          "author": "None",
          "body": "I had no idea they even \"taught\" about anorexia in school! That's certainly something I never learned about. I don't remember how I heard about anorexia....",
          "created_utc": 1738591522.0
        },
        {
          "id": "mar26tt",
          "author": "Apprehensive_Spite97",
          "body": "I'm from Scandinavia, that may be why it's different if you're not from here :) Also I'm not sure if it was on the curriculum or if the teacher did it as an extra lesson, I remember it was sheets and not in a book",
          "created_utc": 1738597324.0
        }
      ]
    },
    {
      "id": "mao0igl",
      "author": "None",
      "body": "I think I'm getting downvoted because *\"if it didn't happen to me then it's not true/didn't happen*\" which seems to be the heard mentality of reddit.",
      "created_utc": 1738548874.0,
      "score": -7,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        },
        {
          "id": "mamqpg8",
          "author": "nervous_veggie",
          "body": "Presumably anyone who says that is a total idiot/ isn’t thinking or understanding what that actually means",
          "created_utc": 1738534258.0
        },
        {
          "id": "mamvv5m",
          "author": "wigglywormdirt",
          "body": "they probably mean people outside of those struggling with ana, when ppl talk about it on social media they “scare” anorexic people with pictures of food since they “never eat” idk y op is getting downvoted so bad when it definitely is a common misconception among ppl",
          "created_utc": 1738535820.0
        }
      ]
    },
    {
      "id": "mao75cj",
      "author": "wistfulensifer",
      "body": "I honestly don’t know.. This subreddit does not prohibit anyone from from venting as long as it doesn’t break any rules. This is a place where you can share your thoughts and experiences with those who might relate to you. Although, some get upset when you express yourself in a way that is different from them.\n\nI just saw it as you talking about your experience in a place that you felt comfortable to do so. That is allowed and entirely valid. This is already such an isolating illness. It’s unnecessary to ridicule someone simply because they have differing experiences from you.",
      "created_utc": 1738551057.0,
      "score": 10,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        },
        {
          "id": "man764e",
          "author": "wistfulensifer",
          "body": "I’ve heard this as well. For some reason, there are ignorant people who assume that a lot of us never eat and somehow stay alive. I’m sorry you got downvoted for sharing your legitimate experience. Just because other people haven’t seen it happen, doesn’t mean it hasn’t happened.",
          "created_utc": 1738539377.0
        },
        {
          "id": "mao08wj",
          "author": "None",
          "body": "Thank you for saying this. \n\nI'm more upset some replies are flat out calling my post pointless. Why? It's not.",
          "created_utc": 1738548787.0
        }
      ]
    },
    {
      "id": "mawcfd5",
      "author": "Ok_Victory_2977",
      "body": "Getting 50 down votes for saying \"okay\" is fking wild... Gotta love social media 🙄",
      "created_utc": 1738662823.0,
      "score": 1,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        },
        {
          "id": "mam2jgb",
          "author": "JettReque",
          "body": "Never heard of this, also 20+ years",
          "created_utc": 1738527170.0
        },
        {
          "id": "mam2x39",
          "author": "None",
          "body": "okay.",
          "created_utc": 1738527277.0
        }
      ]
    },
    {
      "id": "maw6po3",
      "author": "None",
      "body": "oh I know, I thought she ,want I was saying that or had been told that",
      "created_utc": 1738659221.0,
      "score": 2,
      "context": [
        {
          "id": "mam26sz",
          "author": "None",
          "body": "exactly anorexia, if u dont eat u will just be hospitalised or death, so the time u can only \"not eat' is very limited.  u will be surprised some of the \"sickest\"  people eat pretty normally from eye view",
          "created_utc": 1738527071.0
        },
        {
          "id": "mam2k5t",
          "author": "None",
          "body": "and don't forget the \"you don't LOOK anorexic!\" -\\_-",
          "created_utc": 1738527176.0
        },
        {
          "id": "mapeodj",
          "author": "None",
          "body": "huh",
          "created_utc": 1738570266.0
        },
        {
          "id": "mavo4lz",
          "author": "AdditionalCopy2435",
          "body": "that’s another thing people who want to invalidate you say. anorexia looks different on all but to those who are naive about it think it has one look and if you don’t fit that look, you must not struggle with it at all",
          "created_utc": 1738648665.0
        }
      ]
    },
    {
      "id": "maodxwc",
      "author": "neopronoun_dropper",
      "body": "Yeah. It is. Your experience is valid. I’m just saying this particular person isn’t invalidating you. They are adding to the conversation about misconceptions by saying “There’s also the misconception that…” and that’s a great way to engage with this post. That’s why it’s weird to say “But I said this misconception not that one…” It’s probably because you’re so busy being invalidated that you’re hypervigilant against ordinary comments and overdoing it. ",
      "created_utc": 1738553355.0,
      "score": 14,
      "context": [
        {
          "id": "mamzvyp",
          "author": "None",
          "body": "There's also the stereotype that anorexics hate food. Some sufferers love feeding people, making food, talking about food, reading about food. Food is never not on your mind. \n\nI do hate food occasionally, but mainly I hate the fact I have to eat and the feelings that causes. But when it comes to my safe foods - I am obsessed with them, think about when I can eat them safely, plan them out accordingly and find them comforting. I know deep down that it's because I'm really hungry but I don't like to admit that to myself.",
          "created_utc": 1738537045.0
        },
        {
          "id": "manzxc1",
          "author": "None",
          "body": ">*There's also the stereotype that anorexics hate food.*\n\nThat's not what I said. I said there's a misconception that anorexics don't eat ever. Where I'm from people think anorexics= never eating.",
          "created_utc": 1738548680.0
        },
        {
          "id": "maod39h",
          "author": "neopronoun_dropper",
          "body": "This just adds to the conversation. It’s weird to say that in this context.",
          "created_utc": 1738553061.0
        },
        {
          "id": "maodbdj",
          "author": "None",
          "body": "The number of people in this sub for support trying to invalidate my thoughts and experiences is weird.",
          "created_utc": 1738553139.0
        }
      ]
    },
    {
      "id": "maoo5ul",
      "author": "JettReque",
      "body": "It’s your attitude in your responses. Not a “heard mentality”",
      "created_utc": 1738557110.0,
      "score": 14,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        },
        {
          "id": "mamqpg8",
          "author": "nervous_veggie",
          "body": "Presumably anyone who says that is a total idiot/ isn’t thinking or understanding what that actually means",
          "created_utc": 1738534258.0
        },
        {
          "id": "mamvv5m",
          "author": "wigglywormdirt",
          "body": "they probably mean people outside of those struggling with ana, when ppl talk about it on social media they “scare” anorexic people with pictures of food since they “never eat” idk y op is getting downvoted so bad when it definitely is a common misconception among ppl",
          "created_utc": 1738535820.0
        },
        {
          "id": "mao0igl",
          "author": "None",
          "body": "I think I'm getting downvoted because *\"if it didn't happen to me then it's not true/didn't happen*\" which seems to be the heard mentality of reddit.",
          "created_utc": 1738548874.0
        }
      ]
    },
    {
      "id": "maoanke",
      "author": "None",
      "body": "Please accept my Heartwarming award 🥹🖤",
      "created_utc": 1738552230.0,
      "score": 3,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        },
        {
          "id": "man764e",
          "author": "wistfulensifer",
          "body": "I’ve heard this as well. For some reason, there are ignorant people who assume that a lot of us never eat and somehow stay alive. I’m sorry you got downvoted for sharing your legitimate experience. Just because other people haven’t seen it happen, doesn’t mean it hasn’t happened.",
          "created_utc": 1738539377.0
        },
        {
          "id": "mao08wj",
          "author": "None",
          "body": "Thank you for saying this. \n\nI'm more upset some replies are flat out calling my post pointless. Why? It's not.",
          "created_utc": 1738548787.0
        },
        {
          "id": "mao75cj",
          "author": "wistfulensifer",
          "body": "I honestly don’t know.. This subreddit does not prohibit anyone from from venting as long as it doesn’t break any rules. This is a place where you can share your thoughts and experiences with those who might relate to you. Although, some get upset when you express yourself in a way that is different from them.\n\nI just saw it as you talking about your experience in a place that you felt comfortable to do so. That is allowed and entirely valid. This is already such an isolating illness. It’s unnecessary to ridicule someone simply because they have differing experiences from you.",
          "created_utc": 1738551057.0
        }
      ]
    },
    {
      "id": "maoel5d",
      "author": "None",
      "body": "Hmmm I am also autistic... we say things people think are weird but it makes sense to us.",
      "created_utc": 1738553581.0,
      "score": 0,
      "context": [
        {
          "id": "mamzvyp",
          "author": "None",
          "body": "There's also the stereotype that anorexics hate food. Some sufferers love feeding people, making food, talking about food, reading about food. Food is never not on your mind. \n\nI do hate food occasionally, but mainly I hate the fact I have to eat and the feelings that causes. But when it comes to my safe foods - I am obsessed with them, think about when I can eat them safely, plan them out accordingly and find them comforting. I know deep down that it's because I'm really hungry but I don't like to admit that to myself.",
          "created_utc": 1738537045.0
        },
        {
          "id": "manzxc1",
          "author": "None",
          "body": ">*There's also the stereotype that anorexics hate food.*\n\nThat's not what I said. I said there's a misconception that anorexics don't eat ever. Where I'm from people think anorexics= never eating.",
          "created_utc": 1738548680.0
        },
        {
          "id": "maod39h",
          "author": "neopronoun_dropper",
          "body": "This just adds to the conversation. It’s weird to say that in this context.",
          "created_utc": 1738553061.0
        },
        {
          "id": "maodbdj",
          "author": "None",
          "body": "The number of people in this sub for support trying to invalidate my thoughts and experiences is weird.",
          "created_utc": 1738553139.0
        },
        {
          "id": "maodxwc",
          "author": "neopronoun_dropper",
          "body": "Yeah. It is. Your experience is valid. I’m just saying this particular person isn’t invalidating you. They are adding to the conversation about misconceptions by saying “There’s also the misconception that…” and that’s a great way to engage with this post. That’s why it’s weird to say “But I said this misconception not that one…” It’s probably because you’re so busy being invalidated that you’re hypervigilant against ordinary comments and overdoing it. ",
          "created_utc": 1738553355.0
        }
      ]
    },
    {
      "id": "maoodb4",
      "author": "None",
      "body": "Being upset that my experience is being invalidated just because other people haven't experienced it themselves? Yes, I am upset over it.\n\nI've seen posts about experiences on this sub that I haven't experienced but I didn't reply essentially telling the OP they're wrong and that's not true. I just read the post and move on.",
      "created_utc": 1738557191.0,
      "score": 0,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        },
        {
          "id": "mamqpg8",
          "author": "nervous_veggie",
          "body": "Presumably anyone who says that is a total idiot/ isn’t thinking or understanding what that actually means",
          "created_utc": 1738534258.0
        },
        {
          "id": "mamvv5m",
          "author": "wigglywormdirt",
          "body": "they probably mean people outside of those struggling with ana, when ppl talk about it on social media they “scare” anorexic people with pictures of food since they “never eat” idk y op is getting downvoted so bad when it definitely is a common misconception among ppl",
          "created_utc": 1738535820.0
        },
        {
          "id": "mao0igl",
          "author": "None",
          "body": "I think I'm getting downvoted because *\"if it didn't happen to me then it's not true/didn't happen*\" which seems to be the heard mentality of reddit.",
          "created_utc": 1738548874.0
        },
        {
          "id": "maoo5ul",
          "author": "JettReque",
          "body": "It’s your attitude in your responses. Not a “heard mentality”",
          "created_utc": 1738557110.0
        }
      ]
    },
    {
      "id": "margh38",
      "author": "wistfulensifer",
      "body": "Thank you, I appreciate it. 🙂",
      "created_utc": 1738601402.0,
      "score": 3,
      "context": [
        {
          "id": "mam1ln1",
          "author": "JettReque",
          "body": "Every anorexic eats at some point. If they don’t, they die soon. It’s not literal that anorexics don’t eat. Restricting eating is one of the main practices of Anorexia Nervosa.",
          "created_utc": 1738526903.0
        },
        {
          "id": "mam29or",
          "author": "None",
          "body": "Yes I know but in my 20+ years of having this I've heard it implied that anorexia means we never eat ever. It makes me want to roll my eyes.\n\nEdit:  thanks for the downvotes guys, glad you guys have never heard that statement. Doesn't mean I haven't heard that misconception.",
          "created_utc": 1738527093.0
        },
        {
          "id": "man764e",
          "author": "wistfulensifer",
          "body": "I’ve heard this as well. For some reason, there are ignorant people who assume that a lot of us never eat and somehow stay alive. I’m sorry you got downvoted for sharing your legitimate experience. Just because other people haven’t seen it happen, doesn’t mean it hasn’t happened.",
          "created_utc": 1738539377.0
        },
        {
          "id": "mao08wj",
          "author": "None",
          "body": "Thank you for saying this. \n\nI'm more upset some replies are flat out calling my post pointless. Why? It's not.",
          "created_utc": 1738548787.0
        },
        {
          "id": "mao75cj",
          "author": "wistfulensifer",
          "body": "I honestly don’t know.. This subreddit does not prohibit anyone from from venting as long as it doesn’t break any rules. This is a place where you can share your thoughts and experiences with those who might relate to you. Although, some get upset when you express yourself in a way that is different from them.\n\nI just saw it as you talking about your experience in a place that you felt comfortable to do so. That is allowed and entirely valid. This is already such an isolating illness. It’s unnecessary to ridicule someone simply because they have differing experiences from you.",
          "created_utc": 1738551057.0
        },
        {
          "id": "maoanke",
          "author": "None",
          "body": "Please accept my Heartwarming award 🥹🖤",
          "created_utc": 1738552230.0
        }
      ]
    },
    {
      "id": "maof0ku",
      "author": "neopronoun_dropper",
      "body": "Me too",
      "created_utc": 1738553729.0,
      "score": 8,
      "context": [
        {
          "id": "mamzvyp",
          "author": "None",
          "body": "There's also the stereotype that anorexics hate food. Some sufferers love feeding people, making food, talking about food, reading about food. Food is never not on your mind. \n\nI do hate food occasionally, but mainly I hate the fact I have to eat and the feelings that causes. But when it comes to my safe foods - I am obsessed with them, think about when I can eat them safely, plan them out accordingly and find them comforting. I know deep down that it's because I'm really hungry but I don't like to admit that to myself.",
          "created_utc": 1738537045.0
        },
        {
          "id": "manzxc1",
          "author": "None",
          "body": ">*There's also the stereotype that anorexics hate food.*\n\nThat's not what I said. I said there's a misconception that anorexics don't eat ever. Where I'm from people think anorexics= never eating.",
          "created_utc": 1738548680.0
        },
        {
          "id": "maod39h",
          "author": "neopronoun_dropper",
          "body": "This just adds to the conversation. It’s weird to say that in this context.",
          "created_utc": 1738553061.0
        },
        {
          "id": "maodbdj",
          "author": "None",
          "body": "The number of people in this sub for support trying to invalidate my thoughts and experiences is weird.",
          "created_utc": 1738553139.0
        },
        {
          "id": "maodxwc",
          "author": "neopronoun_dropper",
          "body": "Yeah. It is. Your experience is valid. I’m just saying this particular person isn’t invalidating you. They are adding to the conversation about misconceptions by saying “There’s also the misconception that…” and that’s a great way to engage with this post. That’s why it’s weird to say “But I said this misconception not that one…” It’s probably because you’re so busy being invalidated that you’re hypervigilant against ordinary comments and overdoing it. ",
          "created_utc": 1738553355.0
        },
        {
          "id": "maoel5d",
          "author": "None",
          "body": "Hmmm I am also autistic... we say things people think are weird but it makes sense to us.",
          "created_utc": 1738553581.0
        }
      ]
    }
  ]
}