{
  "id": "1ikr1p1",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1739031937.0,
  "title": "Triggered by an obese man on the bus",
  "selftext": "I take public transit. I was on my way home. A morbidly obese man got on the bus and sat a couple row ahead of me. THIS POST IS NOT TO SHAME THE MAN. I know being that obese is an eating disorder as well. He started eating takeout food he has and I just.... couldn't take it. Something in me just got triggered. My anorexia shrieked at me to move. I got up and move. All I could think of was the calories he was consuming. In my mind I was screaming at him. This was the first time I was triggered like that. Even from the back of the bus I could still smell the food. It was a very uncomfortable bus ride.\n\nAnyone else triggered by people eating around them? \n\nEdit: okay, since some people want to put malice behind my words. Let me repeat again, this post was NOT to shame the man. I would have been triggered if he was in fit or thin as well. I did NOT say anything to him and didn't tell him he was disgusting. I said nothing and quietly moved to the back of the bus. I get uncomfortable seeing my coworkers (who are fit) eat during lunch too but being triggered like this was different. I've never thought I could absorb calories by smelling the food. That's a new intrusive thought for me. \n\nYes, I get triggered by my coworkers who are thin/fit eating in the cafeteria but what makes it different is I can flee. On a bus, I could no flee. I felt like a trapped rat. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ikr1p1/triggered_by_an_obese_man_on_the_bus/",
  "score": 124,
  "num_comments": 111,
  "comments": [
    {
      "id": "mbohhr5",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1739031939.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbp9syc",
      "author": "rilatooma444",
      "body": "i can kinda relate to this but in a different way - i get triggered because i feel like i could easily become them, i went from obese to now underweight and i’m terrified of losing control and gaining ANY weight back. \n\ni know what it’s like to lose control around food and I feel like at any second i could become the obese person eating fast food on the bus if i don’t try harder to control myself. \n\ni have been stuck in b/p cycle for a few weeks and i am legit terrified to weigh myself because i know the breakdown is gonna be bad.",
      "created_utc": 1739040109.0,
      "score": 55,
      "context": []
    },
    {
      "id": "mbov6ov",
      "author": "hesitantsound",
      "body": "Personally I get triggered when people eat with their mouths open and chew loudly.. it angers and disgusts me. And sometimes I get strangely jealous when the person isn’t obese at all because I’m thinking “why can’t my brain be wired to be “normal”?”",
      "created_utc": 1739035933.0,
      "score": 80,
      "context": []
    },
    {
      "id": "mboju9d",
      "author": "nocoherantthoughts",
      "body": "i literally cant eat around people at all, watching other people eat just makes me feel crazy",
      "created_utc": 1739032624.0,
      "score": 46,
      "context": []
    },
    {
      "id": "mbpso3v",
      "author": "Global_Ant_9380",
      "body": "It's called self loathing. It takes an extreme amount of self hatred to keep up an ED.\n\n\nYou'll be happier when you heal. Trust me. ",
      "created_utc": 1739045552.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mbokb3m",
      "author": "Froggymushroomfrog",
      "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
      "created_utc": 1739032759.0,
      "score": 48,
      "context": []
    },
    {
      "id": "mbppotm",
      "author": "Nthorpe1996",
      "body": "For this exact reason I don’t like eating in front of people: it’s a 2 way street, I don’t want people to feel weird/triggered if they too have a ED but I also hate seeing other people eat because then I’ll feel like I have to join them to fit in, or it’ll be obvious that I’ve got my ED. I’m still in the closet (so to speak) and publicly, only one friend of mine has figured out I’ve got an ED. So it’s worse now with my one friend who *insists* on either taking me out for food or just blatantly munching in front of me, knowing I don’t like it.",
      "created_utc": 1739044669.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mborgbm",
      "author": "EclecticGarbage",
      "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
      "created_utc": 1739034845.0,
      "score": 25,
      "context": []
    },
    {
      "id": "mbq0rje",
      "author": "areydellan",
      "body": "Yeah I get a bit triggered seing people eat way more than they have to but then I'm one to talk because I be binging every other week",
      "created_utc": 1739047948.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbrt2xx",
      "author": "AnxiousDoor9842",
      "body": "what triggered me in my recovery era was when i would hang out with friends and we would go somewhere to eat, but they would get the smallest little thing while i would get a whole meal. after 2 times of that happening i started asking if they were gonna get a full meal, and if they weren’t i would say i wasn’t hungry",
      "created_utc": 1739069189.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbtexe6",
      "author": "princessuuke",
      "body": "Personally I've never been able to watch people eat, something about it is just so gross to me especially if they're eating food i cannot stand",
      "created_utc": 1739097230.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbtq27u",
      "author": "sa1ami_lid",
      "body": "I totally understand where you're coming from. I HATE mouth noises (eating, swallowing, breathing, snoring) so people eating already brings an inexplicable rage to me, but I think seeing people who are obese and eat freely makes me feel a mix of jealousy and fear. I wish I could eat what I wanted and experience all the flavours of foods that I miss, but it's then terrifying to know that I could blow up if I let my body control my mind like that. \n\nOne of the first times I was food triggered was by my father (obese) eating like a pig, really snuffling and stuffing his face, I think he has a binge eating disorder, but it was so revolting to me and any time I eat too fast, I'm reminded of how he eats. \n\nI think it's valid to be triggered by anything relating to food. It's all about how our experiences have shaped our minds and twisted into disordered eating.",
      "created_utc": 1739103308.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbwzr9q",
      "author": "newmommy1994",
      "body": "If you would have been triggered regardless of his weight then WHY DID YOU MENTION HIS SIZE",
      "created_utc": 1739139885.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mboje5p",
      "author": "aphextwinaddict",
      "body": "i thought it was just me, seeing people eat like that, especially if they are fat/obese drives me insaneee. like i genuinely get second hand disgust from it, i feel bad for seeing people that way but i know it’s my ana talking as i used to be super body positive i guess pre ana. i try use that to justify to myself im not a bad person but in reality clocking  people is my drug. even in restaurants seeing what the super thin girl orders and her mannerisms, likewise for obese people i see.",
      "created_utc": 1739032496.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mbqlfol",
      "author": "lapischerry",
      "body": "I think including that he’s obese and being judgy about him eating is shaming him regardless of what your intent is with the post. the outcome is it reads to others as judgmental and shameful.",
      "created_utc": 1739054237.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mboj4gz",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1739032417.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mbpakjy",
      "author": "Other_Ad_6981",
      "body": "I hate that I'm like this, but a little voice in my head is always judging them. I always compare myself and it's so stupid. I don't feel that way. I don't feel like I'm better but I always end up with a voice saying I am.",
      "created_utc": 1739040327.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mbqgozx",
      "author": "Fluttery_Soul",
      "body": "Yeah...I work at a fast food restaurant and every shift I have to make these high calorie foods and see people take it and eat it and all I see is the numbers and I just get so uneasy...\n\n\nIt almost feels as if I'm the one eating it but I also feel guilty knowing how 'unhealhty' the food is and giving it to them. In my head, I think \"if only they know what they're eating...\"\n\n\nI know it's just my Ed voice bc I'd never judge someone's choices like that but the repulsed feeling is still there.",
      "created_utc": 1739052744.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mboossv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1739034069.0,
      "score": -2,
      "context": []
    },
    {
      "id": "mbosodn",
      "author": "No-Detective5258",
      "body": "I feel so seen by this. I feel horrible, but when my friends mention being hungry around me or if they eat multiple times in front of me, there’s a part of me that judges them so harshly. It makes me so sad that I think of my friends in this way, but EDs are so competitive…. :(((",
      "created_utc": 1739035202.0,
      "score": -4,
      "context": []
    },
    {
      "id": "mbosq4u",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1739035216.0,
      "score": -8,
      "context": []
    },
    {
      "id": "mbpiedo",
      "author": "Expert_Sail3923",
      "body": "hey i’m sorry people are being so weird about this post. you have a DISORDER that changes your thought patterns and makes you think things you don’t necessarily agree with. Is it people with OCD’s fault for thinking the things they think even if they hate it? what you’re feeling is normal even if it’s not a great thought, and you’re not even saying you like feeling like this. don’t let these people make you think you’re a bad person, you’re just a person with mental illness.",
      "created_utc": 1739042568.0,
      "score": -2,
      "context": []
    },
    {
      "id": "mbx5iiw",
      "author": "None",
      "body": "Same, except I've never been obese, but I've been chubbier before. Food is just too pleasant and moreish for me, and I get too obsessed with specific things, always have; if I didn't have all my food rules to keep me in check, I would probably just blow up and make my life even harder than the rules do.\n\nI don't have any hate or contempt for obese people, because I don't think I'm any better than them; they remind me of my fears precisely because I feel that I am _too similar_ to them. The only thing separating us is my anxiety around food and my rules. I do give in and binge sometimes, even if it's strictly on my ortho safe (but high cal) foods, and seeing obese people reminds me exactly of what I've done and how it feels; it's scary.",
      "created_utc": 1739141714.0,
      "score": 3,
      "context": [
        {
          "id": "mbp9syc",
          "author": "rilatooma444",
          "body": "i can kinda relate to this but in a different way - i get triggered because i feel like i could easily become them, i went from obese to now underweight and i’m terrified of losing control and gaining ANY weight back. \n\ni know what it’s like to lose control around food and I feel like at any second i could become the obese person eating fast food on the bus if i don’t try harder to control myself. \n\ni have been stuck in b/p cycle for a few weeks and i am legit terrified to weigh myself because i know the breakdown is gonna be bad.",
          "created_utc": 1739040109.0
        }
      ]
    },
    {
      "id": "mbqlad0",
      "author": "None",
      "body": "Eating with mouths open AND chewing noises!!!! I can't!",
      "created_utc": 1739054190.0,
      "score": 9,
      "context": [
        {
          "id": "mbov6ov",
          "author": "hesitantsound",
          "body": "Personally I get triggered when people eat with their mouths open and chew loudly.. it angers and disgusts me. And sometimes I get strangely jealous when the person isn’t obese at all because I’m thinking “why can’t my brain be wired to be “normal”?”",
          "created_utc": 1739035933.0
        }
      ]
    },
    {
      "id": "mbqlgww",
      "author": "None",
      "body": "I 10000% agree that anorexia is stemmed from self hatred, mine is especially.",
      "created_utc": 1739054248.0,
      "score": 3,
      "context": [
        {
          "id": "mbpso3v",
          "author": "Global_Ant_9380",
          "body": "It's called self loathing. It takes an extreme amount of self hatred to keep up an ED.\n\n\nYou'll be happier when you heal. Trust me. ",
          "created_utc": 1739045552.0
        }
      ]
    },
    {
      "id": "mbooitl",
      "author": "thrxwxxx",
      "body": "I can’t speak for OP but people eating in random public places not designed for eating (ie a bus) always triggers me and pisses me off regardless of their weight",
      "created_utc": 1739033989.0,
      "score": 44,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        }
      ]
    },
    {
      "id": "mbonaeq",
      "author": "BravesMaedchen",
      "body": "I mean she said in the title it was the man who triggered her. But yeah, eating on the bus is something a lot of people do. Shouldn’t be different for him.",
      "created_utc": 1739033627.0,
      "score": 21,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        }
      ]
    },
    {
      "id": "mbom2pz",
      "author": "Additional-Problem99",
      "body": "Exactly. And OP describing the man as “morbidly obese” and then claiming they aren’t trying to shame them just feels like their only issue is that they were fat.",
      "created_utc": 1739033274.0,
      "score": 22,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        }
      ]
    },
    {
      "id": "mbotgmi",
      "author": "brookleiaway",
      "body": "i would be triggered if anybody was unhealthily over or underweight. not sure why its ok to be triggered by underweight people here but the moment someones overweight its fine",
      "created_utc": 1739035430.0,
      "score": 16,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        }
      ]
    },
    {
      "id": "mbqh9xy",
      "author": "None",
      "body": "Yes. It was the consumption of all those calories that triggered me. Like the thought of eating all those calories is what triggered me.",
      "created_utc": 1739052925.0,
      "score": 3,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        }
      ]
    },
    {
      "id": "mbouiwl",
      "author": "underthesauceyuh",
      "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
      "created_utc": 1739035740.0,
      "score": 43,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        }
      ]
    },
    {
      "id": "mbotogv",
      "author": "brookleiaway",
      "body": "its almost like eating disorders make people think differently",
      "created_utc": 1739035493.0,
      "score": -19,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        }
      ]
    },
    {
      "id": "mbrzzuw",
      "author": "None",
      "body": "I went to sushi with a good friend and the first thing she says is \"are you hungry?\" which triggered me. She also made other comments on my eating and told me to \"binge as much as I can\" because she world was gonna end soon.",
      "created_utc": 1739071748.0,
      "score": 1,
      "context": [
        {
          "id": "mbrt2xx",
          "author": "AnxiousDoor9842",
          "body": "what triggered me in my recovery era was when i would hang out with friends and we would go somewhere to eat, but they would get the smallest little thing while i would get a whole meal. after 2 times of that happening i started asking if they were gonna get a full meal, and if they weren’t i would say i wasn’t hungry",
          "created_utc": 1739069189.0
        }
      ]
    },
    {
      "id": "mbtfol2",
      "author": "None",
      "body": "I feel this way about my coworkers! I can flee when triggered. On a bus I couldn't go anywhere.",
      "created_utc": 1739097671.0,
      "score": 2,
      "context": [
        {
          "id": "mbtexe6",
          "author": "princessuuke",
          "body": "Personally I've never been able to watch people eat, something about it is just so gross to me especially if they're eating food i cannot stand",
          "created_utc": 1739097230.0
        }
      ]
    },
    {
      "id": "mbqie70",
      "author": "None",
      "body": "My adoptive \"mother\" was obese. I have no issues with seeing obese people. It was the consumption of all the calories he was eating that triggered me.",
      "created_utc": 1739053274.0,
      "score": 1,
      "context": [
        {
          "id": "mboje5p",
          "author": "aphextwinaddict",
          "body": "i thought it was just me, seeing people eat like that, especially if they are fat/obese drives me insaneee. like i genuinely get second hand disgust from it, i feel bad for seeing people that way but i know it’s my ana talking as i used to be super body positive i guess pre ana. i try use that to justify to myself im not a bad person but in reality clocking  people is my drug. even in restaurants seeing what the super thin girl orders and her mannerisms, likewise for obese people i see.",
          "created_utc": 1739032496.0
        }
      ]
    },
    {
      "id": "mbqlxer",
      "author": "None",
      "body": "I included obese to show that he and I are on the total opposite ends of the eating disorder spectrum. I find it odd that if he was thin and I said \"triggered by a thin man on the bus\" no one would consider it judgy. \n\nMy '*triggered*' thoughts didn't address his weight. It was the smell of food and consumption of calories.",
      "created_utc": 1739054392.0,
      "score": 5,
      "context": [
        {
          "id": "mbqlfol",
          "author": "lapischerry",
          "body": "I think including that he’s obese and being judgy about him eating is shaming him regardless of what your intent is with the post. the outcome is it reads to others as judgmental and shameful.",
          "created_utc": 1739054237.0
        }
      ]
    },
    {
      "id": "mbotufk",
      "author": "Ashamed_Ad8162",
      "body": "This is a disgusting comparison. For all people, and I mean all, fed is best. What if that’s the only food he has eaten all day? What if that is the only food he can afford? What if it’s a healthier choice than something worse? \n\nI have had AN and been underweight, normal weight, and overweight. My body needed the food regardless. \n\nI get it. I think about what other people are eating too, but it’s not my place to make assumptions like that.",
      "created_utc": 1739035541.0,
      "score": 19,
      "context": [
        {
          "id": "mboj4gz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739032417.0
        }
      ]
    },
    {
      "id": "mboma2q",
      "author": "Additional-Problem99",
      "body": "People are allowed to eat in public. That’s not “showing their illness”.",
      "created_utc": 1739033334.0,
      "score": 35,
      "context": [
        {
          "id": "mboj4gz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739032417.0
        }
      ]
    },
    {
      "id": "mbomyw2",
      "author": "BravesMaedchen",
      "body": "Not even close to the same. We all have to eat. Eating in public is normal.",
      "created_utc": 1739033535.0,
      "score": 25,
      "context": [
        {
          "id": "mboj4gz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739032417.0
        }
      ]
    },
    {
      "id": "mboxdta",
      "author": "filigreeonleafndvine",
      "body": "this is your ed talking. not the same thing",
      "created_utc": 1739036572.0,
      "score": 10,
      "context": [
        {
          "id": "mboj4gz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739032417.0
        }
      ]
    },
    {
      "id": "mbprjnq",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1739045216.0,
      "score": 2,
      "context": [
        {
          "id": "mboj4gz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739032417.0
        }
      ]
    },
    {
      "id": "mbqkr29",
      "author": "None",
      "body": "This is why I can't be in fast food places. All those calories!",
      "created_utc": 1739054020.0,
      "score": 2,
      "context": [
        {
          "id": "mbqgozx",
          "author": "Fluttery_Soul",
          "body": "Yeah...I work at a fast food restaurant and every shift I have to make these high calorie foods and see people take it and eat it and all I see is the numbers and I just get so uneasy...\n\n\nIt almost feels as if I'm the one eating it but I also feel guilty knowing how 'unhealhty' the food is and giving it to them. In my head, I think \"if only they know what they're eating...\"\n\n\nI know it's just my Ed voice bc I'd never judge someone's choices like that but the repulsed feeling is still there.",
          "created_utc": 1739052744.0
        }
      ]
    },
    {
      "id": "mbopocy",
      "author": "Additional-Problem99",
      "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
      "created_utc": 1739034327.0,
      "score": 14,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        }
      ]
    },
    {
      "id": "mbotfc1",
      "author": "Additional-Problem99",
      "body": "It is on OP to get help for their reaction towards people eating, especially if they only react this way when someone overweight is eating.",
      "created_utc": 1739035419.0,
      "score": 17,
      "context": [
        {
          "id": "mbosq4u",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739035216.0
        }
      ]
    },
    {
      "id": "mbprx4k",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1739045329.0,
      "score": 1,
      "context": [
        {
          "id": "mbosq4u",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739035216.0
        }
      ]
    },
    {
      "id": "mbql5fi",
      "author": "None",
      "body": "Because people always enjoy putting malice behind my words and behaviors. \n\n  \nI never once thought the man was disgusting or a bad person because he's obese. He's a person like I am just on the opposite ends of the eating disorder spectrum.",
      "created_utc": 1739054147.0,
      "score": 3,
      "context": [
        {
          "id": "mbpiedo",
          "author": "Expert_Sail3923",
          "body": "hey i’m sorry people are being so weird about this post. you have a DISORDER that changes your thought patterns and makes you think things you don’t necessarily agree with. Is it people with OCD’s fault for thinking the things they think even if they hate it? what you’re feeling is normal even if it’s not a great thought, and you’re not even saying you like feeling like this. don’t let these people make you think you’re a bad person, you’re just a person with mental illness.",
          "created_utc": 1739042568.0
        }
      ]
    },
    {
      "id": "mbq3h7o",
      "author": "Additional-Problem99",
      "body": "It’s not their fault for having these thoughts, but it is on them for how they react. In this case, shaming the person and not making an effort to confront and change those thoughts.\n\nHaving a disorder doesn’t mean you get a free pass to be rude.",
      "created_utc": 1739048755.0,
      "score": 5,
      "context": [
        {
          "id": "mbpiedo",
          "author": "Expert_Sail3923",
          "body": "hey i’m sorry people are being so weird about this post. you have a DISORDER that changes your thought patterns and makes you think things you don’t necessarily agree with. Is it people with OCD’s fault for thinking the things they think even if they hate it? what you’re feeling is normal even if it’s not a great thought, and you’re not even saying you like feeling like this. don’t let these people make you think you’re a bad person, you’re just a person with mental illness.",
          "created_utc": 1739042568.0
        }
      ]
    },
    {
      "id": "mboppld",
      "author": "Froggymushroomfrog",
      "body": "You just explained it’s the food that triggers you - I want to know what it was that triggered OP like if it was the food then that’s fine but it really seems like it was his weight",
      "created_utc": 1739034337.0,
      "score": 19,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbooitl",
          "author": "thrxwxxx",
          "body": "I can’t speak for OP but people eating in random public places not designed for eating (ie a bus) always triggers me and pisses me off regardless of their weight",
          "created_utc": 1739033989.0
        }
      ]
    },
    {
      "id": "mbosf8w",
      "author": "Sh_7422",
      "body": "I relate to this a lot. Have you figured out the reason behind this???",
      "created_utc": 1739035127.0,
      "score": 4,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbooitl",
          "author": "thrxwxxx",
          "body": "I can’t speak for OP but people eating in random public places not designed for eating (ie a bus) always triggers me and pisses me off regardless of their weight",
          "created_utc": 1739033989.0
        }
      ]
    },
    {
      "id": "mbpba3f",
      "author": "AbundantiaTheWitch",
      "body": "I’m totally the opposite I love seeing people enjoy food whenever they want I hope one day I won’t care about eating in front of other people",
      "created_utc": 1739040527.0,
      "score": 5,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbooitl",
          "author": "thrxwxxx",
          "body": "I can’t speak for OP but people eating in random public places not designed for eating (ie a bus) always triggers me and pisses me off regardless of their weight",
          "created_utc": 1739033989.0
        }
      ]
    },
    {
      "id": "mbwgpi1",
      "author": "haybails720",
      "body": "Never eating in public ever again 😭",
      "created_utc": 1739134288.0,
      "score": 1,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbooitl",
          "author": "thrxwxxx",
          "body": "I can’t speak for OP but people eating in random public places not designed for eating (ie a bus) always triggers me and pisses me off regardless of their weight",
          "created_utc": 1739033989.0
        }
      ]
    },
    {
      "id": "mbybdt9",
      "author": "Top_Conversation_976",
      "body": "I mean… considering this is a disorder with a main symptom being intense fear of weight gain…",
      "created_utc": 1739155841.0,
      "score": 1,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbom2pz",
          "author": "Additional-Problem99",
          "body": "Exactly. And OP describing the man as “morbidly obese” and then claiming they aren’t trying to shame them just feels like their only issue is that they were fat.",
          "created_utc": 1739033274.0
        }
      ]
    },
    {
      "id": "mbp1hiq",
      "author": "Additional-Problem99",
      "body": "The problem is body shaming, which isn’t okay in either direction. However, fat people do face more discrimination than skinny people. That doesn’t make shaming people for being thin and/or underweight okay, but shaming fat people is considered socially acceptable.",
      "created_utc": 1739037740.0,
      "score": 3,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbotgmi",
          "author": "brookleiaway",
          "body": "i would be triggered if anybody was unhealthily over or underweight. not sure why its ok to be triggered by underweight people here but the moment someones overweight its fine",
          "created_utc": 1739035430.0
        }
      ]
    },
    {
      "id": "mbqoadi",
      "author": "Froggymushroomfrog",
      "body": "You should have explained it in your post because it does come off as it was specifically him being obese that bothered you. Why did you need to add obese to the title?",
      "created_utc": 1739055138.0,
      "score": 4,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbqh9xy",
          "author": "None",
          "body": "Yes. It was the consumption of all those calories that triggered me. Like the thought of eating all those calories is what triggered me.",
          "created_utc": 1739052925.0
        }
      ]
    },
    {
      "id": "mbqko75",
      "author": "None",
      "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
      "created_utc": 1739053995.0,
      "score": -8,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        }
      ]
    },
    {
      "id": "mbycolw",
      "author": "Top_Conversation_976",
      "body": "He himself wasn’t being dehumanized. I’m sure the post wasn’t about devaluing the man in any way… weight and fat is pretty much the only thing anorexic brain registers is weight",
      "created_utc": 1739156271.0,
      "score": -2,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        }
      ]
    },
    {
      "id": "mbp1r1l",
      "author": "Additional-Problem99",
      "body": "And it’s on the individual to get help for that instead of shaming someone for their weight. Eating disorders don’t take away your personal responsibilities.",
      "created_utc": 1739037815.0,
      "score": 19,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbotogv",
          "author": "brookleiaway",
          "body": "its almost like eating disorders make people think differently",
          "created_utc": 1739035493.0
        }
      ]
    },
    {
      "id": "mbpawwc",
      "author": "Condemned2Be",
      "body": "Just because you have a toxic thought doesn’t entitle you to share it & revel with others in it. Sure, some people here are now agreeing with her, & you see where it led. Now we have comments saying anytime an obese person eats they are “showing off their illness” & honestly, you tell me how it helps.\n\nWho does it comfort? Do YOU feel better knowing more than one person on earth hates seeing fat people eat? Because that’s how it’s worded. Instead of seeking support for the feelings (“how do you deal with triggers?”), the post seeks validation (“who else is triggered by this?”). So the comments aren’t even constructive, they are just anecdotes about disliking the overweight.\n\nJust because we are disordered doesn’t give us a pass to be toxic. We can still do better.",
      "created_utc": 1739040423.0,
      "score": 12,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbotogv",
          "author": "brookleiaway",
          "body": "its almost like eating disorders make people think differently",
          "created_utc": 1739035493.0
        }
      ]
    },
    {
      "id": "mboxpcc",
      "author": "Hoe-for-Minamino",
      "body": "It’s almost like you’re still responsible for the rhetoric you put out into the world, regardless of your mental health conditions ",
      "created_utc": 1739036664.0,
      "score": 4,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbotogv",
          "author": "brookleiaway",
          "body": "its almost like eating disorders make people think differently",
          "created_utc": 1739035493.0
        }
      ]
    },
    {
      "id": "mbqmqo3",
      "author": "lapischerry",
      "body": "again, it’s less about your intention with the post and more to do with the result of it. you’re judging him by his caloric intake, and that is shaming the person already. it doesn’t hurt to be honest or curious with yourself about judgments you’re inclined to excuse or write off.",
      "created_utc": 1739054647.0,
      "score": 5,
      "context": [
        {
          "id": "mbqlfol",
          "author": "lapischerry",
          "body": "I think including that he’s obese and being judgy about him eating is shaming him regardless of what your intent is with the post. the outcome is it reads to others as judgmental and shameful.",
          "created_utc": 1739054237.0
        },
        {
          "id": "mbqlxer",
          "author": "None",
          "body": "I included obese to show that he and I are on the total opposite ends of the eating disorder spectrum. I find it odd that if he was thin and I said \"triggered by a thin man on the bus\" no one would consider it judgy. \n\nMy '*triggered*' thoughts didn't address his weight. It was the smell of food and consumption of calories.",
          "created_utc": 1739054392.0
        }
      ]
    },
    {
      "id": "mbp9p5j",
      "author": "Condemned2Be",
      "body": "Right? Like this seems to be glorifying anorexia because eating is literally required of everyone to live. Every time a fat person eats is not a disordered moment just because they are existing while fat.\n\nI’m underweight & when I go for a walk to the store, people don’t attack me for exercising & tell me I’m burning fucking calories…. Because walking is part of being alive???\n\nLike what even is that comment!",
      "created_utc": 1739040079.0,
      "score": 10,
      "context": [
        {
          "id": "mboj4gz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739032417.0
        },
        {
          "id": "mboma2q",
          "author": "Additional-Problem99",
          "body": "People are allowed to eat in public. That’s not “showing their illness”.",
          "created_utc": 1739033334.0
        }
      ]
    },
    {
      "id": "mbqogzz",
      "author": "Fluttery_Soul",
      "body": "I knoww 😭 it's triggers left and right",
      "created_utc": 1739055199.0,
      "score": 0,
      "context": [
        {
          "id": "mbqgozx",
          "author": "Fluttery_Soul",
          "body": "Yeah...I work at a fast food restaurant and every shift I have to make these high calorie foods and see people take it and eat it and all I see is the numbers and I just get so uneasy...\n\n\nIt almost feels as if I'm the one eating it but I also feel guilty knowing how 'unhealhty' the food is and giving it to them. In my head, I think \"if only they know what they're eating...\"\n\n\nI know it's just my Ed voice bc I'd never judge someone's choices like that but the repulsed feeling is still there.",
          "created_utc": 1739052744.0
        },
        {
          "id": "mbqkr29",
          "author": "None",
          "body": "This is why I can't be in fast food places. All those calories!",
          "created_utc": 1739054020.0
        }
      ]
    },
    {
      "id": "mbopzgk",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1739034418.0,
      "score": -6,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        }
      ]
    },
    {
      "id": "mbq7liu",
      "author": "DueConsequence8605",
      "body": "I agree",
      "created_utc": 1739049980.0,
      "score": 1,
      "context": [
        {
          "id": "mbosq4u",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739035216.0
        },
        {
          "id": "mbotfc1",
          "author": "Additional-Problem99",
          "body": "It is on OP to get help for their reaction towards people eating, especially if they only react this way when someone overweight is eating.",
          "created_utc": 1739035419.0
        }
      ]
    },
    {
      "id": "mbr1i24",
      "author": "Expert_Sail3923",
      "body": "You literally didn’t say anything wrong! People are choosing to hear what they want from what you wrote. I find a LOT of ed people have this holier than thou mindset if they don’t do or think certain things other ed people do. You’re expressing your discomfort with how YOUR ed makes you feel. You literally specifically said you weren’t shaming him!",
      "created_utc": 1739059537.0,
      "score": 1,
      "context": [
        {
          "id": "mbpiedo",
          "author": "Expert_Sail3923",
          "body": "hey i’m sorry people are being so weird about this post. you have a DISORDER that changes your thought patterns and makes you think things you don’t necessarily agree with. Is it people with OCD’s fault for thinking the things they think even if they hate it? what you’re feeling is normal even if it’s not a great thought, and you’re not even saying you like feeling like this. don’t let these people make you think you’re a bad person, you’re just a person with mental illness.",
          "created_utc": 1739042568.0
        },
        {
          "id": "mbql5fi",
          "author": "None",
          "body": "Because people always enjoy putting malice behind my words and behaviors. \n\n  \nI never once thought the man was disgusting or a bad person because he's obese. He's a person like I am just on the opposite ends of the eating disorder spectrum.",
          "created_utc": 1739054147.0
        }
      ]
    },
    {
      "id": "mbr0oy8",
      "author": "Expert_Sail3923",
      "body": "I agree with what you’re saying! But in this case I don’t think she was shaming him, just expressing how she felt in that moment. Maybe she is trying to change her thought patterns you never know!\nI’m not saying having a disorder is an excuse, it’s just a reason. I just don’t think it’s right to hate on this person for not actually doing anything wrong.",
      "created_utc": 1739059260.0,
      "score": 1,
      "context": [
        {
          "id": "mbpiedo",
          "author": "Expert_Sail3923",
          "body": "hey i’m sorry people are being so weird about this post. you have a DISORDER that changes your thought patterns and makes you think things you don’t necessarily agree with. Is it people with OCD’s fault for thinking the things they think even if they hate it? what you’re feeling is normal even if it’s not a great thought, and you’re not even saying you like feeling like this. don’t let these people make you think you’re a bad person, you’re just a person with mental illness.",
          "created_utc": 1739042568.0
        },
        {
          "id": "mbq3h7o",
          "author": "Additional-Problem99",
          "body": "It’s not their fault for having these thoughts, but it is on them for how they react. In this case, shaming the person and not making an effort to confront and change those thoughts.\n\nHaving a disorder doesn’t mean you get a free pass to be rude.",
          "created_utc": 1739048755.0
        }
      ]
    },
    {
      "id": "mbqh5vh",
      "author": "None",
      "body": "I made it very clear in my post I was not to body shame him because at the end of the say, we both have an eating disorder.",
      "created_utc": 1739052890.0,
      "score": 9,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbotgmi",
          "author": "brookleiaway",
          "body": "i would be triggered if anybody was unhealthily over or underweight. not sure why its ok to be triggered by underweight people here but the moment someones overweight its fine",
          "created_utc": 1739035430.0
        },
        {
          "id": "mbp1hiq",
          "author": "Additional-Problem99",
          "body": "The problem is body shaming, which isn’t okay in either direction. However, fat people do face more discrimination than skinny people. That doesn’t make shaming people for being thin and/or underweight okay, but shaming fat people is considered socially acceptable.",
          "created_utc": 1739037740.0
        }
      ]
    },
    {
      "id": "mbp59so",
      "author": "phun_hog",
      "body": "I agree with this about this never being OK. I'm not sure if I believe it's less socially acceptable to body-shame skinny people, though. My personal experience is that far more people comment on my underweight body than my overweight body.",
      "created_utc": 1739038828.0,
      "score": 2,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbotgmi",
          "author": "brookleiaway",
          "body": "i would be triggered if anybody was unhealthily over or underweight. not sure why its ok to be triggered by underweight people here but the moment someones overweight its fine",
          "created_utc": 1739035430.0
        },
        {
          "id": "mbp1hiq",
          "author": "Additional-Problem99",
          "body": "The problem is body shaming, which isn’t okay in either direction. However, fat people do face more discrimination than skinny people. That doesn’t make shaming people for being thin and/or underweight okay, but shaming fat people is considered socially acceptable.",
          "created_utc": 1739037740.0
        }
      ]
    },
    {
      "id": "mbqov2a",
      "author": "None",
      "body": "I did but people are disregarding/ignoring it.",
      "created_utc": 1739055322.0,
      "score": 3,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbqh9xy",
          "author": "None",
          "body": "Yes. It was the consumption of all those calories that triggered me. Like the thought of eating all those calories is what triggered me.",
          "created_utc": 1739052925.0
        },
        {
          "id": "mbqoadi",
          "author": "Froggymushroomfrog",
          "body": "You should have explained it in your post because it does come off as it was specifically him being obese that bothered you. Why did you need to add obese to the title?",
          "created_utc": 1739055138.0
        }
      ]
    },
    {
      "id": "mbqno25",
      "author": "underthesauceyuh",
      "body": "If the weight wasn’t the trigger, why bother to mention it? \n\nIf you’re a low empathy person, that’s valid. That’s something that can be treated with mental health professionals if you’re open to that. But that’s not an anorexia nervosa issue and it’s not appropriate for this subreddit. There were plenty of ways to rephrase this post but it’s pretty clear that the man’s weight played a role in your reaction and not just the fact that he was eating in public. If it wasn’t about weight at all, then that wasn’t clear. \n\nThis is not only not helpful for this subreddit, it’s harmful. I’m sure there’s other places on Reddit that you can rant and rave about this. While it’s not a “pro-recovery sub” the people here are so petrified of being fat and/or eating in public that they’d rather die than be perceived this way. And if you are struggling I’m sorry, genuinely. It sucks. But some of this post is actively pro-ED and perpetuating harmful stereotypes. Being afraid of fat people (not your body) isn’t a symptom of being anorexic, it’s a symptom of a deeper issue. It doesn’t belong here.",
      "created_utc": 1739054942.0,
      "score": 12,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        },
        {
          "id": "mbqko75",
          "author": "None",
          "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
          "created_utc": 1739053995.0
        }
      ]
    },
    {
      "id": "mbrebtt",
      "author": "None",
      "body": "Nah, you should have definitely sat this one out. I’ve been doing great with my mental health, but reading your post made me lowK sad, very heartbreaking to read. \n\nYour post DOES come off as you were disgusted with an “obese” person simply eating, hence, that’s why you mentioned their weight. \n\nThis post gives me “hateful POS” vibes. \n\nI have atypical Ana so I’ve been on both weight sides. I’m currently on the heavier side and this post actually made me feel bad. Now, I’ll have to have this post in my head when eating around people, which I probably won’t for a while after reading this. \n\nIt really, really sucks that you framed your post in such way. Do better, communicate better. 😑\n\nI hope that guy enjoyed his meal 😮‍💨",
      "created_utc": 1739063957.0,
      "score": 4,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        },
        {
          "id": "mbqko75",
          "author": "None",
          "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
          "created_utc": 1739053995.0
        }
      ]
    },
    {
      "id": "mbq4ytr",
      "author": "underthesauceyuh",
      "body": "This is the comment that deserves a reddit award. This is exactly what I was trying to convey and I think you said it way better than I could.",
      "created_utc": 1739049198.0,
      "score": 3,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbotogv",
          "author": "brookleiaway",
          "body": "its almost like eating disorders make people think differently",
          "created_utc": 1739035493.0
        },
        {
          "id": "mbpawwc",
          "author": "Condemned2Be",
          "body": "Just because you have a toxic thought doesn’t entitle you to share it & revel with others in it. Sure, some people here are now agreeing with her, & you see where it led. Now we have comments saying anytime an obese person eats they are “showing off their illness” & honestly, you tell me how it helps.\n\nWho does it comfort? Do YOU feel better knowing more than one person on earth hates seeing fat people eat? Because that’s how it’s worded. Instead of seeking support for the feelings (“how do you deal with triggers?”), the post seeks validation (“who else is triggered by this?”). So the comments aren’t even constructive, they are just anecdotes about disliking the overweight.\n\nJust because we are disordered doesn’t give us a pass to be toxic. We can still do better.",
          "created_utc": 1739040423.0
        }
      ]
    },
    {
      "id": "mbrnfhj",
      "author": "HerrRotZwiebel",
      "body": "OP is also assuming that person has an ED. You can be obese just because you overeat. Hell, you can become obese just by getting a sugar bomb from $bux every day. That doesn't make one disordered (in the ED sense) in any way, shape, or form.",
      "created_utc": 1739067156.0,
      "score": 2,
      "context": [
        {
          "id": "mbqlfol",
          "author": "lapischerry",
          "body": "I think including that he’s obese and being judgy about him eating is shaming him regardless of what your intent is with the post. the outcome is it reads to others as judgmental and shameful.",
          "created_utc": 1739054237.0
        },
        {
          "id": "mbqlxer",
          "author": "None",
          "body": "I included obese to show that he and I are on the total opposite ends of the eating disorder spectrum. I find it odd that if he was thin and I said \"triggered by a thin man on the bus\" no one would consider it judgy. \n\nMy '*triggered*' thoughts didn't address his weight. It was the smell of food and consumption of calories.",
          "created_utc": 1739054392.0
        },
        {
          "id": "mbqmqo3",
          "author": "lapischerry",
          "body": "again, it’s less about your intention with the post and more to do with the result of it. you’re judging him by his caloric intake, and that is shaming the person already. it doesn’t hurt to be honest or curious with yourself about judgments you’re inclined to excuse or write off.",
          "created_utc": 1739054647.0
        }
      ]
    },
    {
      "id": "mbqozsd",
      "author": "None",
      "body": "I couldn't. Even at work seeing my coworkers eating in the cafeteria is uncomfortable.",
      "created_utc": 1739055364.0,
      "score": 1,
      "context": [
        {
          "id": "mbqgozx",
          "author": "Fluttery_Soul",
          "body": "Yeah...I work at a fast food restaurant and every shift I have to make these high calorie foods and see people take it and eat it and all I see is the numbers and I just get so uneasy...\n\n\nIt almost feels as if I'm the one eating it but I also feel guilty knowing how 'unhealhty' the food is and giving it to them. In my head, I think \"if only they know what they're eating...\"\n\n\nI know it's just my Ed voice bc I'd never judge someone's choices like that but the repulsed feeling is still there.",
          "created_utc": 1739052744.0
        },
        {
          "id": "mbqkr29",
          "author": "None",
          "body": "This is why I can't be in fast food places. All those calories!",
          "created_utc": 1739054020.0
        },
        {
          "id": "mbqogzz",
          "author": "Fluttery_Soul",
          "body": "I knoww 😭 it's triggers left and right",
          "created_utc": 1739055199.0
        }
      ]
    },
    {
      "id": "mboqtgu",
      "author": "Additional-Problem99",
      "body": "It can also be a result of medical issues, including eating disorders. We shouldn’t shame anyone for their weight, and calling someone a “glutton” is just cruel.",
      "created_utc": 1739034661.0,
      "score": 11,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        }
      ]
    },
    {
      "id": "mboqubf",
      "author": "Froggymushroomfrog",
      "body": "Actually multiple health conditions and medications can cause people to become obese. Check your facts before you state something",
      "created_utc": 1739034668.0,
      "score": 7,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        }
      ]
    },
    {
      "id": "mbprni5",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 14: spreading misinformation is disallowed. \n\nMisinformation runs rampant in mental health communities and we are not the exception. In an effort to stop the spread, this rule has been implemented: Users are encouraged to add sources to their posts and comments if they include little-known facts or any statistics. Adding these sources not only adds proof to what you are saying, but also encourages others to do research on their own about the topic. \n\nHowever, spreading blatant misinformation or dirty data isn't allowed here. We strive to remain factual and truthful, which this rule is meant to encourage and reinforce. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1739045249.0,
      "score": 2,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        }
      ]
    },
    {
      "id": "mbosjvq",
      "author": "BeatnikMona",
      "body": "Obesity is a result of how your body handles insulin. It is commonly associated with your diet, but lots of medications and other health conditions or disabilities can affect this as well. There’s also a lot of obese people with an ED who have difficulty losing weight because they don’t eat enough. \n\nIt’s like saying that people are only thin if they have an ED. It’s not the case for everyone.",
      "created_utc": 1739035165.0,
      "score": 3,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        }
      ]
    },
    {
      "id": "mboujp6",
      "author": "Ashamed_Ad8162",
      "body": "Nope. That’s not how it works for everyone. People can be anorexic at any weight, and still not lose weight. There’s a lot of doctors and clinicians that would disagree with you.",
      "created_utc": 1739035746.0,
      "score": 1,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        }
      ]
    },
    {
      "id": "mbr35uh",
      "author": "None",
      "body": ">*I find a LOT of ed people have this holier than thou mindset if they don’t do or think certain things other ed people do.* \n\n  \nand here I made it ***crystal clear*** in my post that I am no better than him because I'm underweight. We both have an eating disorder and both slowly killing ourselves.\n\nI'm honestly considering leaving this \"*support*\" sub. I get slapped down every time I post and it's getting draining. Anorexia already takes a toll on me. I don't need fellow sufferers putting malice behind my posts and trying to \"correct\" my behavior.",
      "created_utc": 1739060108.0,
      "score": 2,
      "context": [
        {
          "id": "mbpiedo",
          "author": "Expert_Sail3923",
          "body": "hey i’m sorry people are being so weird about this post. you have a DISORDER that changes your thought patterns and makes you think things you don’t necessarily agree with. Is it people with OCD’s fault for thinking the things they think even if they hate it? what you’re feeling is normal even if it’s not a great thought, and you’re not even saying you like feeling like this. don’t let these people make you think you’re a bad person, you’re just a person with mental illness.",
          "created_utc": 1739042568.0
        },
        {
          "id": "mbql5fi",
          "author": "None",
          "body": "Because people always enjoy putting malice behind my words and behaviors. \n\n  \nI never once thought the man was disgusting or a bad person because he's obese. He's a person like I am just on the opposite ends of the eating disorder spectrum.",
          "created_utc": 1739054147.0
        },
        {
          "id": "mbr1i24",
          "author": "Expert_Sail3923",
          "body": "You literally didn’t say anything wrong! People are choosing to hear what they want from what you wrote. I find a LOT of ed people have this holier than thou mindset if they don’t do or think certain things other ed people do. You’re expressing your discomfort with how YOUR ed makes you feel. You literally specifically said you weren’t shaming him!",
          "created_utc": 1739059537.0
        }
      ]
    },
    {
      "id": "mbr36nt",
      "author": "Additional-Problem99",
      "body": "Why was it necessary to bring up his weight then? If it was him eating food that triggered you and not his weight, why mention him being “morbidly obese”?\n\nEdit: I’m not saying you’re a bad person or anything. Just that it seems his weight was more of a trigger than you might realize.",
      "created_utc": 1739060115.0,
      "score": 0,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbotgmi",
          "author": "brookleiaway",
          "body": "i would be triggered if anybody was unhealthily over or underweight. not sure why its ok to be triggered by underweight people here but the moment someones overweight its fine",
          "created_utc": 1739035430.0
        },
        {
          "id": "mbp1hiq",
          "author": "Additional-Problem99",
          "body": "The problem is body shaming, which isn’t okay in either direction. However, fat people do face more discrimination than skinny people. That doesn’t make shaming people for being thin and/or underweight okay, but shaming fat people is considered socially acceptable.",
          "created_utc": 1739037740.0
        },
        {
          "id": "mbqh5vh",
          "author": "None",
          "body": "I made it very clear in my post I was not to body shame him because at the end of the say, we both have an eating disorder.",
          "created_utc": 1739052890.0
        }
      ]
    },
    {
      "id": "mbpap2a",
      "author": "Additional-Problem99",
      "body": "People tend to show concern towards people who are underweight. They show disgust for people who are overweight.",
      "created_utc": 1739040362.0,
      "score": 6,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbotgmi",
          "author": "brookleiaway",
          "body": "i would be triggered if anybody was unhealthily over or underweight. not sure why its ok to be triggered by underweight people here but the moment someones overweight its fine",
          "created_utc": 1739035430.0
        },
        {
          "id": "mbp1hiq",
          "author": "Additional-Problem99",
          "body": "The problem is body shaming, which isn’t okay in either direction. However, fat people do face more discrimination than skinny people. That doesn’t make shaming people for being thin and/or underweight okay, but shaming fat people is considered socially acceptable.",
          "created_utc": 1739037740.0
        },
        {
          "id": "mbp59so",
          "author": "phun_hog",
          "body": "I agree with this about this never being OK. I'm not sure if I believe it's less socially acceptable to body-shame skinny people, though. My personal experience is that far more people comment on my underweight body than my overweight body.",
          "created_utc": 1739038828.0
        }
      ]
    },
    {
      "id": "mbqr41r",
      "author": "Froggymushroomfrog",
      "body": "You didn’t - you could have said “ps I’m not triggered by his weight and feel the same when co workers of any size have lunch etc. I’m triggered by the eating of food not of the man being obese”.",
      "created_utc": 1739056053.0,
      "score": 7,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbqh9xy",
          "author": "None",
          "body": "Yes. It was the consumption of all those calories that triggered me. Like the thought of eating all those calories is what triggered me.",
          "created_utc": 1739052925.0
        },
        {
          "id": "mbqoadi",
          "author": "Froggymushroomfrog",
          "body": "You should have explained it in your post because it does come off as it was specifically him being obese that bothered you. Why did you need to add obese to the title?",
          "created_utc": 1739055138.0
        },
        {
          "id": "mbqov2a",
          "author": "None",
          "body": "I did but people are disregarding/ignoring it.",
          "created_utc": 1739055322.0
        }
      ]
    },
    {
      "id": "mbqopbb",
      "author": "None",
      "body": "You are putting malice behind my words and I don't appreciate it. \n\nI put his weight to show that he and I are on the the opposite ends of the eating disorder spectrum. That makes me no better than he is. I never ONCE thought I was better than he was because I'm underweight. We're both struggling. \n\nYou have no idea what was going through my mind when I was sitting on the bus. I did NOT get up and yell at him. I didn't even say anything. I was posting about the intrusive thoughts I was having over a bag of fast food and calorie intake. Being triggered by calories and consumption of them IS a trait of anorexia. \n\n  \nI find it strange that people wouldn't say I was judgy if I had put \"triggered by a thin man on the bus\".  If this post didn't belong on this sub the mods would have removed it so I'm going to disregard you gatekeeping.",
      "created_utc": 1739055273.0,
      "score": -7,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        },
        {
          "id": "mbqko75",
          "author": "None",
          "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
          "created_utc": 1739053995.0
        },
        {
          "id": "mbqno25",
          "author": "underthesauceyuh",
          "body": "If the weight wasn’t the trigger, why bother to mention it? \n\nIf you’re a low empathy person, that’s valid. That’s something that can be treated with mental health professionals if you’re open to that. But that’s not an anorexia nervosa issue and it’s not appropriate for this subreddit. There were plenty of ways to rephrase this post but it’s pretty clear that the man’s weight played a role in your reaction and not just the fact that he was eating in public. If it wasn’t about weight at all, then that wasn’t clear. \n\nThis is not only not helpful for this subreddit, it’s harmful. I’m sure there’s other places on Reddit that you can rant and rave about this. While it’s not a “pro-recovery sub” the people here are so petrified of being fat and/or eating in public that they’d rather die than be perceived this way. And if you are struggling I’m sorry, genuinely. It sucks. But some of this post is actively pro-ED and perpetuating harmful stereotypes. Being afraid of fat people (not your body) isn’t a symptom of being anorexic, it’s a symptom of a deeper issue. It doesn’t belong here.",
          "created_utc": 1739054942.0
        }
      ]
    },
    {
      "id": "mbrgeob",
      "author": "None",
      "body": "No need to call me names. If you don't like the post just move on.",
      "created_utc": 1739064687.0,
      "score": -1,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        },
        {
          "id": "mbqko75",
          "author": "None",
          "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
          "created_utc": 1739053995.0
        },
        {
          "id": "mbrebtt",
          "author": "None",
          "body": "Nah, you should have definitely sat this one out. I’ve been doing great with my mental health, but reading your post made me lowK sad, very heartbreaking to read. \n\nYour post DOES come off as you were disgusted with an “obese” person simply eating, hence, that’s why you mentioned their weight. \n\nThis post gives me “hateful POS” vibes. \n\nI have atypical Ana so I’ve been on both weight sides. I’m currently on the heavier side and this post actually made me feel bad. Now, I’ll have to have this post in my head when eating around people, which I probably won’t for a while after reading this. \n\nIt really, really sucks that you framed your post in such way. Do better, communicate better. 😑\n\nI hope that guy enjoyed his meal 😮‍💨",
          "created_utc": 1739063957.0
        }
      ]
    },
    {
      "id": "mboqyql",
      "author": "Suspicious_Force_890",
      "body": "yeah ur right i hate that word its just mean",
      "created_utc": 1739034703.0,
      "score": -1,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mboqtgu",
          "author": "Additional-Problem99",
          "body": "It can also be a result of medical issues, including eating disorders. We shouldn’t shame anyone for their weight, and calling someone a “glutton” is just cruel.",
          "created_utc": 1739034661.0
        }
      ]
    },
    {
      "id": "mborniq",
      "author": "Suspicious_Force_890",
      "body": "those health conditions and medications can increase appetite and/or make it harder to burn calories. they don’t guarantee obesity",
      "created_utc": 1739034903.0,
      "score": -2,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mboqubf",
          "author": "Froggymushroomfrog",
          "body": "Actually multiple health conditions and medications can cause people to become obese. Check your facts before you state something",
          "created_utc": 1739034668.0
        }
      ]
    },
    {
      "id": "mbot1jp",
      "author": "Suspicious_Force_890",
      "body": "i’ve discussed some examples of medications and health conditions in my other comment, but not eating enough will never make you gain weight. that’s physically impossible",
      "created_utc": 1739035307.0,
      "score": 7,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mbosjvq",
          "author": "BeatnikMona",
          "body": "Obesity is a result of how your body handles insulin. It is commonly associated with your diet, but lots of medications and other health conditions or disabilities can affect this as well. There’s also a lot of obese people with an ED who have difficulty losing weight because they don’t eat enough. \n\nIt’s like saying that people are only thin if they have an ED. It’s not the case for everyone.",
          "created_utc": 1739035165.0
        }
      ]
    },
    {
      "id": "mbov76v",
      "author": "Suspicious_Force_890",
      "body": "if someone eats less calories than they expend, they will lose weight (sometimes they’ll plateau for a while at first or during). \n\npeople can absolutely have an eating disorder at any weight, i didn’t say otherwise",
      "created_utc": 1739035937.0,
      "score": 2,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mboujp6",
          "author": "Ashamed_Ad8162",
          "body": "Nope. That’s not how it works for everyone. People can be anorexic at any weight, and still not lose weight. There’s a lot of doctors and clinicians that would disagree with you.",
          "created_utc": 1739035746.0
        }
      ]
    },
    {
      "id": "mbr4mvs",
      "author": "Expert_Sail3923",
      "body": "i feel the same way. people on here are rude and have no sympathy for others. whatever i post i get labeled as toxic and unhealthy. i’m sorry that what is supposed to be a supportive group failed you. try bluesky! people on there are actually nice and understand not everyone is perfect.",
      "created_utc": 1739060614.0,
      "score": 1,
      "context": [
        {
          "id": "mbpiedo",
          "author": "Expert_Sail3923",
          "body": "hey i’m sorry people are being so weird about this post. you have a DISORDER that changes your thought patterns and makes you think things you don’t necessarily agree with. Is it people with OCD’s fault for thinking the things they think even if they hate it? what you’re feeling is normal even if it’s not a great thought, and you’re not even saying you like feeling like this. don’t let these people make you think you’re a bad person, you’re just a person with mental illness.",
          "created_utc": 1739042568.0
        },
        {
          "id": "mbql5fi",
          "author": "None",
          "body": "Because people always enjoy putting malice behind my words and behaviors. \n\n  \nI never once thought the man was disgusting or a bad person because he's obese. He's a person like I am just on the opposite ends of the eating disorder spectrum.",
          "created_utc": 1739054147.0
        },
        {
          "id": "mbr1i24",
          "author": "Expert_Sail3923",
          "body": "You literally didn’t say anything wrong! People are choosing to hear what they want from what you wrote. I find a LOT of ed people have this holier than thou mindset if they don’t do or think certain things other ed people do. You’re expressing your discomfort with how YOUR ed makes you feel. You literally specifically said you weren’t shaming him!",
          "created_utc": 1739059537.0
        },
        {
          "id": "mbr35uh",
          "author": "None",
          "body": ">*I find a LOT of ed people have this holier than thou mindset if they don’t do or think certain things other ed people do.* \n\n  \nand here I made it ***crystal clear*** in my post that I am no better than him because I'm underweight. We both have an eating disorder and both slowly killing ourselves.\n\nI'm honestly considering leaving this \"*support*\" sub. I get slapped down every time I post and it's getting draining. Anorexia already takes a toll on me. I don't need fellow sufferers putting malice behind my posts and trying to \"correct\" my behavior.",
          "created_utc": 1739060108.0
        }
      ]
    },
    {
      "id": "mbr3w4k",
      "author": "None",
      "body": "I'm not going to continue justifying my wording because you and others want to put malice behind my words. I don't owe you an explanation. You made it clear you don't agree with my post. Leave me alone.",
      "created_utc": 1739060359.0,
      "score": 8,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbotgmi",
          "author": "brookleiaway",
          "body": "i would be triggered if anybody was unhealthily over or underweight. not sure why its ok to be triggered by underweight people here but the moment someones overweight its fine",
          "created_utc": 1739035430.0
        },
        {
          "id": "mbp1hiq",
          "author": "Additional-Problem99",
          "body": "The problem is body shaming, which isn’t okay in either direction. However, fat people do face more discrimination than skinny people. That doesn’t make shaming people for being thin and/or underweight okay, but shaming fat people is considered socially acceptable.",
          "created_utc": 1739037740.0
        },
        {
          "id": "mbqh5vh",
          "author": "None",
          "body": "I made it very clear in my post I was not to body shame him because at the end of the say, we both have an eating disorder.",
          "created_utc": 1739052890.0
        },
        {
          "id": "mbr36nt",
          "author": "Additional-Problem99",
          "body": "Why was it necessary to bring up his weight then? If it was him eating food that triggered you and not his weight, why mention him being “morbidly obese”?\n\nEdit: I’m not saying you’re a bad person or anything. Just that it seems his weight was more of a trigger than you might realize.",
          "created_utc": 1739060115.0
        }
      ]
    },
    {
      "id": "mbybmum",
      "author": "Top_Conversation_976",
      "body": "This is such a reach",
      "created_utc": 1739155924.0,
      "score": 0,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbotgmi",
          "author": "brookleiaway",
          "body": "i would be triggered if anybody was unhealthily over or underweight. not sure why its ok to be triggered by underweight people here but the moment someones overweight its fine",
          "created_utc": 1739035430.0
        },
        {
          "id": "mbp1hiq",
          "author": "Additional-Problem99",
          "body": "The problem is body shaming, which isn’t okay in either direction. However, fat people do face more discrimination than skinny people. That doesn’t make shaming people for being thin and/or underweight okay, but shaming fat people is considered socially acceptable.",
          "created_utc": 1739037740.0
        },
        {
          "id": "mbqh5vh",
          "author": "None",
          "body": "I made it very clear in my post I was not to body shame him because at the end of the say, we both have an eating disorder.",
          "created_utc": 1739052890.0
        },
        {
          "id": "mbr36nt",
          "author": "Additional-Problem99",
          "body": "Why was it necessary to bring up his weight then? If it was him eating food that triggered you and not his weight, why mention him being “morbidly obese”?\n\nEdit: I’m not saying you’re a bad person or anything. Just that it seems his weight was more of a trigger than you might realize.",
          "created_utc": 1739060115.0
        }
      ]
    },
    {
      "id": "mbqra5g",
      "author": "underthesauceyuh",
      "body": "I appreciate you clearing that up because your intentions make more sense than they did in the original post.\n\nStill- you can’t assume when people have eating disorders. Obesity doesn’t equate to an eating disorder. Sometimes it’s a medical issue with a lack of access to healthcare, sometimes it’s medication that causes rapid weight gain and they are to figure out how to balance hormones. I had a friend that became overweight in 3 weeks due to chemo. You made an assumption. \n\nAnd yes, I think the “thin person triggered…” would get less attention on this sub. Because the main symptom of this illness is a fear of gaining weight. And when you post about a regular man, at a higher weight, just living his day to day life without knowing his health status and then making it sound like you’re disgusted by this person… how do you think the audience of this subreddit will react? I’m not talking about the comments, I’m not talking about myself. Imagine a fat (by bmi standards) person with an eating disorder coming across this post. Imagine how that would feel. \n\nYou’re not the only person who has posted something along these lines and you won’t be the last. I don’t know how mods would implement a rule to prevent these kind of posts because everyone has their threshold. This crossed a line for me, personally. It’s okay if it doesn’t for you or anyone else. But I will express my opinion, just like others have.\n\nI don’t know how this post could possibly benefit anyone, even to commiserate. This could set people back if their fear is eating in public. It just makes me sad because this sub is so vulnerable. I am mindful of that whenever I have posted or commented.",
      "created_utc": 1739056107.0,
      "score": 7,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        },
        {
          "id": "mbqko75",
          "author": "None",
          "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
          "created_utc": 1739053995.0
        },
        {
          "id": "mbqno25",
          "author": "underthesauceyuh",
          "body": "If the weight wasn’t the trigger, why bother to mention it? \n\nIf you’re a low empathy person, that’s valid. That’s something that can be treated with mental health professionals if you’re open to that. But that’s not an anorexia nervosa issue and it’s not appropriate for this subreddit. There were plenty of ways to rephrase this post but it’s pretty clear that the man’s weight played a role in your reaction and not just the fact that he was eating in public. If it wasn’t about weight at all, then that wasn’t clear. \n\nThis is not only not helpful for this subreddit, it’s harmful. I’m sure there’s other places on Reddit that you can rant and rave about this. While it’s not a “pro-recovery sub” the people here are so petrified of being fat and/or eating in public that they’d rather die than be perceived this way. And if you are struggling I’m sorry, genuinely. It sucks. But some of this post is actively pro-ED and perpetuating harmful stereotypes. Being afraid of fat people (not your body) isn’t a symptom of being anorexic, it’s a symptom of a deeper issue. It doesn’t belong here.",
          "created_utc": 1739054942.0
        },
        {
          "id": "mbqopbb",
          "author": "None",
          "body": "You are putting malice behind my words and I don't appreciate it. \n\nI put his weight to show that he and I are on the the opposite ends of the eating disorder spectrum. That makes me no better than he is. I never ONCE thought I was better than he was because I'm underweight. We're both struggling. \n\nYou have no idea what was going through my mind when I was sitting on the bus. I did NOT get up and yell at him. I didn't even say anything. I was posting about the intrusive thoughts I was having over a bag of fast food and calorie intake. Being triggered by calories and consumption of them IS a trait of anorexia. \n\n  \nI find it strange that people wouldn't say I was judgy if I had put \"triggered by a thin man on the bus\".  If this post didn't belong on this sub the mods would have removed it so I'm going to disregard you gatekeeping.",
          "created_utc": 1739055273.0
        }
      ]
    },
    {
      "id": "mbri6c9",
      "author": "None",
      "body": "Obesity doesn’t automatically equal eating disorder. Man this whole post is so out of touch TBH .",
      "created_utc": 1739065304.0,
      "score": 3,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        },
        {
          "id": "mbqko75",
          "author": "None",
          "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
          "created_utc": 1739053995.0
        },
        {
          "id": "mbqno25",
          "author": "underthesauceyuh",
          "body": "If the weight wasn’t the trigger, why bother to mention it? \n\nIf you’re a low empathy person, that’s valid. That’s something that can be treated with mental health professionals if you’re open to that. But that’s not an anorexia nervosa issue and it’s not appropriate for this subreddit. There were plenty of ways to rephrase this post but it’s pretty clear that the man’s weight played a role in your reaction and not just the fact that he was eating in public. If it wasn’t about weight at all, then that wasn’t clear. \n\nThis is not only not helpful for this subreddit, it’s harmful. I’m sure there’s other places on Reddit that you can rant and rave about this. While it’s not a “pro-recovery sub” the people here are so petrified of being fat and/or eating in public that they’d rather die than be perceived this way. And if you are struggling I’m sorry, genuinely. It sucks. But some of this post is actively pro-ED and perpetuating harmful stereotypes. Being afraid of fat people (not your body) isn’t a symptom of being anorexic, it’s a symptom of a deeper issue. It doesn’t belong here.",
          "created_utc": 1739054942.0
        },
        {
          "id": "mbqopbb",
          "author": "None",
          "body": "You are putting malice behind my words and I don't appreciate it. \n\nI put his weight to show that he and I are on the the opposite ends of the eating disorder spectrum. That makes me no better than he is. I never ONCE thought I was better than he was because I'm underweight. We're both struggling. \n\nYou have no idea what was going through my mind when I was sitting on the bus. I did NOT get up and yell at him. I didn't even say anything. I was posting about the intrusive thoughts I was having over a bag of fast food and calorie intake. Being triggered by calories and consumption of them IS a trait of anorexia. \n\n  \nI find it strange that people wouldn't say I was judgy if I had put \"triggered by a thin man on the bus\".  If this post didn't belong on this sub the mods would have removed it so I'm going to disregard you gatekeeping.",
          "created_utc": 1739055273.0
        }
      ]
    },
    {
      "id": "mborxry",
      "author": "Froggymushroomfrog",
      "body": "Ever heard of cushing syndrome? That’s nothing to do with appetite, also the anti psychotic clozapine causes you to gain weight without making your appetite higher.",
      "created_utc": 1739034985.0,
      "score": 8,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mboqubf",
          "author": "Froggymushroomfrog",
          "body": "Actually multiple health conditions and medications can cause people to become obese. Check your facts before you state something",
          "created_utc": 1739034668.0
        },
        {
          "id": "mborniq",
          "author": "Suspicious_Force_890",
          "body": "those health conditions and medications can increase appetite and/or make it harder to burn calories. they don’t guarantee obesity",
          "created_utc": 1739034903.0
        }
      ]
    },
    {
      "id": "mbotgtm",
      "author": "BeatnikMona",
      "body": "* makes you retain weight, sorry.",
      "created_utc": 1739035432.0,
      "score": 3,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mbosjvq",
          "author": "BeatnikMona",
          "body": "Obesity is a result of how your body handles insulin. It is commonly associated with your diet, but lots of medications and other health conditions or disabilities can affect this as well. There’s also a lot of obese people with an ED who have difficulty losing weight because they don’t eat enough. \n\nIt’s like saying that people are only thin if they have an ED. It’s not the case for everyone.",
          "created_utc": 1739035165.0
        },
        {
          "id": "mbot1jp",
          "author": "Suspicious_Force_890",
          "body": "i’ve discussed some examples of medications and health conditions in my other comment, but not eating enough will never make you gain weight. that’s physically impossible",
          "created_utc": 1739035307.0
        }
      ]
    },
    {
      "id": "mbpcj37",
      "author": "Additional-Problem99",
      "body": "Actually, you can gain weight while eating less. I was putting on weight despite eating less and less, and making healthier choices. Turns out I had a large ovarian cyst, which was also causing a lot of painful bloating, making people assume I was overweight.",
      "created_utc": 1739040883.0,
      "score": 4,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mboujp6",
          "author": "Ashamed_Ad8162",
          "body": "Nope. That’s not how it works for everyone. People can be anorexic at any weight, and still not lose weight. There’s a lot of doctors and clinicians that would disagree with you.",
          "created_utc": 1739035746.0
        },
        {
          "id": "mbov76v",
          "author": "Suspicious_Force_890",
          "body": "if someone eats less calories than they expend, they will lose weight (sometimes they’ll plateau for a while at first or during). \n\npeople can absolutely have an eating disorder at any weight, i didn’t say otherwise",
          "created_utc": 1739035937.0
        }
      ]
    },
    {
      "id": "mbr58gb",
      "author": "None",
      "body": "I noticed the treatment is even worse when someone is low empathy like I am. We get labeled as a bad person, inhumane, psychopaths, or inherently evil. NONE of this is true. Very few people in the population are legit psychopaths and I am not one. \n\nMy first thought when I saw the man on the bus was NOT how disgusting he was or how he had no \"self control\". I actually felt a pang of sympathy because I am aware he is probably judged left and right. He looked as miserable as I am. Probably trapped in the viscous cycle of a deadly eating disorder.",
      "created_utc": 1739060821.0,
      "score": 2,
      "context": [
        {
          "id": "mbpiedo",
          "author": "Expert_Sail3923",
          "body": "hey i’m sorry people are being so weird about this post. you have a DISORDER that changes your thought patterns and makes you think things you don’t necessarily agree with. Is it people with OCD’s fault for thinking the things they think even if they hate it? what you’re feeling is normal even if it’s not a great thought, and you’re not even saying you like feeling like this. don’t let these people make you think you’re a bad person, you’re just a person with mental illness.",
          "created_utc": 1739042568.0
        },
        {
          "id": "mbql5fi",
          "author": "None",
          "body": "Because people always enjoy putting malice behind my words and behaviors. \n\n  \nI never once thought the man was disgusting or a bad person because he's obese. He's a person like I am just on the opposite ends of the eating disorder spectrum.",
          "created_utc": 1739054147.0
        },
        {
          "id": "mbr1i24",
          "author": "Expert_Sail3923",
          "body": "You literally didn’t say anything wrong! People are choosing to hear what they want from what you wrote. I find a LOT of ed people have this holier than thou mindset if they don’t do or think certain things other ed people do. You’re expressing your discomfort with how YOUR ed makes you feel. You literally specifically said you weren’t shaming him!",
          "created_utc": 1739059537.0
        },
        {
          "id": "mbr35uh",
          "author": "None",
          "body": ">*I find a LOT of ed people have this holier than thou mindset if they don’t do or think certain things other ed people do.* \n\n  \nand here I made it ***crystal clear*** in my post that I am no better than him because I'm underweight. We both have an eating disorder and both slowly killing ourselves.\n\nI'm honestly considering leaving this \"*support*\" sub. I get slapped down every time I post and it's getting draining. Anorexia already takes a toll on me. I don't need fellow sufferers putting malice behind my posts and trying to \"correct\" my behavior.",
          "created_utc": 1739060108.0
        },
        {
          "id": "mbr4mvs",
          "author": "Expert_Sail3923",
          "body": "i feel the same way. people on here are rude and have no sympathy for others. whatever i post i get labeled as toxic and unhealthy. i’m sorry that what is supposed to be a supportive group failed you. try bluesky! people on there are actually nice and understand not everyone is perfect.",
          "created_utc": 1739060614.0
        }
      ]
    },
    {
      "id": "mbx01cq",
      "author": "newmommy1994",
      "body": "You made a choice and now you have to face consequences related to it. That’s life. There was no reason to comment on his size. It seems you’re the type to say no offense then say something offensive and get mad when people take offense.",
      "created_utc": 1739139971.0,
      "score": 3,
      "context": [
        {
          "id": "mbokb3m",
          "author": "Froggymushroomfrog",
          "body": "Genuine question- if that man was skinny but eating take out food he had would it have triggered you? If it wouldn’t then it’s not the food that triggered you",
          "created_utc": 1739032759.0
        },
        {
          "id": "mbotgmi",
          "author": "brookleiaway",
          "body": "i would be triggered if anybody was unhealthily over or underweight. not sure why its ok to be triggered by underweight people here but the moment someones overweight its fine",
          "created_utc": 1739035430.0
        },
        {
          "id": "mbp1hiq",
          "author": "Additional-Problem99",
          "body": "The problem is body shaming, which isn’t okay in either direction. However, fat people do face more discrimination than skinny people. That doesn’t make shaming people for being thin and/or underweight okay, but shaming fat people is considered socially acceptable.",
          "created_utc": 1739037740.0
        },
        {
          "id": "mbqh5vh",
          "author": "None",
          "body": "I made it very clear in my post I was not to body shame him because at the end of the say, we both have an eating disorder.",
          "created_utc": 1739052890.0
        },
        {
          "id": "mbr36nt",
          "author": "Additional-Problem99",
          "body": "Why was it necessary to bring up his weight then? If it was him eating food that triggered you and not his weight, why mention him being “morbidly obese”?\n\nEdit: I’m not saying you’re a bad person or anything. Just that it seems his weight was more of a trigger than you might realize.",
          "created_utc": 1739060115.0
        },
        {
          "id": "mbr3w4k",
          "author": "None",
          "body": "I'm not going to continue justifying my wording because you and others want to put malice behind my words. I don't owe you an explanation. You made it clear you don't agree with my post. Leave me alone.",
          "created_utc": 1739060359.0
        }
      ]
    },
    {
      "id": "mbrmmi5",
      "author": "HerrRotZwiebel",
      "body": ">Imagine a fat (by bmi standards) person with an eating disorder coming across this post. \n\nThat would be me. The best part is Atypical AN is A Thing, so some of us fat people can (and do) have EDs that are restrictive in nature. (And to your other point, it's quite possible to overeat and get fat and not have any disordered behaviors.)\n\n>Imagine how that would feel.\n\nTBH, I just sit there and say to myself, \"I am that person you are so goddammed afraid of becoming.\" If it's just a \"fat people trigger me\" post, then I report it under Rule 3, which includes \"being rude\". Sometimes I might write \"we exist, please be careful\" if it's a less hostile post.",
      "created_utc": 1739066870.0,
      "score": 8,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        },
        {
          "id": "mbqko75",
          "author": "None",
          "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
          "created_utc": 1739053995.0
        },
        {
          "id": "mbqno25",
          "author": "underthesauceyuh",
          "body": "If the weight wasn’t the trigger, why bother to mention it? \n\nIf you’re a low empathy person, that’s valid. That’s something that can be treated with mental health professionals if you’re open to that. But that’s not an anorexia nervosa issue and it’s not appropriate for this subreddit. There were plenty of ways to rephrase this post but it’s pretty clear that the man’s weight played a role in your reaction and not just the fact that he was eating in public. If it wasn’t about weight at all, then that wasn’t clear. \n\nThis is not only not helpful for this subreddit, it’s harmful. I’m sure there’s other places on Reddit that you can rant and rave about this. While it’s not a “pro-recovery sub” the people here are so petrified of being fat and/or eating in public that they’d rather die than be perceived this way. And if you are struggling I’m sorry, genuinely. It sucks. But some of this post is actively pro-ED and perpetuating harmful stereotypes. Being afraid of fat people (not your body) isn’t a symptom of being anorexic, it’s a symptom of a deeper issue. It doesn’t belong here.",
          "created_utc": 1739054942.0
        },
        {
          "id": "mbqopbb",
          "author": "None",
          "body": "You are putting malice behind my words and I don't appreciate it. \n\nI put his weight to show that he and I are on the the opposite ends of the eating disorder spectrum. That makes me no better than he is. I never ONCE thought I was better than he was because I'm underweight. We're both struggling. \n\nYou have no idea what was going through my mind when I was sitting on the bus. I did NOT get up and yell at him. I didn't even say anything. I was posting about the intrusive thoughts I was having over a bag of fast food and calorie intake. Being triggered by calories and consumption of them IS a trait of anorexia. \n\n  \nI find it strange that people wouldn't say I was judgy if I had put \"triggered by a thin man on the bus\".  If this post didn't belong on this sub the mods would have removed it so I'm going to disregard you gatekeeping.",
          "created_utc": 1739055273.0
        },
        {
          "id": "mbqra5g",
          "author": "underthesauceyuh",
          "body": "I appreciate you clearing that up because your intentions make more sense than they did in the original post.\n\nStill- you can’t assume when people have eating disorders. Obesity doesn’t equate to an eating disorder. Sometimes it’s a medical issue with a lack of access to healthcare, sometimes it’s medication that causes rapid weight gain and they are to figure out how to balance hormones. I had a friend that became overweight in 3 weeks due to chemo. You made an assumption. \n\nAnd yes, I think the “thin person triggered…” would get less attention on this sub. Because the main symptom of this illness is a fear of gaining weight. And when you post about a regular man, at a higher weight, just living his day to day life without knowing his health status and then making it sound like you’re disgusted by this person… how do you think the audience of this subreddit will react? I’m not talking about the comments, I’m not talking about myself. Imagine a fat (by bmi standards) person with an eating disorder coming across this post. Imagine how that would feel. \n\nYou’re not the only person who has posted something along these lines and you won’t be the last. I don’t know how mods would implement a rule to prevent these kind of posts because everyone has their threshold. This crossed a line for me, personally. It’s okay if it doesn’t for you or anyone else. But I will express my opinion, just like others have.\n\nI don’t know how this post could possibly benefit anyone, even to commiserate. This could set people back if their fear is eating in public. It just makes me sad because this sub is so vulnerable. I am mindful of that whenever I have posted or commented.",
          "created_utc": 1739056107.0
        }
      ]
    },
    {
      "id": "mbqsmxi",
      "author": "None",
      "body": ">*This crossed a line for me, personally. It’s okay if it doesn’t for you or anyone else. But I will express my opinion, just like others have.*\n\nThen just move on and don't reply. That's what I do if a post crosses a line for me. I just move on and don't reply.\n\n>*But I will express my opinion, just like others have. I am mindful of that whenever I have posted or commented.*\n\nYou didn't have to slap me down for having \"*lack of empathy*\".  I'm a person just like that man was. It seems because I lack empathy that makes me less of a person to you. Good for you that you're naturally empathetic. I'm not. I know this about myself. I get judged a lot for not being a naturally empathetic person. It's assumed I am a bad person and some even have told me it makes me \"*born evil*\". I'm not a bad or evil person and I do try to be aware of what I say/post. I do have autism so that makes it much harder.",
      "created_utc": 1739056550.0,
      "score": -4,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        },
        {
          "id": "mbqko75",
          "author": "None",
          "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
          "created_utc": 1739053995.0
        },
        {
          "id": "mbqno25",
          "author": "underthesauceyuh",
          "body": "If the weight wasn’t the trigger, why bother to mention it? \n\nIf you’re a low empathy person, that’s valid. That’s something that can be treated with mental health professionals if you’re open to that. But that’s not an anorexia nervosa issue and it’s not appropriate for this subreddit. There were plenty of ways to rephrase this post but it’s pretty clear that the man’s weight played a role in your reaction and not just the fact that he was eating in public. If it wasn’t about weight at all, then that wasn’t clear. \n\nThis is not only not helpful for this subreddit, it’s harmful. I’m sure there’s other places on Reddit that you can rant and rave about this. While it’s not a “pro-recovery sub” the people here are so petrified of being fat and/or eating in public that they’d rather die than be perceived this way. And if you are struggling I’m sorry, genuinely. It sucks. But some of this post is actively pro-ED and perpetuating harmful stereotypes. Being afraid of fat people (not your body) isn’t a symptom of being anorexic, it’s a symptom of a deeper issue. It doesn’t belong here.",
          "created_utc": 1739054942.0
        },
        {
          "id": "mbqopbb",
          "author": "None",
          "body": "You are putting malice behind my words and I don't appreciate it. \n\nI put his weight to show that he and I are on the the opposite ends of the eating disorder spectrum. That makes me no better than he is. I never ONCE thought I was better than he was because I'm underweight. We're both struggling. \n\nYou have no idea what was going through my mind when I was sitting on the bus. I did NOT get up and yell at him. I didn't even say anything. I was posting about the intrusive thoughts I was having over a bag of fast food and calorie intake. Being triggered by calories and consumption of them IS a trait of anorexia. \n\n  \nI find it strange that people wouldn't say I was judgy if I had put \"triggered by a thin man on the bus\".  If this post didn't belong on this sub the mods would have removed it so I'm going to disregard you gatekeeping.",
          "created_utc": 1739055273.0
        },
        {
          "id": "mbqra5g",
          "author": "underthesauceyuh",
          "body": "I appreciate you clearing that up because your intentions make more sense than they did in the original post.\n\nStill- you can’t assume when people have eating disorders. Obesity doesn’t equate to an eating disorder. Sometimes it’s a medical issue with a lack of access to healthcare, sometimes it’s medication that causes rapid weight gain and they are to figure out how to balance hormones. I had a friend that became overweight in 3 weeks due to chemo. You made an assumption. \n\nAnd yes, I think the “thin person triggered…” would get less attention on this sub. Because the main symptom of this illness is a fear of gaining weight. And when you post about a regular man, at a higher weight, just living his day to day life without knowing his health status and then making it sound like you’re disgusted by this person… how do you think the audience of this subreddit will react? I’m not talking about the comments, I’m not talking about myself. Imagine a fat (by bmi standards) person with an eating disorder coming across this post. Imagine how that would feel. \n\nYou’re not the only person who has posted something along these lines and you won’t be the last. I don’t know how mods would implement a rule to prevent these kind of posts because everyone has their threshold. This crossed a line for me, personally. It’s okay if it doesn’t for you or anyone else. But I will express my opinion, just like others have.\n\nI don’t know how this post could possibly benefit anyone, even to commiserate. This could set people back if their fear is eating in public. It just makes me sad because this sub is so vulnerable. I am mindful of that whenever I have posted or commented.",
          "created_utc": 1739056107.0
        }
      ]
    },
    {
      "id": "mbriqlj",
      "author": "None",
      "body": "Then stop replying and putting me down.",
      "created_utc": 1739065499.0,
      "score": 1,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        },
        {
          "id": "mbqko75",
          "author": "None",
          "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
          "created_utc": 1739053995.0
        },
        {
          "id": "mbqno25",
          "author": "underthesauceyuh",
          "body": "If the weight wasn’t the trigger, why bother to mention it? \n\nIf you’re a low empathy person, that’s valid. That’s something that can be treated with mental health professionals if you’re open to that. But that’s not an anorexia nervosa issue and it’s not appropriate for this subreddit. There were plenty of ways to rephrase this post but it’s pretty clear that the man’s weight played a role in your reaction and not just the fact that he was eating in public. If it wasn’t about weight at all, then that wasn’t clear. \n\nThis is not only not helpful for this subreddit, it’s harmful. I’m sure there’s other places on Reddit that you can rant and rave about this. While it’s not a “pro-recovery sub” the people here are so petrified of being fat and/or eating in public that they’d rather die than be perceived this way. And if you are struggling I’m sorry, genuinely. It sucks. But some of this post is actively pro-ED and perpetuating harmful stereotypes. Being afraid of fat people (not your body) isn’t a symptom of being anorexic, it’s a symptom of a deeper issue. It doesn’t belong here.",
          "created_utc": 1739054942.0
        },
        {
          "id": "mbqopbb",
          "author": "None",
          "body": "You are putting malice behind my words and I don't appreciate it. \n\nI put his weight to show that he and I are on the the opposite ends of the eating disorder spectrum. That makes me no better than he is. I never ONCE thought I was better than he was because I'm underweight. We're both struggling. \n\nYou have no idea what was going through my mind when I was sitting on the bus. I did NOT get up and yell at him. I didn't even say anything. I was posting about the intrusive thoughts I was having over a bag of fast food and calorie intake. Being triggered by calories and consumption of them IS a trait of anorexia. \n\n  \nI find it strange that people wouldn't say I was judgy if I had put \"triggered by a thin man on the bus\".  If this post didn't belong on this sub the mods would have removed it so I'm going to disregard you gatekeeping.",
          "created_utc": 1739055273.0
        },
        {
          "id": "mbri6c9",
          "author": "None",
          "body": "Obesity doesn’t automatically equal eating disorder. Man this whole post is so out of touch TBH .",
          "created_utc": 1739065304.0
        }
      ]
    },
    {
      "id": "mbospay",
      "author": "Suspicious_Force_890",
      "body": "cushings does stimulate appetite: https://pmc.ncbi.nlm.nih.gov/articles/PMC6189156/#:~:text=Nearly%20all%20patients%20with%20the,promote%20deposition%20of%20visceral%20fat.\n\nwe don’t know why clozapine causes weight gain so we can’t really say for certain on this one: https://www.hra.nhs.uk/planning-and-improving-research/application-summaries/research-summaries/why-does-clozapine-cause-weight-gain/",
      "created_utc": 1739035210.0,
      "score": 2,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mboqubf",
          "author": "Froggymushroomfrog",
          "body": "Actually multiple health conditions and medications can cause people to become obese. Check your facts before you state something",
          "created_utc": 1739034668.0
        },
        {
          "id": "mborniq",
          "author": "Suspicious_Force_890",
          "body": "those health conditions and medications can increase appetite and/or make it harder to burn calories. they don’t guarantee obesity",
          "created_utc": 1739034903.0
        },
        {
          "id": "mborxry",
          "author": "Froggymushroomfrog",
          "body": "Ever heard of cushing syndrome? That’s nothing to do with appetite, also the anti psychotic clozapine causes you to gain weight without making your appetite higher.",
          "created_utc": 1739034985.0
        }
      ]
    },
    {
      "id": "mbouca9",
      "author": "Suspicious_Force_890",
      "body": "not eating enough can slow your metabolism but if you’re eating less calories than you expend, you will soon lose weight",
      "created_utc": 1739035687.0,
      "score": 4,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mbosjvq",
          "author": "BeatnikMona",
          "body": "Obesity is a result of how your body handles insulin. It is commonly associated with your diet, but lots of medications and other health conditions or disabilities can affect this as well. There’s also a lot of obese people with an ED who have difficulty losing weight because they don’t eat enough. \n\nIt’s like saying that people are only thin if they have an ED. It’s not the case for everyone.",
          "created_utc": 1739035165.0
        },
        {
          "id": "mbot1jp",
          "author": "Suspicious_Force_890",
          "body": "i’ve discussed some examples of medications and health conditions in my other comment, but not eating enough will never make you gain weight. that’s physically impossible",
          "created_utc": 1739035307.0
        },
        {
          "id": "mbotgtm",
          "author": "BeatnikMona",
          "body": "* makes you retain weight, sorry.",
          "created_utc": 1739035432.0
        }
      ]
    },
    {
      "id": "mbrq5eq",
      "author": "underthesauceyuh",
      "body": "Don’t blame you at all for reporting posts like this. Anyone with a restrictive eating disorder belongs in this group because we’re all in the same shitty club. This should be a safe space.",
      "created_utc": 1739068132.0,
      "score": 4,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        },
        {
          "id": "mbqko75",
          "author": "None",
          "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
          "created_utc": 1739053995.0
        },
        {
          "id": "mbqno25",
          "author": "underthesauceyuh",
          "body": "If the weight wasn’t the trigger, why bother to mention it? \n\nIf you’re a low empathy person, that’s valid. That’s something that can be treated with mental health professionals if you’re open to that. But that’s not an anorexia nervosa issue and it’s not appropriate for this subreddit. There were plenty of ways to rephrase this post but it’s pretty clear that the man’s weight played a role in your reaction and not just the fact that he was eating in public. If it wasn’t about weight at all, then that wasn’t clear. \n\nThis is not only not helpful for this subreddit, it’s harmful. I’m sure there’s other places on Reddit that you can rant and rave about this. While it’s not a “pro-recovery sub” the people here are so petrified of being fat and/or eating in public that they’d rather die than be perceived this way. And if you are struggling I’m sorry, genuinely. It sucks. But some of this post is actively pro-ED and perpetuating harmful stereotypes. Being afraid of fat people (not your body) isn’t a symptom of being anorexic, it’s a symptom of a deeper issue. It doesn’t belong here.",
          "created_utc": 1739054942.0
        },
        {
          "id": "mbqopbb",
          "author": "None",
          "body": "You are putting malice behind my words and I don't appreciate it. \n\nI put his weight to show that he and I are on the the opposite ends of the eating disorder spectrum. That makes me no better than he is. I never ONCE thought I was better than he was because I'm underweight. We're both struggling. \n\nYou have no idea what was going through my mind when I was sitting on the bus. I did NOT get up and yell at him. I didn't even say anything. I was posting about the intrusive thoughts I was having over a bag of fast food and calorie intake. Being triggered by calories and consumption of them IS a trait of anorexia. \n\n  \nI find it strange that people wouldn't say I was judgy if I had put \"triggered by a thin man on the bus\".  If this post didn't belong on this sub the mods would have removed it so I'm going to disregard you gatekeeping.",
          "created_utc": 1739055273.0
        },
        {
          "id": "mbqra5g",
          "author": "underthesauceyuh",
          "body": "I appreciate you clearing that up because your intentions make more sense than they did in the original post.\n\nStill- you can’t assume when people have eating disorders. Obesity doesn’t equate to an eating disorder. Sometimes it’s a medical issue with a lack of access to healthcare, sometimes it’s medication that causes rapid weight gain and they are to figure out how to balance hormones. I had a friend that became overweight in 3 weeks due to chemo. You made an assumption. \n\nAnd yes, I think the “thin person triggered…” would get less attention on this sub. Because the main symptom of this illness is a fear of gaining weight. And when you post about a regular man, at a higher weight, just living his day to day life without knowing his health status and then making it sound like you’re disgusted by this person… how do you think the audience of this subreddit will react? I’m not talking about the comments, I’m not talking about myself. Imagine a fat (by bmi standards) person with an eating disorder coming across this post. Imagine how that would feel. \n\nYou’re not the only person who has posted something along these lines and you won’t be the last. I don’t know how mods would implement a rule to prevent these kind of posts because everyone has their threshold. This crossed a line for me, personally. It’s okay if it doesn’t for you or anyone else. But I will express my opinion, just like others have.\n\nI don’t know how this post could possibly benefit anyone, even to commiserate. This could set people back if their fear is eating in public. It just makes me sad because this sub is so vulnerable. I am mindful of that whenever I have posted or commented.",
          "created_utc": 1739056107.0
        },
        {
          "id": "mbrmmi5",
          "author": "HerrRotZwiebel",
          "body": ">Imagine a fat (by bmi standards) person with an eating disorder coming across this post. \n\nThat would be me. The best part is Atypical AN is A Thing, so some of us fat people can (and do) have EDs that are restrictive in nature. (And to your other point, it's quite possible to overeat and get fat and not have any disordered behaviors.)\n\n>Imagine how that would feel.\n\nTBH, I just sit there and say to myself, \"I am that person you are so goddammed afraid of becoming.\" If it's just a \"fat people trigger me\" post, then I report it under Rule 3, which includes \"being rude\". Sometimes I might write \"we exist, please be careful\" if it's a less hostile post.",
          "created_utc": 1739066870.0
        }
      ]
    },
    {
      "id": "mbqts54",
      "author": "underthesauceyuh",
      "body": "This will be my last response. I’ll end it here. I understand that you have a lack of empathy, I can respect that you are self aware enough to understand that. The fact that you recognize that is respectable. I don’t think it makes you inherently evil. But that is why I’m giving you feedback and telling you bluntly how harmful this post is for so many people and all I can do is hope that you’re receptive. You’re not alone in your opinion just as I’m not alone in mine. But just as you have a right to post your thoughts, I have the right to an opinion on your thoughts. And I told you my opinion, do with it what you will. I would hope you’re receptive but you might not be and I can’t control that. I’m in recovery and I discuss darker thoughts with my therapist bc even the potential of harming anyone else is not worth the risk. I think that this issue in particular would be best to discuss with a mental health professional, not with people who struggle with weight issues. That’s all I have to say.",
      "created_utc": 1739056929.0,
      "score": 3,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        },
        {
          "id": "mbqko75",
          "author": "None",
          "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
          "created_utc": 1739053995.0
        },
        {
          "id": "mbqno25",
          "author": "underthesauceyuh",
          "body": "If the weight wasn’t the trigger, why bother to mention it? \n\nIf you’re a low empathy person, that’s valid. That’s something that can be treated with mental health professionals if you’re open to that. But that’s not an anorexia nervosa issue and it’s not appropriate for this subreddit. There were plenty of ways to rephrase this post but it’s pretty clear that the man’s weight played a role in your reaction and not just the fact that he was eating in public. If it wasn’t about weight at all, then that wasn’t clear. \n\nThis is not only not helpful for this subreddit, it’s harmful. I’m sure there’s other places on Reddit that you can rant and rave about this. While it’s not a “pro-recovery sub” the people here are so petrified of being fat and/or eating in public that they’d rather die than be perceived this way. And if you are struggling I’m sorry, genuinely. It sucks. But some of this post is actively pro-ED and perpetuating harmful stereotypes. Being afraid of fat people (not your body) isn’t a symptom of being anorexic, it’s a symptom of a deeper issue. It doesn’t belong here.",
          "created_utc": 1739054942.0
        },
        {
          "id": "mbqopbb",
          "author": "None",
          "body": "You are putting malice behind my words and I don't appreciate it. \n\nI put his weight to show that he and I are on the the opposite ends of the eating disorder spectrum. That makes me no better than he is. I never ONCE thought I was better than he was because I'm underweight. We're both struggling. \n\nYou have no idea what was going through my mind when I was sitting on the bus. I did NOT get up and yell at him. I didn't even say anything. I was posting about the intrusive thoughts I was having over a bag of fast food and calorie intake. Being triggered by calories and consumption of them IS a trait of anorexia. \n\n  \nI find it strange that people wouldn't say I was judgy if I had put \"triggered by a thin man on the bus\".  If this post didn't belong on this sub the mods would have removed it so I'm going to disregard you gatekeeping.",
          "created_utc": 1739055273.0
        },
        {
          "id": "mbqra5g",
          "author": "underthesauceyuh",
          "body": "I appreciate you clearing that up because your intentions make more sense than they did in the original post.\n\nStill- you can’t assume when people have eating disorders. Obesity doesn’t equate to an eating disorder. Sometimes it’s a medical issue with a lack of access to healthcare, sometimes it’s medication that causes rapid weight gain and they are to figure out how to balance hormones. I had a friend that became overweight in 3 weeks due to chemo. You made an assumption. \n\nAnd yes, I think the “thin person triggered…” would get less attention on this sub. Because the main symptom of this illness is a fear of gaining weight. And when you post about a regular man, at a higher weight, just living his day to day life without knowing his health status and then making it sound like you’re disgusted by this person… how do you think the audience of this subreddit will react? I’m not talking about the comments, I’m not talking about myself. Imagine a fat (by bmi standards) person with an eating disorder coming across this post. Imagine how that would feel. \n\nYou’re not the only person who has posted something along these lines and you won’t be the last. I don’t know how mods would implement a rule to prevent these kind of posts because everyone has their threshold. This crossed a line for me, personally. It’s okay if it doesn’t for you or anyone else. But I will express my opinion, just like others have.\n\nI don’t know how this post could possibly benefit anyone, even to commiserate. This could set people back if their fear is eating in public. It just makes me sad because this sub is so vulnerable. I am mindful of that whenever I have posted or commented.",
          "created_utc": 1739056107.0
        },
        {
          "id": "mbqsmxi",
          "author": "None",
          "body": ">*This crossed a line for me, personally. It’s okay if it doesn’t for you or anyone else. But I will express my opinion, just like others have.*\n\nThen just move on and don't reply. That's what I do if a post crosses a line for me. I just move on and don't reply.\n\n>*But I will express my opinion, just like others have. I am mindful of that whenever I have posted or commented.*\n\nYou didn't have to slap me down for having \"*lack of empathy*\".  I'm a person just like that man was. It seems because I lack empathy that makes me less of a person to you. Good for you that you're naturally empathetic. I'm not. I know this about myself. I get judged a lot for not being a naturally empathetic person. It's assumed I am a bad person and some even have told me it makes me \"*born evil*\". I'm not a bad or evil person and I do try to be aware of what I say/post. I do have autism so that makes it much harder.",
          "created_utc": 1739056550.0
        }
      ]
    },
    {
      "id": "mbot60u",
      "author": "Froggymushroomfrog",
      "body": "I have a family member who had Cushing syndrome and she barely ate yet kept putting on more and more weight. Eventually she needed to have brain surgery and now her body doesn’t produce cortisol at all and all the weight she gained she has lost and now can’t gain weight (on extreme to another and both suck). According to my psychiatrist Clozapine makes your cells and metabolism change and that causes the weight gain",
      "created_utc": 1739035343.0,
      "score": 5,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mboqubf",
          "author": "Froggymushroomfrog",
          "body": "Actually multiple health conditions and medications can cause people to become obese. Check your facts before you state something",
          "created_utc": 1739034668.0
        },
        {
          "id": "mborniq",
          "author": "Suspicious_Force_890",
          "body": "those health conditions and medications can increase appetite and/or make it harder to burn calories. they don’t guarantee obesity",
          "created_utc": 1739034903.0
        },
        {
          "id": "mborxry",
          "author": "Froggymushroomfrog",
          "body": "Ever heard of cushing syndrome? That’s nothing to do with appetite, also the anti psychotic clozapine causes you to gain weight without making your appetite higher.",
          "created_utc": 1739034985.0
        },
        {
          "id": "mbospay",
          "author": "Suspicious_Force_890",
          "body": "cushings does stimulate appetite: https://pmc.ncbi.nlm.nih.gov/articles/PMC6189156/#:~:text=Nearly%20all%20patients%20with%20the,promote%20deposition%20of%20visceral%20fat.\n\nwe don’t know why clozapine causes weight gain so we can’t really say for certain on this one: https://www.hra.nhs.uk/planning-and-improving-research/application-summaries/research-summaries/why-does-clozapine-cause-weight-gain/",
          "created_utc": 1739035210.0
        }
      ]
    },
    {
      "id": "mbove96",
      "author": "BeatnikMona",
      "body": "Not in the last 7 years. Only weight I’ve lost was from switching birth controls.",
      "created_utc": 1739035994.0,
      "score": -1,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mbosjvq",
          "author": "BeatnikMona",
          "body": "Obesity is a result of how your body handles insulin. It is commonly associated with your diet, but lots of medications and other health conditions or disabilities can affect this as well. There’s also a lot of obese people with an ED who have difficulty losing weight because they don’t eat enough. \n\nIt’s like saying that people are only thin if they have an ED. It’s not the case for everyone.",
          "created_utc": 1739035165.0
        },
        {
          "id": "mbot1jp",
          "author": "Suspicious_Force_890",
          "body": "i’ve discussed some examples of medications and health conditions in my other comment, but not eating enough will never make you gain weight. that’s physically impossible",
          "created_utc": 1739035307.0
        },
        {
          "id": "mbotgtm",
          "author": "BeatnikMona",
          "body": "* makes you retain weight, sorry.",
          "created_utc": 1739035432.0
        },
        {
          "id": "mbouca9",
          "author": "Suspicious_Force_890",
          "body": "not eating enough can slow your metabolism but if you’re eating less calories than you expend, you will soon lose weight",
          "created_utc": 1739035687.0
        }
      ]
    },
    {
      "id": "mbqx4c5",
      "author": "None",
      "body": "Your \"feedback\" is gatekeeping and trying to control the behaviors of others. Telling me my post doesn't belong here because you feel it crosses a line contradicts you saying I have a right to my opinion.\n\n  \nSharing dark and intrusive thoughts and the LIES anorexia tells us might make someone else feel less alone. Anorexia is a very isolating illness. The last thing I need is something like you slapping me down for not having empathy and trying to control my behavior.\n\n Goodbye.",
      "created_utc": 1739058034.0,
      "score": -3,
      "context": [
        {
          "id": "mborgbm",
          "author": "EclecticGarbage",
          "body": "You could just have easily simply posted “Anyone else triggered by people eating around them?” without the unnecessary judgey rant.",
          "created_utc": 1739034845.0
        },
        {
          "id": "mbouiwl",
          "author": "underthesauceyuh",
          "body": "I agree. These are the kind of posts that are not helpful to this community at all. My worst nightmare is seeing a post like this and thinking it’s about me if I had been a man on a bus that day. Thinking someone was disgusted by me for my weight and food choices. \n\nIt also perpetuates the stereotype that people with restrictive eating disorders are judgmental toward others. There’s a difference between hating yourself and being an asshole and posts like these cross the threshold. A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this. This post could’ve easily been rephrased to avoid potentially hurting people’s feelings and triggering the shit out of an already vulnerable population. This was really sad to read. People in this sub’s worst fear is being perceived like this man when in reality, most people just mind their own business. Poor guy was minding his own business, eating his food and is getting shamed for existing. \n\nTLDR- Fat shaming other people isn’t an eating disorder symptom. Nothing to do with the illness. Plenty of people without eating disorders are disgusted by obesity and vocalize it. You are in the same boat as those other judgmental people, ED or not. Take this to a therapist to get over your anxiety over other people’s weight. It’s a different problem and inappropriate for this sub.",
          "created_utc": 1739035740.0
        },
        {
          "id": "mbqko75",
          "author": "None",
          "body": ">*A symptom of anorexia is low SELF esteem, this is just a lack of empathy. I would never make a post like this.* \n\nOkay.\n\nYou're not me and I actually am a low empathy person. Empathy does not come natural for everyone. For some, it's a learned trait. I showed a distinct lack of empathy since I was a child but I am much more empathetic than I was. \n\nI tried to make it very clear in my post I was NOT triggered by the man's weight. I stated very clearly I was not shaming him for his weight. It was intake of calories that triggered me. I didn't say anything to him. I quietly moved to the back of the bus. Despite what anorexia was screaming at me, I realized he and I both have eating disorders. I'm no better than he is just because I am very underweight.",
          "created_utc": 1739053995.0
        },
        {
          "id": "mbqno25",
          "author": "underthesauceyuh",
          "body": "If the weight wasn’t the trigger, why bother to mention it? \n\nIf you’re a low empathy person, that’s valid. That’s something that can be treated with mental health professionals if you’re open to that. But that’s not an anorexia nervosa issue and it’s not appropriate for this subreddit. There were plenty of ways to rephrase this post but it’s pretty clear that the man’s weight played a role in your reaction and not just the fact that he was eating in public. If it wasn’t about weight at all, then that wasn’t clear. \n\nThis is not only not helpful for this subreddit, it’s harmful. I’m sure there’s other places on Reddit that you can rant and rave about this. While it’s not a “pro-recovery sub” the people here are so petrified of being fat and/or eating in public that they’d rather die than be perceived this way. And if you are struggling I’m sorry, genuinely. It sucks. But some of this post is actively pro-ED and perpetuating harmful stereotypes. Being afraid of fat people (not your body) isn’t a symptom of being anorexic, it’s a symptom of a deeper issue. It doesn’t belong here.",
          "created_utc": 1739054942.0
        },
        {
          "id": "mbqopbb",
          "author": "None",
          "body": "You are putting malice behind my words and I don't appreciate it. \n\nI put his weight to show that he and I are on the the opposite ends of the eating disorder spectrum. That makes me no better than he is. I never ONCE thought I was better than he was because I'm underweight. We're both struggling. \n\nYou have no idea what was going through my mind when I was sitting on the bus. I did NOT get up and yell at him. I didn't even say anything. I was posting about the intrusive thoughts I was having over a bag of fast food and calorie intake. Being triggered by calories and consumption of them IS a trait of anorexia. \n\n  \nI find it strange that people wouldn't say I was judgy if I had put \"triggered by a thin man on the bus\".  If this post didn't belong on this sub the mods would have removed it so I'm going to disregard you gatekeeping.",
          "created_utc": 1739055273.0
        },
        {
          "id": "mbqra5g",
          "author": "underthesauceyuh",
          "body": "I appreciate you clearing that up because your intentions make more sense than they did in the original post.\n\nStill- you can’t assume when people have eating disorders. Obesity doesn’t equate to an eating disorder. Sometimes it’s a medical issue with a lack of access to healthcare, sometimes it’s medication that causes rapid weight gain and they are to figure out how to balance hormones. I had a friend that became overweight in 3 weeks due to chemo. You made an assumption. \n\nAnd yes, I think the “thin person triggered…” would get less attention on this sub. Because the main symptom of this illness is a fear of gaining weight. And when you post about a regular man, at a higher weight, just living his day to day life without knowing his health status and then making it sound like you’re disgusted by this person… how do you think the audience of this subreddit will react? I’m not talking about the comments, I’m not talking about myself. Imagine a fat (by bmi standards) person with an eating disorder coming across this post. Imagine how that would feel. \n\nYou’re not the only person who has posted something along these lines and you won’t be the last. I don’t know how mods would implement a rule to prevent these kind of posts because everyone has their threshold. This crossed a line for me, personally. It’s okay if it doesn’t for you or anyone else. But I will express my opinion, just like others have.\n\nI don’t know how this post could possibly benefit anyone, even to commiserate. This could set people back if their fear is eating in public. It just makes me sad because this sub is so vulnerable. I am mindful of that whenever I have posted or commented.",
          "created_utc": 1739056107.0
        },
        {
          "id": "mbqsmxi",
          "author": "None",
          "body": ">*This crossed a line for me, personally. It’s okay if it doesn’t for you or anyone else. But I will express my opinion, just like others have.*\n\nThen just move on and don't reply. That's what I do if a post crosses a line for me. I just move on and don't reply.\n\n>*But I will express my opinion, just like others have. I am mindful of that whenever I have posted or commented.*\n\nYou didn't have to slap me down for having \"*lack of empathy*\".  I'm a person just like that man was. It seems because I lack empathy that makes me less of a person to you. Good for you that you're naturally empathetic. I'm not. I know this about myself. I get judged a lot for not being a naturally empathetic person. It's assumed I am a bad person and some even have told me it makes me \"*born evil*\". I'm not a bad or evil person and I do try to be aware of what I say/post. I do have autism so that makes it much harder.",
          "created_utc": 1739056550.0
        },
        {
          "id": "mbqts54",
          "author": "underthesauceyuh",
          "body": "This will be my last response. I’ll end it here. I understand that you have a lack of empathy, I can respect that you are self aware enough to understand that. The fact that you recognize that is respectable. I don’t think it makes you inherently evil. But that is why I’m giving you feedback and telling you bluntly how harmful this post is for so many people and all I can do is hope that you’re receptive. You’re not alone in your opinion just as I’m not alone in mine. But just as you have a right to post your thoughts, I have the right to an opinion on your thoughts. And I told you my opinion, do with it what you will. I would hope you’re receptive but you might not be and I can’t control that. I’m in recovery and I discuss darker thoughts with my therapist bc even the potential of harming anyone else is not worth the risk. I think that this issue in particular would be best to discuss with a mental health professional, not with people who struggle with weight issues. That’s all I have to say.",
          "created_utc": 1739056929.0
        }
      ]
    },
    {
      "id": "mbovknr",
      "author": "Suspicious_Force_890",
      "body": "then you’re eating more than you think or not moving as much as you think. eating less calories than you expend will cause weight loss, it’s proven thermodynamic law",
      "created_utc": 1739036047.0,
      "score": 4,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mbosjvq",
          "author": "BeatnikMona",
          "body": "Obesity is a result of how your body handles insulin. It is commonly associated with your diet, but lots of medications and other health conditions or disabilities can affect this as well. There’s also a lot of obese people with an ED who have difficulty losing weight because they don’t eat enough. \n\nIt’s like saying that people are only thin if they have an ED. It’s not the case for everyone.",
          "created_utc": 1739035165.0
        },
        {
          "id": "mbot1jp",
          "author": "Suspicious_Force_890",
          "body": "i’ve discussed some examples of medications and health conditions in my other comment, but not eating enough will never make you gain weight. that’s physically impossible",
          "created_utc": 1739035307.0
        },
        {
          "id": "mbotgtm",
          "author": "BeatnikMona",
          "body": "* makes you retain weight, sorry.",
          "created_utc": 1739035432.0
        },
        {
          "id": "mbouca9",
          "author": "Suspicious_Force_890",
          "body": "not eating enough can slow your metabolism but if you’re eating less calories than you expend, you will soon lose weight",
          "created_utc": 1739035687.0
        },
        {
          "id": "mbove96",
          "author": "BeatnikMona",
          "body": "Not in the last 7 years. Only weight I’ve lost was from switching birth controls.",
          "created_utc": 1739035994.0
        }
      ]
    },
    {
      "id": "mbow7x6",
      "author": "BeatnikMona",
      "body": "🙄 okay. Everyone on the internet is an expert but my doctor and endocrinologist don’t know what they’re talking about.",
      "created_utc": 1739036236.0,
      "score": 6,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mbosjvq",
          "author": "BeatnikMona",
          "body": "Obesity is a result of how your body handles insulin. It is commonly associated with your diet, but lots of medications and other health conditions or disabilities can affect this as well. There’s also a lot of obese people with an ED who have difficulty losing weight because they don’t eat enough. \n\nIt’s like saying that people are only thin if they have an ED. It’s not the case for everyone.",
          "created_utc": 1739035165.0
        },
        {
          "id": "mbot1jp",
          "author": "Suspicious_Force_890",
          "body": "i’ve discussed some examples of medications and health conditions in my other comment, but not eating enough will never make you gain weight. that’s physically impossible",
          "created_utc": 1739035307.0
        },
        {
          "id": "mbotgtm",
          "author": "BeatnikMona",
          "body": "* makes you retain weight, sorry.",
          "created_utc": 1739035432.0
        },
        {
          "id": "mbouca9",
          "author": "Suspicious_Force_890",
          "body": "not eating enough can slow your metabolism but if you’re eating less calories than you expend, you will soon lose weight",
          "created_utc": 1739035687.0
        },
        {
          "id": "mbove96",
          "author": "BeatnikMona",
          "body": "Not in the last 7 years. Only weight I’ve lost was from switching birth controls.",
          "created_utc": 1739035994.0
        },
        {
          "id": "mbovknr",
          "author": "Suspicious_Force_890",
          "body": "then you’re eating more than you think or not moving as much as you think. eating less calories than you expend will cause weight loss, it’s proven thermodynamic law",
          "created_utc": 1739036047.0
        }
      ]
    },
    {
      "id": "mbp1s4l",
      "author": "SieBanhus",
      "body": "It’s a lot more complex than that - thermodynamics is perfect in a laboratory, but not in the human body where you have things like hormones, fluid retention, and so forth at play.",
      "created_utc": 1739037824.0,
      "score": 4,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mbosjvq",
          "author": "BeatnikMona",
          "body": "Obesity is a result of how your body handles insulin. It is commonly associated with your diet, but lots of medications and other health conditions or disabilities can affect this as well. There’s also a lot of obese people with an ED who have difficulty losing weight because they don’t eat enough. \n\nIt’s like saying that people are only thin if they have an ED. It’s not the case for everyone.",
          "created_utc": 1739035165.0
        },
        {
          "id": "mbot1jp",
          "author": "Suspicious_Force_890",
          "body": "i’ve discussed some examples of medications and health conditions in my other comment, but not eating enough will never make you gain weight. that’s physically impossible",
          "created_utc": 1739035307.0
        },
        {
          "id": "mbotgtm",
          "author": "BeatnikMona",
          "body": "* makes you retain weight, sorry.",
          "created_utc": 1739035432.0
        },
        {
          "id": "mbouca9",
          "author": "Suspicious_Force_890",
          "body": "not eating enough can slow your metabolism but if you’re eating less calories than you expend, you will soon lose weight",
          "created_utc": 1739035687.0
        },
        {
          "id": "mbove96",
          "author": "BeatnikMona",
          "body": "Not in the last 7 years. Only weight I’ve lost was from switching birth controls.",
          "created_utc": 1739035994.0
        },
        {
          "id": "mbovknr",
          "author": "Suspicious_Force_890",
          "body": "then you’re eating more than you think or not moving as much as you think. eating less calories than you expend will cause weight loss, it’s proven thermodynamic law",
          "created_utc": 1739036047.0
        }
      ]
    },
    {
      "id": "mbowip6",
      "author": "Suspicious_Force_890",
      "body": "i’ll happily be proven wrong if you can find a source that says it’s possible to burn off more calories than you consume and still gain weight",
      "created_utc": 1739036321.0,
      "score": 6,
      "context": [
        {
          "id": "mboossv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739034069.0
        },
        {
          "id": "mbopocy",
          "author": "Additional-Problem99",
          "body": "Eating food in public isn’t gluttony. Would you feel the same way if someone skinny was eating in public?",
          "created_utc": 1739034327.0
        },
        {
          "id": "mbopzgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1739034418.0
        },
        {
          "id": "mbosjvq",
          "author": "BeatnikMona",
          "body": "Obesity is a result of how your body handles insulin. It is commonly associated with your diet, but lots of medications and other health conditions or disabilities can affect this as well. There’s also a lot of obese people with an ED who have difficulty losing weight because they don’t eat enough. \n\nIt’s like saying that people are only thin if they have an ED. It’s not the case for everyone.",
          "created_utc": 1739035165.0
        },
        {
          "id": "mbot1jp",
          "author": "Suspicious_Force_890",
          "body": "i’ve discussed some examples of medications and health conditions in my other comment, but not eating enough will never make you gain weight. that’s physically impossible",
          "created_utc": 1739035307.0
        },
        {
          "id": "mbotgtm",
          "author": "BeatnikMona",
          "body": "* makes you retain weight, sorry.",
          "created_utc": 1739035432.0
        },
        {
          "id": "mbouca9",
          "author": "Suspicious_Force_890",
          "body": "not eating enough can slow your metabolism but if you’re eating less calories than you expend, you will soon lose weight",
          "created_utc": 1739035687.0
        },
        {
          "id": "mbove96",
          "author": "BeatnikMona",
          "body": "Not in the last 7 years. Only weight I’ve lost was from switching birth controls.",
          "created_utc": 1739035994.0
        },
        {
          "id": "mbovknr",
          "author": "Suspicious_Force_890",
          "body": "then you’re eating more than you think or not moving as much as you think. eating less calories than you expend will cause weight loss, it’s proven thermodynamic law",
          "created_utc": 1739036047.0
        },
        {
          "id": "mbow7x6",
          "author": "BeatnikMona",
          "body": "🙄 okay. Everyone on the internet is an expert but my doctor and endocrinologist don’t know what they’re talking about.",
          "created_utc": 1739036236.0
        }
      ]
    }
  ]
}