{
  "id": "1itoka7",
  "subreddit": "AnorexiaNervosa",
  "author": "hatsuneMcChickenn",
  "created_utc": 1740020793.0,
  "title": "Romanticized restrictive eds (massive rant that becomes derailed)",
  "selftext": "It genuinely disgusts me that people treat ana and mia like their diets and not disorders!! “What i do to trigger my honeymoon phase🤍🎀” im not saying “honeymoon phases” in eds arent a thing im simply saying the bad parts arent looked at! Its always cute, pink, pilates, salad, healthy, happy, shiny hair, clear skin, etc. im tired of eating disorders being so badly represented! In my “honeymoon phase” all i eat is soup and bread like im a midevil peasant, consume absolutely no water, go thru 2 diet cokes a day, barely partake in hygiene (showering, brushing my teeth, skincare, etc), get mad at everyone and everything including objects like a broken coffee maker, tv characters that cant hear me, and myself simply for making a weird face that no one say. Its not just honeymoon phases, eating disorders in general are terribly portrayed. Were not all white, female, straight, cisgender, have a good home life, love sports, and are very thin. In media, relapses, severe health risks, whats truly going on in your mind, arent talked abt one bit. Im tired of having this disorder and even more tired of nobody truly understanding me (except yall ofc). Hope yall liked my rant😋",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1itoka7/romanticized_restrictive_eds_massive_rant_that/",
  "score": 112,
  "num_comments": 11,
  "comments": [
    {
      "id": "mdqmeu1",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1740020794.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdr0ey0",
      "author": "Thick_Reaction_9887",
      "body": "Ily for this OP. You are spot on with all your points.",
      "created_utc": 1740026073.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mdsgdur",
      "author": "LightHurtsOuch",
      "body": "I used to be on edtwt and only once I moved to Reddit did I realize how strongly the ppl out there are romanticising it and how blind to it I was,, that place is legitimately pro-ana but I was so deep in my ed brain I was convinced it wasn’t 😭",
      "created_utc": 1740053901.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mdsm92k",
      "author": "twoyearlongmentalbd",
      "body": "thank you OP, this is so true. these ppl make EDs look so far from the reality. this is very shitty, all of it. nothing to glamourize, that's just flat out embarrassing. they should get a grip and have a conscience, they can seriously hurt people with this kind of content",
      "created_utc": 1740056362.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mdudtu2",
      "author": "dawnmoonbeam2000",
      "body": "it starts as a cute little diet to be skinny and pretty, and before you know it it’s been months and years of wasting your life and you don’t know how to get out",
      "created_utc": 1740075454.0,
      "score": 4,
      "context": []
    },
    {
      "id": "me2htq5",
      "author": "skyrimlover110077",
      "body": "Yeah my honeymoon phase was the most miserable time of my life lol, mentally exhausted and rotting and losing all sense of self is not fun and not pink Pilates bows and shiny hair",
      "created_utc": 1740176437.0,
      "score": 2,
      "context": []
    },
    {
      "id": "me3huas",
      "author": "Shoddy_Concern8981",
      "body": "people romanticise tf out of EDs until they realise that it’s not just “being thin” it’s losing hair, organ failure, death scares constantly dreaming and thinking about food and being so horrified with your own reflection that you can’t even look at yourself people really need to stop being so ignorant to EDs just because they think it’s fun to get skinny that way",
      "created_utc": 1740191247.0,
      "score": 2,
      "context": []
    },
    {
      "id": "me49oj5",
      "author": "tpwkluvr",
      "body": "felt it’s even more frustrating that if you were to say how the inner dialogue of having ed sounds ppl would just think u apply those same thoughts them :/",
      "created_utc": 1740202407.0,
      "score": 2,
      "context": []
    },
    {
      "id": "meocnh5",
      "author": "Fun_Sweet_6026",
      "body": "I love this 💕 no one talks about any of the things that can happen even after you recover! I have been left with chronic pancreatitis, severe EPI which is malabsorption, kidney issues (don’t know yet if I’m in kidney failure just waiting on results) and yesterday I got diagnosed with Osteopenia! And this was all caused with being anorexia bulimia/nervosa for my teenage years and again when I relapsed in my 30s 🫣 I’m rooting for you all please get the help before it destroys the rest of your lives like it is destroying mine 😢 I don’t even know who I am anymore 💕💕💕",
      "created_utc": 1740476328.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdv0wa1",
      "author": "runninginbubbles",
      "body": "Yes but OP, the terms ana and mia are also the cutesy terms that romanticize EDs. Use the medically correct terms AN and BN.",
      "created_utc": 1740081731.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mesaiqk",
      "author": "UnicornPoopCircus",
      "body": "Yeah, all the women in my mom's family have bone problems. Guess what they all have in common?",
      "created_utc": 1740523433.0,
      "score": 1,
      "context": [
        {
          "id": "meocnh5",
          "author": "Fun_Sweet_6026",
          "body": "I love this 💕 no one talks about any of the things that can happen even after you recover! I have been left with chronic pancreatitis, severe EPI which is malabsorption, kidney issues (don’t know yet if I’m in kidney failure just waiting on results) and yesterday I got diagnosed with Osteopenia! And this was all caused with being anorexia bulimia/nervosa for my teenage years and again when I relapsed in my 30s 🫣 I’m rooting for you all please get the help before it destroys the rest of your lives like it is destroying mine 😢 I don’t even know who I am anymore 💕💕💕",
          "created_utc": 1740476328.0
        }
      ]
    }
  ]
}