{
  "id": "1ixjk96",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1740448505.0,
  "title": "Man, I’m so hungry.",
  "selftext": "Having this disorder feels like having an awful, controlling partner that makes you feel seen in a way no one else can. I’m sad. I’m scared. I’m angry. I need to be hungry, yet I am so sick of that fucking feeling. A part of me wants to waste away into nothing. It makes me insane to admit but another part of me wants to eat everything and anything in sight. I’d eat lucky charms and Nutella and seven million calories of whatever the fuck I want, and I wouldn’t care at all. I can feel my brain becoming foggy and passive, but it’s like there’s some ravenous animal inside of me that will go ham on whatever’s in front of it as soon as it gets the chance: Ritz bits, granola—those cheesecake bites in the dining hall at my uni. It feels like not eating is the only way to sedate ‘the beast.’ It also feels like it’s only making it worse. I’m stuck between a rock and a hard place, and I’m so scared to see what’s going to happen. Eating is so human. I don’t want to be human I think. Does anyone relate to this? ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ixjk96/man_im_so_hungry/",
  "score": 122,
  "num_comments": 10,
  "comments": [
    {
      "id": "memo6cp",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1740448505.0,
      "score": 1,
      "context": []
    },
    {
      "id": "memptzn",
      "author": "Limp-Juggernaut-4338",
      "body": "For real man I want a bowl of cheesy pasta and ramen and a sandwich and a steak so bad",
      "created_utc": 1740449062.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mems933",
      "author": "Zealousideal-Type357",
      "body": "Same. I'm so hungry, but if I risk eating anything it will ruin my sense of self & I can't trust myself to stop",
      "created_utc": 1740449887.0,
      "score": 20,
      "context": []
    },
    {
      "id": "memtn1c",
      "author": "Rhyme_orange_",
      "body": "I just had dinner, so worth it. One step at a time. I’m sorry you’re feeling like this though. I remember the days in college feeling like that. Hang in there. I believe in you. You’re worth feeling better for.",
      "created_utc": 1740450367.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mempoej",
      "author": "tpwkluvr",
      "body": "yup exactly",
      "created_utc": 1740449009.0,
      "score": 9,
      "context": []
    },
    {
      "id": "men9m3j",
      "author": "Fitkratomgirl",
      "body": "You did such a good job putting this feeling into words I feel so seen ugh",
      "created_utc": 1740455982.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mepdp1a",
      "author": "Cautious_Many_7977",
      "body": "I’m currently sitting at a diner eating breakfast before work because I knew it was the only way I  would eat. I’m in recovery, but the past few days I’ve also had that feeling of hungry-numbness that almost feels good. I know I have to keep eating to get better. \n\nI would recommend looking into a program called Renfrew they’re awesome. Just set up a call you don’t have to commit. You can always ask for help from a loved one to help you set up appointments with care providers who can support you right now if that is feeling too hard. \n\nI’d also recommend going and getting the cereal and your preferred milk product. I often use cereal to help me want to eat in the mornings. When your feeling that foggy and numb it can be really hard to make decisions (which can reduce feelings of overwhelm) - gifting yourself something quick that you know you’ll like is a great first step. \n\nDon’t give up!!!! <3",
      "created_utc": 1740493246.0,
      "score": 4,
      "context": []
    },
    {
      "id": "men8rhl",
      "author": "Invisible2ewe",
      "body": "Oh wow, I feel you so much right now.  My voices tell me to eat and eat and eat.  I starve as a way to shut off that voice.  And when you said fading away I almost cried.  I've seriously thought I just want to starve until my body shrinks down to a black hole size.",
      "created_utc": 1740455661.0,
      "score": 3,
      "context": []
    },
    {
      "id": "metg7uj",
      "author": "Popular_Struggle2425",
      "body": "It's so hard, I work in service so I have access to food at all times.  Once I start I don't want to stop, I feel like once I eat the day is a wright off, so why not just keep eating? I like to wait as long as I can into the day to start eating if I'm going to eat that day to limit the time I'd be able to consume.",
      "created_utc": 1740536984.0,
      "score": 1,
      "context": []
    },
    {
      "id": "men0hie",
      "author": "Beautiful_Feed5185",
      "body": "argh yes the steak man. All i want a fat pub schnitty n gravy 😭😫",
      "created_utc": 1740452700.0,
      "score": 3,
      "context": [
        {
          "id": "memptzn",
          "author": "Limp-Juggernaut-4338",
          "body": "For real man I want a bowl of cheesy pasta and ramen and a sandwich and a steak so bad",
          "created_utc": 1740449062.0
        }
      ]
    }
  ]
}