{
  "id": "1iygejc",
  "subreddit": "AnorexiaNervosa",
  "author": "Middle_Addendum_484",
  "created_utc": 1740548190.0,
  "title": "My painting",
  "selftext": "Hey guys, I painted this painting a few weeks ago. I have anorexia and I think this painting can resonate with someone. Please tell what how perceive this painting. \n\nAlso, does anyone else paint or draw their disordered thoughts? For me it’s extremely therapeutic. P.s This painting was inspired by a few online sources ",
  "url": "https://i.redd.it/zik9it3e7fle1.jpeg",
  "score": 617,
  "num_comments": 16,
  "comments": [
    {
      "id": "meu9ev8",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1740548191.0,
      "score": 1,
      "context": []
    },
    {
      "id": "meujmnh",
      "author": "DifferenceInitial962",
      "body": "It looks like we’re so attached to the illness and can’t let go. It’s like hugging it because it feels safe, and hugging tightly because you don’t want to let go. Amazing work! I love art and the many interpretations different people have.",
      "created_utc": 1740553447.0,
      "score": 54,
      "context": []
    },
    {
      "id": "meu9thz",
      "author": "Secret_Priority_9353",
      "body": "god this image is beautiful - you're very talented.",
      "created_utc": 1740548382.0,
      "score": 30,
      "context": []
    },
    {
      "id": "meuazon",
      "author": "Middle_Addendum_484",
      "body": "To me, this painting is about how anorexia (on the left) grabs onto you and loves you and nurtures you and becomes your best friend. It acts like your support and controls everything and let’s you think you’re extremely fit and skinny. To me it shows the side of recovery when 80% of you is still overtaken by your eating disorder, yet the other 20% just wants to be free (figure on the right)",
      "created_utc": 1740548946.0,
      "score": 32,
      "context": []
    },
    {
      "id": "mevpvwa",
      "author": "LuherzUwU",
      "body": "THE COLOURS. I love this.",
      "created_utc": 1740576024.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mewijua",
      "author": "AbsolutelyNot5555",
      "body": "I love this! You are very talented. To me it looks like the “real” you is protecting the ED you.",
      "created_utc": 1740585259.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mexips2",
      "author": "aidan1478",
      "body": "I see this as anorexia being a demon that grasps onto you during your darkest time. You can see that anorexia is unhealthy, based on the similarities in the appearances of the two people here. Sometimes it feels like you’re unable to break free, even though anorexia might not always have such a tight grasp on you, as shown by the way anorexia is holding the person. The person looks exhausted, but also relaxed in a way. Almost like they are unwillingly accepting that anorexia has latched onto them, and now there’s no way for them to break free at this point because they’re so exhausted and tired, based on the presentation of their body, and the dark circles around their eyes. The colour gradient of red and blue represent two different sides. Almost like a dark and a light force. Anorexia is closer the red side of the painting, whereas the person is closer to the blue side. You see the red bleeding into the blue, indicating that anorexia is not just a physical presence, but the environment around the individual is also tainted by anorexia. Not only is it an internal experience, it’s an external experience that impacts the way they see the world. I would almost argue that the blue, in my eyes, is representative of feelings of depression. For me, anorexia resulted in depression and anger, and I often act irrationally at times. That irrationality is fuelled by the anorexia, but anorexia was a result of the depression. So it’s like the depression is transitioning into the eating disorder. Not sure if that makes sense.",
      "created_utc": 1740595401.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mevdvmz",
      "author": "anindecisive_ass",
      "body": "this moved something in me, this is sooo good. youre so talented. hope you're fine tho, this is splendid.",
      "created_utc": 1740571048.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mew77lt",
      "author": "Thick_Reaction_9887",
      "body": "I love it so much. This is astounding.",
      "created_utc": 1740581872.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mey0bqu",
      "author": "piefanart",
      "body": "It's really beautiful. And haunting at the same time. You're a really good artist.",
      "created_utc": 1740600271.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mf2bkuf",
      "author": "Pink_Bread_76",
      "body": "thank you for sharing!! such vulnerability thru your amazing talent- that’s the kind of gift that makes the world go round. sending love 🤍",
      "created_utc": 1740661878.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mf2yvwv",
      "author": "suslikko",
      "body": "Saw this on pinterest yesterday... beautiful",
      "created_utc": 1740669766.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mf5xedf",
      "author": "innatelyabsurd",
      "body": "i look at this in two ways and i think it’s very accurate as to how it feels to have this disorder. in one way, it smothers you and consumes your life in ways so many people don’t recognize, but in that same way it feels like a comfort and a sense of control. it’s both consuming and comforting. i think you did a great job at conveying that",
      "created_utc": 1740700768.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mf86gkq",
      "author": "yhylzjsj",
      "body": "I cried like hell seeing this bc on subway now I have to bury my face on my knees. Lovely. My lovely.",
      "created_utc": 1740736050.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfbx35w",
      "author": "Shoddy_Concern8981",
      "body": "to me it looks looks like a healthier version of the other person is comforting the sick version almost like she’s yearning for normality but the dismissive body language with the sick version is like she wants to block out the healthy version because despite the comforting embrace the sick version sees her as a burden",
      "created_utc": 1740780817.0,
      "score": 2,
      "context": []
    },
    {
      "id": "meye1il",
      "author": "Middle_Addendum_484",
      "body": "You’re analysis is incredible and it’s so amazing to hear it from another person’s perspective in such depth and honesty😩🫶",
      "created_utc": 1740603994.0,
      "score": 3,
      "context": [
        {
          "id": "mexips2",
          "author": "aidan1478",
          "body": "I see this as anorexia being a demon that grasps onto you during your darkest time. You can see that anorexia is unhealthy, based on the similarities in the appearances of the two people here. Sometimes it feels like you’re unable to break free, even though anorexia might not always have such a tight grasp on you, as shown by the way anorexia is holding the person. The person looks exhausted, but also relaxed in a way. Almost like they are unwillingly accepting that anorexia has latched onto them, and now there’s no way for them to break free at this point because they’re so exhausted and tired, based on the presentation of their body, and the dark circles around their eyes. The colour gradient of red and blue represent two different sides. Almost like a dark and a light force. Anorexia is closer the red side of the painting, whereas the person is closer to the blue side. You see the red bleeding into the blue, indicating that anorexia is not just a physical presence, but the environment around the individual is also tainted by anorexia. Not only is it an internal experience, it’s an external experience that impacts the way they see the world. I would almost argue that the blue, in my eyes, is representative of feelings of depression. For me, anorexia resulted in depression and anger, and I often act irrationally at times. That irrationality is fuelled by the anorexia, but anorexia was a result of the depression. So it’s like the depression is transitioning into the eating disorder. Not sure if that makes sense.",
          "created_utc": 1740595401.0
        }
      ]
    }
  ]
}