{
  "id": "1j0mz1l",
  "subreddit": "AnorexiaNervosa",
  "author": "paper_x_bag",
  "created_utc": 1740789529.0,
  "title": "does anyone else physically “feel” the illusion of fat growing on your body?",
  "selftext": "…and if so how do you deal with it? if i eat or if anything randomly triggers me i start feeling like i can physically feel the fat accumulating on my frame. even though it’s illusory it feels so real and so distressing to me. i don’t know how to account for the experience of physical sensations that my rational brain knows aren’t real. ugh :-( ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1j0mz1l/does_anyone_else_physically_feel_the_illusion_of/",
  "score": 159,
  "num_comments": 19,
  "comments": [
    {
      "id": "mfcobj4",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1740789529.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfcvr0k",
      "author": "None",
      "body": "I felt this all through my ed. Now I’m in recovery and eating a massive amount and gaining weight, it’s weird knowing that I’m ACTUALLY putting on fat. I still don’t know if it’s in my head or an actual thing tho",
      "created_utc": 1740792033.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mfdbmch",
      "author": "AbsolutelyNot5555",
      "body": "Yesssss. I ate more today and I can actually “feel” myself becoming bigger",
      "created_utc": 1740797658.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mfdhycm",
      "author": "lisa6547",
      "body": "I understand exactly what you mean! I go through the same thing. It's no fun",
      "created_utc": 1740799998.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mfdijps",
      "author": "princessuuke",
      "body": "Constantly, its the worst feeling in the world. Currently also trying to figure out how to make the terrible feelings of that go away",
      "created_utc": 1740800223.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mffeabr",
      "author": "AngryPandaz",
      "body": "Yes and I hate it so much! I’ve been really struggling with this for a while now as I’ve been gaining weight and I swear I can feel every single gram of it. I am constantly aware of my body and it feels bigger, heavier, fatter. I feel like my brain is broken because surely it should be filtering out these physical sensations but it’s not and I’m just painfully aware and feeling them all day everyday and it’s making me miserable.",
      "created_utc": 1740835642.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mfkciky",
      "author": "ccbabs97",
      "body": "Absolutely. This week I’ve been forced to stay home and not exercise because I have bronchitis. Anyway, the lack of movement plus the perceived notion that I was eating more made me feel like I’d gained weight. What I did was try on a pair of pants to sort of see if it was real or not. Spoiler alert — they actually fit better and slightly looser. It was slightly upsetting to see the extent of my distortion, but I remind myself that it’s just that: disordered perception. \n\nI will discuss it with my therapists this week. That often helps!",
      "created_utc": 1740895961.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mfdab7h",
      "author": "Klutzy_Hunter_354",
      "body": "I feel this too! i usually sit down, drink some water and try to wash the bad thoughts away with music or videogames. Its so odd.",
      "created_utc": 1740797174.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mfhkp4p",
      "author": "Altruistic_Ask_2769",
      "body": "I know I’ve been getting bigger when I can feel it in my face",
      "created_utc": 1740860252.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mff17ng",
      "author": "ilovearlecchino",
      "body": "yes i get that too, think it’s quite common",
      "created_utc": 1740829500.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfgsf3p",
      "author": "Background_Clue_3756",
      "body": "Yes. I hate it. I distract to not deal with it.",
      "created_utc": 1740851717.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfhjlvd",
      "author": "None",
      "body": "I know the feels…. It’s unbearable at times. But it will pass. ❤️",
      "created_utc": 1740859912.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mficrlj",
      "author": "Then_Freedom6141",
      "body": "Yes, this is why even though I know I'm still getting smaller, I can't bring myself to go anywhere near my maintenance numbers, the moment I eat anything, I feel like I am putting on a fatsuit, even though I know it's not true... I usually calculate everything I've eaten to make sure I didn't overeat, and then force myself to eat more while distracting myself with watching shows. ",
      "created_utc": 1740869121.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfizf0h",
      "author": "pinkienewbie",
      "body": "Yes. I feel like I am huge then weigh myself and realise I haven’t put on weight and it’s all in my head. I hate it",
      "created_utc": 1740876771.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfkmoey",
      "author": "Particular_Air_296",
      "body": "When I grab my body when I binge it feels like the fat I have is hard but the times I'm not binge eating it feels like their flabby.",
      "created_utc": 1740901734.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfd6rip",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1740795886.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mfl2k5q",
      "author": "solardetect",
      "body": "yes all the time",
      "created_utc": 1740911370.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfle2na",
      "author": "InternalStruggles66",
      "body": "I don’t weigh myself anymore but I used to just for validation/reality check. Now that I’ve actually gained weight it’s even worse and I literally have to sleep in a hoodie because I can’t stand to see my arms.  This “feeling” is freaking awful and I just want to feel comfortable in this body.",
      "created_utc": 1740917936.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfpj408",
      "author": "discrete_venting",
      "body": "No idea how to deal with it.... I feel like violet from Charly and the chocolate factory.",
      "created_utc": 1740966000.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfgv1q5",
      "author": "None",
      "body": "OMG same. if i don’t weigh myself I can physically feel all the food turning to fat",
      "created_utc": 1740852507.0,
      "score": 3,
      "context": [
        {
          "id": "mfd6rip",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1740795886.0
        }
      ]
    }
  ]
}