{
  "id": "1j50c4k",
  "subreddit": "AnorexiaNervosa",
  "author": "NamazSasz",
  "created_utc": 1741280786.0,
  "title": "This illness really IS lonely",
  "selftext": "Like I can’t share shit with anyone. I can’t share my happiness when I lost some weight. I can’t share my fears and worries whenever I get a scary new side effect. I can’t share how triggered I feel when my ex partner fucking tells me, unasked, how much his new gf weighs (like wtf??). \nNo non-disordered person would understand and I dont want to trigger anyone (with details about my my ed) that I know who has or had an ed theirself.\nCan anyone here relate? I feel so lonely rn. Lonely and triggered. Why did my ex have to tell me about his gf. I kind of want to block him but he is one of my very few friends…",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1j50c4k/this_illness_really_is_lonely/",
  "score": 135,
  "num_comments": 31,
  "comments": [
    {
      "id": "mgcwu2r",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1741280787.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgd40ym",
      "author": "Invisible2ewe",
      "body": "I hear you. Feel your pain.  I don't have anyone in my life who really gets it.  Most avoid talking about it or any mention of food.  I don't want to make them uncomfortable because I won't have any friends left.  I wish for someone who doesn't just tell me to \"please just eat\" or keep offering me food.  So yeah, like you said, very lonely. 😔",
      "created_utc": 1741282804.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mgee1s5",
      "author": "conepingui",
      "body": "same, especially when short people talk about their weight I'm 5'6 and it makes me wanna die, I'm already underweight but I'd be dead if i weighed like 80lbs",
      "created_utc": 1741295693.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mgem7ki",
      "author": "LangGetaways",
      "body": "It really is horrible. I totally understand the happiness thing. Everyone around me is just frustrated I don't help myself. And then I have no emotional regulation to talk without being angry because of it. I have no interesting things to say or do.\n\nDoes your ex know you have an ED? because it's very strange to me to mention his gfs weight whether or not it's malicious. For both you and her. I deffo think you should bring it up with him (not everyone wants to hear others weight even non EDed ppl so you don't have to tell him you have an ED or tell him it's disrespectful to her). But deffo space away from him helps aswell.\n\nIgy we don't have the social abilities we used to to make new friends. But you aren't alone here🩵. /reassurance",
      "created_utc": 1741298000.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mgemw7b",
      "author": "None",
      "body": "I relate. I'm sorry you have such a shitty ex, but remember he's an ex for a reason and if you think blocking him will be better for you, just do it, you don't need to explain to anyone. \n\nAnorexia wants you to be isolated and alone, it thrives on your isolation. How else can you fixate on it which is what it wants? Often it will tell you not to trust anyone or that you're alone when it's not true at all. I often feel like I have no one and no one understands but I do, I just choose to push them away. When I do let them in, I feel so relieved. \n\nYou're kind to say you don't want to trigger anyone who has had an ED but if you choose your words carefully and tell them you're struggling, they may be able to use their experience to help you.",
      "created_utc": 1741298195.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mgf3gnm",
      "author": "Middle_Addendum_484",
      "body": "I feel this so much. I truely believe that eating disorders are the number one mental illness for making victims sooooo fuckinggggg isolated. This is unfortunately how so many people do become so depressed. I feel for you, you poor girl. I’m so sorry you’re going through this. We’re here to listen and appreciate hearing your thoughts as they resonate with this community. Stay fierce girl. ☝️❤️",
      "created_utc": 1741303444.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mgdldao",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1741287659.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mgdm3lp",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1741287866.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mgfgjte",
      "author": "MedicineParking4359",
      "body": "pls block his ass. it is better to be alone than to have a douche bag like that in ur life",
      "created_utc": 1741308117.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mggyf9y",
      "author": "alienprincess111",
      "body": "You explained why I am on this subreddit.",
      "created_utc": 1741329256.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mgi34sc",
      "author": "Own_Sea5439",
      "body": "OP, can you break contact with your Ex? It sounds like he’s toxic to you.",
      "created_utc": 1741351890.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mgjyqx7",
      "author": "MsCinny",
      "body": "First off, I'm going to rip off the bandaid here, but your ex is *not* a friend if that's how he's treating you *knowing* you're unwell. He is showing mentally abusive behavior. I've experienced not the same but definitely a pro-Ana relationship and it was awful.\n\nI am more than happy to provide you with a shoulder to lean on. My triggers are more to do with visuals of myself than numbers so you wouldn't need to worry about me.\n\nI'm sorry you're feeling alone, I understand how hard and scary that can be when all you probably want is support and someone to listen. Especially when you're not ready to heal yet.",
      "created_utc": 1741372761.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mgn7u7c",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1741414489.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mgdohgu",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1741288535.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mghrnaf",
      "author": "RyHill1",
      "body": "Block him",
      "created_utc": 1741346520.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgfg6qk",
      "author": "NamazSasz",
      "body": "I lost a lot of friends because I used to be too open about my ed in the past so I totally get you 🫂",
      "created_utc": 1741307987.0,
      "score": 2,
      "context": [
        {
          "id": "mgd40ym",
          "author": "Invisible2ewe",
          "body": "I hear you. Feel your pain.  I don't have anyone in my life who really gets it.  Most avoid talking about it or any mention of food.  I don't want to make them uncomfortable because I won't have any friends left.  I wish for someone who doesn't just tell me to \"please just eat\" or keep offering me food.  So yeah, like you said, very lonely. 😔",
          "created_utc": 1741282804.0
        }
      ]
    },
    {
      "id": "mgfhyvv",
      "author": "NamazSasz",
      "body": "Totally!! I’m the exact same height as you and my ex’s new gf has about the weight you mentioned 😭 she is shorter but still… of course I had to figure out her bmi and of course hers is a lot lower than mine. Idk why it’s bothering me so much, I don’t even know her! But she wants to get to know me my ex said 😭 he even told me about her eating habits.\nWhy would someone do this? He KNOWS I have AN!! And he knows I relapsed hard when he broke up with me. I hate him rn. He has no emapthy at all.",
      "created_utc": 1741308624.0,
      "score": 6,
      "context": [
        {
          "id": "mgee1s5",
          "author": "conepingui",
          "body": "same, especially when short people talk about their weight I'm 5'6 and it makes me wanna die, I'm already underweight but I'd be dead if i weighed like 80lbs",
          "created_utc": 1741295693.0
        }
      ]
    },
    {
      "id": "mgfqceo",
      "author": "Horror-Dragonfly-266",
      "body": "Omg I hate it!!!! I’m 5’7 (almost 5’8 now) and whenever my friends talk about weight and stuff I just get so jealous and angry bc I’m tall so even if I’m bmi is lower than theirs my weight will still be higher. I just wanna scream!",
      "created_utc": 1741311637.0,
      "score": 4,
      "context": [
        {
          "id": "mgee1s5",
          "author": "conepingui",
          "body": "same, especially when short people talk about their weight I'm 5'6 and it makes me wanna die, I'm already underweight but I'd be dead if i weighed like 80lbs",
          "created_utc": 1741295693.0
        }
      ]
    },
    {
      "id": "mgfiuiv",
      "author": "NamazSasz",
      "body": "Yes he knows I have AN. And I straight up told him that the mention of her weight triggered me. He then proceeded to talk about her eating habits. I got a bit harsh but he didn’t even realize  and just switched topics and talked about himself.\nYou are right that it would be helpful to distance myself from him. But then again I don’t want to lose him as a friend although I do question myself why I don’t want to lose him… he is not good for me, never has been since our break-up.\n\nThank you so much for letting me know that I’m not alone. I wish you all the best.",
      "created_utc": 1741308941.0,
      "score": 4,
      "context": [
        {
          "id": "mgem7ki",
          "author": "LangGetaways",
          "body": "It really is horrible. I totally understand the happiness thing. Everyone around me is just frustrated I don't help myself. And then I have no emotional regulation to talk without being angry because of it. I have no interesting things to say or do.\n\nDoes your ex know you have an ED? because it's very strange to me to mention his gfs weight whether or not it's malicious. For both you and her. I deffo think you should bring it up with him (not everyone wants to hear others weight even non EDed ppl so you don't have to tell him you have an ED or tell him it's disrespectful to her). But deffo space away from him helps aswell.\n\nIgy we don't have the social abilities we used to to make new friends. But you aren't alone here🩵. /reassurance",
          "created_utc": 1741298000.0
        }
      ]
    },
    {
      "id": "mgfld2g",
      "author": "NamazSasz",
      "body": "Thanks for sharing your experiences and perspective.\n\nRight, he’s an ex for a reason… and I have been isolating myself hard for the last few months.\n\nOne of my colleagues told me she had an ed in the past but is fully recovered now. However, her eating and excercising habits still seem disordered to me… so I’m not so sure about her recovery and she is such a sweet girl I really don’t want her to get worse again :( she offered me to have a coffee and talk a few times but we never went through with it 🤷🏻‍♀️ Another colleague is obviously struggling with AN-R. She talks a lot about her food rules. She makes me feel inferiorer actually, she seems to the better anorexic. And then there is this friend of mine. We used to talk about losing weight and body image issues without judging one another but I haven’t seen her in a while and don’t really know how things are. I may just have to invite her to a coffee date soon!",
      "created_utc": 1741309853.0,
      "score": 2,
      "context": [
        {
          "id": "mgemw7b",
          "author": "None",
          "body": "I relate. I'm sorry you have such a shitty ex, but remember he's an ex for a reason and if you think blocking him will be better for you, just do it, you don't need to explain to anyone. \n\nAnorexia wants you to be isolated and alone, it thrives on your isolation. How else can you fixate on it which is what it wants? Often it will tell you not to trust anyone or that you're alone when it's not true at all. I often feel like I have no one and no one understands but I do, I just choose to push them away. When I do let them in, I feel so relieved. \n\nYou're kind to say you don't want to trigger anyone who has had an ED but if you choose your words carefully and tell them you're struggling, they may be able to use their experience to help you.",
          "created_utc": 1741298195.0
        }
      ]
    },
    {
      "id": "mgfmnjz",
      "author": "NamazSasz",
      "body": "Thank you so much for your kind words 😭 I usually don’t post myself because I have a big fear of rejection and of using the wrong words but now I am so happy I did share with you guys",
      "created_utc": 1741310328.0,
      "score": 2,
      "context": [
        {
          "id": "mgf3gnm",
          "author": "Middle_Addendum_484",
          "body": "I feel this so much. I truely believe that eating disorders are the number one mental illness for making victims sooooo fuckinggggg isolated. This is unfortunately how so many people do become so depressed. I feel for you, you poor girl. I’m so sorry you’re going through this. We’re here to listen and appreciate hearing your thoughts as they resonate with this community. Stay fierce girl. ☝️❤️",
          "created_utc": 1741303444.0
        }
      ]
    },
    {
      "id": "mge8cjs",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 9: Don't ask users to DM you or contact you in any way off of r/AnorexiaNervosa. \n\nWhile your intentions may be good, there are a lot of creeps in the eating disorder community. Because of this, we ask that users do not do this. It will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1741294106.0,
      "score": 0,
      "context": [
        {
          "id": "mgdldao",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741287659.0
        }
      ]
    },
    {
      "id": "mgfg9ie",
      "author": "NamazSasz",
      "body": "That must be so hard!",
      "created_utc": 1741308014.0,
      "score": 2,
      "context": [
        {
          "id": "mgdm3lp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1741287866.0
        }
      ]
    },
    {
      "id": "mghab25",
      "author": "NamazSasz",
      "body": "At least we have this community 🫂",
      "created_utc": 1741336008.0,
      "score": 2,
      "context": [
        {
          "id": "mggyf9y",
          "author": "alienprincess111",
          "body": "You explained why I am on this subreddit.",
          "created_utc": 1741329256.0
        }
      ]
    },
    {
      "id": "mgnyluo",
      "author": "NamazSasz",
      "body": "I could of course but he really is the only friend I actually am in contact with on a regular basis. Apart of him I only have one other friend and sometimes we don’t talk for several months and we meet maybe a few times a year. In the last two years I lost a big friend group plus one of my very best friends I’ve known for the majority of my life due to a bad AN relapse and also a >! suicide attempt !< Not everyone could handle this/wanted this kind of energy in their life which I have to respect but still I came out of it with having only two friends left and I didn’t manage to make new friends although I really tried. There were some potential new friendships but it always ended after a few weeks due to very different reasons. See why I’m really scared to push people actively out of my life? :( I know I shouldn’t be dependent on toxic people but I really really don’t want to be on my own 100%. I’m tearing up just thinking about this :( it would only push me further into AN and also substance abuse. I swear I wouldn’t give a shit anymore if I didn’t have anyone in my life besides work colleagues and would just give up.",
      "created_utc": 1741430842.0,
      "score": 2,
      "context": [
        {
          "id": "mgi34sc",
          "author": "Own_Sea5439",
          "body": "OP, can you break contact with your Ex? It sounds like he’s toxic to you.",
          "created_utc": 1741351890.0
        }
      ]
    },
    {
      "id": "mgnvqdi",
      "author": "NamazSasz",
      "body": "I feel you so much. It would be so nice to have a friend who can relate",
      "created_utc": 1741429048.0,
      "score": 2,
      "context": [
        {
          "id": "mgn7u7c",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1741414489.0
        }
      ]
    },
    {
      "id": "mge8dxj",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 9: Don't ask users to DM you or contact you in any way off of r/AnorexiaNervosa. \n\nWhile your intentions may be good, there are a lot of creeps in the eating disorder community. Because of this, we ask that users do not do this. It will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1741294117.0,
      "score": 0,
      "context": [
        {
          "id": "mgdohgu",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741288535.0
        }
      ]
    },
    {
      "id": "mgfi7dm",
      "author": "conepingui",
      "body": "actually evil behaviour. wish the worst for him",
      "created_utc": 1741308710.0,
      "score": 6,
      "context": [
        {
          "id": "mgee1s5",
          "author": "conepingui",
          "body": "same, especially when short people talk about their weight I'm 5'6 and it makes me wanna die, I'm already underweight but I'd be dead if i weighed like 80lbs",
          "created_utc": 1741295693.0
        },
        {
          "id": "mgfhyvv",
          "author": "NamazSasz",
          "body": "Totally!! I’m the exact same height as you and my ex’s new gf has about the weight you mentioned 😭 she is shorter but still… of course I had to figure out her bmi and of course hers is a lot lower than mine. Idk why it’s bothering me so much, I don’t even know her! But she wants to get to know me my ex said 😭 he even told me about her eating habits.\nWhy would someone do this? He KNOWS I have AN!! And he knows I relapsed hard when he broke up with me. I hate him rn. He has no emapthy at all.",
          "created_utc": 1741308624.0
        }
      ]
    },
    {
      "id": "mgfm30o",
      "author": "None",
      "body": "Don't feel inferior and compare yourself to your colleague, I bet if she knew more about your struggles she'd compare herself to you! That's so sweet about your recovered colleague too, if she brings it up again to go for coffee definitely go for it and with your other friend you mentioned at the end.\n\nI'm sorry for bombarding you with encouragement I just know that horrid isolating feeling, it's not fair as you've done nothing wrong to be isolated, you don't deserve it.",
      "created_utc": 1741310119.0,
      "score": 2,
      "context": [
        {
          "id": "mgemw7b",
          "author": "None",
          "body": "I relate. I'm sorry you have such a shitty ex, but remember he's an ex for a reason and if you think blocking him will be better for you, just do it, you don't need to explain to anyone. \n\nAnorexia wants you to be isolated and alone, it thrives on your isolation. How else can you fixate on it which is what it wants? Often it will tell you not to trust anyone or that you're alone when it's not true at all. I often feel like I have no one and no one understands but I do, I just choose to push them away. When I do let them in, I feel so relieved. \n\nYou're kind to say you don't want to trigger anyone who has had an ED but if you choose your words carefully and tell them you're struggling, they may be able to use their experience to help you.",
          "created_utc": 1741298195.0
        },
        {
          "id": "mgfld2g",
          "author": "NamazSasz",
          "body": "Thanks for sharing your experiences and perspective.\n\nRight, he’s an ex for a reason… and I have been isolating myself hard for the last few months.\n\nOne of my colleagues told me she had an ed in the past but is fully recovered now. However, her eating and excercising habits still seem disordered to me… so I’m not so sure about her recovery and she is such a sweet girl I really don’t want her to get worse again :( she offered me to have a coffee and talk a few times but we never went through with it 🤷🏻‍♀️ Another colleague is obviously struggling with AN-R. She talks a lot about her food rules. She makes me feel inferiorer actually, she seems to the better anorexic. And then there is this friend of mine. We used to talk about losing weight and body image issues without judging one another but I haven’t seen her in a while and don’t really know how things are. I may just have to invite her to a coffee date soon!",
          "created_utc": 1741309853.0
        }
      ]
    },
    {
      "id": "mgnszf6",
      "author": "None",
      "body": "He sounds malevolent- why is he baiting you so you'll compare yourself w/ his new gf? Put some headphones on/pull a face lol. What if you compared him w/ some guy/a new bf and ranted about how he eats this and that/weighs x or pressed some buttons related to his issues? Is the r-ship worth salvaging w/ potentially hostile/competitive undercurrents- if no good comes from it to you",
      "created_utc": 1741427339.0,
      "score": 0,
      "context": [
        {
          "id": "mgee1s5",
          "author": "conepingui",
          "body": "same, especially when short people talk about their weight I'm 5'6 and it makes me wanna die, I'm already underweight but I'd be dead if i weighed like 80lbs",
          "created_utc": 1741295693.0
        },
        {
          "id": "mgfhyvv",
          "author": "NamazSasz",
          "body": "Totally!! I’m the exact same height as you and my ex’s new gf has about the weight you mentioned 😭 she is shorter but still… of course I had to figure out her bmi and of course hers is a lot lower than mine. Idk why it’s bothering me so much, I don’t even know her! But she wants to get to know me my ex said 😭 he even told me about her eating habits.\nWhy would someone do this? He KNOWS I have AN!! And he knows I relapsed hard when he broke up with me. I hate him rn. He has no emapthy at all.",
          "created_utc": 1741308624.0
        },
        {
          "id": "mgfi7dm",
          "author": "conepingui",
          "body": "actually evil behaviour. wish the worst for him",
          "created_utc": 1741308710.0
        }
      ]
    },
    {
      "id": "mgfprcj",
      "author": "NamazSasz",
      "body": "I think being encouraged to open up to someone is exactly what I need rn ❤️\nAlso my team manager definitely started to notice my relapse and I expect her to talk to me about it soon enough. She “witnessed” my last relapse which was about 1.5 years ago and openly asked me about it at that time because she was super worried about me. One day I gave in and talked my heart out because I just couldn’t hold it in anymore…. Now my ed is telling me that I should never be so honest with her again because I don’t want to be “forced”/pushed into recovery. Last time my team manager made sure that I would take part in all the lunch breaks, asked me weekly about my eating and my weight and pushed me to get into therapy… So I’m very conflicted about talking to her about my struggles again. On the other hand it would be so nice to share with someone who knows me and my past and someone who understands the illness to some extent (she studied psychology). It’s a conflict between my healthy and unhealthy self, I’m totally aware of that.",
      "created_utc": 1741311434.0,
      "score": 2,
      "context": [
        {
          "id": "mgemw7b",
          "author": "None",
          "body": "I relate. I'm sorry you have such a shitty ex, but remember he's an ex for a reason and if you think blocking him will be better for you, just do it, you don't need to explain to anyone. \n\nAnorexia wants you to be isolated and alone, it thrives on your isolation. How else can you fixate on it which is what it wants? Often it will tell you not to trust anyone or that you're alone when it's not true at all. I often feel like I have no one and no one understands but I do, I just choose to push them away. When I do let them in, I feel so relieved. \n\nYou're kind to say you don't want to trigger anyone who has had an ED but if you choose your words carefully and tell them you're struggling, they may be able to use their experience to help you.",
          "created_utc": 1741298195.0
        },
        {
          "id": "mgfld2g",
          "author": "NamazSasz",
          "body": "Thanks for sharing your experiences and perspective.\n\nRight, he’s an ex for a reason… and I have been isolating myself hard for the last few months.\n\nOne of my colleagues told me she had an ed in the past but is fully recovered now. However, her eating and excercising habits still seem disordered to me… so I’m not so sure about her recovery and she is such a sweet girl I really don’t want her to get worse again :( she offered me to have a coffee and talk a few times but we never went through with it 🤷🏻‍♀️ Another colleague is obviously struggling with AN-R. She talks a lot about her food rules. She makes me feel inferiorer actually, she seems to the better anorexic. And then there is this friend of mine. We used to talk about losing weight and body image issues without judging one another but I haven’t seen her in a while and don’t really know how things are. I may just have to invite her to a coffee date soon!",
          "created_utc": 1741309853.0
        },
        {
          "id": "mgfm30o",
          "author": "None",
          "body": "Don't feel inferior and compare yourself to your colleague, I bet if she knew more about your struggles she'd compare herself to you! That's so sweet about your recovered colleague too, if she brings it up again to go for coffee definitely go for it and with your other friend you mentioned at the end.\n\nI'm sorry for bombarding you with encouragement I just know that horrid isolating feeling, it's not fair as you've done nothing wrong to be isolated, you don't deserve it.",
          "created_utc": 1741310119.0
        }
      ]
    },
    {
      "id": "mgfv9pt",
      "author": "None",
      "body": "It's nice your manager cares, but even I got a bit of anxiety reading that she was asking about your eating and weight! I know it's all from a kind place though. She can't force you to do anything though, she isn't a doctor or anyone with that authority, but I do get it. I love being able to talk to my therapist but part of worries if I'm too honest, could she use what I'm saying against me? But I keep telling myself it does more harm to lie and wastes mine and hers time. \n\nIt's cool we're in a place where we can recognise unhealthy and healthy thoughts, even if we don't always make the best decisions for ourselves <3",
      "created_utc": 1741313355.0,
      "score": 2,
      "context": [
        {
          "id": "mgemw7b",
          "author": "None",
          "body": "I relate. I'm sorry you have such a shitty ex, but remember he's an ex for a reason and if you think blocking him will be better for you, just do it, you don't need to explain to anyone. \n\nAnorexia wants you to be isolated and alone, it thrives on your isolation. How else can you fixate on it which is what it wants? Often it will tell you not to trust anyone or that you're alone when it's not true at all. I often feel like I have no one and no one understands but I do, I just choose to push them away. When I do let them in, I feel so relieved. \n\nYou're kind to say you don't want to trigger anyone who has had an ED but if you choose your words carefully and tell them you're struggling, they may be able to use their experience to help you.",
          "created_utc": 1741298195.0
        },
        {
          "id": "mgfld2g",
          "author": "NamazSasz",
          "body": "Thanks for sharing your experiences and perspective.\n\nRight, he’s an ex for a reason… and I have been isolating myself hard for the last few months.\n\nOne of my colleagues told me she had an ed in the past but is fully recovered now. However, her eating and excercising habits still seem disordered to me… so I’m not so sure about her recovery and she is such a sweet girl I really don’t want her to get worse again :( she offered me to have a coffee and talk a few times but we never went through with it 🤷🏻‍♀️ Another colleague is obviously struggling with AN-R. She talks a lot about her food rules. She makes me feel inferiorer actually, she seems to the better anorexic. And then there is this friend of mine. We used to talk about losing weight and body image issues without judging one another but I haven’t seen her in a while and don’t really know how things are. I may just have to invite her to a coffee date soon!",
          "created_utc": 1741309853.0
        },
        {
          "id": "mgfm30o",
          "author": "None",
          "body": "Don't feel inferior and compare yourself to your colleague, I bet if she knew more about your struggles she'd compare herself to you! That's so sweet about your recovered colleague too, if she brings it up again to go for coffee definitely go for it and with your other friend you mentioned at the end.\n\nI'm sorry for bombarding you with encouragement I just know that horrid isolating feeling, it's not fair as you've done nothing wrong to be isolated, you don't deserve it.",
          "created_utc": 1741310119.0
        },
        {
          "id": "mgfprcj",
          "author": "NamazSasz",
          "body": "I think being encouraged to open up to someone is exactly what I need rn ❤️\nAlso my team manager definitely started to notice my relapse and I expect her to talk to me about it soon enough. She “witnessed” my last relapse which was about 1.5 years ago and openly asked me about it at that time because she was super worried about me. One day I gave in and talked my heart out because I just couldn’t hold it in anymore…. Now my ed is telling me that I should never be so honest with her again because I don’t want to be “forced”/pushed into recovery. Last time my team manager made sure that I would take part in all the lunch breaks, asked me weekly about my eating and my weight and pushed me to get into therapy… So I’m very conflicted about talking to her about my struggles again. On the other hand it would be so nice to share with someone who knows me and my past and someone who understands the illness to some extent (she studied psychology). It’s a conflict between my healthy and unhealthy self, I’m totally aware of that.",
          "created_utc": 1741311434.0
        }
      ]
    },
    {
      "id": "mggbqj9",
      "author": "NamazSasz",
      "body": "Ugh I was too honest to my last therapist so that she cancelled our sessions because she thought I was a lost cause (literally her words). Especially since this happened I think twice before I open up to someone fully and I stopped telling my team manager so much. She knows that I’m not in therapy anymore but I keep telling her that I’m totally fine and don’t need it anymore. Anyway, I hope your therapist is nothing but thankful that your are being honest! I also believe that therapy doesn’t really make sense if you can’t tell the truth. If not in that setting, in which one?\n\nEdit: typo",
      "created_utc": 1741319243.0,
      "score": 1,
      "context": [
        {
          "id": "mgemw7b",
          "author": "None",
          "body": "I relate. I'm sorry you have such a shitty ex, but remember he's an ex for a reason and if you think blocking him will be better for you, just do it, you don't need to explain to anyone. \n\nAnorexia wants you to be isolated and alone, it thrives on your isolation. How else can you fixate on it which is what it wants? Often it will tell you not to trust anyone or that you're alone when it's not true at all. I often feel like I have no one and no one understands but I do, I just choose to push them away. When I do let them in, I feel so relieved. \n\nYou're kind to say you don't want to trigger anyone who has had an ED but if you choose your words carefully and tell them you're struggling, they may be able to use their experience to help you.",
          "created_utc": 1741298195.0
        },
        {
          "id": "mgfld2g",
          "author": "NamazSasz",
          "body": "Thanks for sharing your experiences and perspective.\n\nRight, he’s an ex for a reason… and I have been isolating myself hard for the last few months.\n\nOne of my colleagues told me she had an ed in the past but is fully recovered now. However, her eating and excercising habits still seem disordered to me… so I’m not so sure about her recovery and she is such a sweet girl I really don’t want her to get worse again :( she offered me to have a coffee and talk a few times but we never went through with it 🤷🏻‍♀️ Another colleague is obviously struggling with AN-R. She talks a lot about her food rules. She makes me feel inferiorer actually, she seems to the better anorexic. And then there is this friend of mine. We used to talk about losing weight and body image issues without judging one another but I haven’t seen her in a while and don’t really know how things are. I may just have to invite her to a coffee date soon!",
          "created_utc": 1741309853.0
        },
        {
          "id": "mgfm30o",
          "author": "None",
          "body": "Don't feel inferior and compare yourself to your colleague, I bet if she knew more about your struggles she'd compare herself to you! That's so sweet about your recovered colleague too, if she brings it up again to go for coffee definitely go for it and with your other friend you mentioned at the end.\n\nI'm sorry for bombarding you with encouragement I just know that horrid isolating feeling, it's not fair as you've done nothing wrong to be isolated, you don't deserve it.",
          "created_utc": 1741310119.0
        },
        {
          "id": "mgfprcj",
          "author": "NamazSasz",
          "body": "I think being encouraged to open up to someone is exactly what I need rn ❤️\nAlso my team manager definitely started to notice my relapse and I expect her to talk to me about it soon enough. She “witnessed” my last relapse which was about 1.5 years ago and openly asked me about it at that time because she was super worried about me. One day I gave in and talked my heart out because I just couldn’t hold it in anymore…. Now my ed is telling me that I should never be so honest with her again because I don’t want to be “forced”/pushed into recovery. Last time my team manager made sure that I would take part in all the lunch breaks, asked me weekly about my eating and my weight and pushed me to get into therapy… So I’m very conflicted about talking to her about my struggles again. On the other hand it would be so nice to share with someone who knows me and my past and someone who understands the illness to some extent (she studied psychology). It’s a conflict between my healthy and unhealthy self, I’m totally aware of that.",
          "created_utc": 1741311434.0
        },
        {
          "id": "mgfv9pt",
          "author": "None",
          "body": "It's nice your manager cares, but even I got a bit of anxiety reading that she was asking about your eating and weight! I know it's all from a kind place though. She can't force you to do anything though, she isn't a doctor or anyone with that authority, but I do get it. I love being able to talk to my therapist but part of worries if I'm too honest, could she use what I'm saying against me? But I keep telling myself it does more harm to lie and wastes mine and hers time. \n\nIt's cool we're in a place where we can recognise unhealthy and healthy thoughts, even if we don't always make the best decisions for ourselves <3",
          "created_utc": 1741313355.0
        }
      ]
    }
  ]
}