{
  "id": "1j658d4",
  "subreddit": "AnorexiaNervosa",
  "author": "modernwarfarin4",
  "created_utc": 1741395219.0,
  "title": "Treatment was really hard but I’m so glad I did it.",
  "selftext": "I was looking through my photos and I came across this one. Just reminded me of all the things that my body went through. I was starving myself and my body and brain had to stop doing normal every day functions so it could keep my organs running basically. It’s one thing I always come back to. That when you’re hungry, your mood, and your body temperature are usually the first to go. And it was horrible. So I want this to be inspiring but it also might be triggering so I apologize. But I’m proud of myself and I just really wanted to share because I tend to neglect that part of my life alot. \n\nThe photo is my sister, myself and my dad. It was some sort of UV ray thing that detects heat coming off of peoples bodies. And yellow is heat. Blue and purple is cold, meaning no heat is coming off of those parts. We thought it was funny at the time lol.",
  "url": "https://i.redd.it/uguro5o16dne1.jpeg",
  "score": 112,
  "num_comments": 5,
  "comments": [
    {
      "id": "mglwxwq",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1741395221.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgmx50r",
      "author": "None",
      "body": "This is a really moving picture, i don't know why it hit me so hard. I'm so happy to hear you are doing better and are in a beautiful point of life, sending hugs and even more good energy 💕",
      "created_utc": 1741409209.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mgt6u8w",
      "author": "HarkSaidHarold",
      "body": "This is the best, most relevant \"sick photo\" anyone has ever posted online. Thanks for sharing and I'm so glad you are better now.",
      "created_utc": 1741499382.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mgp0ba6",
      "author": "modernwarfarin4",
      "body": "Thank you! That’s really nice to hear, I appreciate you❤️",
      "created_utc": 1741447296.0,
      "score": 3,
      "context": [
        {
          "id": "mgmx50r",
          "author": "None",
          "body": "This is a really moving picture, i don't know why it hit me so hard. I'm so happy to hear you are doing better and are in a beautiful point of life, sending hugs and even more good energy 💕",
          "created_utc": 1741409209.0
        }
      ]
    },
    {
      "id": "mguktw2",
      "author": "modernwarfarin4",
      "body": "Thank you I appreciate that a lot!",
      "created_utc": 1741527029.0,
      "score": 3,
      "context": [
        {
          "id": "mgt6u8w",
          "author": "HarkSaidHarold",
          "body": "This is the best, most relevant \"sick photo\" anyone has ever posted online. Thanks for sharing and I'm so glad you are better now.",
          "created_utc": 1741499382.0
        }
      ]
    }
  ]
}