{
  "id": "1j7p4dp",
  "subreddit": "AnorexiaNervosa",
  "author": "Actual_Quiet_3763",
  "created_utc": 1741575861.0,
  "title": "anorexia to binge eating pipeline",
  "selftext": "am I the only one who went from being severely underweight and having a fear of food to binging on the daily? i feel so disgusted with myself and I just miss the way I used to be, i don’t know why im like this now. everyone thinks I’ve recovered but i feel so much worse. how do i break the cycle? ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1j7p4dp/anorexia_to_binge_eating_pipeline/",
  "score": 130,
  "num_comments": 40,
  "comments": [
    {
      "id": "mgypeck",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1741575862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgz32jm",
      "author": "vivi_roblox",
      "body": "me too! first time i tried recovering i was binging like 3+ times a day. then i went back to not eating, now im back in this cycle again\n\ni don’t have much advice but i get you 🫶",
      "created_utc": 1741581725.0,
      "score": 40,
      "context": []
    },
    {
      "id": "mgza3lz",
      "author": "amateur_arguer",
      "body": "Yo I feel you but in reverse. The one thing that helped me when I was recovering from BED (before I started restricting) was having binge foods in the house. If I never had (insert trigger food here) in the house, when I would have it, it would feel like the last time I’d have it, and I’d binge. But if it’s regularly there, I don’t feel like I need to eat it all at once. Also, give yourself some grace here! You’re recovering from starvation. You’re probably hungry, and your body isn’t going to waste the nutrients you give it. Try to practice mindful eating and practice noticing when you feel like you’ll binge, when you’re in the middle of a binge, etc. But on the whole, self-kindness will do a lot when it comes to binging",
      "created_utc": 1741585422.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mgyqqi9",
      "author": "AbsolutelyNot5555",
      "body": "I’m sorry. I wish I had advice 😞",
      "created_utc": 1741576389.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mh0uuky",
      "author": "venicebitch4life",
      "body": "Yes, this is completely normal. You should research the binge eating compulsion in relation to starved bodies/brains. It’s a survival instinct. Brain over binge is a really good podcast/book with helpful information.\nIt’s a hard thing to go through especially just after being on the other end of the spectrum with anorexia.",
      "created_utc": 1741615497.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mh31idt",
      "author": "littlemissbettypage",
      "body": "Nope not alone that's me and i hate myself for it",
      "created_utc": 1741638377.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mgze5of",
      "author": "Longlostjellydonut",
      "body": "Its a rebellion we have inside of us. We channelled it into either undereating or overeating. Shift ur relationship to rebellion or where u channel it.",
      "created_utc": 1741587817.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mgz0fd3",
      "author": "bloodyhellpumpkin",
      "body": "Do you do this near your period / on it? (If your female) \nI notice if I do binge it’s often when my period skipped and the binge is when my period is super heavy. \n\nI don’t have any advice, just curious",
      "created_utc": 1741580468.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mh1e3t5",
      "author": "bunnyqueens",
      "body": "YES it’s insanely common! it’s really annoying lol. i remember this was discussed a lot in an outpatient program i was in bc a lot of ppl end up developing severe issues w binging which can rly perpetuate the ED cycle",
      "created_utc": 1741621561.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mh3nu3b",
      "author": "TartRevolutionary899",
      "body": "If anyone has any advice on how to break this vicious cycle, I’m all ears.\n\nShort backstory: This time last year, my then 15/16-year-old daughter was diagnosed with anorexia purging type. She was so small I could count every bone in her spine. I begged her to eat. Her body was so sick that her organs were starting to shut down. On top of that, she has epilepsy, and the more she starved herself, the more she starved her brain, making her seizures more frequent and violent.\n\nI spent a year telling her doctor that something was seriously wrong. I watched her steadily lose weight, I had pictures of the vomit she would hide, but every time, the doctor dismissed my concerns. They’d ask her if she had an eating disorder, she’d lie and say no, and that was the end of it. No follow-up, no real help.\n\nFinally, I took her to the dentist and called ahead to ask if they could tell if someone had an eating disorder. They assured me they could, and sure enough, they confirmed it. That finally got the ball rolling, and she started getting some of the help she needed. Her blood work was all over the place, she had to get labs every two weeks, and after a suicide attempt, she was hospitalized—but never fully admitted.\n\nEvery hospital, every residential program—public and private—denied her. Some wouldn’t take her because of her epilepsy, some because of the anorexia, and some because she had Medicaid. When the ER finally released her five days later, we went home and decided we had to change things. We got rid of the scales, stopped talking about food in numbers, and refused to send her to a so-called treatment center that I wouldn’t trust with my dog, let alone my child.\n\nFast forward to now—she’s been diagnosed with binge eating disorder. Last year, she was severely malnourished at 80 pounds. Now, doctors say she’s obese at 134 pounds.\n\nSo now, I’m stuck. I don’t want to look at the child I begged to eat and tell her to stop. I don’t want to say, \"You’re just bored,\" and risk her spiraling all over again.\n\nAs a mom, as someone on the outside looking in—what do I do? Do I say something? Do I let it go? I just don’t want her trapped in this cycle forever. Any advice would mean the world to me because, honestly, I feel like I keep trying and just keep failing.",
      "created_utc": 1741644900.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mgz4yde",
      "author": "None",
      "body": "same☹️",
      "created_utc": 1741582669.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mgzhupz",
      "author": "unapologeticallyange",
      "body": "Ugh same :( so sad",
      "created_utc": 1741590110.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh1xeyb",
      "author": "fineok_17",
      "body": "Just got out of what felt like a 3 day binge. I've scaled back some meds that I think are making me extra hungry. I felt angry I kept eating when my brain was screaming no. I've gained weight and it's making me freak out wanting to go back to barely eating. I hate this cycle and I feel for you. Seeing a therapist soon to hopefully help. Wish I had more advice.",
      "created_utc": 1741626976.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh2xq0c",
      "author": "Vegetable_Net_6138",
      "body": "Same. I fear I thought I was the exception when people say restricting leads to weight gain but it’s true. I think it’s your body’s response to starving. Will take a while to even out.",
      "created_utc": 1741637284.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh9cu4y",
      "author": "umitsashy",
      "body": "Same here. From what I understand, when you binge, your blood sugar will spike and then drop fast, especially if you are cycling between not eating enough to eating again. This drop makes you feel worse and makes you want to eat more . After a binge, try eating a normal amount and see if it helps at all <3",
      "created_utc": 1741722379.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh0o554",
      "author": "None",
      "body": "It's very common and often to be expected.",
      "created_utc": 1741613148.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh0hvnq",
      "author": "MaryEn_",
      "body": "OMG I feel like I'm hearing myself speaking! I went from avoiding so many foods to a situation where I still avoid pasta, rice, bread, but then it's as if my brain shuts down and I eat until I feel sick.\n\nFor a few months I've been trying to lose weight again, but it's much more difficult after I start eating again. I've completely lost the sense of hunger and satiety, I eat to feel bad or fast to punish myself...",
      "created_utc": 1741610730.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mh0ieg8",
      "author": "microscopicwheaties",
      "body": "time, patience, self compassion, and removing guilt as a main factor for eating behaviours. i had this happen about twice now. there's quick fixes, but it's something you really have to work on via self development.",
      "created_utc": 1741610944.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mh1as33",
      "author": "No-Detective5258",
      "body": "I’m in the cycle rn. I severely restricted now I can’t stop myself from eating. I hate this for us all, I’m so sorry you’re going through this. Praying we’re all able to heal our relationships with food and body image 💗",
      "created_utc": 1741620590.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mh3fwu6",
      "author": "vartush",
      "body": "Im in this cycle for 12 years already and its too unhealthy. Obly if therapy worked ngl.",
      "created_utc": 1741642559.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mh6eg32",
      "author": "diskydemalio",
      "body": "i’ve tried to break this cycle for SO LONG and every single time i fail within a few days of restricting and continue binging and putting on weight. i am honestly at a loss of words because i go extreme on both ends-either i will starve myself so “well” (have insane ‘willpower’ per se) or i will overeat to the extent where i can’t even face my family or friends, where i can’t even look at myself in the mirror, where i hate myself so much yet cannot stop. i miss my old body, i miss the euphoric feeling of feeling dizzy in the morning when i wake up. i miss feeling weak. but the worst part is i know when i eat a ‘bad’ food it will alll go boom. \nhow do u get to a place where u can eat in moderation and not go beast mode u eat smth “bad”? i physically dont know how to do this and it feels like hell every single day. want to cry. and it’s been going on for so long meaning that these neural pathways are strong af lol\ngenuinely wtf",
      "created_utc": 1741686922.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhexizx",
      "author": "dolewhipzombie",
      "body": "Not just you at all. I was finally in the “fck I’m really worried/you’re so sick looking” stage this time last year and now … I’m at the highest weight I’ve been in ten years and I can’t stand that I allowed myself to be back here. \n\nSo now, back to hardcore restrictions, over exercise etc etc.",
      "created_utc": 1741799137.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhfo0vy",
      "author": "AwayFrom-UK",
      "body": "I'm obese right now after being underweight back 10-11 years ago... I see photos of myself from back then and I look so tiny and ill.... but at the same time I look huge now. I'm fighting binging but every diet leads to a weird relationship with my food!",
      "created_utc": 1741806702.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhnxrth",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1741911552.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhrdxuj",
      "author": "Reasonable_Wasabi401",
      "body": "I understand exactly how you feel! You should talk with a therapist about your body image issues because there is underlying issues why you have these issues. I had an uncle hint messages to me that I should be careful, also a perverted friends step dad touched my boob and told me it was perfect size also told me I need to keep my body the way it looks and never change… also some chick in high school told me I was fat 110! And I am 105 now and my goal is 102 but I always get to 102 and then go back up to 110 or 115 and I get angry",
      "created_utc": 1741965377.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mh08t09",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1741606691.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mh12i2z",
      "author": "Pro_Ana_Online",
      "body": " A carnivore diet + volume eating/very low carb.",
      "created_utc": 1741618026.0,
      "score": -2,
      "context": []
    },
    {
      "id": "mgzb88m",
      "author": "Actual_Quiet_3763",
      "body": "aw, i hope we both get better and try to be better to our bodies.🩷",
      "created_utc": 1741586071.0,
      "score": 4,
      "context": [
        {
          "id": "mgz32jm",
          "author": "vivi_roblox",
          "body": "me too! first time i tried recovering i was binging like 3+ times a day. then i went back to not eating, now im back in this cycle again\n\ni don’t have much advice but i get you 🫶",
          "created_utc": 1741581725.0
        }
      ]
    },
    {
      "id": "mgzb5xa",
      "author": "Actual_Quiet_3763",
      "body": "thank you so much, it means a lot to me to know that im not alone in this. 🩷🩷",
      "created_utc": 1741586034.0,
      "score": 5,
      "context": [
        {
          "id": "mgza3lz",
          "author": "amateur_arguer",
          "body": "Yo I feel you but in reverse. The one thing that helped me when I was recovering from BED (before I started restricting) was having binge foods in the house. If I never had (insert trigger food here) in the house, when I would have it, it would feel like the last time I’d have it, and I’d binge. But if it’s regularly there, I don’t feel like I need to eat it all at once. Also, give yourself some grace here! You’re recovering from starvation. You’re probably hungry, and your body isn’t going to waste the nutrients you give it. Try to practice mindful eating and practice noticing when you feel like you’ll binge, when you’re in the middle of a binge, etc. But on the whole, self-kindness will do a lot when it comes to binging",
          "created_utc": 1741585422.0
        }
      ]
    },
    {
      "id": "mh6df15",
      "author": "diskydemalio",
      "body": "i read brain over binge as well and i remember thinking it wld solve my binging instantly, but its been a few months now (i still reread it to brainwash myself lol) and i can never believe that  the “urges” aren’t actually myself. did the advice from brain over binge work for u?",
      "created_utc": 1741686304.0,
      "score": 1,
      "context": [
        {
          "id": "mh0uuky",
          "author": "venicebitch4life",
          "body": "Yes, this is completely normal. You should research the binge eating compulsion in relation to starved bodies/brains. It’s a survival instinct. Brain over binge is a really good podcast/book with helpful information.\nIt’s a hard thing to go through especially just after being on the other end of the spectrum with anorexia.",
          "created_utc": 1741615497.0
        }
      ]
    },
    {
      "id": "mgzb1ke",
      "author": "Actual_Quiet_3763",
      "body": "i lost my period when I was UW but I binged sm that I gained the weight back AND my period, which led to me binging even more because of my “all or nothing” mindset, but I honestly binge whenever I can so I don’t think my period has anything to do with it.",
      "created_utc": 1741585963.0,
      "score": 8,
      "context": [
        {
          "id": "mgz0fd3",
          "author": "bloodyhellpumpkin",
          "body": "Do you do this near your period / on it? (If your female) \nI notice if I do binge it’s often when my period skipped and the binge is when my period is super heavy. \n\nI don’t have any advice, just curious",
          "created_utc": 1741580468.0
        }
      ]
    },
    {
      "id": "mh3pqcq",
      "author": "z_i_n_c",
      "body": "aw it must be tough for you and her it's lovely too see how supportive you are of your daughter. Perhaps her mindset is in starvation mode- imagine the desperation the hunger she felt at her low weights and being obese now she's prolly developed leptin resistance meaning her satiety cues are all off. this is a psychological problem that needs to be addressed tho. instead of focusing on eating more or eating less does she have any underlying trauma? is food a coping mechanism? It's very rarely we see someone this disordered both end of the spectrum too that just happens naturally I guess. Wishing u all the best",
      "created_utc": 1741645475.0,
      "score": 1,
      "context": [
        {
          "id": "mh3nu3b",
          "author": "TartRevolutionary899",
          "body": "If anyone has any advice on how to break this vicious cycle, I’m all ears.\n\nShort backstory: This time last year, my then 15/16-year-old daughter was diagnosed with anorexia purging type. She was so small I could count every bone in her spine. I begged her to eat. Her body was so sick that her organs were starting to shut down. On top of that, she has epilepsy, and the more she starved herself, the more she starved her brain, making her seizures more frequent and violent.\n\nI spent a year telling her doctor that something was seriously wrong. I watched her steadily lose weight, I had pictures of the vomit she would hide, but every time, the doctor dismissed my concerns. They’d ask her if she had an eating disorder, she’d lie and say no, and that was the end of it. No follow-up, no real help.\n\nFinally, I took her to the dentist and called ahead to ask if they could tell if someone had an eating disorder. They assured me they could, and sure enough, they confirmed it. That finally got the ball rolling, and she started getting some of the help she needed. Her blood work was all over the place, she had to get labs every two weeks, and after a suicide attempt, she was hospitalized—but never fully admitted.\n\nEvery hospital, every residential program—public and private—denied her. Some wouldn’t take her because of her epilepsy, some because of the anorexia, and some because she had Medicaid. When the ER finally released her five days later, we went home and decided we had to change things. We got rid of the scales, stopped talking about food in numbers, and refused to send her to a so-called treatment center that I wouldn’t trust with my dog, let alone my child.\n\nFast forward to now—she’s been diagnosed with binge eating disorder. Last year, she was severely malnourished at 80 pounds. Now, doctors say she’s obese at 134 pounds.\n\nSo now, I’m stuck. I don’t want to look at the child I begged to eat and tell her to stop. I don’t want to say, \"You’re just bored,\" and risk her spiraling all over again.\n\nAs a mom, as someone on the outside looking in—what do I do? Do I say something? Do I let it go? I just don’t want her trapped in this cycle forever. Any advice would mean the world to me because, honestly, I feel like I keep trying and just keep failing.",
          "created_utc": 1741644900.0
        }
      ]
    },
    {
      "id": "mh9ytbq",
      "author": "ohyousquirrelyou",
      "body": "What’s happening to your daughter is healthy and natural! Read about the Minnesota Starvation Experiment to understand what happens to malnourished bodies when they start to recover from starvation. Many (most) people will become heavier than they were before starvation (which is perhaps your daughter’s situation), but if she keeps eating regularly in whatever quantity her starved body asks for, and never ever restricts again, her body will settle into a natural rhythm and possibly release some of the extra weight. \n\nPlease ignore doctors who are calling her “obese” (not all doctors understand eating disorder recovery!), and instead take her to a Registered Dietitian specializing in eating disorders. I can recommend some if you’d like.",
      "created_utc": 1741728504.0,
      "score": 1,
      "context": [
        {
          "id": "mh3nu3b",
          "author": "TartRevolutionary899",
          "body": "If anyone has any advice on how to break this vicious cycle, I’m all ears.\n\nShort backstory: This time last year, my then 15/16-year-old daughter was diagnosed with anorexia purging type. She was so small I could count every bone in her spine. I begged her to eat. Her body was so sick that her organs were starting to shut down. On top of that, she has epilepsy, and the more she starved herself, the more she starved her brain, making her seizures more frequent and violent.\n\nI spent a year telling her doctor that something was seriously wrong. I watched her steadily lose weight, I had pictures of the vomit she would hide, but every time, the doctor dismissed my concerns. They’d ask her if she had an eating disorder, she’d lie and say no, and that was the end of it. No follow-up, no real help.\n\nFinally, I took her to the dentist and called ahead to ask if they could tell if someone had an eating disorder. They assured me they could, and sure enough, they confirmed it. That finally got the ball rolling, and she started getting some of the help she needed. Her blood work was all over the place, she had to get labs every two weeks, and after a suicide attempt, she was hospitalized—but never fully admitted.\n\nEvery hospital, every residential program—public and private—denied her. Some wouldn’t take her because of her epilepsy, some because of the anorexia, and some because she had Medicaid. When the ER finally released her five days later, we went home and decided we had to change things. We got rid of the scales, stopped talking about food in numbers, and refused to send her to a so-called treatment center that I wouldn’t trust with my dog, let alone my child.\n\nFast forward to now—she’s been diagnosed with binge eating disorder. Last year, she was severely malnourished at 80 pounds. Now, doctors say she’s obese at 134 pounds.\n\nSo now, I’m stuck. I don’t want to look at the child I begged to eat and tell her to stop. I don’t want to say, \"You’re just bored,\" and risk her spiraling all over again.\n\nAs a mom, as someone on the outside looking in—what do I do? Do I say something? Do I let it go? I just don’t want her trapped in this cycle forever. Any advice would mean the world to me because, honestly, I feel like I keep trying and just keep failing.",
          "created_utc": 1741644900.0
        }
      ]
    },
    {
      "id": "mh9z8h7",
      "author": "ohyousquirrelyou",
      "body": "Send me a PM and I can share some advice ",
      "created_utc": 1741728622.0,
      "score": 1,
      "context": [
        {
          "id": "mh6eg32",
          "author": "diskydemalio",
          "body": "i’ve tried to break this cycle for SO LONG and every single time i fail within a few days of restricting and continue binging and putting on weight. i am honestly at a loss of words because i go extreme on both ends-either i will starve myself so “well” (have insane ‘willpower’ per se) or i will overeat to the extent where i can’t even face my family or friends, where i can’t even look at myself in the mirror, where i hate myself so much yet cannot stop. i miss my old body, i miss the euphoric feeling of feeling dizzy in the morning when i wake up. i miss feeling weak. but the worst part is i know when i eat a ‘bad’ food it will alll go boom. \nhow do u get to a place where u can eat in moderation and not go beast mode u eat smth “bad”? i physically dont know how to do this and it feels like hell every single day. want to cry. and it’s been going on for so long meaning that these neural pathways are strong af lol\ngenuinely wtf",
          "created_utc": 1741686922.0
        }
      ]
    },
    {
      "id": "mh0i5ah",
      "author": "Connect-Preference-5",
      "body": "Not to be mean but that is some bad advice. Any type of fasting or dieting awakens the ED beast. And any type of stimulants to curb cravings is more compensatory behaviour that’s detrimental to recovery",
      "created_utc": 1741610841.0,
      "score": 1,
      "context": [
        {
          "id": "mh08t09",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741606691.0
        }
      ]
    },
    {
      "id": "mh0tpz6",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 1: Do not participate in pro-ed behaviors. \n\nAs doing things like asking for \"ana buddies\" is harmful for members of the r/AnorexiaNervosa community, it is not allowed. Please do not do things like this in the future. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1741615111.0,
      "score": 1,
      "context": [
        {
          "id": "mh08t09",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741606691.0
        }
      ]
    },
    {
      "id": "mh6q6dy",
      "author": "venicebitch4life",
      "body": "No honestly, I continued to binge after reading the book, but it was really insightful. I was only able to get over it after when my circumstances had changed and I was in a better place. It’s a really hard thing to fight so make sure to give yourself grace.",
      "created_utc": 1741693122.0,
      "score": 1,
      "context": [
        {
          "id": "mh0uuky",
          "author": "venicebitch4life",
          "body": "Yes, this is completely normal. You should research the binge eating compulsion in relation to starved bodies/brains. It’s a survival instinct. Brain over binge is a really good podcast/book with helpful information.\nIt’s a hard thing to go through especially just after being on the other end of the spectrum with anorexia.",
          "created_utc": 1741615497.0
        },
        {
          "id": "mh6df15",
          "author": "diskydemalio",
          "body": "i read brain over binge as well and i remember thinking it wld solve my binging instantly, but its been a few months now (i still reread it to brainwash myself lol) and i can never believe that  the “urges” aren’t actually myself. did the advice from brain over binge work for u?",
          "created_utc": 1741686304.0
        }
      ]
    },
    {
      "id": "mh0p8kw",
      "author": "heavenandhellhoratio",
      "body": "The binging is the primary issue and the weight gain and self image is the biggest triggering factor and the one most likely to result in a restriction relapse. Harm reduction isn't perfect but it is the best line of defense, the disordered behaviour and thoughts are there regardless. Nicotine is a stimulant but one a smoker/vaper is all ready dependant upon and there is nicotine free option. It's point here is it's function in satiating cravings which would most likely be replaced with a lot of caffeinated drinks which is worse. The question is what the least harmful way I can realistically take control of my current situation and gradually work towards a healthy state of recovery. As soon as you eat that psychological impulse to binge is going to kick in and it's going to be an all day struggle, intermittent fasting is actually psychological and physically healthier for your body. The harsh reality is binging tends to lead to the most imminently dangerous purging behaviours and you want to head it off before it gets to there. Don't be disordered or magically recover and cease all ED impulses and behaviours when I click my fingers doesn't work for any mental illness or self destructive tendencies. You can't just snap out of it.",
      "created_utc": 1741613545.0,
      "score": -2,
      "context": [
        {
          "id": "mh08t09",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741606691.0
        },
        {
          "id": "mh0i5ah",
          "author": "Connect-Preference-5",
          "body": "Not to be mean but that is some bad advice. Any type of fasting or dieting awakens the ED beast. And any type of stimulants to curb cravings is more compensatory behaviour that’s detrimental to recovery",
          "created_utc": 1741610841.0
        }
      ]
    },
    {
      "id": "mh72d6l",
      "author": "diskydemalio",
      "body": "u think it’s possible to rly stop binge eating? i’ve struggled w this entire mixture of bulimia binge eating and anorexia for abt 4 years now and im literally starting to wonder if i’ll still be this way in 10 years",
      "created_utc": 1741698138.0,
      "score": 1,
      "context": [
        {
          "id": "mh0uuky",
          "author": "venicebitch4life",
          "body": "Yes, this is completely normal. You should research the binge eating compulsion in relation to starved bodies/brains. It’s a survival instinct. Brain over binge is a really good podcast/book with helpful information.\nIt’s a hard thing to go through especially just after being on the other end of the spectrum with anorexia.",
          "created_utc": 1741615497.0
        },
        {
          "id": "mh6df15",
          "author": "diskydemalio",
          "body": "i read brain over binge as well and i remember thinking it wld solve my binging instantly, but its been a few months now (i still reread it to brainwash myself lol) and i can never believe that  the “urges” aren’t actually myself. did the advice from brain over binge work for u?",
          "created_utc": 1741686304.0
        },
        {
          "id": "mh6q6dy",
          "author": "venicebitch4life",
          "body": "No honestly, I continued to binge after reading the book, but it was really insightful. I was only able to get over it after when my circumstances had changed and I was in a better place. It’s a really hard thing to fight so make sure to give yourself grace.",
          "created_utc": 1741693122.0
        }
      ]
    },
    {
      "id": "mh0txwc",
      "author": "Shadowed-Heart",
      "body": "The main issue is the anorexia nervosa, so let's not recommend that someone suffering an eating disorder characterized by starvation, participate in fasting.",
      "created_utc": 1741615185.0,
      "score": 1,
      "context": [
        {
          "id": "mh08t09",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741606691.0
        },
        {
          "id": "mh0i5ah",
          "author": "Connect-Preference-5",
          "body": "Not to be mean but that is some bad advice. Any type of fasting or dieting awakens the ED beast. And any type of stimulants to curb cravings is more compensatory behaviour that’s detrimental to recovery",
          "created_utc": 1741610841.0
        },
        {
          "id": "mh0p8kw",
          "author": "heavenandhellhoratio",
          "body": "The binging is the primary issue and the weight gain and self image is the biggest triggering factor and the one most likely to result in a restriction relapse. Harm reduction isn't perfect but it is the best line of defense, the disordered behaviour and thoughts are there regardless. Nicotine is a stimulant but one a smoker/vaper is all ready dependant upon and there is nicotine free option. It's point here is it's function in satiating cravings which would most likely be replaced with a lot of caffeinated drinks which is worse. The question is what the least harmful way I can realistically take control of my current situation and gradually work towards a healthy state of recovery. As soon as you eat that psychological impulse to binge is going to kick in and it's going to be an all day struggle, intermittent fasting is actually psychological and physically healthier for your body. The harsh reality is binging tends to lead to the most imminently dangerous purging behaviours and you want to head it off before it gets to there. Don't be disordered or magically recover and cease all ED impulses and behaviours when I click my fingers doesn't work for any mental illness or self destructive tendencies. You can't just snap out of it.",
          "created_utc": 1741613545.0
        }
      ]
    },
    {
      "id": "mh7jcs4",
      "author": "venicebitch4life",
      "body": "I did. And I struggled with the exact same thing. My binging problems started with my bulimia. It was the worst thing I went through and I desperately looked for solutions and nothing worked because I was just so wrapped up in the cycle. I could never break it. The thing I learned though is that you don’t break the cycle there’s not one thing you do to get out. You have to gradually distance yourself from those habits and that mindset. And it’s almost like the more you focus on it the harder it gets at least in my experience. \n\nI was able to eventually let myself eat freely, but this was at a time when I was really depressed so I kind of just stopped caring about everything. It wasn’t good because for a long time I was just eating a lot,  everything all the time. I couldn’t even say I was binging because there weren’t points of restriction followed by over eating, it was just over eating all the time. \nThis also sucked, but because I didn’t have the energy to restrict or purge, I got out of the cycle and now it’s been a long time since then maybe a year or two and I am finally able to start eating normally, listening to my hunger cues, and making better food choices. \nPlease DM me if you would like. This cycle was my life for years and there was a point that I thought it would be my life forever and now as I am writing this i’m realizing that I haven’t binged or purged or restricted in a long time so it’s possible to get better.",
      "created_utc": 1741703717.0,
      "score": 2,
      "context": [
        {
          "id": "mh0uuky",
          "author": "venicebitch4life",
          "body": "Yes, this is completely normal. You should research the binge eating compulsion in relation to starved bodies/brains. It’s a survival instinct. Brain over binge is a really good podcast/book with helpful information.\nIt’s a hard thing to go through especially just after being on the other end of the spectrum with anorexia.",
          "created_utc": 1741615497.0
        },
        {
          "id": "mh6df15",
          "author": "diskydemalio",
          "body": "i read brain over binge as well and i remember thinking it wld solve my binging instantly, but its been a few months now (i still reread it to brainwash myself lol) and i can never believe that  the “urges” aren’t actually myself. did the advice from brain over binge work for u?",
          "created_utc": 1741686304.0
        },
        {
          "id": "mh6q6dy",
          "author": "venicebitch4life",
          "body": "No honestly, I continued to binge after reading the book, but it was really insightful. I was only able to get over it after when my circumstances had changed and I was in a better place. It’s a really hard thing to fight so make sure to give yourself grace.",
          "created_utc": 1741693122.0
        },
        {
          "id": "mh72d6l",
          "author": "diskydemalio",
          "body": "u think it’s possible to rly stop binge eating? i’ve struggled w this entire mixture of bulimia binge eating and anorexia for abt 4 years now and im literally starting to wonder if i’ll still be this way in 10 years",
          "created_utc": 1741698138.0
        }
      ]
    }
  ]
}