{
  "id": "1j7thub",
  "subreddit": "AnorexiaNervosa",
  "author": "Usual-Theme211",
  "created_utc": 1741593125.0,
  "title": "My doctor congratulated me.",
  "selftext": "I am overweight and have lost weight due to my ED. In the hallway (within earshot of the full waiting room) after my GP called my name, he asked if I had lost weight, got me to step on the scales and said my weight out loud. Then he congratulated me for my weight loss, asked me how I did it and then laughed and brushed it off when I said it is from starving myself. He KNOWS about my ED and he still did this. Then, when I asked for nausea medication to help me keep my food down when I do actually eat (which makes me feel super nauseas), he said “But why? You make yourself vomit anyway” since I purge sometimes. This appointment was also for something entirely unrelated to my weight and ED. I am speechless.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1j7thub/my_doctor_congratulated_me/",
  "score": 147,
  "num_comments": 20,
  "comments": [
    {
      "id": "mgzmfjg",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1741593125.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgzo1ln",
      "author": "brownguyinthecorner",
      "body": "Not a day goes by where I'm not astonished by the ignorance and lack of sensitivity from people without an ED. Your doctor acted immature and downright unhelpful. I still get mad at my dermatologist when she says \"Don't itch your eczema\" but this a new level of idiocy. I'm sorry you had to go through this.",
      "created_utc": 1741594191.0,
      "score": 87,
      "context": []
    },
    {
      "id": "mgzoy4s",
      "author": "Wild_Possibility2620",
      "body": "Find a new doctor ASAP.  That douche canoe of a human being needs a good talking to from the medical board",
      "created_utc": 1741594793.0,
      "score": 38,
      "context": []
    },
    {
      "id": "mgzp9mp",
      "author": "calcifugous",
      "body": "doctors are absolutely disgusting and will treat any ED patient like absolute shit, i remember my family and friends told me they were concerned I had an ED due to rapid weight loss. (this was the beginning of my ed) I went to the GP because of it and expressed everyone’s concerns and mine and told them I need help before I fall down the rabbit hole. My GP told me to step on the weight scales and I refused and explained its because it will trigger me. \n\nMy GP laughed in my face, and told me I didn’t have an eating disorder I just have anxiety and prescribed me anxiety meds, 3 months later i had a check up with a different doctor due to my depo injection (contraception injections) went on the weight scales and saw i lost alarming amount of weight. Which is when she the doctor who claimed i have anxiety rang me up because of it and said “hey we would like you go back to the doctors because I believe you have an eating disorder and we’d like to give you support” I repeated everything she told me that day and put the phone down on her.\n\nI don’t understand how people expect us to get help when the GP’s treats us like this, im sorry for your experience. No one should be treated like that.",
      "created_utc": 1741595005.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mgznmvr",
      "author": "unusualrotting",
      "body": "that is absolutely insane behaviour from the doctor, im sorry that happened to you :(",
      "created_utc": 1741593919.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mh0czhe",
      "author": "Novel-Property-2062",
      "body": "Maybe I'm petty, but I would file a formal complaint over this. I have limited patience for your average doc who just doesn't know jack about EDs, but wouldn't pursue it for those cases. However if he's being very explicitly told that you're starving yourself, is aware that you purge, and is THIS blasé about it, it's negligence IMO. \n\nI mean obviously get a new doctor too, but if you feel so inclined, I'd encourage you to report him to the relevant medical board in your country. Or in lieu of that, send an email to the office telling them why you're switching providers. He may very well not care, sure. But it at least sets a precedent that he won't retain patients if he doesn't bare minimum improve his bedside manner with EDs.\n\nNot to imply that you have some obligation to act when you're the victim of his behavior, just a suggestion. I'm sorry you had to deal with that nonsense.",
      "created_utc": 1741608642.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mh081i7",
      "author": "newmommy1994",
      "body": "New. Doctor.",
      "created_utc": 1741606306.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mh19s6l",
      "author": "None",
      "body": "Depending on the doctor, I’ve had that too, you’re not alone in this! My primary doctor (who’s very cautious about my weight/she’s very good) wanted me to see a psychiatrist. I saw him before a two week trip to have an introduction meeting. When I can back from my vacation, I had gained a bit of weight and since I was voicing my general feeling of “oh I think my doctor is being dramatic about me being underweight” (which I think is pretty common in people with anorexia, we never feel like we’re thin enough) he said to me “yeah, I agree, I think you look fine.” It was almost like he didn’t want another patient to deal with/he was also just really ignorant about how anorexia works.",
      "created_utc": 1741620317.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mh1ccvd",
      "author": "AbsolutelyNot5555",
      "body": "WHAT?! Are you serious?? If you are able to, get a new doctor.",
      "created_utc": 1741621052.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mh2s6ib",
      "author": "pumpernickel3553",
      "body": "Get another doctor ASAP. He is not professional enough for his job.",
      "created_utc": 1741635677.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh35q72",
      "author": "to_tired_to_clare",
      "body": "I am so sorry that you experienced this. If possible I would suggest changing doctors and I would also make an official complaint. Thinking of you",
      "created_utc": 1741639591.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh3te0l",
      "author": "coldhardash",
      "body": "this doctor sounds disgusting im so sorry",
      "created_utc": 1741646603.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhgi9mh",
      "author": "Awkward-Exchange-698",
      "body": "rhythm different bear pet vast summer encouraging decide hat yoke\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1741815476.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhh9fe6",
      "author": "tallaght71",
      "body": "Get a new doctor",
      "created_utc": 1741823833.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhiwal0",
      "author": "Dangerous_Suspect494",
      "body": "I feel you.\nMy old PCP laughed at me in my face and slapped my shoulder.\nMakes me hate doctors because they’re willfully ignorant about EDs. They simply don’t want to educate themselves.",
      "created_utc": 1741847274.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhkrpyf",
      "author": "Electrical-Skirt-508",
      "body": "i was congratulated for losing weight by. doctor once who knew i had an eating disorder, i also was told by a doctor that the loss of appetite from the Adderall, he was putting me on should be a good thing",
      "created_utc": 1741878418.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mh1kc6w",
      "author": "-maru",
      "body": "Totally this. Congratulating weight loss is bad, but is also kind of run of the mill ignorance in the medical profession. But the remark about the nausea medication and purging??? It's *obviously* inappropriate and harmful. It's like someone seeking care for pneumonia and the doctor saying, \"well you smoke anyway lol so why bother\".",
      "created_utc": 1741623339.0,
      "score": 5,
      "context": [
        {
          "id": "mh0czhe",
          "author": "Novel-Property-2062",
          "body": "Maybe I'm petty, but I would file a formal complaint over this. I have limited patience for your average doc who just doesn't know jack about EDs, but wouldn't pursue it for those cases. However if he's being very explicitly told that you're starving yourself, is aware that you purge, and is THIS blasé about it, it's negligence IMO. \n\nI mean obviously get a new doctor too, but if you feel so inclined, I'd encourage you to report him to the relevant medical board in your country. Or in lieu of that, send an email to the office telling them why you're switching providers. He may very well not care, sure. But it at least sets a precedent that he won't retain patients if he doesn't bare minimum improve his bedside manner with EDs.\n\nNot to imply that you have some obligation to act when you're the victim of his behavior, just a suggestion. I'm sorry you had to deal with that nonsense.",
          "created_utc": 1741608642.0
        }
      ]
    },
    {
      "id": "mh088il",
      "author": "Usual-Theme211",
      "body": "1000%. I am trying to find a better doctor now :)",
      "created_utc": 1741606403.0,
      "score": 5,
      "context": [
        {
          "id": "mh081i7",
          "author": "newmommy1994",
          "body": "New. Doctor.",
          "created_utc": 1741606306.0
        }
      ]
    },
    {
      "id": "mh08bwb",
      "author": "newmommy1994",
      "body": "Good luck! I haven’t even been to one cuz I moved and I’m so over trying to find one that I like",
      "created_utc": 1741606452.0,
      "score": 4,
      "context": [
        {
          "id": "mh081i7",
          "author": "newmommy1994",
          "body": "New. Doctor.",
          "created_utc": 1741606306.0
        },
        {
          "id": "mh088il",
          "author": "Usual-Theme211",
          "body": "1000%. I am trying to find a better doctor now :)",
          "created_utc": 1741606403.0
        }
      ]
    },
    {
      "id": "mh08gl8",
      "author": "Usual-Theme211",
      "body": "I actually liked this one enough to stop trying to find a better one until this incident today. It’s so hard to find a good GP. Good luck to you too!",
      "created_utc": 1741606519.0,
      "score": 4,
      "context": [
        {
          "id": "mh081i7",
          "author": "newmommy1994",
          "body": "New. Doctor.",
          "created_utc": 1741606306.0
        },
        {
          "id": "mh088il",
          "author": "Usual-Theme211",
          "body": "1000%. I am trying to find a better doctor now :)",
          "created_utc": 1741606403.0
        },
        {
          "id": "mh08bwb",
          "author": "newmommy1994",
          "body": "Good luck! I haven’t even been to one cuz I moved and I’m so over trying to find one that I like",
          "created_utc": 1741606452.0
        }
      ]
    }
  ]
}