{
  "id": "1ja02h0",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1741827670.0,
  "title": "I miss being anorexic",
  "selftext": "I miss being anorexic. I miss seeing my rips show in the mirror. My eating disorder got so bad that I went to the hospital but I relapsed with bulimia. Plus the big reason I had my eating disorder is because I want to get rid of my chest. I have chest dysphoria.  I should be happy because good things are in my life right now. I have a supportive girlfriend, I got a new job that involves dogs and I haven't self harmed in a while. Yet I can't help but have problems with my body still.  ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ja02h0/i_miss_being_anorexic/",
  "score": 154,
  "num_comments": 11,
  "comments": [
    {
      "id": "mhhl96y",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1741827671.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhikcdd",
      "author": "-aquapixie-",
      "body": "I think this is the important distinction. There's recovery of body, and recovery of mind. We can clinically go through 'recovery' which is caloric needs, healthy exercise, balanced meals multiple times a day, and achieve a body that looks to the naked eye healthy.\n\nThat does not mean our MIND is healthy. That does not mean the Anorexia is recovered in the mind. The disease starts in the mind, the body follows the mind's patterned behaviour. But if the mind is still diseased, then the body is merely a disjointed meatsack existing independently from the disease.\n\nIt's where I'm at, now. I've put on weight... Not a lot, but enough to push me out of the \"doctors are keeping an eye on me\" BMI category. I've got muscle tone from exercising. I'm eating three meals a day. I'm hydrating. My \\*body\\*, as in my fat cells and muscles and organs, are recovering from lifelong malnutrition......... But I still have the anorectic brain. And that brain is still crying at seeing fat in places I don't believe it should exist.\n\nThis is normal. This is real. And this is part of the experience.",
      "created_utc": 1741840790.0,
      "score": 37,
      "context": []
    },
    {
      "id": "mhhoo4c",
      "author": "uronlyprincess",
      "body": "i feel you. i’m still anorexic but i’ve been eating a whole lot more due to being home & being bored all day. it’s absolutely driving me crazy. i miss seeing my ribs through my chest & feeling my hip bone. i miss my more noticable thigh gap. for me, anorexia is a very comforting disorder. i feel like if i ever recovered, i’d feel like a part of me would be lost. i like being sick and it’s dumb when i think about it because i’m such a self aware person - i know it’s bad to continue these practices but the thrill it gives me is too good to pass up.",
      "created_utc": 1741828817.0,
      "score": 45,
      "context": []
    },
    {
      "id": "mhho3v8",
      "author": "neopronoun_dropper",
      "body": "I thought that once. About 5 years ago, and the eating disorder was about 4 years before that",
      "created_utc": 1741828628.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mhj8p5d",
      "author": "purple0vibes",
      "body": "Average recovery stage. It's so fucking annoying. I’m trying to think on a meta level and see this phase as part of the healing process, knowing it won’t last forever—as long as I choose every day to go against the anorexia. Acceptance is key. Stay of social media and diet culture and try to surround yourself with people without disorderd eating behaviors. Try to focus on the goal and don't let yourself distract from these little traps like \"oh I would definitely feel better if I just eat a bit more healthy or lose a bit weight\". It's like taking drugs: You get some short time relief but in the long term, it's getting your mental state worse.\n\nAlso if those thoughts come up, immediately think about all the negative things which comes with an emaciated body and the reason why you choose recovery in the first place.",
      "created_utc": 1741855170.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mhli161",
      "author": "None",
      "body": "Relatable. But I would never go back. I like not feeling weak and not being constipated for weeks at a time. I regret recovery sometimes too but being alive and really living is so much better.",
      "created_utc": 1741885952.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mhnw4rb",
      "author": "amileighg",
      "body": "Anorexia has its own ebb and flow. Being mentally ill is challenging.",
      "created_utc": 1741911020.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhpyzr7",
      "author": "StormRose666",
      "body": "I feel that... Whenever I bind i remember how much smaller and flatter my chest used to be when i was at my worst, how much easier it was to make it completely unnoticeable... But I have to push through with recovery, so I have the energy to work and get money to one day have top surgery, and keep pursuing starting T... all of that came to a complete halt when I was deep in the disorder since I was barely able to do anything, and even if I'm more uncomfortable in my body right now, im doing it for the complete freedom and happiness of my future self. Relapsing is NOT worth it EVER, and we'll both hold through🫶🏻 Wishing you lots of love and strength!",
      "created_utc": 1741945357.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhuwzed",
      "author": "ConferenceTimely4474",
      "body": "I feel you. I'm always thinking \"I don't have control\" and I miss my lovely bones.",
      "created_utc": 1742005121.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhikeix",
      "author": "-aquapixie-",
      "body": "\"I feel like a part of me would be lost.\"\n\nThis.",
      "created_utc": 1741840818.0,
      "score": 8,
      "context": [
        {
          "id": "mhhoo4c",
          "author": "uronlyprincess",
          "body": "i feel you. i’m still anorexic but i’ve been eating a whole lot more due to being home & being bored all day. it’s absolutely driving me crazy. i miss seeing my ribs through my chest & feeling my hip bone. i miss my more noticable thigh gap. for me, anorexia is a very comforting disorder. i feel like if i ever recovered, i’d feel like a part of me would be lost. i like being sick and it’s dumb when i think about it because i’m such a self aware person - i know it’s bad to continue these practices but the thrill it gives me is too good to pass up.",
          "created_utc": 1741828817.0
        }
      ]
    },
    {
      "id": "mhlqov5",
      "author": "None",
      "body": "THIS TBH!!!",
      "created_utc": 1741888368.0,
      "score": 3,
      "context": [
        {
          "id": "mhli161",
          "author": "None",
          "body": "Relatable. But I would never go back. I like not feeling weak and not being constipated for weeks at a time. I regret recovery sometimes too but being alive and really living is so much better.",
          "created_utc": 1741885952.0
        }
      ]
    }
  ]
}