{
  "id": "1jaol4t",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1741904713.0,
  "title": "Took down my stupid ass mirror",
  "selftext": "Finally took down this stupid huge mirror in my hallway I always body check with when I walk past. Put this ugly picture I found in the basement up instead haha. Also it’s not wonky it’s my phone",
  "url": "https://www.reddit.com/gallery/1jaol4t",
  "score": 146,
  "num_comments": 5,
  "comments": [
    {
      "id": "mhnc4s2",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1741904715.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhnd1a6",
      "author": "No-Detective5258",
      "body": "A win is a win!",
      "created_utc": 1741904990.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mhnhtiz",
      "author": "MelodicFriendship262",
      "body": "I feel this no mirrors would be in my house if I lived alone",
      "created_utc": 1741906472.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mhy2n7r",
      "author": "Coco_ross",
      "body": "My house is riddled with mirrors! I can’t wait to move out .",
      "created_utc": 1742057602.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhnem89",
      "author": "Secret_Priority_9353",
      "body": "so proud of you hunny! 🫶",
      "created_utc": 1741905481.0,
      "score": 2,
      "context": []
    }
  ]
}