{
  "id": "1jgb0jf",
  "subreddit": "AnorexiaNervosa",
  "author": "runchmunch",
  "created_utc": 1742540821.0,
  "title": "I can’t make this shit up",
  "selftext": "I’m leaving for residency in 3 weeks. On Tuesday, my mom and I went for a tour of the facility. After, she suggested we stop for lunch. When they delivered our food to the table, she looked at mine in disbelief, “that’s a huge burger.” Lunch progresses and she looks at my burger a couple more times and eventually says “what even is that?” (referring to the breading on my chicken). And one more time for good measure: “I just can’t believe how big that burger is.” Am I stupid or is this situation insanely ironic? How do you recover from ana when living with someone who reinforces it? After I return from residence, I have less than a year left of university until I can move out…how do I not relapse? The best part is, she doesn’t handle criticism well, so “explaining how I’m feeling” will just make her annoyed. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1jgb0jf/i_cant_make_this_shit_up/",
  "score": 192,
  "num_comments": 29,
  "comments": [
    {
      "id": "mixpbeh",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1742540821.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mixq0z4",
      "author": "Royal-Purple-5950",
      "body": "I relate to this a lot. I’m sorry",
      "created_utc": 1742541272.0,
      "score": 72,
      "context": []
    },
    {
      "id": "mixrtlj",
      "author": "fernbbyfern",
      "body": "First of all, this really sucks. It can be so co fusing and invalidating to hear comments like that, especially when it sounds like you’re at least thinking about recovering.\n\nSecond, please share this and any other similar information with your therapist when you do get to res. Hearing from a professional that these types of comments are hurtful might not change how your mom reacts to the feedback, but maybe it does. And regardless of how she reacts, at least your voice will be heard.\n\nWishing you luck, friend.",
      "created_utc": 1742542421.0,
      "score": 48,
      "context": []
    },
    {
      "id": "mixtn53",
      "author": "autumnfire1414",
      "body": "One answer. THERAPY! Take advantage of treatment (cuz it doesn't last as long as it should before insurance runs out). Talk to your therapist. Do family sessions. \n\nOnly you can decide to try and get yourself healthy, but you don't have to do it alone. Utilize therapists, peer support, and use the tools that you learn. \n\nAlso...don't give up if you don't get it 100% right off the bat. People struggle and back slide. We all have our moments. But be aware and pick yourself back up again. \n\nYou can't control other people, but you can control your own actions. Don't let her disordered eating become yours. \n\nYou're amazing. Don't give up!",
      "created_utc": 1742543569.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mixu8cy",
      "author": "pathologicalprotest",
      "body": "I believe you. My mother not only demanded the nutridrinks I got in treatment. She also wanted my medication (anti emetics… like..). And once told me «are you gonna eat ALL THAT???» at me drinking the nutridrink I had to drink on a schedule. \n\nShe also doesn’t handle criticism well. Once when I still lived with them, my father and I, backed by my two older sisters who’d already moved out, sat her down. We very calmly explained how her actions were affecting us. She hollered something like «so I guess I’m just a TYRANT AND YOU HATE ME» and stormed off.\n\nI left that shit show the day I turned 18. \n\nShe’s coming to visit in 3 days:):)\n\nYou have to protect yourself. Do you have siblings or anyone else in your corner where you can try to make light of the situation? Can you come here for support? Use your friends, engulf yourself in your studies. For me personally, I use a version of what they call grey-rocking. I just assume everything out of her mouth is nonsense. Water off a duck’s back. It can help to visualize, to really imagine you are a rock. Another visualization aid I was taught was to imagine you are behind a bulletproof, sound proof glass and they’re just a nasty customer. \n\nGood luck in res. I’m glad you will receive help.",
      "created_utc": 1742543947.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mixuyia",
      "author": "Queenofwands1212",
      "body": "Yeah this is the pure and utter ignorance of people who just don’t realize how detrimental their fucking words can be and how it can literally cause us to become worse in our Ed’s. I had to stay at my uncles a few years ago for a few days, and it was a fucking nightmare. He commented on how huge my salads were, he complained and made fun of me about how it smelled, how late I was eating, he just could not handle being in front of me while I was eating without making constant remarks.\nIt got to the point where I had to literally call him out and say “ the comments about my food need to stop”. And he was shook when called\nHim out. Like it blows my fucking mind someone could actually think it’s appropriate to comment on the dynamics of someone’s meal.",
      "created_utc": 1742544415.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mixzrn0",
      "author": "highlandharris",
      "body": "I have no advice only sympathy really, my mum does the same  , she recently went on a huge rant about my dad feeding her too much, putting mash and pastry on the same plate for dinner etc, I said nothing, and after about 15mins of ranting she said \"sorry, I shouldn't talk to you about this\" and I said \"no not really\" so she carried on ... Same with \"oh I never have a sandwich for lunch I'm so full\" \"your dad's lost weight look\" \"I've lost weight so I need new clothes\" \"this jumper doesn't fit me anymore now\"  etc etc",
      "created_utc": 1742547499.0,
      "score": 8,
      "context": []
    },
    {
      "id": "miyeff6",
      "author": "NamazSasz",
      "body": "I’d also suggest you to talk about this with your future therapist! So hopefully you can develop skills how to cope with your moms comments and behaviour. Also I can relate so much. I went shopping two weeks ago with my mom. We met at 2 pm. As always she told me that she hasn’t eaten anything yet/the whole day. It instantly made me feel bad because I already had breakfast and lunch by that time. In the shopping center she wanted to get something to eat. She got a tiny pretzel. A few hours later we went to a café near my place. She told me how full she still felt from the pretzel and ordered nothing but black coffee.\nI’m not in recovery atm but still I’m so glad I don’t live with my mom anymore. Her disordered comments are triggering and sometimes even ridiculous. Why is she sharing all this with me? To be fair I never told her about my anorexia diagnosis because she is super delusional about my body and my mental health in general. When I was severely uw and my therapist already threatened me to put me into a hospital against my will, my mom was telling me “you are thin but not anorexic thin” (I didn’t even ask for her opinion, and yes my bmi was not only in the anorexic range but in the severely anorexic range but I guess my mom knows better 🙃). Sorry I didn’t want to make this about me. Just know that I feel you, I can imagine how harmful your mom’s comments can be… I wish you all the best for your recovery journey ❤️",
      "created_utc": 1742555828.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mizn9st",
      "author": "UnicornPoopCircus",
      "body": "Does anyone in this sub have a supportive and healthy relationship with their mom? They cause so much chaos for us ED folks! 😂",
      "created_utc": 1742571405.0,
      "score": 5,
      "context": []
    },
    {
      "id": "miztntb",
      "author": "Infamous_Peach_9211",
      "body": "One of the only times my mother has ever said she was proud of me was when I was at my sick weight (thats what I call my lowest point). Bittersweet moment for sure. Yes she was referencing my weight. Lol",
      "created_utc": 1742573257.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mj0jm3s",
      "author": "Anxious-Mechanic-249",
      "body": "Family sessions may help",
      "created_utc": 1742580694.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mj3v2de",
      "author": "batboiben",
      "body": "JUST GONNA SAY I FEEL YOU SO MUCH. Literally I was only able to recover when I convinced my guardian (i had to leave my home when i was a minor) that I was recovered so that they would stay out of my business and not comment on my food at all.",
      "created_utc": 1742624092.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjf0gn9",
      "author": "Tough-Economics2481",
      "body": "my mom did the same thing, when I first went into treatment and she found out how much they would feed me she’d say “that’s so much food I couldn’t even eat that much” “shouldn’t you not be eating over x amount of calories?” etc. safe to say I relapsed. our situation is pretty similar im going back to residential in 4 weeks and they want us to do family therapy to help educate her so I think that’s something that could maybe help u too",
      "created_utc": 1742783308.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjuy2qe",
      "author": "No-Material694",
      "body": "I'm so sorry... what the fuck.",
      "created_utc": 1743007352.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mj4toq4",
      "author": "black_opals",
      "body": "Reminds me of a scene exactly like this in the documentary Thin, where a girl in residency has her mom come visit and her mom is saying these things as she has lunch with her daughter right there in the treatment facility!!!!",
      "created_utc": 1742645573.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj3wemj",
      "author": "runchmunch",
      "body": "Thank you, I will definitely do that 🤎",
      "created_utc": 1742624934.0,
      "score": 3,
      "context": [
        {
          "id": "mixrtlj",
          "author": "fernbbyfern",
          "body": "First of all, this really sucks. It can be so co fusing and invalidating to hear comments like that, especially when it sounds like you’re at least thinking about recovering.\n\nSecond, please share this and any other similar information with your therapist when you do get to res. Hearing from a professional that these types of comments are hurtful might not change how your mom reacts to the feedback, but maybe it does. And regardless of how she reacts, at least your voice will be heard.\n\nWishing you luck, friend.",
          "created_utc": 1742542421.0
        }
      ]
    },
    {
      "id": "miy6nv0",
      "author": "JHRChrist",
      "body": "(Sry this is long. I used to work in a treatment center)\n\nYes! Talk to the family therapist (there will be one) about this. Y’all can plan a family session. Mom will take correction better from a pro. With a mediator you guys can come up with blanket ground rules re: discussing food & mealtime behavior.\n\nYou got two routes with that: you can get into the emotions of it, talk about how these comments make you feel, explain why it’s hard for you and important that she stops this behavior…\n\nOR if you, knowing your mom, think she’ll get too defensive and that route will do more harm than good, then request that the therapist addresses it impartially.\n\nEven something simple from them: “at meal times, no food talk. No commenting on the size of a meal, type of food, moral judgments, etc”. \n\nThey don’t even have to center YOU (& therefore your mother) in the conversation, which could help her not get her back up. Like “this treatment center & ED professionals have found that any comments about food can be triggering. It is absolutely crucial that you do not make these remarks within the hearing of your child, particularly during meal times. It may not seem like a big deal to you, but to someone with this illness it can be an enormous setback. We ask all families of patients to commit to this prior to discharge.”\n\nSounds silly, but some families even benefit from having a code word that stops a triggering conversation. Like a convo safe word - when said, conversation stops, topic changes AND no breakdown of why the conversation was triggering/hurt feelings/etc  can happen until later when the person who code worded is ready to talk about it. It can be something silly to take the tension out of it too - alakazam! Lily pad! Antelope! Or just “red light!”\n\nUnless you plan to engage in a family-based recovery, you are an adult and have doctors to monitor you. Mom needs to commit to no food comments in your presence, esp at mealtimes. Your treatment team can help make this clear to her.\n\nEdit: if you need anything OP or have any questions or can think of anything I could possibly help you with just PM me! I had an ED for 10 yrs then worked in a treatment center for a while (specifically ran all mealtimes!), been recovered now for a decade. Not an expert, just a peer with some experience. 💕. You got this",
      "created_utc": 1742551740.0,
      "score": 12,
      "context": [
        {
          "id": "mixtn53",
          "author": "autumnfire1414",
          "body": "One answer. THERAPY! Take advantage of treatment (cuz it doesn't last as long as it should before insurance runs out). Talk to your therapist. Do family sessions. \n\nOnly you can decide to try and get yourself healthy, but you don't have to do it alone. Utilize therapists, peer support, and use the tools that you learn. \n\nAlso...don't give up if you don't get it 100% right off the bat. People struggle and back slide. We all have our moments. But be aware and pick yourself back up again. \n\nYou can't control other people, but you can control your own actions. Don't let her disordered eating become yours. \n\nYou're amazing. Don't give up!",
          "created_utc": 1742543569.0
        }
      ]
    },
    {
      "id": "mj3wi4b",
      "author": "runchmunch",
      "body": "Thank you 🤎",
      "created_utc": 1742624998.0,
      "score": 1,
      "context": [
        {
          "id": "mixtn53",
          "author": "autumnfire1414",
          "body": "One answer. THERAPY! Take advantage of treatment (cuz it doesn't last as long as it should before insurance runs out). Talk to your therapist. Do family sessions. \n\nOnly you can decide to try and get yourself healthy, but you don't have to do it alone. Utilize therapists, peer support, and use the tools that you learn. \n\nAlso...don't give up if you don't get it 100% right off the bat. People struggle and back slide. We all have our moments. But be aware and pick yourself back up again. \n\nYou can't control other people, but you can control your own actions. Don't let her disordered eating become yours. \n\nYou're amazing. Don't give up!",
          "created_utc": 1742543569.0
        }
      ]
    },
    {
      "id": "mj3y2dy",
      "author": "runchmunch",
      "body": "Thank you for sharing your experience with your mom 🤎 I’m so sorry you had to go through that. I totally relate to the “well I guess I’m just a BAD mom” mom mentality issues. It has gotten to the point where it’s almost too hilarious that I don’t break down in tears *in* the moment. Water off a ducks back is my go-to lol!!\nMy brother is worst because it’s intentional to the point where he wants to make me cry (reinforced that I was fat my whole life, told me “have you ever considered that you *don’t* have body dysmorphia?” etc. etc.). Like bad bad lol. But my friends are the greatest and I utilize them like crazy. I also have an amazing pre-program team who have been huge pillars of support getting me through this. \nThank you :)",
      "created_utc": 1742625993.0,
      "score": 4,
      "context": [
        {
          "id": "mixu8cy",
          "author": "pathologicalprotest",
          "body": "I believe you. My mother not only demanded the nutridrinks I got in treatment. She also wanted my medication (anti emetics… like..). And once told me «are you gonna eat ALL THAT???» at me drinking the nutridrink I had to drink on a schedule. \n\nShe also doesn’t handle criticism well. Once when I still lived with them, my father and I, backed by my two older sisters who’d already moved out, sat her down. We very calmly explained how her actions were affecting us. She hollered something like «so I guess I’m just a TYRANT AND YOU HATE ME» and stormed off.\n\nI left that shit show the day I turned 18. \n\nShe’s coming to visit in 3 days:):)\n\nYou have to protect yourself. Do you have siblings or anyone else in your corner where you can try to make light of the situation? Can you come here for support? Use your friends, engulf yourself in your studies. For me personally, I use a version of what they call grey-rocking. I just assume everything out of her mouth is nonsense. Water off a duck’s back. It can help to visualize, to really imagine you are a rock. Another visualization aid I was taught was to imagine you are behind a bulletproof, sound proof glass and they’re just a nasty customer. \n\nGood luck in res. I’m glad you will receive help.",
          "created_utc": 1742543947.0
        }
      ]
    },
    {
      "id": "mj3v4sx",
      "author": "batboiben",
      "body": "My family has done that type of shit to me since I was a kid and it's a big reason why I developed an ED",
      "created_utc": 1742624134.0,
      "score": 2,
      "context": [
        {
          "id": "mixuyia",
          "author": "Queenofwands1212",
          "body": "Yeah this is the pure and utter ignorance of people who just don’t realize how detrimental their fucking words can be and how it can literally cause us to become worse in our Ed’s. I had to stay at my uncles a few years ago for a few days, and it was a fucking nightmare. He commented on how huge my salads were, he complained and made fun of me about how it smelled, how late I was eating, he just could not handle being in front of me while I was eating without making constant remarks.\nIt got to the point where I had to literally call him out and say “ the comments about my food need to stop”. And he was shook when called\nHim out. Like it blows my fucking mind someone could actually think it’s appropriate to comment on the dynamics of someone’s meal.",
          "created_utc": 1742544415.0
        }
      ]
    },
    {
      "id": "mj3ym7f",
      "author": "runchmunch",
      "body": "Oh my god that sounds like a nightmare. I’m sorry you had to go through that. Sometimes I think people are allergic to self-awareness and context clues. Like hello? I cannot stand when asked about food (like do they think we hide food/are secretive/aloof about it because we are dying to be asked about it? What is the logic there?). The amount of times I have had to say to my parents “I don’t like to be asked about my food,” “please don’t ask about my food,” “asking me about what I’m eating makes me anxious,” and it still doesn’t get through. Good for you for standing your ground! 🤎",
      "created_utc": 1742626347.0,
      "score": 2,
      "context": [
        {
          "id": "mixuyia",
          "author": "Queenofwands1212",
          "body": "Yeah this is the pure and utter ignorance of people who just don’t realize how detrimental their fucking words can be and how it can literally cause us to become worse in our Ed’s. I had to stay at my uncles a few years ago for a few days, and it was a fucking nightmare. He commented on how huge my salads were, he complained and made fun of me about how it smelled, how late I was eating, he just could not handle being in front of me while I was eating without making constant remarks.\nIt got to the point where I had to literally call him out and say “ the comments about my food need to stop”. And he was shook when called\nHim out. Like it blows my fucking mind someone could actually think it’s appropriate to comment on the dynamics of someone’s meal.",
          "created_utc": 1742544415.0
        }
      ]
    },
    {
      "id": "mj3z394",
      "author": "runchmunch",
      "body": "Awww I’m sorry that sounds terrible. It really makes me wonder if they know what they are doing or not. Like they are self-aware enough to acknowledge it, but then continue to do it? I don’t understand. My mom works for a personal trainer doing the meal plans, so all she talks about is healthy this, healthy that. And I hear her drag the scale out every morning. And yet I’m the one that’s disordered? So so frustrating.",
      "created_utc": 1742626657.0,
      "score": 1,
      "context": [
        {
          "id": "mixzrn0",
          "author": "highlandharris",
          "body": "I have no advice only sympathy really, my mum does the same  , she recently went on a huge rant about my dad feeding her too much, putting mash and pastry on the same plate for dinner etc, I said nothing, and after about 15mins of ranting she said \"sorry, I shouldn't talk to you about this\" and I said \"no not really\" so she carried on ... Same with \"oh I never have a sandwich for lunch I'm so full\" \"your dad's lost weight look\" \"I've lost weight so I need new clothes\" \"this jumper doesn't fit me anymore now\"  etc etc",
          "created_utc": 1742547499.0
        }
      ]
    },
    {
      "id": "mj40aj6",
      "author": "runchmunch",
      "body": "No no please don’t feel bad about sharing! It makes me feel less alone. I swear all my friends’ moms don’t have body-image/food complexes, which makes having a mother this way feel super isolating—so thank you! That’s so tough. At least you are out of living with her now, but damn if she can make that many comments in such a short visit, I can’t imagine what that would have been like for you to live with (especially with her denial). Also, why do they always assume doctor status? I’m *sure* their *one* encounter of an anorexic girl online/in film 7 years ago makes them qualified to diagnose it. My mom is very aware of my ED (she actually got me into therapy). But her comments are borderline pro-ana, recently they have been about how skinny I have gotten anytime my body is exposed. I got her to help with self tan on my back and she literally sighed when she looked at it & shook her head. Like, how does she not know this not only reinforces my behaviours but also intensifies the self-hatred/disgust so I am further away from recovering, welp. Looking forward to my 3 months off lol. Sending well wishes to you too 🤎",
      "created_utc": 1742627451.0,
      "score": 1,
      "context": [
        {
          "id": "miyeff6",
          "author": "NamazSasz",
          "body": "I’d also suggest you to talk about this with your future therapist! So hopefully you can develop skills how to cope with your moms comments and behaviour. Also I can relate so much. I went shopping two weeks ago with my mom. We met at 2 pm. As always she told me that she hasn’t eaten anything yet/the whole day. It instantly made me feel bad because I already had breakfast and lunch by that time. In the shopping center she wanted to get something to eat. She got a tiny pretzel. A few hours later we went to a café near my place. She told me how full she still felt from the pretzel and ordered nothing but black coffee.\nI’m not in recovery atm but still I’m so glad I don’t live with my mom anymore. Her disordered comments are triggering and sometimes even ridiculous. Why is she sharing all this with me? To be fair I never told her about my anorexia diagnosis because she is super delusional about my body and my mental health in general. When I was severely uw and my therapist already threatened me to put me into a hospital against my will, my mom was telling me “you are thin but not anorexic thin” (I didn’t even ask for her opinion, and yes my bmi was not only in the anorexic range but in the severely anorexic range but I guess my mom knows better 🙃). Sorry I didn’t want to make this about me. Just know that I feel you, I can imagine how harmful your mom’s comments can be… I wish you all the best for your recovery journey ❤️",
          "created_utc": 1742555828.0
        }
      ]
    },
    {
      "id": "mj40jo4",
      "author": "runchmunch",
      "body": "I think that has to be statistically impossible 😂",
      "created_utc": 1742627618.0,
      "score": 2,
      "context": [
        {
          "id": "mizn9st",
          "author": "UnicornPoopCircus",
          "body": "Does anyone in this sub have a supportive and healthy relationship with their mom? They cause so much chaos for us ED folks! 😂",
          "created_utc": 1742571405.0
        }
      ]
    },
    {
      "id": "mj40z5n",
      "author": "runchmunch",
      "body": "Yup, that’ll leave a bruise. That’s sooo tough, I’m sorry she has forced you to live with those words. When I began my weight loss journey healthily, my mom would offer shopping trips if I reached X weight. I get that feeling of bittersweet all too well. I hope it gets better for you 🤎",
      "created_utc": 1742627902.0,
      "score": 1,
      "context": [
        {
          "id": "miztntb",
          "author": "Infamous_Peach_9211",
          "body": "One of the only times my mother has ever said she was proud of me was when I was at my sick weight (thats what I call my lowest point). Bittersweet moment for sure. Yes she was referencing my weight. Lol",
          "created_utc": 1742573257.0
        }
      ]
    },
    {
      "id": "mk4rrb5",
      "author": "runchmunch",
      "body": "I’m so sorry. I don’t understand how they can be so oblivious. But I’m glad you’re making your way out of it! That must have been tough. & They have groups that family/loved ones can sign up for while I’m gone. I don’t have high hopes of anyone attending.",
      "created_utc": 1743135155.0,
      "score": 2,
      "context": [
        {
          "id": "mjf0gn9",
          "author": "Tough-Economics2481",
          "body": "my mom did the same thing, when I first went into treatment and she found out how much they would feed me she’d say “that’s so much food I couldn’t even eat that much” “shouldn’t you not be eating over x amount of calories?” etc. safe to say I relapsed. our situation is pretty similar im going back to residential in 4 weeks and they want us to do family therapy to help educate her so I think that’s something that could maybe help u too",
          "created_utc": 1742783308.0
        }
      ]
    },
    {
      "id": "mj3wxpy",
      "author": "runchmunch",
      "body": "Wow thank you for this incredibly thoughtful message 🤎 This is great to know before I get there. And, absolutely! Thanks again :)",
      "created_utc": 1742625276.0,
      "score": 2,
      "context": [
        {
          "id": "mixtn53",
          "author": "autumnfire1414",
          "body": "One answer. THERAPY! Take advantage of treatment (cuz it doesn't last as long as it should before insurance runs out). Talk to your therapist. Do family sessions. \n\nOnly you can decide to try and get yourself healthy, but you don't have to do it alone. Utilize therapists, peer support, and use the tools that you learn. \n\nAlso...don't give up if you don't get it 100% right off the bat. People struggle and back slide. We all have our moments. But be aware and pick yourself back up again. \n\nYou can't control other people, but you can control your own actions. Don't let her disordered eating become yours. \n\nYou're amazing. Don't give up!",
          "created_utc": 1742543569.0
        },
        {
          "id": "miy6nv0",
          "author": "JHRChrist",
          "body": "(Sry this is long. I used to work in a treatment center)\n\nYes! Talk to the family therapist (there will be one) about this. Y’all can plan a family session. Mom will take correction better from a pro. With a mediator you guys can come up with blanket ground rules re: discussing food & mealtime behavior.\n\nYou got two routes with that: you can get into the emotions of it, talk about how these comments make you feel, explain why it’s hard for you and important that she stops this behavior…\n\nOR if you, knowing your mom, think she’ll get too defensive and that route will do more harm than good, then request that the therapist addresses it impartially.\n\nEven something simple from them: “at meal times, no food talk. No commenting on the size of a meal, type of food, moral judgments, etc”. \n\nThey don’t even have to center YOU (& therefore your mother) in the conversation, which could help her not get her back up. Like “this treatment center & ED professionals have found that any comments about food can be triggering. It is absolutely crucial that you do not make these remarks within the hearing of your child, particularly during meal times. It may not seem like a big deal to you, but to someone with this illness it can be an enormous setback. We ask all families of patients to commit to this prior to discharge.”\n\nSounds silly, but some families even benefit from having a code word that stops a triggering conversation. Like a convo safe word - when said, conversation stops, topic changes AND no breakdown of why the conversation was triggering/hurt feelings/etc  can happen until later when the person who code worded is ready to talk about it. It can be something silly to take the tension out of it too - alakazam! Lily pad! Antelope! Or just “red light!”\n\nUnless you plan to engage in a family-based recovery, you are an adult and have doctors to monitor you. Mom needs to commit to no food comments in your presence, esp at mealtimes. Your treatment team can help make this clear to her.\n\nEdit: if you need anything OP or have any questions or can think of anything I could possibly help you with just PM me! I had an ED for 10 yrs then worked in a treatment center for a while (specifically ran all mealtimes!), been recovered now for a decade. Not an expert, just a peer with some experience. 💕. You got this",
          "created_utc": 1742551740.0
        }
      ]
    },
    {
      "id": "mj42sma",
      "author": "pathologicalprotest",
      "body": "Wow, I’m so sorry your family is unsupportive. What a hand to be dealt. You sound really resourceful, though. Very glad to hear your pre-program team functions as a support system. Our parents will affect us all out lives I’m afraid, but you will not always have to be close to them. I want to share a funny poem by Philip Larkin with you:\n\nThey fuck you up, your mum and dad.   \n    They may not mean to, but they do.   \nThey fill you with the faults they had\n    And add some extra, just for you.\n\nBut they were fucked up in their turn\n    By fools in old-style hats and coats,   \nWho half the time were soppy-stern\n    And half at one another’s throats.\n\nMan hands on misery to man.\n    It deepens like a coastal shelf.\nGet out as early as you can,\n    And don’t have any kids yourself.",
      "created_utc": 1742629070.0,
      "score": 2,
      "context": [
        {
          "id": "mixu8cy",
          "author": "pathologicalprotest",
          "body": "I believe you. My mother not only demanded the nutridrinks I got in treatment. She also wanted my medication (anti emetics… like..). And once told me «are you gonna eat ALL THAT???» at me drinking the nutridrink I had to drink on a schedule. \n\nShe also doesn’t handle criticism well. Once when I still lived with them, my father and I, backed by my two older sisters who’d already moved out, sat her down. We very calmly explained how her actions were affecting us. She hollered something like «so I guess I’m just a TYRANT AND YOU HATE ME» and stormed off.\n\nI left that shit show the day I turned 18. \n\nShe’s coming to visit in 3 days:):)\n\nYou have to protect yourself. Do you have siblings or anyone else in your corner where you can try to make light of the situation? Can you come here for support? Use your friends, engulf yourself in your studies. For me personally, I use a version of what they call grey-rocking. I just assume everything out of her mouth is nonsense. Water off a duck’s back. It can help to visualize, to really imagine you are a rock. Another visualization aid I was taught was to imagine you are behind a bulletproof, sound proof glass and they’re just a nasty customer. \n\nGood luck in res. I’m glad you will receive help.",
          "created_utc": 1742543947.0
        },
        {
          "id": "mj3y2dy",
          "author": "runchmunch",
          "body": "Thank you for sharing your experience with your mom 🤎 I’m so sorry you had to go through that. I totally relate to the “well I guess I’m just a BAD mom” mom mentality issues. It has gotten to the point where it’s almost too hilarious that I don’t break down in tears *in* the moment. Water off a ducks back is my go-to lol!!\nMy brother is worst because it’s intentional to the point where he wants to make me cry (reinforced that I was fat my whole life, told me “have you ever considered that you *don’t* have body dysmorphia?” etc. etc.). Like bad bad lol. But my friends are the greatest and I utilize them like crazy. I also have an amazing pre-program team who have been huge pillars of support getting me through this. \nThank you :)",
          "created_utc": 1742625993.0
        }
      ]
    },
    {
      "id": "mj4975n",
      "author": "highlandharris",
      "body": "Honestly I feel like it's diet culture that's been forced on them, I listen to a podcast who recently did a mini series about diet culture and looking back on how it was pushed generations back and I feel my grandma also did the same to my mum, my grandma was flat out rude to me, where as my mum comments but isn't as blatantly rude, I think that insecurity gets passed down. It's wrapped up in their feelings about themselves I'm not sure they realise it's triggering for other people. I wonder whether because of how they were brought up and then how extreme social media is now and for me growing up in the 90's it was either your thin or you are nothing, a waste of space/disgusting that it's almost just gotten worse. I'm sorry your having to deal with it, I wish I could offer advice but I haven't worked that out yet! I try to have sympathy for her for feeling that way, and it works in other aspects of life but not really when it comes to this!",
      "created_utc": 1742633346.0,
      "score": 2,
      "context": [
        {
          "id": "mixzrn0",
          "author": "highlandharris",
          "body": "I have no advice only sympathy really, my mum does the same  , she recently went on a huge rant about my dad feeding her too much, putting mash and pastry on the same plate for dinner etc, I said nothing, and after about 15mins of ranting she said \"sorry, I shouldn't talk to you about this\" and I said \"no not really\" so she carried on ... Same with \"oh I never have a sandwich for lunch I'm so full\" \"your dad's lost weight look\" \"I've lost weight so I need new clothes\" \"this jumper doesn't fit me anymore now\"  etc etc",
          "created_utc": 1742547499.0
        },
        {
          "id": "mj3z394",
          "author": "runchmunch",
          "body": "Awww I’m sorry that sounds terrible. It really makes me wonder if they know what they are doing or not. Like they are self-aware enough to acknowledge it, but then continue to do it? I don’t understand. My mom works for a personal trainer doing the meal plans, so all she talks about is healthy this, healthy that. And I hear her drag the scale out every morning. And yet I’m the one that’s disordered? So so frustrating.",
          "created_utc": 1742626657.0
        }
      ]
    }
  ]
}