{
  "id": "1jgg25x",
  "subreddit": "AnorexiaNervosa",
  "author": "Queenofwands1212",
  "created_utc": 1742561434.0,
  "title": "Ozempic is just anorexia in an injection except better",
  "selftext": "EDIT: I’m in no way shaming people with obesity for using glp1 meds. It’s actuwllt\nIncredible that they have these meds to help\nFolks who have obesity.  My issue is with the people who don’t have obesity but they are somehow getting these drugs and losing tons of weight and it’s just enforcing Ed behaviors and lifestyle for them. Tons of woman in Hollywood, probably hundreds of thousands of  people who don’t have much weight to lose at all, but they are becoming sick and ill both physically and mental from these drugs. Hence why I labeled it as Anorexia in an Injection. \n\noverweight or obese people are taking ozempic and other glp1s and they are saying all their food noise and food obsession has lifted and just gone away. Isn’t that nice? Meanwhile, All of us idiots with anorexia are just raw dogging it because well, it’s a fucking real mental illness. But now people are paying to inject themselves with drugs to help them basically form anorexic tendencies \n\n Having an Ed  is misery. But society now glamorizes it and everyone wants to low key be anorexic now. Cool. What I would do for my food noise and obsession to go away. How life would be so different. But of course we can’t be on these drugs because we don’t need to lose weight obviously… but wouldn’t it be cool if they could make a drug for food noise to go away regardless of weight ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1jgg25x/ozempic_is_just_anorexia_in_an_injection_except/",
  "score": 161,
  "num_comments": 92,
  "comments": [
    {
      "id": "miyrqkw",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1742561435.0,
      "score": 1,
      "context": []
    },
    {
      "id": "miyvpzp",
      "author": "ConfidentStrength999",
      "body": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ",
      "created_utc": 1742562854.0,
      "score": 270,
      "context": []
    },
    {
      "id": "miyzfk6",
      "author": "definitelytheproblem",
      "body": "Yeah uh, there’s a lot of assuming in this post. Lots of anorexic folks have food noise and food obsession. You can also still have food noise and food obsession on a GLP-1. Obesity is also a “fucking real mental illness” that deserves medical treatment just as much as AN\n\nAs others stated, vast majority of folks using GLP-1 under doctor’s orders and supervision are not using it to the point of emaciation and with other signs of medication abuse. Doctor would stop script before it got to that point in follow-up appointments. And if someone is buying GLP-1 off market to use/abuse, this may be shocking, they could very well have an ED or even AN. \n\nThere is no social hierarchy of who suffers the most or most noble when it comes to this shit.",
      "created_utc": 1742564131.0,
      "score": 287,
      "context": []
    },
    {
      "id": "mj1luwo",
      "author": "Cinna41",
      "body": "Just because someone else's struggle is different from yours does  not mean yours is more important or that you get to judge.",
      "created_utc": 1742592077.0,
      "score": 42,
      "context": []
    },
    {
      "id": "miytpxk",
      "author": "Acrobatic-Aioli9768",
      "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
      "created_utc": 1742562148.0,
      "score": 77,
      "context": []
    },
    {
      "id": "mj1t75h",
      "author": "Kitchen_Bandicoot_58",
      "body": "I’m diagnosed AN-R, already very underweight, and I desperately want to try it JUST to stop the food noise. Of course I want to lose more, but I would give about anything to just have the food noise stop. I get it that some people with AN-R don’t think about food, but I also know that I’m not alone in having every waking thought consumed by food noise. It makes sense. I’m starving my brain and body so it’s instinctual to obsess over food. It’s just miserable. Like, maybe I’d be able to gain some and be okay if the food noise stopped. It’s what makes me so afraid to eat. I’m afraid if I start it’ll never stop.",
      "created_utc": 1742594413.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mizcrpv",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1742568310.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mizbaf7",
      "author": "mossybuggirl",
      "body": "i think its the opposite, its definitely injectable restriction, but it seems like it would take away all the stress that comes with anorexic restricting, all the obsession, trying to stave off your appetite, all the thought that comes behind it. because i get major food noise with adhd and even worse when i starve myself. which is normal… bc the body wants food to function.",
      "created_utc": 1742567870.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mj0l2kx",
      "author": "sofaraway____",
      "body": "totally disagree that GLP1s are anorexia in an injection and i’m not sure if this is relevant here but my sister who isn’t even really overweight is obsessed with getting on ozempic because “i don’t want to exercise or change the way i eat”…  her doc wont give it to her because her bmi isn’t high enough and she’s so upset.  recently she asked me how i lost so much weight a couple years ago and i was like “umm i had a horrible relapse of my anorexia” and she said in all seriousness, “i wish i had an eating disorder 😣” it’s hard to offend me but jfc.  she said she wants ozempic to make her food noise go away and i’m like girl all i hear all day is food noise… i was so shocked that i went into total freeze mode and just changed the subject but i’m still kicking myself for not standing up for myself and being like wtf ???  i’ve had an eating disorder my whole life and she’s seen it destroy my health…  i genuinely wouldn’t wish an ed on my worst enemy and i’m a petty bitch lol.  how are people so fuckin stupid",
      "created_utc": 1742581128.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mj1wzl2",
      "author": "homeslicy",
      "body": "yeah this ain’t it. get off your high horse, please.",
      "created_utc": 1742595667.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mj0r7gf",
      "author": "fornow_foralways",
      "body": "just because you’re suffering doesn’t mean others have to as well. anorexia is a mental disorder not a skinny disorder.",
      "created_utc": 1742582943.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mizqjjv",
      "author": "FredDurstFan_",
      "body": "I developed my disorder because of the injections. I was not losing like everyone was. If I didn't use it, I wouldn't be here (most likely, never know the future)",
      "created_utc": 1742572358.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mj3p96f",
      "author": "runninginbubbles",
      "body": ">they are saying all their food noise and food obsession has lifted and just gone away. Isn’t that nice? It’s anorexia in an injection\n\nAnorexia is the complete opposite of that though. Anorexia creates a LOT of food noise and a huge obsession with food. \n\n>People are paying to inject themselves with drugs to help them basically become more anorexic... \n\nOzempic doesn't make people have anorexia. It helps obese people lose weight and become a healthy weight. Not severely underweight.\n\n>..but society now glamorizes it and everyone wants to low key be anorexic now. \n\nPeople want to 'low key' be slim , not anorexic.\n\n>but wouldn’t it be cool if they could make a drug for food noise to go away regardless of weight\n\nYes it would. Supposedly some anti-psychotics do this. But what also does this is recovery. I mean, it doesn't have to be as bad as it is currently.",
      "created_utc": 1742620675.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mj1dcy9",
      "author": "likpinklady",
      "body": "As someone with an ED that’s on Mounjaro, I’m insulted but also like fuck this entire society for making me feel so fucking shit about myself I’m injecting myself, taking drugs, starving myself, in my quest to be absolutely fucking tiny.",
      "created_utc": 1742589474.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mj26p5v",
      "author": "VeniceBtich",
      "body": "Uuh I have had anorexia as a teen/early 20s that turned into binge eating disorder early to mid 20s, and I've been taking wegovy for 6 months and it has turned my life around. I don't feel the obsession to either binge eat or starve myself which was what I was in a constant cycle of the last few years. Plus I'm pretty sure it's stopped me from becoming an alcoholic. \n\nIt hasn't stopped the food noise completely, but it's about 80% more manageable. I've got back down to a healthy weight without starvation and obsession and self-hatred. Different EDs exist and you can suffer from multiple ones throughout the years.\n\nWhy can't you just be happy for the unwell people who are using it? I'm sure that many of them may also have EDs too.",
      "created_utc": 1742598892.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mj3jon0",
      "author": "Any_Class_6440",
      "body": "My partner uses ozempic as a diabetic who also has issues with binge eating, it's helped to stabilise his eating habits+ blood sugar levels, I think a lot of the time it's more so to help with health issues which comes with being overweight",
      "created_utc": 1742617768.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mj5gh5l",
      "author": "Skythebluestars",
      "body": "I feel when you take ozemepic for medical reasons. This isnt what OP meant. I think what they meant the media noise around ozempic and people who do have acces to it who dont even need it. But do just use it lose weight. Because they want to be thin. Because of the standards of society. Of the beauty industry.\n\nWell that i am not sure of thats what OP meant. \n\n. When i was deeper into my ed. I really wanted to try it too. I felt jealous of people who had acces to it.\nIt sounded like a 'miracle' medication, that would help me even lose more weight. But when i learned more about it. And the possible side effects. It wasnt that miraculous anymory. It had just a good selling story.",
      "created_utc": 1742654328.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mj311ai",
      "author": "jessiecolborne",
      "body": "I really don’t want to come off as mean but this post is really misguided and incorrect about a lot of things.",
      "created_utc": 1742609872.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mizamqs",
      "author": "Specialist_Cow_7092",
      "body": "That's how I feel with anorexia tho. Food and eating disgusts me. I don't ever think about food and I'm never hungry... I'm also incredibly jealous that the thing I use to convince myself that I'm better than others can now just be gotten with a pill legally. I worked hard to train my body to never be hungry...\n\n Ps. I'm obviously dealing with these emotions and I know how sick and wrong they are but just a perspective.",
      "created_utc": 1742567672.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mj2bq9v",
      "author": "TheGirl90",
      "body": "Binge eating disorder is also a real mental illness. Posts like this are ignorant. You saying that it’s anorexia in an injection just further increases the stigma surrounding GLP-1’s, which are literally life changing for so many people. I’m not on a GLP-1 to “become more anorexic.” I’m on it to help control binge eating disorder and lose weight for health reasons. I eat plenty of calories per day. So please, think about what you say before you say it.",
      "created_utc": 1742600597.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mj3vvim",
      "author": "thefutureisnonbinary",
      "body": "I've had anorexia for years - it's a mental health issue. When I was well I took ozempic under the watch of my doctor due to insulin issues - it's a drug that primarily impacts your physical state. Not the same thing. \n\nAnorexia is a complex mental health condition with grave statistics, please don't reduce it down to less.",
      "created_utc": 1742624598.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj595ao",
      "author": "atomixturquoise",
      "body": "That's not what anorexia means lol unless we're talking about anorexia as a medical symptom (loss of appetite)",
      "created_utc": 1742651831.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj9qnxi",
      "author": "Ok_Agency7968",
      "body": "it’s genuinely enraging",
      "created_utc": 1742709850.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjaz6ye",
      "author": "Ok-Maximum2228",
      "body": "I hate these meds… I think it’s good that they are coming up with obesity solutions, but these injections cause people to lose their appetite. This could definitely cause an ed down the road. Or could at the very least skew one’s perception of normal eating. Obviously this is not the case for everyone though.",
      "created_utc": 1742735393.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mizouo6",
      "author": "Klutzy_Hunter_354",
      "body": "Anorexia is a feeling, anorexia nervosa is a mental illness. They are not anorexic in the way youre talking about.",
      "created_utc": 1742571869.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mj3q5pg",
      "author": "Gullible-Leaf",
      "body": "No. No. No. \n\nFor diabetic people, the hormone leptin and ghrelin are also broken because of insulin being broken. Meds like ozempic help improve the sensitivity of insulin which helps bring leptin and ghrelin back to normal. That brings their appetite from over eating down to normal eating.\n\nThis ozempic shame is the reason so many people who have diabetes or insulin resistance and are prescribed ozempic get shamed with - well yeah if anyone has ozempic they'll lose weight.\n\nLosong weight is not the only goal! Obese folks also fall into this. Obesity comes with insulin resistance issues because higher lipids means higher androgen which helps reduce insulin sensitivity.\n\nAll that im saying thr general situation. Doesn't consider every specific case. But that's what the meds are for! Glp aand gip 1 meds are really useful for diabetics. \n\nSuffering from one problem doesn't mean that the other problem cases to exist. Most doctors around me make your prove you can lose weight and stick to diet and regime before they give you ozempic. It's not a candy they're handling out on a plate.\n\nOzempic. Is. Not. Anorexia. In. An. injection! Just yesterday in a ttc sub where someone with pcos was talking about how they don't want to take ozempic because that's a weight loss drug. It's not a weight loss drug! You need it for your insulin issues! Please stop villianizing a drug. Villianize the society that thinks thin = awesome.",
      "created_utc": 1742621186.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mizsp72",
      "author": "feronp22",
      "body": "I completely agree.",
      "created_utc": 1742572979.0,
      "score": -4,
      "context": []
    },
    {
      "id": "mj3dlh9",
      "author": "riflebunny",
      "body": "It’s so fucked up that these people have to be fat first to win the anorexia lottery. Is like…. Watching my dreams still remain unattainable.",
      "created_utc": 1742614991.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mj8wuys",
      "author": "jun3_bugz",
      "body": "this is the stupidest take so far",
      "created_utc": 1742695909.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mjohihj",
      "author": "Ok_Masterpiece_5754",
      "body": "I took Ozempic during my “recovery” period which is ironic because obviously I wasn’t recovered, and have currently relapsed backing into restriction. I wasn’t overweight when I took it, I lied about my weight and went on an app. Which actually blows my mind to this day how easy it is to get. But did it cause my relapse? No. In fact, my metabolism was already messed up due to my ed, and even in recovery I could only eat up to a certain borderline healthy amount before gaining weight. So it did help me in that aspect. But the weight came off slower, over many months in fact the same weight I lost from restriction came off a lot faster, which is fewer months. It did help with my food noise, and alcohol consumption in the event of eating or drinking due to stress or boredom. And I got up to the highest Ozempic dosing too before stopping because I couldn’t deal with the exhaustion it gave me. And I also take adhd medication. So you would think it be some super golden weight loss cure all but no it wasn’t. I think if anything people are getting the results they want because they stop snacking throughout the day and eat when they are hungry. Which is the case why people are known to not eat full portions of their meals on it because they stop when they are full. That’s really all it does.",
      "created_utc": 1742920864.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mizloq2",
      "author": "UnicornPoopCircus",
      "body": "I have so many coworkers who are on this. It's wildly triggering. The thing that really annoys me is none of them openly admit they're on it. You have to catch them when they're in the mood to share their little secret. Otherwise, they are pretending that they have just been exercising more or have cut out soda or some nonsense. \n\nI have one coworker who I guess has come to the end of the line as far as being able to continue with her prescription. She was having a meltdown about it in front of me. She was acting like a drug addict...I suppose because she kind of is.",
      "created_utc": 1742570938.0,
      "score": -18,
      "context": []
    },
    {
      "id": "miyw7oz",
      "author": "Competitive-Target95",
      "body": "there is a difference between anorexia and anorexia nervosa.",
      "created_utc": 1742563024.0,
      "score": 51,
      "context": [
        {
          "id": "miyvpzp",
          "author": "ConfidentStrength999",
          "body": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ",
          "created_utc": 1742562854.0
        }
      ]
    },
    {
      "id": "mkglzsf",
      "author": "Equivalent-Funny-820",
      "body": "Ive had disordered eating my entire life but ozempic and losing weight did trigger anorexia for me.",
      "created_utc": 1743303154.0,
      "score": 2,
      "context": [
        {
          "id": "miyvpzp",
          "author": "ConfidentStrength999",
          "body": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ",
          "created_utc": 1742562854.0
        }
      ]
    },
    {
      "id": "mj1dg00",
      "author": "likpinklady",
      "body": "They definitely fucking are.",
      "created_utc": 1742589499.0,
      "score": 5,
      "context": [
        {
          "id": "miyvpzp",
          "author": "ConfidentStrength999",
          "body": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ",
          "created_utc": 1742562854.0
        }
      ]
    },
    {
      "id": "miywhrv",
      "author": "HonestToe2408",
      "body": "But the experience of anorexia is wildly different for each person. It is 100% true that these drugs are leading to eating disorders. Especially when people are taken off the drug.",
      "created_utc": 1742563121.0,
      "score": -33,
      "context": [
        {
          "id": "miyvpzp",
          "author": "ConfidentStrength999",
          "body": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ",
          "created_utc": 1742562854.0
        }
      ]
    },
    {
      "id": "miz66pu",
      "author": "catsinsunglassess",
      "body": "I was about to say… during my worst with anorexia nervosa literally ALL I THOUGHT ABOUT WAS FOOD. Food obsession and noise does not go away just because you’re not eating. \n\nThank you for putting all of this into words! This post is very troubling. OP is mad because people are losing weight in what they consider “the easy” way, instead of developing a severe mental illness to lose weight. This is pretty gross.",
      "created_utc": 1742566324.0,
      "score": 142,
      "context": [
        {
          "id": "miyzfk6",
          "author": "definitelytheproblem",
          "body": "Yeah uh, there’s a lot of assuming in this post. Lots of anorexic folks have food noise and food obsession. You can also still have food noise and food obsession on a GLP-1. Obesity is also a “fucking real mental illness” that deserves medical treatment just as much as AN\n\nAs others stated, vast majority of folks using GLP-1 under doctor’s orders and supervision are not using it to the point of emaciation and with other signs of medication abuse. Doctor would stop script before it got to that point in follow-up appointments. And if someone is buying GLP-1 off market to use/abuse, this may be shocking, they could very well have an ED or even AN. \n\nThere is no social hierarchy of who suffers the most or most noble when it comes to this shit.",
          "created_utc": 1742564131.0
        }
      ]
    },
    {
      "id": "mj49nsv",
      "author": "Independent_Age5363",
      "body": "Narh, in Denmark it's very common to get a private doctor to prescribe it. All the rich thin people are on it while the obese people can't afford it (insurance doesn't cover it here)",
      "created_utc": 1742633660.0,
      "score": 4,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        }
      ]
    },
    {
      "id": "mizrpbs",
      "author": "pdt666",
      "body": "i know several people who don’t have an overweight bmi who take weight loss injectable meds ",
      "created_utc": 1742572692.0,
      "score": 12,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        }
      ]
    },
    {
      "id": "mj2635l",
      "author": "LoveThatForYouBebe",
      "body": "Unfortunately that’s not completely accurate. I was just inpatient at a program a couple times last year, and the therapist I had there said they had seen patients admitted to the EDU who had managed to get Ozempic despite already being on in the UW/anorexia bmi range.",
      "created_utc": 1742598690.0,
      "score": 4,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        }
      ]
    },
    {
      "id": "miyuid7",
      "author": "Sporknut",
      "body": "This is just not true. Many things can cause weight gain… medical conditions, genetics, meds. Being overweight does not mean you overeat",
      "created_utc": 1742562429.0,
      "score": -20,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        }
      ]
    },
    {
      "id": "miyucl6",
      "author": "twentyfouram",
      "body": "u can be overweight and eat normally…..",
      "created_utc": 1742562372.0,
      "score": -16,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        }
      ]
    },
    {
      "id": "mj3qzm0",
      "author": "Dependent_Setting415",
      "body": "\"I'm afraid if I start it'll never stop\" \n\nThis is the biggest thing holding me back from recovery. I can't remember the last time in my life I maintained a weight- I've always been either gaining or losing. So I know which one I prefer.",
      "created_utc": 1742621658.0,
      "score": 3,
      "context": [
        {
          "id": "mj1t75h",
          "author": "Kitchen_Bandicoot_58",
          "body": "I’m diagnosed AN-R, already very underweight, and I desperately want to try it JUST to stop the food noise. Of course I want to lose more, but I would give about anything to just have the food noise stop. I get it that some people with AN-R don’t think about food, but I also know that I’m not alone in having every waking thought consumed by food noise. It makes sense. I’m starving my brain and body so it’s instinctual to obsess over food. It’s just miserable. Like, maybe I’d be able to gain some and be okay if the food noise stopped. It’s what makes me so afraid to eat. I’m afraid if I start it’ll never stop.",
          "created_utc": 1742594413.0
        }
      ]
    },
    {
      "id": "mj21xkf",
      "author": "Queenofwands1212",
      "body": "I’m right there with you…. I’ve had Ed’s for 20 years. I’m deep deep in my Anorexia again and when we become underweight and malnourished, food focus and food obsession is normal. Im amazed that this medication can turn off food noise. But im not sure how it would work for anorexics who are physically malnourished. I am the same exact way. I literally starve myself all day and night and I can’t let myself eat until a couple hours before bed. Because I can’t handle a long eating window, I can’t trust myself",
      "created_utc": 1742597314.0,
      "score": -2,
      "context": [
        {
          "id": "mj1t75h",
          "author": "Kitchen_Bandicoot_58",
          "body": "I’m diagnosed AN-R, already very underweight, and I desperately want to try it JUST to stop the food noise. Of course I want to lose more, but I would give about anything to just have the food noise stop. I get it that some people with AN-R don’t think about food, but I also know that I’m not alone in having every waking thought consumed by food noise. It makes sense. I’m starving my brain and body so it’s instinctual to obsess over food. It’s just miserable. Like, maybe I’d be able to gain some and be okay if the food noise stopped. It’s what makes me so afraid to eat. I’m afraid if I start it’ll never stop.",
          "created_utc": 1742594413.0
        }
      ]
    },
    {
      "id": "mj1ewaw",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1742589934.0,
      "score": 1,
      "context": [
        {
          "id": "mizcrpv",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1742568310.0
        }
      ]
    },
    {
      "id": "mj1zmih",
      "author": "Queenofwands1212",
      "body": "Ew. wtf lmao. High horse? For having a severe mental illness and being low key jealous of people using Ozempic… high horse bullshit",
      "created_utc": 1742596552.0,
      "score": -15,
      "context": [
        {
          "id": "mj1wzl2",
          "author": "homeslicy",
          "body": "yeah this ain’t it. get off your high horse, please.",
          "created_utc": 1742595667.0
        }
      ]
    },
    {
      "id": "mizs2rs",
      "author": "pdt666",
      "body": "this is a really interesting perspective and there’s no way you’re alone! i can see how this meds could be mentally triggering like that ",
      "created_utc": 1742572798.0,
      "score": 10,
      "context": [
        {
          "id": "mizqjjv",
          "author": "FredDurstFan_",
          "body": "I developed my disorder because of the injections. I was not losing like everyone was. If I didn't use it, I wouldn't be here (most likely, never know the future)",
          "created_utc": 1742572358.0
        }
      ]
    },
    {
      "id": "mj1dtsk",
      "author": "likpinklady",
      "body": "Same. I will take anything, do anything to help me not eat. Because I have an ED and want to be fucking tiny",
      "created_utc": 1742589613.0,
      "score": 2,
      "context": [
        {
          "id": "mizqjjv",
          "author": "FredDurstFan_",
          "body": "I developed my disorder because of the injections. I was not losing like everyone was. If I didn't use it, I wouldn't be here (most likely, never know the future)",
          "created_utc": 1742572358.0
        }
      ]
    },
    {
      "id": "mj1fdkd",
      "author": "Queenofwands1212",
      "body": "Agreed",
      "created_utc": 1742590079.0,
      "score": 3,
      "context": [
        {
          "id": "mj1dcy9",
          "author": "likpinklady",
          "body": "As someone with an ED that’s on Mounjaro, I’m insulted but also like fuck this entire society for making me feel so fucking shit about myself I’m injecting myself, taking drugs, starving myself, in my quest to be absolutely fucking tiny.",
          "created_utc": 1742589474.0
        }
      ]
    },
    {
      "id": "mj2h66j",
      "author": "Queenofwands1212",
      "body": "It’s not about “being happy” for them. That’s great they are using something that works. I’m just saying it would be cool to have something to help folks with Ed’s to lower the food noise. You know the experience of anorexia yourself, it sucks to be completely mentally ill around food",
      "created_utc": 1742602499.0,
      "score": -3,
      "context": [
        {
          "id": "mj26p5v",
          "author": "VeniceBtich",
          "body": "Uuh I have had anorexia as a teen/early 20s that turned into binge eating disorder early to mid 20s, and I've been taking wegovy for 6 months and it has turned my life around. I don't feel the obsession to either binge eat or starve myself which was what I was in a constant cycle of the last few years. Plus I'm pretty sure it's stopped me from becoming an alcoholic. \n\nIt hasn't stopped the food noise completely, but it's about 80% more manageable. I've got back down to a healthy weight without starvation and obsession and self-hatred. Different EDs exist and you can suffer from multiple ones throughout the years.\n\nWhy can't you just be happy for the unwell people who are using it? I'm sure that many of them may also have EDs too.",
          "created_utc": 1742598892.0
        }
      ]
    },
    {
      "id": "mj7eeuh",
      "author": "Queenofwands1212",
      "body": "Yes.. that’s what I was meaning but people love to twist and turn words here on Reddit . I’m not shaming obese or overweight people for using the medication. But there’s a huge abuse of the medication as well, even in overweight folks, or people who don’t have weight to lose",
      "created_utc": 1742676607.0,
      "score": 2,
      "context": [
        {
          "id": "mj5gh5l",
          "author": "Skythebluestars",
          "body": "I feel when you take ozemepic for medical reasons. This isnt what OP meant. I think what they meant the media noise around ozempic and people who do have acces to it who dont even need it. But do just use it lose weight. Because they want to be thin. Because of the standards of society. Of the beauty industry.\n\nWell that i am not sure of thats what OP meant. \n\n. When i was deeper into my ed. I really wanted to try it too. I felt jealous of people who had acces to it.\nIt sounded like a 'miracle' medication, that would help me even lose more weight. But when i learned more about it. And the possible side effects. It wasnt that miraculous anymory. It had just a good selling story.",
          "created_utc": 1742654328.0
        }
      ]
    },
    {
      "id": "mj1e974",
      "author": "likpinklady",
      "body": "I personally love and hate food at the same time. I miss the happiness it used to give me. Eating and sharing meals with friends and loved ones and the just happy, communal aspect of it. \nHowever the idea and sensation of actually having food inside me absolutely repulses me and gives me tremendous anxiety. It’s a complicated relationship.",
      "created_utc": 1742589741.0,
      "score": 4,
      "context": [
        {
          "id": "mizamqs",
          "author": "Specialist_Cow_7092",
          "body": "That's how I feel with anorexia tho. Food and eating disgusts me. I don't ever think about food and I'm never hungry... I'm also incredibly jealous that the thing I use to convince myself that I'm better than others can now just be gotten with a pill legally. I worked hard to train my body to never be hungry...\n\n Ps. I'm obviously dealing with these emotions and I know how sick and wrong they are but just a perspective.",
          "created_utc": 1742567672.0
        }
      ]
    },
    {
      "id": "mizaz9z",
      "author": "Specialist_Cow_7092",
      "body": "This was supposed to be a reply to someone else but I'm leaving here lol",
      "created_utc": 1742567776.0,
      "score": 3,
      "context": [
        {
          "id": "mizamqs",
          "author": "Specialist_Cow_7092",
          "body": "That's how I feel with anorexia tho. Food and eating disgusts me. I don't ever think about food and I'm never hungry... I'm also incredibly jealous that the thing I use to convince myself that I'm better than others can now just be gotten with a pill legally. I worked hard to train my body to never be hungry...\n\n Ps. I'm obviously dealing with these emotions and I know how sick and wrong they are but just a perspective.",
          "created_utc": 1742567672.0
        }
      ]
    },
    {
      "id": "mj05xjy",
      "author": "Downtown-Event-1326",
      "body": "I'm sorry you're being down voted for this honest post.",
      "created_utc": 1742576811.0,
      "score": 4,
      "context": [
        {
          "id": "mizamqs",
          "author": "Specialist_Cow_7092",
          "body": "That's how I feel with anorexia tho. Food and eating disgusts me. I don't ever think about food and I'm never hungry... I'm also incredibly jealous that the thing I use to convince myself that I'm better than others can now just be gotten with a pill legally. I worked hard to train my body to never be hungry...\n\n Ps. I'm obviously dealing with these emotions and I know how sick and wrong they are but just a perspective.",
          "created_utc": 1742567672.0
        }
      ]
    },
    {
      "id": "mjex2sr",
      "author": "ExaminationDry4926",
      "body": "So knowing how anorexia nervosa feels, did taking the Ozempic quiet the food noise? IE, did it solve all the food noise problems?",
      "created_utc": 1742782009.0,
      "score": 1,
      "context": [
        {
          "id": "mj3vvim",
          "author": "thefutureisnonbinary",
          "body": "I've had anorexia for years - it's a mental health issue. When I was well I took ozempic under the watch of my doctor due to insulin issues - it's a drug that primarily impacts your physical state. Not the same thing. \n\nAnorexia is a complex mental health condition with grave statistics, please don't reduce it down to less.",
          "created_utc": 1742624598.0
        }
      ]
    },
    {
      "id": "mjrsm9d",
      "author": "Queenofwands1212",
      "body": "Yeah it works on the fullness receptor of the brain. But if someone already is super disordered and wants to basically become anorexic and get super skinny they can use Ozempic as fuel to fuel the fire if that.theyll use it for the physical and emotional side effects and use that as fuel to starve and maybe placebo too.",
      "created_utc": 1742957041.0,
      "score": 1,
      "context": [
        {
          "id": "mjohihj",
          "author": "Ok_Masterpiece_5754",
          "body": "I took Ozempic during my “recovery” period which is ironic because obviously I wasn’t recovered, and have currently relapsed backing into restriction. I wasn’t overweight when I took it, I lied about my weight and went on an app. Which actually blows my mind to this day how easy it is to get. But did it cause my relapse? No. In fact, my metabolism was already messed up due to my ed, and even in recovery I could only eat up to a certain borderline healthy amount before gaining weight. So it did help me in that aspect. But the weight came off slower, over many months in fact the same weight I lost from restriction came off a lot faster, which is fewer months. It did help with my food noise, and alcohol consumption in the event of eating or drinking due to stress or boredom. And I got up to the highest Ozempic dosing too before stopping because I couldn’t deal with the exhaustion it gave me. And I also take adhd medication. So you would think it be some super golden weight loss cure all but no it wasn’t. I think if anything people are getting the results they want because they stop snacking throughout the day and eat when they are hungry. Which is the case why people are known to not eat full portions of their meals on it because they stop when they are full. That’s really all it does.",
          "created_utc": 1742920864.0
        }
      ]
    },
    {
      "id": "miznm99",
      "author": "Acrobatic-Aioli9768",
      "body": "“Catch them” ?? It’s your coworker, you don’t know them and they’re not obligated to share their medical history with you.",
      "created_utc": 1742571508.0,
      "score": 16,
      "context": [
        {
          "id": "mizloq2",
          "author": "UnicornPoopCircus",
          "body": "I have so many coworkers who are on this. It's wildly triggering. The thing that really annoys me is none of them openly admit they're on it. You have to catch them when they're in the mood to share their little secret. Otherwise, they are pretending that they have just been exercising more or have cut out soda or some nonsense. \n\nI have one coworker who I guess has come to the end of the line as far as being able to continue with her prescription. She was having a meltdown about it in front of me. She was acting like a drug addict...I suppose because she kind of is.",
          "created_utc": 1742570938.0
        }
      ]
    },
    {
      "id": "miywzxi",
      "author": "ConfidentStrength999",
      "body": "Yeah but I think it’s safe to assume in an anorexia nervous sub that when we say anorexia we’re referring to the mental illness",
      "created_utc": 1742563296.0,
      "score": 106,
      "context": [
        {
          "id": "miyvpzp",
          "author": "ConfidentStrength999",
          "body": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ",
          "created_utc": 1742562854.0
        },
        {
          "id": "miyw7oz",
          "author": "Competitive-Target95",
          "body": "there is a difference between anorexia and anorexia nervosa.",
          "created_utc": 1742563024.0
        }
      ]
    },
    {
      "id": "miz0z0l",
      "author": "MetalingusMikeII",
      "body": "What’s the difference?",
      "created_utc": 1742564649.0,
      "score": 5,
      "context": [
        {
          "id": "miyvpzp",
          "author": "ConfidentStrength999",
          "body": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ",
          "created_utc": 1742562854.0
        },
        {
          "id": "miyw7oz",
          "author": "Competitive-Target95",
          "body": "there is a difference between anorexia and anorexia nervosa.",
          "created_utc": 1742563024.0
        }
      ]
    },
    {
      "id": "mj44ivn",
      "author": "SoFetchBetch",
      "body": "I’ve been seeing things like it makes you satisfied and lack desire for… anything. More than just food. Which is kinda frightening to me. What happens when we dull desire? What drives people then?",
      "created_utc": 1742630194.0,
      "score": 5,
      "context": [
        {
          "id": "miyvpzp",
          "author": "ConfidentStrength999",
          "body": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ",
          "created_utc": 1742562854.0
        },
        {
          "id": "mj1dg00",
          "author": "likpinklady",
          "body": "They definitely fucking are.",
          "created_utc": 1742589499.0
        }
      ]
    },
    {
      "id": "mizdw56",
      "author": "definitelytheproblem",
      "body": "This is like saying eating a big meal will make you morbidly obese. A GLP-1 medication will not give you anorexia nervosa unless you are already predisposed to abusing medications and engaging in self-harm behaviors that would be common for folks with AN.",
      "created_utc": 1742568640.0,
      "score": 36,
      "context": [
        {
          "id": "miyvpzp",
          "author": "ConfidentStrength999",
          "body": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ",
          "created_utc": 1742562854.0
        },
        {
          "id": "miywhrv",
          "author": "HonestToe2408",
          "body": "But the experience of anorexia is wildly different for each person. It is 100% true that these drugs are leading to eating disorders. Especially when people are taken off the drug.",
          "created_utc": 1742563121.0
        }
      ]
    },
    {
      "id": "mj2h1um",
      "author": "graphicinnit",
      "body": "Yeah isn't it like.. kind of impossible to starve without having a constant food obsession?",
      "created_utc": 1742602455.0,
      "score": 18,
      "context": [
        {
          "id": "miyzfk6",
          "author": "definitelytheproblem",
          "body": "Yeah uh, there’s a lot of assuming in this post. Lots of anorexic folks have food noise and food obsession. You can also still have food noise and food obsession on a GLP-1. Obesity is also a “fucking real mental illness” that deserves medical treatment just as much as AN\n\nAs others stated, vast majority of folks using GLP-1 under doctor’s orders and supervision are not using it to the point of emaciation and with other signs of medication abuse. Doctor would stop script before it got to that point in follow-up appointments. And if someone is buying GLP-1 off market to use/abuse, this may be shocking, they could very well have an ED or even AN. \n\nThere is no social hierarchy of who suffers the most or most noble when it comes to this shit.",
          "created_utc": 1742564131.0
        },
        {
          "id": "miz66pu",
          "author": "catsinsunglassess",
          "body": "I was about to say… during my worst with anorexia nervosa literally ALL I THOUGHT ABOUT WAS FOOD. Food obsession and noise does not go away just because you’re not eating. \n\nThank you for putting all of this into words! This post is very troubling. OP is mad because people are losing weight in what they consider “the easy” way, instead of developing a severe mental illness to lose weight. This is pretty gross.",
          "created_utc": 1742566324.0
        }
      ]
    },
    {
      "id": "mj28jdw",
      "author": "sensitive-annie",
      "body": "pretty sure OP is just jealous or upset that they can’t afford it or something. there’s a lot of hate in this post for a community that were supposed to support all eating disorders/mental illnesses.",
      "created_utc": 1742599510.0,
      "score": 19,
      "context": [
        {
          "id": "miyzfk6",
          "author": "definitelytheproblem",
          "body": "Yeah uh, there’s a lot of assuming in this post. Lots of anorexic folks have food noise and food obsession. You can also still have food noise and food obsession on a GLP-1. Obesity is also a “fucking real mental illness” that deserves medical treatment just as much as AN\n\nAs others stated, vast majority of folks using GLP-1 under doctor’s orders and supervision are not using it to the point of emaciation and with other signs of medication abuse. Doctor would stop script before it got to that point in follow-up appointments. And if someone is buying GLP-1 off market to use/abuse, this may be shocking, they could very well have an ED or even AN. \n\nThere is no social hierarchy of who suffers the most or most noble when it comes to this shit.",
          "created_utc": 1742564131.0
        },
        {
          "id": "miz66pu",
          "author": "catsinsunglassess",
          "body": "I was about to say… during my worst with anorexia nervosa literally ALL I THOUGHT ABOUT WAS FOOD. Food obsession and noise does not go away just because you’re not eating. \n\nThank you for putting all of this into words! This post is very troubling. OP is mad because people are losing weight in what they consider “the easy” way, instead of developing a severe mental illness to lose weight. This is pretty gross.",
          "created_utc": 1742566324.0
        }
      ]
    },
    {
      "id": "mj40l7b",
      "author": "HarkSaidHarold",
      "body": "Yeah I'm pretty mad they managed to get 80+ upvotes for this terrible take.",
      "created_utc": 1742627647.0,
      "score": 5,
      "context": [
        {
          "id": "miyzfk6",
          "author": "definitelytheproblem",
          "body": "Yeah uh, there’s a lot of assuming in this post. Lots of anorexic folks have food noise and food obsession. You can also still have food noise and food obsession on a GLP-1. Obesity is also a “fucking real mental illness” that deserves medical treatment just as much as AN\n\nAs others stated, vast majority of folks using GLP-1 under doctor’s orders and supervision are not using it to the point of emaciation and with other signs of medication abuse. Doctor would stop script before it got to that point in follow-up appointments. And if someone is buying GLP-1 off market to use/abuse, this may be shocking, they could very well have an ED or even AN. \n\nThere is no social hierarchy of who suffers the most or most noble when it comes to this shit.",
          "created_utc": 1742564131.0
        },
        {
          "id": "miz66pu",
          "author": "catsinsunglassess",
          "body": "I was about to say… during my worst with anorexia nervosa literally ALL I THOUGHT ABOUT WAS FOOD. Food obsession and noise does not go away just because you’re not eating. \n\nThank you for putting all of this into words! This post is very troubling. OP is mad because people are losing weight in what they consider “the easy” way, instead of developing a severe mental illness to lose weight. This is pretty gross.",
          "created_utc": 1742566324.0
        }
      ]
    },
    {
      "id": "miz09nh",
      "author": "Condemned2Be",
      "body": "But I don’t think they were trying to cover every nuance of weight fluctuation in their small comment. They were specifically talking about people who are seeing a doctor & then prescribed ozempic.\n\nAnd it is pretty safe to say those people do have some food issues, as that is usually why they are pursuing something as extremely uncomfortable as ozempic",
      "created_utc": 1742564415.0,
      "score": 10,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        },
        {
          "id": "miyuid7",
          "author": "Sporknut",
          "body": "This is just not true. Many things can cause weight gain… medical conditions, genetics, meds. Being overweight does not mean you overeat",
          "created_utc": 1742562429.0
        }
      ]
    },
    {
      "id": "miyumpf",
      "author": "Sporknut",
      "body": "And you are a part of the problem with weight stigma. Being overweight is not a personal failing or a disorder",
      "created_utc": 1742562471.0,
      "score": -20,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        },
        {
          "id": "miyuid7",
          "author": "Sporknut",
          "body": "This is just not true. Many things can cause weight gain… medical conditions, genetics, meds. Being overweight does not mean you overeat",
          "created_utc": 1742562429.0
        }
      ]
    },
    {
      "id": "miz6ixa",
      "author": "thelouisfanclub",
      "body": "100% if you live a sedentary lifestyle and \"eat normally\" you can end up being overweight.  Maybe not obese but certainly heavier than you're supposed to.  Try being a middle aged woman working in an office during the day and sitting in front of the TV in the evening, and see how you do eating the recommended 2000 calories a day.",
      "created_utc": 1742566429.0,
      "score": 17,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        },
        {
          "id": "miyucl6",
          "author": "twentyfouram",
          "body": "u can be overweight and eat normally…..",
          "created_utc": 1742562372.0
        }
      ]
    },
    {
      "id": "mj1govd",
      "author": "Christine7690",
      "body": "Define “normally”. It’s calories in vs. calories out.",
      "created_utc": 1742590475.0,
      "score": 5,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        },
        {
          "id": "miyucl6",
          "author": "twentyfouram",
          "body": "u can be overweight and eat normally…..",
          "created_utc": 1742562372.0
        }
      ]
    },
    {
      "id": "mj103b0",
      "author": "Sporknut",
      "body": "Solidarity.. I’m getting down voted too. 💝\n\nThese people blaming and shaming overweight folks for things that are can be outside of their control. I guess the disordered anorexia  thoughts may make the idea that you can be healthy and overweight unbelieveable… you’d have to hold two ideas in your head at the same time.\n\npart of healing is realizing that it’s okay to be heavier. \n\nI gained weight as a result of taking meds, fucking over my metabolism for 15 years, and stopping overexercising finally. You guys would say that I am overweight and that I overeat—while my dietician is trying to get me to eat more cause I’m still restricting, skipping meals and fucking over my metabolism more, so when I do eat my body tries to store it.",
      "created_utc": 1742585561.0,
      "score": 8,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        },
        {
          "id": "miyucl6",
          "author": "twentyfouram",
          "body": "u can be overweight and eat normally…..",
          "created_utc": 1742562372.0
        }
      ]
    },
    {
      "id": "mjcqk9q",
      "author": "BallSufficient5671",
      "body": "Same here",
      "created_utc": 1742755941.0,
      "score": 1,
      "context": [
        {
          "id": "mj1t75h",
          "author": "Kitchen_Bandicoot_58",
          "body": "I’m diagnosed AN-R, already very underweight, and I desperately want to try it JUST to stop the food noise. Of course I want to lose more, but I would give about anything to just have the food noise stop. I get it that some people with AN-R don’t think about food, but I also know that I’m not alone in having every waking thought consumed by food noise. It makes sense. I’m starving my brain and body so it’s instinctual to obsess over food. It’s just miserable. Like, maybe I’d be able to gain some and be okay if the food noise stopped. It’s what makes me so afraid to eat. I’m afraid if I start it’ll never stop.",
          "created_utc": 1742594413.0
        },
        {
          "id": "mj3qzm0",
          "author": "Dependent_Setting415",
          "body": "\"I'm afraid if I start it'll never stop\" \n\nThis is the biggest thing holding me back from recovery. I can't remember the last time in my life I maintained a weight- I've always been either gaining or losing. So I know which one I prefer.",
          "created_utc": 1742621658.0
        }
      ]
    },
    {
      "id": "mj42c35",
      "author": "HarkSaidHarold",
      "body": "It's nowhere near low key.",
      "created_utc": 1742628769.0,
      "score": 6,
      "context": [
        {
          "id": "mj1wzl2",
          "author": "homeslicy",
          "body": "yeah this ain’t it. get off your high horse, please.",
          "created_utc": 1742595667.0
        },
        {
          "id": "mj1zmih",
          "author": "Queenofwands1212",
          "body": "Ew. wtf lmao. High horse? For having a severe mental illness and being low key jealous of people using Ozempic… high horse bullshit",
          "created_utc": 1742596552.0
        }
      ]
    },
    {
      "id": "mj3jl8a",
      "author": "MamaNicole25",
      "body": "nothing turns off your food noise… taking injections to lose weight does not stop the food noise…. The comparison to that would be “i wish we had injections that would make us gain weight to stop the food noise” 🤦‍♀️",
      "created_utc": 1742617723.0,
      "score": -3,
      "context": [
        {
          "id": "mj26p5v",
          "author": "VeniceBtich",
          "body": "Uuh I have had anorexia as a teen/early 20s that turned into binge eating disorder early to mid 20s, and I've been taking wegovy for 6 months and it has turned my life around. I don't feel the obsession to either binge eat or starve myself which was what I was in a constant cycle of the last few years. Plus I'm pretty sure it's stopped me from becoming an alcoholic. \n\nIt hasn't stopped the food noise completely, but it's about 80% more manageable. I've got back down to a healthy weight without starvation and obsession and self-hatred. Different EDs exist and you can suffer from multiple ones throughout the years.\n\nWhy can't you just be happy for the unwell people who are using it? I'm sure that many of them may also have EDs too.",
          "created_utc": 1742598892.0
        },
        {
          "id": "mj2h66j",
          "author": "Queenofwands1212",
          "body": "It’s not about “being happy” for them. That’s great they are using something that works. I’m just saying it would be cool to have something to help folks with Ed’s to lower the food noise. You know the experience of anorexia yourself, it sucks to be completely mentally ill around food",
          "created_utc": 1742602499.0
        }
      ]
    },
    {
      "id": "mj07c4w",
      "author": "Specialist_Cow_7092",
      "body": "It's ok it's probably a good thing that people don't relate. But it makes me miss the old ana communities. I know it hurt people but at least we had a place to be honest back then.",
      "created_utc": 1742577214.0,
      "score": 3,
      "context": [
        {
          "id": "mizamqs",
          "author": "Specialist_Cow_7092",
          "body": "That's how I feel with anorexia tho. Food and eating disgusts me. I don't ever think about food and I'm never hungry... I'm also incredibly jealous that the thing I use to convince myself that I'm better than others can now just be gotten with a pill legally. I worked hard to train my body to never be hungry...\n\n Ps. I'm obviously dealing with these emotions and I know how sick and wrong they are but just a perspective.",
          "created_utc": 1742567672.0
        },
        {
          "id": "mj05xjy",
          "author": "Downtown-Event-1326",
          "body": "I'm sorry you're being down voted for this honest post.",
          "created_utc": 1742576811.0
        }
      ]
    },
    {
      "id": "mizq11j",
      "author": "UnicornPoopCircus",
      "body": "Wow. I'm not trying to trick my coworkers into telling me their medical history. Sometimes they're just in a mood and start telling their \"secret.\" People have a very bad habit of giving me way more information about their lives than I want. People just feel overly comfortable talking to me.",
      "created_utc": 1742572210.0,
      "score": -13,
      "context": [
        {
          "id": "mizloq2",
          "author": "UnicornPoopCircus",
          "body": "I have so many coworkers who are on this. It's wildly triggering. The thing that really annoys me is none of them openly admit they're on it. You have to catch them when they're in the mood to share their little secret. Otherwise, they are pretending that they have just been exercising more or have cut out soda or some nonsense. \n\nI have one coworker who I guess has come to the end of the line as far as being able to continue with her prescription. She was having a meltdown about it in front of me. She was acting like a drug addict...I suppose because she kind of is.",
          "created_utc": 1742570938.0
        },
        {
          "id": "miznm99",
          "author": "Acrobatic-Aioli9768",
          "body": "“Catch them” ?? It’s your coworker, you don’t know them and they’re not obligated to share their medical history with you.",
          "created_utc": 1742571508.0
        }
      ]
    },
    {
      "id": "miz2k1c",
      "author": "ConfidentStrength999",
      "body": "Most people mean anorexia nervosa when they say anorexia, but anorexia is a medical term for lack of appetite while anorexia nervosa is the mental illness",
      "created_utc": 1742565170.0,
      "score": 66,
      "context": [
        {
          "id": "miyvpzp",
          "author": "ConfidentStrength999",
          "body": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ",
          "created_utc": 1742562854.0
        },
        {
          "id": "miyw7oz",
          "author": "Competitive-Target95",
          "body": "there is a difference between anorexia and anorexia nervosa.",
          "created_utc": 1742563024.0
        },
        {
          "id": "miz0z0l",
          "author": "MetalingusMikeII",
          "body": "What’s the difference?",
          "created_utc": 1742564649.0
        }
      ]
    },
    {
      "id": "mizhtn6",
      "author": "HonestToe2408",
      "body": "Big jump in logic you made there. I’m saying a weight loss drug that makes you lose tons of weight in a quick amount of time and is suddenly stopped can and does result in AN. The re-gain period is by far the most dangerous part of the drug when it comes to eating disorders. It doesn’t matter if you are already proven to abuse medications or not. You are correct it is not injecting AN into people but it is leading to bigger body image issues and fear of re-gain.",
      "created_utc": 1742569804.0,
      "score": -15,
      "context": [
        {
          "id": "miyvpzp",
          "author": "ConfidentStrength999",
          "body": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ",
          "created_utc": 1742562854.0
        },
        {
          "id": "miywhrv",
          "author": "HonestToe2408",
          "body": "But the experience of anorexia is wildly different for each person. It is 100% true that these drugs are leading to eating disorders. Especially when people are taken off the drug.",
          "created_utc": 1742563121.0
        },
        {
          "id": "mizdw56",
          "author": "definitelytheproblem",
          "body": "This is like saying eating a big meal will make you morbidly obese. A GLP-1 medication will not give you anorexia nervosa unless you are already predisposed to abusing medications and engaging in self-harm behaviors that would be common for folks with AN.",
          "created_utc": 1742568640.0
        }
      ]
    },
    {
      "id": "mj10ukc",
      "author": "Sporknut",
      "body": "Not what they said though",
      "created_utc": 1742585786.0,
      "score": -5,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        },
        {
          "id": "miyuid7",
          "author": "Sporknut",
          "body": "This is just not true. Many things can cause weight gain… medical conditions, genetics, meds. Being overweight does not mean you overeat",
          "created_utc": 1742562429.0
        },
        {
          "id": "miz09nh",
          "author": "Condemned2Be",
          "body": "But I don’t think they were trying to cover every nuance of weight fluctuation in their small comment. They were specifically talking about people who are seeing a doctor & then prescribed ozempic.\n\nAnd it is pretty safe to say those people do have some food issues, as that is usually why they are pursuing something as extremely uncomfortable as ozempic",
          "created_utc": 1742564415.0
        }
      ]
    },
    {
      "id": "miyux96",
      "author": "Acrobatic-Aioli9768",
      "body": "? They never said it was",
      "created_utc": 1742562574.0,
      "score": 14,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        },
        {
          "id": "miyuid7",
          "author": "Sporknut",
          "body": "This is just not true. Many things can cause weight gain… medical conditions, genetics, meds. Being overweight does not mean you overeat",
          "created_utc": 1742562429.0
        },
        {
          "id": "miyumpf",
          "author": "Sporknut",
          "body": "And you are a part of the problem with weight stigma. Being overweight is not a personal failing or a disorder",
          "created_utc": 1742562471.0
        }
      ]
    },
    {
      "id": "mj41v4w",
      "author": "HarkSaidHarold",
      "body": "This is why I mostly tapped out of the sub. Somehow the science of CICO plus eons of what anorexia nervosa actually is has been successfully drowned out by frequent allegations of \"fatphobia\" (which is a pretty stupid *and* ableist accusation considering that is literally part of the criteria for AN) plus people swearing up and down they are somehow ✨specifically✨ anorexic (it's never EDNOS/ OSFED) but yet do not end up losing weight over time. Nevermind rapidly.\n\nFor those claiming they somehow defy thermodynamics, please make sure the billions of factually starving people on this planet get to learn all about how you simply cannot lose weight. It would save lives. You'd also receive accolades, and it's clear you adore attention, so...",
      "created_utc": 1742628460.0,
      "score": 4,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        },
        {
          "id": "miyucl6",
          "author": "twentyfouram",
          "body": "u can be overweight and eat normally…..",
          "created_utc": 1742562372.0
        },
        {
          "id": "mj1govd",
          "author": "Christine7690",
          "body": "Define “normally”. It’s calories in vs. calories out.",
          "created_utc": 1742590475.0
        }
      ]
    },
    {
      "id": "mj4tupw",
      "author": "twentyfouram",
      "body": "same !! its straight up fatphobia, im disabled and bc of that my metabolism is fucked due to malnutrition bc of chronic IBS-D so my body gain weight super easily, when people sre presented by a different reality than theirs they begin to only validate their opinion. healthy overweight people exist and im the living proof. also what qualify someone overweight ??? im overweight by definition bc my bmi is high but that shit is innacurate, im overweight mainly bc i have muscles and do a lot of sport to compensate. every body is different and every situation exist theres no exact science behind it",
      "created_utc": 1742645650.0,
      "score": 1,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        },
        {
          "id": "miyucl6",
          "author": "twentyfouram",
          "body": "u can be overweight and eat normally…..",
          "created_utc": 1742562372.0
        },
        {
          "id": "mj103b0",
          "author": "Sporknut",
          "body": "Solidarity.. I’m getting down voted too. 💝\n\nThese people blaming and shaming overweight folks for things that are can be outside of their control. I guess the disordered anorexia  thoughts may make the idea that you can be healthy and overweight unbelieveable… you’d have to hold two ideas in your head at the same time.\n\npart of healing is realizing that it’s okay to be heavier. \n\nI gained weight as a result of taking meds, fucking over my metabolism for 15 years, and stopping overexercising finally. You guys would say that I am overweight and that I overeat—while my dietician is trying to get me to eat more cause I’m still restricting, skipping meals and fucking over my metabolism more, so when I do eat my body tries to store it.",
          "created_utc": 1742585561.0
        }
      ]
    },
    {
      "id": "mj3pn0e",
      "author": "runninginbubbles",
      "body": "Interestingly enough I know someone who was on duromine, and like ozempic she actually did claim the food noise was gone. She's a friend of mine and I do believe her. \n\nI think some medication can do that.",
      "created_utc": 1742620893.0,
      "score": 2,
      "context": [
        {
          "id": "mj26p5v",
          "author": "VeniceBtich",
          "body": "Uuh I have had anorexia as a teen/early 20s that turned into binge eating disorder early to mid 20s, and I've been taking wegovy for 6 months and it has turned my life around. I don't feel the obsession to either binge eat or starve myself which was what I was in a constant cycle of the last few years. Plus I'm pretty sure it's stopped me from becoming an alcoholic. \n\nIt hasn't stopped the food noise completely, but it's about 80% more manageable. I've got back down to a healthy weight without starvation and obsession and self-hatred. Different EDs exist and you can suffer from multiple ones throughout the years.\n\nWhy can't you just be happy for the unwell people who are using it? I'm sure that many of them may also have EDs too.",
          "created_utc": 1742598892.0
        },
        {
          "id": "mj2h66j",
          "author": "Queenofwands1212",
          "body": "It’s not about “being happy” for them. That’s great they are using something that works. I’m just saying it would be cool to have something to help folks with Ed’s to lower the food noise. You know the experience of anorexia yourself, it sucks to be completely mentally ill around food",
          "created_utc": 1742602499.0
        },
        {
          "id": "mj3jl8a",
          "author": "MamaNicole25",
          "body": "nothing turns off your food noise… taking injections to lose weight does not stop the food noise…. The comparison to that would be “i wish we had injections that would make us gain weight to stop the food noise” 🤦‍♀️",
          "created_utc": 1742617723.0
        }
      ]
    },
    {
      "id": "mj0d4so",
      "author": "phoebesjeebies",
      "body": "It's one of the ways you know it's a mental illness - it's not logical and it's sick. I appreciate you sharing your experience!! This is not uncommon at all. Anorexia (often, I'm not making a sweeping statement) is tied into perfectionism, extremely high standards, overachievement, severe pressure, etc. Feeling special, superior, all that stuff is part of the lies that the brain parasite that hijacked our brains tells us. That we are unique and above others. You're definitely not alone in that, and I'm sorry you're getting some shit for acknowledging this aspect that many others do experience also, even though it's not everyone.",
      "created_utc": 1742578809.0,
      "score": 8,
      "context": [
        {
          "id": "mizamqs",
          "author": "Specialist_Cow_7092",
          "body": "That's how I feel with anorexia tho. Food and eating disgusts me. I don't ever think about food and I'm never hungry... I'm also incredibly jealous that the thing I use to convince myself that I'm better than others can now just be gotten with a pill legally. I worked hard to train my body to never be hungry...\n\n Ps. I'm obviously dealing with these emotions and I know how sick and wrong they are but just a perspective.",
          "created_utc": 1742567672.0
        },
        {
          "id": "mj05xjy",
          "author": "Downtown-Event-1326",
          "body": "I'm sorry you're being down voted for this honest post.",
          "created_utc": 1742576811.0
        },
        {
          "id": "mj07c4w",
          "author": "Specialist_Cow_7092",
          "body": "It's ok it's probably a good thing that people don't relate. But it makes me miss the old ana communities. I know it hurt people but at least we had a place to be honest back then.",
          "created_utc": 1742577214.0
        }
      ]
    },
    {
      "id": "mj42wi5",
      "author": "HarkSaidHarold",
      "body": "Well which is it? \"You have to catch them\" or people \"give you way more information about their lives than you want\"?",
      "created_utc": 1742629141.0,
      "score": 2,
      "context": [
        {
          "id": "mizloq2",
          "author": "UnicornPoopCircus",
          "body": "I have so many coworkers who are on this. It's wildly triggering. The thing that really annoys me is none of them openly admit they're on it. You have to catch them when they're in the mood to share their little secret. Otherwise, they are pretending that they have just been exercising more or have cut out soda or some nonsense. \n\nI have one coworker who I guess has come to the end of the line as far as being able to continue with her prescription. She was having a meltdown about it in front of me. She was acting like a drug addict...I suppose because she kind of is.",
          "created_utc": 1742570938.0
        },
        {
          "id": "miznm99",
          "author": "Acrobatic-Aioli9768",
          "body": "“Catch them” ?? It’s your coworker, you don’t know them and they’re not obligated to share their medical history with you.",
          "created_utc": 1742571508.0
        },
        {
          "id": "mizq11j",
          "author": "UnicornPoopCircus",
          "body": "Wow. I'm not trying to trick my coworkers into telling me their medical history. Sometimes they're just in a mood and start telling their \"secret.\" People have a very bad habit of giving me way more information about their lives than I want. People just feel overly comfortable talking to me.",
          "created_utc": 1742572210.0
        }
      ]
    },
    {
      "id": "miz2qxf",
      "author": "MetalingusMikeII",
      "body": "Makes sense. I didn’t know the difference, thank you.",
      "created_utc": 1742565234.0,
      "score": 21,
      "context": [
        {
          "id": "miyvpzp",
          "author": "ConfidentStrength999",
          "body": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ",
          "created_utc": 1742562854.0
        },
        {
          "id": "miyw7oz",
          "author": "Competitive-Target95",
          "body": "there is a difference between anorexia and anorexia nervosa.",
          "created_utc": 1742563024.0
        },
        {
          "id": "miz0z0l",
          "author": "MetalingusMikeII",
          "body": "What’s the difference?",
          "created_utc": 1742564649.0
        },
        {
          "id": "miz2k1c",
          "author": "ConfidentStrength999",
          "body": "Most people mean anorexia nervosa when they say anorexia, but anorexia is a medical term for lack of appetite while anorexia nervosa is the mental illness",
          "created_utc": 1742565170.0
        }
      ]
    },
    {
      "id": "mj10n4b",
      "author": "Sporknut",
      "body": "They said being overweight was caused by mental illness and binge eating",
      "created_utc": 1742585725.0,
      "score": 3,
      "context": [
        {
          "id": "miytpxk",
          "author": "Acrobatic-Aioli9768",
          "body": "For someone to qualify for ozempic, they would need to be overweight. You don’t get to being overweight or obese by eating normally. Binge eating disorder is also a mental illness, the food noise they feel isn’t due to undereating, it’s due to using food as a comfort for emotions and eating when happy, sad, angry, bored, anything they eat.",
          "created_utc": 1742562148.0
        },
        {
          "id": "miyuid7",
          "author": "Sporknut",
          "body": "This is just not true. Many things can cause weight gain… medical conditions, genetics, meds. Being overweight does not mean you overeat",
          "created_utc": 1742562429.0
        },
        {
          "id": "miyumpf",
          "author": "Sporknut",
          "body": "And you are a part of the problem with weight stigma. Being overweight is not a personal failing or a disorder",
          "created_utc": 1742562471.0
        },
        {
          "id": "miyux96",
          "author": "Acrobatic-Aioli9768",
          "body": "? They never said it was",
          "created_utc": 1742562574.0
        }
      ]
    },
    {
      "id": "mj3tckp",
      "author": "Queenofwands1212",
      "body": "Right… there are thousands and thousands of claims that it turns off food noise and obsession. And overall makes people eat less. (Because of satiety sure,) but this is also doing work in the brain and it’s also being used for addictions. So I do truly think it can just zap away hunger and food focus",
      "created_utc": 1742623040.0,
      "score": 2,
      "context": [
        {
          "id": "mj26p5v",
          "author": "VeniceBtich",
          "body": "Uuh I have had anorexia as a teen/early 20s that turned into binge eating disorder early to mid 20s, and I've been taking wegovy for 6 months and it has turned my life around. I don't feel the obsession to either binge eat or starve myself which was what I was in a constant cycle of the last few years. Plus I'm pretty sure it's stopped me from becoming an alcoholic. \n\nIt hasn't stopped the food noise completely, but it's about 80% more manageable. I've got back down to a healthy weight without starvation and obsession and self-hatred. Different EDs exist and you can suffer from multiple ones throughout the years.\n\nWhy can't you just be happy for the unwell people who are using it? I'm sure that many of them may also have EDs too.",
          "created_utc": 1742598892.0
        },
        {
          "id": "mj2h66j",
          "author": "Queenofwands1212",
          "body": "It’s not about “being happy” for them. That’s great they are using something that works. I’m just saying it would be cool to have something to help folks with Ed’s to lower the food noise. You know the experience of anorexia yourself, it sucks to be completely mentally ill around food",
          "created_utc": 1742602499.0
        },
        {
          "id": "mj3jl8a",
          "author": "MamaNicole25",
          "body": "nothing turns off your food noise… taking injections to lose weight does not stop the food noise…. The comparison to that would be “i wish we had injections that would make us gain weight to stop the food noise” 🤦‍♀️",
          "created_utc": 1742617723.0
        },
        {
          "id": "mj3pn0e",
          "author": "runninginbubbles",
          "body": "Interestingly enough I know someone who was on duromine, and like ozempic she actually did claim the food noise was gone. She's a friend of mine and I do believe her. \n\nI think some medication can do that.",
          "created_utc": 1742620893.0
        }
      ]
    },
    {
      "id": "mj8s2r3",
      "author": "MamaNicole25",
      "body": "there are obviously exceptions to the rule but the general consensus is that food noise doesn’t and won’t just go away with a medication. and if it does, usually it’s only for a short period and then eventually your right back to where you started. There is no quick fix (and in a lot of cases no fix unfortunately) for mental illness, there are bandaids like medications but as soon as those are taken away, majority cases go downhill again.",
      "created_utc": 1742694066.0,
      "score": 1,
      "context": [
        {
          "id": "mj26p5v",
          "author": "VeniceBtich",
          "body": "Uuh I have had anorexia as a teen/early 20s that turned into binge eating disorder early to mid 20s, and I've been taking wegovy for 6 months and it has turned my life around. I don't feel the obsession to either binge eat or starve myself which was what I was in a constant cycle of the last few years. Plus I'm pretty sure it's stopped me from becoming an alcoholic. \n\nIt hasn't stopped the food noise completely, but it's about 80% more manageable. I've got back down to a healthy weight without starvation and obsession and self-hatred. Different EDs exist and you can suffer from multiple ones throughout the years.\n\nWhy can't you just be happy for the unwell people who are using it? I'm sure that many of them may also have EDs too.",
          "created_utc": 1742598892.0
        },
        {
          "id": "mj2h66j",
          "author": "Queenofwands1212",
          "body": "It’s not about “being happy” for them. That’s great they are using something that works. I’m just saying it would be cool to have something to help folks with Ed’s to lower the food noise. You know the experience of anorexia yourself, it sucks to be completely mentally ill around food",
          "created_utc": 1742602499.0
        },
        {
          "id": "mj3jl8a",
          "author": "MamaNicole25",
          "body": "nothing turns off your food noise… taking injections to lose weight does not stop the food noise…. The comparison to that would be “i wish we had injections that would make us gain weight to stop the food noise” 🤦‍♀️",
          "created_utc": 1742617723.0
        },
        {
          "id": "mj3pn0e",
          "author": "runninginbubbles",
          "body": "Interestingly enough I know someone who was on duromine, and like ozempic she actually did claim the food noise was gone. She's a friend of mine and I do believe her. \n\nI think some medication can do that.",
          "created_utc": 1742620893.0
        }
      ]
    },
    {
      "id": "mj674sb",
      "author": "UnicornPoopCircus",
      "body": "I'm not trying to trap them or trick them into telling me anything. You ever \"catch\" someone with their pants down? Yeah. That's what I'm talking about. I'm not trying to see them with their pants down. It just happens. 😂",
      "created_utc": 1742662874.0,
      "score": 0,
      "context": [
        {
          "id": "mizloq2",
          "author": "UnicornPoopCircus",
          "body": "I have so many coworkers who are on this. It's wildly triggering. The thing that really annoys me is none of them openly admit they're on it. You have to catch them when they're in the mood to share their little secret. Otherwise, they are pretending that they have just been exercising more or have cut out soda or some nonsense. \n\nI have one coworker who I guess has come to the end of the line as far as being able to continue with her prescription. She was having a meltdown about it in front of me. She was acting like a drug addict...I suppose because she kind of is.",
          "created_utc": 1742570938.0
        },
        {
          "id": "miznm99",
          "author": "Acrobatic-Aioli9768",
          "body": "“Catch them” ?? It’s your coworker, you don’t know them and they’re not obligated to share their medical history with you.",
          "created_utc": 1742571508.0
        },
        {
          "id": "mizq11j",
          "author": "UnicornPoopCircus",
          "body": "Wow. I'm not trying to trick my coworkers into telling me their medical history. Sometimes they're just in a mood and start telling their \"secret.\" People have a very bad habit of giving me way more information about their lives than I want. People just feel overly comfortable talking to me.",
          "created_utc": 1742572210.0
        },
        {
          "id": "mj42wi5",
          "author": "HarkSaidHarold",
          "body": "Well which is it? \"You have to catch them\" or people \"give you way more information about their lives than you want\"?",
          "created_utc": 1742629141.0
        }
      ]
    },
    {
      "id": "mj4nz25",
      "author": "definitelytheproblem",
      "body": "There is something that helps with food noise. It’s called therapy. It can also help with a lot of other shit too.",
      "created_utc": 1742642696.0,
      "score": 0,
      "context": [
        {
          "id": "mj26p5v",
          "author": "VeniceBtich",
          "body": "Uuh I have had anorexia as a teen/early 20s that turned into binge eating disorder early to mid 20s, and I've been taking wegovy for 6 months and it has turned my life around. I don't feel the obsession to either binge eat or starve myself which was what I was in a constant cycle of the last few years. Plus I'm pretty sure it's stopped me from becoming an alcoholic. \n\nIt hasn't stopped the food noise completely, but it's about 80% more manageable. I've got back down to a healthy weight without starvation and obsession and self-hatred. Different EDs exist and you can suffer from multiple ones throughout the years.\n\nWhy can't you just be happy for the unwell people who are using it? I'm sure that many of them may also have EDs too.",
          "created_utc": 1742598892.0
        },
        {
          "id": "mj2h66j",
          "author": "Queenofwands1212",
          "body": "It’s not about “being happy” for them. That’s great they are using something that works. I’m just saying it would be cool to have something to help folks with Ed’s to lower the food noise. You know the experience of anorexia yourself, it sucks to be completely mentally ill around food",
          "created_utc": 1742602499.0
        },
        {
          "id": "mj3jl8a",
          "author": "MamaNicole25",
          "body": "nothing turns off your food noise… taking injections to lose weight does not stop the food noise…. The comparison to that would be “i wish we had injections that would make us gain weight to stop the food noise” 🤦‍♀️",
          "created_utc": 1742617723.0
        },
        {
          "id": "mj3pn0e",
          "author": "runninginbubbles",
          "body": "Interestingly enough I know someone who was on duromine, and like ozempic she actually did claim the food noise was gone. She's a friend of mine and I do believe her. \n\nI think some medication can do that.",
          "created_utc": 1742620893.0
        },
        {
          "id": "mj3tckp",
          "author": "Queenofwands1212",
          "body": "Right… there are thousands and thousands of claims that it turns off food noise and obsession. And overall makes people eat less. (Because of satiety sure,) but this is also doing work in the brain and it’s also being used for addictions. So I do truly think it can just zap away hunger and food focus",
          "created_utc": 1742623040.0
        }
      ]
    },
    {
      "id": "mj9adtb",
      "author": "runninginbubbles",
      "body": "Yes but the bandaid is sometimes enough for things to heal a bit, or at least for new habits to form. I do believe people who say their food noise disappears with a medication. Just like hallucinations disappears with antipsychotics. Yup, when they stop the medication the food noise may come back, but if the initial weight loss or reduction in binge eating has at least kick started better habits it might help. What's worse, going uphill then downhill again or just staying on the downhill? Isn't it worth a shot?",
      "created_utc": 1742701487.0,
      "score": 3,
      "context": [
        {
          "id": "mj26p5v",
          "author": "VeniceBtich",
          "body": "Uuh I have had anorexia as a teen/early 20s that turned into binge eating disorder early to mid 20s, and I've been taking wegovy for 6 months and it has turned my life around. I don't feel the obsession to either binge eat or starve myself which was what I was in a constant cycle of the last few years. Plus I'm pretty sure it's stopped me from becoming an alcoholic. \n\nIt hasn't stopped the food noise completely, but it's about 80% more manageable. I've got back down to a healthy weight without starvation and obsession and self-hatred. Different EDs exist and you can suffer from multiple ones throughout the years.\n\nWhy can't you just be happy for the unwell people who are using it? I'm sure that many of them may also have EDs too.",
          "created_utc": 1742598892.0
        },
        {
          "id": "mj2h66j",
          "author": "Queenofwands1212",
          "body": "It’s not about “being happy” for them. That’s great they are using something that works. I’m just saying it would be cool to have something to help folks with Ed’s to lower the food noise. You know the experience of anorexia yourself, it sucks to be completely mentally ill around food",
          "created_utc": 1742602499.0
        },
        {
          "id": "mj3jl8a",
          "author": "MamaNicole25",
          "body": "nothing turns off your food noise… taking injections to lose weight does not stop the food noise…. The comparison to that would be “i wish we had injections that would make us gain weight to stop the food noise” 🤦‍♀️",
          "created_utc": 1742617723.0
        },
        {
          "id": "mj3pn0e",
          "author": "runninginbubbles",
          "body": "Interestingly enough I know someone who was on duromine, and like ozempic she actually did claim the food noise was gone. She's a friend of mine and I do believe her. \n\nI think some medication can do that.",
          "created_utc": 1742620893.0
        },
        {
          "id": "mj8s2r3",
          "author": "MamaNicole25",
          "body": "there are obviously exceptions to the rule but the general consensus is that food noise doesn’t and won’t just go away with a medication. and if it does, usually it’s only for a short period and then eventually your right back to where you started. There is no quick fix (and in a lot of cases no fix unfortunately) for mental illness, there are bandaids like medications but as soon as those are taken away, majority cases go downhill again.",
          "created_utc": 1742694066.0
        }
      ]
    },
    {
      "id": "mj7ejht",
      "author": "Queenofwands1212",
      "body": "I can confirm that therapy doesn’t help with food noise but okay. Haha. To each their own",
      "created_utc": 1742676649.0,
      "score": 2,
      "context": [
        {
          "id": "mj26p5v",
          "author": "VeniceBtich",
          "body": "Uuh I have had anorexia as a teen/early 20s that turned into binge eating disorder early to mid 20s, and I've been taking wegovy for 6 months and it has turned my life around. I don't feel the obsession to either binge eat or starve myself which was what I was in a constant cycle of the last few years. Plus I'm pretty sure it's stopped me from becoming an alcoholic. \n\nIt hasn't stopped the food noise completely, but it's about 80% more manageable. I've got back down to a healthy weight without starvation and obsession and self-hatred. Different EDs exist and you can suffer from multiple ones throughout the years.\n\nWhy can't you just be happy for the unwell people who are using it? I'm sure that many of them may also have EDs too.",
          "created_utc": 1742598892.0
        },
        {
          "id": "mj2h66j",
          "author": "Queenofwands1212",
          "body": "It’s not about “being happy” for them. That’s great they are using something that works. I’m just saying it would be cool to have something to help folks with Ed’s to lower the food noise. You know the experience of anorexia yourself, it sucks to be completely mentally ill around food",
          "created_utc": 1742602499.0
        },
        {
          "id": "mj3jl8a",
          "author": "MamaNicole25",
          "body": "nothing turns off your food noise… taking injections to lose weight does not stop the food noise…. The comparison to that would be “i wish we had injections that would make us gain weight to stop the food noise” 🤦‍♀️",
          "created_utc": 1742617723.0
        },
        {
          "id": "mj3pn0e",
          "author": "runninginbubbles",
          "body": "Interestingly enough I know someone who was on duromine, and like ozempic she actually did claim the food noise was gone. She's a friend of mine and I do believe her. \n\nI think some medication can do that.",
          "created_utc": 1742620893.0
        },
        {
          "id": "mj3tckp",
          "author": "Queenofwands1212",
          "body": "Right… there are thousands and thousands of claims that it turns off food noise and obsession. And overall makes people eat less. (Because of satiety sure,) but this is also doing work in the brain and it’s also being used for addictions. So I do truly think it can just zap away hunger and food focus",
          "created_utc": 1742623040.0
        },
        {
          "id": "mj4nz25",
          "author": "definitelytheproblem",
          "body": "There is something that helps with food noise. It’s called therapy. It can also help with a lot of other shit too.",
          "created_utc": 1742642696.0
        }
      ]
    },
    {
      "id": "mjcr8ue",
      "author": "BallSufficient5671",
      "body": "What meds turn down the food obsession?",
      "created_utc": 1742756150.0,
      "score": 1,
      "context": [
        {
          "id": "mj26p5v",
          "author": "VeniceBtich",
          "body": "Uuh I have had anorexia as a teen/early 20s that turned into binge eating disorder early to mid 20s, and I've been taking wegovy for 6 months and it has turned my life around. I don't feel the obsession to either binge eat or starve myself which was what I was in a constant cycle of the last few years. Plus I'm pretty sure it's stopped me from becoming an alcoholic. \n\nIt hasn't stopped the food noise completely, but it's about 80% more manageable. I've got back down to a healthy weight without starvation and obsession and self-hatred. Different EDs exist and you can suffer from multiple ones throughout the years.\n\nWhy can't you just be happy for the unwell people who are using it? I'm sure that many of them may also have EDs too.",
          "created_utc": 1742598892.0
        },
        {
          "id": "mj2h66j",
          "author": "Queenofwands1212",
          "body": "It’s not about “being happy” for them. That’s great they are using something that works. I’m just saying it would be cool to have something to help folks with Ed’s to lower the food noise. You know the experience of anorexia yourself, it sucks to be completely mentally ill around food",
          "created_utc": 1742602499.0
        },
        {
          "id": "mj3jl8a",
          "author": "MamaNicole25",
          "body": "nothing turns off your food noise… taking injections to lose weight does not stop the food noise…. The comparison to that would be “i wish we had injections that would make us gain weight to stop the food noise” 🤦‍♀️",
          "created_utc": 1742617723.0
        },
        {
          "id": "mj3pn0e",
          "author": "runninginbubbles",
          "body": "Interestingly enough I know someone who was on duromine, and like ozempic she actually did claim the food noise was gone. She's a friend of mine and I do believe her. \n\nI think some medication can do that.",
          "created_utc": 1742620893.0
        },
        {
          "id": "mj8s2r3",
          "author": "MamaNicole25",
          "body": "there are obviously exceptions to the rule but the general consensus is that food noise doesn’t and won’t just go away with a medication. and if it does, usually it’s only for a short period and then eventually your right back to where you started. There is no quick fix (and in a lot of cases no fix unfortunately) for mental illness, there are bandaids like medications but as soon as those are taken away, majority cases go downhill again.",
          "created_utc": 1742694066.0
        },
        {
          "id": "mj9adtb",
          "author": "runninginbubbles",
          "body": "Yes but the bandaid is sometimes enough for things to heal a bit, or at least for new habits to form. I do believe people who say their food noise disappears with a medication. Just like hallucinations disappears with antipsychotics. Yup, when they stop the medication the food noise may come back, but if the initial weight loss or reduction in binge eating has at least kick started better habits it might help. What's worse, going uphill then downhill again or just staying on the downhill? Isn't it worth a shot?",
          "created_utc": 1742701487.0
        }
      ]
    },
    {
      "id": "mjf71k0",
      "author": "runninginbubbles",
      "body": "This whole post is about Ozempic .. 🤦‍♀️",
      "created_utc": 1742785945.0,
      "score": 1,
      "context": [
        {
          "id": "mj26p5v",
          "author": "VeniceBtich",
          "body": "Uuh I have had anorexia as a teen/early 20s that turned into binge eating disorder early to mid 20s, and I've been taking wegovy for 6 months and it has turned my life around. I don't feel the obsession to either binge eat or starve myself which was what I was in a constant cycle of the last few years. Plus I'm pretty sure it's stopped me from becoming an alcoholic. \n\nIt hasn't stopped the food noise completely, but it's about 80% more manageable. I've got back down to a healthy weight without starvation and obsession and self-hatred. Different EDs exist and you can suffer from multiple ones throughout the years.\n\nWhy can't you just be happy for the unwell people who are using it? I'm sure that many of them may also have EDs too.",
          "created_utc": 1742598892.0
        },
        {
          "id": "mj2h66j",
          "author": "Queenofwands1212",
          "body": "It’s not about “being happy” for them. That’s great they are using something that works. I’m just saying it would be cool to have something to help folks with Ed’s to lower the food noise. You know the experience of anorexia yourself, it sucks to be completely mentally ill around food",
          "created_utc": 1742602499.0
        },
        {
          "id": "mj3jl8a",
          "author": "MamaNicole25",
          "body": "nothing turns off your food noise… taking injections to lose weight does not stop the food noise…. The comparison to that would be “i wish we had injections that would make us gain weight to stop the food noise” 🤦‍♀️",
          "created_utc": 1742617723.0
        },
        {
          "id": "mj3pn0e",
          "author": "runninginbubbles",
          "body": "Interestingly enough I know someone who was on duromine, and like ozempic she actually did claim the food noise was gone. She's a friend of mine and I do believe her. \n\nI think some medication can do that.",
          "created_utc": 1742620893.0
        },
        {
          "id": "mj8s2r3",
          "author": "MamaNicole25",
          "body": "there are obviously exceptions to the rule but the general consensus is that food noise doesn’t and won’t just go away with a medication. and if it does, usually it’s only for a short period and then eventually your right back to where you started. There is no quick fix (and in a lot of cases no fix unfortunately) for mental illness, there are bandaids like medications but as soon as those are taken away, majority cases go downhill again.",
          "created_utc": 1742694066.0
        },
        {
          "id": "mj9adtb",
          "author": "runninginbubbles",
          "body": "Yes but the bandaid is sometimes enough for things to heal a bit, or at least for new habits to form. I do believe people who say their food noise disappears with a medication. Just like hallucinations disappears with antipsychotics. Yup, when they stop the medication the food noise may come back, but if the initial weight loss or reduction in binge eating has at least kick started better habits it might help. What's worse, going uphill then downhill again or just staying on the downhill? Isn't it worth a shot?",
          "created_utc": 1742701487.0
        },
        {
          "id": "mjcr8ue",
          "author": "BallSufficient5671",
          "body": "What meds turn down the food obsession?",
          "created_utc": 1742756150.0
        }
      ]
    }
  ]
}