{
  "id": "1jijrn3",
  "subreddit": "AnorexiaNervosa",
  "author": "Ashamed_Ad8162",
  "created_utc": 1742794968.0,
  "title": "Do you consider yourself to have high functioning anorexia?",
  "selftext": "People with high functioning anorexia are high achievers— active members of their community, with careers, families, and relationships— even though they actively engage in their eating disorder.\n\nI definitely resonate with this, and wanted to discuss this with y’all. A lot of people I’ve met in treatment talk about the opposite experience, falling apart and being completely non functional. But, I still feel like I’m doing so well. \n\nI know part of it is that I’ve learned to live with the negatives (ie health complications), but I still live a full life with Anorexia. \n\nSo… what do you think of this label? Do you fit into this category? Do you think it is a harmful idea? ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1jijrn3/do_you_consider_yourself_to_have_high_functioning/",
  "score": 206,
  "num_comments": 61,
  "comments": [
    {
      "id": "mjfp8vg",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1742794968.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjfv8nk",
      "author": "Klutzy_Hunter_354",
      "body": "No i have low functioning existence not even from my anorexia just from being a loser",
      "created_utc": 1742798715.0,
      "score": 129,
      "context": []
    },
    {
      "id": "mjga83g",
      "author": "SalesLurker",
      "body": "Yes it's a harmful idea--\n\nFunctional drug addicts and Functional alcoholics believe this too. \n\nPeople who commit constant infidelity believe this too (im a better spouse/parent when I cheat... everyone's happier)\n\nAnd you're doing so well--for now. A \"full life\"\n\n but statistically speaking that is likely to fall apart, it's easy for things to spiral out of control, it's likely to make your full life shorter, and how can it really be full if you have to dedicate significant time if your processing to abide by anorexias rules and behaviors?\n\nPart of the disease is the coping, and the excuse making. \n\nBecause there is no reality that you are better doing this to your body than you could be if you're able to ever reach fully recovered",
      "created_utc": 1742808858.0,
      "score": 57,
      "context": []
    },
    {
      "id": "mjg99p4",
      "author": "Queenofwands1212",
      "body": "I feel like having anorexia as an adult, you don’t really have a choice but to be high functioning. I’m single, no relationship, no kids, no family around or  room mates (thank god cuz I hate living with people). But no one is going to help me, I had to move apartments all by myself. No one could help. It was fucking stupid. I keep injuring myself because my body is so malnourished and weak but no one is around to help. But I have no choice but to work, grocery shop, clean, laundry, errands, appointments. It sucks",
      "created_utc": 1742808229.0,
      "score": 50,
      "context": []
    },
    {
      "id": "mjg7tcl",
      "author": "LightHurtsOuch",
      "body": "I wouldn’t consider myself high-functioning, but one thing that anorexia made me excel at is low impact physical tasks. Cleaning my room, vacuuming the house, running errands, cooking, etc etc. Also literally anything that involves maths and counting. Give me an energy drink and I could do these for hours, but when I have to process words, memorize phrases, focus on a movie plot, actively engage in a conversation, I fall apart.",
      "created_utc": 1742807259.0,
      "score": 27,
      "context": []
    },
    {
      "id": "mjfwvvg",
      "author": "Rare_Example",
      "body": "I relate to this. I go to university, where half of people drop out because the courses are objectively hard both theoretically and physically. After 10 years of having anorexia, I’ve learned how to seem high functioning, when in reality I’m spending all my energy on thinking about food and planning meals. Because people perceive me as high functioning, I often struggle with believing that I actually have an illness, even though my entire life revolves around food and my body is barely holding on.",
      "created_utc": 1742799785.0,
      "score": 69,
      "context": []
    },
    {
      "id": "mjg0awd",
      "author": "monsterzerog1rl",
      "body": "No, but I am more functioning than I used to. I used to only bedrot, do steps around my room, and not even go outside. Now I help an elderly family member, have a part-time job, am more present in my relationship, and am a semi active part of my community. I still highly struggle mentally, obsessively exercise, count every calorie, and I have days when I can't get out of bed because my body image is so bad. But those days are rarer.",
      "created_utc": 1742802104.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mjhfday",
      "author": "None",
      "body": "I was high functioning until suddenly I wasn't; my mind and body gave up overnight and I declined very rapidly. I went from doing a STEM course at a prestigious uni to living at home, lying in bed all day and looking at inpatient care options",
      "created_utc": 1742826811.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mjfqc30",
      "author": "Sh_7422",
      "body": "Not completely. My grades are amazing but my relationships are suffering.",
      "created_utc": 1742795623.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mjftsjb",
      "author": "Excellent-World-476",
      "body": "Not fully. I have a job now but I don’t have a romantic relationship, I still prioritize my behaviours over going out with others and I end up in hospital for short stays so to unstable electrolytes. I do not have true freedom. My eating disorder still has me semi-caged",
      "created_utc": 1742797784.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mjhfg1r",
      "author": "Decent_Carpenter8261",
      "body": "I noticed I was relapsing back in August 2024 but because I was working and doing well with college I considered myself as high functioning and now 6 months later I can’t work, I’ve fallen behind in college and may need to drop out and I have been living in my head for 2 months now. There’s no such thing as a high functioning Ed. You’ll only be able to keep it up for so long.",
      "created_utc": 1742826836.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mjhgfjb",
      "author": "FungiFro",
      "body": "I’m high functional because I have to be, don’t get me wrong though, I crumble down every night. My job involves me to be highly functional and I am an active member of my church as well. I want to fall apart badly, but I have to keep it together for those around me.",
      "created_utc": 1742827149.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mjgy2in",
      "author": "Solal-King-Raccoon",
      "body": "Yeah that sounds like me. I’m studying like crazy, last year of high school, I’m pretty successful academically, I hang out with friends and etc. However the lower my weight is the harder it becomes.",
      "created_utc": 1742820895.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mjj921i",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1742846027.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mjfvbf1",
      "author": "bluebelle08",
      "body": "Yes. I make a good salary as a software engineer in the Bay Area fresh out of uni and excelled academically in both college and high school. I’m really not trying to overstate things but it made me wonder how much “recovery” would change anything other than hating my “healthy” body.\n\nI’m focusing on harm reduction instead and I think it’s working pretty well :) I’m not skeletal anymore but considered conventionally thin and that’s ok for me right now. Still have to fight urges though, and not always successfully :(\n\nMy psychiatrist in the children’s IP actually suggested “functional anorexia” after many months and I’d like to think she would be happy-ish with me today.",
      "created_utc": 1742798764.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mjhkfcn",
      "author": "Longjumping_Tap_9679",
      "body": "i would consider myself one since i work at a bakery with 10 hours shifts starting at 4 am and idk how i do it, on top of hanging out with my bf or bestie almost all the time on my off days, and i sell on depop and make music. im waiting for the day it all catches up for me 😅",
      "created_utc": 1742828399.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjhypr1",
      "author": "likpinklady",
      "body": "Yep. I’m a government employee. Work 4 days a week. Take phentermine on days that I work just to get me through the day. \n\nOnly thing that I feel is really suffering is my relationship. My partner is permanently concerned about me, always wants to go out for meals and I just have to decline etc.\n\nAnd I struggle to shower because I just get so lightheaded and dizzy standing in the water.\n\nAside from that, everything is kinda.. fine.",
      "created_utc": 1742832671.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mjip2n7",
      "author": "NukeyNuke2311",
      "body": "im a figure skater, downhill skier, full time student, and have a part time job. most people just think im “naturally thin”",
      "created_utc": 1742840238.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjjv1od",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1742852447.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjfr7lm",
      "author": "Mariaellen99",
      "body": "100% agree with this. I have a job in management, a good relationship and had purchased a home in a new city at 23. I feel guilty for how “functional” I am",
      "created_utc": 1742796156.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mjjtula",
      "author": "NoResource9942",
      "body": "Yes I was…I’m in recovery. ❤️‍🩹 Type A, career, was married (divorced him), etc etc. I think being like that helped me recover. Because I wanted those things minus the ED so I could finally live my damn life for once.",
      "created_utc": 1742852069.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjk357d",
      "author": "cocorosewater",
      "body": "You’re functional until you’re not.",
      "created_utc": 1742854989.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjg2qar",
      "author": "skinny_minnie_kween",
      "body": "Yesss I would say so! I still manage to work full time, maintain my friendships and relationship with my fiancé and do extra activities outside of work. Honestly I don’t even think most people outside of my relationship and family know that I’m anorexic… they just see that I’ve lost weight.\n\n\nBut as someone with high functioning autism, I definitely think this label fits.",
      "created_utc": 1742803745.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjhvfcg",
      "author": "PlaugeNurse333",
      "body": "absolutely. i’m an EMT, and honestly i don’t know how i do it. i can go all day partying on weekends as well. i would say right now im not doing well but i still somehow manage.",
      "created_utc": 1742831688.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjk3h3p",
      "author": "-Tricky-Vixen-",
      "body": "Yeah, nobody would guess. I mean, as high functioning as i can be as a level two autistic person without support lol",
      "created_utc": 1742855094.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjk5uew",
      "author": "ccbabs97",
      "body": "That sounds like me. High achiever, popular, with a good career….\n\nIt’s rough",
      "created_utc": 1742855858.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjk8ien",
      "author": "Punk_Boi4737",
      "body": "yeah and tbh it makes me feel personally invalid",
      "created_utc": 1742856696.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjs6vla",
      "author": "CommonKey9457",
      "body": "For myself I just feel like I’m basically just existing. \nI go to work. Do all the right things, I’m also constantly picking at myself behind closed doors when my partner is asleep or in my own min..I know I’m not doing well and I’m honestly losing control internally but I look like I’m absolutely fine to everybody in my life, I can’t remember ever being at a healthy weight in my entire life so nobody knows me any different. \nYou could call that high functioning but to me it just feels like I’m plainly just existing.",
      "created_utc": 1742963041.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjxjm7e",
      "author": "_TakeYourMeds",
      "body": "Yup. Every medical professional who has ever interacted or worked with me has told me I’m “high functioning” when it comes to being able to get shit done long enough to not be sent inpatient. Doesn’t mean I’m not in hell in my head though",
      "created_utc": 1743035124.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjytv44",
      "author": "GoldenSilver7",
      "body": "i definitely am, i run a restaurant working 45+ hour weeks sometimes more, being stressed most of the time and being surrounded by food it’s triggering, then the at home life, i do not know how i do it but im so tired all the time",
      "created_utc": 1743053925.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mk4dqm5",
      "author": "01010011x",
      "body": "I excel at “functioning” and apparently am great at giving people the impression I am high functioning. But I am so far below where I could be if I didn’t spend 60% of my physical and mental energy on having an ED, and I feel like it’s all a facade I have somehow manipulated or tricked people into believing. Or people just need to get higher standards…",
      "created_utc": 1743129573.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mkfmbzt",
      "author": "JizzEater_69",
      "body": "This was me before I got bad, I was a binge eater until I had anorexia and all of a sudden I was the \"healthiest\" I had ever been. Becoming popular and being an active member of my community, and then I was hospitalized",
      "created_utc": 1743290050.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjm67pf",
      "author": "CateoftheWoods",
      "body": "Unfortunately I really relate. I thrive in anorexia. People always tell me I look 15 - 20 yrs younger, I'm actually more energized, balanced and focused. And for a comparison I've been in recovery for 3 yrs now and my entire life & mental health has fallen apart. like you wouldn't believe how much so if I swore on a stack of classic 90s vogue magazines. \n\nI actually made a decision to willingly go back. And my energy & mood are improving, I'm functioning better. \n\nThere was a really interesting researcher I learned about prob 20 yrs ago who had a theory that roughly 5% of the population thrives in states of starvation or near starvation. It highly benefited the hunter gatherer period homosapiens so theres literally 100,000s of generational reinforcement. Plus a good chance the species could have died off without this population so it became really embedded in genome. I wish I could remember the name or their published studies but sure googling some of that would help. \n\nAnd when I say I've been in recovery for 3 years, Im 6'1, eat maybe 1200-1500 calories daily, eat really clean & intuitively, my fav part is I got wicked into foraging as a hobby, and I gained stupid amounts of weight, I was obese. And when literally eating 3/4 times a week, a total of 1200 calories, I look like a beach volleyball player and barely have to exercise to stay in great shape.",
      "created_utc": 1742884908.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjgrum9",
      "author": "mermaidhair0112",
      "body": "yes unfortunately and i restrict and binge no purging. mine is ocd related",
      "created_utc": 1742818327.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjil0el",
      "author": "Zimsgirlfriend",
      "body": "No I can't work a job and I struggle with doing daily tasks,my eating disorder consumes most of my day between having to eat at certain times to compulsive exercise rituals. Idk how I managed to even graduate school but I did somehow. I really hope one day I can actually live a life with happiness and freedom as I'm in recovery rn. ⭐",
      "created_utc": 1742839067.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjpdkdo",
      "author": "HerrRotZwiebel",
      "body": "Hm. For me the distinction is that when I'm at my worst, I *can't* function. I can't focus on work, and I just want to sit and veg all day.",
      "created_utc": 1742929438.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjpz01v",
      "author": "Wondering_Weasel",
      "body": "Used to be this. Thought I was the exception. It does NOT last… osteoporosis and GI issues rule my life now 🫠",
      "created_utc": 1742935673.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjrmqkb",
      "author": "Ok_Palpitation_1725",
      "body": "i would consider myself \"high functioning\", except my social life has suffered so much because all my friends wanna do is eat. but college, chores, exercise, groceries, everything else gets done. although i frequently have to force myself to complete tasks",
      "created_utc": 1742954907.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjyixcj",
      "author": "Primary-Counter2903",
      "body": "I’m the same way. I go days without eating and push by without trouble,",
      "created_utc": 1743048282.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjfz6n6",
      "author": "pessimistic_witch",
      "body": "I tend to do better in school, life, and feel better physically when I’m extremely sick which is why I always feel so confused when people say I need to be in the hospital or that I’m medically unstable cause I feel better overall than I do at a normal weight",
      "created_utc": 1742801340.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjoyb1v",
      "author": "liaxoxoana",
      "body": "I’ve been the opposite on my first weight loss journey, lost 50 kg in 8 months (110 lbs) and I was STARVING I was not able to function at all, then I had some recovery attempts, relapsed, tried to recover etc., know I’m a pediatric nursing student in my second year (40h/week), work as a medical student assistant (20h/week), am into a relationship, do crafts, love fashion, still eating disorderd, I actually really do love my life, I’m not suuuuuper into ed behaviours e.g. I don’t count calories atm but I lead an ana group, still am eating disorderd, go on diets, work out, have disorderd thinking etc., I like the idea of calling it high functioning anorexia",
      "created_utc": 1742924982.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjmi3ab",
      "author": "Sensasie",
      "body": "Dividing people with high and low functioning labels is stigmatising and dismissive",
      "created_utc": 1742892892.0,
      "score": -3,
      "context": []
    },
    {
      "id": "mjgba9v",
      "author": "Susannuts123",
      "body": "This is so me 🥹",
      "created_utc": 1742809538.0,
      "score": 9,
      "context": [
        {
          "id": "mjfv8nk",
          "author": "Klutzy_Hunter_354",
          "body": "No i have low functioning existence not even from my anorexia just from being a loser",
          "created_utc": 1742798715.0
        }
      ]
    },
    {
      "id": "mjh4wc3",
      "author": "Suga4mcr",
      "body": "Real",
      "created_utc": 1742823408.0,
      "score": 5,
      "context": [
        {
          "id": "mjfv8nk",
          "author": "Klutzy_Hunter_354",
          "body": "No i have low functioning existence not even from my anorexia just from being a loser",
          "created_utc": 1742798715.0
        }
      ]
    },
    {
      "id": "mjhkcfj",
      "author": "coolest_capybara",
      "body": "Mood",
      "created_utc": 1742828374.0,
      "score": 4,
      "context": [
        {
          "id": "mjfv8nk",
          "author": "Klutzy_Hunter_354",
          "body": "No i have low functioning existence not even from my anorexia just from being a loser",
          "created_utc": 1742798715.0
        }
      ]
    },
    {
      "id": "mjl4nd3",
      "author": "wafflefries1124",
      "body": "Me too! 🥺 I don’t know how people function with mental health conditions but they do! Doesn’t make it any less easier but they “seem” productive! I can’t even get out of bed! Not saying one is worse over the other! Both situations are still just as valid!",
      "created_utc": 1742867345.0,
      "score": 3,
      "context": [
        {
          "id": "mjfv8nk",
          "author": "Klutzy_Hunter_354",
          "body": "No i have low functioning existence not even from my anorexia just from being a loser",
          "created_utc": 1742798715.0
        }
      ]
    },
    {
      "id": "mk99sid",
      "author": "None",
      "body": "Lmaoooo real",
      "created_utc": 1743198084.0,
      "score": 1,
      "context": [
        {
          "id": "mjfv8nk",
          "author": "Klutzy_Hunter_354",
          "body": "No i have low functioning existence not even from my anorexia just from being a loser",
          "created_utc": 1742798715.0
        }
      ]
    },
    {
      "id": "mjmxsvp",
      "author": "Madi222328",
      "body": "Me.",
      "created_utc": 1742902046.0,
      "score": 3,
      "context": [
        {
          "id": "mjg7tcl",
          "author": "LightHurtsOuch",
          "body": "I wouldn’t consider myself high-functioning, but one thing that anorexia made me excel at is low impact physical tasks. Cleaning my room, vacuuming the house, running errands, cooking, etc etc. Also literally anything that involves maths and counting. Give me an energy drink and I could do these for hours, but when I have to process words, memorize phrases, focus on a movie plot, actively engage in a conversation, I fall apart.",
          "created_utc": 1742807259.0
        }
      ]
    },
    {
      "id": "mjfz7o3",
      "author": "Skythebluestars",
      "body": "Thiss! Exactly . Ive lost so mamy friends over the years. Because i wasnt functioning at all. And when you appear high functioning this doesnt seem to happen. \n\nBut it feels like a mask that its about to drop. Its exhausting.",
      "created_utc": 1742801360.0,
      "score": 15,
      "context": [
        {
          "id": "mjfwvvg",
          "author": "Rare_Example",
          "body": "I relate to this. I go to university, where half of people drop out because the courses are objectively hard both theoretically and physically. After 10 years of having anorexia, I’ve learned how to seem high functioning, when in reality I’m spending all my energy on thinking about food and planning meals. Because people perceive me as high functioning, I often struggle with believing that I actually have an illness, even though my entire life revolves around food and my body is barely holding on.",
          "created_utc": 1742799785.0
        }
      ]
    },
    {
      "id": "mjvruh8",
      "author": "MizzPizz",
      "body": "This answer. ‘Seem’ high functioning is the truth.",
      "created_utc": 1743015875.0,
      "score": 3,
      "context": [
        {
          "id": "mjfwvvg",
          "author": "Rare_Example",
          "body": "I relate to this. I go to university, where half of people drop out because the courses are objectively hard both theoretically and physically. After 10 years of having anorexia, I’ve learned how to seem high functioning, when in reality I’m spending all my energy on thinking about food and planning meals. Because people perceive me as high functioning, I often struggle with believing that I actually have an illness, even though my entire life revolves around food and my body is barely holding on.",
          "created_utc": 1742799785.0
        }
      ]
    },
    {
      "id": "mjk4aw5",
      "author": "-Tricky-Vixen-",
      "body": "are you me... :')",
      "created_utc": 1742855358.0,
      "score": 3,
      "context": [
        {
          "id": "mjhfg1r",
          "author": "Decent_Carpenter8261",
          "body": "I noticed I was relapsing back in August 2024 but because I was working and doing well with college I considered myself as high functioning and now 6 months later I can’t work, I’ve fallen behind in college and may need to drop out and I have been living in my head for 2 months now. There’s no such thing as a high functioning Ed. You’ll only be able to keep it up for so long.",
          "created_utc": 1742826836.0
        }
      ]
    },
    {
      "id": "mjsh88r",
      "author": "Round-Wasabi-7111",
      "body": "This resonated so much with me, thank you.  This is me exactly and never knew someone out there is experiencing the same thing.",
      "created_utc": 1742968670.0,
      "score": 2,
      "context": [
        {
          "id": "mjj921i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1742846027.0
        }
      ]
    },
    {
      "id": "mjfwqig",
      "author": "Equivalent-Lie5822",
      "body": "I’m so glad to finally hear someone say that because I feel the same way. Ideally, I’d love to be free from this and not live my life this way. But what does recovery really give me? “Freedom” with insecurity the rest of my life? Living in emotional hell and hating my body? I absolutely see no benefit to recovery. None.",
      "created_utc": 1742799687.0,
      "score": 9,
      "context": [
        {
          "id": "mjfvbf1",
          "author": "bluebelle08",
          "body": "Yes. I make a good salary as a software engineer in the Bay Area fresh out of uni and excelled academically in both college and high school. I’m really not trying to overstate things but it made me wonder how much “recovery” would change anything other than hating my “healthy” body.\n\nI’m focusing on harm reduction instead and I think it’s working pretty well :) I’m not skeletal anymore but considered conventionally thin and that’s ok for me right now. Still have to fight urges though, and not always successfully :(\n\nMy psychiatrist in the children’s IP actually suggested “functional anorexia” after many months and I’d like to think she would be happy-ish with me today.",
          "created_utc": 1742798764.0
        }
      ]
    },
    {
      "id": "mjfzak8",
      "author": "pessimistic_witch",
      "body": "This is what I’m doing as well and it has worked the best for me, while I’m not recovered or healthy I’ve stayed out of treatment and the hospital for 2 years now which is the longest I’ve gone🥳",
      "created_utc": 1742801414.0,
      "score": 3,
      "context": [
        {
          "id": "mjfvbf1",
          "author": "bluebelle08",
          "body": "Yes. I make a good salary as a software engineer in the Bay Area fresh out of uni and excelled academically in both college and high school. I’m really not trying to overstate things but it made me wonder how much “recovery” would change anything other than hating my “healthy” body.\n\nI’m focusing on harm reduction instead and I think it’s working pretty well :) I’m not skeletal anymore but considered conventionally thin and that’s ok for me right now. Still have to fight urges though, and not always successfully :(\n\nMy psychiatrist in the children’s IP actually suggested “functional anorexia” after many months and I’d like to think she would be happy-ish with me today.",
          "created_utc": 1742798764.0
        }
      ]
    },
    {
      "id": "mk38h3s",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1743115862.0,
      "score": 1,
      "context": [
        {
          "id": "mjjv1od",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1742852447.0
        }
      ]
    },
    {
      "id": "mjk5lo3",
      "author": "Ashamed_Ad8162",
      "body": "I know this. I’ve been on the brink of dying a few times. But, I just feel like I forget, which is the nature of the disorder. I don’t know how I’ve stayed alive for 8 years of this though.",
      "created_utc": 1742855780.0,
      "score": 3,
      "context": [
        {
          "id": "mjk357d",
          "author": "cocorosewater",
          "body": "You’re functional until you’re not.",
          "created_utc": 1742854989.0
        }
      ]
    },
    {
      "id": "mjh8uqg",
      "author": "Ashamed_Ad8162",
      "body": "Definitely. It’s so confusing!",
      "created_utc": 1742824753.0,
      "score": 3,
      "context": [
        {
          "id": "mjfz6n6",
          "author": "pessimistic_witch",
          "body": "I tend to do better in school, life, and feel better physically when I’m extremely sick which is why I always feel so confused when people say I need to be in the hospital or that I’m medically unstable cause I feel better overall than I do at a normal weight",
          "created_utc": 1742801340.0
        }
      ]
    },
    {
      "id": "mk23jzb",
      "author": "Honest_Airport_8799",
      "body": "Life is short, don’t miss it and get better",
      "created_utc": 1743101083.0,
      "score": 1,
      "context": [
        {
          "id": "mjfv8nk",
          "author": "Klutzy_Hunter_354",
          "body": "No i have low functioning existence not even from my anorexia just from being a loser",
          "created_utc": 1742798715.0
        },
        {
          "id": "mjl4nd3",
          "author": "wafflefries1124",
          "body": "Me too! 🥺 I don’t know how people function with mental health conditions but they do! Doesn’t make it any less easier but they “seem” productive! I can’t even get out of bed! Not saying one is worse over the other! Both situations are still just as valid!",
          "created_utc": 1742867345.0
        }
      ]
    },
    {
      "id": "mjg5yyh",
      "author": "Rare_Example",
      "body": "Yeah, I can usually just maintain superficial friendships, because when people get to actually know me they realize that I am 90% anorexia and 10% real personality",
      "created_utc": 1742806003.0,
      "score": 12,
      "context": [
        {
          "id": "mjfwvvg",
          "author": "Rare_Example",
          "body": "I relate to this. I go to university, where half of people drop out because the courses are objectively hard both theoretically and physically. After 10 years of having anorexia, I’ve learned how to seem high functioning, when in reality I’m spending all my energy on thinking about food and planning meals. Because people perceive me as high functioning, I often struggle with believing that I actually have an illness, even though my entire life revolves around food and my body is barely holding on.",
          "created_utc": 1742799785.0
        },
        {
          "id": "mjfz7o3",
          "author": "Skythebluestars",
          "body": "Thiss! Exactly . Ive lost so mamy friends over the years. Because i wasnt functioning at all. And when you appear high functioning this doesnt seem to happen. \n\nBut it feels like a mask that its about to drop. Its exhausting.",
          "created_utc": 1742801360.0
        }
      ]
    },
    {
      "id": "mjg9pil",
      "author": "SalesLurker",
      "body": "Theres an inherent insecurity in engaging in aoteixa behavior, the emotional hell of constantly obsessing over every little thing. \n\n Eventually, physical.hell comes with anorexia as your body WILL shut down at some point and will likely be painful.  Relationships are likely to be lost and your life may otherwise not be as fulfilling.",
      "created_utc": 1742808520.0,
      "score": 5,
      "context": [
        {
          "id": "mjfvbf1",
          "author": "bluebelle08",
          "body": "Yes. I make a good salary as a software engineer in the Bay Area fresh out of uni and excelled academically in both college and high school. I’m really not trying to overstate things but it made me wonder how much “recovery” would change anything other than hating my “healthy” body.\n\nI’m focusing on harm reduction instead and I think it’s working pretty well :) I’m not skeletal anymore but considered conventionally thin and that’s ok for me right now. Still have to fight urges though, and not always successfully :(\n\nMy psychiatrist in the children’s IP actually suggested “functional anorexia” after many months and I’d like to think she would be happy-ish with me today.",
          "created_utc": 1742798764.0
        },
        {
          "id": "mjfwqig",
          "author": "Equivalent-Lie5822",
          "body": "I’m so glad to finally hear someone say that because I feel the same way. Ideally, I’d love to be free from this and not live my life this way. But what does recovery really give me? “Freedom” with insecurity the rest of my life? Living in emotional hell and hating my body? I absolutely see no benefit to recovery. None.",
          "created_utc": 1742799687.0
        }
      ]
    },
    {
      "id": "mjfy4vk",
      "author": "StrangeAir6637",
      "body": "damn, guess i’m relapsing now….",
      "created_utc": 1742800623.0,
      "score": 7,
      "context": [
        {
          "id": "mjfvbf1",
          "author": "bluebelle08",
          "body": "Yes. I make a good salary as a software engineer in the Bay Area fresh out of uni and excelled academically in both college and high school. I’m really not trying to overstate things but it made me wonder how much “recovery” would change anything other than hating my “healthy” body.\n\nI’m focusing on harm reduction instead and I think it’s working pretty well :) I’m not skeletal anymore but considered conventionally thin and that’s ok for me right now. Still have to fight urges though, and not always successfully :(\n\nMy psychiatrist in the children’s IP actually suggested “functional anorexia” after many months and I’d like to think she would be happy-ish with me today.",
          "created_utc": 1742798764.0
        },
        {
          "id": "mjfwqig",
          "author": "Equivalent-Lie5822",
          "body": "I’m so glad to finally hear someone say that because I feel the same way. Ideally, I’d love to be free from this and not live my life this way. But what does recovery really give me? “Freedom” with insecurity the rest of my life? Living in emotional hell and hating my body? I absolutely see no benefit to recovery. None.",
          "created_utc": 1742799687.0
        }
      ]
    },
    {
      "id": "mk4e4vr",
      "author": "01010011x",
      "body": "Ooooof yes.",
      "created_utc": 1743129714.0,
      "score": 1,
      "context": [
        {
          "id": "mjfwvvg",
          "author": "Rare_Example",
          "body": "I relate to this. I go to university, where half of people drop out because the courses are objectively hard both theoretically and physically. After 10 years of having anorexia, I’ve learned how to seem high functioning, when in reality I’m spending all my energy on thinking about food and planning meals. Because people perceive me as high functioning, I often struggle with believing that I actually have an illness, even though my entire life revolves around food and my body is barely holding on.",
          "created_utc": 1742799785.0
        },
        {
          "id": "mjfz7o3",
          "author": "Skythebluestars",
          "body": "Thiss! Exactly . Ive lost so mamy friends over the years. Because i wasnt functioning at all. And when you appear high functioning this doesnt seem to happen. \n\nBut it feels like a mask that its about to drop. Its exhausting.",
          "created_utc": 1742801360.0
        },
        {
          "id": "mjg5yyh",
          "author": "Rare_Example",
          "body": "Yeah, I can usually just maintain superficial friendships, because when people get to actually know me they realize that I am 90% anorexia and 10% real personality",
          "created_utc": 1742806003.0
        }
      ]
    }
  ]
}