{
  "id": "1jq0lqf",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1743629827.0,
  "title": "The consequences of untreated anorexia nervosa",
  "selftext": "When I first became sick, I denied there was a problem. I pushed away help. I became very secretive. When people tried to get me to eat more or asked me about my weight, I said I was fine and nothing was wrong. This line of thinking quickly changes as soon as you start to feel the affects of this disorder. It starts off with wanting to lose weight. Everyone has a reason that the illness starts. Then you start obsessing over it. So it no longer becomes something that you can just stop. Soon the number is all you think about. You start feeling cold, feeling weak, and become afraid of gaining weight. And in the back of your mind, you know it's unhealthy. But you have a hard time time stopping the behavior. When I ended up in the hospital for anorexia, I pushed away the help. I didn't think I needed to be there. So I just would not listen to people when they were telling me this is serious and to treat it early. I was stubborn and deep in my disorder. This was when I had only been anorexic for two years. So it wasn't chronic at that point. I was younger and just not considering the future and the consequences of not treating this. While in the hospital, I was very anxious and afraid. It was probably one of the most difficult times in my life.  What made it easier was the other people there who were also dealing with eating disorders. It made me feel not alone. I went through two hospitalizations for anorexia. They told me I had osteoporosis. They wanted me to go to residential treatment. I just did not listen. And after I got out of the hospital, I went right back to losing weight. This is where my behaviors started to become more entrenched. I tried outpatient therapy a few times. However, I never stuck to outpatient treatment. And my disorder became more severe. Years later, I have severe and enduring anorexia. I have never reached a point in my illness where I managed to fully recover. And I feel a sense of sadness and regret that I did not listen to my treatment team years ago. However, it is not my fault I developed this disorder. Now I suffer from very severe medical complications as a result of prolonged malnutrition. I was unaware these complications could happen as a result of starvation. My body can no longer absorb the nutrients properly from the food I eat. This means I lose weight without trying and have a difficult time gaining weight. When I attempt to eat more, I get stomach pain and digestive issues, and feel hunger after eating. And it makes gaining weight difficult. I also have painful and frequent urination, which I have been unable to successfully treat.  The pain has made me more stressed and anxious. And when I get stressed and anxious, I have a hard time motivating myself to stick to treatment. So I am essentially staying at home a lot, in severe pain from these symptoms. It makes me feel like I can't go out and do things, and that will affect a person's mental health. And the pain never stops. Along with these complications, I feel tired and have become more depressed. My treatment team includes a therapist, a doctor and a nutritionist. However, I am very rigid in my thinking and have autism, along with the anorexia nervosa. I have sensory issues around eating and difficulty adjusting to new routines. This is likely why inpatient treatment was so difficult for me. When someone on my treatment team recommends I try something to make myself feel better, I do not always follow through with what they are asking me to do. I do not like change and have fear around it. But a part of me knows that in order to get better from something like anorexia, you have to accept certain changes. I know there are treatment programs out there for those with severe and enduring anorexia and autism. This is an awful disorder. It not only causes pain to the person who is going through it, but to everyone who cares about them. My parents are very supportive and help me with things, but even after I have struggled with this for a long time, they do not always understand my eating disorder and why it is so hard for me to recover from it. Everyone who has this disorder deserves support and understanding. It is not your fault that you have this illness. If I could go back in time, I would have treated this sooner, before it became worse. But I know I can't change the past. I don't want to be in constant pain and I want to feel better. While anorexia is a difficult illness to have, there are people who care and want to help you get through it",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1jq0lqf/the_consequences_of_untreated_anorexia_nervosa/",
  "score": 118,
  "num_comments": 13,
  "comments": [
    {
      "id": "ml3hcp9",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1743629827.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml556sz",
      "author": "brain-freeze-",
      "body": "Thanks so much for sharing your experience. It must be so difficult, yet you are managing to be positive. Lots of ❤️ and best wishes for a full recovery.",
      "created_utc": 1743650710.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ml7s0s3",
      "author": "cybernectic-cherub",
      "body": "Really want to encourage u to go to residential. They have knowledgeable and specialty dieticians and doctors to help with these things. It sucks but is necessary sometimes.",
      "created_utc": 1743694387.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mlf8f8m",
      "author": "BallSufficient5671",
      "body": "I too have chronic Anorexia for over 30 years and I too now have chronic medical consequences that I can't undo no matter how fat I get now. I will not die from this disease.But rather suffer all the medical consequences.Because I could not listen to my treatment team when I was a teenager and now I wish I would have now that i'm in my forties. I get so jealous of the people That listened early on and were able to turn their life around before it got to them chronically. \n\n\nI now am in chronic pain all the time.I now have several nervous system conditions in chronic nerve pain, have severe osteoporosis and kyphosis, and am basically crippled from anorexia. It has permanently malfunctioned my hypothalmus so I am hit all the time. I'm miserable and I have anorexia to blame. ",
      "created_utc": 1743793779.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlrkf9q",
      "author": "person345819",
      "body": "I am a young adult about to start college this fall, and I am in the beginning stages of anorexia. I plan on becoming a licensed psychiatrist, so I am very much aware of all of the ins and outs of the disorder, but I've gotten to the point where I can't stop. Your story stuck out to me because I am heading down that same path. It hit home knowing that you have had to stay so strong throughout this monster of a disorder, and I truly wish you the best with your recovery. I hope that I will be able to fight as hard as you are and beat this before it gets worse, but I'm scared that it's going to take over my life before I'm able to start. I would love to hear advice if anyone has some, and I wish everyone a beautiful life ❤️",
      "created_utc": 1743975478.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlx0hqv",
      "author": "Dry-Bit-5843",
      "body": "Off topic but #tea over coffee if you don’t agree than consider you an opp",
      "created_utc": 1744055368.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml68ezz",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1743672656.0,
      "score": -2,
      "context": []
    },
    {
      "id": "ml55s6h",
      "author": "Coffeegreysky12",
      "body": "You are welcome. Thank you for the kind words. It's important to remain positive, even when things are difficult",
      "created_utc": 1743650954.0,
      "score": 9,
      "context": [
        {
          "id": "ml556sz",
          "author": "brain-freeze-",
          "body": "Thanks so much for sharing your experience. It must be so difficult, yet you are managing to be positive. Lots of ❤️ and best wishes for a full recovery.",
          "created_utc": 1743650710.0
        }
      ]
    },
    {
      "id": "ml7sv9m",
      "author": "Coffeegreysky12",
      "body": "Thank you for the advice",
      "created_utc": 1743694632.0,
      "score": 3,
      "context": [
        {
          "id": "ml7s0s3",
          "author": "cybernectic-cherub",
          "body": "Really want to encourage u to go to residential. They have knowledgeable and specialty dieticians and doctors to help with these things. It sucks but is necessary sometimes.",
          "created_utc": 1743694387.0
        }
      ]
    },
    {
      "id": "mlfae3k",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing and I am sorry for what you are going through. It's a tough disorder to have. It really causes so much pain to the person going through it. I wish I had listened when people told me to treat this early, but I didn't. However, I am trying to remain positive, even if I suffer medical complications from this illness. Although some days, it's really difficult because pain will affect your mental health. But I try remain optimistic that I can feel better and push through it.",
      "created_utc": 1743794400.0,
      "score": 2,
      "context": [
        {
          "id": "mlf8f8m",
          "author": "BallSufficient5671",
          "body": "I too have chronic Anorexia for over 30 years and I too now have chronic medical consequences that I can't undo no matter how fat I get now. I will not die from this disease.But rather suffer all the medical consequences.Because I could not listen to my treatment team when I was a teenager and now I wish I would have now that i'm in my forties. I get so jealous of the people That listened early on and were able to turn their life around before it got to them chronically. \n\n\nI now am in chronic pain all the time.I now have several nervous system conditions in chronic nerve pain, have severe osteoporosis and kyphosis, and am basically crippled from anorexia. It has permanently malfunctioned my hypothalmus so I am hit all the time. I'm miserable and I have anorexia to blame. ",
          "created_utc": 1743793779.0
        }
      ]
    },
    {
      "id": "mlrr50p",
      "author": "Coffeegreysky12",
      "body": "Thank you. I appreciate the kind words. I'm glad this post has helped you fight this disorder. It's not an easy illness to go through. It means a lot that my story has helped you",
      "created_utc": 1743977847.0,
      "score": 1,
      "context": [
        {
          "id": "mlrkf9q",
          "author": "person345819",
          "body": "I am a young adult about to start college this fall, and I am in the beginning stages of anorexia. I plan on becoming a licensed psychiatrist, so I am very much aware of all of the ins and outs of the disorder, but I've gotten to the point where I can't stop. Your story stuck out to me because I am heading down that same path. It hit home knowing that you have had to stay so strong throughout this monster of a disorder, and I truly wish you the best with your recovery. I hope that I will be able to fight as hard as you are and beat this before it gets worse, but I'm scared that it's going to take over my life before I'm able to start. I would love to hear advice if anyone has some, and I wish everyone a beautiful life ❤️",
          "created_utc": 1743975478.0
        }
      ]
    },
    {
      "id": "ml6aofy",
      "author": "sprinklefawn",
      "body": "How IS it their fault? That’s essentially like blaming someone for their MS or cancer.",
      "created_utc": 1743674052.0,
      "score": 4,
      "context": [
        {
          "id": "ml68ezz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1743672656.0
        }
      ]
    },
    {
      "id": "mlfbd3g",
      "author": "BallSufficient5671",
      "body": "I'm sorry for you too. Thank you",
      "created_utc": 1743794705.0,
      "score": 2,
      "context": [
        {
          "id": "mlf8f8m",
          "author": "BallSufficient5671",
          "body": "I too have chronic Anorexia for over 30 years and I too now have chronic medical consequences that I can't undo no matter how fat I get now. I will not die from this disease.But rather suffer all the medical consequences.Because I could not listen to my treatment team when I was a teenager and now I wish I would have now that i'm in my forties. I get so jealous of the people That listened early on and were able to turn their life around before it got to them chronically. \n\n\nI now am in chronic pain all the time.I now have several nervous system conditions in chronic nerve pain, have severe osteoporosis and kyphosis, and am basically crippled from anorexia. It has permanently malfunctioned my hypothalmus so I am hit all the time. I'm miserable and I have anorexia to blame. ",
          "created_utc": 1743793779.0
        },
        {
          "id": "mlfae3k",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing and I am sorry for what you are going through. It's a tough disorder to have. It really causes so much pain to the person going through it. I wish I had listened when people told me to treat this early, but I didn't. However, I am trying to remain positive, even if I suffer medical complications from this illness. Although some days, it's really difficult because pain will affect your mental health. But I try remain optimistic that I can feel better and push through it.",
          "created_utc": 1743794400.0
        }
      ]
    },
    {
      "id": "ml6ayzx",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1743674230.0,
      "score": -1,
      "context": [
        {
          "id": "ml68ezz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1743672656.0
        },
        {
          "id": "ml6aofy",
          "author": "sprinklefawn",
          "body": "How IS it their fault? That’s essentially like blaming someone for their MS or cancer.",
          "created_utc": 1743674052.0
        }
      ]
    },
    {
      "id": "ml6b2zg",
      "author": "sprinklefawn",
      "body": "Nah, don’t do that. You know how that question could be taken.",
      "created_utc": 1743674296.0,
      "score": 2,
      "context": [
        {
          "id": "ml68ezz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1743672656.0
        },
        {
          "id": "ml6aofy",
          "author": "sprinklefawn",
          "body": "How IS it their fault? That’s essentially like blaming someone for their MS or cancer.",
          "created_utc": 1743674052.0
        },
        {
          "id": "ml6ayzx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1743674230.0
        }
      ]
    }
  ]
}