{
  "id": "1jrbipu",
  "subreddit": "AnorexiaNervosa",
  "author": "NoCaterpillar3919",
  "created_utc": 1743772286.0,
  "title": "what are your most fucked up disordered thoughts?",
  "selftext": "i’ll go first: an embarrassingly huge part of me was excited when my grandfather passed away because i knew i’d be too sad to eat.\n\ni also deliberately tanked my driving test so that the feeling of failure would help me starve myself in punishment\n\nwoohoo! 🤠",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1jrbipu/what_are_your_most_fucked_up_disordered_thoughts/",
  "score": 235,
  "num_comments": 141,
  "comments": [
    {
      "id": "mldadat",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1743772287.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mle2wyt",
      "author": "AbsolutelyNot5555",
      "body": "Im warning you, it’s fucked up. I’m a breast cancer survivor and at my worst I think if the cancer comes back I can lose weight without anyone bothering me about it.",
      "created_utc": 1743781274.0,
      "score": 104,
      "context": []
    },
    {
      "id": "mldtpfe",
      "author": "Electronic-Tie-3622",
      "body": "i want to be kidnapped and starved for a bit",
      "created_utc": 1743778525.0,
      "score": 110,
      "context": []
    },
    {
      "id": "mldklzu",
      "author": "jellosquasch",
      "body": "one time during a really bad binge day i went on a long walk outside my house. i didnt bring my pepper spray and i was just thinking 'i hope i get kidnapped or assaulted. maybe i'll be so traumatized i'll finally stop eating' i cried a lot that day.",
      "created_utc": 1743775757.0,
      "score": 88,
      "context": []
    },
    {
      "id": "mldd1c5",
      "author": "unitedthursday",
      "body": "oh, i’m not the only one who gets those types of thoughts!\nlemme think, every time I get sick I hope that I stay sick for a while and lose appetite and lose weight. When I got Covid I was so hyped. There’s probably more that are more morbid.",
      "created_utc": 1743773232.0,
      "score": 117,
      "context": []
    },
    {
      "id": "mldyzwn",
      "author": "UnicornPoopCircus",
      "body": "I was in the hospital with a serious infection. My mother would visit, and let me be so clear, she is the source of *all* my eating disorder nonsense. She says to me, as I'm in the bed, having endless antibiotics pumped into me, \"Being in the hospital sucks, but you'll definitely lose weight! That's the good thing about hospitals!\"\n\nMy first reaction was, \"What?!\" \n\nBut then it was, \"She isn't wrong though...\"\n\nAnd I did lose weight. 😂",
      "created_utc": 1743780103.0,
      "score": 34,
      "context": []
    },
    {
      "id": "mlduk22",
      "author": "ScottishWidow64",
      "body": "That I want to cut my breasts off",
      "created_utc": 1743778777.0,
      "score": 64,
      "context": []
    },
    {
      "id": "mle4l5n",
      "author": "mouse-bites",
      "body": "I always wish I’d get food poisoning. I also often think that because I haven’t died yet, I must not be “that sick.” I also will admit that I have a lot of fatphobic thoughts and >!sometimes find myself physically repulsed when I’m near a fat person.!< it’s horrible, I know. I feel like a bad person for it but it’s so ingrained in me by the way my parents spoke about >!fat people!<. Like idk how to undo that bias.",
      "created_utc": 1743781768.0,
      "score": 58,
      "context": []
    },
    {
      "id": "mldjhe8",
      "author": "SomeInsPeep",
      "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
      "created_utc": 1743775393.0,
      "score": 51,
      "context": []
    },
    {
      "id": "mldrrki",
      "author": "Fluffy_Community2558",
      "body": "sometimes i despise my friends and gf because they are skinnier than me, as a form of jealousy. i try to feed everyone around me more calories by cooking for them with lots of oil, butter and sauces. sometimes im repulsed by looking at my family members who are bigger, and think “they let themselves go”.\nit’s such an awful disease, it has totally fucked up how i think and feel about the people around me, and i can’t do anything about it, the thoughts never go away :(",
      "created_utc": 1743777956.0,
      "score": 94,
      "context": []
    },
    {
      "id": "mlfd7o1",
      "author": "princessuuke",
      "body": "I want people to feel bad for me and protect me for looking deeply emaciated, but I am not at that point yet :^) i want to be though just to physically show the world yes my life is hell",
      "created_utc": 1743795288.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mldfr8g",
      "author": "Ok_mar8788",
      "body": "I ate rotten food because I believed it would cause me to get food poisoning, which would make me lose weight or at least have a diarrhea💔",
      "created_utc": 1743774169.0,
      "score": 40,
      "context": []
    },
    {
      "id": "mlef8sc",
      "author": "dave_ebubbles",
      "body": "Wanting to be hospitalized again so I can stop having to suffer everyday through >!getting my steps in (exercise compulsions)!< and doing all of my work at school and responsibilities when I have zero energy even though it was absolutely miserable and emotionally burdened my loved ones so much.",
      "created_utc": 1743784994.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mldtr4x",
      "author": "Electronic-Tie-3622",
      "body": "i want to be in a coma so i don’t have to eat",
      "created_utc": 1743778538.0,
      "score": 33,
      "context": []
    },
    {
      "id": "mldtlhh",
      "author": "Electronic-Tie-3622",
      "body": "i want to get sick with like gastro so badly bc it usually means i don’t wanna eat and like vomiting with it is a plus bc i cant purge",
      "created_utc": 1743778493.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mlf3gaq",
      "author": "Proof-March275",
      "body": "Getting happy when my sister who’s always been skinnier than me eats junk food. It’s ridiculous, but I can’t help but feel that satisfaction",
      "created_utc": 1743792250.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mlgzg45",
      "author": "Necessary_Pay1186",
      "body": "These are pretty f—ed up, but…\n\nMy friend gained weight due to a life saving medication, and all I could think was that at least I’m the skinnier friend now. \n\nAlso, I have looked up pictures of starving people in Syria as a “other people have it worse, at least this is a choice” mindset.",
      "created_utc": 1743815426.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mle8qb9",
      "author": "ihearthetrees",
      "body": "I’m losing muscle due to wasting, likely cancer but we don’t know for sure till next week, and some part of my anorexic brain is excited for the weight I’ll be ‘allowed’ to lose because of this. I feel like a monster for feeling that way.",
      "created_utc": 1743783012.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mldfs27",
      "author": "buckers777",
      "body": "Wishing my bf would cheat on me so I wouldn’t eat (he’s the most lovely person I’ve ever met)",
      "created_utc": 1743774177.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mlexf62",
      "author": "Nyxlmercymain",
      "body": "Being jealous of children",
      "created_utc": 1743790404.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mlde14m",
      "author": "None",
      "body": "extremely fatphobic thoughts, there was a period of time where i fully believed that >!anorexia is a privilege and anyone above a certain bmi was unworthy and [insert a bunch of derogatory phrases here].!< i have since grown out of that mindset because i ended up going above that certain bmi during a long binge episode 😬",
      "created_utc": 1743773575.0,
      "score": 36,
      "context": []
    },
    {
      "id": "mldqf8p",
      "author": "Interesting-Cow8131",
      "body": "One of my coworkers was recently diagnosed with cancer. I had a brief thought of what if I got cancer, then I'd have a reason for no appetite and lose more weight. Then I had a horrifying thought that the Dr would tube feed me because of my already low weight and that terrified me.",
      "created_utc": 1743777553.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mlesdfg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1743788895.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mldtd6p",
      "author": "Electronic-Tie-3622",
      "body": "not really a thought but deliberately adding extra calories when cooking for other people or deliberately buying people fast food or junk food",
      "created_utc": 1743778425.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mlfsb94",
      "author": "None",
      "body": "I'm also happy when I get sick. Sometimes I have suffered terrible pain in the colon due to my illness and despite the pain, diarrhea, vomiting, etc. I am happy and smile when I look at the scale and see that I have lost 1 or 2 kg. Hating my period because I looked a little swollen in the lower area, horrible. I have never done the thing of putting more calories in people's food, but I have felt disgusted by fat people, including my past self to the point of thinking that I would never kiss or have physical contact with a fat person. 😔",
      "created_utc": 1743799940.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mlgkxey",
      "author": "bxmptrunk",
      "body": "when i was a kid i would always pray someone would kidnap me so i could be starved and lose weight and now whenever im driving i just think to myself i could literally run away to the mountains or smth with no food or anything so i could keep myself starved and displined",
      "created_utc": 1743809881.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mlg3ijt",
      "author": "Charming-Rub6099",
      "body": "When i was an impatient in hospital i planned to go and sleep on a secluded mountain for 2 weeks, lose weight and then walk home, as if i wouldn’t have been dead 😂",
      "created_utc": 1743803619.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mlggkj5",
      "author": "spookyaf6",
      "body": "When I got diagnosed with cancer I thought “well at least I’ll lose weight!” And that comforted me. 🥴",
      "created_utc": 1743808288.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mlgl9zi",
      "author": "bxmptrunk",
      "body": "comparing myself to little kids i’ll be like damn why there collarbones popping out more then mines, also when i got cheated on i was happy because i knew i wouldn’t have an appetite and would lose weight 😭",
      "created_utc": 1743810011.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mlithka",
      "author": "Ok-Owl5348",
      "body": "I know that this is SO messed up, but I would encourage people around me to eat things with high calories (burgers, fries, heavy pasta, etc.) and hope that they eat more and more to make MYSELF feel better.",
      "created_utc": 1743850601.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mlg2jgy",
      "author": "nek811",
      "body": "I have a drug problem and i am happy about their ability to destroy my GI tract so I lose weight uwu",
      "created_utc": 1743803290.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mlneava",
      "author": "jessiecolborne",
      "body": "I thought about what my BMI would be if I cut off my limbs.",
      "created_utc": 1743912632.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlrtx7i",
      "author": "Fluttery_Soul",
      "body": "The self sabotage is real.\n\n\nSome of my (maybe?) fucked up thoughts:\n\n\n- Wanting to cut my hair so the scale can go down or even the intrusive thought that it would go down if I lost a limb\n- Getting happy seeing others eat while I'm not bc it reminds me of all the calories I'm dodging\n- I learned about some disease that causes a person's body to be unable to digest certain types of food and had the itching thought of 'what if I make myself develop this?'",
      "created_utc": 1743978851.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mlzuux0",
      "author": "diana_allygirl389",
      "body": "Idk if this counts but I cast silent judgement and evaluation on random strangers bodies in public without even meaning to I feel so vile for it",
      "created_utc": 1744094961.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mleoctw",
      "author": "mor-cat",
      "body": "Hoping that something will upset me or make me anxious so that I’ll lose my appetite and won’t eat. Also comparing myself to random people in public which I hate myself for doing. Even though I would never say anything to them or ever voice my thoughts, I still think it’s unfair for me to do that to an unsuspecting unknowing person.",
      "created_utc": 1743787716.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlhx8v8",
      "author": "shooketh_speare",
      "body": "At my absolute worst? Seeing pictures of Holocaust survivors and wishing I was that thin. It was incredibly fucked up and definitely contributed to me making the decision to get help.",
      "created_utc": 1743830559.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlll805",
      "author": "coldhardash",
      "body": "i get upset cause ppl wont let me starve myself but they dont care if my great aunt only eats one meal a day and shes super thin (she just forgets to eat cause she has depressive episodes)",
      "created_utc": 1743887102.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mldndhz",
      "author": "adumbledorablee",
      "body": "At my work, I was having a hearing with a woman (from an Asian country) who was a victim of organ trade. I felt horrible for her but my ED brain went “goals” at her super skinny, small, brittle frame.",
      "created_utc": 1743776618.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mlelpte",
      "author": "Shuyuya",
      "body": "Ahh, similar, when me and my bf get into a huge fight, I’m super sad and hurt, so depressed that I don’t feel hunger anymore. And when that happens I’m often “**yes**, at least I’ll lose some weight”\n\nI have another one but idk if I can say it but it’s about how I view some people.",
      "created_utc": 1743786935.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mletk0a",
      "author": "Zimsgirlfriend",
      "body": "More so actions then thoughts but a few times in the past my compulsive exercise addiction got so bad that I've had near death experiences. My worst experience was on Christmas where I walked in five inches of snow for two hours so I was worthy enough to have a apple juice box...I still remember coming inside the house feeling like I was going to die from hyperthermia. I'm glad I'm doing somewhat better now but still have ways to go.🧃😿",
      "created_utc": 1743789253.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlg34qp",
      "author": "Charming-Rub6099",
      "body": "When i was extremely sick the worst thought i had was that everyone should look like me and they were disgusting for carrying weight. My anorexia affected me so bad it begin to impact my views on other people, it was not good",
      "created_utc": 1743803489.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlh7670",
      "author": "goodie-vibesss",
      "body": "I have all these thoughts. But some other ones are seeing children and wanting to be that skinny and small.\n\nBeing happy to be admitted into the hospital for kidney stones, wanting to go on prep for pre-surgery bc you HAVE to not eat.\nAlso I am excited to go under anesthesia or get sedated cus it numbs the pain. \n\nI know I have more.",
      "created_utc": 1743818472.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlhdrsx",
      "author": "AbsolutelyNot5555",
      "body": ".",
      "created_utc": 1743821203.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlhutni",
      "author": "None",
      "body": "I was in a horribly abusive relationship and it lead to me getting to my lowest BW because restricting was both a coping mechanism but also the easier way to keep him happy.\nSometimes I wish I could go back as if that reality was better than the one I’m in now 🙃",
      "created_utc": 1743829251.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlilm37",
      "author": "MacBethgettingolder",
      "body": "I had a 24 hr virus that drove up my BP to crazy rates,  headache,  cold hot chills (I'm 60 so quite scary). I was praying to just get through the night,  I promise to turn my disordered food issues around... blah blah. \n\nWoke at 6am feeling much better,  RELIEF.... went and weighed myself,  dehydrated of course from the previous nights curse of sickness to find my lowest weight since 15 yo.... \nBEST\nFEELING\nEVER...\n\nhow twisted is that....?",
      "created_utc": 1743845523.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mljwbi4",
      "author": "Minorthreat82",
      "body": "I remember writing a note on my phone to my mom before I went to bed, because I really thought I might die that night. Things like this and my families comments about my weight loss and lack of eating are the main things I remember from that time period.",
      "created_utc": 1743866696.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mljxhig",
      "author": "monsterzerog1rl",
      "body": "there are currently protests in my country, and few of them were by big groups of people walking from one city to another. the only thing I was thinking about was how many cals will I burn",
      "created_utc": 1743867093.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlllv5z",
      "author": "coldhardash",
      "body": "ive had thoughts like \"i wish my mom would d word so i could starve in peace\" cause ik my dad wouldnt know how to enforce it n my other family doesnt get it either .. i really dont wish that bc i love my mom sm and i feel so evil for this thought:(",
      "created_utc": 1743887328.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mln4q7k",
      "author": "mlk_alternative_",
      "body": "I once saw a picture of a POW and got jealous of how thin they were after being held hostage",
      "created_utc": 1743908394.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlosw81",
      "author": "meowJunis",
      "body": "I want to get so bad that I pass out or end up in hospital",
      "created_utc": 1743941887.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mloukjl",
      "author": "s05k14w68",
      "body": "I look forward to Company functions where a lot of food is served so I can fill up a plate to look normal & then eat like 1 bite of it & toss it.  I know it’s been obvious lately & I’m fine with it.",
      "created_utc": 1743942687.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlpc3i9",
      "author": "delsasadrummer",
      "body": "I would go outside without mosquito repellent in hope of getting dengue (it's pretty common to lose weight due to dengue, and dengue is kinda epidemic in my country so..)",
      "created_utc": 1743949553.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlqye8x",
      "author": "Weeping-willow993",
      "body": "I get excited when I get sick because it means I can lose weight easier",
      "created_utc": 1743968363.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlr4lzq",
      "author": "teadiumvitae237",
      "body": "The very fucked up part of me felt paradoxically sad when I became too underweight to donate blood as I always loved the idea of the donation taking a whole bunch of calories out of me in an instant. \n\nSame very fucked up part of me is looking forward to an upcoming routine colonoscopy (because of genetics in my case) as the preparation process (involving some heavy duty laxatives) will always come with some weight loss for me and I'll feel pure and light as a feather for a few days.",
      "created_utc": 1743970328.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mls2pt0",
      "author": "worriedgirl03",
      "body": "When my grandma passed I was so upset for obviously a plethora of reasons but one in particular was that I was planning on asking her if I had gotten fat and I knew she would be sickeningly honest w me 😭😭😭 and I was so upset I could not longer ask like girl stfu",
      "created_utc": 1743982017.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlscw37",
      "author": "Flexiecution",
      "body": "I used to try to get stomach bugs 😭. Now I wanna go on survivor so I can starve 😂",
      "created_utc": 1743985829.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlsiwwl",
      "author": "-Mostwantedbih-",
      "body": "i found my best friends edtwt account and she still doesn’t know i know she’s disordered and i often hope that she binges badly or doesn’t lose weight and become smaller than me. in my head it’s like a one sided competition with her and i feel like everytime she invites me to eat or offers me food she actively trying to sabotage me… its terrible and im so shitry for it but i can’t help it",
      "created_utc": 1743988143.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlsrpi8",
      "author": "Inevitable_Cow2291",
      "body": "When I move out I’ll be able to starve as much as I want because I’ll mostly be too poor to afford to buy groceries",
      "created_utc": 1743991625.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mly72yv",
      "author": "Impossible-Cat33",
      "body": "I think Ariana grande looks amazing and I wish I could be that skinny…I also lie to all my doctors about how much I eat and weigh especially if appointments are virtual. I have also seriously considered trying bioma or weight loss drugs I can get online…",
      "created_utc": 1744069386.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlyp396",
      "author": "Laxjudgement",
      "body": "I struggle with major depressive disorder with SI. The thing that stops me from acting on these urges right now is that i feel i need to be at a lower weight first. If I’m not supposed to post about this I sincerely apologize.",
      "created_utc": 1744075936.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mm3gbdo",
      "author": "jelly_juli",
      "body": "i’m a minor and i’ve always dreamed of moving out of the house and saving so much money on food because i won’t buy any, and they’ll be nothing to eat",
      "created_utc": 1744143746.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mldyoro",
      "author": "Ivanq0l",
      "body": "Microwaved nuggets, they tasted spicy with no seasoning, kept eating because at worst i get poisoned and throw up so less cals count. 🤡",
      "created_utc": 1743780012.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlhm8ar",
      "author": "LeadershipStatus6524",
      "body": "one time i ordered a salad to be delivered, and i asked for dressing on the side. it came, ofc, with the dressing on it 🙄 i was so upset i took two fistfuls of salad and threw it on the kitchen wall, and then proceeded to have to clean up the mess i made. have also done this with spaghetti, sandwiches, etc 😭",
      "created_utc": 1743824991.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mlhfc5h",
      "author": "e36qunB",
      "body": "I like to be told i look too skinny or on verge of sick",
      "created_utc": 1743821878.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlhsgvw",
      "author": "helianthus_0",
      "body": "Wanting something bad, but not too bad, to happen to me so that I have “an excuse to relapse.” Like a friend dying, but not a close friend. Which is weird because I’ve relapsed before over simply looking in the mirror and thinking I looked fat as hell.",
      "created_utc": 1743828038.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlipnoc",
      "author": "LangGetaways",
      "body": "Thinking if I was skinny enough, people would be jealous of me therefore they'd think I'm worthy and popular (I'm also npd). Also if I was skinny enough, no one would have a reason to hate me and they'd adore me",
      "created_utc": 1743848205.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mljejvh",
      "author": "Key_Significance_179",
      "body": "at my worst, i tried giving myself food poisoning or salmonella so my appetite would go away. glad im not in that headspace anymore😭",
      "created_utc": 1743860483.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mljnv2c",
      "author": "vartush",
      "body": "I think that Im not afraid of dying. I'm fantasizing of getting my skull/jaw broken so I can't eat. Made myself miserable and depressed so I dont want to eat anything. Get kidnapped and starved to death.",
      "created_utc": 1743863839.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mljtkbi",
      "author": "moons_of_swirls",
      "body": "a very selfish part of me wants my parents to lose their jobs so that we might starve it's really fucked up",
      "created_utc": 1743865753.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlugm18",
      "author": "Horror-Dragonfly-266",
      "body": "I’m pretty typical tbh just wishing I get diabetes or smth to blame why I’m not eating or cancer to have no appetite bc of chemo. Or to just get a rlly bad stomach so I just throw everything up again. Or have someone die just to blame being too sad to eat. ",
      "created_utc": 1744024798.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlwbyx0",
      "author": "Glittering_Big_4530",
      "body": "I always feel so disgusting when I get triggered by a child. I know it's not an exclusive experience but in the moment I'm like \"this is a child why are you even looking at them in any compacity let alone feeling triggered by them\" \n\nBut also with what op said, I've had major relapses after a loved one died. It's not nice mentally to go through the pain but my eating disorder has never felt happier being able to \"console me\" with the safety net of starvation",
      "created_utc": 1744047845.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmbfi1n",
      "author": "rainbow_k1tty",
      "body": "mine was that i wanted to cut off the layers of fat from my body 👍",
      "created_utc": 1744249098.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmcmthv",
      "author": "That_Neck8763",
      "body": "Not so messed up but when I dropped my toast on the dusty car floor I was debating whether to eat it or not 😭",
      "created_utc": 1744269078.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmiguiq",
      "author": "None",
      "body": "I want to move out already, so nobody can keep track of how little I eat and I also kinda wanna be broke in uni so I can't actually afford food. And look rn I'm not like the skinniest I still have plenty of weight on me but I want to lose so much weight that everyone will actually start taking me seriously bc when I first told friends and stuff they all doubted me bc I don't have what is stereotyped as the \"anorexic body\"",
      "created_utc": 1744346325.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mnaypb9",
      "author": "Melodic_Economics964",
      "body": "I want to be thinner so people can see just much pain I'm in mentally.\n\nI like being treated delicately and playfully like a child when I'm thinner. Never happens at a \"normal\" weight range.\n\nI was to disappear so nobody can hurt me anymore.\n\nI want to be assaulted so I'm traumatized enough to stop eating and lose more weight. This is not to invalidate any victims out there honest. I would take risks walking train tracks, alleyways, trails, abandoned subway stations. \n\nYeah I'm pretty f-ed up. Please do not judge me. I know this is f-ed up.",
      "created_utc": 1744752654.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlee0yc",
      "author": "jeffwingerslexus",
      "body": "i have a brain tumor but it is benign. sometimes i wish it was malignant so i could maybe lose weight 💀 wtff",
      "created_utc": 1743784625.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mll5ayi",
      "author": "AmongUs-Pornhub",
      "body": "I want to cut my breasts off, Ive eaten rotten fruit & entire batches of raw cookie dough (got sick 1/7? times, that 1 time was horrible, do not recommend), I get very jealous of small children, when I meet new people my mood towards them completely relies on their weight compared to mine, got genuinely suicidal when I got diagnosed with hypoglycemia bc that means ill have to eat breakfast or ill be low (never eaten breakfast, even before anorexia), I saw an extremely low bmi person irl for the first time last year during the worse of my ED & I couldn’t stop staring & comparing myself while simultaneously feeling bad for them, ive wanted to be in a toxic relationship where someone keeps me from gaining weight, & so much more but this is getting long 😭",
      "created_utc": 1743881715.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mldr8mt",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1743777798.0,
      "score": -3,
      "context": []
    },
    {
      "id": "mlhpwcw",
      "author": "dolewhipzombie",
      "body": "I was in the hospital six times back to back last year, I dropped about an entire value size cat litter in two months and was in double digits on the scale. I almost died three times, but I felt SO HAPPY … and now that I’m at my highest weight I’ve been in ten years, I hope daily to be that sick again.",
      "created_utc": 1743826751.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mlyojnu",
      "author": "ProfessionProof5284",
      "body": "I really don't think this post is healthy!!!! It's very triggering amd not funny at all. Sharing fooked up thoughts.. we should be supporting each other... not laughing at our ' disordered thoughts '",
      "created_utc": 1744075737.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mlh3sq1",
      "author": "P100KateEventually",
      "body": "Okay but why am I cackling. I don’t want to make light of it but that is a wildly relatable level of disorder.",
      "created_utc": 1743817135.0,
      "score": 12,
      "context": [
        {
          "id": "mle2wyt",
          "author": "AbsolutelyNot5555",
          "body": "Im warning you, it’s fucked up. I’m a breast cancer survivor and at my worst I think if the cancer comes back I can lose weight without anyone bothering me about it.",
          "created_utc": 1743781274.0
        }
      ]
    },
    {
      "id": "mlf4xnm",
      "author": "HippyDippyPippy",
      "body": "SAME same same.",
      "created_utc": 1743792701.0,
      "score": 8,
      "context": [
        {
          "id": "mle2wyt",
          "author": "AbsolutelyNot5555",
          "body": "Im warning you, it’s fucked up. I’m a breast cancer survivor and at my worst I think if the cancer comes back I can lose weight without anyone bothering me about it.",
          "created_utc": 1743781274.0
        }
      ]
    },
    {
      "id": "mlhpnb1",
      "author": "dolewhipzombie",
      "body": "Same.",
      "created_utc": 1743826627.0,
      "score": 4,
      "context": [
        {
          "id": "mle2wyt",
          "author": "AbsolutelyNot5555",
          "body": "Im warning you, it’s fucked up. I’m a breast cancer survivor and at my worst I think if the cancer comes back I can lose weight without anyone bothering me about it.",
          "created_utc": 1743781274.0
        }
      ]
    },
    {
      "id": "mle92we",
      "author": "Traditional_City1505",
      "body": "OMG MY FANTASY TOO",
      "created_utc": 1743783119.0,
      "score": 16,
      "context": [
        {
          "id": "mldtpfe",
          "author": "Electronic-Tie-3622",
          "body": "i want to be kidnapped and starved for a bit",
          "created_utc": 1743778525.0
        }
      ]
    },
    {
      "id": "mlealxz",
      "author": "NoCaterpillar3919",
      "body": "YES THIS",
      "created_utc": 1743783585.0,
      "score": 14,
      "context": [
        {
          "id": "mldtpfe",
          "author": "Electronic-Tie-3622",
          "body": "i want to be kidnapped and starved for a bit",
          "created_utc": 1743778525.0
        }
      ]
    },
    {
      "id": "mlgwyt9",
      "author": "HospitalAcrobatic155",
      "body": "REAL",
      "created_utc": 1743814454.0,
      "score": 7,
      "context": [
        {
          "id": "mldtpfe",
          "author": "Electronic-Tie-3622",
          "body": "i want to be kidnapped and starved for a bit",
          "created_utc": 1743778525.0
        }
      ]
    },
    {
      "id": "mlk3ofd",
      "author": "filigreeonleafndvine",
      "body": "i remember a few years back on mpa there was this whole thread of people fantasising about this lmao. including me. no unique experiences.",
      "created_utc": 1743869177.0,
      "score": 6,
      "context": [
        {
          "id": "mldtpfe",
          "author": "Electronic-Tie-3622",
          "body": "i want to be kidnapped and starved for a bit",
          "created_utc": 1743778525.0
        }
      ]
    },
    {
      "id": "mlqgh7b",
      "author": "starrylilacs",
      "body": "LMAO one of my motivations to get to my gw is that in the event i go missing then the weight on the missing poster would be low",
      "created_utc": 1743962585.0,
      "score": 4,
      "context": [
        {
          "id": "mldtpfe",
          "author": "Electronic-Tie-3622",
          "body": "i want to be kidnapped and starved for a bit",
          "created_utc": 1743778525.0
        }
      ]
    },
    {
      "id": "mlmfurx",
      "author": "Ok_Dragonfly7683108",
      "body": "New fantasy unlocked. Tysm",
      "created_utc": 1743898365.0,
      "score": 2,
      "context": [
        {
          "id": "mldtpfe",
          "author": "Electronic-Tie-3622",
          "body": "i want to be kidnapped and starved for a bit",
          "created_utc": 1743778525.0
        }
      ]
    },
    {
      "id": "mlnecb9",
      "author": "jessiecolborne",
      "body": "I’m gonna be totally honest, I’ve had this thought too.",
      "created_utc": 1743912651.0,
      "score": 2,
      "context": [
        {
          "id": "mldtpfe",
          "author": "Electronic-Tie-3622",
          "body": "i want to be kidnapped and starved for a bit",
          "created_utc": 1743778525.0
        }
      ]
    },
    {
      "id": "mlepekf",
      "author": "mor-cat",
      "body": "Me too, I’ve put myself at risk by walking alone in the dark at night after overeating and I didn’t hope that those things would happen to me, but it was more that I just didn’t care if someone hurt me. I was so angry at myself and thought that I deserved it for having no self control",
      "created_utc": 1743788022.0,
      "score": 16,
      "context": [
        {
          "id": "mldklzu",
          "author": "jellosquasch",
          "body": "one time during a really bad binge day i went on a long walk outside my house. i didnt bring my pepper spray and i was just thinking 'i hope i get kidnapped or assaulted. maybe i'll be so traumatized i'll finally stop eating' i cried a lot that day.",
          "created_utc": 1743775757.0
        }
      ]
    },
    {
      "id": "mlddg7b",
      "author": "NoCaterpillar3919",
      "body": "bro i got hospitalised for bronchitis once and i was GRINNING when the nurse said i lost weight. no matter how crazy you think you are, you’re never alone 🫶🏼",
      "created_utc": 1743773375.0,
      "score": 53,
      "context": [
        {
          "id": "mldd1c5",
          "author": "unitedthursday",
          "body": "oh, i’m not the only one who gets those types of thoughts!\nlemme think, every time I get sick I hope that I stay sick for a while and lose appetite and lose weight. When I got Covid I was so hyped. There’s probably more that are more morbid.",
          "created_utc": 1743773232.0
        }
      ]
    },
    {
      "id": "mli8e77",
      "author": "Eh_Alright___",
      "body": "Same, I got food poisoning for 2 weeks and considered going back to that poke restuarant in an attempt to get sick again.",
      "created_utc": 1743836866.0,
      "score": 10,
      "context": [
        {
          "id": "mldd1c5",
          "author": "unitedthursday",
          "body": "oh, i’m not the only one who gets those types of thoughts!\nlemme think, every time I get sick I hope that I stay sick for a while and lose appetite and lose weight. When I got Covid I was so hyped. There’s probably more that are more morbid.",
          "created_utc": 1743773232.0
        }
      ]
    },
    {
      "id": "mlf8ylr",
      "author": "to_tired_to_clare",
      "body": "I have this thought too.",
      "created_utc": 1743793948.0,
      "score": 10,
      "context": [
        {
          "id": "mldd1c5",
          "author": "unitedthursday",
          "body": "oh, i’m not the only one who gets those types of thoughts!\nlemme think, every time I get sick I hope that I stay sick for a while and lose appetite and lose weight. When I got Covid I was so hyped. There’s probably more that are more morbid.",
          "created_utc": 1743773232.0
        }
      ]
    },
    {
      "id": "mlhrv3z",
      "author": "helianthus_0",
      "body": "Same but with my stomach fat.",
      "created_utc": 1743827735.0,
      "score": 9,
      "context": [
        {
          "id": "mlduk22",
          "author": "ScottishWidow64",
          "body": "That I want to cut my breasts off",
          "created_utc": 1743778777.0
        }
      ]
    },
    {
      "id": "mlerny1",
      "author": "carnivorous_unicorns",
      "body": "I mean, it's not just trans people who do it for the looks.",
      "created_utc": 1743788682.0,
      "score": 8,
      "context": [
        {
          "id": "mlduk22",
          "author": "ScottishWidow64",
          "body": "That I want to cut my breasts off",
          "created_utc": 1743778777.0
        }
      ]
    },
    {
      "id": "mles0ac",
      "author": "carnivorous_unicorns",
      "body": "Oh i assure you, a lot of people with EDs are actually fatphobic, both meaning hate/repulsion or literal fear. Its censorship that makes them keep it to themselves.",
      "created_utc": 1743788784.0,
      "score": 37,
      "context": [
        {
          "id": "mle4l5n",
          "author": "mouse-bites",
          "body": "I always wish I’d get food poisoning. I also often think that because I haven’t died yet, I must not be “that sick.” I also will admit that I have a lot of fatphobic thoughts and >!sometimes find myself physically repulsed when I’m near a fat person.!< it’s horrible, I know. I feel like a bad person for it but it’s so ingrained in me by the way my parents spoke about >!fat people!<. Like idk how to undo that bias.",
          "created_utc": 1743781768.0
        }
      ]
    },
    {
      "id": "mledkbp",
      "author": "dave_ebubbles",
      "body": "Please be careful, I have heard many horror stories of other disordered people ending up failing their classes or/and dropping out after their disorder took over basically everything. It's incredibly difficult to balance a college workload while engaging in heavy restriction.",
      "created_utc": 1743784484.0,
      "score": 31,
      "context": [
        {
          "id": "mldjhe8",
          "author": "SomeInsPeep",
          "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
          "created_utc": 1743775393.0
        }
      ]
    },
    {
      "id": "mldkq0x",
      "author": "jellosquasch",
      "body": "yep yep me with moving out soon !",
      "created_utc": 1743775793.0,
      "score": 2,
      "context": [
        {
          "id": "mldjhe8",
          "author": "SomeInsPeep",
          "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
          "created_utc": 1743775393.0
        }
      ]
    },
    {
      "id": "mlg3c6a",
      "author": "Charming-Rub6099",
      "body": "I did this, i also found that i was eating through other people by preparing food and watching them eat it satisfied any food thought i had and made me happy",
      "created_utc": 1743803559.0,
      "score": 8,
      "context": [
        {
          "id": "mldrrki",
          "author": "Fluffy_Community2558",
          "body": "sometimes i despise my friends and gf because they are skinnier than me, as a form of jealousy. i try to feed everyone around me more calories by cooking for them with lots of oil, butter and sauces. sometimes im repulsed by looking at my family members who are bigger, and think “they let themselves go”.\nit’s such an awful disease, it has totally fucked up how i think and feel about the people around me, and i can’t do anything about it, the thoughts never go away :(",
          "created_utc": 1743777956.0
        }
      ]
    },
    {
      "id": "mldtmte",
      "author": "Electronic-Tie-3622",
      "body": "meeee",
      "created_utc": 1743778504.0,
      "score": 4,
      "context": [
        {
          "id": "mldrrki",
          "author": "Fluffy_Community2558",
          "body": "sometimes i despise my friends and gf because they are skinnier than me, as a form of jealousy. i try to feed everyone around me more calories by cooking for them with lots of oil, butter and sauces. sometimes im repulsed by looking at my family members who are bigger, and think “they let themselves go”.\nit’s such an awful disease, it has totally fucked up how i think and feel about the people around me, and i can’t do anything about it, the thoughts never go away :(",
          "created_utc": 1743777956.0
        }
      ]
    },
    {
      "id": "mlgindd",
      "author": "Klutzy_Hunter_354",
      "body": "anorexia can make u have bad thoughts b ut it doesnt make u do that ur weirddd",
      "created_utc": 1743809040.0,
      "score": 3,
      "context": [
        {
          "id": "mldrrki",
          "author": "Fluffy_Community2558",
          "body": "sometimes i despise my friends and gf because they are skinnier than me, as a form of jealousy. i try to feed everyone around me more calories by cooking for them with lots of oil, butter and sauces. sometimes im repulsed by looking at my family members who are bigger, and think “they let themselves go”.\nit’s such an awful disease, it has totally fucked up how i think and feel about the people around me, and i can’t do anything about it, the thoughts never go away :(",
          "created_utc": 1743777956.0
        }
      ]
    },
    {
      "id": "mle39mw",
      "author": "AbsolutelyNot5555",
      "body": "I purposely ate food lined with raw chicken juice because I hoped for food poisoning that would make me throw up and have diarrhea.",
      "created_utc": 1743781378.0,
      "score": 10,
      "context": [
        {
          "id": "mldfr8g",
          "author": "Ok_mar8788",
          "body": "I ate rotten food because I believed it would cause me to get food poisoning, which would make me lose weight or at least have a diarrhea💔",
          "created_utc": 1743774169.0
        }
      ]
    },
    {
      "id": "mldh3sw",
      "author": "NoCaterpillar3919",
      "body": "yep definitely done this with food i’m allergic too as well 🤦‍♀️",
      "created_utc": 1743774620.0,
      "score": 7,
      "context": [
        {
          "id": "mldfr8g",
          "author": "Ok_mar8788",
          "body": "I ate rotten food because I believed it would cause me to get food poisoning, which would make me lose weight or at least have a diarrhea💔",
          "created_utc": 1743774169.0
        }
      ]
    },
    {
      "id": "mlf72x2",
      "author": "None",
      "body": "yeah but you’ll be fed through tubes",
      "created_utc": 1743793358.0,
      "score": 9,
      "context": [
        {
          "id": "mldtr4x",
          "author": "Electronic-Tie-3622",
          "body": "i want to be in a coma so i don’t have to eat",
          "created_utc": 1743778538.0
        }
      ]
    },
    {
      "id": "mlebl47",
      "author": "NoCaterpillar3919",
      "body": "i’m so sorry🩷 you’re not a monster at all, you’re very very brave no matter what result you get xxx",
      "created_utc": 1743783880.0,
      "score": 3,
      "context": [
        {
          "id": "mle8qb9",
          "author": "ihearthetrees",
          "body": "I’m losing muscle due to wasting, likely cancer but we don’t know for sure till next week, and some part of my anorexic brain is excited for the weight I’ll be ‘allowed’ to lose because of this. I feel like a monster for feeling that way.",
          "created_utc": 1743783012.0
        }
      ]
    },
    {
      "id": "mldh7qa",
      "author": "NoCaterpillar3919",
      "body": "😭😭😭",
      "created_utc": 1743774657.0,
      "score": 5,
      "context": [
        {
          "id": "mldfs27",
          "author": "buckers777",
          "body": "Wishing my bf would cheat on me so I wouldn’t eat (he’s the most lovely person I’ve ever met)",
          "created_utc": 1743774177.0
        }
      ]
    },
    {
      "id": "mlf0jgt",
      "author": "runninginbubbles",
      "body": "Yes me too!",
      "created_utc": 1743791359.0,
      "score": 4,
      "context": [
        {
          "id": "mlexf62",
          "author": "Nyxlmercymain",
          "body": "Being jealous of children",
          "created_utc": 1743790404.0
        }
      ]
    },
    {
      "id": "mluzx02",
      "author": "helpicantchooseanam3",
      "body": "hard relate",
      "created_utc": 1744032912.0,
      "score": 2,
      "context": [
        {
          "id": "mlexf62",
          "author": "Nyxlmercymain",
          "body": "Being jealous of children",
          "created_utc": 1743790404.0
        }
      ]
    },
    {
      "id": "mldh08z",
      "author": "NoCaterpillar3919",
      "body": "aw i’m sorry you had those thoughts, you’re not a bad person - sounds like you thought you couldn’t accept love until you were at a certain number so you applied that logic to everyone else. i’ve been there too 🩷",
      "created_utc": 1743774587.0,
      "score": 9,
      "context": [
        {
          "id": "mlde14m",
          "author": "None",
          "body": "extremely fatphobic thoughts, there was a period of time where i fully believed that >!anorexia is a privilege and anyone above a certain bmi was unworthy and [insert a bunch of derogatory phrases here].!< i have since grown out of that mindset because i ended up going above that certain bmi during a long binge episode 😬",
          "created_utc": 1743773575.0
        }
      ]
    },
    {
      "id": "mmatf2u",
      "author": "adhdgorl",
      "body": "I have Celiac, unfortunately it doesn't work that way for me. It actually made me gain weight because my body was grasping what little it could. Lost so much inflammation and extra weight when I got diagnosed.",
      "created_utc": 1744241290.0,
      "score": 2,
      "context": [
        {
          "id": "mlesdfg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1743788895.0
        }
      ]
    },
    {
      "id": "mmnltqs",
      "author": "AbsolutelyNot5555",
      "body": "Me too",
      "created_utc": 1744417134.0,
      "score": 1,
      "context": [
        {
          "id": "mlggkj5",
          "author": "spookyaf6",
          "body": "When I got diagnosed with cancer I thought “well at least I’ll lose weight!” And that comforted me. 🥴",
          "created_utc": 1743808288.0
        }
      ]
    },
    {
      "id": "mln6hyp",
      "author": "Sensasie",
      "body": "She probably actually has an ED",
      "created_utc": 1743909165.0,
      "score": 2,
      "context": [
        {
          "id": "mlll805",
          "author": "coldhardash",
          "body": "i get upset cause ppl wont let me starve myself but they dont care if my great aunt only eats one meal a day and shes super thin (she just forgets to eat cause she has depressive episodes)",
          "created_utc": 1743887102.0
        }
      ]
    },
    {
      "id": "mm0oelu",
      "author": "NoCaterpillar3919",
      "body": "i’ve experienced the exact same thing, almost word for word. i hope you’re feeling better now love 🤍",
      "created_utc": 1744112591.0,
      "score": 1,
      "context": [
        {
          "id": "mlilm37",
          "author": "MacBethgettingolder",
          "body": "I had a 24 hr virus that drove up my BP to crazy rates,  headache,  cold hot chills (I'm 60 so quite scary). I was praying to just get through the night,  I promise to turn my disordered food issues around... blah blah. \n\nWoke at 6am feeling much better,  RELIEF.... went and weighed myself,  dehydrated of course from the previous nights curse of sickness to find my lowest weight since 15 yo.... \nBEST\nFEELING\nEVER...\n\nhow twisted is that....?",
          "created_utc": 1743845523.0
        }
      ]
    },
    {
      "id": "mlzm967",
      "author": "NoCaterpillar3919",
      "body": "i'm right there with you. sometimes i get motivation because i don't want the embalmer to see me unless im super underweight",
      "created_utc": 1744090126.0,
      "score": 2,
      "context": [
        {
          "id": "mlyp396",
          "author": "Laxjudgement",
          "body": "I struggle with major depressive disorder with SI. The thing that stops me from acting on these urges right now is that i feel i need to be at a lower weight first. If I’m not supposed to post about this I sincerely apologize.",
          "created_utc": 1744075936.0
        }
      ]
    },
    {
      "id": "mlnti0h",
      "author": "Plus-Weakness-7499",
      "body": "I get triggered when I see someone saying that to other people because it signals to my brain that “ I need to look like them NOW!”",
      "created_utc": 1743920546.0,
      "score": 1,
      "context": [
        {
          "id": "mlhfc5h",
          "author": "e36qunB",
          "body": "I like to be told i look too skinny or on verge of sick",
          "created_utc": 1743821878.0
        }
      ]
    },
    {
      "id": "mll5s9k",
      "author": "AmongUs-Pornhub",
      "body": "the most recent one being finding out my grandmother (64) is a few pounds heavier than me, shes extremely tiny and shorter than me so I assumed she was smaller in weight. Its wrong but I feel happy & want to do everything to stay the tinier one because were really not that far off.",
      "created_utc": 1743881883.0,
      "score": 2,
      "context": [
        {
          "id": "mll5ayi",
          "author": "AmongUs-Pornhub",
          "body": "I want to cut my breasts off, Ive eaten rotten fruit & entire batches of raw cookie dough (got sick 1/7? times, that 1 time was horrible, do not recommend), I get very jealous of small children, when I meet new people my mood towards them completely relies on their weight compared to mine, got genuinely suicidal when I got diagnosed with hypoglycemia bc that means ill have to eat breakfast or ill be low (never eaten breakfast, even before anorexia), I saw an extremely low bmi person irl for the first time last year during the worse of my ED & I couldn’t stop staring & comparing myself while simultaneously feeling bad for them, ive wanted to be in a toxic relationship where someone keeps me from gaining weight, & so much more but this is getting long 😭",
          "created_utc": 1743881715.0
        }
      ]
    },
    {
      "id": "mleb6eo",
      "author": "NoCaterpillar3919",
      "body": "then this post ain’t for you 🙏",
      "created_utc": 1743783757.0,
      "score": 2,
      "context": [
        {
          "id": "mldr8mt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1743777798.0
        }
      ]
    },
    {
      "id": "mlzv34e",
      "author": "NoCaterpillar3919",
      "body": "i disagree. i think it lets people voice some of the taboo things they think about and get it off their chest. i’ve certainly felt less alone reading these responses. it shows that we aren’t weird or different for thinking/feeling these things.\n\ni get that people find different things triggering. this topic of this post was outlined in the title so you didn’t have to open it if you didn’t think you were ready to read",
      "created_utc": 1744095097.0,
      "score": 1,
      "context": [
        {
          "id": "mlyojnu",
          "author": "ProfessionProof5284",
          "body": "I really don't think this post is healthy!!!! It's very triggering amd not funny at all. Sharing fooked up thoughts.. we should be supporting each other... not laughing at our ' disordered thoughts '",
          "created_utc": 1744075737.0
        }
      ]
    },
    {
      "id": "mlf22pl",
      "author": "jellosquasch",
      "body": "yes 100% this. the mindset of 'i dont even care if x happens maybe i deserve it' sucks so much but happens so often.",
      "created_utc": 1743791838.0,
      "score": 11,
      "context": [
        {
          "id": "mldklzu",
          "author": "jellosquasch",
          "body": "one time during a really bad binge day i went on a long walk outside my house. i didnt bring my pepper spray and i was just thinking 'i hope i get kidnapped or assaulted. maybe i'll be so traumatized i'll finally stop eating' i cried a lot that day.",
          "created_utc": 1743775757.0
        },
        {
          "id": "mlepekf",
          "author": "mor-cat",
          "body": "Me too, I’ve put myself at risk by walking alone in the dark at night after overeating and I didn’t hope that those things would happen to me, but it was more that I just didn’t care if someone hurt me. I was so angry at myself and thought that I deserved it for having no self control",
          "created_utc": 1743788022.0
        }
      ]
    },
    {
      "id": "mlkuzjw",
      "author": "unitedthursday",
      "body": "real! i did that with this hongkongese restaurant",
      "created_utc": 1743878196.0,
      "score": 3,
      "context": [
        {
          "id": "mldd1c5",
          "author": "unitedthursday",
          "body": "oh, i’m not the only one who gets those types of thoughts!\nlemme think, every time I get sick I hope that I stay sick for a while and lose appetite and lose weight. When I got Covid I was so hyped. There’s probably more that are more morbid.",
          "created_utc": 1743773232.0
        },
        {
          "id": "mli8e77",
          "author": "Eh_Alright___",
          "body": "Same, I got food poisoning for 2 weeks and considered going back to that poke restuarant in an attempt to get sick again.",
          "created_utc": 1743836866.0
        }
      ]
    },
    {
      "id": "mlet8pw",
      "author": "ScottishWidow64",
      "body": "My breasts are always the hardest place to lose weight. I am UW and my breasts are still huge.",
      "created_utc": 1743789160.0,
      "score": 18,
      "context": [
        {
          "id": "mlduk22",
          "author": "ScottishWidow64",
          "body": "That I want to cut my breasts off",
          "created_utc": 1743778777.0
        },
        {
          "id": "mlerny1",
          "author": "carnivorous_unicorns",
          "body": "I mean, it's not just trans people who do it for the looks.",
          "created_utc": 1743788682.0
        }
      ]
    },
    {
      "id": "mlf2x05",
      "author": "mouse-bites",
      "body": "True, like I know I’m fatphobic 100% but the moment you admit that you get torn apart. Although it’s ironic because I feel like most anorexics ARE fatphobic. I mean we are literally killing ourselves out of fear of being fat/gaining weight.",
      "created_utc": 1743792091.0,
      "score": 22,
      "context": [
        {
          "id": "mle4l5n",
          "author": "mouse-bites",
          "body": "I always wish I’d get food poisoning. I also often think that because I haven’t died yet, I must not be “that sick.” I also will admit that I have a lot of fatphobic thoughts and >!sometimes find myself physically repulsed when I’m near a fat person.!< it’s horrible, I know. I feel like a bad person for it but it’s so ingrained in me by the way my parents spoke about >!fat people!<. Like idk how to undo that bias.",
          "created_utc": 1743781768.0
        },
        {
          "id": "mles0ac",
          "author": "carnivorous_unicorns",
          "body": "Oh i assure you, a lot of people with EDs are actually fatphobic, both meaning hate/repulsion or literal fear. Its censorship that makes them keep it to themselves.",
          "created_utc": 1743788784.0
        }
      ]
    },
    {
      "id": "mlefftg",
      "author": "Panda_Melody",
      "body": "Me! Lmao I blew a full ride my first year. Didn’t go back till I was 25.",
      "created_utc": 1743785053.0,
      "score": 14,
      "context": [
        {
          "id": "mldjhe8",
          "author": "SomeInsPeep",
          "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
          "created_utc": 1743775393.0
        },
        {
          "id": "mledkbp",
          "author": "dave_ebubbles",
          "body": "Please be careful, I have heard many horror stories of other disordered people ending up failing their classes or/and dropping out after their disorder took over basically everything. It's incredibly difficult to balance a college workload while engaging in heavy restriction.",
          "created_utc": 1743784484.0
        }
      ]
    },
    {
      "id": "mlegfxr",
      "author": "Hallucin8in",
      "body": "Yes me currently. I burnt out",
      "created_utc": 1743785355.0,
      "score": 5,
      "context": [
        {
          "id": "mldjhe8",
          "author": "SomeInsPeep",
          "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
          "created_utc": 1743775393.0
        },
        {
          "id": "mledkbp",
          "author": "dave_ebubbles",
          "body": "Please be careful, I have heard many horror stories of other disordered people ending up failing their classes or/and dropping out after their disorder took over basically everything. It's incredibly difficult to balance a college workload while engaging in heavy restriction.",
          "created_utc": 1743784484.0
        }
      ]
    },
    {
      "id": "mler7ir",
      "author": "mor-cat",
      "body": "I had the same thing happen, I relapsed at the beginning of my first year and I was happy that my mom wasn’t around to tell me to eat. I had no energy, couldn’t get out of bed for class most days and I even fainted in my dorm bathroom. \n\nNot only will you be exhausted, but it inevitably interferes with your academics because it’s much more difficult to retain information when your body is just trying its best to survive. I count myself lucky that I didn’t fail out, but I did do very poorly and was extremely self conscious to the point that I couldn’t even bring myself to go to the dining hall without having an anxiety attack.",
      "created_utc": 1743788550.0,
      "score": 3,
      "context": [
        {
          "id": "mldjhe8",
          "author": "SomeInsPeep",
          "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
          "created_utc": 1743775393.0
        },
        {
          "id": "mledkbp",
          "author": "dave_ebubbles",
          "body": "Please be careful, I have heard many horror stories of other disordered people ending up failing their classes or/and dropping out after their disorder took over basically everything. It's incredibly difficult to balance a college workload while engaging in heavy restriction.",
          "created_utc": 1743784484.0
        }
      ]
    },
    {
      "id": "mlgalr6",
      "author": "NoCaterpillar3919",
      "body": "this is so true i’m on academic probation rn because i was too weak to properly complete my exams. brain fog was wildin",
      "created_utc": 1743806127.0,
      "score": 2,
      "context": [
        {
          "id": "mldjhe8",
          "author": "SomeInsPeep",
          "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
          "created_utc": 1743775393.0
        },
        {
          "id": "mledkbp",
          "author": "dave_ebubbles",
          "body": "Please be careful, I have heard many horror stories of other disordered people ending up failing their classes or/and dropping out after their disorder took over basically everything. It's incredibly difficult to balance a college workload while engaging in heavy restriction.",
          "created_utc": 1743784484.0
        }
      ]
    },
    {
      "id": "mlgqmh3",
      "author": "-Tricky-Vixen-",
      "body": "it's me, hi, in my dream course and struggling,",
      "created_utc": 1743812012.0,
      "score": 2,
      "context": [
        {
          "id": "mldjhe8",
          "author": "SomeInsPeep",
          "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
          "created_utc": 1743775393.0
        },
        {
          "id": "mledkbp",
          "author": "dave_ebubbles",
          "body": "Please be careful, I have heard many horror stories of other disordered people ending up failing their classes or/and dropping out after their disorder took over basically everything. It's incredibly difficult to balance a college workload while engaging in heavy restriction.",
          "created_utc": 1743784484.0
        }
      ]
    },
    {
      "id": "mlhs3rz",
      "author": "helianthus_0",
      "body": "Or college administrators kicking you out of school because a having you on campus is a liability.",
      "created_utc": 1743827857.0,
      "score": 1,
      "context": [
        {
          "id": "mldjhe8",
          "author": "SomeInsPeep",
          "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
          "created_utc": 1743775393.0
        },
        {
          "id": "mledkbp",
          "author": "dave_ebubbles",
          "body": "Please be careful, I have heard many horror stories of other disordered people ending up failing their classes or/and dropping out after their disorder took over basically everything. It's incredibly difficult to balance a college workload while engaging in heavy restriction.",
          "created_utc": 1743784484.0
        }
      ]
    },
    {
      "id": "mlfckqc",
      "author": "xbrosia93",
      "body": "Same; once I snuck a 3 sticks of butter in some cornbread mix that my family ate.",
      "created_utc": 1743795084.0,
      "score": -7,
      "context": [
        {
          "id": "mldrrki",
          "author": "Fluffy_Community2558",
          "body": "sometimes i despise my friends and gf because they are skinnier than me, as a form of jealousy. i try to feed everyone around me more calories by cooking for them with lots of oil, butter and sauces. sometimes im repulsed by looking at my family members who are bigger, and think “they let themselves go”.\nit’s such an awful disease, it has totally fucked up how i think and feel about the people around me, and i can’t do anything about it, the thoughts never go away :(",
          "created_utc": 1743777956.0
        },
        {
          "id": "mldtmte",
          "author": "Electronic-Tie-3622",
          "body": "meeee",
          "created_utc": 1743778504.0
        }
      ]
    },
    {
      "id": "mlinzw8",
      "author": "Electronic-Tie-3622",
      "body": "true 😭😭 i can’t win",
      "created_utc": 1743847120.0,
      "score": 5,
      "context": [
        {
          "id": "mldtr4x",
          "author": "Electronic-Tie-3622",
          "body": "i want to be in a coma so i don’t have to eat",
          "created_utc": 1743778538.0
        },
        {
          "id": "mlf72x2",
          "author": "None",
          "body": "yeah but you’ll be fed through tubes",
          "created_utc": 1743793358.0
        }
      ]
    },
    {
      "id": "mm72ejo",
      "author": "coldhardash",
      "body": "she doesnt - she's \"learning disabled\" (the term my family uses as traditional asians) and has been functioning at the level of a 7 yr old her whole life - i also suspect she has some form of bipolar as she goes thru \"manic\" and \"depressed\" stages but her having an ed has never appeared like that to me",
      "created_utc": 1744199317.0,
      "score": 1,
      "context": [
        {
          "id": "mlll805",
          "author": "coldhardash",
          "body": "i get upset cause ppl wont let me starve myself but they dont care if my great aunt only eats one meal a day and shes super thin (she just forgets to eat cause she has depressive episodes)",
          "created_utc": 1743887102.0
        },
        {
          "id": "mln6hyp",
          "author": "Sensasie",
          "body": "She probably actually has an ED",
          "created_utc": 1743909165.0
        }
      ]
    },
    {
      "id": "mm0mtrf",
      "author": "Laxjudgement",
      "body": "I’m sorry you struggle with those thoughts, but thank you for opening up and sharing. It helps to know i’m not the only person who feels that way.",
      "created_utc": 1744111875.0,
      "score": 2,
      "context": [
        {
          "id": "mlyp396",
          "author": "Laxjudgement",
          "body": "I struggle with major depressive disorder with SI. The thing that stops me from acting on these urges right now is that i feel i need to be at a lower weight first. If I’m not supposed to post about this I sincerely apologize.",
          "created_utc": 1744075936.0
        },
        {
          "id": "mlzm967",
          "author": "NoCaterpillar3919",
          "body": "i'm right there with you. sometimes i get motivation because i don't want the embalmer to see me unless im super underweight",
          "created_utc": 1744090126.0
        }
      ]
    },
    {
      "id": "mlnum3n",
      "author": "e36qunB",
      "body": "Fucking same godamn blessing and a curse i tell ya! Will power is a helluva drug",
      "created_utc": 1743921167.0,
      "score": 1,
      "context": [
        {
          "id": "mlhfc5h",
          "author": "e36qunB",
          "body": "I like to be told i look too skinny or on verge of sick",
          "created_utc": 1743821878.0
        },
        {
          "id": "mlnti0h",
          "author": "Plus-Weakness-7499",
          "body": "I get triggered when I see someone saying that to other people because it signals to my brain that “ I need to look like them NOW!”",
          "created_utc": 1743920546.0
        }
      ]
    },
    {
      "id": "mleh4aq",
      "author": "dave_ebubbles",
      "body": "Yeah, I'm about to go into my 3rd year and it's honestly been so difficult. I'm considering taking a gap year after my parents keep encouraging me to do it and pursue real treatment. It sucks because I know I could be out having fun, enjoying school and engaging in things that normal college kids do but can't because of this stupid disorder. I try to do some extracurriculars when I can and am in the honors program at my school, but it's so damn hard because I have no energy. I'm a STEM major so it's even worse when a lot of the homework is memorization-heavy and my brain is in the toilet.\n\nJust in general: There's no shame in taking a break and doing it at your own pace. There's no glory in being miserable and forcing yourself to tough it out. Nobody will judge you for taking a semester or two off, or even pursuing an alternative path to college altogether for a while.",
      "created_utc": 1743785558.0,
      "score": 10,
      "context": [
        {
          "id": "mldjhe8",
          "author": "SomeInsPeep",
          "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
          "created_utc": 1743775393.0
        },
        {
          "id": "mledkbp",
          "author": "dave_ebubbles",
          "body": "Please be careful, I have heard many horror stories of other disordered people ending up failing their classes or/and dropping out after their disorder took over basically everything. It's incredibly difficult to balance a college workload while engaging in heavy restriction.",
          "created_utc": 1743784484.0
        },
        {
          "id": "mlefftg",
          "author": "Panda_Melody",
          "body": "Me! Lmao I blew a full ride my first year. Didn’t go back till I was 25.",
          "created_utc": 1743785053.0
        }
      ]
    },
    {
      "id": "mll8l6n",
      "author": "ConfidentStrength999",
      "body": "Same, had a full ride but was forced to take a medical leave just before my first semester ended. That semester was so awful I couldn't imagine going back to that same college again.",
      "created_utc": 1743882855.0,
      "score": 1,
      "context": [
        {
          "id": "mldjhe8",
          "author": "SomeInsPeep",
          "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
          "created_utc": 1743775393.0
        },
        {
          "id": "mledkbp",
          "author": "dave_ebubbles",
          "body": "Please be careful, I have heard many horror stories of other disordered people ending up failing their classes or/and dropping out after their disorder took over basically everything. It's incredibly difficult to balance a college workload while engaging in heavy restriction.",
          "created_utc": 1743784484.0
        },
        {
          "id": "mlefftg",
          "author": "Panda_Melody",
          "body": "Me! Lmao I blew a full ride my first year. Didn’t go back till I was 25.",
          "created_utc": 1743785053.0
        }
      ]
    },
    {
      "id": "mlitd61",
      "author": "sea_its_relative_272",
      "body": "I’m assuming this got downvoted because if you’re a mother, then that’s doing harm upon your child (feeding them unhealthy things on purpose). But if you’re a childless person who gave the cornbread to older family members, that’s different. I hope it’s the latter.",
      "created_utc": 1743850529.0,
      "score": 4,
      "context": [
        {
          "id": "mldrrki",
          "author": "Fluffy_Community2558",
          "body": "sometimes i despise my friends and gf because they are skinnier than me, as a form of jealousy. i try to feed everyone around me more calories by cooking for them with lots of oil, butter and sauces. sometimes im repulsed by looking at my family members who are bigger, and think “they let themselves go”.\nit’s such an awful disease, it has totally fucked up how i think and feel about the people around me, and i can’t do anything about it, the thoughts never go away :(",
          "created_utc": 1743777956.0
        },
        {
          "id": "mldtmte",
          "author": "Electronic-Tie-3622",
          "body": "meeee",
          "created_utc": 1743778504.0
        },
        {
          "id": "mlfckqc",
          "author": "xbrosia93",
          "body": "Same; once I snuck a 3 sticks of butter in some cornbread mix that my family ate.",
          "created_utc": 1743795084.0
        }
      ]
    },
    {
      "id": "mm0nyj1",
      "author": "NoCaterpillar3919",
      "body": "i’m sorry too. you seem like a beautiful person, you’re never alone! 🤍",
      "created_utc": 1744112389.0,
      "score": 2,
      "context": [
        {
          "id": "mlyp396",
          "author": "Laxjudgement",
          "body": "I struggle with major depressive disorder with SI. The thing that stops me from acting on these urges right now is that i feel i need to be at a lower weight first. If I’m not supposed to post about this I sincerely apologize.",
          "created_utc": 1744075936.0
        },
        {
          "id": "mlzm967",
          "author": "NoCaterpillar3919",
          "body": "i'm right there with you. sometimes i get motivation because i don't want the embalmer to see me unless im super underweight",
          "created_utc": 1744090126.0
        },
        {
          "id": "mm0mtrf",
          "author": "Laxjudgement",
          "body": "I’m sorry you struggle with those thoughts, but thank you for opening up and sharing. It helps to know i’m not the only person who feels that way.",
          "created_utc": 1744111875.0
        }
      ]
    },
    {
      "id": "mlehia4",
      "author": "Panda_Melody",
      "body": "Absolutely zero shame in taking a break! School will happen when you’re ready! Plus not everyone even goes to school and you certainly don’t need it to have a good life (it does help tho)",
      "created_utc": 1743785673.0,
      "score": 7,
      "context": [
        {
          "id": "mldjhe8",
          "author": "SomeInsPeep",
          "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
          "created_utc": 1743775393.0
        },
        {
          "id": "mledkbp",
          "author": "dave_ebubbles",
          "body": "Please be careful, I have heard many horror stories of other disordered people ending up failing their classes or/and dropping out after their disorder took over basically everything. It's incredibly difficult to balance a college workload while engaging in heavy restriction.",
          "created_utc": 1743784484.0
        },
        {
          "id": "mlefftg",
          "author": "Panda_Melody",
          "body": "Me! Lmao I blew a full ride my first year. Didn’t go back till I was 25.",
          "created_utc": 1743785053.0
        },
        {
          "id": "mleh4aq",
          "author": "dave_ebubbles",
          "body": "Yeah, I'm about to go into my 3rd year and it's honestly been so difficult. I'm considering taking a gap year after my parents keep encouraging me to do it and pursue real treatment. It sucks because I know I could be out having fun, enjoying school and engaging in things that normal college kids do but can't because of this stupid disorder. I try to do some extracurriculars when I can and am in the honors program at my school, but it's so damn hard because I have no energy. I'm a STEM major so it's even worse when a lot of the homework is memorization-heavy and my brain is in the toilet.\n\nJust in general: There's no shame in taking a break and doing it at your own pace. There's no glory in being miserable and forcing yourself to tough it out. Nobody will judge you for taking a semester or two off, or even pursuing an alternative path to college altogether for a while.",
          "created_utc": 1743785558.0
        }
      ]
    },
    {
      "id": "mletzqj",
      "author": "mor-cat",
      "body": "There’s no shame in taking a break, I’m in my second year of a bio degree and it’s the same for me. The brain fog makes it so difficult to retain information which sucks because most of my classes are based on memorization. \n\nWhen I was at my worst I was in high school and it interfered with my studies for the same reason, I could hardly remember anything. I went from having straight A’s and being on honour roll to never showing up and getting low/failing grades. There was even a point where things were so bad that I quit school altogether. I did go back and ended up getting into uni, albeit 2 years late. \n\nI’m glad I took that break because I had a lot of issues that I needed to focus on, if I didn’t do that then I think I would’ve dropped out. I used to beat myself up for it but I’ve realized that I need to be kinder to myself because I had different circumstances from others and those circumstances prevented me from reaching my full potential.",
      "created_utc": 1743789379.0,
      "score": 4,
      "context": [
        {
          "id": "mldjhe8",
          "author": "SomeInsPeep",
          "body": "Excited about going away to college cause no one at home will know how little I’m gonna eat",
          "created_utc": 1743775393.0
        },
        {
          "id": "mledkbp",
          "author": "dave_ebubbles",
          "body": "Please be careful, I have heard many horror stories of other disordered people ending up failing their classes or/and dropping out after their disorder took over basically everything. It's incredibly difficult to balance a college workload while engaging in heavy restriction.",
          "created_utc": 1743784484.0
        },
        {
          "id": "mlefftg",
          "author": "Panda_Melody",
          "body": "Me! Lmao I blew a full ride my first year. Didn’t go back till I was 25.",
          "created_utc": 1743785053.0
        },
        {
          "id": "mleh4aq",
          "author": "dave_ebubbles",
          "body": "Yeah, I'm about to go into my 3rd year and it's honestly been so difficult. I'm considering taking a gap year after my parents keep encouraging me to do it and pursue real treatment. It sucks because I know I could be out having fun, enjoying school and engaging in things that normal college kids do but can't because of this stupid disorder. I try to do some extracurriculars when I can and am in the honors program at my school, but it's so damn hard because I have no energy. I'm a STEM major so it's even worse when a lot of the homework is memorization-heavy and my brain is in the toilet.\n\nJust in general: There's no shame in taking a break and doing it at your own pace. There's no glory in being miserable and forcing yourself to tough it out. Nobody will judge you for taking a semester or two off, or even pursuing an alternative path to college altogether for a while.",
          "created_utc": 1743785558.0
        }
      ]
    },
    {
      "id": "mlittir",
      "author": "xbrosia93",
      "body": "I am a mother but this was BEFORE I was a mother. Everyone who downvoted are hypocritical assholes",
      "created_utc": 1743850796.0,
      "score": 4,
      "context": [
        {
          "id": "mldrrki",
          "author": "Fluffy_Community2558",
          "body": "sometimes i despise my friends and gf because they are skinnier than me, as a form of jealousy. i try to feed everyone around me more calories by cooking for them with lots of oil, butter and sauces. sometimes im repulsed by looking at my family members who are bigger, and think “they let themselves go”.\nit’s such an awful disease, it has totally fucked up how i think and feel about the people around me, and i can’t do anything about it, the thoughts never go away :(",
          "created_utc": 1743777956.0
        },
        {
          "id": "mldtmte",
          "author": "Electronic-Tie-3622",
          "body": "meeee",
          "created_utc": 1743778504.0
        },
        {
          "id": "mlfckqc",
          "author": "xbrosia93",
          "body": "Same; once I snuck a 3 sticks of butter in some cornbread mix that my family ate.",
          "created_utc": 1743795084.0
        },
        {
          "id": "mlitd61",
          "author": "sea_its_relative_272",
          "body": "I’m assuming this got downvoted because if you’re a mother, then that’s doing harm upon your child (feeding them unhealthy things on purpose). But if you’re a childless person who gave the cornbread to older family members, that’s different. I hope it’s the latter.",
          "created_utc": 1743850529.0
        }
      ]
    },
    {
      "id": "mlitvvy",
      "author": "xbrosia93",
      "body": "This was 10 fucking years ago.",
      "created_utc": 1743850834.0,
      "score": 4,
      "context": [
        {
          "id": "mldrrki",
          "author": "Fluffy_Community2558",
          "body": "sometimes i despise my friends and gf because they are skinnier than me, as a form of jealousy. i try to feed everyone around me more calories by cooking for them with lots of oil, butter and sauces. sometimes im repulsed by looking at my family members who are bigger, and think “they let themselves go”.\nit’s such an awful disease, it has totally fucked up how i think and feel about the people around me, and i can’t do anything about it, the thoughts never go away :(",
          "created_utc": 1743777956.0
        },
        {
          "id": "mldtmte",
          "author": "Electronic-Tie-3622",
          "body": "meeee",
          "created_utc": 1743778504.0
        },
        {
          "id": "mlfckqc",
          "author": "xbrosia93",
          "body": "Same; once I snuck a 3 sticks of butter in some cornbread mix that my family ate.",
          "created_utc": 1743795084.0
        },
        {
          "id": "mlitd61",
          "author": "sea_its_relative_272",
          "body": "I’m assuming this got downvoted because if you’re a mother, then that’s doing harm upon your child (feeding them unhealthy things on purpose). But if you’re a childless person who gave the cornbread to older family members, that’s different. I hope it’s the latter.",
          "created_utc": 1743850529.0
        },
        {
          "id": "mlittir",
          "author": "xbrosia93",
          "body": "I am a mother but this was BEFORE I was a mother. Everyone who downvoted are hypocritical assholes",
          "created_utc": 1743850796.0
        }
      ]
    }
  ]
}