{
  "id": "1jtyt2r",
  "subreddit": "AnorexiaNervosa",
  "author": "AbsolutelyNot5555",
  "created_utc": 1744066553.0,
  "title": "Body image depends on how “good” I’ve been that day ??",
  "selftext": "This is kinda hard to explain but I’m sure some of you have the same kind of thing going on… if I’m “good” that day, in other words if I managed to restrict and I feel like a successful anorexic, then when I look in the mirror my body looks thin and I feel exhilarated and accomplished. However, if I’ve “failed” that day, ie ate too many calories, even if I’m just slightly over my set calories,  I look in the mirror and I look bigger. My legs are thicker, my stomach rounder, my arms larger. What the heck? anyone else?? ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1jtyt2r/body_image_depends_on_how_good_ive_been_that_day/",
  "score": 135,
  "num_comments": 15,
  "comments": [
    {
      "id": "mlxyuvs",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1744066554.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mly02yn",
      "author": "Fattyoftheyear",
      "body": "Literally SAMEEE. Working out has been the only way to combat this for me. Like even if I binge that day or something, I'm comforted when I remember I worked out, or I'll workout the next day",
      "created_utc": 1744066966.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mlzdt2b",
      "author": "Typical-Line8989",
      "body": "yes, drives me insane every single day, to the point i don’t think i actually KNOW what i look like, one “bad” meal and i can visibly see an extra 3kg of fat added to my face",
      "created_utc": 1744085798.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mlyo8ay",
      "author": "BasOutten",
      "body": "When it's explained this way, the link between perfectionism and anorexia is quite clear.\n\nIt's still strange that anorexia is feels like an accomplishment or goal though.",
      "created_utc": 1744075623.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mlzj904",
      "author": "WallflowerShakti",
      "body": "Absolutely this. And I've had so many doctors tell me bodies don't change that much in a day, but I SWEAR it does....",
      "created_utc": 1744088519.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mlzilsx",
      "author": "goodie-vibesss",
      "body": "Yep. I feel so skinny and confident when I’ve been “good” it’s a euphoric feeling. But damn bad days are so torturous and sometimes it’s bc I changed a routine or mealtime not even calories",
      "created_utc": 1744088183.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlxzgkl",
      "author": "Frosty_Swimming2676",
      "body": "Yes!  Every single day!",
      "created_utc": 1744066757.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mm09c90",
      "author": "Own_Sea5439",
      "body": "Yes. Your description is exactly how I feel.",
      "created_utc": 1744104424.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mmps6wu",
      "author": "Extension_Visit4654",
      "body": "100% been really struggling with this lately",
      "created_utc": 1744456704.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mo3v618",
      "author": "princessthrowawaypg",
      "body": "If I ate something the day before, I feel like i gained so much and it’s so crazy obvious and everyone definitely notices. My mind says it doesn’t make sense, but I’m looking right at it??",
      "created_utc": 1745164284.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlz8jsi",
      "author": "None",
      "body": "1000%. Feeling this way today actually",
      "created_utc": 1744083438.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm0qfbc",
      "author": "UYRDAD",
      "body": "body dysmorphia and EDs usually go hand and hand unfortunately ",
      "created_utc": 1744113469.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm6kvic",
      "author": "tvbee876",
      "body": "Yes! I also “feel” heavier even though I weigh the exact same.",
      "created_utc": 1744189980.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm8a60j",
      "author": "FitYouth1154",
      "body": "this is called body dysmorphia! it sucks i know",
      "created_utc": 1744213749.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlzjedm",
      "author": "WallflowerShakti",
      "body": "I have a hard time wearing fitted clothes, too... even if it's in my head.",
      "created_utc": 1744088597.0,
      "score": 3,
      "context": [
        {
          "id": "mlzdt2b",
          "author": "Typical-Line8989",
          "body": "yes, drives me insane every single day, to the point i don’t think i actually KNOW what i look like, one “bad” meal and i can visibly see an extra 3kg of fat added to my face",
          "created_utc": 1744085798.0
        }
      ]
    }
  ]
}