{
  "id": "1jwz93n",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1744402027.0,
  "title": "Medical complications I didn't think could happen because of anorexia",
  "selftext": "This disorder can cause so many medical complications. It can cause osteoporosis and bone loss. It can cause heart problems. And it can cause digestive issues and organ damage. I just did not realize that starving myself for years would cause such complex health issues. Because of chronic and untreated anorexia nervosa, my medical complications are hard to treat and really painful. Very early on in my disorder, it caused health issues. But because I was younger and went to treatment early, they were able to be reversed. But I never fully recovered after my inpatient treatments, meaning I did not do what they wanted me to do. I did not fully restore weight, I did not attend residential or outpatient treatment, and I did not continue to get treatment after leaving inpatient. Years later, I have severe and enduring anorexia. And it's affected my health in a lot of ways. One thing I didn't realize this illness could cause was that it can affect the way your body processes and absorbs nutrients from the food you eat. My doctor told me because I have starved myself for years, this has made it harder for me to eat and gain weight. When my body was healthier, I was able to eat and put on weight if I wanted. Now when I eat, it hurts my stomach, I get digestive issues, experience hunger after eating and notice that it's hard to get my weight up. The weight loss I experience now isn't intentional. Anorexia can cause GI issues but I wasn't aware it could be this bad. I get different answers from people. I've been told this is what happens when the illness is progressing towards end stage and the body can't handle food the way it used to. This illness is also affecting my bladder, something I never thought about when I was younger. I experience very painful and frequent urination, which is affecting my quality of life and basically keeps me staying at home a lot. It's the worst pain I've ever felt. Because of the pain I experience because of these symptoms, it's made me more depressed. I'm on palliative care for my anorexia. I am also being treated with outpatient treatment, but because my medical issues are so severe, I have not been able to find any relief from them. But if I could go back in time, I would have listened when people were telling me that this is a serious disorder and when left untreated, it can cause severe complications. I don't want to get worse. And I hope I can find a way to start feeling better. I may have to live with side effects from long term anorexia. I also have discomfort with the idea of being treated in a hospital type setting. I feel embarrassed about my symptoms and also struggle with the need for a routine, due to being autistic. And so whenever someone suggests that inpatient may be helpful, I remember how traumatizing my last treatments were and simply don't want to go through that again. I see a doctor, therapist and nutritionist, but I've been told my symptoms are too severe and they simply won't improve with just outpatient. But the idea of inpatient makes me so anxious. I wish there were more treatment options for complex health issues. And more options, in general, for those who are both autistic and anorexic. While no treatment is perfect, I face extra challenges because my brain responds differently to therapy and treatment, because of autism. Things like group therapy, new environments and new routines give me a lot of anxiety, and that's likely why I was never able to adjust to inpatient treatment. I've never been to residential but I think I would have a difficult time with it.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1jwz93n/medical_complications_i_didnt_think_could_happen/",
  "score": 202,
  "num_comments": 97,
  "comments": [
    {
      "id": "mmmdcww",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1744402027.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmmp1tk",
      "author": "yeaahhhhhhhhhhhh",
      "body": "Let me scare y’all even more. I was literally paralyzed to my elbows because of my eating disorder. It took 10 years to catch up to me and I got something called guillen barre syndrome from the stress I put on my body. PARALYZED you guys. Save yourselves 😭",
      "created_utc": 1744405631.0,
      "score": 109,
      "context": []
    },
    {
      "id": "mmms6nq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1744406655.0,
      "score": 30,
      "context": []
    },
    {
      "id": "mmn4q18",
      "author": "collectedd",
      "body": "I have a lot of things that have either been caused or worsened by my Anorexia Nervosa - it's hard to say what caused what considering I've got underlying genetic health issues but also have had AN since I was a young child.\n\nI've lost my hair, lost function in my bladder (Bladder Failure), Severe Gastroparesis, Osteoporosis, have brain atrophy/brain damage causing Ataxia, etc. \n\nIt's horrible.",
      "created_utc": 1744410937.0,
      "score": 30,
      "context": []
    },
    {
      "id": "mmn0gyc",
      "author": "PetitePretty1",
      "body": "Thank you so much for sharing this OP and to everyone else sharing their stories as well.\n\nI'm almost 42, and I have noticed over the past years especially that my body is really starting to feel like it's falling apart and I'm scared. I have a 10 yr old daughter who is severely autistic and developmentally disabled who needs care for the rest of her life. I need to be here as long as possible. I'm worried.",
      "created_utc": 1744409436.0,
      "score": 27,
      "context": []
    },
    {
      "id": "mmn9sae",
      "author": "garnetandjade",
      "body": "I have osteoporosis, prolonged QT syndrome which could lead to sudden death, ventricular enlargement, mitral valve prolapse, gastritis, small intestine inflammation, colitis, liver injury, kidney injury, have endured metabolic acidosis multiple times, have 4 good teeth and the rest need to be crowned or removed/implants, and I live in constant pain. I’ve had the disease for over 15 years, but the damage started EARLY. I agree… you don’t realize that it becomes nearly impossible to gain it back after a certain point. I hope the younger people on here can see this and they ask for help. I’m not pushing recovery on anyone, because I would be a hypocrite as I didn’t start to recover until I almost died, and am only several weeks into hospitalization. And btw, I almost died well OVER my lowest weight… you do not need to be skeletal to be actively dying. Fuck anorexia. Fuck this disease. I wish someone had intervened when I was young and crying out for help. I wish I could help even one single other person to say fuck this disorder",
      "created_utc": 1744412738.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mmmkw03",
      "author": "jabuticabatree",
      "body": "Commenting to boost post because I think people (esp younger ppl) need to read this! Thanks for sharing your story!",
      "created_utc": 1744404324.0,
      "score": 70,
      "context": []
    },
    {
      "id": "mmmwqum",
      "author": "nihilist_fox",
      "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
      "created_utc": 1744408168.0,
      "score": 43,
      "context": []
    },
    {
      "id": "mmnd7jx",
      "author": "LadyGraceOfThePits",
      "body": "I have a ton of medical complications as a result of my battle with anorexia, now recovered. But what I wish someone could have told me? You’ll never have children if you continue this. That would have stopped dead in my tracks. Unfortunately as a results of the damage I did I’ll never be able to have a child. And I am adopted too. So it’s even worse somehow",
      "created_utc": 1744413967.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mmnp9sa",
      "author": "mylostzebra",
      "body": "Tooth loss early , vision problems weakness \n\nAnd omg the horrid PATULOUS EARS after the fat grt eaten from the ear.  My bowel  bladder., energy \n\nBUT I have to say that it was mourning my time I lost in life. THATA IS eveb worse than the constant body parts falling apart because it hits you one day \"my life never mattered and won't '\nMy mental health was Way worse. \n. \nI began at 9. And I djnt cou t the years I was immersed in it as eveb being alive because I was just a body with no thoughts, ideas,plans, feelings that were only mine, they were me and my ED\nSo\nI wasn't alive from age 9 to 45. Minus 14.5 yeara jf recovery. \nTake note I said 45.\nIts a myrh that it cant come back   \nThere used to be very few people over 40 with and today its a growingnahe group,  old mellenials like me and gen x arenfull of ed \nOddly, we were the 90s boom ED of the comeback of twiggy. Now we hit 40 and we are at it ahain, sick and in pain and having body failing early all ober  . here we again at it. \nThere are horrible things its done physically. God wait till people start dealing with PET disorder . \nBut you begin thinking how useless this all was  \n\nAs we age we find out that most people are involved in their own heads about themselves.  \nAnd we live our life thinking we are center stage.  Wondering who noticed a gain . Who noticed a loss. \nFrankly NO ONE  And whoever does ,doesn't even care. \nIt's on our minds. The ed literally drives every thought, feeling,decision, action. \nBesides PET and loss of teeth , vision peeing, pooping etc \n\nThe WORST thing is that it took my whole life. \n\nI did nothing that matters. \nNo kids was scared to be fat.\nNo loving another person when your busy dealing with health issues so much you can't meat men and when u date it's exhausting.  \nAnd the thoughts that take over your brain. \n\nYou notice that other people around you really LIVE LIVES. \n\nThey are having moments that passed us because we are wrapped into this  \nWhen other laugh it's real laughs. When I laugh I hope I didn't look fat  in my stomach  . \nThey have actual fulfillment.  We don't we aren't in our brains and we can't be in our bodies  it's the ed that is. \nSo we are walking zombies \n\nI realized my whole life - is wasn't existing.\n\nI absolutely put nothing into this world. And what's even worse is there are so many people and even kids that are a part of this word and love life and it gets taken away from them ,but we are dead inside and falling apart but still stuck alive. \nTalk about feeling guilty. \nPeople get sick of you being sick and push away to go live life  \nWe go back into our heads with our ed  \nYou spend your life making your body the way you want it,  and during that time- WE LOST TIME.  \n \nJust When u get that perfect wieght and you love seeing all the bones, you start to fall apart.  \n.\nI wish I could go back in time during  14 years of real recovery.  But then there comes that relapse that was \"impossible\"\n\nI regret evey bit of time i wasted. I wanted to actually live a life of doing what would make an impact.  Get married and settle down. \n\nNo significant other wants to deal with the issues.  And when the health problems start those vows suddenly mean crap cuy you are dragging them down.  \nIt just made my vidy fall apart early  \n\nAnd again- the actual QUESTION IS.... WHAT MAKES BEING TOO THIN MY IDENTITY? WHEN DID THAT HAPPEN AND WHERE DID I GO? \n\n So what did we do it for if it got us nothing in life. Not money not love not happiness not changing anything for the good. We didn't participate. \n\nI lost not just a physical body ,but I never had an actual life to live because it ruined everything and it wasn't ME. It was the ed living it. \n\nMourning is the worst thing.  But patulous ear is really something that will drive you mad",
      "created_utc": 1744418452.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mmp90tu",
      "author": "RinkyInky",
      "body": "Anyone find that the bone loss, soft tissue weakness and muscle weakness causes your face to droop too and give you a melted face look?",
      "created_utc": 1744444977.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mmuy32q",
      "author": "Afraid-Firefighter92",
      "body": "My body has faced the consequences of atypical anorexia. I’m going to be blunt and real when I write this because I wish I had someone tell me this. \n\nI was never hospitalized, never under weight by medical criteria (actually was still considered obese at the height of my disorder on the BMI scale), never inpatient, always outpatient treatments. I do now have long lasting chronic health conditions from this cruel disease. After 10 years of off and on relapses and now five years of solid recovery, I now struggle with gastroparesis, acid reflex disease, gallbladder taken out due to a sluggish gallbladder (my gallbladder basically was dying because I was not eating and using it), kidney stones and now kidney injury, high liver enzymes and now fibrosis of the liver, chronic bladder pain and constant need to urinate (interstitial cystitis now I have to monitor what I eat so it does not flare up 🤦🏻‍♀️. Now that I want to eat I can’t eat certain foods that are too acidic), pelvic floor dysfunction (hurts to have sex and I have to wear daily pads incase I urinate on myself while laughing or coughing-yes, purging can cause this. It ruins your abdominal core), chronic pain from nerve damage, chronic low iron (nothing will bring my iron/ferritin levels up), brain damage that I now have to go to rehabilitation for memory problems I never had before (I have a PhD and my memory is now failing me from my brain atrophying during the years I starved myself. My brain is smaller than average. No educational degree will reverse this.), small fractures throughout the years out of no where (legit fractured my foot when stepping off a curb. The embarrassment I felt going to the ER because I stepped off a curb too hard and fractured my foot 🤦🏻‍♀️), abdominal hernia repair surgery from purging (yes, this happens and extremely painful recovery), reactive hypoglycemia, and now heart issues I just found out about last month that may not be fixable. \n\nSo no, you don’t have to be UW or have had numerous or even one inpatient stay or IOP or PHP treatment to experience any of these consequences. I’ve been in recovery for five years and my body is still trying to catch up and falling apart at the same time. I truly wish someone would have advised my mother and me of the consequences of chronic dieting growing up since 10 years old (this is when my mother enrolled me in weight watchers but always had my food monitored since I was a “chubby” kid) and then developing a 10 off and on year long battle with an eating disorder starting at 18. Instead, unfortunately, I was always told I needed to lose weight by medical professionals. My body NEEDED that weight. Oh, I’m also the shortest one in my family so there’s that too (growth restriction). \n\nYou are not immune from these consequences. I thought I was the exception. I kept telling myself this was okay. This is what doctors told me to do. Thought if I have a wonderful career, a PhD, (humbling stating the following to give an example) a decent income for a single middle aged woman, all my needs and wants met-I would be okay. I would tell myself I NEEDED my ED to cope to get where I am today and then I’ll be okay and it will magically go away with no consequences. Nope…I hit 30 and all my health issues started and I had been IN RECOVERY for two years before this and I am still paying the consequences to this day. \n\nI’m up right now at 2 am typing this with severe acid reflux and unable to sleep because I had vegetables with my dinner. Yes, vegetables. I can’t sleep because my stomach is on fire. Already took all the medication I can to no avail. \n\nPLUS what hurts the most is the years I wasted on this terrible disease and how much I suffered. The money spent on healthcare is in the six figures WITH insurance here in the US and this isn’t all my outpatient treatment copays and out of pocket expenses with my specialized psychologist and dietician for the last 8 years. \n\nGet help NOW, please. Even if it’s just having one “extra” food item a day to start. If not for you, but for the people before you telling you this WILL be your life in the years to come. The consequences do not discriminate.",
      "created_utc": 1744527214.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mmnrfzu",
      "author": "honkyg666",
      "body": "My 14 yo daughter is in the recovery process currently and happened to see my notes about scheduling a bone scan for her. She asked why and I told her the doc said she may have caused enough damage that we need to have her checked out before she can ski or skateboard etc because her bones may have been compromised and she just cried that she wished she knew more of the consequences before allowing herself down this road.  Breaks my heart. \n\nI wish all of you the very best in your own battles.",
      "created_utc": 1744419282.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mmnjjys",
      "author": "turnipkitty112",
      "body": "I totally empathize with your experience. People think “oh well if this sucks for you so much then go to a higher level of care and get better” and how do I explain the clinical PTSD I’ve gotten from repeated, horrific IP experiences? I’m also autistic and I truly cannot think of a *worse* environment for an autistic person than ED inpatient. \n\nI also have bladder issues from my anorexia, namely incontinence and interstitial cystitis. I never dare speak of it bc of the horror and stigma it would provoke from others. I also never expected to get weird neurological issues - it’s probably a cervical nerve impingement (more testing needed) but I get painful electric shocks down my back and arms, and it happens whenever I swallow anything. Eating is painful in ways I could have never anticipated. I don’t *know* that it’s from my ED but that seems the most likely explanation. Don’t get me started on the chronic pain. I’m in my 20s, I shouldn’t be feeling like this. I can’t ask for help because I either hear “well duh, it’s just your ED, you should gain some weight and it’ll go away”, or “haha just wait until you get to my age, you don’t know what pain is!”",
      "created_utc": 1744416286.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mmqrvdq",
      "author": "Shuyuya",
      "body": "For me what limited the disease was the brain damages from lack of nutrients and water. The rest idc.",
      "created_utc": 1744470496.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmqu3xo",
      "author": "LangGetaways",
      "body": "That sounds horrendous. I'm so sorry this disorder took so much from you. Thank you for sharing to younger people with AN\n💞",
      "created_utc": 1744471219.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmqxj8j",
      "author": "BallSufficient5671",
      "body": "Does anyone have the problem with the 24/7 feeling hot all the time? Where you are just so overheated that you have complete heat intolerance like worse than a menopausal woman? ",
      "created_utc": 1744472314.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmu5zi1",
      "author": "ActivityIll8075",
      "body": "Yep, I struggle to pee bc my muscles are so weak, I have severe diarrhea at times, everything I eat immediately comes out the other end, my rectum literally prolapsed, I have painful nerve damage, constant pins and needles that won't go away, my body basically refuses to produce white blood cells, the list could go on forever but yes, anorexia is an awful disease and it WILL severely damage your body (including your brain)",
      "created_utc": 1744513106.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmuvysr",
      "author": "Original-Society-768",
      "body": "I’ve have dealt with similar issues when i come to digesting food. i have always dealt with severe nausea for most of my life but i have also a lot more in the last few years have experienced extreme cramping after i eat and i have found that sometimes heat helps which is what helped me in a residential treatment but it sometimes makes eating out and places that aren’t home really hard cause i can’t just lay down if i need to. i have also experienced really bad tearing as well which has made it hard to feel like i can have any type of normal sex life and also makes me question what other things it may affect. i don’t know if it will fully get better i hope it does in general but also know that anoxia and starving ourselves is not a way to live even though it has felt that way for so long and I just want to say that i am so proud of you and any progress you have made because it is huge regardless of what anyone else says!",
      "created_utc": 1744525944.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmxwtia",
      "author": "Knot0001",
      "body": "I am sorry for everything you qent through and still going through. Anorexia is so severe and damaging ilness. I'm suffering from it for 20 years, also irreversible damage to different organs and it was never ever on my mind that could happen. Not even doctors told me.\nI was once falling into coma because of hypoglycemia and that's shit. Not once I almost died but yet, now, I still don't wish to recover because that's for now my only coping mechanism because of CPTSD and I have autism too.",
      "created_utc": 1744571279.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mn38bza",
      "author": "SchoolDistinct3820",
      "body": "Thank you for sharing your story. Ed causes so many health issues. My acid reflux got so bad it was dissolving my teeth and popping off my root canals. I had some health issues as a child but Ed added more and made the ones I have so much worse.\n\n\nI understand about asd, I'm audhd. I've got to the point with Ed where I'm like f societies weight bs I just want to be healthy and happy; still a stuggle though but I pray a lot. You should look into somantic therapy and emdr; they tend to be more helpful for neurodivergants. With routine try to add food into your established routine. Since Ive been feeling sick eating food I make sure to drink an ensure in the morning. I know I have to have a meal with my vitamins so I force myself to have at least one big meal a day when feeling sick. I'll also put collagen in my drinks. \n\n\nI'm glad you're seeing a doctor, therapist and nutritionist. Have you explained your concerns being asd and doing inpatient. They are your team so they need to listen and be working with you to get better (if one isnt listening or helping get a new one). Remember you need to be your biggest advocate or bring one with you. See if you can draft up an inpatient type environment to do at home with them. There's so many resources to help yourself at home especially with the internet. Online therapy, virtual support groups, audiobooks, YouTube, somantic exercises, journaling, meditation and prayer, etc. Work with them to add things onto your established routine that'll help. \n\n\nIt does suck there aren't more places for us. Hopefully one day we'll get there. What matters most now though is your life and health. If you won't be able to help yourself at home then you'll need to go to inpatient. I completely understand the anxiety about unfamiliar places and out of routine. Call around to places (or have someone who understands and loves you) and ask how they accommodate someone with autism and ed. Ask all your questions and find the best fit for you. You'll need to get real honest with yourself if you'll be able to work on your healing at home or if you can't and need inpatient. Listen to your intuition and try to ignore the fear. Your goal is getting better.\n\n\nYou were determined to get to your goal weight. You are strong and resilient going through life with asd and how the world treats us. Now focus that determination, strength and resilience on getting better, helping yourself and getting the right help. I will be praying for you 🙏 I wish you all the best on the path forward. You can do this! ",
      "created_utc": 1744649914.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmn5i9i",
      "author": "hangry_witch",
      "body": "I see you. This disease is deadly, plus you have to include other health issues or symptoms, environment, social conditioning, and inadequate treatment.\n\nOne health condition I have is called painful bladder syndrome, and it took nearly a decade to fail all the treatments and get an implant in my back that disrupts the pain to my bladder. Surprisingly, Amatriptaline (an old school antidepressant) is used off-label for bladder pain, and pelvic floor therapy helped me a lot.\n\nIf you have not seen a urogynocologist yet, I encourage you to see one for testing just to rule out issues with your bladder. \n\nI tried voluntary inpatient and was illegally detained and prolapsed my anus because the Eating Disorder hospital would not allow me proper stool softners after a pelvic floor reconstruction surgery I'm never going inpatient again and they were dicks about my Xanax prescription which lead to siezures.  It was so inhumane, and they falsified their billing, so I contacted the VAs fraud, waste, and abuse line for my concerns. They charged $7 k a night but would not help with eating, played games at meal time, no individual therapy, just one group therapy exercise where we wrote how similar we are to pigs.\n\nI also can't absorb or convert what I eat or take and that's how my mom was when she died of heart issues from anorexia so I get frustrated.",
      "created_utc": 1744411222.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mmmsl1z",
      "author": "None",
      "body": "My favorite warning to give people who can turn back now is METABOLIC SYNDROME IS REAL AND IT CAN BE LONG TERM OR PERMANENT. I have it. I am fat now and there’s zero disordered behaviors that can “fix” it. My body simultaneously blows through anything I give it (if I don’t shit it out first) AND has no idea what to do with it so it just sits there on my body. It’s not fun. It’s incredibly dysphoric. We’re talking a lifetime of unstable blood sugar, heart palpitations bc while my metabolism is constantly in the on position it does nothing but make me exhausted, unreliable digestion including DAILY diarrhea and needing to always be near a bathroom. If you think you hate food now just wait until it causes you immediate pain but you HAVE TO eat frequently or feel like death. Nausea, hot flashes, headaches… it makes your body so time consuming. \n\nIt’s manageable eventually but this will be my life for the foreseeable future if not forever and it’s not something I’d wish on anyone.",
      "created_utc": 1744406787.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mmqxelj",
      "author": "BallSufficient5671",
      "body": "I've had anorexia for 30 years now and I am 40 almost 41.And I can tell you that I have so many medical complications.It's unreal. I have severe osteoporosis , elevated liver enzymes and Permanent damage in both my brain and body. The worst part for me is I have what's called hypothemic dysfunction from the years of no periods and anorexia making my hypothesis not be able to regulate my temperature. \nThey want me to go to treatment again and gain weight to see if that hotness will go away with wt gain treatment. But I was told by endocrinologist and gynecologist who aren't Ed specialists if course thatvmy hypothalmus dysfunctuon may never be fixable and that the severe heat intolerance and feeling severely hot 24/7 may nit go away even with wt gain. \n\n\nSo that is what is keeping me from getting treatment again?Is I feel like what's the point if they're saying that that won't get better? Also i've been to impatient treatment five times in my life and it's never helped anything before. But back then I didn't have this symptom. ",
      "created_utc": 1744472273.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mmyuvww",
      "author": "square-marbles",
      "body": "Yep. 2 heart attacks before the age of 40 have put me in my place. This shit sucks and it’s embarrassing as hell.",
      "created_utc": 1744582439.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mmno5j6",
      "author": "shakethedisease666",
      "body": "The worst thing I suffer with when being treated inpatient or outpatient is they would always consider my avoidance of foods automatically as “bad relationship with food” even if my issue was a texture issue. I can eat anything as long as it does have a cold slimy texture or smell like/feel like eggs. I was punished for this. Every time I explained and they still punished me for this.",
      "created_utc": 1744418020.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmmpt5q",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing. This is an awful disorder and it can cause so many medical issues.",
      "created_utc": 1744405879.0,
      "score": 26,
      "context": [
        {
          "id": "mmmp1tk",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Let me scare y’all even more. I was literally paralyzed to my elbows because of my eating disorder. It took 10 years to catch up to me and I got something called guillen barre syndrome from the stress I put on my body. PARALYZED you guys. Save yourselves 😭",
          "created_utc": 1744405631.0
        }
      ]
    },
    {
      "id": "mmyn2yz",
      "author": "lesbianteengirl",
      "body": "Fucking paralysed? Bloody hell i…..",
      "created_utc": 1744579805.0,
      "score": 3,
      "context": [
        {
          "id": "mmmp1tk",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Let me scare y’all even more. I was literally paralyzed to my elbows because of my eating disorder. It took 10 years to catch up to me and I got something called guillen barre syndrome from the stress I put on my body. PARALYZED you guys. Save yourselves 😭",
          "created_utc": 1744405631.0
        }
      ]
    },
    {
      "id": "mnkyewv",
      "author": "helpicantchooseanam3",
      "body": "omg lovely i’m sorry, i hope you’re doing at least a little better❤️‍🩹 that sounds so scary, especially since ED’s looooove the control aspect. thank you for sharing your experience with us! for what it’s worth, your comment is one of the only things that’s made me really, TRULY, consider putting a few pounds back on. thank you🩷",
      "created_utc": 1744896579.0,
      "score": 3,
      "context": [
        {
          "id": "mmmp1tk",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Let me scare y’all even more. I was literally paralyzed to my elbows because of my eating disorder. It took 10 years to catch up to me and I got something called guillen barre syndrome from the stress I put on my body. PARALYZED you guys. Save yourselves 😭",
          "created_utc": 1744405631.0
        }
      ]
    },
    {
      "id": "mmyuzds",
      "author": "square-marbles",
      "body": "Fuuuuuuuuuck i am so sorry dude. That sounds awful and terrifying. :(",
      "created_utc": 1744582473.0,
      "score": 2,
      "context": [
        {
          "id": "mmmp1tk",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Let me scare y’all even more. I was literally paralyzed to my elbows because of my eating disorder. It took 10 years to catch up to me and I got something called guillen barre syndrome from the stress I put on my body. PARALYZED you guys. Save yourselves 😭",
          "created_utc": 1744405631.0
        }
      ]
    },
    {
      "id": "mmr62q8",
      "author": "MetalingusMikeII",
      "body": "Is that caused by B12 deficiency?",
      "created_utc": 1744474977.0,
      "score": 2,
      "context": [
        {
          "id": "mmmp1tk",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Let me scare y’all even more. I was literally paralyzed to my elbows because of my eating disorder. It took 10 years to catch up to me and I got something called guillen barre syndrome from the stress I put on my body. PARALYZED you guys. Save yourselves 😭",
          "created_utc": 1744405631.0
        }
      ]
    },
    {
      "id": "mmmsuzk",
      "author": "Coffeegreysky12",
      "body": "Thank you. I am sorry you have health complications too. These things need to be talked about more, for sure",
      "created_utc": 1744406878.0,
      "score": 9,
      "context": [
        {
          "id": "mmms6nq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1744406655.0
        }
      ]
    },
    {
      "id": "mmuwbdn",
      "author": "Original-Society-768",
      "body": "I have dealt with not huge but also some significant memory issues and have sometimes dealt with vision issues on top of already being near sided and needing glasses which honestly i wouldn’t be fully surprised if me struggling with an eating disorders for so long has effected.",
      "created_utc": 1744526154.0,
      "score": 3,
      "context": [
        {
          "id": "mmms6nq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1744406655.0
        }
      ]
    },
    {
      "id": "mmn54gv",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing what you are dealing with and I hope you start feeling better. Yes, anorexia will so many things worse",
      "created_utc": 1744411081.0,
      "score": 3,
      "context": [
        {
          "id": "mmn4q18",
          "author": "collectedd",
          "body": "I have a lot of things that have either been caused or worsened by my Anorexia Nervosa - it's hard to say what caused what considering I've got underlying genetic health issues but also have had AN since I was a young child.\n\nI've lost my hair, lost function in my bladder (Bladder Failure), Severe Gastroparesis, Osteoporosis, have brain atrophy/brain damage causing Ataxia, etc. \n\nIt's horrible.",
          "created_utc": 1744410937.0
        }
      ]
    },
    {
      "id": "mmn5c88",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing what you are experiencing and I hope you start feeling better.",
      "created_utc": 1744411160.0,
      "score": 5,
      "context": [
        {
          "id": "mmn4q18",
          "author": "collectedd",
          "body": "I have a lot of things that have either been caused or worsened by my Anorexia Nervosa - it's hard to say what caused what considering I've got underlying genetic health issues but also have had AN since I was a young child.\n\nI've lost my hair, lost function in my bladder (Bladder Failure), Severe Gastroparesis, Osteoporosis, have brain atrophy/brain damage causing Ataxia, etc. \n\nIt's horrible.",
          "created_utc": 1744410937.0
        }
      ]
    },
    {
      "id": "mmn1jhd",
      "author": "Coffeegreysky12",
      "body": "You are welcome. I'm sorry you are having a difficult time also.",
      "created_utc": 1744409806.0,
      "score": 6,
      "context": [
        {
          "id": "mmn0gyc",
          "author": "PetitePretty1",
          "body": "Thank you so much for sharing this OP and to everyone else sharing their stories as well.\n\nI'm almost 42, and I have noticed over the past years especially that my body is really starting to feel like it's falling apart and I'm scared. I have a 10 yr old daughter who is severely autistic and developmentally disabled who needs care for the rest of her life. I need to be here as long as possible. I'm worried.",
          "created_utc": 1744409436.0
        }
      ]
    },
    {
      "id": "n3x7s00",
      "author": "DependentSecure",
      "body": "I am relatively new to Reddit, so don’t know if you will receive this message…. As a Mum with a lifetime ED and chronic pain/ early arthritis , semi-disability etc… I am concerned for you and want to lend you as much strength as I have to give. Our children give us a reason to live.. to live well, or at least better for their sake. i would never want to model my lifetime protective/prohibitive habits to my children… I am thankful everyday that i have boys and not girls, because they have been less affected by my daily half-hidden habits, and I have friends in similar circumstances, with girls, with even more issues family-wide.. My boys know I’m screwed up over it, despite how much i have tried to keep it to myself- ironically they’re partners are always on the edge of a full blown ED- this makes me so sad for the perpetuation of bad health habits over generations of families. My children would still love me 30- 50 lbs heavier; however, i fight to love myself at a semi-under, functional weight after over 40 years of ED… I only wish that we could have normal family dinner afternoons or gameday treats etc… As much as i have tried to protect them, my kids have been fundamentally affected by my own bad habits. If this message reaches you, and/or anyone with young children/ teenagers, please know that the better you can treat yourself, the better that your children will be in the long run. it’s the best reason to treat yourself better, lean into health and also give yourself Grace.",
      "created_utc": 1752888750.0,
      "score": 1,
      "context": [
        {
          "id": "mmn0gyc",
          "author": "PetitePretty1",
          "body": "Thank you so much for sharing this OP and to everyone else sharing their stories as well.\n\nI'm almost 42, and I have noticed over the past years especially that my body is really starting to feel like it's falling apart and I'm scared. I have a 10 yr old daughter who is severely autistic and developmentally disabled who needs care for the rest of her life. I need to be here as long as possible. I'm worried.",
          "created_utc": 1744409436.0
        }
      ]
    },
    {
      "id": "mmnaayg",
      "author": "Coffeegreysky12",
      "body": "Yes, this is an awful disorder. I'm sorry for all that you have gone through. I hope people see my post and reach out for help.",
      "created_utc": 1744412922.0,
      "score": 2,
      "context": [
        {
          "id": "mmn9sae",
          "author": "garnetandjade",
          "body": "I have osteoporosis, prolonged QT syndrome which could lead to sudden death, ventricular enlargement, mitral valve prolapse, gastritis, small intestine inflammation, colitis, liver injury, kidney injury, have endured metabolic acidosis multiple times, have 4 good teeth and the rest need to be crowned or removed/implants, and I live in constant pain. I’ve had the disease for over 15 years, but the damage started EARLY. I agree… you don’t realize that it becomes nearly impossible to gain it back after a certain point. I hope the younger people on here can see this and they ask for help. I’m not pushing recovery on anyone, because I would be a hypocrite as I didn’t start to recover until I almost died, and am only several weeks into hospitalization. And btw, I almost died well OVER my lowest weight… you do not need to be skeletal to be actively dying. Fuck anorexia. Fuck this disease. I wish someone had intervened when I was young and crying out for help. I wish I could help even one single other person to say fuck this disorder",
          "created_utc": 1744412738.0
        }
      ]
    },
    {
      "id": "mqze1k5",
      "author": "Independent-Shoe594",
      "body": "I have metabolic acidosis at the moment. How did you treat it, I’m scared?",
      "created_utc": 1746577399.0,
      "score": 1,
      "context": [
        {
          "id": "mmn9sae",
          "author": "garnetandjade",
          "body": "I have osteoporosis, prolonged QT syndrome which could lead to sudden death, ventricular enlargement, mitral valve prolapse, gastritis, small intestine inflammation, colitis, liver injury, kidney injury, have endured metabolic acidosis multiple times, have 4 good teeth and the rest need to be crowned or removed/implants, and I live in constant pain. I’ve had the disease for over 15 years, but the damage started EARLY. I agree… you don’t realize that it becomes nearly impossible to gain it back after a certain point. I hope the younger people on here can see this and they ask for help. I’m not pushing recovery on anyone, because I would be a hypocrite as I didn’t start to recover until I almost died, and am only several weeks into hospitalization. And btw, I almost died well OVER my lowest weight… you do not need to be skeletal to be actively dying. Fuck anorexia. Fuck this disease. I wish someone had intervened when I was young and crying out for help. I wish I could help even one single other person to say fuck this disorder",
          "created_utc": 1744412738.0
        }
      ]
    },
    {
      "id": "mmmlfwh",
      "author": "Coffeegreysky12",
      "body": "You are welcome",
      "created_utc": 1744404496.0,
      "score": 13,
      "context": [
        {
          "id": "mmmkw03",
          "author": "jabuticabatree",
          "body": "Commenting to boost post because I think people (esp younger ppl) need to read this! Thanks for sharing your story!",
          "created_utc": 1744404324.0
        }
      ]
    },
    {
      "id": "mmmydf4",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing what you've gone through. This disorder causes so many health issues. Yes, this disorder will make everything in life so much more difficult. I dislike how it gets romanticized too. There's nothing glamorous about it. It slowly takes away so much away from the person going through it. I have a pretty good support system around me which keeps me from feeling alone. But it's really an all consuming disorder. I wish I could go back in time and talk to my younger self. I'm trying to stay positive, but some days, it's not easy. I hope we can both start to feel better.",
      "created_utc": 1744408716.0,
      "score": 13,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        }
      ]
    },
    {
      "id": "mmqymzu",
      "author": "BallSufficient5671",
      "body": "To you too have hypothetic dysfunction which is where your body can't regulate its temperature and you're hot all the time? Because I am never cold anymore ever...it's that i'm always severely hot with hotness 24/7 and severe heat intolerance. \n\n\nMy endocrinologist and gynecologist are not eating disorder specialists but they believe that this is due to my anorexia turning off my hypothesis from regulating properly causing the hotness. The problem is they're not sure that with me having this for thirty years , if weight gain would even turn my hypothalmus back on and get it to work properly and take my severe hotness and heat intolerance away. So obviously i'm afraid to detreatment again unless I knew that that would actually fix itself. Plus i've been impatient five times so i've used all my insurance and money already. \n\n\nSo do you have this severe heat intolerance and feeling hot all the time? Has your doctors told you if weight gain would make this symptom go away and regulate your hypothesis? My drs don't know. Does yours?",
      "created_utc": 1744472656.0,
      "score": 3,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        }
      ]
    },
    {
      "id": "mmt51yl",
      "author": "Glamour-Ad7669",
      "body": "Do you know what’s the cause of what you write in the first part? Because same and I’m so confused",
      "created_utc": 1744498519.0,
      "score": 2,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        }
      ]
    },
    {
      "id": "mmndluk",
      "author": "Coffeegreysky12",
      "body": "Well said",
      "created_utc": 1744414113.0,
      "score": 3,
      "context": [
        {
          "id": "mmnd7jx",
          "author": "LadyGraceOfThePits",
          "body": "I have a ton of medical complications as a result of my battle with anorexia, now recovered. But what I wish someone could have told me? You’ll never have children if you continue this. That would have stopped dead in my tracks. Unfortunately as a results of the damage I did I’ll never be able to have a child. And I am adopted too. So it’s even worse somehow",
          "created_utc": 1744413967.0
        }
      ]
    },
    {
      "id": "n3xan73",
      "author": "DependentSecure",
      "body": "I am profoundly sorry for your circumstances- medicine 20-30 years ago, certainly never have considered these ramifications.",
      "created_utc": 1752889842.0,
      "score": 2,
      "context": [
        {
          "id": "mmnd7jx",
          "author": "LadyGraceOfThePits",
          "body": "I have a ton of medical complications as a result of my battle with anorexia, now recovered. But what I wish someone could have told me? You’ll never have children if you continue this. That would have stopped dead in my tracks. Unfortunately as a results of the damage I did I’ll never be able to have a child. And I am adopted too. So it’s even worse somehow",
          "created_utc": 1744413967.0
        }
      ]
    },
    {
      "id": "mmnqa86",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing. Eating disorders take away so much and give nothing in return. I regret not getting help sooner.",
      "created_utc": 1744418839.0,
      "score": 5,
      "context": [
        {
          "id": "mmnp9sa",
          "author": "mylostzebra",
          "body": "Tooth loss early , vision problems weakness \n\nAnd omg the horrid PATULOUS EARS after the fat grt eaten from the ear.  My bowel  bladder., energy \n\nBUT I have to say that it was mourning my time I lost in life. THATA IS eveb worse than the constant body parts falling apart because it hits you one day \"my life never mattered and won't '\nMy mental health was Way worse. \n. \nI began at 9. And I djnt cou t the years I was immersed in it as eveb being alive because I was just a body with no thoughts, ideas,plans, feelings that were only mine, they were me and my ED\nSo\nI wasn't alive from age 9 to 45. Minus 14.5 yeara jf recovery. \nTake note I said 45.\nIts a myrh that it cant come back   \nThere used to be very few people over 40 with and today its a growingnahe group,  old mellenials like me and gen x arenfull of ed \nOddly, we were the 90s boom ED of the comeback of twiggy. Now we hit 40 and we are at it ahain, sick and in pain and having body failing early all ober  . here we again at it. \nThere are horrible things its done physically. God wait till people start dealing with PET disorder . \nBut you begin thinking how useless this all was  \n\nAs we age we find out that most people are involved in their own heads about themselves.  \nAnd we live our life thinking we are center stage.  Wondering who noticed a gain . Who noticed a loss. \nFrankly NO ONE  And whoever does ,doesn't even care. \nIt's on our minds. The ed literally drives every thought, feeling,decision, action. \nBesides PET and loss of teeth , vision peeing, pooping etc \n\nThe WORST thing is that it took my whole life. \n\nI did nothing that matters. \nNo kids was scared to be fat.\nNo loving another person when your busy dealing with health issues so much you can't meat men and when u date it's exhausting.  \nAnd the thoughts that take over your brain. \n\nYou notice that other people around you really LIVE LIVES. \n\nThey are having moments that passed us because we are wrapped into this  \nWhen other laugh it's real laughs. When I laugh I hope I didn't look fat  in my stomach  . \nThey have actual fulfillment.  We don't we aren't in our brains and we can't be in our bodies  it's the ed that is. \nSo we are walking zombies \n\nI realized my whole life - is wasn't existing.\n\nI absolutely put nothing into this world. And what's even worse is there are so many people and even kids that are a part of this word and love life and it gets taken away from them ,but we are dead inside and falling apart but still stuck alive. \nTalk about feeling guilty. \nPeople get sick of you being sick and push away to go live life  \nWe go back into our heads with our ed  \nYou spend your life making your body the way you want it,  and during that time- WE LOST TIME.  \n \nJust When u get that perfect wieght and you love seeing all the bones, you start to fall apart.  \n.\nI wish I could go back in time during  14 years of real recovery.  But then there comes that relapse that was \"impossible\"\n\nI regret evey bit of time i wasted. I wanted to actually live a life of doing what would make an impact.  Get married and settle down. \n\nNo significant other wants to deal with the issues.  And when the health problems start those vows suddenly mean crap cuy you are dragging them down.  \nIt just made my vidy fall apart early  \n\nAnd again- the actual QUESTION IS.... WHAT MAKES BEING TOO THIN MY IDENTITY? WHEN DID THAT HAPPEN AND WHERE DID I GO? \n\n So what did we do it for if it got us nothing in life. Not money not love not happiness not changing anything for the good. We didn't participate. \n\nI lost not just a physical body ,but I never had an actual life to live because it ruined everything and it wasn't ME. It was the ed living it. \n\nMourning is the worst thing.  But patulous ear is really something that will drive you mad",
          "created_utc": 1744418452.0
        }
      ]
    },
    {
      "id": "n3xbcl0",
      "author": "DependentSecure",
      "body": "I am so profoundly sorry that this has been your experience. I truly appreciate your openness and sharing- sending you love and support",
      "created_utc": 1752890107.0,
      "score": 1,
      "context": [
        {
          "id": "mmnp9sa",
          "author": "mylostzebra",
          "body": "Tooth loss early , vision problems weakness \n\nAnd omg the horrid PATULOUS EARS after the fat grt eaten from the ear.  My bowel  bladder., energy \n\nBUT I have to say that it was mourning my time I lost in life. THATA IS eveb worse than the constant body parts falling apart because it hits you one day \"my life never mattered and won't '\nMy mental health was Way worse. \n. \nI began at 9. And I djnt cou t the years I was immersed in it as eveb being alive because I was just a body with no thoughts, ideas,plans, feelings that were only mine, they were me and my ED\nSo\nI wasn't alive from age 9 to 45. Minus 14.5 yeara jf recovery. \nTake note I said 45.\nIts a myrh that it cant come back   \nThere used to be very few people over 40 with and today its a growingnahe group,  old mellenials like me and gen x arenfull of ed \nOddly, we were the 90s boom ED of the comeback of twiggy. Now we hit 40 and we are at it ahain, sick and in pain and having body failing early all ober  . here we again at it. \nThere are horrible things its done physically. God wait till people start dealing with PET disorder . \nBut you begin thinking how useless this all was  \n\nAs we age we find out that most people are involved in their own heads about themselves.  \nAnd we live our life thinking we are center stage.  Wondering who noticed a gain . Who noticed a loss. \nFrankly NO ONE  And whoever does ,doesn't even care. \nIt's on our minds. The ed literally drives every thought, feeling,decision, action. \nBesides PET and loss of teeth , vision peeing, pooping etc \n\nThe WORST thing is that it took my whole life. \n\nI did nothing that matters. \nNo kids was scared to be fat.\nNo loving another person when your busy dealing with health issues so much you can't meat men and when u date it's exhausting.  \nAnd the thoughts that take over your brain. \n\nYou notice that other people around you really LIVE LIVES. \n\nThey are having moments that passed us because we are wrapped into this  \nWhen other laugh it's real laughs. When I laugh I hope I didn't look fat  in my stomach  . \nThey have actual fulfillment.  We don't we aren't in our brains and we can't be in our bodies  it's the ed that is. \nSo we are walking zombies \n\nI realized my whole life - is wasn't existing.\n\nI absolutely put nothing into this world. And what's even worse is there are so many people and even kids that are a part of this word and love life and it gets taken away from them ,but we are dead inside and falling apart but still stuck alive. \nTalk about feeling guilty. \nPeople get sick of you being sick and push away to go live life  \nWe go back into our heads with our ed  \nYou spend your life making your body the way you want it,  and during that time- WE LOST TIME.  \n \nJust When u get that perfect wieght and you love seeing all the bones, you start to fall apart.  \n.\nI wish I could go back in time during  14 years of real recovery.  But then there comes that relapse that was \"impossible\"\n\nI regret evey bit of time i wasted. I wanted to actually live a life of doing what would make an impact.  Get married and settle down. \n\nNo significant other wants to deal with the issues.  And when the health problems start those vows suddenly mean crap cuy you are dragging them down.  \nIt just made my vidy fall apart early  \n\nAnd again- the actual QUESTION IS.... WHAT MAKES BEING TOO THIN MY IDENTITY? WHEN DID THAT HAPPEN AND WHERE DID I GO? \n\n So what did we do it for if it got us nothing in life. Not money not love not happiness not changing anything for the good. We didn't participate. \n\nI lost not just a physical body ,but I never had an actual life to live because it ruined everything and it wasn't ME. It was the ed living it. \n\nMourning is the worst thing.  But patulous ear is really something that will drive you mad",
          "created_utc": 1744418452.0
        }
      ]
    },
    {
      "id": "mmqp52s",
      "author": "TinyTitannn",
      "body": "From my experience, won t droop if you also workout.",
      "created_utc": 1744469613.0,
      "score": 0,
      "context": [
        {
          "id": "mmp90tu",
          "author": "RinkyInky",
          "body": "Anyone find that the bone loss, soft tissue weakness and muscle weakness causes your face to droop too and give you a melted face look?",
          "created_utc": 1744444977.0
        }
      ]
    },
    {
      "id": "mmv5k2j",
      "author": "Afraid-Firefighter92",
      "body": "Came back to say: for those experiencing bladder problems from anorexia look up interstitial cystitis. In a nutshell it’s when the uterine wall becomes weak because of chronic dehydration and changes it genetic make up to “over compensate” for all the acid that builds up when you’re dehydrated. So now when you actually eat highly acid foods (soda, oranges, limes,etc.) it flares up the uterine wall. Think of your bladder having PTSD and anytime you eat a certain threshold of something acidic it has a flashback and wants to get rid of it quick to avoid further damage. It does this through the urgency to urinate and pain. This is SUPER simplified it’s more complex but looking at what were my bladders “trigger” foods has helped heal the bladder lining. Unfortunately it’s a lot of trial and error. Eat something acidic (like lemonade- this sends me to the er in pain) and see how you react. \n\nI’m NOT a medical provider so take this with a grain of salt and do what’s best for you and consult a urologist. This is what has helped ME: take prelief before you eat anything acidic. This can be found over the counter. However, you cannot take this daily because it will cause kidney stones. It is just meant as an occasional supplement to help. Drink enough water to flush your bladder daily even if you choose not to eat. The acidity in your blood has to leave your body somehow. A heating pad helps with the pain. Work with your dietician to see what foods you’re eating that could be too acidic. This does NOT mean do not eat them. You may just need to take prelief beforehand. Amazon also sells urine acidity strips. This helps to know whether you need to drink more water. Lastly, make sure you do not have an untreated UTI.",
      "created_utc": 1744531813.0,
      "score": 2,
      "context": [
        {
          "id": "mmuy32q",
          "author": "Afraid-Firefighter92",
          "body": "My body has faced the consequences of atypical anorexia. I’m going to be blunt and real when I write this because I wish I had someone tell me this. \n\nI was never hospitalized, never under weight by medical criteria (actually was still considered obese at the height of my disorder on the BMI scale), never inpatient, always outpatient treatments. I do now have long lasting chronic health conditions from this cruel disease. After 10 years of off and on relapses and now five years of solid recovery, I now struggle with gastroparesis, acid reflex disease, gallbladder taken out due to a sluggish gallbladder (my gallbladder basically was dying because I was not eating and using it), kidney stones and now kidney injury, high liver enzymes and now fibrosis of the liver, chronic bladder pain and constant need to urinate (interstitial cystitis now I have to monitor what I eat so it does not flare up 🤦🏻‍♀️. Now that I want to eat I can’t eat certain foods that are too acidic), pelvic floor dysfunction (hurts to have sex and I have to wear daily pads incase I urinate on myself while laughing or coughing-yes, purging can cause this. It ruins your abdominal core), chronic pain from nerve damage, chronic low iron (nothing will bring my iron/ferritin levels up), brain damage that I now have to go to rehabilitation for memory problems I never had before (I have a PhD and my memory is now failing me from my brain atrophying during the years I starved myself. My brain is smaller than average. No educational degree will reverse this.), small fractures throughout the years out of no where (legit fractured my foot when stepping off a curb. The embarrassment I felt going to the ER because I stepped off a curb too hard and fractured my foot 🤦🏻‍♀️), abdominal hernia repair surgery from purging (yes, this happens and extremely painful recovery), reactive hypoglycemia, and now heart issues I just found out about last month that may not be fixable. \n\nSo no, you don’t have to be UW or have had numerous or even one inpatient stay or IOP or PHP treatment to experience any of these consequences. I’ve been in recovery for five years and my body is still trying to catch up and falling apart at the same time. I truly wish someone would have advised my mother and me of the consequences of chronic dieting growing up since 10 years old (this is when my mother enrolled me in weight watchers but always had my food monitored since I was a “chubby” kid) and then developing a 10 off and on year long battle with an eating disorder starting at 18. Instead, unfortunately, I was always told I needed to lose weight by medical professionals. My body NEEDED that weight. Oh, I’m also the shortest one in my family so there’s that too (growth restriction). \n\nYou are not immune from these consequences. I thought I was the exception. I kept telling myself this was okay. This is what doctors told me to do. Thought if I have a wonderful career, a PhD, (humbling stating the following to give an example) a decent income for a single middle aged woman, all my needs and wants met-I would be okay. I would tell myself I NEEDED my ED to cope to get where I am today and then I’ll be okay and it will magically go away with no consequences. Nope…I hit 30 and all my health issues started and I had been IN RECOVERY for two years before this and I am still paying the consequences to this day. \n\nI’m up right now at 2 am typing this with severe acid reflux and unable to sleep because I had vegetables with my dinner. Yes, vegetables. I can’t sleep because my stomach is on fire. Already took all the medication I can to no avail. \n\nPLUS what hurts the most is the years I wasted on this terrible disease and how much I suffered. The money spent on healthcare is in the six figures WITH insurance here in the US and this isn’t all my outpatient treatment copays and out of pocket expenses with my specialized psychologist and dietician for the last 8 years. \n\nGet help NOW, please. Even if it’s just having one “extra” food item a day to start. If not for you, but for the people before you telling you this WILL be your life in the years to come. The consequences do not discriminate.",
          "created_utc": 1744527214.0
        }
      ]
    },
    {
      "id": "mmnsb4e",
      "author": "Coffeegreysky12",
      "body": "Thank you",
      "created_utc": 1744419609.0,
      "score": 5,
      "context": [
        {
          "id": "mmnrfzu",
          "author": "honkyg666",
          "body": "My 14 yo daughter is in the recovery process currently and happened to see my notes about scheduling a bone scan for her. She asked why and I told her the doc said she may have caused enough damage that we need to have her checked out before she can ski or skateboard etc because her bones may have been compromised and she just cried that she wished she knew more of the consequences before allowing herself down this road.  Breaks my heart. \n\nI wish all of you the very best in your own battles.",
          "created_utc": 1744419282.0
        }
      ]
    },
    {
      "id": "mmnkpvj",
      "author": "Coffeegreysky12",
      "body": "Thank you. Well said. Inpatient can be so stressful for people with anorexia and autism. I'm sorry you have bladder issues and chronic pain too. It's so difficult to deal with.",
      "created_utc": 1744416717.0,
      "score": 4,
      "context": [
        {
          "id": "mmnjjys",
          "author": "turnipkitty112",
          "body": "I totally empathize with your experience. People think “oh well if this sucks for you so much then go to a higher level of care and get better” and how do I explain the clinical PTSD I’ve gotten from repeated, horrific IP experiences? I’m also autistic and I truly cannot think of a *worse* environment for an autistic person than ED inpatient. \n\nI also have bladder issues from my anorexia, namely incontinence and interstitial cystitis. I never dare speak of it bc of the horror and stigma it would provoke from others. I also never expected to get weird neurological issues - it’s probably a cervical nerve impingement (more testing needed) but I get painful electric shocks down my back and arms, and it happens whenever I swallow anything. Eating is painful in ways I could have never anticipated. I don’t *know* that it’s from my ED but that seems the most likely explanation. Don’t get me started on the chronic pain. I’m in my 20s, I shouldn’t be feeling like this. I can’t ask for help because I either hear “well duh, it’s just your ED, you should gain some weight and it’ll go away”, or “haha just wait until you get to my age, you don’t know what pain is!”",
          "created_utc": 1744416286.0
        }
      ]
    },
    {
      "id": "mmqs3so",
      "author": "Shuyuya",
      "body": "Everything can pretty much be recovered and helped with, with medication and healing but not brain functions.",
      "created_utc": 1744470572.0,
      "score": 2,
      "context": [
        {
          "id": "mmqrvdq",
          "author": "Shuyuya",
          "body": "For me what limited the disease was the brain damages from lack of nutrients and water. The rest idc.",
          "created_utc": 1744470496.0
        }
      ]
    },
    {
      "id": "mmqvz96",
      "author": "Coffeegreysky12",
      "body": "Yes, it's awful. I am glad my post is helping others",
      "created_utc": 1744471824.0,
      "score": 1,
      "context": [
        {
          "id": "mmqu3xo",
          "author": "LangGetaways",
          "body": "That sounds horrendous. I'm so sorry this disorder took so much from you. Thank you for sharing to younger people with AN\n💞",
          "created_utc": 1744471219.0
        }
      ]
    },
    {
      "id": "mmrxk6q",
      "author": "PreviousManager3",
      "body": "I’m either sweating to death or freezing cold, often both at the same time but never at a comfortable temp",
      "created_utc": 1744483518.0,
      "score": 3,
      "context": [
        {
          "id": "mmqxj8j",
          "author": "BallSufficient5671",
          "body": "Does anyone have the problem with the 24/7 feeling hot all the time? Where you are just so overheated that you have complete heat intolerance like worse than a menopausal woman? ",
          "created_utc": 1744472314.0
        }
      ]
    },
    {
      "id": "mmu6c0l",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing. Anorexia is a painful illness. I'm sorry you deal with complications too",
      "created_utc": 1744513245.0,
      "score": 2,
      "context": [
        {
          "id": "mmu5zi1",
          "author": "ActivityIll8075",
          "body": "Yep, I struggle to pee bc my muscles are so weak, I have severe diarrhea at times, everything I eat immediately comes out the other end, my rectum literally prolapsed, I have painful nerve damage, constant pins and needles that won't go away, my body basically refuses to produce white blood cells, the list could go on forever but yes, anorexia is an awful disease and it WILL severely damage your body (including your brain)",
          "created_utc": 1744513106.0
        }
      ]
    },
    {
      "id": "mmw1eah",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing. I appreciate the support",
      "created_utc": 1744549592.0,
      "score": 1,
      "context": [
        {
          "id": "mmuvysr",
          "author": "Original-Society-768",
          "body": "I’ve have dealt with similar issues when i come to digesting food. i have always dealt with severe nausea for most of my life but i have also a lot more in the last few years have experienced extreme cramping after i eat and i have found that sometimes heat helps which is what helped me in a residential treatment but it sometimes makes eating out and places that aren’t home really hard cause i can’t just lay down if i need to. i have also experienced really bad tearing as well which has made it hard to feel like i can have any type of normal sex life and also makes me question what other things it may affect. i don’t know if it will fully get better i hope it does in general but also know that anoxia and starving ourselves is not a way to live even though it has felt that way for so long and I just want to say that i am so proud of you and any progress you have made because it is huge regardless of what anyone else says!",
          "created_utc": 1744525944.0
        }
      ]
    },
    {
      "id": "mmxzfhv",
      "author": "Coffeegreysky12",
      "body": "Thank you. So true. It's a very damaging illness and I am sorry for what you have gone through as well.",
      "created_utc": 1744572123.0,
      "score": 2,
      "context": [
        {
          "id": "mmxwtia",
          "author": "Knot0001",
          "body": "I am sorry for everything you qent through and still going through. Anorexia is so severe and damaging ilness. I'm suffering from it for 20 years, also irreversible damage to different organs and it was never ever on my mind that could happen. Not even doctors told me.\nI was once falling into coma because of hypoglycemia and that's shit. Not once I almost died but yet, now, I still don't wish to recover because that's for now my only coping mechanism because of CPTSD and I have autism too.",
          "created_utc": 1744571279.0
        }
      ]
    },
    {
      "id": "mn3a4r2",
      "author": "Coffeegreysky12",
      "body": "Thank you for the kind words. I've explained my fears around inpatient to my care team and they are very understanding. I am currently looking into an online outpatient program so I don't have to go inpatient. I have a lot of anxiety around hospital type settings and am trying to do the least restrictive setting possible. But my medical issues are severe so it's a complex situation. I also wish there were more places set up for autistic people. My therapist and nutritionist understand how my autism can complicate the eating disorder. My doctor isn't specialized in eating disorders, so she can only check labs and give me basic advice on how to handle my illness. It's hard accessing specialized care where I live. Some days are more difficult than others, but I am trying to remain positive",
      "created_utc": 1744650448.0,
      "score": 1,
      "context": [
        {
          "id": "mn38bza",
          "author": "SchoolDistinct3820",
          "body": "Thank you for sharing your story. Ed causes so many health issues. My acid reflux got so bad it was dissolving my teeth and popping off my root canals. I had some health issues as a child but Ed added more and made the ones I have so much worse.\n\n\nI understand about asd, I'm audhd. I've got to the point with Ed where I'm like f societies weight bs I just want to be healthy and happy; still a stuggle though but I pray a lot. You should look into somantic therapy and emdr; they tend to be more helpful for neurodivergants. With routine try to add food into your established routine. Since Ive been feeling sick eating food I make sure to drink an ensure in the morning. I know I have to have a meal with my vitamins so I force myself to have at least one big meal a day when feeling sick. I'll also put collagen in my drinks. \n\n\nI'm glad you're seeing a doctor, therapist and nutritionist. Have you explained your concerns being asd and doing inpatient. They are your team so they need to listen and be working with you to get better (if one isnt listening or helping get a new one). Remember you need to be your biggest advocate or bring one with you. See if you can draft up an inpatient type environment to do at home with them. There's so many resources to help yourself at home especially with the internet. Online therapy, virtual support groups, audiobooks, YouTube, somantic exercises, journaling, meditation and prayer, etc. Work with them to add things onto your established routine that'll help. \n\n\nIt does suck there aren't more places for us. Hopefully one day we'll get there. What matters most now though is your life and health. If you won't be able to help yourself at home then you'll need to go to inpatient. I completely understand the anxiety about unfamiliar places and out of routine. Call around to places (or have someone who understands and loves you) and ask how they accommodate someone with autism and ed. Ask all your questions and find the best fit for you. You'll need to get real honest with yourself if you'll be able to work on your healing at home or if you can't and need inpatient. Listen to your intuition and try to ignore the fear. Your goal is getting better.\n\n\nYou were determined to get to your goal weight. You are strong and resilient going through life with asd and how the world treats us. Now focus that determination, strength and resilience on getting better, helping yourself and getting the right help. I will be praying for you 🙏 I wish you all the best on the path forward. You can do this! ",
          "created_utc": 1744649914.0
        }
      ]
    },
    {
      "id": "mmn6nz3",
      "author": "Coffeegreysky12",
      "body": "Yes, this is a deadly disorder and hard to treat. Thank you for sharing your experience. Inpatient was difficult for me too. I wish there was an easy fix for it",
      "created_utc": 1744411638.0,
      "score": 5,
      "context": [
        {
          "id": "mmn5i9i",
          "author": "hangry_witch",
          "body": "I see you. This disease is deadly, plus you have to include other health issues or symptoms, environment, social conditioning, and inadequate treatment.\n\nOne health condition I have is called painful bladder syndrome, and it took nearly a decade to fail all the treatments and get an implant in my back that disrupts the pain to my bladder. Surprisingly, Amatriptaline (an old school antidepressant) is used off-label for bladder pain, and pelvic floor therapy helped me a lot.\n\nIf you have not seen a urogynocologist yet, I encourage you to see one for testing just to rule out issues with your bladder. \n\nI tried voluntary inpatient and was illegally detained and prolapsed my anus because the Eating Disorder hospital would not allow me proper stool softners after a pelvic floor reconstruction surgery I'm never going inpatient again and they were dicks about my Xanax prescription which lead to siezures.  It was so inhumane, and they falsified their billing, so I contacted the VAs fraud, waste, and abuse line for my concerns. They charged $7 k a night but would not help with eating, played games at meal time, no individual therapy, just one group therapy exercise where we wrote how similar we are to pigs.\n\nI also can't absorb or convert what I eat or take and that's how my mom was when she died of heart issues from anorexia so I get frustrated.",
          "created_utc": 1744411222.0
        }
      ]
    },
    {
      "id": "mmmtpzw",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing and I am sorry you are experiencing this",
      "created_utc": 1744407162.0,
      "score": 2,
      "context": [
        {
          "id": "mmmsl1z",
          "author": "None",
          "body": "My favorite warning to give people who can turn back now is METABOLIC SYNDROME IS REAL AND IT CAN BE LONG TERM OR PERMANENT. I have it. I am fat now and there’s zero disordered behaviors that can “fix” it. My body simultaneously blows through anything I give it (if I don’t shit it out first) AND has no idea what to do with it so it just sits there on my body. It’s not fun. It’s incredibly dysphoric. We’re talking a lifetime of unstable blood sugar, heart palpitations bc while my metabolism is constantly in the on position it does nothing but make me exhausted, unreliable digestion including DAILY diarrhea and needing to always be near a bathroom. If you think you hate food now just wait until it causes you immediate pain but you HAVE TO eat frequently or feel like death. Nausea, hot flashes, headaches… it makes your body so time consuming. \n\nIt’s manageable eventually but this will be my life for the foreseeable future if not forever and it’s not something I’d wish on anyone.",
          "created_utc": 1744406787.0
        }
      ]
    },
    {
      "id": "mmqzhpe",
      "author": "BallSufficient5671",
      "body": "Is your hypothalmus also malgunctioned to where you can't regulate your body temperature and your now in like hot flash mode to where you're feeling hot all the time with severe heat intolerance? I never feel cold, just severely hot \n\n\n Because that's what is happening with me after thirty years of anorexia. My endocrinologist and gynecologist think that most of this hotness is caused by 30 yrs of anorexia and aren't sure if gaining weight would fix my hypothalmus or if this heat intolerance is permanent. Has your Dr told you if the temperature thing is permanent or can it be fixed with weight gain?",
      "created_utc": 1744472921.0,
      "score": 2,
      "context": [
        {
          "id": "mmmsl1z",
          "author": "None",
          "body": "My favorite warning to give people who can turn back now is METABOLIC SYNDROME IS REAL AND IT CAN BE LONG TERM OR PERMANENT. I have it. I am fat now and there’s zero disordered behaviors that can “fix” it. My body simultaneously blows through anything I give it (if I don’t shit it out first) AND has no idea what to do with it so it just sits there on my body. It’s not fun. It’s incredibly dysphoric. We’re talking a lifetime of unstable blood sugar, heart palpitations bc while my metabolism is constantly in the on position it does nothing but make me exhausted, unreliable digestion including DAILY diarrhea and needing to always be near a bathroom. If you think you hate food now just wait until it causes you immediate pain but you HAVE TO eat frequently or feel like death. Nausea, hot flashes, headaches… it makes your body so time consuming. \n\nIt’s manageable eventually but this will be my life for the foreseeable future if not forever and it’s not something I’d wish on anyone.",
          "created_utc": 1744406787.0
        }
      ]
    },
    {
      "id": "mmqzvmh",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing and I am sorry you are going through this. Yes, I am afraid some of my medical issues can't be fixed, so I am right there with you. My inpatients never helped me either. I know it helps some people, but i always found inpatient so stressful and that they did very little in addressing why I have so much anxiety around eating. I think recovering from anorexia takes more than inpatient treatment. I think it takes an entire treatment team that you have when you are back home. But inpatient can work for medical stability",
      "created_utc": 1744473041.0,
      "score": 2,
      "context": [
        {
          "id": "mmqxelj",
          "author": "BallSufficient5671",
          "body": "I've had anorexia for 30 years now and I am 40 almost 41.And I can tell you that I have so many medical complications.It's unreal. I have severe osteoporosis , elevated liver enzymes and Permanent damage in both my brain and body. The worst part for me is I have what's called hypothemic dysfunction from the years of no periods and anorexia making my hypothesis not be able to regulate my temperature. \nThey want me to go to treatment again and gain weight to see if that hotness will go away with wt gain treatment. But I was told by endocrinologist and gynecologist who aren't Ed specialists if course thatvmy hypothalmus dysfunctuon may never be fixable and that the severe heat intolerance and feeling severely hot 24/7 may nit go away even with wt gain. \n\n\nSo that is what is keeping me from getting treatment again?Is I feel like what's the point if they're saying that that won't get better? Also i've been to impatient treatment five times in my life and it's never helped anything before. But back then I didn't have this symptom. ",
          "created_utc": 1744472273.0
        }
      ]
    },
    {
      "id": "mmyvqmg",
      "author": "Coffeegreysky12",
      "body": "Yes, it's very difficult to deal with",
      "created_utc": 1744582736.0,
      "score": 1,
      "context": [
        {
          "id": "mmyuvww",
          "author": "square-marbles",
          "body": "Yep. 2 heart attacks before the age of 40 have put me in my place. This shit sucks and it’s embarrassing as hell.",
          "created_utc": 1744582439.0
        }
      ]
    },
    {
      "id": "mmnopy6",
      "author": "Coffeegreysky12",
      "body": "I understand. I have sensory issues and certain textures and tastes bother me, but no one in inpatient took the time to understand this. I felt like I was being punished or like I was just overreacting.",
      "created_utc": 1744418240.0,
      "score": 4,
      "context": [
        {
          "id": "mmno5j6",
          "author": "shakethedisease666",
          "body": "The worst thing I suffer with when being treated inpatient or outpatient is they would always consider my avoidance of foods automatically as “bad relationship with food” even if my issue was a texture issue. I can eat anything as long as it does have a cold slimy texture or smell like/feel like eggs. I was punished for this. Every time I explained and they still punished me for this.",
          "created_utc": 1744418020.0
        }
      ]
    },
    {
      "id": "mmmrxr1",
      "author": "yeaahhhhhhhhhhhh",
      "body": "And you never think it will happen to you 😭😭 we always think we’ll be the one exception",
      "created_utc": 1744406575.0,
      "score": 22,
      "context": [
        {
          "id": "mmmp1tk",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Let me scare y’all even more. I was literally paralyzed to my elbows because of my eating disorder. It took 10 years to catch up to me and I got something called guillen barre syndrome from the stress I put on my body. PARALYZED you guys. Save yourselves 😭",
          "created_utc": 1744405631.0
        },
        {
          "id": "mmmpt5q",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing. This is an awful disorder and it can cause so many medical issues.",
          "created_utc": 1744405879.0
        }
      ]
    },
    {
      "id": "mmw33s1",
      "author": "yeaahhhhhhhhhhhh",
      "body": "No",
      "created_utc": 1744550271.0,
      "score": 1,
      "context": [
        {
          "id": "mmmp1tk",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Let me scare y’all even more. I was literally paralyzed to my elbows because of my eating disorder. It took 10 years to catch up to me and I got something called guillen barre syndrome from the stress I put on my body. PARALYZED you guys. Save yourselves 😭",
          "created_utc": 1744405631.0
        },
        {
          "id": "mmr62q8",
          "author": "MetalingusMikeII",
          "body": "Is that caused by B12 deficiency?",
          "created_utc": 1744474977.0
        }
      ]
    },
    {
      "id": "mmn7o5l",
      "author": "collectedd",
      "body": "Same to you! I am currently hospitalised, but hopefully will be out soon. Anorexia is horrible.",
      "created_utc": 1744411993.0,
      "score": 5,
      "context": [
        {
          "id": "mmn4q18",
          "author": "collectedd",
          "body": "I have a lot of things that have either been caused or worsened by my Anorexia Nervosa - it's hard to say what caused what considering I've got underlying genetic health issues but also have had AN since I was a young child.\n\nI've lost my hair, lost function in my bladder (Bladder Failure), Severe Gastroparesis, Osteoporosis, have brain atrophy/brain damage causing Ataxia, etc. \n\nIt's horrible.",
          "created_utc": 1744410937.0
        },
        {
          "id": "mmn5c88",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing what you are experiencing and I hope you start feeling better.",
          "created_utc": 1744411160.0
        }
      ]
    },
    {
      "id": "mmnbnse",
      "author": "garnetandjade",
      "body": "It’s a really important post. I appreciate your vulnerability and the thought you put into it.",
      "created_utc": 1744413406.0,
      "score": 6,
      "context": [
        {
          "id": "mmn9sae",
          "author": "garnetandjade",
          "body": "I have osteoporosis, prolonged QT syndrome which could lead to sudden death, ventricular enlargement, mitral valve prolapse, gastritis, small intestine inflammation, colitis, liver injury, kidney injury, have endured metabolic acidosis multiple times, have 4 good teeth and the rest need to be crowned or removed/implants, and I live in constant pain. I’ve had the disease for over 15 years, but the damage started EARLY. I agree… you don’t realize that it becomes nearly impossible to gain it back after a certain point. I hope the younger people on here can see this and they ask for help. I’m not pushing recovery on anyone, because I would be a hypocrite as I didn’t start to recover until I almost died, and am only several weeks into hospitalization. And btw, I almost died well OVER my lowest weight… you do not need to be skeletal to be actively dying. Fuck anorexia. Fuck this disease. I wish someone had intervened when I was young and crying out for help. I wish I could help even one single other person to say fuck this disorder",
          "created_utc": 1744412738.0
        },
        {
          "id": "mmnaayg",
          "author": "Coffeegreysky12",
          "body": "Yes, this is an awful disorder. I'm sorry for all that you have gone through. I hope people see my post and reach out for help.",
          "created_utc": 1744412922.0
        }
      ]
    },
    {
      "id": "mrh0nyh",
      "author": "garnetandjade",
      "body": "You cannot treat it yourself, in order to know you’ll need bloodwork and they will correct it IV",
      "created_utc": 1746819701.0,
      "score": 1,
      "context": [
        {
          "id": "mmn9sae",
          "author": "garnetandjade",
          "body": "I have osteoporosis, prolonged QT syndrome which could lead to sudden death, ventricular enlargement, mitral valve prolapse, gastritis, small intestine inflammation, colitis, liver injury, kidney injury, have endured metabolic acidosis multiple times, have 4 good teeth and the rest need to be crowned or removed/implants, and I live in constant pain. I’ve had the disease for over 15 years, but the damage started EARLY. I agree… you don’t realize that it becomes nearly impossible to gain it back after a certain point. I hope the younger people on here can see this and they ask for help. I’m not pushing recovery on anyone, because I would be a hypocrite as I didn’t start to recover until I almost died, and am only several weeks into hospitalization. And btw, I almost died well OVER my lowest weight… you do not need to be skeletal to be actively dying. Fuck anorexia. Fuck this disease. I wish someone had intervened when I was young and crying out for help. I wish I could help even one single other person to say fuck this disorder",
          "created_utc": 1744412738.0
        },
        {
          "id": "mqze1k5",
          "author": "Independent-Shoe594",
          "body": "I have metabolic acidosis at the moment. How did you treat it, I’m scared?",
          "created_utc": 1746577399.0
        }
      ]
    },
    {
      "id": "mmmzlzo",
      "author": "nihilist_fox",
      "body": "I’m sending you strength, and love. You deserve to feel better, and to live again. We all do. Keep that positivity, even if it’s hard, and hold on to that support system. That saves lives, believe me, I wish I had one, it’s really important. \n\nI believe in you xx",
      "created_utc": 1744409139.0,
      "score": 5,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        },
        {
          "id": "mmmydf4",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing what you've gone through. This disorder causes so many health issues. Yes, this disorder will make everything in life so much more difficult. I dislike how it gets romanticized too. There's nothing glamorous about it. It slowly takes away so much away from the person going through it. I have a pretty good support system around me which keeps me from feeling alone. But it's really an all consuming disorder. I wish I could go back in time and talk to my younger self. I'm trying to stay positive, but some days, it's not easy. I hope we can both start to feel better.",
          "created_utc": 1744408716.0
        }
      ]
    },
    {
      "id": "mmqz78j",
      "author": "Coffeegreysky12",
      "body": "I actually feel cold all the time, even in warm weather. I wish I could give you some advice, but I've never experienced feeling too hot. I would suggest you ask a medical professional",
      "created_utc": 1744472830.0,
      "score": 2,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        },
        {
          "id": "mmqymzu",
          "author": "BallSufficient5671",
          "body": "To you too have hypothetic dysfunction which is where your body can't regulate its temperature and you're hot all the time? Because I am never cold anymore ever...it's that i'm always severely hot with hotness 24/7 and severe heat intolerance. \n\n\nMy endocrinologist and gynecologist are not eating disorder specialists but they believe that this is due to my anorexia turning off my hypothesis from regulating properly causing the hotness. The problem is they're not sure that with me having this for thirty years , if weight gain would even turn my hypothalmus back on and get it to work properly and take my severe hotness and heat intolerance away. So obviously i'm afraid to detreatment again unless I knew that that would actually fix itself. Plus i've been impatient five times so i've used all my insurance and money already. \n\n\nSo do you have this severe heat intolerance and feeling hot all the time? Has your doctors told you if weight gain would make this symptom go away and regulate your hypothesis? My drs don't know. Does yours?",
          "created_utc": 1744472656.0
        }
      ]
    },
    {
      "id": "mmwdx5r",
      "author": "Coffeegreysky12",
      "body": "My care team thinks it's the effects of long term malnutrition",
      "created_utc": 1744554088.0,
      "score": 2,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        },
        {
          "id": "mmt51yl",
          "author": "Glamour-Ad7669",
          "body": "Do you know what’s the cause of what you write in the first part? Because same and I’m so confused",
          "created_utc": 1744498519.0
        }
      ]
    },
    {
      "id": "mmnuba4",
      "author": "mylostzebra",
      "body": "I'm sorry for you as well  maybe we were born with adduction tendency and this became ours instead of drugs. I do think sometimes we are born with them",
      "created_utc": 1744420375.0,
      "score": 2,
      "context": [
        {
          "id": "mmnp9sa",
          "author": "mylostzebra",
          "body": "Tooth loss early , vision problems weakness \n\nAnd omg the horrid PATULOUS EARS after the fat grt eaten from the ear.  My bowel  bladder., energy \n\nBUT I have to say that it was mourning my time I lost in life. THATA IS eveb worse than the constant body parts falling apart because it hits you one day \"my life never mattered and won't '\nMy mental health was Way worse. \n. \nI began at 9. And I djnt cou t the years I was immersed in it as eveb being alive because I was just a body with no thoughts, ideas,plans, feelings that were only mine, they were me and my ED\nSo\nI wasn't alive from age 9 to 45. Minus 14.5 yeara jf recovery. \nTake note I said 45.\nIts a myrh that it cant come back   \nThere used to be very few people over 40 with and today its a growingnahe group,  old mellenials like me and gen x arenfull of ed \nOddly, we were the 90s boom ED of the comeback of twiggy. Now we hit 40 and we are at it ahain, sick and in pain and having body failing early all ober  . here we again at it. \nThere are horrible things its done physically. God wait till people start dealing with PET disorder . \nBut you begin thinking how useless this all was  \n\nAs we age we find out that most people are involved in their own heads about themselves.  \nAnd we live our life thinking we are center stage.  Wondering who noticed a gain . Who noticed a loss. \nFrankly NO ONE  And whoever does ,doesn't even care. \nIt's on our minds. The ed literally drives every thought, feeling,decision, action. \nBesides PET and loss of teeth , vision peeing, pooping etc \n\nThe WORST thing is that it took my whole life. \n\nI did nothing that matters. \nNo kids was scared to be fat.\nNo loving another person when your busy dealing with health issues so much you can't meat men and when u date it's exhausting.  \nAnd the thoughts that take over your brain. \n\nYou notice that other people around you really LIVE LIVES. \n\nThey are having moments that passed us because we are wrapped into this  \nWhen other laugh it's real laughs. When I laugh I hope I didn't look fat  in my stomach  . \nThey have actual fulfillment.  We don't we aren't in our brains and we can't be in our bodies  it's the ed that is. \nSo we are walking zombies \n\nI realized my whole life - is wasn't existing.\n\nI absolutely put nothing into this world. And what's even worse is there are so many people and even kids that are a part of this word and love life and it gets taken away from them ,but we are dead inside and falling apart but still stuck alive. \nTalk about feeling guilty. \nPeople get sick of you being sick and push away to go live life  \nWe go back into our heads with our ed  \nYou spend your life making your body the way you want it,  and during that time- WE LOST TIME.  \n \nJust When u get that perfect wieght and you love seeing all the bones, you start to fall apart.  \n.\nI wish I could go back in time during  14 years of real recovery.  But then there comes that relapse that was \"impossible\"\n\nI regret evey bit of time i wasted. I wanted to actually live a life of doing what would make an impact.  Get married and settle down. \n\nNo significant other wants to deal with the issues.  And when the health problems start those vows suddenly mean crap cuy you are dragging them down.  \nIt just made my vidy fall apart early  \n\nAnd again- the actual QUESTION IS.... WHAT MAKES BEING TOO THIN MY IDENTITY? WHEN DID THAT HAPPEN AND WHERE DID I GO? \n\n So what did we do it for if it got us nothing in life. Not money not love not happiness not changing anything for the good. We didn't participate. \n\nI lost not just a physical body ,but I never had an actual life to live because it ruined everything and it wasn't ME. It was the ed living it. \n\nMourning is the worst thing.  But patulous ear is really something that will drive you mad",
          "created_utc": 1744418452.0
        },
        {
          "id": "mmnqa86",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing. Eating disorders take away so much and give nothing in return. I regret not getting help sooner.",
          "created_utc": 1744418839.0
        }
      ]
    },
    {
      "id": "mmw1okd",
      "author": "Coffeegreysky12",
      "body": "Thank you for the info",
      "created_utc": 1744549706.0,
      "score": 1,
      "context": [
        {
          "id": "mmuy32q",
          "author": "Afraid-Firefighter92",
          "body": "My body has faced the consequences of atypical anorexia. I’m going to be blunt and real when I write this because I wish I had someone tell me this. \n\nI was never hospitalized, never under weight by medical criteria (actually was still considered obese at the height of my disorder on the BMI scale), never inpatient, always outpatient treatments. I do now have long lasting chronic health conditions from this cruel disease. After 10 years of off and on relapses and now five years of solid recovery, I now struggle with gastroparesis, acid reflex disease, gallbladder taken out due to a sluggish gallbladder (my gallbladder basically was dying because I was not eating and using it), kidney stones and now kidney injury, high liver enzymes and now fibrosis of the liver, chronic bladder pain and constant need to urinate (interstitial cystitis now I have to monitor what I eat so it does not flare up 🤦🏻‍♀️. Now that I want to eat I can’t eat certain foods that are too acidic), pelvic floor dysfunction (hurts to have sex and I have to wear daily pads incase I urinate on myself while laughing or coughing-yes, purging can cause this. It ruins your abdominal core), chronic pain from nerve damage, chronic low iron (nothing will bring my iron/ferritin levels up), brain damage that I now have to go to rehabilitation for memory problems I never had before (I have a PhD and my memory is now failing me from my brain atrophying during the years I starved myself. My brain is smaller than average. No educational degree will reverse this.), small fractures throughout the years out of no where (legit fractured my foot when stepping off a curb. The embarrassment I felt going to the ER because I stepped off a curb too hard and fractured my foot 🤦🏻‍♀️), abdominal hernia repair surgery from purging (yes, this happens and extremely painful recovery), reactive hypoglycemia, and now heart issues I just found out about last month that may not be fixable. \n\nSo no, you don’t have to be UW or have had numerous or even one inpatient stay or IOP or PHP treatment to experience any of these consequences. I’ve been in recovery for five years and my body is still trying to catch up and falling apart at the same time. I truly wish someone would have advised my mother and me of the consequences of chronic dieting growing up since 10 years old (this is when my mother enrolled me in weight watchers but always had my food monitored since I was a “chubby” kid) and then developing a 10 off and on year long battle with an eating disorder starting at 18. Instead, unfortunately, I was always told I needed to lose weight by medical professionals. My body NEEDED that weight. Oh, I’m also the shortest one in my family so there’s that too (growth restriction). \n\nYou are not immune from these consequences. I thought I was the exception. I kept telling myself this was okay. This is what doctors told me to do. Thought if I have a wonderful career, a PhD, (humbling stating the following to give an example) a decent income for a single middle aged woman, all my needs and wants met-I would be okay. I would tell myself I NEEDED my ED to cope to get where I am today and then I’ll be okay and it will magically go away with no consequences. Nope…I hit 30 and all my health issues started and I had been IN RECOVERY for two years before this and I am still paying the consequences to this day. \n\nI’m up right now at 2 am typing this with severe acid reflux and unable to sleep because I had vegetables with my dinner. Yes, vegetables. I can’t sleep because my stomach is on fire. Already took all the medication I can to no avail. \n\nPLUS what hurts the most is the years I wasted on this terrible disease and how much I suffered. The money spent on healthcare is in the six figures WITH insurance here in the US and this isn’t all my outpatient treatment copays and out of pocket expenses with my specialized psychologist and dietician for the last 8 years. \n\nGet help NOW, please. Even if it’s just having one “extra” food item a day to start. If not for you, but for the people before you telling you this WILL be your life in the years to come. The consequences do not discriminate.",
          "created_utc": 1744527214.0
        },
        {
          "id": "mmv5k2j",
          "author": "Afraid-Firefighter92",
          "body": "Came back to say: for those experiencing bladder problems from anorexia look up interstitial cystitis. In a nutshell it’s when the uterine wall becomes weak because of chronic dehydration and changes it genetic make up to “over compensate” for all the acid that builds up when you’re dehydrated. So now when you actually eat highly acid foods (soda, oranges, limes,etc.) it flares up the uterine wall. Think of your bladder having PTSD and anytime you eat a certain threshold of something acidic it has a flashback and wants to get rid of it quick to avoid further damage. It does this through the urgency to urinate and pain. This is SUPER simplified it’s more complex but looking at what were my bladders “trigger” foods has helped heal the bladder lining. Unfortunately it’s a lot of trial and error. Eat something acidic (like lemonade- this sends me to the er in pain) and see how you react. \n\nI’m NOT a medical provider so take this with a grain of salt and do what’s best for you and consult a urologist. This is what has helped ME: take prelief before you eat anything acidic. This can be found over the counter. However, you cannot take this daily because it will cause kidney stones. It is just meant as an occasional supplement to help. Drink enough water to flush your bladder daily even if you choose not to eat. The acidity in your blood has to leave your body somehow. A heating pad helps with the pain. Work with your dietician to see what foods you’re eating that could be too acidic. This does NOT mean do not eat them. You may just need to take prelief beforehand. Amazon also sells urine acidity strips. This helps to know whether you need to drink more water. Lastly, make sure you do not have an untreated UTI.",
          "created_utc": 1744531813.0
        }
      ]
    },
    {
      "id": "mmqzyjz",
      "author": "BallSufficient5671",
      "body": "No , there are very many physical consequences that cannot be fixed once theyre messed up. I know after thirty years of anorexia. It's not all reversible ",
      "created_utc": 1744473065.0,
      "score": 5,
      "context": [
        {
          "id": "mmqrvdq",
          "author": "Shuyuya",
          "body": "For me what limited the disease was the brain damages from lack of nutrients and water. The rest idc.",
          "created_utc": 1744470496.0
        },
        {
          "id": "mmqs3so",
          "author": "Shuyuya",
          "body": "Everything can pretty much be recovered and helped with, with medication and healing but not brain functions.",
          "created_utc": 1744470572.0
        }
      ]
    },
    {
      "id": "mmqvvvm",
      "author": "Coffeegreysky12",
      "body": "Thank you for the info",
      "created_utc": 1744471794.0,
      "score": 1,
      "context": [
        {
          "id": "mmqrvdq",
          "author": "Shuyuya",
          "body": "For me what limited the disease was the brain damages from lack of nutrients and water. The rest idc.",
          "created_utc": 1744470496.0
        },
        {
          "id": "mmqs3so",
          "author": "Shuyuya",
          "body": "Everything can pretty much be recovered and helped with, with medication and healing but not brain functions.",
          "created_utc": 1744470572.0
        }
      ]
    },
    {
      "id": "mmsy82v",
      "author": "None",
      "body": "I’m not sure. Anecdotally, I can say that I get VERY hot when I eat and VERY cold when I’m late eating a (planned very 3 hours) meal or snack. If I skip one altogether it’s back to hot again. It’s very hard for me to tolerate either but hot is definitely worse. I tend to wake up sweating and hot after an extended time without food. I am 36 and perimenopausal though so it’s really hard to tell how much is that and how much is the lingering consequences of AN. As for weight gain helping I am currently at an “obese” BMI and it is better than it was before but also I think age and hormonal fluctuations have played a role in that too.",
      "created_utc": 1744495961.0,
      "score": 1,
      "context": [
        {
          "id": "mmmsl1z",
          "author": "None",
          "body": "My favorite warning to give people who can turn back now is METABOLIC SYNDROME IS REAL AND IT CAN BE LONG TERM OR PERMANENT. I have it. I am fat now and there’s zero disordered behaviors that can “fix” it. My body simultaneously blows through anything I give it (if I don’t shit it out first) AND has no idea what to do with it so it just sits there on my body. It’s not fun. It’s incredibly dysphoric. We’re talking a lifetime of unstable blood sugar, heart palpitations bc while my metabolism is constantly in the on position it does nothing but make me exhausted, unreliable digestion including DAILY diarrhea and needing to always be near a bathroom. If you think you hate food now just wait until it causes you immediate pain but you HAVE TO eat frequently or feel like death. Nausea, hot flashes, headaches… it makes your body so time consuming. \n\nIt’s manageable eventually but this will be my life for the foreseeable future if not forever and it’s not something I’d wish on anyone.",
          "created_utc": 1744406787.0
        },
        {
          "id": "mmqzhpe",
          "author": "BallSufficient5671",
          "body": "Is your hypothalmus also malgunctioned to where you can't regulate your body temperature and your now in like hot flash mode to where you're feeling hot all the time with severe heat intolerance? I never feel cold, just severely hot \n\n\n Because that's what is happening with me after thirty years of anorexia. My endocrinologist and gynecologist think that most of this hotness is caused by 30 yrs of anorexia and aren't sure if gaining weight would fix my hypothalmus or if this heat intolerance is permanent. Has your Dr told you if the temperature thing is permanent or can it be fixed with weight gain?",
          "created_utc": 1744472921.0
        }
      ]
    },
    {
      "id": "mmr2v1q",
      "author": "BallSufficient5671",
      "body": "Exactly... like I would love it if impatient were the answer and if that would just get me to get all these things to go away I would do it again in a heartbeat. But I fear that after five hospitalizations, that this wouldn't be any different. The problem is all they do.Is medically stabilize you and I mean barely but then you still have all your medical complications and your left to go home still under weight and with no dietician no help of any kind. And i'm disabled so I can't afford to pay a dietician since they're not covered by insurance and I'm poor as can be. So, therefore, any progress that was made during recovery?I can't continue outside of treatment.And I end up going back to my regular.Eating patterns which is restricting losing what weight that I gained and not ever being weighing enough to be able to get anything to work properly again if it were going to.   \n\n\nLike they either need to keep you long enough to keep you to a healthy weight and then teach you how to maintain it outside of impatient or if they're gonna let you go when you're still under weight.They need to set app services that are paid for to help you.Get to a healthy weight and then teach you how to maintain it on your own at home.",
      "created_utc": 1744473966.0,
      "score": 2,
      "context": [
        {
          "id": "mmqxelj",
          "author": "BallSufficient5671",
          "body": "I've had anorexia for 30 years now and I am 40 almost 41.And I can tell you that I have so many medical complications.It's unreal. I have severe osteoporosis , elevated liver enzymes and Permanent damage in both my brain and body. The worst part for me is I have what's called hypothemic dysfunction from the years of no periods and anorexia making my hypothesis not be able to regulate my temperature. \nThey want me to go to treatment again and gain weight to see if that hotness will go away with wt gain treatment. But I was told by endocrinologist and gynecologist who aren't Ed specialists if course thatvmy hypothalmus dysfunctuon may never be fixable and that the severe heat intolerance and feeling severely hot 24/7 may nit go away even with wt gain. \n\n\nSo that is what is keeping me from getting treatment again?Is I feel like what's the point if they're saying that that won't get better? Also i've been to impatient treatment five times in my life and it's never helped anything before. But back then I didn't have this symptom. ",
          "created_utc": 1744472273.0
        },
        {
          "id": "mmqzvmh",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing and I am sorry you are going through this. Yes, I am afraid some of my medical issues can't be fixed, so I am right there with you. My inpatients never helped me either. I know it helps some people, but i always found inpatient so stressful and that they did very little in addressing why I have so much anxiety around eating. I think recovering from anorexia takes more than inpatient treatment. I think it takes an entire treatment team that you have when you are back home. But inpatient can work for medical stability",
          "created_utc": 1744473041.0
        }
      ]
    },
    {
      "id": "mmnqeq6",
      "author": "shakethedisease666",
      "body": "Yes, their “solution” was to have a psychologist come to see me once a week and she would just ask me things like what is wrong with my family or why I don’t have friends",
      "created_utc": 1744418886.0,
      "score": 2,
      "context": [
        {
          "id": "mmno5j6",
          "author": "shakethedisease666",
          "body": "The worst thing I suffer with when being treated inpatient or outpatient is they would always consider my avoidance of foods automatically as “bad relationship with food” even if my issue was a texture issue. I can eat anything as long as it does have a cold slimy texture or smell like/feel like eggs. I was punished for this. Every time I explained and they still punished me for this.",
          "created_utc": 1744418020.0
        },
        {
          "id": "mmnopy6",
          "author": "Coffeegreysky12",
          "body": "I understand. I have sensory issues and certain textures and tastes bother me, but no one in inpatient took the time to understand this. I felt like I was being punished or like I was just overreacting.",
          "created_utc": 1744418240.0
        }
      ]
    },
    {
      "id": "mmmsdta",
      "author": "Coffeegreysky12",
      "body": "Exactly. You never think it will happen to you, until it does",
      "created_utc": 1744406721.0,
      "score": 18,
      "context": [
        {
          "id": "mmmp1tk",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Let me scare y’all even more. I was literally paralyzed to my elbows because of my eating disorder. It took 10 years to catch up to me and I got something called guillen barre syndrome from the stress I put on my body. PARALYZED you guys. Save yourselves 😭",
          "created_utc": 1744405631.0
        },
        {
          "id": "mmmpt5q",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing. This is an awful disorder and it can cause so many medical issues.",
          "created_utc": 1744405879.0
        },
        {
          "id": "mmmrxr1",
          "author": "yeaahhhhhhhhhhhh",
          "body": "And you never think it will happen to you 😭😭 we always think we’ll be the one exception",
          "created_utc": 1744406575.0
        }
      ]
    },
    {
      "id": "mmmyyht",
      "author": "nihilist_fox",
      "body": "This!!! Exactly!",
      "created_utc": 1744408915.0,
      "score": 11,
      "context": [
        {
          "id": "mmmp1tk",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Let me scare y’all even more. I was literally paralyzed to my elbows because of my eating disorder. It took 10 years to catch up to me and I got something called guillen barre syndrome from the stress I put on my body. PARALYZED you guys. Save yourselves 😭",
          "created_utc": 1744405631.0
        },
        {
          "id": "mmmpt5q",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing. This is an awful disorder and it can cause so many medical issues.",
          "created_utc": 1744405879.0
        },
        {
          "id": "mmmrxr1",
          "author": "yeaahhhhhhhhhhhh",
          "body": "And you never think it will happen to you 😭😭 we always think we’ll be the one exception",
          "created_utc": 1744406575.0
        }
      ]
    },
    {
      "id": "mmn7v50",
      "author": "Coffeegreysky12",
      "body": "Thank you",
      "created_utc": 1744412060.0,
      "score": 2,
      "context": [
        {
          "id": "mmn4q18",
          "author": "collectedd",
          "body": "I have a lot of things that have either been caused or worsened by my Anorexia Nervosa - it's hard to say what caused what considering I've got underlying genetic health issues but also have had AN since I was a young child.\n\nI've lost my hair, lost function in my bladder (Bladder Failure), Severe Gastroparesis, Osteoporosis, have brain atrophy/brain damage causing Ataxia, etc. \n\nIt's horrible.",
          "created_utc": 1744410937.0
        },
        {
          "id": "mmn5c88",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing what you are experiencing and I hope you start feeling better.",
          "created_utc": 1744411160.0
        },
        {
          "id": "mmn7o5l",
          "author": "collectedd",
          "body": "Same to you! I am currently hospitalised, but hopefully will be out soon. Anorexia is horrible.",
          "created_utc": 1744411993.0
        }
      ]
    },
    {
      "id": "mmnc4qu",
      "author": "Coffeegreysky12",
      "body": "Thank you",
      "created_utc": 1744413577.0,
      "score": 5,
      "context": [
        {
          "id": "mmn9sae",
          "author": "garnetandjade",
          "body": "I have osteoporosis, prolonged QT syndrome which could lead to sudden death, ventricular enlargement, mitral valve prolapse, gastritis, small intestine inflammation, colitis, liver injury, kidney injury, have endured metabolic acidosis multiple times, have 4 good teeth and the rest need to be crowned or removed/implants, and I live in constant pain. I’ve had the disease for over 15 years, but the damage started EARLY. I agree… you don’t realize that it becomes nearly impossible to gain it back after a certain point. I hope the younger people on here can see this and they ask for help. I’m not pushing recovery on anyone, because I would be a hypocrite as I didn’t start to recover until I almost died, and am only several weeks into hospitalization. And btw, I almost died well OVER my lowest weight… you do not need to be skeletal to be actively dying. Fuck anorexia. Fuck this disease. I wish someone had intervened when I was young and crying out for help. I wish I could help even one single other person to say fuck this disorder",
          "created_utc": 1744412738.0
        },
        {
          "id": "mmnaayg",
          "author": "Coffeegreysky12",
          "body": "Yes, this is an awful disorder. I'm sorry for all that you have gone through. I hope people see my post and reach out for help.",
          "created_utc": 1744412922.0
        },
        {
          "id": "mmnbnse",
          "author": "garnetandjade",
          "body": "It’s a really important post. I appreciate your vulnerability and the thought you put into it.",
          "created_utc": 1744413406.0
        }
      ]
    },
    {
      "id": "mmn0e9u",
      "author": "Coffeegreysky12",
      "body": "Thank you. I appreciate the support",
      "created_utc": 1744409409.0,
      "score": 3,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        },
        {
          "id": "mmmydf4",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing what you've gone through. This disorder causes so many health issues. Yes, this disorder will make everything in life so much more difficult. I dislike how it gets romanticized too. There's nothing glamorous about it. It slowly takes away so much away from the person going through it. I have a pretty good support system around me which keeps me from feeling alone. But it's really an all consuming disorder. I wish I could go back in time and talk to my younger self. I'm trying to stay positive, but some days, it's not easy. I hope we can both start to feel better.",
          "created_utc": 1744408716.0
        },
        {
          "id": "mmmzlzo",
          "author": "nihilist_fox",
          "body": "I’m sending you strength, and love. You deserve to feel better, and to live again. We all do. Keep that positivity, even if it’s hard, and hold on to that support system. That saves lives, believe me, I wish I had one, it’s really important. \n\nI believe in you xx",
          "created_utc": 1744409139.0
        }
      ]
    },
    {
      "id": "mmr2a26",
      "author": "BallSufficient5671",
      "body": "I have and they've never heard of this complication so they don't know what to do about it.  Now, if I were in an eating disorder facility, I would definitely love to know what their doctors would say, but as far as regular doctors that aren't familiar with eating disorders, they don't know what to do to help me. They tried Harmon replacement therapy with an estrogen patch and progesterone last year.And it didn't even help, but maybe 10%.So even though my hormones are low , they don't feel that's the only cause. They feel that a typoc dysfunction caused by years of anorexia.And being underweight. But the thing they're not knowing is they don't know if that will regulate if I get to a normal weight again after thirty years of having such bad anorexia and like 5 periods my entire life. ",
      "created_utc": 1744473783.0,
      "score": 2,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        },
        {
          "id": "mmqymzu",
          "author": "BallSufficient5671",
          "body": "To you too have hypothetic dysfunction which is where your body can't regulate its temperature and you're hot all the time? Because I am never cold anymore ever...it's that i'm always severely hot with hotness 24/7 and severe heat intolerance. \n\n\nMy endocrinologist and gynecologist are not eating disorder specialists but they believe that this is due to my anorexia turning off my hypothesis from regulating properly causing the hotness. The problem is they're not sure that with me having this for thirty years , if weight gain would even turn my hypothalmus back on and get it to work properly and take my severe hotness and heat intolerance away. So obviously i'm afraid to detreatment again unless I knew that that would actually fix itself. Plus i've been impatient five times so i've used all my insurance and money already. \n\n\nSo do you have this severe heat intolerance and feeling hot all the time? Has your doctors told you if weight gain would make this symptom go away and regulate your hypothesis? My drs don't know. Does yours?",
          "created_utc": 1744472656.0
        },
        {
          "id": "mmqz78j",
          "author": "Coffeegreysky12",
          "body": "I actually feel cold all the time, even in warm weather. I wish I could give you some advice, but I've never experienced feeling too hot. I would suggest you ask a medical professional",
          "created_utc": 1744472830.0
        }
      ]
    },
    {
      "id": "mmpwj03",
      "author": "Listen_Successful",
      "body": "I’m so sorry that all of this has happened to you. You expressed the real feelings and destruction caused by AN.\n May G-d bless you. You have helped myself and others suffering with restrictive eating disorders. ❤️💕💕💕💕",
      "created_utc": 1744458851.0,
      "score": 3,
      "context": [
        {
          "id": "mmnp9sa",
          "author": "mylostzebra",
          "body": "Tooth loss early , vision problems weakness \n\nAnd omg the horrid PATULOUS EARS after the fat grt eaten from the ear.  My bowel  bladder., energy \n\nBUT I have to say that it was mourning my time I lost in life. THATA IS eveb worse than the constant body parts falling apart because it hits you one day \"my life never mattered and won't '\nMy mental health was Way worse. \n. \nI began at 9. And I djnt cou t the years I was immersed in it as eveb being alive because I was just a body with no thoughts, ideas,plans, feelings that were only mine, they were me and my ED\nSo\nI wasn't alive from age 9 to 45. Minus 14.5 yeara jf recovery. \nTake note I said 45.\nIts a myrh that it cant come back   \nThere used to be very few people over 40 with and today its a growingnahe group,  old mellenials like me and gen x arenfull of ed \nOddly, we were the 90s boom ED of the comeback of twiggy. Now we hit 40 and we are at it ahain, sick and in pain and having body failing early all ober  . here we again at it. \nThere are horrible things its done physically. God wait till people start dealing with PET disorder . \nBut you begin thinking how useless this all was  \n\nAs we age we find out that most people are involved in their own heads about themselves.  \nAnd we live our life thinking we are center stage.  Wondering who noticed a gain . Who noticed a loss. \nFrankly NO ONE  And whoever does ,doesn't even care. \nIt's on our minds. The ed literally drives every thought, feeling,decision, action. \nBesides PET and loss of teeth , vision peeing, pooping etc \n\nThe WORST thing is that it took my whole life. \n\nI did nothing that matters. \nNo kids was scared to be fat.\nNo loving another person when your busy dealing with health issues so much you can't meat men and when u date it's exhausting.  \nAnd the thoughts that take over your brain. \n\nYou notice that other people around you really LIVE LIVES. \n\nThey are having moments that passed us because we are wrapped into this  \nWhen other laugh it's real laughs. When I laugh I hope I didn't look fat  in my stomach  . \nThey have actual fulfillment.  We don't we aren't in our brains and we can't be in our bodies  it's the ed that is. \nSo we are walking zombies \n\nI realized my whole life - is wasn't existing.\n\nI absolutely put nothing into this world. And what's even worse is there are so many people and even kids that are a part of this word and love life and it gets taken away from them ,but we are dead inside and falling apart but still stuck alive. \nTalk about feeling guilty. \nPeople get sick of you being sick and push away to go live life  \nWe go back into our heads with our ed  \nYou spend your life making your body the way you want it,  and during that time- WE LOST TIME.  \n \nJust When u get that perfect wieght and you love seeing all the bones, you start to fall apart.  \n.\nI wish I could go back in time during  14 years of real recovery.  But then there comes that relapse that was \"impossible\"\n\nI regret evey bit of time i wasted. I wanted to actually live a life of doing what would make an impact.  Get married and settle down. \n\nNo significant other wants to deal with the issues.  And when the health problems start those vows suddenly mean crap cuy you are dragging them down.  \nIt just made my vidy fall apart early  \n\nAnd again- the actual QUESTION IS.... WHAT MAKES BEING TOO THIN MY IDENTITY? WHEN DID THAT HAPPEN AND WHERE DID I GO? \n\n So what did we do it for if it got us nothing in life. Not money not love not happiness not changing anything for the good. We didn't participate. \n\nI lost not just a physical body ,but I never had an actual life to live because it ruined everything and it wasn't ME. It was the ed living it. \n\nMourning is the worst thing.  But patulous ear is really something that will drive you mad",
          "created_utc": 1744418452.0
        },
        {
          "id": "mmnqa86",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing. Eating disorders take away so much and give nothing in return. I regret not getting help sooner.",
          "created_utc": 1744418839.0
        },
        {
          "id": "mmnuba4",
          "author": "mylostzebra",
          "body": "I'm sorry for you as well  maybe we were born with adduction tendency and this became ours instead of drugs. I do think sometimes we are born with them",
          "created_utc": 1744420375.0
        }
      ]
    },
    {
      "id": "mmr5yz0",
      "author": "Shuyuya",
      "body": "I meant either that or managed with medication, but the brain shrinkage and other stuff that I’ve read scare me more personally",
      "created_utc": 1744474945.0,
      "score": 2,
      "context": [
        {
          "id": "mmqrvdq",
          "author": "Shuyuya",
          "body": "For me what limited the disease was the brain damages from lack of nutrients and water. The rest idc.",
          "created_utc": 1744470496.0
        },
        {
          "id": "mmqs3so",
          "author": "Shuyuya",
          "body": "Everything can pretty much be recovered and helped with, with medication and healing but not brain functions.",
          "created_utc": 1744470572.0
        },
        {
          "id": "mmqzyjz",
          "author": "BallSufficient5671",
          "body": "No , there are very many physical consequences that cannot be fixed once theyre messed up. I know after thirty years of anorexia. It's not all reversible ",
          "created_utc": 1744473065.0
        }
      ]
    },
    {
      "id": "mngm0os",
      "author": "BallSufficient5671",
      "body": "I'm 41 years old so my doctors are wondering the same thing. they're not sure how much of it is caused by anorexia(30yrs) and being underweight and how much of it is caused by my hormones although my hormones do show that they are low but not menopausal. \n\n\nAll I know is I've been hot for the last 8 year and i've not been in recovery since I was thirty one. Even when I was in treatment centers , I remember always asking them to put my Air conditioning on when no one else was hot but me. \n\n\nBut back then at least I was still getting cold. Now i'm only hot and nothing seems to relieve it. So doctors aren't sure if I were to gain weight if That would help it or if it would still be permanently malfunctioned.But they do think that the anorexia is a huge cause in my hypothalmus not working right. I would gain weight in an instant if I knew that that would get this hotness to go away.But since they don't know , i'm very fearful to do that.\n\n\nPlus they said it wouldn't happen right away that it would probably take a couple years and I have so much weight to gain that I would have to go to a treatment center And I can't do that because i'm out of insurance and don't have the money for that since i've been 5x already",
      "created_utc": 1744831580.0,
      "score": 1,
      "context": [
        {
          "id": "mmmsl1z",
          "author": "None",
          "body": "My favorite warning to give people who can turn back now is METABOLIC SYNDROME IS REAL AND IT CAN BE LONG TERM OR PERMANENT. I have it. I am fat now and there’s zero disordered behaviors that can “fix” it. My body simultaneously blows through anything I give it (if I don’t shit it out first) AND has no idea what to do with it so it just sits there on my body. It’s not fun. It’s incredibly dysphoric. We’re talking a lifetime of unstable blood sugar, heart palpitations bc while my metabolism is constantly in the on position it does nothing but make me exhausted, unreliable digestion including DAILY diarrhea and needing to always be near a bathroom. If you think you hate food now just wait until it causes you immediate pain but you HAVE TO eat frequently or feel like death. Nausea, hot flashes, headaches… it makes your body so time consuming. \n\nIt’s manageable eventually but this will be my life for the foreseeable future if not forever and it’s not something I’d wish on anyone.",
          "created_utc": 1744406787.0
        },
        {
          "id": "mmqzhpe",
          "author": "BallSufficient5671",
          "body": "Is your hypothalmus also malgunctioned to where you can't regulate your body temperature and your now in like hot flash mode to where you're feeling hot all the time with severe heat intolerance? I never feel cold, just severely hot \n\n\n Because that's what is happening with me after thirty years of anorexia. My endocrinologist and gynecologist think that most of this hotness is caused by 30 yrs of anorexia and aren't sure if gaining weight would fix my hypothalmus or if this heat intolerance is permanent. Has your Dr told you if the temperature thing is permanent or can it be fixed with weight gain?",
          "created_utc": 1744472921.0
        },
        {
          "id": "mmsy82v",
          "author": "None",
          "body": "I’m not sure. Anecdotally, I can say that I get VERY hot when I eat and VERY cold when I’m late eating a (planned very 3 hours) meal or snack. If I skip one altogether it’s back to hot again. It’s very hard for me to tolerate either but hot is definitely worse. I tend to wake up sweating and hot after an extended time without food. I am 36 and perimenopausal though so it’s really hard to tell how much is that and how much is the lingering consequences of AN. As for weight gain helping I am currently at an “obese” BMI and it is better than it was before but also I think age and hormonal fluctuations have played a role in that too.",
          "created_utc": 1744495961.0
        }
      ]
    },
    {
      "id": "mmr6rjq",
      "author": "Coffeegreysky12",
      "body": "I am sorry to hear this. I wish I could give you some advice, but I don't have any. But I understand how frustrating that can be",
      "created_utc": 1744475195.0,
      "score": 2,
      "context": [
        {
          "id": "mmqxelj",
          "author": "BallSufficient5671",
          "body": "I've had anorexia for 30 years now and I am 40 almost 41.And I can tell you that I have so many medical complications.It's unreal. I have severe osteoporosis , elevated liver enzymes and Permanent damage in both my brain and body. The worst part for me is I have what's called hypothemic dysfunction from the years of no periods and anorexia making my hypothesis not be able to regulate my temperature. \nThey want me to go to treatment again and gain weight to see if that hotness will go away with wt gain treatment. But I was told by endocrinologist and gynecologist who aren't Ed specialists if course thatvmy hypothalmus dysfunctuon may never be fixable and that the severe heat intolerance and feeling severely hot 24/7 may nit go away even with wt gain. \n\n\nSo that is what is keeping me from getting treatment again?Is I feel like what's the point if they're saying that that won't get better? Also i've been to impatient treatment five times in my life and it's never helped anything before. But back then I didn't have this symptom. ",
          "created_utc": 1744472273.0
        },
        {
          "id": "mmqzvmh",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing and I am sorry you are going through this. Yes, I am afraid some of my medical issues can't be fixed, so I am right there with you. My inpatients never helped me either. I know it helps some people, but i always found inpatient so stressful and that they did very little in addressing why I have so much anxiety around eating. I think recovering from anorexia takes more than inpatient treatment. I think it takes an entire treatment team that you have when you are back home. But inpatient can work for medical stability",
          "created_utc": 1744473041.0
        },
        {
          "id": "mmr2v1q",
          "author": "BallSufficient5671",
          "body": "Exactly... like I would love it if impatient were the answer and if that would just get me to get all these things to go away I would do it again in a heartbeat. But I fear that after five hospitalizations, that this wouldn't be any different. The problem is all they do.Is medically stabilize you and I mean barely but then you still have all your medical complications and your left to go home still under weight and with no dietician no help of any kind. And i'm disabled so I can't afford to pay a dietician since they're not covered by insurance and I'm poor as can be. So, therefore, any progress that was made during recovery?I can't continue outside of treatment.And I end up going back to my regular.Eating patterns which is restricting losing what weight that I gained and not ever being weighing enough to be able to get anything to work properly again if it were going to.   \n\n\nLike they either need to keep you long enough to keep you to a healthy weight and then teach you how to maintain it outside of impatient or if they're gonna let you go when you're still under weight.They need to set app services that are paid for to help you.Get to a healthy weight and then teach you how to maintain it on your own at home.",
          "created_utc": 1744473966.0
        }
      ]
    },
    {
      "id": "mmr2opl",
      "author": "Coffeegreysky12",
      "body": "I've never heard of it before either. Perhaps you can do more research on it. Try to find a doctor that specializes in anorexia and has knowledge about this disorder.",
      "created_utc": 1744473911.0,
      "score": 2,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        },
        {
          "id": "mmqymzu",
          "author": "BallSufficient5671",
          "body": "To you too have hypothetic dysfunction which is where your body can't regulate its temperature and you're hot all the time? Because I am never cold anymore ever...it's that i'm always severely hot with hotness 24/7 and severe heat intolerance. \n\n\nMy endocrinologist and gynecologist are not eating disorder specialists but they believe that this is due to my anorexia turning off my hypothesis from regulating properly causing the hotness. The problem is they're not sure that with me having this for thirty years , if weight gain would even turn my hypothalmus back on and get it to work properly and take my severe hotness and heat intolerance away. So obviously i'm afraid to detreatment again unless I knew that that would actually fix itself. Plus i've been impatient five times so i've used all my insurance and money already. \n\n\nSo do you have this severe heat intolerance and feeling hot all the time? Has your doctors told you if weight gain would make this symptom go away and regulate your hypothesis? My drs don't know. Does yours?",
          "created_utc": 1744472656.0
        },
        {
          "id": "mmqz78j",
          "author": "Coffeegreysky12",
          "body": "I actually feel cold all the time, even in warm weather. I wish I could give you some advice, but I've never experienced feeling too hot. I would suggest you ask a medical professional",
          "created_utc": 1744472830.0
        },
        {
          "id": "mmr2a26",
          "author": "BallSufficient5671",
          "body": "I have and they've never heard of this complication so they don't know what to do about it.  Now, if I were in an eating disorder facility, I would definitely love to know what their doctors would say, but as far as regular doctors that aren't familiar with eating disorders, they don't know what to do to help me. They tried Harmon replacement therapy with an estrogen patch and progesterone last year.And it didn't even help, but maybe 10%.So even though my hormones are low , they don't feel that's the only cause. They feel that a typoc dysfunction caused by years of anorexia.And being underweight. But the thing they're not knowing is they don't know if that will regulate if I get to a normal weight again after thirty years of having such bad anorexia and like 5 periods my entire life. ",
          "created_utc": 1744473783.0
        }
      ]
    },
    {
      "id": "mmr7d0k",
      "author": "BallSufficient5671",
      "body": "Yeah , everyone's different , but I know that my heat intolerance can't be fixed with medication because they've tried",
      "created_utc": 1744475386.0,
      "score": 1,
      "context": [
        {
          "id": "mmqrvdq",
          "author": "Shuyuya",
          "body": "For me what limited the disease was the brain damages from lack of nutrients and water. The rest idc.",
          "created_utc": 1744470496.0
        },
        {
          "id": "mmqs3so",
          "author": "Shuyuya",
          "body": "Everything can pretty much be recovered and helped with, with medication and healing but not brain functions.",
          "created_utc": 1744470572.0
        },
        {
          "id": "mmqzyjz",
          "author": "BallSufficient5671",
          "body": "No , there are very many physical consequences that cannot be fixed once theyre messed up. I know after thirty years of anorexia. It's not all reversible ",
          "created_utc": 1744473065.0
        },
        {
          "id": "mmr5yz0",
          "author": "Shuyuya",
          "body": "I meant either that or managed with medication, but the brain shrinkage and other stuff that I’ve read scare me more personally",
          "created_utc": 1744474945.0
        }
      ]
    },
    {
      "id": "mmr7h46",
      "author": "BallSufficient5671",
      "body": ". I hope you feel better too",
      "created_utc": 1744475421.0,
      "score": 2,
      "context": [
        {
          "id": "mmqxelj",
          "author": "BallSufficient5671",
          "body": "I've had anorexia for 30 years now and I am 40 almost 41.And I can tell you that I have so many medical complications.It's unreal. I have severe osteoporosis , elevated liver enzymes and Permanent damage in both my brain and body. The worst part for me is I have what's called hypothemic dysfunction from the years of no periods and anorexia making my hypothesis not be able to regulate my temperature. \nThey want me to go to treatment again and gain weight to see if that hotness will go away with wt gain treatment. But I was told by endocrinologist and gynecologist who aren't Ed specialists if course thatvmy hypothalmus dysfunctuon may never be fixable and that the severe heat intolerance and feeling severely hot 24/7 may nit go away even with wt gain. \n\n\nSo that is what is keeping me from getting treatment again?Is I feel like what's the point if they're saying that that won't get better? Also i've been to impatient treatment five times in my life and it's never helped anything before. But back then I didn't have this symptom. ",
          "created_utc": 1744472273.0
        },
        {
          "id": "mmqzvmh",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing and I am sorry you are going through this. Yes, I am afraid some of my medical issues can't be fixed, so I am right there with you. My inpatients never helped me either. I know it helps some people, but i always found inpatient so stressful and that they did very little in addressing why I have so much anxiety around eating. I think recovering from anorexia takes more than inpatient treatment. I think it takes an entire treatment team that you have when you are back home. But inpatient can work for medical stability",
          "created_utc": 1744473041.0
        },
        {
          "id": "mmr2v1q",
          "author": "BallSufficient5671",
          "body": "Exactly... like I would love it if impatient were the answer and if that would just get me to get all these things to go away I would do it again in a heartbeat. But I fear that after five hospitalizations, that this wouldn't be any different. The problem is all they do.Is medically stabilize you and I mean barely but then you still have all your medical complications and your left to go home still under weight and with no dietician no help of any kind. And i'm disabled so I can't afford to pay a dietician since they're not covered by insurance and I'm poor as can be. So, therefore, any progress that was made during recovery?I can't continue outside of treatment.And I end up going back to my regular.Eating patterns which is restricting losing what weight that I gained and not ever being weighing enough to be able to get anything to work properly again if it were going to.   \n\n\nLike they either need to keep you long enough to keep you to a healthy weight and then teach you how to maintain it outside of impatient or if they're gonna let you go when you're still under weight.They need to set app services that are paid for to help you.Get to a healthy weight and then teach you how to maintain it on your own at home.",
          "created_utc": 1744473966.0
        },
        {
          "id": "mmr6rjq",
          "author": "Coffeegreysky12",
          "body": "I am sorry to hear this. I wish I could give you some advice, but I don't have any. But I understand how frustrating that can be",
          "created_utc": 1744475195.0
        }
      ]
    },
    {
      "id": "mmr5hps",
      "author": "BallSufficient5671",
      "body": "I've tried googling it.I've tried asking in this forum but it seems like nobody else has experienced this, but me period and the other thing is, if they did experience it.It was just when they were, you know?Going through recovery which I know that that is normal but they've never experienced it when they were restricting.  \n\n\nWhen you're an adult there is no anorexia doctor as far as I know? I mean.\nI don't know who to ask unless I try calling like an Ed treatment center. But they're not gonna answer me because I feel like they're gonna try to get you to go into treatment.And they're probably gonna tell you anything and everything even lies just to get you to go into treatment. I've Google it and Google it.And I can't figure it out on my own",
      "created_utc": 1744474795.0,
      "score": 1,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        },
        {
          "id": "mmqymzu",
          "author": "BallSufficient5671",
          "body": "To you too have hypothetic dysfunction which is where your body can't regulate its temperature and you're hot all the time? Because I am never cold anymore ever...it's that i'm always severely hot with hotness 24/7 and severe heat intolerance. \n\n\nMy endocrinologist and gynecologist are not eating disorder specialists but they believe that this is due to my anorexia turning off my hypothesis from regulating properly causing the hotness. The problem is they're not sure that with me having this for thirty years , if weight gain would even turn my hypothalmus back on and get it to work properly and take my severe hotness and heat intolerance away. So obviously i'm afraid to detreatment again unless I knew that that would actually fix itself. Plus i've been impatient five times so i've used all my insurance and money already. \n\n\nSo do you have this severe heat intolerance and feeling hot all the time? Has your doctors told you if weight gain would make this symptom go away and regulate your hypothesis? My drs don't know. Does yours?",
          "created_utc": 1744472656.0
        },
        {
          "id": "mmqz78j",
          "author": "Coffeegreysky12",
          "body": "I actually feel cold all the time, even in warm weather. I wish I could give you some advice, but I've never experienced feeling too hot. I would suggest you ask a medical professional",
          "created_utc": 1744472830.0
        },
        {
          "id": "mmr2a26",
          "author": "BallSufficient5671",
          "body": "I have and they've never heard of this complication so they don't know what to do about it.  Now, if I were in an eating disorder facility, I would definitely love to know what their doctors would say, but as far as regular doctors that aren't familiar with eating disorders, they don't know what to do to help me. They tried Harmon replacement therapy with an estrogen patch and progesterone last year.And it didn't even help, but maybe 10%.So even though my hormones are low , they don't feel that's the only cause. They feel that a typoc dysfunction caused by years of anorexia.And being underweight. But the thing they're not knowing is they don't know if that will regulate if I get to a normal weight again after thirty years of having such bad anorexia and like 5 periods my entire life. ",
          "created_utc": 1744473783.0
        },
        {
          "id": "mmr2opl",
          "author": "Coffeegreysky12",
          "body": "I've never heard of it before either. Perhaps you can do more research on it. Try to find a doctor that specializes in anorexia and has knowledge about this disorder.",
          "created_utc": 1744473911.0
        }
      ]
    },
    {
      "id": "mmr7o3g",
      "author": "Coffeegreysky12",
      "body": "Thank you",
      "created_utc": 1744475482.0,
      "score": 2,
      "context": [
        {
          "id": "mmqxelj",
          "author": "BallSufficient5671",
          "body": "I've had anorexia for 30 years now and I am 40 almost 41.And I can tell you that I have so many medical complications.It's unreal. I have severe osteoporosis , elevated liver enzymes and Permanent damage in both my brain and body. The worst part for me is I have what's called hypothemic dysfunction from the years of no periods and anorexia making my hypothesis not be able to regulate my temperature. \nThey want me to go to treatment again and gain weight to see if that hotness will go away with wt gain treatment. But I was told by endocrinologist and gynecologist who aren't Ed specialists if course thatvmy hypothalmus dysfunctuon may never be fixable and that the severe heat intolerance and feeling severely hot 24/7 may nit go away even with wt gain. \n\n\nSo that is what is keeping me from getting treatment again?Is I feel like what's the point if they're saying that that won't get better? Also i've been to impatient treatment five times in my life and it's never helped anything before. But back then I didn't have this symptom. ",
          "created_utc": 1744472273.0
        },
        {
          "id": "mmqzvmh",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing and I am sorry you are going through this. Yes, I am afraid some of my medical issues can't be fixed, so I am right there with you. My inpatients never helped me either. I know it helps some people, but i always found inpatient so stressful and that they did very little in addressing why I have so much anxiety around eating. I think recovering from anorexia takes more than inpatient treatment. I think it takes an entire treatment team that you have when you are back home. But inpatient can work for medical stability",
          "created_utc": 1744473041.0
        },
        {
          "id": "mmr2v1q",
          "author": "BallSufficient5671",
          "body": "Exactly... like I would love it if impatient were the answer and if that would just get me to get all these things to go away I would do it again in a heartbeat. But I fear that after five hospitalizations, that this wouldn't be any different. The problem is all they do.Is medically stabilize you and I mean barely but then you still have all your medical complications and your left to go home still under weight and with no dietician no help of any kind. And i'm disabled so I can't afford to pay a dietician since they're not covered by insurance and I'm poor as can be. So, therefore, any progress that was made during recovery?I can't continue outside of treatment.And I end up going back to my regular.Eating patterns which is restricting losing what weight that I gained and not ever being weighing enough to be able to get anything to work properly again if it were going to.   \n\n\nLike they either need to keep you long enough to keep you to a healthy weight and then teach you how to maintain it outside of impatient or if they're gonna let you go when you're still under weight.They need to set app services that are paid for to help you.Get to a healthy weight and then teach you how to maintain it on your own at home.",
          "created_utc": 1744473966.0
        },
        {
          "id": "mmr6rjq",
          "author": "Coffeegreysky12",
          "body": "I am sorry to hear this. I wish I could give you some advice, but I don't have any. But I understand how frustrating that can be",
          "created_utc": 1744475195.0
        },
        {
          "id": "mmr7h46",
          "author": "BallSufficient5671",
          "body": ". I hope you feel better too",
          "created_utc": 1744475421.0
        }
      ]
    },
    {
      "id": "mmr791r",
      "author": "Coffeegreysky12",
      "body": "I wish I had an answer for you, but I've never done any research on this symptom. But if it keeps bothering you, then keep reaching out to doctors or a therapist.",
      "created_utc": 1744475350.0,
      "score": 2,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        },
        {
          "id": "mmqymzu",
          "author": "BallSufficient5671",
          "body": "To you too have hypothetic dysfunction which is where your body can't regulate its temperature and you're hot all the time? Because I am never cold anymore ever...it's that i'm always severely hot with hotness 24/7 and severe heat intolerance. \n\n\nMy endocrinologist and gynecologist are not eating disorder specialists but they believe that this is due to my anorexia turning off my hypothesis from regulating properly causing the hotness. The problem is they're not sure that with me having this for thirty years , if weight gain would even turn my hypothalmus back on and get it to work properly and take my severe hotness and heat intolerance away. So obviously i'm afraid to detreatment again unless I knew that that would actually fix itself. Plus i've been impatient five times so i've used all my insurance and money already. \n\n\nSo do you have this severe heat intolerance and feeling hot all the time? Has your doctors told you if weight gain would make this symptom go away and regulate your hypothesis? My drs don't know. Does yours?",
          "created_utc": 1744472656.0
        },
        {
          "id": "mmqz78j",
          "author": "Coffeegreysky12",
          "body": "I actually feel cold all the time, even in warm weather. I wish I could give you some advice, but I've never experienced feeling too hot. I would suggest you ask a medical professional",
          "created_utc": 1744472830.0
        },
        {
          "id": "mmr2a26",
          "author": "BallSufficient5671",
          "body": "I have and they've never heard of this complication so they don't know what to do about it.  Now, if I were in an eating disorder facility, I would definitely love to know what their doctors would say, but as far as regular doctors that aren't familiar with eating disorders, they don't know what to do to help me. They tried Harmon replacement therapy with an estrogen patch and progesterone last year.And it didn't even help, but maybe 10%.So even though my hormones are low , they don't feel that's the only cause. They feel that a typoc dysfunction caused by years of anorexia.And being underweight. But the thing they're not knowing is they don't know if that will regulate if I get to a normal weight again after thirty years of having such bad anorexia and like 5 periods my entire life. ",
          "created_utc": 1744473783.0
        },
        {
          "id": "mmr2opl",
          "author": "Coffeegreysky12",
          "body": "I've never heard of it before either. Perhaps you can do more research on it. Try to find a doctor that specializes in anorexia and has knowledge about this disorder.",
          "created_utc": 1744473911.0
        },
        {
          "id": "mmr5hps",
          "author": "BallSufficient5671",
          "body": "I've tried googling it.I've tried asking in this forum but it seems like nobody else has experienced this, but me period and the other thing is, if they did experience it.It was just when they were, you know?Going through recovery which I know that that is normal but they've never experienced it when they were restricting.  \n\n\nWhen you're an adult there is no anorexia doctor as far as I know? I mean.\nI don't know who to ask unless I try calling like an Ed treatment center. But they're not gonna answer me because I feel like they're gonna try to get you to go into treatment.And they're probably gonna tell you anything and everything even lies just to get you to go into treatment. I've Google it and Google it.And I can't figure it out on my own",
          "created_utc": 1744474795.0
        }
      ]
    },
    {
      "id": "n3xabc1",
      "author": "DependentSecure",
      "body": "You have the strength to figure it out- you do: You wouldn’t still be fighting so hard or seeking support otherwise",
      "created_utc": 1752889717.0,
      "score": 2,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        },
        {
          "id": "mmqymzu",
          "author": "BallSufficient5671",
          "body": "To you too have hypothetic dysfunction which is where your body can't regulate its temperature and you're hot all the time? Because I am never cold anymore ever...it's that i'm always severely hot with hotness 24/7 and severe heat intolerance. \n\n\nMy endocrinologist and gynecologist are not eating disorder specialists but they believe that this is due to my anorexia turning off my hypothesis from regulating properly causing the hotness. The problem is they're not sure that with me having this for thirty years , if weight gain would even turn my hypothalmus back on and get it to work properly and take my severe hotness and heat intolerance away. So obviously i'm afraid to detreatment again unless I knew that that would actually fix itself. Plus i've been impatient five times so i've used all my insurance and money already. \n\n\nSo do you have this severe heat intolerance and feeling hot all the time? Has your doctors told you if weight gain would make this symptom go away and regulate your hypothesis? My drs don't know. Does yours?",
          "created_utc": 1744472656.0
        },
        {
          "id": "mmqz78j",
          "author": "Coffeegreysky12",
          "body": "I actually feel cold all the time, even in warm weather. I wish I could give you some advice, but I've never experienced feeling too hot. I would suggest you ask a medical professional",
          "created_utc": 1744472830.0
        },
        {
          "id": "mmr2a26",
          "author": "BallSufficient5671",
          "body": "I have and they've never heard of this complication so they don't know what to do about it.  Now, if I were in an eating disorder facility, I would definitely love to know what their doctors would say, but as far as regular doctors that aren't familiar with eating disorders, they don't know what to do to help me. They tried Harmon replacement therapy with an estrogen patch and progesterone last year.And it didn't even help, but maybe 10%.So even though my hormones are low , they don't feel that's the only cause. They feel that a typoc dysfunction caused by years of anorexia.And being underweight. But the thing they're not knowing is they don't know if that will regulate if I get to a normal weight again after thirty years of having such bad anorexia and like 5 periods my entire life. ",
          "created_utc": 1744473783.0
        },
        {
          "id": "mmr2opl",
          "author": "Coffeegreysky12",
          "body": "I've never heard of it before either. Perhaps you can do more research on it. Try to find a doctor that specializes in anorexia and has knowledge about this disorder.",
          "created_utc": 1744473911.0
        },
        {
          "id": "mmr5hps",
          "author": "BallSufficient5671",
          "body": "I've tried googling it.I've tried asking in this forum but it seems like nobody else has experienced this, but me period and the other thing is, if they did experience it.It was just when they were, you know?Going through recovery which I know that that is normal but they've never experienced it when they were restricting.  \n\n\nWhen you're an adult there is no anorexia doctor as far as I know? I mean.\nI don't know who to ask unless I try calling like an Ed treatment center. But they're not gonna answer me because I feel like they're gonna try to get you to go into treatment.And they're probably gonna tell you anything and everything even lies just to get you to go into treatment. I've Google it and Google it.And I can't figure it out on my own",
          "created_utc": 1744474795.0
        }
      ]
    },
    {
      "id": "mmr7pek",
      "author": "BallSufficient5671",
      "body": "Thank you. I pray i get some relief somehow. I wish you the,best too!",
      "created_utc": 1744475493.0,
      "score": 2,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        },
        {
          "id": "mmqymzu",
          "author": "BallSufficient5671",
          "body": "To you too have hypothetic dysfunction which is where your body can't regulate its temperature and you're hot all the time? Because I am never cold anymore ever...it's that i'm always severely hot with hotness 24/7 and severe heat intolerance. \n\n\nMy endocrinologist and gynecologist are not eating disorder specialists but they believe that this is due to my anorexia turning off my hypothesis from regulating properly causing the hotness. The problem is they're not sure that with me having this for thirty years , if weight gain would even turn my hypothalmus back on and get it to work properly and take my severe hotness and heat intolerance away. So obviously i'm afraid to detreatment again unless I knew that that would actually fix itself. Plus i've been impatient five times so i've used all my insurance and money already. \n\n\nSo do you have this severe heat intolerance and feeling hot all the time? Has your doctors told you if weight gain would make this symptom go away and regulate your hypothesis? My drs don't know. Does yours?",
          "created_utc": 1744472656.0
        },
        {
          "id": "mmqz78j",
          "author": "Coffeegreysky12",
          "body": "I actually feel cold all the time, even in warm weather. I wish I could give you some advice, but I've never experienced feeling too hot. I would suggest you ask a medical professional",
          "created_utc": 1744472830.0
        },
        {
          "id": "mmr2a26",
          "author": "BallSufficient5671",
          "body": "I have and they've never heard of this complication so they don't know what to do about it.  Now, if I were in an eating disorder facility, I would definitely love to know what their doctors would say, but as far as regular doctors that aren't familiar with eating disorders, they don't know what to do to help me. They tried Harmon replacement therapy with an estrogen patch and progesterone last year.And it didn't even help, but maybe 10%.So even though my hormones are low , they don't feel that's the only cause. They feel that a typoc dysfunction caused by years of anorexia.And being underweight. But the thing they're not knowing is they don't know if that will regulate if I get to a normal weight again after thirty years of having such bad anorexia and like 5 periods my entire life. ",
          "created_utc": 1744473783.0
        },
        {
          "id": "mmr2opl",
          "author": "Coffeegreysky12",
          "body": "I've never heard of it before either. Perhaps you can do more research on it. Try to find a doctor that specializes in anorexia and has knowledge about this disorder.",
          "created_utc": 1744473911.0
        },
        {
          "id": "mmr5hps",
          "author": "BallSufficient5671",
          "body": "I've tried googling it.I've tried asking in this forum but it seems like nobody else has experienced this, but me period and the other thing is, if they did experience it.It was just when they were, you know?Going through recovery which I know that that is normal but they've never experienced it when they were restricting.  \n\n\nWhen you're an adult there is no anorexia doctor as far as I know? I mean.\nI don't know who to ask unless I try calling like an Ed treatment center. But they're not gonna answer me because I feel like they're gonna try to get you to go into treatment.And they're probably gonna tell you anything and everything even lies just to get you to go into treatment. I've Google it and Google it.And I can't figure it out on my own",
          "created_utc": 1744474795.0
        },
        {
          "id": "mmr791r",
          "author": "Coffeegreysky12",
          "body": "I wish I had an answer for you, but I've never done any research on this symptom. But if it keeps bothering you, then keep reaching out to doctors or a therapist.",
          "created_utc": 1744475350.0
        }
      ]
    },
    {
      "id": "mmr7vae",
      "author": "Coffeegreysky12",
      "body": "Thank you",
      "created_utc": 1744475545.0,
      "score": 1,
      "context": [
        {
          "id": "mmmwqum",
          "author": "nihilist_fox",
          "body": "This post is really important. \n\nI really do feel you and find a lot of similarities in our stories. My weight loss is not intentional anymore either. Or keeping my weight this low. The amount of food it takes for me to keep my weight up is nowhere near what was before. I used to be terrified of gaining weight, now I want it badly to restore some health, and I can’t. It’s very hard, like my body got used to be severely underweight and won’t keep the nutrients I feed it. I just can’t stomach the amount of food needed for me to gain and maintain a healthier weight. \n\nMy heart health is shit too. Palpitations, tachycardia, chest pain and discomfort and pressure. Terrible insomnia, terrible memory, hair loss, dry skin, poor circulation, low blood pressure, my right eye is losing sight progressively, frequent diarrhea, abdominal cramps and bloating, having a hard time regulating body temperature (always too hot or too cold), constant exhaustion, aggravated depression and anxiety.\n\nAll of this (and other traumatic life events) led me to abuse drugs to cope. And now I’m stuck in a never ending cycle.\n\nThis disease is a killer. It’s very important to talk about this and to stop glamorizing and romanticizing this shit. Because it’s a slow and painful death. It takes everything from you. It’s all fun and games until you can’t get out of bed anymore, until talking for more than 5 minutes takes your breath away. \n\nI’m 26 now, and god, if I could go back 10 years and tell her where she would be if she kept going as she was…. I might have saved her.",
          "created_utc": 1744408168.0
        },
        {
          "id": "mmqymzu",
          "author": "BallSufficient5671",
          "body": "To you too have hypothetic dysfunction which is where your body can't regulate its temperature and you're hot all the time? Because I am never cold anymore ever...it's that i'm always severely hot with hotness 24/7 and severe heat intolerance. \n\n\nMy endocrinologist and gynecologist are not eating disorder specialists but they believe that this is due to my anorexia turning off my hypothesis from regulating properly causing the hotness. The problem is they're not sure that with me having this for thirty years , if weight gain would even turn my hypothalmus back on and get it to work properly and take my severe hotness and heat intolerance away. So obviously i'm afraid to detreatment again unless I knew that that would actually fix itself. Plus i've been impatient five times so i've used all my insurance and money already. \n\n\nSo do you have this severe heat intolerance and feeling hot all the time? Has your doctors told you if weight gain would make this symptom go away and regulate your hypothesis? My drs don't know. Does yours?",
          "created_utc": 1744472656.0
        },
        {
          "id": "mmqz78j",
          "author": "Coffeegreysky12",
          "body": "I actually feel cold all the time, even in warm weather. I wish I could give you some advice, but I've never experienced feeling too hot. I would suggest you ask a medical professional",
          "created_utc": 1744472830.0
        },
        {
          "id": "mmr2a26",
          "author": "BallSufficient5671",
          "body": "I have and they've never heard of this complication so they don't know what to do about it.  Now, if I were in an eating disorder facility, I would definitely love to know what their doctors would say, but as far as regular doctors that aren't familiar with eating disorders, they don't know what to do to help me. They tried Harmon replacement therapy with an estrogen patch and progesterone last year.And it didn't even help, but maybe 10%.So even though my hormones are low , they don't feel that's the only cause. They feel that a typoc dysfunction caused by years of anorexia.And being underweight. But the thing they're not knowing is they don't know if that will regulate if I get to a normal weight again after thirty years of having such bad anorexia and like 5 periods my entire life. ",
          "created_utc": 1744473783.0
        },
        {
          "id": "mmr2opl",
          "author": "Coffeegreysky12",
          "body": "I've never heard of it before either. Perhaps you can do more research on it. Try to find a doctor that specializes in anorexia and has knowledge about this disorder.",
          "created_utc": 1744473911.0
        },
        {
          "id": "mmr5hps",
          "author": "BallSufficient5671",
          "body": "I've tried googling it.I've tried asking in this forum but it seems like nobody else has experienced this, but me period and the other thing is, if they did experience it.It was just when they were, you know?Going through recovery which I know that that is normal but they've never experienced it when they were restricting.  \n\n\nWhen you're an adult there is no anorexia doctor as far as I know? I mean.\nI don't know who to ask unless I try calling like an Ed treatment center. But they're not gonna answer me because I feel like they're gonna try to get you to go into treatment.And they're probably gonna tell you anything and everything even lies just to get you to go into treatment. I've Google it and Google it.And I can't figure it out on my own",
          "created_utc": 1744474795.0
        },
        {
          "id": "mmr791r",
          "author": "Coffeegreysky12",
          "body": "I wish I had an answer for you, but I've never done any research on this symptom. But if it keeps bothering you, then keep reaching out to doctors or a therapist.",
          "created_utc": 1744475350.0
        },
        {
          "id": "mmr7pek",
          "author": "BallSufficient5671",
          "body": "Thank you. I pray i get some relief somehow. I wish you the,best too!",
          "created_utc": 1744475493.0
        }
      ]
    }
  ]
}