{
  "id": "1jxspd7",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1744495625.0,
  "title": "The harsh truth about being anorexic",
  "selftext": "Your goal weight will never be enough and you will want to set it lower. You will never be satisfied. No number you reach will bring you happiness\n\nYou never stop thinking about what you are going to eat that day or your weight. You can't switch off the disorder once you get tired of it. \n\nSooner or later, people in your life will notice a change in your health and behavior and say something to you or express concern, even encouraging you to get treatment.\n\nIt's not glamorous. The side effects are awful. One of the worst side effects of anorexia I have now is the fact that it's messed up my bladder so badly that I experience painful and frequent urination. The pain is constant and so far, I have not been able to find treatment for this symptom. This symptom keeps me staying at home. It's also worsened my depression and anxiety. But I had no idea anorexia could cause bladder issues. I would encourage people to read more about anorexia and bladder issues, because when I was younger, I didn't know about this side effect. Malnutrition will affect your body in ways you don't always think about, until it happens to you\n\nAnorexia has the highest mortality rate of any mental illness. Whether you have had the disorder for a few years or 18 years, it's deadly and requires treatment\n\nYou don't have to be hospitalized to be suffering greatly. There are people who have severe anorexia who aren't in a hospital. It's just not something that everyone finds helpful. At the time of my last hospitalizations, which were years ago, I had a few medical issues but they weren't painful. And as soon as I began the refeeding process, they went away. But my obsession with losing weight did not and only grew worse. Not every person with anorexia wants to be hospitalized. Even though my medical complications are worse now than before, the idea of going back to inpatient causes me a great deal of anxiety. \n\nYou don't have to have a feeding tube to be considered sick enough. I've never had one and the idea of having one scares me. If you are starving yourself and worrying constantly over what you can and cannot eat, you are sick. You don't have to prove anything to anyone. If you are suffering, you are suffering. You don't have to get to a certain weight or wind up with a feeding tube to be considered ill. Everyone with this illness experiences it differently and hurts in their own ways. \n\nEven if you go through inpatient treatment and years of therapy, you may still find yourself struggling with disordered thoughts and behaviors. While some people will make a full recovery from this, other people will become chronic and find it hard to let go of the illness completely\n\nRecovery can take years, and relapse after getting treatment is common. This is not an easy disorder to cure. \n\nEating more food doesn't just make the illness go away. \n\nPeople who suffer from this disorder aren't being vain and it's not just about being skinny or wanting to look a certain way. It's a devastating mental illness that affects everything in the person's life and everyone who cares about that person. It's not a weight loss method or a diet. It is a dangerous disorder which requires support from a team of people who know how to treat it\n\nIt is common for a person suffering from anorexia to be in denial at the beginning of their disorder. But eventually, the person recognizes they have a problem. But asking a person with anorexia to \"just eat\" is not helpful and won't cure them. \n\n",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1jxspd7/the_harsh_truth_about_being_anorexic/",
  "score": 162,
  "num_comments": 19,
  "comments": [
    {
      "id": "mmsxavh",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1744495625.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmt8y0l",
      "author": "HerElectronicHaze",
      "body": "It’s so true. 🥲 🫥\n\nI’ve had ED for over 20 yrs. Tried many treatments, but can’t find any mental relief. Eating/normalising weight might have made me somewhat physically better at some point, but the mental stuff idk how to resolve that. I’ve tried many therapists etc but ???\n\nI also don’t want to go back to hospital bc it was traumatic, but now my team is mentioning it and I’m scared as hell bc it doesn’t feel like it will resolve anything, just patch me up medically and throw me out. \n\nI don’t feel very well, but I have this urge to just lose a bit more weight. Situation feels utterly fucked\n\nI often feel like there’s no way out and the only way to be at peace is to…not be here",
      "created_utc": 1744499967.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mmtpz03",
      "author": "Grand-Swimming6020",
      "body": "i relate very much , i’ve been sick since i was 8 years old , i have not felt “ satisfied “ once , there is always more weight to lose and a lower number to get to … thank you for saying this 🤍🤍🤍",
      "created_utc": 1744506583.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mmt5mlo",
      "author": "Listen_Successful",
      "body": "Thank you so much for your post. \n\n I’m sorry that you’re going through this, and I thank you for being vulnerable and raw in your description of the terrible symptoms of anorexia nervosa. ❤️💕💕💕💕",
      "created_utc": 1744498738.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mmucye1",
      "author": "Best-Criticism810",
      "body": "I know there are a million more important things in this and it’s all amazingly sad and well written but holy sh one of the biggest shockers for me was the bladder thing because that explains so much. I have been peeing so frequently and at night I actually saw a doctor about it and we just ended on the note that I have a weak bladder, which I’ve always had, but never have had to go this many times every night",
      "created_utc": 1744516137.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mn2d8i1",
      "author": "fineok_17",
      "body": "This is all so true. \n\nI'm constantly struggling with disordered eating thoughts and behaviors and I think I'll battle this for the rest of my life. It's a harsh reality realizing this but I'm hoping it will get easier the more I try to be in a recovery mindset. \n\n\nThis disorder is also so addictive. The accomplishment I feel when I don't eat and see the number on the scale go down gives me such a high. It's so hard to combat this but I have to remind myself I'm sick and it's just the ED talking, so I can reframe my thoughts. \n\n\nI hope everyone suffering with this can find the strength and courage to fight it and keep going. I'm really struggling right now and am currently in a relapse and I'm trying my best to get back on track and take care of myself. We all deserve to not let ED control us so we can live a happy, healthy, fulfilling life",
      "created_utc": 1744640466.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mnj0ow9",
      "author": "squidward_inc",
      "body": "I really needed this post. I have been struggling so much and fighting with myself about whether I am “sick enough” or not. \n\nI made the call and signed myself up for treatment and see a doctor/psych/dietician on a weekly basis out patient but now when they show concern I just feel like everyone is being dramatic. “I’m not losing weight, my labs are fine, I’m alive, so like what the big deal?” Is kind of my thought process. Yet I signed myself up for this? I keep going back?  I make these plans and goals with my care team and simply just don’t follow through with them. They are really pushing for partial but I realistically cannot do that right now. So if outpatient isn’t working, should I just stop and try again in the future? I truly could really use some advice or words of encouragement.",
      "created_utc": 1744861329.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mmt9cdq",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing. It's such a difficult thing to deal with and hard to treat",
      "created_utc": 1744500114.0,
      "score": 7,
      "context": [
        {
          "id": "mmt8y0l",
          "author": "HerElectronicHaze",
          "body": "It’s so true. 🥲 🫥\n\nI’ve had ED for over 20 yrs. Tried many treatments, but can’t find any mental relief. Eating/normalising weight might have made me somewhat physically better at some point, but the mental stuff idk how to resolve that. I’ve tried many therapists etc but ???\n\nI also don’t want to go back to hospital bc it was traumatic, but now my team is mentioning it and I’m scared as hell bc it doesn’t feel like it will resolve anything, just patch me up medically and throw me out. \n\nI don’t feel very well, but I have this urge to just lose a bit more weight. Situation feels utterly fucked\n\nI often feel like there’s no way out and the only way to be at peace is to…not be here",
          "created_utc": 1744499967.0
        }
      ]
    },
    {
      "id": "mmttq3r",
      "author": "Invisible2ewe",
      "body": "It does feel like that's the only door out doesn't it?  In my more honest moments I know how it ends, with an ugw of whatever a corpse is.  But I hope you find a better path.",
      "created_utc": 1744508103.0,
      "score": 6,
      "context": [
        {
          "id": "mmt8y0l",
          "author": "HerElectronicHaze",
          "body": "It’s so true. 🥲 🫥\n\nI’ve had ED for over 20 yrs. Tried many treatments, but can’t find any mental relief. Eating/normalising weight might have made me somewhat physically better at some point, but the mental stuff idk how to resolve that. I’ve tried many therapists etc but ???\n\nI also don’t want to go back to hospital bc it was traumatic, but now my team is mentioning it and I’m scared as hell bc it doesn’t feel like it will resolve anything, just patch me up medically and throw me out. \n\nI don’t feel very well, but I have this urge to just lose a bit more weight. Situation feels utterly fucked\n\nI often feel like there’s no way out and the only way to be at peace is to…not be here",
          "created_utc": 1744499967.0
        }
      ]
    },
    {
      "id": "mngn1ws",
      "author": "BallSufficient5671",
      "body": "I couldn't have said it better myself period i'm in the exact same place as you. But yet even after 5 impatient hospital stays.I still wish that I could get some treatment right now. But now that I am out of insurance , I have no more ability to go anywhere. It's not.\nThat I want a gain weight.But I am feeling so hot all the time , from hypothemac dysfunction and My doctors think that my nutrition and anorexia is what's causing it and that if I were to gain weight that this might make me less hot. I just wish I knew if that were true I'd willing getcy I a healthy weight and stay there ",
      "created_utc": 1744831885.0,
      "score": 1,
      "context": [
        {
          "id": "mmt8y0l",
          "author": "HerElectronicHaze",
          "body": "It’s so true. 🥲 🫥\n\nI’ve had ED for over 20 yrs. Tried many treatments, but can’t find any mental relief. Eating/normalising weight might have made me somewhat physically better at some point, but the mental stuff idk how to resolve that. I’ve tried many therapists etc but ???\n\nI also don’t want to go back to hospital bc it was traumatic, but now my team is mentioning it and I’m scared as hell bc it doesn’t feel like it will resolve anything, just patch me up medically and throw me out. \n\nI don’t feel very well, but I have this urge to just lose a bit more weight. Situation feels utterly fucked\n\nI often feel like there’s no way out and the only way to be at peace is to…not be here",
          "created_utc": 1744499967.0
        }
      ]
    },
    {
      "id": "mmtqx3u",
      "author": "Coffeegreysky12",
      "body": "You are welcome",
      "created_utc": 1744506965.0,
      "score": 1,
      "context": [
        {
          "id": "mmtpz03",
          "author": "Grand-Swimming6020",
          "body": "i relate very much , i’ve been sick since i was 8 years old , i have not felt “ satisfied “ once , there is always more weight to lose and a lower number to get to … thank you for saying this 🤍🤍🤍",
          "created_utc": 1744506583.0
        }
      ]
    },
    {
      "id": "mmt5x9k",
      "author": "Coffeegreysky12",
      "body": "You are welcome. Thank you for the kind words",
      "created_utc": 1744498850.0,
      "score": 2,
      "context": [
        {
          "id": "mmt5mlo",
          "author": "Listen_Successful",
          "body": "Thank you so much for your post. \n\n I’m sorry that you’re going through this, and I thank you for being vulnerable and raw in your description of the terrible symptoms of anorexia nervosa. ❤️💕💕💕💕",
          "created_utc": 1744498738.0
        }
      ]
    },
    {
      "id": "mmudy13",
      "author": "Coffeegreysky12",
      "body": "Thank you. Yes, anorexia can cause painful bladder issues. I had no idea anorexia could cause damage to the bladder. It's an awful symptom and I am sorry you are experiencing it too",
      "created_utc": 1744516591.0,
      "score": 1,
      "context": [
        {
          "id": "mmucye1",
          "author": "Best-Criticism810",
          "body": "I know there are a million more important things in this and it’s all amazingly sad and well written but holy sh one of the biggest shockers for me was the bladder thing because that explains so much. I have been peeing so frequently and at night I actually saw a doctor about it and we just ended on the note that I have a weak bladder, which I’ve always had, but never have had to go this many times every night",
          "created_utc": 1744516137.0
        }
      ]
    },
    {
      "id": "mn2dhgk",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing. Yes, this is a very addictive disorder and I hope everyone struggling with it has some type of support around them",
      "created_utc": 1744640545.0,
      "score": 1,
      "context": [
        {
          "id": "mn2d8i1",
          "author": "fineok_17",
          "body": "This is all so true. \n\nI'm constantly struggling with disordered eating thoughts and behaviors and I think I'll battle this for the rest of my life. It's a harsh reality realizing this but I'm hoping it will get easier the more I try to be in a recovery mindset. \n\n\nThis disorder is also so addictive. The accomplishment I feel when I don't eat and see the number on the scale go down gives me such a high. It's so hard to combat this but I have to remind myself I'm sick and it's just the ED talking, so I can reframe my thoughts. \n\n\nI hope everyone suffering with this can find the strength and courage to fight it and keep going. I'm really struggling right now and am currently in a relapse and I'm trying my best to get back on track and take care of myself. We all deserve to not let ED control us so we can live a happy, healthy, fulfilling life",
          "created_utc": 1744640466.0
        }
      ]
    },
    {
      "id": "mnj3thi",
      "author": "Coffeegreysky12",
      "body": "I am glad this post is helpful. I think you should keep trying with the outpatient treatment, and if you feel it isn't helping, then reach out to your care team. You deserve to feel better. I can understand how an illness like anorexia wants to convince you that you aren't sick enough, but you deserve support. And you aren't alone in feeling the way you feel. I also have times where I feel like I can't stick to treatment. But I am still going to all my appointments. It's a tough illness to fight. I wish I could provide more helpful advice, but I just want to say your feelings are valid",
      "created_utc": 1744862725.0,
      "score": 1,
      "context": [
        {
          "id": "mnj0ow9",
          "author": "squidward_inc",
          "body": "I really needed this post. I have been struggling so much and fighting with myself about whether I am “sick enough” or not. \n\nI made the call and signed myself up for treatment and see a doctor/psych/dietician on a weekly basis out patient but now when they show concern I just feel like everyone is being dramatic. “I’m not losing weight, my labs are fine, I’m alive, so like what the big deal?” Is kind of my thought process. Yet I signed myself up for this? I keep going back?  I make these plans and goals with my care team and simply just don’t follow through with them. They are really pushing for partial but I realistically cannot do that right now. So if outpatient isn’t working, should I just stop and try again in the future? I truly could really use some advice or words of encouragement.",
          "created_utc": 1744861329.0
        }
      ]
    },
    {
      "id": "mmunxrk",
      "author": "Internal-State-2365",
      "body": "I think I knew from the beginning of my ed that it would only end in one way. I can’t imagine ever stopping, I just don’t think I could allow myself to do that. I feel trapped but also guilty because I’m painfully aware of how I’m destroying my life?",
      "created_utc": 1744521451.0,
      "score": 2,
      "context": [
        {
          "id": "mmt8y0l",
          "author": "HerElectronicHaze",
          "body": "It’s so true. 🥲 🫥\n\nI’ve had ED for over 20 yrs. Tried many treatments, but can’t find any mental relief. Eating/normalising weight might have made me somewhat physically better at some point, but the mental stuff idk how to resolve that. I’ve tried many therapists etc but ???\n\nI also don’t want to go back to hospital bc it was traumatic, but now my team is mentioning it and I’m scared as hell bc it doesn’t feel like it will resolve anything, just patch me up medically and throw me out. \n\nI don’t feel very well, but I have this urge to just lose a bit more weight. Situation feels utterly fucked\n\nI often feel like there’s no way out and the only way to be at peace is to…not be here",
          "created_utc": 1744499967.0
        },
        {
          "id": "mmttq3r",
          "author": "Invisible2ewe",
          "body": "It does feel like that's the only door out doesn't it?  In my more honest moments I know how it ends, with an ugw of whatever a corpse is.  But I hope you find a better path.",
          "created_utc": 1744508103.0
        }
      ]
    },
    {
      "id": "mnlnuoi",
      "author": "squidward_inc",
      "body": "I really appreciate this & you. It is more helpful than you think",
      "created_utc": 1744904262.0,
      "score": 2,
      "context": [
        {
          "id": "mnj0ow9",
          "author": "squidward_inc",
          "body": "I really needed this post. I have been struggling so much and fighting with myself about whether I am “sick enough” or not. \n\nI made the call and signed myself up for treatment and see a doctor/psych/dietician on a weekly basis out patient but now when they show concern I just feel like everyone is being dramatic. “I’m not losing weight, my labs are fine, I’m alive, so like what the big deal?” Is kind of my thought process. Yet I signed myself up for this? I keep going back?  I make these plans and goals with my care team and simply just don’t follow through with them. They are really pushing for partial but I realistically cannot do that right now. So if outpatient isn’t working, should I just stop and try again in the future? I truly could really use some advice or words of encouragement.",
          "created_utc": 1744861329.0
        },
        {
          "id": "mnj3thi",
          "author": "Coffeegreysky12",
          "body": "I am glad this post is helpful. I think you should keep trying with the outpatient treatment, and if you feel it isn't helping, then reach out to your care team. You deserve to feel better. I can understand how an illness like anorexia wants to convince you that you aren't sick enough, but you deserve support. And you aren't alone in feeling the way you feel. I also have times where I feel like I can't stick to treatment. But I am still going to all my appointments. It's a tough illness to fight. I wish I could provide more helpful advice, but I just want to say your feelings are valid",
          "created_utc": 1744862725.0
        }
      ]
    },
    {
      "id": "mmyfgfv",
      "author": "Invisible2ewe",
      "body": "To me it actually feels better.  I can't get past the guilt of doing anything else.  I feel like I'm just living my way while I can. Life just isn't worth living any other way even if it would be longer.",
      "created_utc": 1744577272.0,
      "score": 2,
      "context": [
        {
          "id": "mmt8y0l",
          "author": "HerElectronicHaze",
          "body": "It’s so true. 🥲 🫥\n\nI’ve had ED for over 20 yrs. Tried many treatments, but can’t find any mental relief. Eating/normalising weight might have made me somewhat physically better at some point, but the mental stuff idk how to resolve that. I’ve tried many therapists etc but ???\n\nI also don’t want to go back to hospital bc it was traumatic, but now my team is mentioning it and I’m scared as hell bc it doesn’t feel like it will resolve anything, just patch me up medically and throw me out. \n\nI don’t feel very well, but I have this urge to just lose a bit more weight. Situation feels utterly fucked\n\nI often feel like there’s no way out and the only way to be at peace is to…not be here",
          "created_utc": 1744499967.0
        },
        {
          "id": "mmttq3r",
          "author": "Invisible2ewe",
          "body": "It does feel like that's the only door out doesn't it?  In my more honest moments I know how it ends, with an ugw of whatever a corpse is.  But I hope you find a better path.",
          "created_utc": 1744508103.0
        },
        {
          "id": "mmunxrk",
          "author": "Internal-State-2365",
          "body": "I think I knew from the beginning of my ed that it would only end in one way. I can’t imagine ever stopping, I just don’t think I could allow myself to do that. I feel trapped but also guilty because I’m painfully aware of how I’m destroying my life?",
          "created_utc": 1744521451.0
        }
      ]
    },
    {
      "id": "mnlofmn",
      "author": "Coffeegreysky12",
      "body": "I am glad I could help",
      "created_utc": 1744904427.0,
      "score": 1,
      "context": [
        {
          "id": "mnj0ow9",
          "author": "squidward_inc",
          "body": "I really needed this post. I have been struggling so much and fighting with myself about whether I am “sick enough” or not. \n\nI made the call and signed myself up for treatment and see a doctor/psych/dietician on a weekly basis out patient but now when they show concern I just feel like everyone is being dramatic. “I’m not losing weight, my labs are fine, I’m alive, so like what the big deal?” Is kind of my thought process. Yet I signed myself up for this? I keep going back?  I make these plans and goals with my care team and simply just don’t follow through with them. They are really pushing for partial but I realistically cannot do that right now. So if outpatient isn’t working, should I just stop and try again in the future? I truly could really use some advice or words of encouragement.",
          "created_utc": 1744861329.0
        },
        {
          "id": "mnj3thi",
          "author": "Coffeegreysky12",
          "body": "I am glad this post is helpful. I think you should keep trying with the outpatient treatment, and if you feel it isn't helping, then reach out to your care team. You deserve to feel better. I can understand how an illness like anorexia wants to convince you that you aren't sick enough, but you deserve support. And you aren't alone in feeling the way you feel. I also have times where I feel like I can't stick to treatment. But I am still going to all my appointments. It's a tough illness to fight. I wish I could provide more helpful advice, but I just want to say your feelings are valid",
          "created_utc": 1744862725.0
        },
        {
          "id": "mnlnuoi",
          "author": "squidward_inc",
          "body": "I really appreciate this & you. It is more helpful than you think",
          "created_utc": 1744904262.0
        }
      ]
    }
  ]
}