{
  "id": "1jy9rre",
  "subreddit": "AnorexiaNervosa",
  "author": "wrenvevrain",
  "created_utc": 1744556854.0,
  "title": "ED made me fatphobic",
  "selftext": "Exactly what the title says. I am not even underweight. I'm actually closer to being overweight than underweight and yet whene er I see a fat person I just shame them in my head.\n\nIf I am in a grocery store and a fat lady grabs any unhealthy my brain is like \"big back big back\". Or when I see a fat person sitting down I think to myself that they could use some standing up.\n\nMost of my family is fat. Today I was with my very overweight aunt and I was so annoyed by how fat she is and got so irritated because she walked so slowly. \n\nI used to feel so empathetic towards fat people when I was overweight. I am sad how cold and hateful I got towards others after developing an ED...\n\nI feel like if I were to tell this to anyone else they would think I am mean so I wonder if this feeling is common.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1jy9rre/ed_made_me_fatphobic/",
  "score": 229,
  "num_comments": 38,
  "comments": [
    {
      "id": "mmwmjaz",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1744556854.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmx0619",
      "author": "autumnfire1414",
      "body": "Try reframing it. Although not true for everyone, they may be suffering from an eating disorder as well that is just as difficult to battle and mentally consuming as yours is.",
      "created_utc": 1744561130.0,
      "score": 97,
      "context": []
    },
    {
      "id": "mmx8smw",
      "author": "ankkani",
      "body": "For me it was like \"How dare you feel fine the way that you are, when I have to put so much effort into not becoming like you for me to accept myself\"",
      "created_utc": 1744563821.0,
      "score": 95,
      "context": []
    },
    {
      "id": "mmwsa6l",
      "author": "Individual_Echo_2557",
      "body": "I'm disgusted by fat. \nIf i see fat, i feel uncomfortable. I don't like to see fat people because in my view i look just like that. Ate a bagel and see a fat person eating later? Perfect trigger to tell me i looked just like that. \nBut yeah, i unconsciously look down on fat people because they are a motivation to stay thin. ",
      "created_utc": 1744558674.0,
      "score": 58,
      "context": []
    },
    {
      "id": "mmzpk6r",
      "author": "runninginbubbles",
      "body": "I get you. My brain goes places I feel really bad about. I don't think 'fat' looks nice or pretty. I think it looks hot and uncomfortable and very undesirable. I see overweight people and think \"I am so glad I do not look like that,\" I see some large people wearing certain revealing clothes and think \"if I was that size I wouldn't want to wear that\"  \nBUT I don't hate the person, I really pity them. I am empathetic and I usually assume they have an ED of sorts too. I don't actually see a fat person and think they're lazy or lack willpower, and I definitely don't think they're less good at their job or less smart etc, I really just think about how the fat looks and yep, it does for a moment make me feel better about how I am.",
      "created_utc": 1744593812.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mna8v51",
      "author": "Knot0001",
      "body": "I can relate and I would be angry when someone close overweight (probably also has an ED) eats something that just make them more fat. I was thinking a lot why I become angry and why I became phatphobic, it's lesser now than it was in past but couldn't realise why I act like that. I used to think many times like \"I'm better  I have self control\" but at the same time that person finds control maybe in binging.\nSome persons remind me of someone who abused me a lot whole my life and I becoma harsh, sarcastic towards them, like I'm giving back the ball, to abuser through that person.\n\n\nBut for my angriness connected to eating but only by those more fat than me I still didn't find an answer which is of course somewhere connected to me, my past, my experiences and traumas.",
      "created_utc": 1744744882.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mnkxlg5",
      "author": "helpicantchooseanam3",
      "body": "same, but i also used to be morbidly obese so usually it’s me shaming my old body. my entire family is obese and now i’m the only one who isn’t and i hate the way i think about some of them, but i can’t help it. my brain just thinks all of these terrible things about people i love so much and i can’t make it stop. i don’t want these thoughts, and i would never actually let them out of my head, but i still feel so guilty even thinking it. ugh. fuck this fucking disease i hate it so much.",
      "created_utc": 1744896307.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mnvky4t",
      "author": "Creepycute1",
      "body": "I can absolutely relate when I was like 13 I was in a lot of pro Ed spaces and looked at a lot of fat phobic content and I didn't actually think it would rub off on me  because I'm never a huge fan of making fun of people especially knowing how it felt to me.\n\nHowever I noticed I would see girls who are chubby wearing crop tops and I would get intrusive thoughts about how it would look better on them if they were thinner or that they look weird because their chubby wearing it. All of it was just insecurity and my brain taking what I surrounded myself with.",
      "created_utc": 1745036156.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mmwnnk3",
      "author": "JizzEater_69",
      "body": "Yes, this is somewhat me, I always try my absolute hardest to be nice to everyone and avoid bodyshaming. I am also closer to overweight than underweight and when now if a girl is rude (who happens to be bigger) all I can think of is \"fat fuck\" i feel horrible about it and I know it's bc of this horrible ED",
      "created_utc": 1744557209.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mn50ngj",
      "author": "HospitalAcrobatic155",
      "body": "i can relate but im envious too, id do anything to be a normal person",
      "created_utc": 1744669632.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mnbzoet",
      "author": "zodiacqu33n",
      "body": "Yeah, I am already technically overweight and literally so afraid to gain any more weight. Like I’m already uncomfortable enough! I don’t think I can take any more weight, yet there’s this belief that u must eat unrestricted at any weight that to be quite honest is very one size fits all. I’m over here feeling like my stomach is going to burst at any moment and honestly that can’t be healthy, but I do think having curves and healthy fat isn’t a bad thing! But I am kinda resistant to treatments telling me my fat ass needs to get more fat. SPEAKING FOR MYSELF & myself only (bc I’m objectively fat) 🗣️🗣️🗣️ Treatment made me go from big to bigger, and they didn’t let me move around at ALL to digest my food which was actual torture 😰 But I rly don’t want to be sick forever. I’m eating, but not necessarily to the point of being able to thrive. One step at a time eh? I’m trying 💪🏻 Also I think my PCOS/hypothyroidism are the reasons I gained weight and sometimes weight gain just happens to reasons unrelated to eating! Restriction is not the way to lose weight (for fat ppl who are suffering due to their size healthwise like me). Health at every size makes sense in theory, I just need to internalize it more 😊",
      "created_utc": 1744765219.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mnd6cmy",
      "author": "Yogurtcat73",
      "body": "Dude I also struggle with this and I hate it because It doesn’t align with the person I want to be, I want to be nice and kind but it’s hard.",
      "created_utc": 1744783233.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mmwvyig",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1744559814.0,
      "score": -4,
      "context": []
    },
    {
      "id": "mmyb8gg",
      "author": "mavisiswinning",
      "body": "Literally. I purposely watch mukbangs on tiktok just to call them fat etc (even if they're not) to condition my brain. It's so fucked.",
      "created_utc": 1744575913.0,
      "score": -6,
      "context": []
    },
    {
      "id": "mn2kp91",
      "author": "barcodedbabygirl",
      "body": "I’m now just underweight but even when I was a healthy weight and close to being overweight I still felt like this icl I just hate gluttony and greed - I guess it keeps me skinny tho",
      "created_utc": 1744642793.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mn20kl1",
      "author": "maracujadodo",
      "body": "its the same for me. i need to work on it but i dont really know where to start. \n\n\"funny\" thing is, i'm (close to) overweight myself.",
      "created_utc": 1744636129.0,
      "score": -2,
      "context": []
    },
    {
      "id": "mn3s21a",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1744655681.0,
      "score": -3,
      "context": []
    },
    {
      "id": "mmzup3l",
      "author": "DryArt3061",
      "body": "When I work with fat people, it makes me not want to eat even if they’re not eating. It’s not every one of them, I just target one person.",
      "created_utc": 1744595832.0,
      "score": -7,
      "context": []
    },
    {
      "id": "mmxlofd",
      "author": "gaymofo666",
      "body": "Can confirm. I had anorexia for many years until I realised some stuff had happened to me when I was a child, and started finding comfort in food and I gained rapidly due to restriction for so long. I purged for a while too until I had sepsis and almost died. \n\nJust because how my mindset was towards bigger people I'm way worse to myself because of it. I feel disgusting, and it feels so difficult to lose weight. I don't go out because of my fear of being seen and judged.",
      "created_utc": 1744567745.0,
      "score": 31,
      "context": [
        {
          "id": "mmx0619",
          "author": "autumnfire1414",
          "body": "Try reframing it. Although not true for everyone, they may be suffering from an eating disorder as well that is just as difficult to battle and mentally consuming as yours is.",
          "created_utc": 1744561130.0
        }
      ]
    },
    {
      "id": "mnlaom6",
      "author": "None",
      "body": "Ok I understand this might help OP see overweight people with more empathy, \nbut not every overweight person needs to be suffering from ed. Or \"suffering\" from something in general. You don't  need a \"valid reason\"  for people's weight. You can just accept people. Seeking reasons to understand people is as if you would only approve their appearances under certain circumstances.  ",
      "created_utc": 1744900428.0,
      "score": 1,
      "context": [
        {
          "id": "mmx0619",
          "author": "autumnfire1414",
          "body": "Try reframing it. Although not true for everyone, they may be suffering from an eating disorder as well that is just as difficult to battle and mentally consuming as yours is.",
          "created_utc": 1744561130.0
        }
      ]
    },
    {
      "id": "mmx9afb",
      "author": "wrenvevrain",
      "body": "OMG I can actually relate to this too, but I think these thoughts are more subconscious for me ☹️",
      "created_utc": 1744563971.0,
      "score": 16,
      "context": [
        {
          "id": "mmx8smw",
          "author": "ankkani",
          "body": "For me it was like \"How dare you feel fine the way that you are, when I have to put so much effort into not becoming like you for me to accept myself\"",
          "created_utc": 1744563821.0
        }
      ]
    },
    {
      "id": "mn5zv1x",
      "author": "spinderellen",
      "body": "This is a perfect explanation of my thoughts!",
      "created_utc": 1744682110.0,
      "score": 1,
      "context": [
        {
          "id": "mmx8smw",
          "author": "ankkani",
          "body": "For me it was like \"How dare you feel fine the way that you are, when I have to put so much effort into not becoming like you for me to accept myself\"",
          "created_utc": 1744563821.0
        }
      ]
    },
    {
      "id": "mn3lrkz",
      "author": "Itscatpicstime",
      "body": "But like, why would you assume they feel fine the way they are? They may literally be anorexic or bulimic themselves??",
      "created_utc": 1744653809.0,
      "score": 0,
      "context": [
        {
          "id": "mmx8smw",
          "author": "ankkani",
          "body": "For me it was like \"How dare you feel fine the way that you are, when I have to put so much effort into not becoming like you for me to accept myself\"",
          "created_utc": 1744563821.0
        }
      ]
    },
    {
      "id": "mnlb62u",
      "author": "None",
      "body": "There is a circular train of thought I here? \nI don't like fat people \nBecause I look like that. \n(But why don't you like being like that?)\n(Because I don't like fat people)",
      "created_utc": 1744900573.0,
      "score": 2,
      "context": [
        {
          "id": "mmwsa6l",
          "author": "Individual_Echo_2557",
          "body": "I'm disgusted by fat. \nIf i see fat, i feel uncomfortable. I don't like to see fat people because in my view i look just like that. Ate a bagel and see a fat person eating later? Perfect trigger to tell me i looked just like that. \nBut yeah, i unconsciously look down on fat people because they are a motivation to stay thin. ",
          "created_utc": 1744558674.0
        }
      ]
    },
    {
      "id": "mntup3i",
      "author": "r7e4t2",
      "body": "Hey jsyk these can be a type of intrusive thought, it sounds like they are rly upsetting you and that's what an intrusive thought is. They go against your morals and bc they stress you they're more likely to reoccur cus it's just a brain anxiety thing. Doesn't mean anything about you as person, only how you treat others is what matters <3",
      "created_utc": 1745012248.0,
      "score": 1,
      "context": [
        {
          "id": "mnkxlg5",
          "author": "helpicantchooseanam3",
          "body": "same, but i also used to be morbidly obese so usually it’s me shaming my old body. my entire family is obese and now i’m the only one who isn’t and i hate the way i think about some of them, but i can’t help it. my brain just thinks all of these terrible things about people i love so much and i can’t make it stop. i don’t want these thoughts, and i would never actually let them out of my head, but i still feel so guilty even thinking it. ugh. fuck this fucking disease i hate it so much.",
          "created_utc": 1744896307.0
        }
      ]
    },
    {
      "id": "mmx9oxa",
      "author": "wrenvevrain",
      "body": "My words exactly ☹️❤️",
      "created_utc": 1744564091.0,
      "score": 3,
      "context": [
        {
          "id": "mmwnnk3",
          "author": "JizzEater_69",
          "body": "Yes, this is somewhat me, I always try my absolute hardest to be nice to everyone and avoid bodyshaming. I am also closer to overweight than underweight and when now if a girl is rude (who happens to be bigger) all I can think of is \"fat fuck\" i feel horrible about it and I know it's bc of this horrible ED",
          "created_utc": 1744557209.0
        }
      ]
    },
    {
      "id": "mmzo60g",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1744593262.0,
      "score": 3,
      "context": [
        {
          "id": "mmwvyig",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1744559814.0
        }
      ]
    },
    {
      "id": "mmyq47u",
      "author": "Ashamed_Ad8162",
      "body": "And nope. You have no idea what other people eat. Fat people can and do have atypical anorexia, bulimia, OSFED, etc. \n\nPerceived restriction does not equal willpower.",
      "created_utc": 1744580815.0,
      "score": 8,
      "context": [
        {
          "id": "mmwvyig",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1744559814.0
        }
      ]
    },
    {
      "id": "mmyqq4c",
      "author": "JizzEater_69",
      "body": "I watch a man on YouTube shame them for me and it feels worse, it's like when your parents show you fat ppl as a little kid and tell you you don't wanna look like them",
      "created_utc": 1744581021.0,
      "score": 1,
      "context": [
        {
          "id": "mmyb8gg",
          "author": "mavisiswinning",
          "body": "Literally. I purposely watch mukbangs on tiktok just to call them fat etc (even if they're not) to condition my brain. It's so fucked.",
          "created_utc": 1744575913.0
        }
      ]
    },
    {
      "id": "mn3man1",
      "author": "Itscatpicstime",
      "body": "Obesity is a disease, not a”gluttony and greed.”",
      "created_utc": 1744653966.0,
      "score": 1,
      "context": [
        {
          "id": "mn2kp91",
          "author": "barcodedbabygirl",
          "body": "I’m now just underweight but even when I was a healthy weight and close to being overweight I still felt like this icl I just hate gluttony and greed - I guess it keeps me skinny tho",
          "created_utc": 1744642793.0
        }
      ]
    },
    {
      "id": "mn7wyv1",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 1: Do not participate in pro-ed behaviors. \n\nAs doing things like asking for \"ana buddies\" is harmful for members of the r/AnorexiaNervosa community, it is not allowed. Please do not do things like this in the future. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1744718499.0,
      "score": 1,
      "context": [
        {
          "id": "mn3s21a",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1744655681.0
        }
      ]
    },
    {
      "id": "mnmuqu4",
      "author": "autumnfire1414",
      "body": "Not so much that \"it's only okay if they have an eating disorder \" but more \"you don't know this person's story\". After having 2 kids, my mother in law with alzheimer's moved in. I couldn't so much as take a walk around the block cuz I couldn't leave my infant and toddler with her alone, I couldn't leave her home alone, and she would get violently combative when out of the house. I was far from \"lazy\" but had trouble losing my baby weight from 2 kids. I had trouble dieting because I'm all or nothing and would easily slip back into restricting.\n\nMy point was that you never know what someone else is going through. However, finding a common wavelength, like an eating disorder, is a good way to encourage empathy.",
      "created_utc": 1744916720.0,
      "score": 2,
      "context": [
        {
          "id": "mmx0619",
          "author": "autumnfire1414",
          "body": "Try reframing it. Although not true for everyone, they may be suffering from an eating disorder as well that is just as difficult to battle and mentally consuming as yours is.",
          "created_utc": 1744561130.0
        },
        {
          "id": "mnlaom6",
          "author": "None",
          "body": "Ok I understand this might help OP see overweight people with more empathy, \nbut not every overweight person needs to be suffering from ed. Or \"suffering\" from something in general. You don't  need a \"valid reason\"  for people's weight. You can just accept people. Seeking reasons to understand people is as if you would only approve their appearances under certain circumstances.  ",
          "created_utc": 1744900428.0
        }
      ]
    },
    {
      "id": "mnnttca",
      "author": "Individual_Echo_2557",
      "body": "For me its a particular fear of being unhealthy and not fit. \nThere isn't that much benefit of fat.\nBody dismorphia is just fucking with my brain and when i see a fat person, my body dismorphia is saying \"you see that person? Thats you\". ",
      "created_utc": 1744927297.0,
      "score": 2,
      "context": [
        {
          "id": "mmwsa6l",
          "author": "Individual_Echo_2557",
          "body": "I'm disgusted by fat. \nIf i see fat, i feel uncomfortable. I don't like to see fat people because in my view i look just like that. Ate a bagel and see a fat person eating later? Perfect trigger to tell me i looked just like that. \nBut yeah, i unconsciously look down on fat people because they are a motivation to stay thin. ",
          "created_utc": 1744558674.0
        },
        {
          "id": "mnlb62u",
          "author": "None",
          "body": "There is a circular train of thought I here? \nI don't like fat people \nBecause I look like that. \n(But why don't you like being like that?)\n(Because I don't like fat people)",
          "created_utc": 1744900573.0
        }
      ]
    },
    {
      "id": "mmyshpp",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1744581616.0,
      "score": -1,
      "context": [
        {
          "id": "mmwvyig",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1744559814.0
        },
        {
          "id": "mmyq47u",
          "author": "Ashamed_Ad8162",
          "body": "And nope. You have no idea what other people eat. Fat people can and do have atypical anorexia, bulimia, OSFED, etc. \n\nPerceived restriction does not equal willpower.",
          "created_utc": 1744580815.0
        }
      ]
    },
    {
      "id": "mnq3o8b",
      "author": "None",
      "body": "Ok I agree, I'm just saying you don't  need to know a person's story in the first place. Like I don't need to know your story in order not to have negative feelings against you. ",
      "created_utc": 1744962655.0,
      "score": 1,
      "context": [
        {
          "id": "mmx0619",
          "author": "autumnfire1414",
          "body": "Try reframing it. Although not true for everyone, they may be suffering from an eating disorder as well that is just as difficult to battle and mentally consuming as yours is.",
          "created_utc": 1744561130.0
        },
        {
          "id": "mnlaom6",
          "author": "None",
          "body": "Ok I understand this might help OP see overweight people with more empathy, \nbut not every overweight person needs to be suffering from ed. Or \"suffering\" from something in general. You don't  need a \"valid reason\"  for people's weight. You can just accept people. Seeking reasons to understand people is as if you would only approve their appearances under certain circumstances.  ",
          "created_utc": 1744900428.0
        },
        {
          "id": "mnmuqu4",
          "author": "autumnfire1414",
          "body": "Not so much that \"it's only okay if they have an eating disorder \" but more \"you don't know this person's story\". After having 2 kids, my mother in law with alzheimer's moved in. I couldn't so much as take a walk around the block cuz I couldn't leave my infant and toddler with her alone, I couldn't leave her home alone, and she would get violently combative when out of the house. I was far from \"lazy\" but had trouble losing my baby weight from 2 kids. I had trouble dieting because I'm all or nothing and would easily slip back into restricting.\n\nMy point was that you never know what someone else is going through. However, finding a common wavelength, like an eating disorder, is a good way to encourage empathy.",
          "created_utc": 1744916720.0
        }
      ]
    },
    {
      "id": "mmzdgcp",
      "author": "Ashamed_Ad8162",
      "body": "This is an incredibly nuanced issue that cannot be broken down to “fat people only eat junk food, are lazy, and undisciplined”. \n\nFat people are above all things, human. They are unique and special and just as valuable as thin people. There are many systemic factors that lead to being overweight or obese— poverty, food deserts, and an increase in other health conditions. \n\nI highly recommend looking into to fat ED activists like Sharon Maxwell to work on humanizing people who are different from you.",
      "created_utc": 1744589158.0,
      "score": 10,
      "context": [
        {
          "id": "mmwvyig",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1744559814.0
        },
        {
          "id": "mmyq47u",
          "author": "Ashamed_Ad8162",
          "body": "And nope. You have no idea what other people eat. Fat people can and do have atypical anorexia, bulimia, OSFED, etc. \n\nPerceived restriction does not equal willpower.",
          "created_utc": 1744580815.0
        },
        {
          "id": "mmyshpp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1744581616.0
        }
      ]
    },
    {
      "id": "mmz370b",
      "author": "Interesting_Union_67",
      "body": "This is a bad take to share in a subreddit like this. If I saw a comment like this when I was heavily restricting what I ate, even though I’ve never been overweight, it would still trigger me and I’d tell myself to not eat my couple of strawberries for lunch. Maybe keep your judgements to yourself.",
      "created_utc": 1744585357.0,
      "score": 9,
      "context": [
        {
          "id": "mmwvyig",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1744559814.0
        },
        {
          "id": "mmyq47u",
          "author": "Ashamed_Ad8162",
          "body": "And nope. You have no idea what other people eat. Fat people can and do have atypical anorexia, bulimia, OSFED, etc. \n\nPerceived restriction does not equal willpower.",
          "created_utc": 1744580815.0
        },
        {
          "id": "mmyshpp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1744581616.0
        }
      ]
    },
    {
      "id": "mmzo833",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1744593284.0,
      "score": 3,
      "context": [
        {
          "id": "mmwvyig",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1744559814.0
        },
        {
          "id": "mmyq47u",
          "author": "Ashamed_Ad8162",
          "body": "And nope. You have no idea what other people eat. Fat people can and do have atypical anorexia, bulimia, OSFED, etc. \n\nPerceived restriction does not equal willpower.",
          "created_utc": 1744580815.0
        },
        {
          "id": "mmyshpp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1744581616.0
        }
      ]
    }
  ]
}