{
  "id": "1k2sigo",
  "subreddit": "AnorexiaNervosa",
  "author": "craynerr",
  "created_utc": 1745055235.0,
  "title": "dae find that being underweight 'fixed' their body dysmorphia",
  "selftext": "When I was heavier (most of my life) I used to have a visceral reaction (feeling nauseous/distressed) whenever I caught sight of myself, to the point that I would avoid mirrors and ask to never be in photos. Granted, I doubt I'll ever be at the stage where I love how I look/believe that I'm attractive, but since dropping weight to a borderline unhealthy degree I am definitely a lot more comfortable seeing myself in the mirror and will be happy to appear in photos or even post them on social media. \n\nI'm a little resentful of family telling me I'm too skinny / judging me for my eating habits now because mentally I've never felt more at ease with how I look. Part of me wonders if I ever had body dysmorphia, or if I was simply aware of how chubby I was when I looked in the mirror. I look at past photos of myself and wonder how my family never commented on how overweight I looked. I'm hoping they're just used to how I looked back then compared to this sudden change they've seen in how I look now. I'm hoping if I keep this up for long enough they'll eventually get used to it and the comments will stop. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1k2sigo/dae_find_that_being_underweight_fixed_their_body/",
  "score": 110,
  "num_comments": 16,
  "comments": [
    {
      "id": "mnwheu0",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1745055235.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mnwm8dt",
      "author": "Queenofwands1212",
      "body": "Yes holy shit yes… sadly, and I’ve even explained this to my therapist. That getting underweight has actually made my mental health better because I’m not in this constant panic mental breakdown feeling swollen and having visceral reactions to the way my body feels, seeing my body in the mirror etc. I used to have to wear leggings and a long sleeve shirt and a flannel around my waiste when I taught hot yoga. Now I can wear leggings and walk around the room and not feel like I’m going to have a severe nervous breakdown. Like… I truly felt worse when I was a normal bmi, I couldn’t function. I probably sound like an idiot but yeah…. Being underweight has made my body image issues way better",
      "created_utc": 1745058290.0,
      "score": 75,
      "context": []
    },
    {
      "id": "mnwvcp4",
      "author": "ketchupian",
      "body": "It definitely relieved the 24/7 stress I felt from being crazy self conscious about my body. But it did add the new stress of having the upkeep an unrealistic lifestyle.",
      "created_utc": 1745063299.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mnzkn8l",
      "author": "thrxwxxx",
      "body": "no, I wish. I definitely *think* I don’t have dysmorphia and that I know what I really look like, but the logical part of me remembers the times I’ve been in recovery looking back at my sick body years ago and realizing I had no clue how small I was. now I am at my lowest weight ever and still feel large but I don’t feel that it is inaccurate, I feel like I know what I look like— yet I know from experience that isn’t true. does that make sense?\n\nso I don’t trust my body size anymore. I think anorexia makes it impossible to know your appearance",
      "created_utc": 1745096411.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mnye8ty",
      "author": "Bubbly_Midnightt",
      "body": "It did but it didn’t. Then added fear of my health failing. The issue really isn’t my weight, and that’s something I try to remind myself of pretty regularly. 🥲",
      "created_utc": 1745082666.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mnzkkfj",
      "author": "turnipkitty112",
      "body": "Honestly, yes. For the most part. I know it’s kind of a controversial thing to say and certainly not the case for everyone. A large part of my body image issues is to do with having a feminine body, gender dysphoria, etc. When I’m very underweight it doesn’t bother me much. I don’t bodycheck or take a bunch of pictures compulsively or change outfits a bunch. I don’t look at my body excessively or avoid looking at it at all. \n\nThe caveat is that although I don’t experience body image *distress*, I still have some degree of body image *distortion* as I see myself as just mildly thin or like, skinny in a way that passes as healthy, rather than severely underweight. Loved ones tell me I look sick and I truly don’t believe them, because I think that’s just bc they know about my ED and are worried - strangers never comment on my body or act concerned. \n\nWhen I was at a healthier weight I experienced so much distress, and body checking/avoidance behaviours. It doesn’t bother me like that anymore. If I gain even a little bit though, even though I’m still objectively underweight, I get very distressed again. And since I regained my period (despite not gaining weight) I’ve also experienced a resurgence of distress associated with my gender.",
      "created_utc": 1745096386.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mnyjz4w",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1745084446.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mo21vjk",
      "author": "monsterzerog1rl",
      "body": "At first, yeah, but now I feel it's barely acceptable to only be uw and feel disgust towards myself until I reach a really low bmi",
      "created_utc": 1745133648.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mo0cfrr",
      "author": "Shuyuya",
      "body": "No",
      "created_utc": 1745106069.0,
      "score": 2,
      "context": []
    },
    {
      "id": "modmqt8",
      "author": "Eastern_Bug5217",
      "body": "Yes and no. I’m underweight, but I then hear from my mom that I used to be thinner (so she isn’t concerned). OBJECTIVELY she is wrong, I’m at my thinnest now and almost severely underweight bmi. But I am now seeing my body as overweight and disgusting. I wear baggy clothes—probably why she isn’t noticing",
      "created_utc": 1745295299.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mnx6mql",
      "author": "doglover974",
      "body": "I used to not be able to remove my engagement ring when I showered cause my finger was so swollen due to being overweight, now I'm much lighter (still not underweight) I can! Something as simple as that makes a HUGE difference to my mental health, I no longer cringe when I look down at my hands, let alone in the mirror! Seeing myself without clothes on is still difficult though, so I just wear body conforming clothes under everything and then don't hate my appearance. Never realised that before I lost the weight I had body dysmorphia,  until now I look different and I actually feel like me again!",
      "created_utc": 1745068181.0,
      "score": 16,
      "context": [
        {
          "id": "mnwm8dt",
          "author": "Queenofwands1212",
          "body": "Yes holy shit yes… sadly, and I’ve even explained this to my therapist. That getting underweight has actually made my mental health better because I’m not in this constant panic mental breakdown feeling swollen and having visceral reactions to the way my body feels, seeing my body in the mirror etc. I used to have to wear leggings and a long sleeve shirt and a flannel around my waiste when I taught hot yoga. Now I can wear leggings and walk around the room and not feel like I’m going to have a severe nervous breakdown. Like… I truly felt worse when I was a normal bmi, I couldn’t function. I probably sound like an idiot but yeah…. Being underweight has made my body image issues way better",
          "created_utc": 1745058290.0
        }
      ]
    },
    {
      "id": "mnzqdjr",
      "author": "craynerr",
      "body": "Yes, I relate so hard to this! I struggle to discern how I look to the average person because while my loved ones tell me I look sick, acquaintances will indicate that I look strong or that I've never looked better. It's so contradictory and really difficult when you can't trust yourself to correctly perceive/evaluate what you see in the mirror.",
      "created_utc": 1745098376.0,
      "score": 5,
      "context": [
        {
          "id": "mnzkkfj",
          "author": "turnipkitty112",
          "body": "Honestly, yes. For the most part. I know it’s kind of a controversial thing to say and certainly not the case for everyone. A large part of my body image issues is to do with having a feminine body, gender dysphoria, etc. When I’m very underweight it doesn’t bother me much. I don’t bodycheck or take a bunch of pictures compulsively or change outfits a bunch. I don’t look at my body excessively or avoid looking at it at all. \n\nThe caveat is that although I don’t experience body image *distress*, I still have some degree of body image *distortion* as I see myself as just mildly thin or like, skinny in a way that passes as healthy, rather than severely underweight. Loved ones tell me I look sick and I truly don’t believe them, because I think that’s just bc they know about my ED and are worried - strangers never comment on my body or act concerned. \n\nWhen I was at a healthier weight I experienced so much distress, and body checking/avoidance behaviours. It doesn’t bother me like that anymore. If I gain even a little bit though, even though I’m still objectively underweight, I get very distressed again. And since I regained my period (despite not gaining weight) I’ve also experienced a resurgence of distress associated with my gender.",
          "created_utc": 1745096386.0
        }
      ]
    },
    {
      "id": "mnzheuk",
      "author": "craynerr",
      "body": "That's unfortunate- I find it's definitely helped ease some of my gender dysphoria as well which probably plays into this (flatter chest, body fat distribution change, no more comments on my figure, etc.)",
      "created_utc": 1745095340.0,
      "score": 3,
      "context": [
        {
          "id": "mnyjz4w",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1745084446.0
        }
      ]
    },
    {
      "id": "mo2f3nc",
      "author": "HospitalAcrobatic155",
      "body": "same",
      "created_utc": 1745142133.0,
      "score": 3,
      "context": [
        {
          "id": "mo21vjk",
          "author": "monsterzerog1rl",
          "body": "At first, yeah, but now I feel it's barely acceptable to only be uw and feel disgust towards myself until I reach a really low bmi",
          "created_utc": 1745133648.0
        }
      ]
    },
    {
      "id": "mo1vv0e",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1745130012.0,
      "score": 3,
      "context": [
        {
          "id": "mo0cfrr",
          "author": "Shuyuya",
          "body": "No",
          "created_utc": 1745106069.0
        }
      ]
    },
    {
      "id": "mrosu2u",
      "author": "Additional_Ease2408",
      "body": "Can't wait to start T so I can finally look masc 🙏🏻",
      "created_utc": 1746930999.0,
      "score": 1,
      "context": [
        {
          "id": "mnyjz4w",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1745084446.0
        },
        {
          "id": "mnzheuk",
          "author": "craynerr",
          "body": "That's unfortunate- I find it's definitely helped ease some of my gender dysphoria as well which probably plays into this (flatter chest, body fat distribution change, no more comments on my figure, etc.)",
          "created_utc": 1745095340.0
        }
      ]
    },
    {
      "id": "mo2l8c2",
      "author": "Shuyuya",
      "body": "I didn’t detail my response but tbh I find it weird if you become underweight, still are anorexic, but your BDD is gone. It isn’t. Maybe you feel better not being overweight anymore, but if you really liked your body and had no problem with it, you wouldn’t still be anorexic. Also from what I’ve seen reading lots of posts from r/BodyDysmorphia, a lot of people are insecure of the way they look but do not have BDD. Disliking or hating how you look doesn’t necessarily mean you have BDD. It isn’t about that especially if it’s real, BDD is having a distorted vision of how you look, not being sad you’re fat while being actually fat, being sick of being short when you’re actually short. But many people think they have to have a condition if they hate the way they look. They don’t.",
      "created_utc": 1745146002.0,
      "score": 4,
      "context": [
        {
          "id": "mo0cfrr",
          "author": "Shuyuya",
          "body": "No",
          "created_utc": 1745106069.0
        },
        {
          "id": "mo1vv0e",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1745130012.0
        }
      ]
    },
    {
      "id": "mo5ip72",
      "author": "craynerr",
      "body": "I agree, which is why I've always questioned whether or not I have BDD, despite being told by others/(including therapists) that I do. But I think there's a difference between being \"sad or sick of it\" vs. not being able to evaluate how you look in the mirror without hating yourself / thinking you look normal or good at a weight that others perceive as unhealthy vs. thinking you look overweight at a weight range that is considered medically fit and healthy",
      "created_utc": 1745183569.0,
      "score": 2,
      "context": [
        {
          "id": "mo0cfrr",
          "author": "Shuyuya",
          "body": "No",
          "created_utc": 1745106069.0
        },
        {
          "id": "mo1vv0e",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1745130012.0
        },
        {
          "id": "mo2l8c2",
          "author": "Shuyuya",
          "body": "I didn’t detail my response but tbh I find it weird if you become underweight, still are anorexic, but your BDD is gone. It isn’t. Maybe you feel better not being overweight anymore, but if you really liked your body and had no problem with it, you wouldn’t still be anorexic. Also from what I’ve seen reading lots of posts from r/BodyDysmorphia, a lot of people are insecure of the way they look but do not have BDD. Disliking or hating how you look doesn’t necessarily mean you have BDD. It isn’t about that especially if it’s real, BDD is having a distorted vision of how you look, not being sad you’re fat while being actually fat, being sick of being short when you’re actually short. But many people think they have to have a condition if they hate the way they look. They don’t.",
          "created_utc": 1745146002.0
        }
      ]
    }
  ]
}