{
  "id": "1k57n49",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1745331986.0,
  "title": "What I learned from not recovering early",
  "selftext": "It makes me sad to see some people with anorexia say they need to lose more weight or become sicker, so that it feels worth it to get better. Or so more people will show concern for them. As someone who has had anorexia for 19 years and has never fully recovered from it, here is what I learned from putting off help, from avoiding treatment and essentially staying sick for so long\n\nWhen the anorexic voice is shouting at you that you need to lose more weight so you feel valid, that thought pattern is an indication of just how sick you already are. Healthy people don't wish they were sicker. So if you ever think to yourself \"I feel like I need to lose just a little more weight and then people will take me seriously,\" that is when you have a problem. And your problem is serious\n\nThe thing is, you could become emaciated and be admitted to a hospital. You won't feel like recovering, even then. The malnourishment will affect your thinking. You may not actually feel ill. But doctors are telling you otherwise. You may still believe that you need to become even worse. You are chasing after a feeling of validation. But even at your sickest, you will never feel it.\n\nI felt the same way, at the time of my inpatient treatments for anorexia. I was severely ill. But certainly didn't see it. When my treatment team told me they thought I was at risk of dying and they would not allow me to leave the hospital, I did not believe them and refused to listen.\n\nEach time I asked to leave the inpatient centers I was at, I was told no. They told me they were worried I would die if I left the hospital. Sounds like that would make a person snap out of what they are doing, doesn't it? But not with anorexia. That's why this disorder is so scary. Each day, different plates of food were placed in front of me. While nurses sat beside me so I couldn't get rid of the food. I struggled to get through each meal. But I knew if I did not eat the food, I would get a feeding tube. So day after day, I had to sit through breakfast, lunch, dinner and several snacks, consuming every morsel. While my eating disorder brain shouted at me to get home and lose the weight\n\nThey didn't want me to burn off the calories I was eating. So they wanted us all to sit down and not stand as much, after we finished eating. If you had to go off and get blood tests down stairs or talk to one of your therapists, some people were so sick, they moved them around in a wheelchair. I was the only anorexic person who wouldn't get in the wheelchair to go downstairs. I didn't feel like I needed it. My body temperature was so low when I first got there, they put a warming blanket on me to get my temperature up. I did not feel like I needed a warming blanket. But I had to sit there with it on. They told me my weight was so low, that it was affecting the function of my organs. My response was \"I would just like to go home and lose weight again.\"  When you are ill, you aren't always going to feel like you are ill. And starvation affects your thinking. So I was really not interested in being helped. But I knew the only way out the hospital was to eat the food and do what they said. I did not go to residential or outpatient afterwards because I wanted out of that controlled type of environment. And residential sounded scary to me at the time. I didn't even consider it. I just instantly refused.\n\nSo there was never a point during my inpatient hospitalizations where I thought \"I am really sick and these people are absolutely right. There is a reason they are working on refeeding me and why they want me to go to more treatment after I leave here.\" Those thoughts didn't cross my mind. I was younger and had only been anorexic for two years at that point. Because of my age at the time, my brain likely wasn't fully developed. Malnourishment was affecting my thinking. And while I gained some weight during treatment, I never fully restored my weight. I was at a healthy weight for my age and height before my eating disorder, but I have never returned to that weight. So this caused further problems. After leaving inpatient, I lost every pound I gained. During my second hospitalization, I became even sicker. I weighed even less during the second inpatient admission than the first one. This was the hospital specifically designed for those with anorexia, where I was really scared. This was the hospital where they wanted to give me a feeding tube, because I was refusing food. And you know what? I didn't feel sick enough, validated or like people were trying to look after me and help me. When I heard the words \"You aren't eating so you are getting a feeding tube,\" I got so scared and, after that, I agreed to start eating. They are basically trying to keep you from dying. There were people of all ages in the hospital. Some were recovering and some were really sick. Even when you are really sick, you are never going to feel valid. I did not view treatment as people trying to save me at the time. I viewed treatment as people trying to take away my control. I was angry at my parents for driving me to both inpatient centers and leaving me there. I wanted to go back home with them whenever they came to visit. I felt like my choices were taken from me. All the weight I gained was lost. I didn't learn anything from being in the hospital. I only had negative feelings towards the places I went to and never wanted to go back\n\nFast forward to now. It is years after my inpatient hospitalizations. I am still very sick and have severe and enduring anorexia. For years, I remained malnourished and at a low weight. I tried a few therapists and attempts at outpatient treatment. Nothing that stuck with me and got me to change my thinking. No further inpatient treatments. For a long time, my body kept going. The first medical complication I ended up with was osteoporosis. I was younger during my inpatient stays, so because I was renourished right away, my body was more resilient and healed from the damage. I put more strain and stress on my body by continuing to starve it. Now my anorexia is affecting my organs. Some of my medical complications are possibly permanent. I did not know starvation could damage the bladder and cause things like frequent urination. But it can happen, even when you do not think it can happen to you. By not treating my disorder, and never coming to terms with how ill I truly was at the time of my inpatient stays, my disorder just grew more severe. The ed thoughts louder, the behaviors more engrained. I am on palliative care for my anorexia. My parents are still helping me but I know that it makes them sad I have not managed to fully recover from my disorder. I am trying to remain positive. I am glad I am still here. I want to work on getting better, even if it is going to be difficult\n\nThere was a girl in inpatient who became a very good friend of mine. She was a few years older than me. She was severely ill, like me. We enjoyed each other's company during our hospital stays. She had been through repeated inpatient stays. She was so ill, but could not see it. She was emaciated, but asked me if she looked fat during my last week there. Hearing her say that made me sad. But it's really what she thought, no matter how many people in treatment tried to tell her, otherwise. Anorexic people often have a distorted view of themselves. You can be really thin, and think you need to be thinner. You could be thin and actually see yourself as overweight. She stayed in touch with me for a few years after I got out of the hospital. She never fully recovered. I am sure that she never reached a point where she truly felt sick enough. She starved herself for so long, that her body simply couldn't handle it anymore. She passed away five years after I met her. During those five years, I stayed in touch with her by calling her on the phone and sending her letters. Her death really affected me. But I did not reach out for help for my anorexia after she died. I got worse\n\nSo if there is anything to take away from this post, it is this. Your eating disorder has one single purpose. And that is to make you unhappy. Your reasons for developing this illness will be different from another person's. Every person deserves to feel like they are not alone. And like things can get better for them. I do not think recovery is impossible for me, but it is more difficult because I have been sick for so long. I have to work really hard to change certain behaviors. Some days, this feels impossible. No matter how low your weight goes, whether you have had a feeding tube or have never had a feeding tube, no matter how many medical complications you end up getting, and no matter how many inpatient stays you have gone through, you will never feel valid. You will never feel sick enough. Your illness will convince you that you aren't that bad and things could be worse. Becoming sicker just makes you sicker. I wish I had not put off getting help. I wish I had not waited until I developed medical complications to get help. Now I am in physical pain and older, with an eating disorder. Now, I have to fight even harder than before. Because now, my body isn't as healthy as it once was. You don't think an eating disorder will become chronic, certainly not when you are younger and it just started. If you end up becoming chronic, it is not your fault and you deserve to feel supported. There is hope for everyone to improve. Although this disorder does have a high death rate. People did everything possible to help my friend that died but she was just too ill. I still think about her often. So if you are struggling and not feeling valid, I want to remind you that you are valid. Whether you have suffered for a year or 20 years. And you deserve better",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1k57n49/what_i_learned_from_not_recovering_early/",
  "score": 126,
  "num_comments": 11,
  "comments": [
    {
      "id": "mofp834",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1745331987.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mofwbqf",
      "author": "_-ollie",
      "body": "whenever I see your posts on here, I want to give you a hug through the screen. :(\n\n yout posts seem to always articulate the thoughts I can't put into words, so thank you. but I'm sorry you're struggling.",
      "created_utc": 1745334114.0,
      "score": 32,
      "context": []
    },
    {
      "id": "mog6gj8",
      "author": "DoNotGoGentle27",
      "body": "Firstly, Thank you for sharing such a personal story with us. I'm sorry this is a life you have lived and sending hugs to you.\n\nI've had a similar story.\n\n14 years for me. Almost HALF of my life. It feels like it's all I've ever known.\n\nAnd because of this, I'm just too defeated to even try living another way. I never had that kind of fight in me.\n\nSo anyone reading this early, believe me when I say the *longer* that voice tells you that being small will equate to happiness, the harder it will be to convince that lying voice otherwise. Because you are just going to continue  waiting for a day that will NEVER come.\n\nI wouldn't wish this life of misery on anybody.",
      "created_utc": 1745337073.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mpgrw5s",
      "author": "ska_4_",
      "body": "Thank you for being so strong and trying to help others with the same problem i myself don't have an eating disorder but i have a friend who does and i just don't know how to help i tried searching the internet but they all say the same basic things like being kind to them and not judge them but none of that is helping honestly, but i do have an addiction and i have seen some Similar symptoms between the two so do you think advising her with the techniques that i use with addiction could help?",
      "created_utc": 1745839643.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mppygxr",
      "author": "BoringRelationship91",
      "body": "thank you for sharing. i’m so scared and feel alone. i feel sick but not sick enough for it to matter. i need to remind myself that i matter.",
      "created_utc": 1745957767.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mofy25d",
      "author": "Coffeegreysky12",
      "body": "Thank you. That's kind of you to say. I have been writing ever since I was a child. I find it helpful to write about my experience. Writing helps to make me feel better. And I hope my posts help anyone who is struggling as well",
      "created_utc": 1745334637.0,
      "score": 17,
      "context": [
        {
          "id": "mofwbqf",
          "author": "_-ollie",
          "body": "whenever I see your posts on here, I want to give you a hug through the screen. :(\n\n yout posts seem to always articulate the thoughts I can't put into words, so thank you. but I'm sorry you're struggling.",
          "created_utc": 1745334114.0
        }
      ]
    },
    {
      "id": "mog8rnb",
      "author": "Coffeegreysky12",
      "body": "You are welcome. I am sorry you are struggling as well. Yes, it is so true. The longer you wait to get help, the harder it will be. Anorexia is a cruel disorder. The thoughts can be all consuming and hard to fight against.",
      "created_utc": 1745337737.0,
      "score": 6,
      "context": [
        {
          "id": "mog6gj8",
          "author": "DoNotGoGentle27",
          "body": "Firstly, Thank you for sharing such a personal story with us. I'm sorry this is a life you have lived and sending hugs to you.\n\nI've had a similar story.\n\n14 years for me. Almost HALF of my life. It feels like it's all I've ever known.\n\nAnd because of this, I'm just too defeated to even try living another way. I never had that kind of fight in me.\n\nSo anyone reading this early, believe me when I say the *longer* that voice tells you that being small will equate to happiness, the harder it will be to convince that lying voice otherwise. Because you are just going to continue  waiting for a day that will NEVER come.\n\nI wouldn't wish this life of misery on anybody.",
          "created_utc": 1745337073.0
        }
      ]
    },
    {
      "id": "mph69r3",
      "author": "Coffeegreysky12",
      "body": "You are welcome. Yes, I think that could help. Eating disorders are similar to addiction",
      "created_utc": 1745845571.0,
      "score": 1,
      "context": [
        {
          "id": "mpgrw5s",
          "author": "ska_4_",
          "body": "Thank you for being so strong and trying to help others with the same problem i myself don't have an eating disorder but i have a friend who does and i just don't know how to help i tried searching the internet but they all say the same basic things like being kind to them and not judge them but none of that is helping honestly, but i do have an addiction and i have seen some Similar symptoms between the two so do you think advising her with the techniques that i use with addiction could help?",
          "created_utc": 1745839643.0
        }
      ]
    },
    {
      "id": "mppz911",
      "author": "Coffeegreysky12",
      "body": "You are welcome. Your struggles are valid",
      "created_utc": 1745957990.0,
      "score": 1,
      "context": [
        {
          "id": "mppygxr",
          "author": "BoringRelationship91",
          "body": "thank you for sharing. i’m so scared and feel alone. i feel sick but not sick enough for it to matter. i need to remind myself that i matter.",
          "created_utc": 1745957767.0
        }
      ]
    },
    {
      "id": "mok2uyq",
      "author": "JHRChrist",
      "body": "It truly, truly affects your brain. Your brain will be basically eaten away at over time and actually shrink, esp your grey matter which is the most crucial part for making logical decisions (such as choosing to keep yourself alive)\n\nTo all those suffering, get help now before further damage to your brain and body occurs. The brain damage - while mostly reversible once you are refed for a good period of time - can literally make recovery almost impossible. How can a shrunken, malnourished brain do the reasoning and learning and changing necessary to recover? How can it when it needs the energy and glucose to form new neural pathways? (Answer: it can but it is MUCH harder)\n\nDon’t let that be your story. Get help early before it is entrenched. **Get weight restored and maintain it for a good amount of time before you decide to give up on recovery.** Get your body and brain healthy AND THEN give time for your mind and thoughts and emotions to heal now that your brain is fed, with the help of trusted mental health professionals. \n\nThe refeeding really needs to come first (with professional support if needed). There’s always hope. I’ve seen it!",
      "created_utc": 1745382922.0,
      "score": 4,
      "context": [
        {
          "id": "mog6gj8",
          "author": "DoNotGoGentle27",
          "body": "Firstly, Thank you for sharing such a personal story with us. I'm sorry this is a life you have lived and sending hugs to you.\n\nI've had a similar story.\n\n14 years for me. Almost HALF of my life. It feels like it's all I've ever known.\n\nAnd because of this, I'm just too defeated to even try living another way. I never had that kind of fight in me.\n\nSo anyone reading this early, believe me when I say the *longer* that voice tells you that being small will equate to happiness, the harder it will be to convince that lying voice otherwise. Because you are just going to continue  waiting for a day that will NEVER come.\n\nI wouldn't wish this life of misery on anybody.",
          "created_utc": 1745337073.0
        },
        {
          "id": "mog8rnb",
          "author": "Coffeegreysky12",
          "body": "You are welcome. I am sorry you are struggling as well. Yes, it is so true. The longer you wait to get help, the harder it will be. Anorexia is a cruel disorder. The thoughts can be all consuming and hard to fight against.",
          "created_utc": 1745337737.0
        }
      ]
    },
    {
      "id": "molgk0f",
      "author": "Coffeegreysky12",
      "body": "Well said",
      "created_utc": 1745410520.0,
      "score": 1,
      "context": [
        {
          "id": "mog6gj8",
          "author": "DoNotGoGentle27",
          "body": "Firstly, Thank you for sharing such a personal story with us. I'm sorry this is a life you have lived and sending hugs to you.\n\nI've had a similar story.\n\n14 years for me. Almost HALF of my life. It feels like it's all I've ever known.\n\nAnd because of this, I'm just too defeated to even try living another way. I never had that kind of fight in me.\n\nSo anyone reading this early, believe me when I say the *longer* that voice tells you that being small will equate to happiness, the harder it will be to convince that lying voice otherwise. Because you are just going to continue  waiting for a day that will NEVER come.\n\nI wouldn't wish this life of misery on anybody.",
          "created_utc": 1745337073.0
        },
        {
          "id": "mog8rnb",
          "author": "Coffeegreysky12",
          "body": "You are welcome. I am sorry you are struggling as well. Yes, it is so true. The longer you wait to get help, the harder it will be. Anorexia is a cruel disorder. The thoughts can be all consuming and hard to fight against.",
          "created_utc": 1745337737.0
        },
        {
          "id": "mok2uyq",
          "author": "JHRChrist",
          "body": "It truly, truly affects your brain. Your brain will be basically eaten away at over time and actually shrink, esp your grey matter which is the most crucial part for making logical decisions (such as choosing to keep yourself alive)\n\nTo all those suffering, get help now before further damage to your brain and body occurs. The brain damage - while mostly reversible once you are refed for a good period of time - can literally make recovery almost impossible. How can a shrunken, malnourished brain do the reasoning and learning and changing necessary to recover? How can it when it needs the energy and glucose to form new neural pathways? (Answer: it can but it is MUCH harder)\n\nDon’t let that be your story. Get help early before it is entrenched. **Get weight restored and maintain it for a good amount of time before you decide to give up on recovery.** Get your body and brain healthy AND THEN give time for your mind and thoughts and emotions to heal now that your brain is fed, with the help of trusted mental health professionals. \n\nThe refeeding really needs to come first (with professional support if needed). There’s always hope. I’ve seen it!",
          "created_utc": 1745382922.0
        }
      ]
    }
  ]
}