{
  "id": "1k69okk",
  "subreddit": "AnorexiaNervosa",
  "author": "zaddyh0e",
  "created_utc": 1745440584.0,
  "title": "do people forget we’re not all exercise addicts?",
  "selftext": "saw the realest tiktok today about how when a woman was in treatment her team thought she was secretly exercising when realistically she was walking more in hospital than she did at home/regularly. it really hit home because im SOOO lazy and have always felt spoken for when it came to discussing movement. we don’t all pace up and down constantly, do sit ups and star jumps 24/7 so why is it so hard to believe? ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1k69okk/do_people_forget_were_not_all_exercise_addicts/",
  "score": 242,
  "num_comments": 25,
  "comments": [
    {
      "id": "moo7z8g",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1745440584.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mooa6zb",
      "author": "SwungBurito",
      "body": "Honestly I work out way more during and post recovery than during Ana. People think that it is all about looking great, but like, as you know, it is so much more complicated.",
      "created_utc": 1745441224.0,
      "score": 92,
      "context": []
    },
    {
      "id": "mooeefp",
      "author": "Fluttery_Soul",
      "body": "Real! I have had times where I was addicted to overexercise and eating healthy and I have had times where I was 'junkorexic' and didn't wanna move at all and would just sit around all day or lay in bed and I was restricting either way. There is really no way to profile an anorexic or their habits cuz we can all be so different but struggle the same just maybe in diff ways",
      "created_utc": 1745442447.0,
      "score": 60,
      "context": []
    },
    {
      "id": "mop9n3m",
      "author": "Thick_Reaction_9887",
      "body": "Ppl dont forget, they just assume. There's no forgetting info you don't really know to begin with. Many people don't have a grasp on what an eating disorder really is or how it can manifest from person to person since we're all very different and the labels given for eds are very rigid. I have an ex who is older than me who had no idea what the word anorexia, let alone anything like arfid, bulimia, ednos, bed, ect. meant. Could not tell me a thing about eating disorders. \nTo summarize, people are often unaware of things unless it has or does directly impact them.",
      "created_utc": 1745452625.0,
      "score": 15,
      "context": []
    },
    {
      "id": "moolsr3",
      "author": "zodiacqu33n",
      "body": "Absolutely! Holy fuck was just thinking abt exercise right b4 I opened up the Reddit app and this is the first thing that popped up at the top of my feed. It has me all paranoid. I’m literally wondering rn whether sitting upright all day rather than taking breaks to rest and lay down is considered “overexercising” lmao. I’ve never been an active person at all… But I do have back problems so could probably rest more. I use my upper body damn near constantly. But “exercise” is sort of a loose term right? Idk. I’m probably not making sense. I think I push myself to the limit in ways that aren’t obvious. But ur absolutely right that everyone is different and ppl get treated all the same in treatment.",
      "created_utc": 1745444720.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mop37sz",
      "author": "PuzzleheadedWrap4078",
      "body": "I have always exercised my whole life and suddenly I was being told I was over exercising when folding my clothes\nLike I get it if i was just out of icu and on deaths actual door but if you put into peoples heads that literally every possible movement is exercise - it will become obsessive",
      "created_utc": 1745450459.0,
      "score": 9,
      "context": []
    },
    {
      "id": "moon0wf",
      "author": "Alpha_uterus",
      "body": "Honestly exercise is the only thing that motivates me to eat right, because history has taught me if I’m exercising and under eating I will get hurt. \n\nIf I’m exercising I’m probably doing ok food wise. It’s when I have no energy and want to spend all day in bed, that’s the danger zone. No food no fuel no energy.",
      "created_utc": 1745445103.0,
      "score": 10,
      "context": []
    },
    {
      "id": "moopbwp",
      "author": "None",
      "body": "I was a sprinter and played loads of sport before my ed, during it I probably averaged like 2k steps a day at most lol",
      "created_utc": 1745445841.0,
      "score": 8,
      "context": []
    },
    {
      "id": "morzuce",
      "author": "shinyturtle2137",
      "body": "real, i developed my ed bc im lazy and wanted to lose weight without exercising so i restricted instead 😭",
      "created_utc": 1745497590.0,
      "score": 4,
      "context": []
    },
    {
      "id": "moqburs",
      "author": "anxiety_attack77",
      "body": "relatable 100%",
      "created_utc": 1745466443.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mp72a51",
      "author": "cxm88_",
      "body": "I'm anorexic and have a fear of just sitting on my bed in the afternoon. One thing I no longer do at all: lie down during the day. Whether it's to scroll or just out of boredom. I can stay up all afternoon. But I'm anxious about \"doing nothing\", I always try to walk +, I have my sports routines that I force myself to do to reassure myself, to \"compensate\" a little.\n\nI've been doing sport \"in secret\" for a very long time and it's a very unhealthy relationship that I have with sport. \n\nBut I still reduced a little because before I forced myself to do more.",
      "created_utc": 1745695961.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mougfll",
      "author": "wysteria222",
      "body": "i've never been able to exercise because of my health but especially now, the most physical activity i get is walking literally next door to the bathroom once a day",
      "created_utc": 1745523912.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mp2xr3z",
      "author": "sage-green-lover",
      "body": "Pre any treatment I was doing non intensive exercise most days, then during my first year of treatement I did no exercise out of walking my dog and mostly laid in bed, and then during a recent relapse I got really really intensely into the gym. So everyone has a different experience and even people at different times of their disorder will have different movement levels",
      "created_utc": 1745634436.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mp34g7q",
      "author": "Fine-Yesterday-8936",
      "body": "Mine was caused by ARFID. Literally had so much texture issues with food I couldn't eat anything for the longest time.",
      "created_utc": 1745636945.0,
      "score": 2,
      "context": []
    },
    {
      "id": "moxfwgg",
      "author": "Swipetoshop",
      "body": "So real! …same with purging not ALL people with EDs do that either! But it’s always assumed 😒",
      "created_utc": 1745562817.0,
      "score": 1,
      "context": []
    },
    {
      "id": "moxm4wm",
      "author": "mygwismydream",
      "body": "In my personal experience excercise is quite a strange thing. When I had ad ed but I wasn't \"skinny enough\" I was quitly admired for my discipline in excercise (gym, steps, workouts, agonystic training...) even if sometimes I was too tired even to take the stairs. Since when I have had an ed everything changed all in a sudden: or I was (in their mind) secretly excercising and I wasn't allowed even to stand up to take some water ir I wasn't excercising too much (even if I do follow a normal program and fuel my body).",
      "created_utc": 1745566568.0,
      "score": 1,
      "context": []
    },
    {
      "id": "moyd1pi",
      "author": "None",
      "body": "I had a period of very strong vigorexia. Obsessed with proteins, healthy food, everything being as \"natural as possible\", he exercised 3 hours a day, etc. The truth is, I lost a lot of weight but it was horrible. One of the worst periods of my life. I would never return to that place. Exercising hurts me mentally.",
      "created_utc": 1745581660.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mplbzlv",
      "author": "Curious_Goat_8991",
      "body": "Part of my ed is an exercise addiction, but there are days where I physically cannot no matter how much my ed screams at me. Being underweight has caused me to have zero energy so I actually exercised more before I became uw. \n\nAlso, people forget that every person with an Ed has different rules/rituals/fears, etc., so it’s really hard to make generalizations. When I went into residential treatment, I was so surprised at the different safe foods others had. The other residents were regularly eating foods I was terrified of, and vice versa.",
      "created_utc": 1745893324.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpnu74l",
      "author": "Mushrooming2",
      "body": "Some days I’ll do so much and other days I won’t move off the sofa",
      "created_utc": 1745935718.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mooovyx",
      "author": "russalkaa1",
      "body": "same, when i’m at my lw i barely move lol. at my healthiest i’m active ",
      "created_utc": 1745445695.0,
      "score": 32,
      "context": [
        {
          "id": "mooa6zb",
          "author": "SwungBurito",
          "body": "Honestly I work out way more during and post recovery than during Ana. People think that it is all about looking great, but like, as you know, it is so much more complicated.",
          "created_utc": 1745441224.0
        }
      ]
    },
    {
      "id": "moq2fnx",
      "author": "Pink_Bread_76",
      "body": "yep!! same",
      "created_utc": 1745462706.0,
      "score": 5,
      "context": [
        {
          "id": "mooa6zb",
          "author": "SwungBurito",
          "body": "Honestly I work out way more during and post recovery than during Ana. People think that it is all about looking great, but like, as you know, it is so much more complicated.",
          "created_utc": 1745441224.0
        }
      ]
    },
    {
      "id": "moolyr6",
      "author": "zodiacqu33n",
      "body": "I have binge/purge subtype. Idk how many ppl here can relate to that. But the binges end up making me want to exercise to compensate. I’m trying to work on breaking the cycle!",
      "created_utc": 1745444771.0,
      "score": 14,
      "context": [
        {
          "id": "mooeefp",
          "author": "Fluttery_Soul",
          "body": "Real! I have had times where I was addicted to overexercise and eating healthy and I have had times where I was 'junkorexic' and didn't wanna move at all and would just sit around all day or lay in bed and I was restricting either way. There is really no way to profile an anorexic or their habits cuz we can all be so different but struggle the same just maybe in diff ways",
          "created_utc": 1745442447.0
        }
      ]
    },
    {
      "id": "mp4oo9w",
      "author": "zaddyh0e",
      "body": "Oh definitely. I specifically meant the frustration with “professionals” thinking eating disorders are linear but that’s my fault for not making it clear lol",
      "created_utc": 1745667065.0,
      "score": 2,
      "context": [
        {
          "id": "mop9n3m",
          "author": "Thick_Reaction_9887",
          "body": "Ppl dont forget, they just assume. There's no forgetting info you don't really know to begin with. Many people don't have a grasp on what an eating disorder really is or how it can manifest from person to person since we're all very different and the labels given for eds are very rigid. I have an ex who is older than me who had no idea what the word anorexia, let alone anything like arfid, bulimia, ednos, bed, ect. meant. Could not tell me a thing about eating disorders. \nTo summarize, people are often unaware of things unless it has or does directly impact them.",
          "created_utc": 1745452625.0
        }
      ]
    },
    {
      "id": "moopo64",
      "author": "Fluttery_Soul",
      "body": "Omg I used to do that too! I thought exercising to make up for binges would make me feel better but it was only feeding the cycle",
      "created_utc": 1745445953.0,
      "score": 10,
      "context": [
        {
          "id": "mooeefp",
          "author": "Fluttery_Soul",
          "body": "Real! I have had times where I was addicted to overexercise and eating healthy and I have had times where I was 'junkorexic' and didn't wanna move at all and would just sit around all day or lay in bed and I was restricting either way. There is really no way to profile an anorexic or their habits cuz we can all be so different but struggle the same just maybe in diff ways",
          "created_utc": 1745442447.0
        },
        {
          "id": "moolyr6",
          "author": "zodiacqu33n",
          "body": "I have binge/purge subtype. Idk how many ppl here can relate to that. But the binges end up making me want to exercise to compensate. I’m trying to work on breaking the cycle!",
          "created_utc": 1745444771.0
        }
      ]
    },
    {
      "id": "mp72ese",
      "author": "Thick_Reaction_9887",
      "body": "I think generally the same thing applies tbh. All professionals are human and humans have baises and the medical field for mh stuff is lacking a lot of the time.",
      "created_utc": 1745696004.0,
      "score": 1,
      "context": [
        {
          "id": "mop9n3m",
          "author": "Thick_Reaction_9887",
          "body": "Ppl dont forget, they just assume. There's no forgetting info you don't really know to begin with. Many people don't have a grasp on what an eating disorder really is or how it can manifest from person to person since we're all very different and the labels given for eds are very rigid. I have an ex who is older than me who had no idea what the word anorexia, let alone anything like arfid, bulimia, ednos, bed, ect. meant. Could not tell me a thing about eating disorders. \nTo summarize, people are often unaware of things unless it has or does directly impact them.",
          "created_utc": 1745452625.0
        },
        {
          "id": "mp4oo9w",
          "author": "zaddyh0e",
          "body": "Oh definitely. I specifically meant the frustration with “professionals” thinking eating disorders are linear but that’s my fault for not making it clear lol",
          "created_utc": 1745667065.0
        }
      ]
    }
  ]
}