{
  "id": "1k7o835",
  "subreddit": "AnorexiaNervosa",
  "author": "WarmHold4152",
  "created_utc": 1745596037.0,
  "title": "So fucking tired of the delicate little stereotype",
  "selftext": "Ana male here. Maybe this is because I'm part of the small percentage of males in the whole ana scene, but I get so pissed off whenever I see the little \"delicate little butterfly\" bs. Im not even talking about pros, I mean the actual retraction of anorexia anywhere that's always showing a delicate, cute, insecure precious little girl aching for perfection. All that on tones of light pink and with a Lana del something song playing in the background. I wish we would get over with the romantization thing and start showing the gross part of this all. No I do not feel like a pretty little flower for having ana,it's necessarily the other way around. and I bet most people agree with me. We should start treating and showing off ana the way it is; hell. No flowers, butterflies or delicate poems. It's gross. It's fucking disgusting and I don't think ppl see that enough. When will this start being treated like the sickness it is?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1k7o835/so_fucking_tired_of_the_delicate_little_stereotype/",
  "score": 120,
  "num_comments": 12,
  "comments": [
    {
      "id": "mozl389",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1745596038.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mozwdri",
      "author": "Novel-Property-2062",
      "body": "Hard agree. Get really exasperated with the “here’s my Sanrio character-themed diet I’m just a fragile cutey-patootie ingenue” type of romanticization",
      "created_utc": 1745599350.0,
      "score": 41,
      "context": []
    },
    {
      "id": "mozz6t6",
      "author": "merm4idgirl111",
      "body": "Yeah I hate this shit too. I think as time goes on it will slowly change - not much, but change will be there. I think people will always stay romanticizing it to some degree though, and those people tend to oversaturate the community (unfortunately). There's a reason why ignorant people call this a women's disease.\n\nJust up to more people to be able to open up and not be shameful to show the gross sides of it. Because clearly it's not all sunshine-stanley cup-lana del-ricecake. We need to de-saturate the community and show the truth more often. \n\n(Edit: and I'm not saying it's our fault that things are this way, just trying to say more people should make an effort to break the stereotypes.)",
      "created_utc": 1745600148.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mp150u3",
      "author": "nyctosys",
      "body": "so fucking glad someone said it!",
      "created_utc": 1745612522.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mp14edu",
      "author": "BasOutten",
      "body": "The delicate part is accurate, but it's accurate in a somewhat insulting way. Lot of walking on eggshells with ana people.",
      "created_utc": 1745612332.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mp66k71",
      "author": "SwungBurito",
      "body": "Totally agree. After “studying” others and my own experience, it’s not a lack of strength in Ana, but often an overabundance of strength plus an inability to control where to put it",
      "created_utc": 1745686083.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mpoodhw",
      "author": "reemyaple",
      "body": "I have so much to say but you hit the nail on the head . This needs to be more talked about . Its terrible that other eating disorders are seen as almost \"inferior \" or \"worse \" than ana ... its awful because some people feel they rather have ana than bed . Im so sorry but I had to say it .",
      "created_utc": 1745944599.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mpsf2t6",
      "author": "ArtistNew6200",
      "body": "Louder for the people in the back!!! Yes!",
      "created_utc": 1745988125.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mplh9lc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1745895247.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mprfgw4",
      "author": "HerElectronicHaze",
      "body": "I’m a woman and I agree!",
      "created_utc": 1745974645.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mptl9lk",
      "author": "WarmHold4152",
      "body": "YESSSSSSS GODDDD,I don't see why ppl be making an hierarchy of eating disorders",
      "created_utc": 1746012235.0,
      "score": 2,
      "context": [
        {
          "id": "mpoodhw",
          "author": "reemyaple",
          "body": "I have so much to say but you hit the nail on the head . This needs to be more talked about . Its terrible that other eating disorders are seen as almost \"inferior \" or \"worse \" than ana ... its awful because some people feel they rather have ana than bed . Im so sorry but I had to say it .",
          "created_utc": 1745944599.0
        }
      ]
    },
    {
      "id": "mpmiwue",
      "author": "WarmHold4152",
      "body": "Anorexia is oftenly pictured as \"soft, delicate, gentle and sweet\". It is not treated like the sickness it is, a lot of times. Even when it is, it's, very frequently, retracted in a romanticized way",
      "created_utc": 1745913967.0,
      "score": 1,
      "context": [
        {
          "id": "mplh9lc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1745895247.0
        }
      ]
    },
    {
      "id": "mpmlfk6",
      "author": "Educational_Debt6361",
      "body": "I’m not sure what you’re meaning now. I hear of people on their kitchen, room floors malnourished, trying to hide or food acting to their people like it’s been eaten, i haven’t noticed anyone much define or show the disease to be glamorous or dainty. Yeah though it isn’t treated farrr too often & that’s really sad",
      "created_utc": 1745915618.0,
      "score": 1,
      "context": [
        {
          "id": "mplh9lc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1745895247.0
        },
        {
          "id": "mpmiwue",
          "author": "WarmHold4152",
          "body": "Anorexia is oftenly pictured as \"soft, delicate, gentle and sweet\". It is not treated like the sickness it is, a lot of times. Even when it is, it's, very frequently, retracted in a romanticized way",
          "created_utc": 1745913967.0
        }
      ]
    }
  ]
}