{
  "id": "1kdjrhj",
  "subreddit": "AnorexiaNervosa",
  "author": "Ashamed_Ad8162",
  "created_utc": 1746243669.0,
  "title": "What’s your eating disorder hot take?",
  "selftext": "I’m not talking “people with AN still eat” or “harm reduction is complicated”, I mean your unhinged takes lol",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1kdjrhj/whats_your_eating_disorder_hot_take/",
  "score": 145,
  "num_comments": 229,
  "comments": [
    {
      "id": "mqbejgg",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1746243669.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqbkmmc",
      "author": "PinkMangoDolly",
      "body": "Sometimes I wonder if my Ed was even real. Nobody knew about it and even the ones that knew did nothing. I recovered on my own without anyone knowing. It’s quite weird as I was fighting this battle but no one knew or cared. Sometimes I feel like it’s for attention :/",
      "created_utc": 1746246465.0,
      "score": 303,
      "context": []
    },
    {
      "id": "mqbpa06",
      "author": "toritxtornado",
      "body": "i actually chose to have anorexia…i just didn’t know how bad it would get",
      "created_utc": 1746248831.0,
      "score": 200,
      "context": []
    },
    {
      "id": "mqccbic",
      "author": "Sevennolater",
      "body": "If you put your entire identity in “recovery” you will never truly be “recovered”.",
      "created_utc": 1746262575.0,
      "score": 88,
      "context": []
    },
    {
      "id": "mqbmr6e",
      "author": "DahjNotSoji",
      "body": "AN can make you wayyyyy more prone to lying.",
      "created_utc": 1746247528.0,
      "score": 155,
      "context": []
    },
    {
      "id": "mqczu0v",
      "author": "OrganicDoughnut5965",
      "body": "My hot take is if you’ve never had anorexia, you will never understand what goes on in an anorexic person’s head. Truly believe the only way to understand it is to go through it yourself 🤷🏼‍♀️",
      "created_utc": 1746275276.0,
      "score": 68,
      "context": []
    },
    {
      "id": "mqbm0c8",
      "author": "kizzletizzleizzle",
      "body": "mine is i miss my eating disorder self a lot but i know i shouldn’t",
      "created_utc": 1746247150.0,
      "score": 120,
      "context": []
    },
    {
      "id": "mqbtaf7",
      "author": "Deepspacechris",
      "body": "I like how my AN makes me focus less on  some of the other bad things in my life.",
      "created_utc": 1746251011.0,
      "score": 114,
      "context": []
    },
    {
      "id": "mqbuv6v",
      "author": "BallAffectionate4000",
      "body": "Now that I’m recovered and overweight, I miss being anorexic. Even though back then I was miserable and suicidal, I still have that ‘ana voice’ telling me I’d be happier if I was skinny again.",
      "created_utc": 1746251905.0,
      "score": 100,
      "context": []
    },
    {
      "id": "mqc2010",
      "author": "Queenofwands1212",
      "body": "When I look at other women’s bodies who are normal BMI and not underweight, I think they look great and lovely. But when I was a healthy bmi I felt absolutely disgusting and couldn’t handle it. My sensory issues went insane, my physical and mental discomfort made me unable to function in a normal bmi body. So it’s like I accept bodies of all kinds but for me, I don’t look right or feel good when I’m a normal weight so I basically just have to stay underweight in order to feel sane. When I was chubby and healthy bmi I had panic attacks and nervous breakdowns and self harmed and I was in a worse state of mind even though I looked healthier",
      "created_utc": 1746256108.0,
      "score": 94,
      "context": []
    },
    {
      "id": "mqcv4on",
      "author": "Shoddy-Worry9131",
      "body": "People get mad at you for having it.",
      "created_utc": 1746273216.0,
      "score": 45,
      "context": []
    },
    {
      "id": "mqdf0a0",
      "author": "throwawayfishplanet",
      "body": "as someone who has both, i’d rather have ana than BED any day of the week",
      "created_utc": 1746280981.0,
      "score": 46,
      "context": []
    },
    {
      "id": "mqbowx1",
      "author": "Stunning-Check2275",
      "body": "I’m pro Ana for me but not others.",
      "created_utc": 1746248641.0,
      "score": 193,
      "context": []
    },
    {
      "id": "mqdq385",
      "author": "ifakuta",
      "body": "choosing a career in nutrition is a slippery slope, even if you’re recovered",
      "created_utc": 1746284582.0,
      "score": 35,
      "context": []
    },
    {
      "id": "mqbmk5f",
      "author": "Klutzy_Hunter_354",
      "body": "anorexia doesn’t “make” you fatten up the people around you or intentionally sabotage others in any way. if you do that you’re just a jerk who happens to be anorexic.",
      "created_utc": 1746247428.0,
      "score": 160,
      "context": []
    },
    {
      "id": "mqcmjz5",
      "author": "jcb300012",
      "body": "people don't mention the other side-effects. you don't just get skinny and underweight, you don't just become weak. you can die, your heart can literally just stop. your organs can give up. so many other things can happen, it should be talked about more",
      "created_utc": 1746268905.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mqc4t45",
      "author": "lisa6547",
      "body": "Don't swallow any toothbrushes while purging. It will rupture your intestines and you WILL DIE OF SEPSIS\n\nyes, I have done this twice in a row in a matter of two weeks \n\nThe doctors and nurses just looked at me when I went to the ER for surgery again, and said....oh you're back here again?? 🤨🤨",
      "created_utc": 1746257842.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mqds7lw",
      "author": "starving_artist02",
      "body": "I dont think anyone who has a recovery account is really recovered since its quite obvthey still can't let go of their disorder\n\nAnd i dont think its a good idea at all for people who recovered to study nutrition like its not safe for yourself and fir the patients you have",
      "created_utc": 1746285255.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mqbkxye",
      "author": "helianthus_0",
      "body": "Not sure how hot this is but males should have separate ED treatment facilities. From what I’ve read, so many males are uncomfortable in treatment centers because they’re often the only male, the other clients are talking about things like their periods (or lack thereof), or other clients are talking about distrusting men due to past trauma. Males also tend to experience EDs differently, such as wanting to bulk up instead of slim down. Also, so many treatment centers are geared towards females with female-focused language, programming, etc. \n\nNot particularly hot but we need non-profit treatment centers and treatment centers that cater to people on the autism spectrum",
      "created_utc": 1746246620.0,
      "score": 91,
      "context": []
    },
    {
      "id": "mqeyfq6",
      "author": "ElliatDawn",
      "body": "Ana and Orthorexia are different sides of the same coin",
      "created_utc": 1746298307.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mqbkjq8",
      "author": "-aquapixie-",
      "body": "Ooh I got a spicy one.\n\nWe're all secretly ProAna when it comes to ourselves. We've all used thinspo, tips and tricks, mantras, buzzwords, as a method of reinforcing the eating disorder behaviours within ourselves. (And strengthening its control.)\n\nEven if we publicly condemn actions within the community, all of us have at least once in our life, used a thinspo pic or a mantra or a trick we read off the internet. All of which is inherently ProAna, whether it's labelled that or not.",
      "created_utc": 1746246426.0,
      "score": 90,
      "context": []
    },
    {
      "id": "mqcaw0e",
      "author": "anonhumanontheweb",
      "body": "My hottest take is that before ED treatment, I didn’t have an eating disorder, and my disorder developed in treatment. I was *diagnosed* prior to treatment, but it was based on a five-minute conversation with a psychiatrist, and I said some things in that conversation that were wildly inaccurate looking back (I vastly underestimated how many calories I was consuming because… um… I didn’t count calories back then). I also had terrible body image, so I think he relied on that. But I didn’t bc, didn’t bother myself weighing, didn’t count calories, didn’t have ANY fear foods.\n\nThe Dr. sent me to treatment based on my weight (which was very low but stable — I was maintaining), and my first time in treatment, the ED thoughts ramped up, and I started engaging in a lot more of the stereotypical behaviors. So yeah, my disordered eating started a decade ago, but my full ED began 6 years ago.",
      "created_utc": 1746261669.0,
      "score": 35,
      "context": []
    },
    {
      "id": "mqcu98h",
      "author": "fajdu",
      "body": "You're recovery is not everyone else's recovery",
      "created_utc": 1746272811.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mqfw899",
      "author": "Nia_KR",
      "body": "I don’t think anybody recovers from an ed in the sense that it goes away for good. if you develop an ed you have an ed forever, you can get better and the thoughts can become significantly quieter or even go away completely (until something triggers it again), but you’re never not anorexic anymore, because it’s a mental illness. just like you can’t fully “recover” from bipolar or depression or any other mental illness, you just get better at dealing with it. and that’s ok",
      "created_utc": 1746309577.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mqdn0p4",
      "author": "fireflower0",
      "body": "I learned how to lie and it never went away",
      "created_utc": 1746283608.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mqf81kj",
      "author": "slynne28",
      "body": "Recovery means you actually have to deal with all the other crap, anger and trauma the eating disorder masked. At least in a day with AN, I knew what I had to focus on.",
      "created_utc": 1746301486.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mqexp1g",
      "author": "soda-pops",
      "body": "that you should never assume a skinny person is anorexic if you wouldnt assume a fat person is. I have a friend who is *tiny* and got accused of AN by a school counselor, who would have never accused me of it because I was and am still very overweight (like, medically, it sucks and my joints hurt)",
      "created_utc": 1746298067.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mqde8zk",
      "author": "turnipkitty112",
      "body": "It’s ok for people to not want to recover, not pursue recovery, and actively choose to remain sick. People shouldn’t be forced into treatment, assuming they have the most basic decision making capacity. Choosing to remain sick isn’t a bad or wrong choice, even if that choice is a direct result of the ED itself. \n\nOf course I want recovery for everyone (except maybe myself lol) and that would be the ideal scenario but some ppl aren’t capable of it at the moment, aren’t ready, or don’t want to and *that’s fine*. Professionals refusing to work with someone who isn’t willing to recover/go to a higher level of care/sign a contract is unethical and causes more harm. Threatening people into recovery doesn’t work. \n\nNo one wants to admit it, but oftentimes the ED is serving a function and, as a coping strategy or protective thing, it WORKS. There are downsides, yes, but forcing someone to give up ED behaviours that may be keeping them safe in other ways is cruel. Virtually everyone has harmful and negative coping mechanisms, whether that is alcohol/substances, relationship issues, overeating, isolation, overworking, self harm, whatever. No one coerces them into giving those things up or tells them they’re just delusional and incapable of making decisions… until it’s a restrictive ED.",
      "created_utc": 1746280723.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mqe3mtn",
      "author": "kewife",
      "body": "Everybody is responsible for keeping their ED (esp restrictive ones) away from online spaces with children. Yes EDs can make you do horrible stuff, but at the end of the day, if you’re making the choice to post threads on twitter about fasting tips, you’re taking the risk that a minor is probably going to see that, and that is insanely selfish. I wish more adults were held accountable for shit like that.",
      "created_utc": 1746288829.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mqe958c",
      "author": "Skythebluestars",
      "body": "Sometimes its more complex then treatment and starting recovery. People forget alot of people with an ED have comorbidity.. ed is a coping mechanism. \n\nMy hot take is : sometimes its safer to use your ed as coping mechanism then other harmful coping mechanisms. I dont say its the right coping. I say its safer.",
      "created_utc": 1746290571.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mqdqeak",
      "author": "chk-mcnugget",
      "body": "I’m only slightly underweight so I tell myself mine isn’t even that bad and people have survived worse. (I know that’s not how it works)",
      "created_utc": 1746284680.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mqfbvkz",
      "author": "humancoloringbook923",
      "body": "I feel like I can't identify as having an ED because I started this intensionally when I was seriously overweight. Then I got to a healthy weight and couldn't stop... but it started on purpose. I feel stupid and shameful and like I did this to myself so I shouldn't get the ability to claim it as a \"disorder\".",
      "created_utc": 1746302763.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mqfpaxe",
      "author": "Fluttery_Soul",
      "body": "Dont cancel me guys\n\n\nMy hot take is that being anorexic and slowly dying is better than committing s*icide. Not better for the anorexic person ofc lol but better for their family bc they should be grateful that the person is even still alive",
      "created_utc": 1746307167.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mqbjqf7",
      "author": "Thick_Reaction_9887",
      "body": "This generally applies to the majority of mental health issues and disorders but I firmly attest to the belief that eds are heavily misunderstood and the categories are really rigid and outdated. The diagnosis criteria is incredible invalidating for the majority of people with genuine eds and there are way too many factors playing into an individuals life that lead them to not falling into that very specific criteria. The majority of people, for example, with anorexia, fall into the \"atypical\" category specifically because of their bmi even though most doctors acknowledge that bmi is fucking arbitrary and health issues as a result from eds happen at ALL weights/bmi categories. \nI understand why these criteria were made, but eds are much too prevalent to invalidate a person who definitely has issues when these disorders often feed off of not feeling sick enough. It's a hell of a lot easier to prevent things from getting worse and validate each other for our struggles as they are than it is to keep seeing people suffer and give each other imposter's syndrome.",
      "created_utc": 1746246025.0,
      "score": 31,
      "context": []
    },
    {
      "id": "mqbumua",
      "author": "FiannaNevra",
      "body": "I loved the pro Ana and Mia forums online",
      "created_utc": 1746251774.0,
      "score": 33,
      "context": []
    },
    {
      "id": "mqgef5u",
      "author": "Moe656",
      "body": "It's a keeper.",
      "created_utc": 1746316301.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mqfdbic",
      "author": "goregoregirls",
      "body": "my ED turned me into a bad person towards my family, friends etc.",
      "created_utc": 1746303244.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mqohc6p",
      "author": "texturedgirl",
      "body": "i learned ed behaviours in treatment. i was just vibing.",
      "created_utc": 1746437591.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mqdrodr",
      "author": "invader-wyn",
      "body": "i recovered by telling myself i’ll never have a fat jiggly ass if i’m starving myself over and over again until i started gaining my weight back",
      "created_utc": 1746285087.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mqfq0jp",
      "author": "Fluttery_Soul",
      "body": "I'm sorry but I don't miss those ungodly period cramps or heavy bleeds",
      "created_utc": 1746307407.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mqivtng",
      "author": "TheseFreedom6691",
      "body": "I have quite a few lmao.\n\n1. People who aren't diagnosed tend to misdiagnose themselves 99% of the time due to the fact that alot of these people think Ed's are either Ana or mia. Ednos is probably wayyy more common amongst the ed community but no one would ever know that because people think they either have mia or Ana only.\n\n2. I keep seeing people who binge without purging claim they are bulimic. That's just wrong.\n\n3. Some people don't have eating disorders, they just wanna lose weight quick. Skipping breakfast and reducing caloric intake does NOT make you disordered.\n\n4. I've seen too many overweight/obese people claim that they are anorexic, and that literally makes me laugh every single time. A literal criterion for Ana diagnosis is to be underweight, which these people are not. They think starving for a day makes them anorexic, and that pisses me tf off.\n\n5. Anyone who claims they average over 100 000 steps a day is lying and they're rigging the system. Unless they literally eat as many calories as they burn off, there is no chance they are able to consistently hit 100k steps.\n\n6. Liars are the worst thing to happen to the ed community. All people are trying to do nowadays is one up everyone so they appear more disordered or sick, and it's so harmful. Some of these lies are actually getting out of hand, because tell me why I keep seeing people claim they lost 5kgs in 3 days? people claim they walked 120k steps in a day? people claim they hit bmi 8? people claim they have fasted for over 96 hours without any caloric intake? Lmfao, I saw some claim they dry fasted for a month🤦‍♀️ it's embarrasing and harmful, and all it does is make people try and obtain some crazy standard of illness which is literally not humanly possible.\n\n7. If you make you're entire personality and lifestyle centre around recovery, then you are not truly recovered.\n\n8. People have no idea what body dysmorphia is anymore and they just fake it for attention. People keep posting body checks of their toothpick arms and call themselves fat. People post themselves wrapping their hand around their thigh and asking people if they look like a hippo. I've seen countless girl post body checks of themselves while inpatient and asking if they look like a beluga whale, knowing damn well they don't. It's super harmful and just attention seeking. How do I know this? Because I genuinely have body dysmorphia and even thinking about posting a single picture of myself for the whole internet to scrutinize makes my skin crawl and causes me nausea. \n\n9. Some folks on edtwt are insufferable. They make tweets saying \"I just saw someone with bmi 50\"🤦‍♀️🤦‍♀️ pls dpmo. They act as if overweight people or people with BED aren't really disordered and they do t take them seriously enough. It's so strange seeing people act surprised at bmi 60 when we have seen people with bmi 7. Coming from an anorexic, if I were to ever post on twt as someone with BED, id probably have suicidal tendencies because of the way people treat people with BED. WE ARE ALL DISORDERED\n\nI think that's all for now. I know this is super long, but I've seen too many thing that js make my blood boil yet I don't see anyone talk about it. I know ive generalized alot of things, so feel free to correct me or share your own opinions on the things I've said.",
      "created_utc": 1746360789.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mqlflyc",
      "author": "Anxious_Lake_5566",
      "body": "I see a lot of these aren’t hot takes. Here is a really flammable take: I have not met an anorexic without discipline. It takes discipline to be anorexic. \n\nI also doubt that you ever fully really recover without that little voice in your head that would for example be happy after noticing collar bones that appeared after a long stomach bug or something. \n\nI never fell deep in the pits of an eating disorder I think partly because I am naturally thin, but I also never swam really to the shore - I could not enjoy either of my pregnancies because I saw myself as disfigured. I wish more people mentioned what a trigger pregnancy is.",
      "created_utc": 1746390582.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mqmo4rd",
      "author": "andstaleperfume",
      "body": "i always feel like people care a lot less about your disorder when you’re an adult. it sucks.",
      "created_utc": 1746405679.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mqqaiuc",
      "author": "Initial-Froyo-9661",
      "body": "I don’t think I’m capable of recovering fully. I know other people say they have but I think the thoughts will never go away even if I never restrict again.",
      "created_utc": 1746462126.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mqu6vvf",
      "author": "phoebe_bridgers_4evr",
      "body": "i used starvation as a method of sh more than i did in order to 'get skinny'",
      "created_utc": 1746509055.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mqel9l1",
      "author": "PsychoKatzee",
      "body": "1. **EDs are very fucking competitive.**   \nYou see a random skinny person, and your brain instantly clicks. \"Do they have and ed?? They surely do. They must be better at it than me. Or if they don't? Are they just naturally skinny??\" You'll be jealous. You stare. \n\n2. **Your brain is rewired**.   \nOutsiders can't understand, how it feels like when your brain rewards you for literally slowly killing it. Things that damage you fill you with feeling of success. You watch yourself deteriorate. Things that give other people pleasure fill you with guilt. Numbers become the only thing you really care about. Measurements. Eating becomes a drag. \n\n3. **It's fucking isolating.**   \nThe deeper you get, the bigger the part of your life you can't talk about gets. You begin avoiding every occasion that potentially involves calories, cause it gives you anxiety. You are terrified of being discovered, so after a while you just don't go. They either notice, so you begin lying, or you just don't go anymore. You will get lonelier, and I believe that is the most horrible part, and why it's so dangerous. You lose pleasure. \n\n**4. You think you're in control, but you aren't.**  \nYou might see extreme bonespo and think you won't get that far, you can stop any time. Thing is, it's a **behavioral addiction.** You might begin bargaining with it, but eventually gonna slip. Seeing that kind of stuff slowly becomes a secret goal you might not even admit to yourself. \n\n**5. They will notice eventually**\n\nEven if you are the best liar on earth, your body WILL change. and after a while you can't deny it. You either admit to yourself and others, or blatantly continue to lie, while everyone knows. You can wear baggy clothes, blame it on anything, but I talk from experience. Your fingers, your face, your wrist... they will notice.",
      "created_utc": 1746294228.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mqfj10z",
      "author": "TroubledGirl_",
      "body": "My own hot take.... my Anorexia cured my AFRID and kept me from cutting myself",
      "created_utc": 1746305097.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mqgcgt9",
      "author": "gaymofo666",
      "body": "I put myself (and my mom) there intentionally without realising how bad the side effects are. Bad teeth, sepsis, surgeries just so I ended up gaining weight extremely quickly and easily after I stopped. I feel ugly now, but at least I don't live to hurt my body anymore",
      "created_utc": 1746315576.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqggplz",
      "author": "Acedia_spark",
      "body": "That old Tumblr is responsible for a lot of pro disguised as fashion content and I'm forever greatful that it got mostly squashed because that's where I picked up quite a lot of habits I now fall back on when I'm stressed.",
      "created_utc": 1746317165.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mqhuo4h",
      "author": "Icy_Journalist5931",
      "body": "literally anyone but me can be fat. im the only fat person on the fuckin planet according to my brain",
      "created_utc": 1746339207.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mqhvc50",
      "author": "Proper_Salamander_84",
      "body": "That my ED is fear of pain from food. If I don’t eat, it doesn’t hurt… but then, recovery hurts. \nIt’s such a double dagger.",
      "created_utc": 1746339588.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mql8d94",
      "author": "Infamous-Context-995",
      "body": "More men have it then are willing to admit",
      "created_utc": 1746388320.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqtp338",
      "author": "calicobunny333",
      "body": "Edtwt is fucking cancer and worse than any of the pro-ana sites in the 2000s. ",
      "created_utc": 1746500999.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mqvvrgy",
      "author": "xX_EthanKitKat_Xx",
      "body": "people treat those with anorexia badly because they’re jealous that we’re able to lose weight quickly and they project their insecurities about their inability to control their weight onto us \n\nbut what they fail to realise is that it’s not a lifestyle or a diet, it’s a mental illness, and weight loss is at the tip of iceberg when it comes to this illness but because society is obsessed with being thin they only fixate on that\n\nthey don’t understand or realise that there’s many other symptoms which are terrifying and could kill you or traumatise you.",
      "created_utc": 1746539807.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mqd620x",
      "author": "BasOutten",
      "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
      "created_utc": 1746277775.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mr59pr6",
      "author": "Thin_Statistician826",
      "body": "as much as i struggle w my ed, it shouldn’t be promoted in mainstream culture ",
      "created_utc": 1746656396.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqbp1v5",
      "author": "Bubbly_Midnightt",
      "body": "You listen to the real you, your true self once you choose recovery. The ED is a demon speaking lies and attempting to take over your life & ruin everything.",
      "created_utc": 1746248712.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mqf6ewe",
      "author": "reddit_user_474747",
      "body": "Having anorexia for 10 years has made me extremely fatphobic. I have extremely mean thoughts about others’ bodies. My many years of therapy have taught me that it’s just a reflection of my own bodily self-hatred.",
      "created_utc": 1746300940.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mqi18o9",
      "author": "fornow_foralways",
      "body": "sometimes when i see very skinny people i think “well i’ve seen skinnier” and that’s bc ive been unfortunate very pro ana for the last 16 years. oh and the actually aesthetic of anorexia is so beautiful when you dont see the negative side effects.",
      "created_utc": 1746343072.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mqil6wq",
      "author": "mouse-bites",
      "body": "I purposely trigger myself all the time. \n\nI think we are all fatphobic but most people are too afraid to admit it. I know I am. It’s just how it is, but obviously I keep those thoughts to myself and would never treat someone differently for their size.\n\nMy “ugw” is death and my hope is to die from this soon.",
      "created_utc": 1746355401.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqytvu9",
      "author": "Technical_Goat_8473",
      "body": "Most \"recovery\" accounts I've seen are not about recovery",
      "created_utc": 1746570620.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mr7qq2e",
      "author": "ameliaa_1147",
      "body": "i feel like theres something insanely wrong and fucked up in how people with an ed are vieved by society. The anger, the disrespect and hatred is like towards no other mental disorder",
      "created_utc": 1746695089.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mr7qyve",
      "author": "ameliaa_1147",
      "body": "also i dont believe you can recover fully and forever, you have to constantly watch your behaviour and take botice of your triggers in day to day life for the rest of it",
      "created_utc": 1746695248.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mqfpno4",
      "author": "Fluttery_Soul",
      "body": "I am healthier now than before my ED",
      "created_utc": 1746307286.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mqfw9zd",
      "author": "pearlslawyer",
      "body": "Unlike (I think) most of EDs, mine's not center on weight loss but slowing killing myself in front of my family. They can't make sure or talk about it, and they raised me to never open up emotionally, so now they can not bond with me and can only watch me slowly die from it.",
      "created_utc": 1746309595.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqbimqd",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1746245499.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mqcirhr",
      "author": "anastasia_42",
      "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
      "created_utc": 1746266683.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mqjwpjd",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1746373679.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mrdukl5",
      "author": "anabanana_0",
      "body": "I feel like I’m just pretending to be scared of weight gain and can quit easily yet I keep feeling the need to lose weight",
      "created_utc": 1746776712.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqe8e8x",
      "author": "Smelly_CatFood",
      "body": "Having a terrible diet and being obese is not the same as having an eating disorder imo",
      "created_utc": 1746290334.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mqbqc5z",
      "author": "ema_merc",
      "body": "It takes incredible strength to recover without any support ❤️ your experience is real regardless of who knew about it",
      "created_utc": 1746249397.0,
      "score": 55,
      "context": [
        {
          "id": "mqbkmmc",
          "author": "PinkMangoDolly",
          "body": "Sometimes I wonder if my Ed was even real. Nobody knew about it and even the ones that knew did nothing. I recovered on my own without anyone knowing. It’s quite weird as I was fighting this battle but no one knew or cared. Sometimes I feel like it’s for attention :/",
          "created_utc": 1746246465.0
        }
      ]
    },
    {
      "id": "mqc127r",
      "author": "Itscatpicstime",
      "body": "Well if you let so few people know, it clearly wasn’t for attention.\n\nBut even if it was - that still indicates something psychologically wrong and harmful going on that would be equally in need of treatment.",
      "created_utc": 1746255548.0,
      "score": 39,
      "context": [
        {
          "id": "mqbkmmc",
          "author": "PinkMangoDolly",
          "body": "Sometimes I wonder if my Ed was even real. Nobody knew about it and even the ones that knew did nothing. I recovered on my own without anyone knowing. It’s quite weird as I was fighting this battle but no one knew or cared. Sometimes I feel like it’s for attention :/",
          "created_utc": 1746246465.0
        }
      ]
    },
    {
      "id": "mqcm4gq",
      "author": "Ashamed_Mine",
      "body": "This is how it was for me, no one close made a comment or even asked if I was okay at the weight I was. I didn't even really think about having an ED, until I started dating my boyfriend and he made comments, he asked, someone who I only knew for a month, compared to people who known me for decades. I still sometimes question if I was really that bad just because of the complete silence or disinterest others had around me.",
      "created_utc": 1746268664.0,
      "score": 13,
      "context": [
        {
          "id": "mqbkmmc",
          "author": "PinkMangoDolly",
          "body": "Sometimes I wonder if my Ed was even real. Nobody knew about it and even the ones that knew did nothing. I recovered on my own without anyone knowing. It’s quite weird as I was fighting this battle but no one knew or cared. Sometimes I feel like it’s for attention :/",
          "created_utc": 1746246465.0
        }
      ]
    },
    {
      "id": "mqfuthw",
      "author": "Nia_KR",
      "body": "Wow. I don’t think you quite understand just how incredibly strong you are for doing that??? If I had zero support I don’t think I wouldve ever even considered recovery. you’re actually amazing dude",
      "created_utc": 1746309078.0,
      "score": 3,
      "context": [
        {
          "id": "mqbkmmc",
          "author": "PinkMangoDolly",
          "body": "Sometimes I wonder if my Ed was even real. Nobody knew about it and even the ones that knew did nothing. I recovered on my own without anyone knowing. It’s quite weird as I was fighting this battle but no one knew or cared. Sometimes I feel like it’s for attention :/",
          "created_utc": 1746246465.0
        }
      ]
    },
    {
      "id": "mqn7z1x",
      "author": "rleaff1",
      "body": "That's been pretty much word-for-word my experience too. For me, it took my organs actually starting to fail for it to finally click for me that this might actually, in fact, be severe anorexia, not just occasionally \"weird with food.\" I had a... bad medical event, alone, but survived just fine without intervention by pure dumb luck. But in the time after that, I was still constantly convinced I was dying, imminently, at all times, every single time my fucked-up body did anything even remotely fucked-up.\n\nWhich was (and still is) pretty often. So now that I've been scared off by almost dying alone in the bathroom from this goddamn illness, I've been forced to acknowledge it and realize how bad I've become. Because of the constant denial of my eating disorder, both from myself and the world, it only burrowed deeper and deeper into my perception of normal. I got worse and worse for years and years without even realizing. I genuinely thought I was perfectly healthy and functional, all things considered.\n\nIt's weird seeing the past with so much unpleasant clarity... recovering enough to make my brain work again probably helps. Starting a mood stabilizer that actually works on me has probably been a factor too. But I can't just \"recover\" as if it's a virus or something that will leave permanently. I can't unwire the thought patterns. I already feel like I was exaggerating or being dramatic back then, or that I measured wrong, or I wasn't actually in danger, etc etc etc. If I don't replace it with another coping mechanism soon, I'm gonna instinctively go right back to trying to control my life through my body. Which is the cycle of the disorder controlling me, ironically. \n\nMy perception  of myself and my past is distorted, which is part of the eating disorder, and I know that, but my mind still takes it all in before I can catch it. The absolute lack of other witnesses means all I have as a record is my own memory and some photos. It's so hard to know what's real. It's so hard to get help when your disorder is extremely private and intentionally hidden.\n\nThis has gotten longer than I meant for it to be. I'm not trying to write a whole personal narrative, lol. All this just to say: I'm relieved it's not just me, and I'm so sorry you've had to go through this shit alone. Wishing you well",
      "created_utc": 1746413016.0,
      "score": 1,
      "context": [
        {
          "id": "mqbkmmc",
          "author": "PinkMangoDolly",
          "body": "Sometimes I wonder if my Ed was even real. Nobody knew about it and even the ones that knew did nothing. I recovered on my own without anyone knowing. It’s quite weird as I was fighting this battle but no one knew or cared. Sometimes I feel like it’s for attention :/",
          "created_utc": 1746246465.0
        }
      ]
    },
    {
      "id": "mqng2bg",
      "author": "patyruiva",
      "body": "Of course! Well, if you felt it, you knew it! I have been living with depression since I was 7 years old. I've been in another crisis for almost 4 years, but this time I've managed with GREAT difficulty to do my obligations and I haven't tried to “unlive” (in the last crisis I tried several times).\n\nLast month I decided to leave therapy, I felt that I was no longer progressing and honestly I have felt like being more silent in mine. Besides, the value increased a lot…\n\nBut I intend to look for another one… once you have depression, you will always be dealing with it, sometimes it comes and goes",
      "created_utc": 1746416235.0,
      "score": 1,
      "context": [
        {
          "id": "mqbkmmc",
          "author": "PinkMangoDolly",
          "body": "Sometimes I wonder if my Ed was even real. Nobody knew about it and even the ones that knew did nothing. I recovered on my own without anyone knowing. It’s quite weird as I was fighting this battle but no one knew or cared. Sometimes I feel like it’s for attention :/",
          "created_utc": 1746246465.0
        }
      ]
    },
    {
      "id": "mqs8mox",
      "author": "southern_maam",
      "body": "Literally me.",
      "created_utc": 1746482836.0,
      "score": 1,
      "context": [
        {
          "id": "mqbkmmc",
          "author": "PinkMangoDolly",
          "body": "Sometimes I wonder if my Ed was even real. Nobody knew about it and even the ones that knew did nothing. I recovered on my own without anyone knowing. It’s quite weird as I was fighting this battle but no one knew or cared. Sometimes I feel like it’s for attention :/",
          "created_utc": 1746246465.0
        }
      ]
    },
    {
      "id": "mqc8hfk",
      "author": "Far-Lavishness-6519",
      "body": "This. I knew i was falling into that hole, yet dind't study any side effects yet. Because those \"your hair will fall out\" comments obviously dind't help. People should warn about the extreme side effects more to prevent this from happening",
      "created_utc": 1746260129.0,
      "score": 61,
      "context": [
        {
          "id": "mqbpa06",
          "author": "toritxtornado",
          "body": "i actually chose to have anorexia…i just didn’t know how bad it would get",
          "created_utc": 1746248831.0
        }
      ]
    },
    {
      "id": "mqe9zqu",
      "author": "Culvertfun",
      "body": "This was my recent experience with my relapse. I almost felt good that it was happening. Makes me feel crazy sometimes.",
      "created_utc": 1746290836.0,
      "score": 17,
      "context": [
        {
          "id": "mqbpa06",
          "author": "toritxtornado",
          "body": "i actually chose to have anorexia…i just didn’t know how bad it would get",
          "created_utc": 1746248831.0
        }
      ]
    },
    {
      "id": "mqg427k",
      "author": "SquareWalk6730",
      "body": "Sadly, a majority chose the disorder in an effort to be thin. \n\nI'm 31, but when I was like 10-11, I watched a documentary on YouTube about children with anorexia. Then binge watched a few more documentries on anorexia. That was the day I attempted restricting for the first time. (Also, holy crap it's hard to believe YouTube has been around that long.)",
      "created_utc": 1746312463.0,
      "score": 13,
      "context": [
        {
          "id": "mqbpa06",
          "author": "toritxtornado",
          "body": "i actually chose to have anorexia…i just didn’t know how bad it would get",
          "created_utc": 1746248831.0
        }
      ]
    },
    {
      "id": "mrkbro8",
      "author": "Better-Example6786",
      "body": "i would dare say most of the people i know with restrictive eating disorders purposefully developed them (mostly at preteen ages)... it's definitely rly taboo to say and once you've properly had a severe ED for awhile it becomes a pretty irrelevant fact but it def is a prominent thing in many ppl. people who at a point \"chose\" to develop EDs have had horrific complications and died and desperately wanted to recover but struggled immensely in it. it definitely doesn't invalidate after a certain point.",
      "created_utc": 1746870467.0,
      "score": 3,
      "context": [
        {
          "id": "mqbpa06",
          "author": "toritxtornado",
          "body": "i actually chose to have anorexia…i just didn’t know how bad it would get",
          "created_utc": 1746248831.0
        }
      ]
    },
    {
      "id": "mqer5vl",
      "author": "Punk_Boi4737",
      "body": "that's why I don't like the idea of recovery accounts",
      "created_utc": 1746295995.0,
      "score": 19,
      "context": [
        {
          "id": "mqccbic",
          "author": "Sevennolater",
          "body": "If you put your entire identity in “recovery” you will never truly be “recovered”.",
          "created_utc": 1746262575.0
        }
      ]
    },
    {
      "id": "mqgp5c7",
      "author": "Upstairs_Cost_3975",
      "body": "This! It’s more about remission. Personally in a good phase with my ED now. Getting all nutrients, eating several meals a day, not freaking out or obsessing much about food at all. Still slighty aware of my weight and appearance, but as long as I feel stable and in control (yes this is possible!!!!!) and I maintain my weight (still a bit underweight, but not unhealthy or problematic medically speaking,) I manage very well and have been for four years! So this is what we should all aim for. There is hope and possibility of betterment. Might I sometime fall back into sickness? Sure, it’s possible if something stressful happens in my life. I think it will always be a part of me, hiding in the back of my brain. But what’s the point in worrying about that now? My ED is fine and it feels wonderfully relieving right now.",
      "created_utc": 1746320444.0,
      "score": 12,
      "context": [
        {
          "id": "mqccbic",
          "author": "Sevennolater",
          "body": "If you put your entire identity in “recovery” you will never truly be “recovered”.",
          "created_utc": 1746262575.0
        }
      ]
    },
    {
      "id": "mqdir4o",
      "author": "apollocabin1345",
      "body": "This. A hundred percent. Before I developed my eating disorder I feel like it was a bit difficult for me to lie and a rarely did it. But now I do it often",
      "created_utc": 1746282228.0,
      "score": 24,
      "context": [
        {
          "id": "mqbmr6e",
          "author": "DahjNotSoji",
          "body": "AN can make you wayyyyy more prone to lying.",
          "created_utc": 1746247528.0
        }
      ]
    },
    {
      "id": "n4gqkrd",
      "author": "cupcake_918",
      "body": "Wait I thought this was obv 😭 lmao but true",
      "created_utc": 1753155481.0,
      "score": 1,
      "context": [
        {
          "id": "mqbmr6e",
          "author": "DahjNotSoji",
          "body": "AN can make you wayyyyy more prone to lying.",
          "created_utc": 1746247528.0
        }
      ]
    },
    {
      "id": "mqkqdd0",
      "author": "StummyAcheSurvivor",
      "body": "I say this to my mom. AN really is a, “you don’t get it unless if you’ve been there”. It’s like your whole world shifts",
      "created_utc": 1746382671.0,
      "score": 4,
      "context": [
        {
          "id": "mqczu0v",
          "author": "OrganicDoughnut5965",
          "body": "My hot take is if you’ve never had anorexia, you will never understand what goes on in an anorexic person’s head. Truly believe the only way to understand it is to go through it yourself 🤷🏼‍♀️",
          "created_utc": 1746275276.0
        }
      ]
    },
    {
      "id": "mqthfak",
      "author": "Important-Media1349",
      "body": "I’ve been in recovery for 2 years with only 2 brief relapses both caused by Snapchat flashbacks from 2-3 years ago. I’ve started to remember the bad more than the good which has prevented it since I feel",
      "created_utc": 1746498102.0,
      "score": 2,
      "context": [
        {
          "id": "mqbm0c8",
          "author": "kizzletizzleizzle",
          "body": "mine is i miss my eating disorder self a lot but i know i shouldn’t",
          "created_utc": 1746247150.0
        }
      ]
    },
    {
      "id": "mqgpnxy",
      "author": "db_anon8452",
      "body": "To me this is 70% the point of an ED, the other 30% is being thin.",
      "created_utc": 1746320644.0,
      "score": 15,
      "context": [
        {
          "id": "mqbtaf7",
          "author": "Deepspacechris",
          "body": "I like how my AN makes me focus less on  some of the other bad things in my life.",
          "created_utc": 1746251011.0
        }
      ]
    },
    {
      "id": "mqeaxid",
      "author": "Culvertfun",
      "body": "I felt or feel the same way. I'm at the beginning of a relapse, and that voice is telling me, \"Yes, I can do it again. I can be skinny.\" It feels safe, and I feel in control when my AN is active.",
      "created_utc": 1746291125.0,
      "score": 21,
      "context": [
        {
          "id": "mqbuv6v",
          "author": "BallAffectionate4000",
          "body": "Now that I’m recovered and overweight, I miss being anorexic. Even though back then I was miserable and suicidal, I still have that ‘ana voice’ telling me I’d be happier if I was skinny again.",
          "created_utc": 1746251905.0
        }
      ]
    },
    {
      "id": "mqc8kzr",
      "author": "Far-Lavishness-6519",
      "body": "This is my only reason i don't try to recover sigh 😞",
      "created_utc": 1746260190.0,
      "score": 12,
      "context": [
        {
          "id": "mqbuv6v",
          "author": "BallAffectionate4000",
          "body": "Now that I’m recovered and overweight, I miss being anorexic. Even though back then I was miserable and suicidal, I still have that ‘ana voice’ telling me I’d be happier if I was skinny again.",
          "created_utc": 1746251905.0
        }
      ]
    },
    {
      "id": "mqhl0zp",
      "author": "evaninthecloset_",
      "body": "me too, i hope it gets better and that voice goes dormant",
      "created_utc": 1746334008.0,
      "score": 3,
      "context": [
        {
          "id": "mqbuv6v",
          "author": "BallAffectionate4000",
          "body": "Now that I’m recovered and overweight, I miss being anorexic. Even though back then I was miserable and suicidal, I still have that ‘ana voice’ telling me I’d be happier if I was skinny again.",
          "created_utc": 1746251905.0
        }
      ]
    },
    {
      "id": "mqcc3mc",
      "author": "melancolique_verush",
      "body": "I understand you really well. Can’t imagine a life in a ‘healthy bmi’ body. I mean it is possible to imagine, but I will probably go insane and just become more harsh and evil towards myself instead of being happy and stuff… being chubby brought so much pain in my life (like it wasn’t already enough at the time), it seems unbearable to do this again to myself",
      "created_utc": 1746262435.0,
      "score": 16,
      "context": [
        {
          "id": "mqc2010",
          "author": "Queenofwands1212",
          "body": "When I look at other women’s bodies who are normal BMI and not underweight, I think they look great and lovely. But when I was a healthy bmi I felt absolutely disgusting and couldn’t handle it. My sensory issues went insane, my physical and mental discomfort made me unable to function in a normal bmi body. So it’s like I accept bodies of all kinds but for me, I don’t look right or feel good when I’m a normal weight so I basically just have to stay underweight in order to feel sane. When I was chubby and healthy bmi I had panic attacks and nervous breakdowns and self harmed and I was in a worse state of mind even though I looked healthier",
          "created_utc": 1746256108.0
        }
      ]
    },
    {
      "id": "mqti4p1",
      "author": "Important-Media1349",
      "body": "People get mad because they think you can just quit just be immediately cured if you want. I had this experience from a family member and they acted like I could wake up one day and never think about my diet ever again",
      "created_utc": 1746498357.0,
      "score": 6,
      "context": [
        {
          "id": "mqcv4on",
          "author": "Shoddy-Worry9131",
          "body": "People get mad at you for having it.",
          "created_utc": 1746273216.0
        }
      ]
    },
    {
      "id": "n4gqpbo",
      "author": "cupcake_918",
      "body": "THIS IS SO REAL",
      "created_utc": 1753155534.0,
      "score": 1,
      "context": [
        {
          "id": "mqcv4on",
          "author": "Shoddy-Worry9131",
          "body": "People get mad at you for having it.",
          "created_utc": 1746273216.0
        }
      ]
    },
    {
      "id": "mqdq5tf",
      "author": "ifakuta",
      "body": "^^^ this",
      "created_utc": 1746284606.0,
      "score": 8,
      "context": [
        {
          "id": "mqdf0a0",
          "author": "throwawayfishplanet",
          "body": "as someone who has both, i’d rather have ana than BED any day of the week",
          "created_utc": 1746280981.0
        }
      ]
    },
    {
      "id": "mqe30fy",
      "author": "amortentia_731",
      "body": "yes x10000000",
      "created_utc": 1746288633.0,
      "score": 6,
      "context": [
        {
          "id": "mqdf0a0",
          "author": "throwawayfishplanet",
          "body": "as someone who has both, i’d rather have ana than BED any day of the week",
          "created_utc": 1746280981.0
        }
      ]
    },
    {
      "id": "mqc4py4",
      "author": "None",
      "body": "And a lot of people think this is the competitive side but its the empathic side for me. Like I don't want ever feeling as miserable as AN has made me but I can't let it go",
      "created_utc": 1746257787.0,
      "score": 39,
      "context": [
        {
          "id": "mqbowx1",
          "author": "Stunning-Check2275",
          "body": "I’m pro Ana for me but not others.",
          "created_utc": 1746248641.0
        }
      ]
    },
    {
      "id": "mqcixwv",
      "author": "anastasia_42",
      "body": "Yesss",
      "created_utc": 1746266790.0,
      "score": 6,
      "context": [
        {
          "id": "mqbowx1",
          "author": "Stunning-Check2275",
          "body": "I’m pro Ana for me but not others.",
          "created_utc": 1746248641.0
        }
      ]
    },
    {
      "id": "mqbpfp7",
      "author": "Ashamed_Ad8162",
      "body": "Yes yes yes",
      "created_utc": 1746248916.0,
      "score": 8,
      "context": [
        {
          "id": "mqbowx1",
          "author": "Stunning-Check2275",
          "body": "I’m pro Ana for me but not others.",
          "created_utc": 1746248641.0
        }
      ]
    },
    {
      "id": "mqsxv83",
      "author": "Eye_Long",
      "body": "i feel the same way, i feel so empathetic and i truly hope everyone finds recovery, i just can’t want the same thing for myself, i deserve it, no one else does ",
      "created_utc": 1746491345.0,
      "score": 1,
      "context": [
        {
          "id": "mqbowx1",
          "author": "Stunning-Check2275",
          "body": "I’m pro Ana for me but not others.",
          "created_utc": 1746248641.0
        }
      ]
    },
    {
      "id": "mqliupq",
      "author": "monarchmondays",
      "body": "Yes. My sister is studying nutrition right now, wanting to be a a dietitian for eating disorder recovery, but SHE’S not even fully recovered yet. In fact saying she’s “recovering” is debatable, she seems like she’s in full blown orthorexia right now. When she comes home to visit, I notice she’s working out every single day (IMMEDIATELY after meals) sometimes twice a day, restricts, obsessed with her diet, only eats small, unseasoned portions in bowls to make it look like she’s eating more, surrounds herself with gym obsessed people, etc.\n\nI worry she’ll influence her clients negatively if she doesn’t recover fully by the time she finishes her degree. Not on purpose of course, but Jesus I wish she’d focus more on herself.\n\nI’m fully recovered and still can’t escape disordered thoughts. It terrifies me knowing how many people go into nutrition while still not in a healthy state of mind. Of course going into a career like that can very much help you too, but it’s risky.\n\nSorry for the rant, it’s just something I’m currently witnessing in real time. Absolutely terrifying to watch.",
      "created_utc": 1746391589.0,
      "score": 1,
      "context": [
        {
          "id": "mqdq385",
          "author": "ifakuta",
          "body": "choosing a career in nutrition is a slippery slope, even if you’re recovered",
          "created_utc": 1746284582.0
        }
      ]
    },
    {
      "id": "mqcb39m",
      "author": "anonhumanontheweb",
      "body": "👏🏻👏🏻👏🏻👏🏻👏🏻\n\nIt’s a line I’ll never cross. I’m anorexic, not a manipulative saboteur.",
      "created_utc": 1746261798.0,
      "score": 39,
      "context": [
        {
          "id": "mqbmk5f",
          "author": "Klutzy_Hunter_354",
          "body": "anorexia doesn’t “make” you fatten up the people around you or intentionally sabotage others in any way. if you do that you’re just a jerk who happens to be anorexic.",
          "created_utc": 1746247428.0
        }
      ]
    },
    {
      "id": "mqbmovy",
      "author": "Klutzy_Hunter_354",
      "body": "I’m talking about the people who will say ‘oh I always cook for my \\_\\_\\_ and give them more oil and larger portions‘ not because they’re afraid of the oil and portions, but for the end goal of making them gain weight to look thinner. huh??? youre weird.",
      "created_utc": 1746247495.0,
      "score": 68,
      "context": [
        {
          "id": "mqbmk5f",
          "author": "Klutzy_Hunter_354",
          "body": "anorexia doesn’t “make” you fatten up the people around you or intentionally sabotage others in any way. if you do that you’re just a jerk who happens to be anorexic.",
          "created_utc": 1746247428.0
        }
      ]
    },
    {
      "id": "mqbtegj",
      "author": "milkisterrifying",
      "body": "i agree! there is a difference between your ed making you more snappy/unpleasant to be around, and making you do things like that.",
      "created_utc": 1746251075.0,
      "score": 31,
      "context": [
        {
          "id": "mqbmk5f",
          "author": "Klutzy_Hunter_354",
          "body": "anorexia doesn’t “make” you fatten up the people around you or intentionally sabotage others in any way. if you do that you’re just a jerk who happens to be anorexic.",
          "created_utc": 1746247428.0
        }
      ]
    },
    {
      "id": "mqbzq7k",
      "author": "inukedmyself",
      "body": "Yeah I’ve never understood that",
      "created_utc": 1746254758.0,
      "score": 16,
      "context": [
        {
          "id": "mqbmk5f",
          "author": "Klutzy_Hunter_354",
          "body": "anorexia doesn’t “make” you fatten up the people around you or intentionally sabotage others in any way. if you do that you’re just a jerk who happens to be anorexic.",
          "created_utc": 1746247428.0
        }
      ]
    },
    {
      "id": "mqc0tus",
      "author": "Itscatpicstime",
      "body": "Is this really a hot or unhinged take?",
      "created_utc": 1746255411.0,
      "score": 11,
      "context": [
        {
          "id": "mqbmk5f",
          "author": "Klutzy_Hunter_354",
          "body": "anorexia doesn’t “make” you fatten up the people around you or intentionally sabotage others in any way. if you do that you’re just a jerk who happens to be anorexic.",
          "created_utc": 1746247428.0
        }
      ]
    },
    {
      "id": "mqhdo5i",
      "author": "Ashamed_Ad8162",
      "body": "My purpose of when I cook for myself is to cook food with the lowest number of cals. My purpose of when I cook for other people is to make food that actually tastes good.\n\nI think it’s all about intent ❤️",
      "created_utc": 1746330525.0,
      "score": 5,
      "context": [
        {
          "id": "mqbmk5f",
          "author": "Klutzy_Hunter_354",
          "body": "anorexia doesn’t “make” you fatten up the people around you or intentionally sabotage others in any way. if you do that you’re just a jerk who happens to be anorexic.",
          "created_utc": 1746247428.0
        }
      ]
    },
    {
      "id": "mqcpdda",
      "author": "False-Ad7538",
      "body": "I have mixed feelings!!!! When I was in treatment this was a pretty common experience that was talked about, I always felt it also had to do with control, idk. Also when I was in treatment we were all teens so maybe we were a little jerky? lol I really don’t know though.",
      "created_utc": 1746270411.0,
      "score": 14,
      "context": [
        {
          "id": "mqbmk5f",
          "author": "Klutzy_Hunter_354",
          "body": "anorexia doesn’t “make” you fatten up the people around you or intentionally sabotage others in any way. if you do that you’re just a jerk who happens to be anorexic.",
          "created_utc": 1746247428.0
        }
      ]
    },
    {
      "id": "mqctbzq",
      "author": "-Fadedpigeon47",
      "body": "Its a really competitive illness.. you want to be the best and thinnest",
      "created_utc": 1746272375.0,
      "score": 3,
      "context": [
        {
          "id": "mqbmk5f",
          "author": "Klutzy_Hunter_354",
          "body": "anorexia doesn’t “make” you fatten up the people around you or intentionally sabotage others in any way. if you do that you’re just a jerk who happens to be anorexic.",
          "created_utc": 1746247428.0
        }
      ]
    },
    {
      "id": "mqd1qni",
      "author": "m48_apocalypse",
      "body": "ur blood sugar gets so fucky and u get seizures from it sometimes 😭",
      "created_utc": 1746276073.0,
      "score": 14,
      "context": [
        {
          "id": "mqcmjz5",
          "author": "jcb300012",
          "body": "people don't mention the other side-effects. you don't just get skinny and underweight, you don't just become weak. you can die, your heart can literally just stop. your organs can give up. so many other things can happen, it should be talked about more",
          "created_utc": 1746268905.0
        }
      ]
    },
    {
      "id": "mqf458j",
      "author": "Ishouldntbleftlone",
      "body": "I can’t feel the right side of my body anymore it’s been 6 years",
      "created_utc": 1746300176.0,
      "score": 6,
      "context": [
        {
          "id": "mqcmjz5",
          "author": "jcb300012",
          "body": "people don't mention the other side-effects. you don't just get skinny and underweight, you don't just become weak. you can die, your heart can literally just stop. your organs can give up. so many other things can happen, it should be talked about more",
          "created_utc": 1746268905.0
        }
      ]
    },
    {
      "id": "mqtie8w",
      "author": "Important-Media1349",
      "body": "Obviously not as extreme but chairs become significantly less comfortable unless they are properly padded - this feels like such a non issue in comparison 😭",
      "created_utc": 1746498454.0,
      "score": 1,
      "context": [
        {
          "id": "mqcmjz5",
          "author": "jcb300012",
          "body": "people don't mention the other side-effects. you don't just get skinny and underweight, you don't just become weak. you can die, your heart can literally just stop. your organs can give up. so many other things can happen, it should be talked about more",
          "created_utc": 1746268905.0
        }
      ]
    },
    {
      "id": "mqddird",
      "author": "helianthus_0",
      "body": "Even better: don’t use object to purge!\n\nI’m sorry you had to go through that repeatedly.",
      "created_utc": 1746280473.0,
      "score": 18,
      "context": [
        {
          "id": "mqc4t45",
          "author": "lisa6547",
          "body": "Don't swallow any toothbrushes while purging. It will rupture your intestines and you WILL DIE OF SEPSIS\n\nyes, I have done this twice in a row in a matter of two weeks \n\nThe doctors and nurses just looked at me when I went to the ER for surgery again, and said....oh you're back here again?? 🤨🤨",
          "created_utc": 1746257842.0
        }
      ]
    },
    {
      "id": "mqi1qog",
      "author": "Skythebluestars",
      "body": "Theres a difference people who have a recovery account who share there recovery journey. And people who are recovered. And try to help others.\n\nI have a recovery account. I am not recovered wont claim that i am. I dont share , food portions, body pics, etc. \nWhat i do share is my journey. How i am doing. What im dealing with. Not only about my ed. But also about everthing thats going on. \n\nSometimes i dont post for months because im too tired. And only active on my stories.\n\nIts not so black and white. And not so dark only. I post also a lot of fun things. Its my personal account. I share my life. The fun things and the hard things.",
      "created_utc": 1746343373.0,
      "score": 1,
      "context": [
        {
          "id": "mqds7lw",
          "author": "starving_artist02",
          "body": "I dont think anyone who has a recovery account is really recovered since its quite obvthey still can't let go of their disorder\n\nAnd i dont think its a good idea at all for people who recovered to study nutrition like its not safe for yourself and fir the patients you have",
          "created_utc": 1746285255.0
        }
      ]
    },
    {
      "id": "mrcg3wf",
      "author": "Admirable_Shallot752",
      "body": "As a male, I agree. It seems like all treatment is focused on females whereas males experience it differently. I don't like being skinny but I don't want any bit of what I think is fat on me, I just want to be shredded. The whole idea of resting and all is very opposite to what is common in men with discipline, drive and masculinity being desired in society.\n\nI wish there was a treatment center that helped get back into things like sports and strength training in a healthy way. Without making exercise seem like a crime.",
      "created_utc": 1746752936.0,
      "score": 2,
      "context": [
        {
          "id": "mqbkxye",
          "author": "helianthus_0",
          "body": "Not sure how hot this is but males should have separate ED treatment facilities. From what I’ve read, so many males are uncomfortable in treatment centers because they’re often the only male, the other clients are talking about things like their periods (or lack thereof), or other clients are talking about distrusting men due to past trauma. Males also tend to experience EDs differently, such as wanting to bulk up instead of slim down. Also, so many treatment centers are geared towards females with female-focused language, programming, etc. \n\nNot particularly hot but we need non-profit treatment centers and treatment centers that cater to people on the autism spectrum",
          "created_utc": 1746246620.0
        }
      ]
    },
    {
      "id": "mqcoasd",
      "author": "BigGainsBigBoobs",
      "body": "I agree with this to an extend, I'm myself in 24/7 treatment facility. Only male here, I can't say much about what the women talk about because they literally don't talk (i think it's cuz they maybe don't really have the power to and is scared to talk to me cuz I am a male???) but one thing I can say is I feel like that the treatment is kind of targeted or made in a way that applies best to women(I know this is kind of stereotypical) , but such as arts and crafts and this very calming kind of mindset they want us to get into whereas I think me and a lot of men would benefit more from getting into that drive/motivational kind of state and mindset. I really do think there is other better things for me and a lot of other men than sitting and building puzzles and knitting..",
      "created_utc": 1746269844.0,
      "score": -11,
      "context": [
        {
          "id": "mqbkxye",
          "author": "helianthus_0",
          "body": "Not sure how hot this is but males should have separate ED treatment facilities. From what I’ve read, so many males are uncomfortable in treatment centers because they’re often the only male, the other clients are talking about things like their periods (or lack thereof), or other clients are talking about distrusting men due to past trauma. Males also tend to experience EDs differently, such as wanting to bulk up instead of slim down. Also, so many treatment centers are geared towards females with female-focused language, programming, etc. \n\nNot particularly hot but we need non-profit treatment centers and treatment centers that cater to people on the autism spectrum",
          "created_utc": 1746246620.0
        }
      ]
    },
    {
      "id": "mqblv62",
      "author": "marshmallo_floof",
      "body": "Nah, as someone who developed anorexia without influence from the internet I feel so detached from the proana stuff and frankly speaking rather corny/cringe and almost insulting to me",
      "created_utc": 1746247078.0,
      "score": 24,
      "context": [
        {
          "id": "mqbkjq8",
          "author": "-aquapixie-",
          "body": "Ooh I got a spicy one.\n\nWe're all secretly ProAna when it comes to ourselves. We've all used thinspo, tips and tricks, mantras, buzzwords, as a method of reinforcing the eating disorder behaviours within ourselves. (And strengthening its control.)\n\nEven if we publicly condemn actions within the community, all of us have at least once in our life, used a thinspo pic or a mantra or a trick we read off the internet. All of which is inherently ProAna, whether it's labelled that or not.",
          "created_utc": 1746246426.0
        }
      ]
    },
    {
      "id": "mqgl5c2",
      "author": "Ashamed_Ad8162",
      "body": "I’m unfortunately finding this to be true for myself. I’ve done treatment so many times, and I’ve got a SEED label, so it’s caused my goal to shift from full recovery to harm reduction. \n\nI now get the whole treatment burn out thing.",
      "created_utc": 1746318890.0,
      "score": 4,
      "context": [
        {
          "id": "mqfw899",
          "author": "Nia_KR",
          "body": "I don’t think anybody recovers from an ed in the sense that it goes away for good. if you develop an ed you have an ed forever, you can get better and the thoughts can become significantly quieter or even go away completely (until something triggers it again), but you’re never not anorexic anymore, because it’s a mental illness. just like you can’t fully “recover” from bipolar or depression or any other mental illness, you just get better at dealing with it. and that’s ok",
          "created_utc": 1746309577.0
        }
      ]
    },
    {
      "id": "mqtjb9n",
      "author": "Important-Media1349",
      "body": "I fully agree to the point that I don’t think this is even a hot take I feel like everyone who’s ever had an ed probably agrees with you. The crazy behaviours are gone but the thoughts are very much still here",
      "created_utc": 1746498790.0,
      "score": 1,
      "context": [
        {
          "id": "mqfw899",
          "author": "Nia_KR",
          "body": "I don’t think anybody recovers from an ed in the sense that it goes away for good. if you develop an ed you have an ed forever, you can get better and the thoughts can become significantly quieter or even go away completely (until something triggers it again), but you’re never not anorexic anymore, because it’s a mental illness. just like you can’t fully “recover” from bipolar or depression or any other mental illness, you just get better at dealing with it. and that’s ok",
          "created_utc": 1746309577.0
        }
      ]
    },
    {
      "id": "mqtiwzs",
      "author": "Important-Media1349",
      "body": "This is so true - I was raised in a religious household always told to be truthful and was a horrible lier. At this point I think I could slap someone in the face look them in the eye and say I didn’t do it without the slightest smirk or sweat",
      "created_utc": 1746498647.0,
      "score": 1,
      "context": [
        {
          "id": "mqdn0p4",
          "author": "fireflower0",
          "body": "I learned how to lie and it never went away",
          "created_utc": 1746283608.0
        }
      ]
    },
    {
      "id": "mqi2b18",
      "author": "Skythebluestars",
      "body": "Thiss!! It distacts me from the pain within. When AN its 'easy' iknow that routine. No suprises there. Nothing else to deal with.",
      "created_utc": 1746343721.0,
      "score": 4,
      "context": [
        {
          "id": "mqf81kj",
          "author": "slynne28",
          "body": "Recovery means you actually have to deal with all the other crap, anger and trauma the eating disorder masked. At least in a day with AN, I knew what I had to focus on.",
          "created_utc": 1746301486.0
        }
      ]
    },
    {
      "id": "mqvo8f6",
      "author": "sociallyawkward_teen",
      "body": "Yes!! I’ve noticed that I fall back into the ed because I liked having a goal. I liked waking up feeling proud of or motivated by the numbers changing on the scale. Having everything be the same, or even in an upward trend each day during recovery made me realize I don’t know my hobbies, I have to actually cope with difficult emotions, etc.",
      "created_utc": 1746537331.0,
      "score": 3,
      "context": [
        {
          "id": "mqf81kj",
          "author": "slynne28",
          "body": "Recovery means you actually have to deal with all the other crap, anger and trauma the eating disorder masked. At least in a day with AN, I knew what I had to focus on.",
          "created_utc": 1746301486.0
        }
      ]
    },
    {
      "id": "mqdhflq",
      "author": "being-weird",
      "body": "Uh you can actually get sectioned for a whole bunch of reasons, and EDs have the highest mortality rate of any mental Illness. If you're choosing to stay sick I would seriously recommend you reconsider",
      "created_utc": 1746281794.0,
      "score": 3,
      "context": [
        {
          "id": "mqde8zk",
          "author": "turnipkitty112",
          "body": "It’s ok for people to not want to recover, not pursue recovery, and actively choose to remain sick. People shouldn’t be forced into treatment, assuming they have the most basic decision making capacity. Choosing to remain sick isn’t a bad or wrong choice, even if that choice is a direct result of the ED itself. \n\nOf course I want recovery for everyone (except maybe myself lol) and that would be the ideal scenario but some ppl aren’t capable of it at the moment, aren’t ready, or don’t want to and *that’s fine*. Professionals refusing to work with someone who isn’t willing to recover/go to a higher level of care/sign a contract is unethical and causes more harm. Threatening people into recovery doesn’t work. \n\nNo one wants to admit it, but oftentimes the ED is serving a function and, as a coping strategy or protective thing, it WORKS. There are downsides, yes, but forcing someone to give up ED behaviours that may be keeping them safe in other ways is cruel. Virtually everyone has harmful and negative coping mechanisms, whether that is alcohol/substances, relationship issues, overeating, isolation, overworking, self harm, whatever. No one coerces them into giving those things up or tells them they’re just delusional and incapable of making decisions… until it’s a restrictive ED.",
          "created_utc": 1746280723.0
        }
      ]
    },
    {
      "id": "mqxju4m",
      "author": "Tough_Bill419",
      "body": "I agree, i was forced into treatment when i wasn’t ready and it only made my relationship with food worse. Plus, i had barely even experienced any of the side effects at the time, i was still in the “honeymoon phase” of my ED. I think if it got to the point where i was truly miserable, i might be more inclined to get better.",
      "created_utc": 1746557150.0,
      "score": 0,
      "context": [
        {
          "id": "mqde8zk",
          "author": "turnipkitty112",
          "body": "It’s ok for people to not want to recover, not pursue recovery, and actively choose to remain sick. People shouldn’t be forced into treatment, assuming they have the most basic decision making capacity. Choosing to remain sick isn’t a bad or wrong choice, even if that choice is a direct result of the ED itself. \n\nOf course I want recovery for everyone (except maybe myself lol) and that would be the ideal scenario but some ppl aren’t capable of it at the moment, aren’t ready, or don’t want to and *that’s fine*. Professionals refusing to work with someone who isn’t willing to recover/go to a higher level of care/sign a contract is unethical and causes more harm. Threatening people into recovery doesn’t work. \n\nNo one wants to admit it, but oftentimes the ED is serving a function and, as a coping strategy or protective thing, it WORKS. There are downsides, yes, but forcing someone to give up ED behaviours that may be keeping them safe in other ways is cruel. Virtually everyone has harmful and negative coping mechanisms, whether that is alcohol/substances, relationship issues, overeating, isolation, overworking, self harm, whatever. No one coerces them into giving those things up or tells them they’re just delusional and incapable of making decisions… until it’s a restrictive ED.",
          "created_utc": 1746280723.0
        }
      ]
    },
    {
      "id": "mqhv483",
      "author": "Proper_Salamander_84",
      "body": "This. I relate.",
      "created_utc": 1746339462.0,
      "score": 4,
      "context": [
        {
          "id": "mqfpaxe",
          "author": "Fluttery_Soul",
          "body": "Dont cancel me guys\n\n\nMy hot take is that being anorexic and slowly dying is better than committing s*icide. Not better for the anorexic person ofc lol but better for their family bc they should be grateful that the person is even still alive",
          "created_utc": 1746307167.0
        }
      ]
    },
    {
      "id": "mqc5mit",
      "author": "Itscatpicstime",
      "body": "BMI is reasonably accurate for most of the population - it is absolutely not arbitrary.\n\nBut yes, ana subtypes should be defined by the behaviors and thought processes involved, not the results. And it’s crazy how the psych and medical field doesn’t understand how harmful this can be, especially for a community that is notable for being and feeling “competitive” in their illness.",
      "created_utc": 1746258352.0,
      "score": 8,
      "context": [
        {
          "id": "mqbjqf7",
          "author": "Thick_Reaction_9887",
          "body": "This generally applies to the majority of mental health issues and disorders but I firmly attest to the belief that eds are heavily misunderstood and the categories are really rigid and outdated. The diagnosis criteria is incredible invalidating for the majority of people with genuine eds and there are way too many factors playing into an individuals life that lead them to not falling into that very specific criteria. The majority of people, for example, with anorexia, fall into the \"atypical\" category specifically because of their bmi even though most doctors acknowledge that bmi is fucking arbitrary and health issues as a result from eds happen at ALL weights/bmi categories. \nI understand why these criteria were made, but eds are much too prevalent to invalidate a person who definitely has issues when these disorders often feed off of not feeling sick enough. It's a hell of a lot easier to prevent things from getting worse and validate each other for our struggles as they are than it is to keep seeing people suffer and give each other imposter's syndrome.",
          "created_utc": 1746246025.0
        }
      ]
    },
    {
      "id": "mqdd6ml",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1746280357.0,
      "score": 11,
      "context": [
        {
          "id": "mqbumua",
          "author": "FiannaNevra",
          "body": "I loved the pro Ana and Mia forums online",
          "created_utc": 1746251774.0
        }
      ]
    },
    {
      "id": "n2bvfy6",
      "author": "Dry-Independent2931",
      "body": "omg same 😭 i thought i was going crazy when i couldn’t find any of those sites anymore and wondered why nothing popped up lmao",
      "created_utc": 1752136296.0,
      "score": 2,
      "context": [
        {
          "id": "mqbumua",
          "author": "FiannaNevra",
          "body": "I loved the pro Ana and Mia forums online",
          "created_utc": 1746251774.0
        }
      ]
    },
    {
      "id": "mqs85j0",
      "author": "Mantleno",
      "body": "LMAO I LOVE THIS ONE.",
      "created_utc": 1746482678.0,
      "score": 1,
      "context": [
        {
          "id": "mqdrodr",
          "author": "invader-wyn",
          "body": "i recovered by telling myself i’ll never have a fat jiggly ass if i’m starving myself over and over again until i started gaining my weight back",
          "created_utc": 1746285087.0
        }
      ]
    },
    {
      "id": "mqi2un6",
      "author": "Skythebluestars",
      "body": "I think thats the only rhing i never miss. Ofc its good if you have them back. But omg live is so much easiee without them😭",
      "created_utc": 1746344052.0,
      "score": 4,
      "context": [
        {
          "id": "mqfq0jp",
          "author": "Fluttery_Soul",
          "body": "I'm sorry but I don't miss those ungodly period cramps or heavy bleeds",
          "created_utc": 1746307407.0
        }
      ]
    },
    {
      "id": "mr7b3lu",
      "author": "carotenemia",
      "body": "I have been an undisciplined anorexic! Beyond undisciplined, completely disastrous, even long before I ever started binging, or, subsequently, purging. I think it requires discipline to be a certain kind of anorexic. someone who like, leans ortho. but eating in a redundant, extreme deficit was very easy, just ride out the inertia. I ate a lot of oatmeal and chewed a lot of gum, drank a lot of monster. Eat (insert number) of quest bars a day, rinse/repeat, requires so much less discipline than eating like a normal human being. Much, much easier than trying to eat enough, but not too much, get the right macros, etc. etc. and eating different shit all the time, instead of the same shit over and over.\n\nMy flammable take is: \n\nThere is such a thing at being “good” and “bad” at an eating disorder. I, personally, was ok at orthorexia, good at anorexia, then bad, then very very good, then, briefly, bad again, then absolutely godly at bulimia, could win some sort of award or something. Guinness book. Of course it’s not *a good thing* to be good at an eating disorder. It’s fucked. But I think, like other people in this thread have said, some people (not all, and I wasn’t one of them) sort of do choose to peruse anorexia specifically, and a lack of success can be disuasive. I think there is such a thing as like, acute adolescent anorexia (or other restrictive ed) that only lasts around a year, and it is p different from chronic or persistent anorexia. (This also speaks to what you said abt the little voice, I think the former can recover without it, but for the latter it’s calcified as a part of who you are as a person, it just gets louder or quieter) \n\nAlso BED prob, atp, has a higher mortality rate from complications than AN, it’s just way, way underdiagnosed, as binge eating and compulsive overeating is more culturally normalized than starving oneself.",
      "created_utc": 1746685350.0,
      "score": 2,
      "context": [
        {
          "id": "mqlflyc",
          "author": "Anxious_Lake_5566",
          "body": "I see a lot of these aren’t hot takes. Here is a really flammable take: I have not met an anorexic without discipline. It takes discipline to be anorexic. \n\nI also doubt that you ever fully really recover without that little voice in your head that would for example be happy after noticing collar bones that appeared after a long stomach bug or something. \n\nI never fell deep in the pits of an eating disorder I think partly because I am naturally thin, but I also never swam really to the shore - I could not enjoy either of my pregnancies because I saw myself as disfigured. I wish more people mentioned what a trigger pregnancy is.",
          "created_utc": 1746390582.0
        }
      ]
    },
    {
      "id": "mqmokh3",
      "author": "andstaleperfume",
      "body": "**and if they don’t care a lot less, they just get angrier at you.",
      "created_utc": 1746405838.0,
      "score": 3,
      "context": [
        {
          "id": "mqmo4rd",
          "author": "andstaleperfume",
          "body": "i always feel like people care a lot less about your disorder when you’re an adult. it sucks.",
          "created_utc": 1746405679.0
        }
      ]
    },
    {
      "id": "mqn30kl",
      "author": "Ashamed_Ad8162",
      "body": "Yes!!\nBeing a teen with an ED is so different from being an adult with an ED. It definitely was a hit to my identity. I went from a helpless child with AN to an adult blamed for not recovering.\n\nI do have to say, my res experiences as an adult were for less damaging than my ones as a kid. I loved having a little more autonomy!",
      "created_utc": 1746411118.0,
      "score": 2,
      "context": [
        {
          "id": "mqmo4rd",
          "author": "andstaleperfume",
          "body": "i always feel like people care a lot less about your disorder when you’re an adult. it sucks.",
          "created_utc": 1746405679.0
        }
      ]
    },
    {
      "id": "mqglwj5",
      "author": "BasOutten",
      "body": "What. Arfid results in not eating anorexia results in not eating. It's different routes to the same place!",
      "created_utc": 1746319178.0,
      "score": 3,
      "context": [
        {
          "id": "mqfj10z",
          "author": "TroubledGirl_",
          "body": "My own hot take.... my Anorexia cured my AFRID and kept me from cutting myself",
          "created_utc": 1746305097.0
        }
      ]
    },
    {
      "id": "mqdglpg",
      "author": "being-weird",
      "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
      "created_utc": 1746281519.0,
      "score": 6,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        }
      ]
    },
    {
      "id": "mqvpxaz",
      "author": "sociallyawkward_teen",
      "body": "That first part really hits. I go on mission trips where we provide food to communities that need it. I remember being in Honduras and someone remarked that the children were “so small”, but I literally couldn’t see it because I had been in Kenya the summer prior and some of the children were walking skeletons. My heart shattered when I realized that I wasn’t able to help people in the capacity I wanted because I had seen worse. This was also a hard realization after my relapse because I was made aware that my standard for “thin” was literally a malnourished tribe in Kenya. It made me grateful that I have the choice to not eat, but it also really shook me. On the bright side, they’ve been getting rain in that village so the famine is less severe!",
      "created_utc": 1746537918.0,
      "score": 2,
      "context": [
        {
          "id": "mqi18o9",
          "author": "fornow_foralways",
          "body": "sometimes when i see very skinny people i think “well i’ve seen skinnier” and that’s bc ive been unfortunate very pro ana for the last 16 years. oh and the actually aesthetic of anorexia is so beautiful when you dont see the negative side effects.",
          "created_utc": 1746343072.0
        }
      ]
    },
    {
      "id": "mqz38dy",
      "author": "Ashamed_Ad8162",
      "body": "Ain’t that the truth!!",
      "created_utc": 1746573708.0,
      "score": 2,
      "context": [
        {
          "id": "mqytvu9",
          "author": "Technical_Goat_8473",
          "body": "Most \"recovery\" accounts I've seen are not about recovery",
          "created_utc": 1746570620.0
        }
      ]
    },
    {
      "id": "mqhej5f",
      "author": "Ashamed_Ad8162",
      "body": "But what is healthy in that context? \n\nMental health, physical health, and social health all matter\n\nOr do you just mean you meet the white, thin, female ideal of health?",
      "created_utc": 1746330917.0,
      "score": 3,
      "context": [
        {
          "id": "mqfpno4",
          "author": "Fluttery_Soul",
          "body": "I am healthier now than before my ED",
          "created_utc": 1746307286.0
        }
      ]
    },
    {
      "id": "mqc5qm5",
      "author": "Itscatpicstime",
      "body": "Op said hot take, not cruel take",
      "created_utc": 1746258423.0,
      "score": 9,
      "context": [
        {
          "id": "mqbimqd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746245499.0
        }
      ]
    },
    {
      "id": "mqbp6u6",
      "author": "Ashamed_Ad8162",
      "body": "This isn’t unhinged, it’s just icky. You can suffer with an ED at any weight, and advocating for someone to have this cruel disorder is not okay, even if you aren’t serious :/",
      "created_utc": 1746248785.0,
      "score": 16,
      "context": [
        {
          "id": "mqbimqd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746245499.0
        }
      ]
    },
    {
      "id": "mqbmbif",
      "author": "Klutzy_Hunter_354",
      "body": "Ana brain got u bad omg",
      "created_utc": 1746247307.0,
      "score": 19,
      "context": [
        {
          "id": "mqbimqd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746245499.0
        }
      ]
    },
    {
      "id": "mqc6t5t",
      "author": "throwawayforlemoi",
      "body": "What's wrong with you? Read the rules before posting this shit.",
      "created_utc": 1746259085.0,
      "score": 7,
      "context": [
        {
          "id": "mqbimqd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746245499.0
        }
      ]
    },
    {
      "id": "mqboikt",
      "author": "biggestballzzz",
      "body": "ummm whaaaaaa…… we asked for unhinged not disordered",
      "created_utc": 1746248435.0,
      "score": 10,
      "context": [
        {
          "id": "mqbimqd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746245499.0
        }
      ]
    },
    {
      "id": "mqctx1s",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 1: Do not participate in pro-ed behaviors. \n\nAs doing things like asking for \"ana buddies\" is harmful for members of the r/AnorexiaNervosa community, it is not allowed. Please do not do things like this in the future. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1746272652.0,
      "score": 2,
      "context": [
        {
          "id": "mqbimqd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746245499.0
        }
      ]
    },
    {
      "id": "mqddule",
      "author": "biggestballzzz",
      "body": "ooooof okay let’s also not invalidate actual diagnoses either pls",
      "created_utc": 1746280586.0,
      "score": 11,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        }
      ]
    },
    {
      "id": "mqdhucm",
      "author": "Ashamed_Ad8162",
      "body": "The current research does not agree with you on this one— the HAES book and Sick Enough address this in a really understandable way. Highly recommended looking into them!",
      "created_utc": 1746281930.0,
      "score": 8,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        }
      ]
    },
    {
      "id": "mqk20ce",
      "author": "Ashamed_Ad8162",
      "body": "I don’t know about this one… is it possible to fully recover? Would it be okay for a recovered alcoholic to have a drink? \n\nI feel like most clinicians and recovered people would disagree with this one. On the other hand, I would love to go on a diet again, but I’m not recovered lol",
      "created_utc": 1746375330.0,
      "score": 1,
      "context": [
        {
          "id": "mqjwpjd",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1746373679.0
        }
      ]
    },
    {
      "id": "mqglbgq",
      "author": "Ashamed_Ad8162",
      "body": "I feel like I need you to elaborate this one…",
      "created_utc": 1746318954.0,
      "score": 2,
      "context": [
        {
          "id": "mqe8e8x",
          "author": "Smelly_CatFood",
          "body": "Having a terrible diet and being obese is not the same as having an eating disorder imo",
          "created_utc": 1746290334.0
        }
      ]
    },
    {
      "id": "mqng7c2",
      "author": "patyruiva",
      "body": "Exactly! I'm doing exactly that and look, we need SURREAL strength to not give up on everything, I don't want my family to know, that's why I only told 3 people.",
      "created_utc": 1746416297.0,
      "score": 2,
      "context": [
        {
          "id": "mqbkmmc",
          "author": "PinkMangoDolly",
          "body": "Sometimes I wonder if my Ed was even real. Nobody knew about it and even the ones that knew did nothing. I recovered on my own without anyone knowing. It’s quite weird as I was fighting this battle but no one knew or cared. Sometimes I feel like it’s for attention :/",
          "created_utc": 1746246465.0
        },
        {
          "id": "mqbqc5z",
          "author": "ema_merc",
          "body": "It takes incredible strength to recover without any support ❤️ your experience is real regardless of who knew about it",
          "created_utc": 1746249397.0
        }
      ]
    },
    {
      "id": "mqcab5a",
      "author": "Brilliant-Feeling-15",
      "body": "This. I think people equate wanting attention with being a bad person when in reality it’s usually  a sign of severe loneliness and depression. Or even neglect as a child.",
      "created_utc": 1746261293.0,
      "score": 35,
      "context": [
        {
          "id": "mqbkmmc",
          "author": "PinkMangoDolly",
          "body": "Sometimes I wonder if my Ed was even real. Nobody knew about it and even the ones that knew did nothing. I recovered on my own without anyone knowing. It’s quite weird as I was fighting this battle but no one knew or cared. Sometimes I feel like it’s for attention :/",
          "created_utc": 1746246465.0
        },
        {
          "id": "mqc127r",
          "author": "Itscatpicstime",
          "body": "Well if you let so few people know, it clearly wasn’t for attention.\n\nBut even if it was - that still indicates something psychologically wrong and harmful going on that would be equally in need of treatment.",
          "created_utc": 1746255548.0
        }
      ]
    },
    {
      "id": "mqfw8s7",
      "author": "PinkMangoDolly",
      "body": "Thank you, genuinely I don’t even know how bc it took me only a few weeks and the reason was bc of like how the world wants to keep women small so that they can keep us under control yk. And I was like hell nah I’m gonna be strong and shit man",
      "created_utc": 1746309583.0,
      "score": 4,
      "context": [
        {
          "id": "mqbkmmc",
          "author": "PinkMangoDolly",
          "body": "Sometimes I wonder if my Ed was even real. Nobody knew about it and even the ones that knew did nothing. I recovered on my own without anyone knowing. It’s quite weird as I was fighting this battle but no one knew or cared. Sometimes I feel like it’s for attention :/",
          "created_utc": 1746246465.0
        },
        {
          "id": "mqfuthw",
          "author": "Nia_KR",
          "body": "Wow. I don’t think you quite understand just how incredibly strong you are for doing that??? If I had zero support I don’t think I wouldve ever even considered recovery. you’re actually amazing dude",
          "created_utc": 1746309078.0
        }
      ]
    },
    {
      "id": "mqewe6p",
      "author": "toritxtornado",
      "body": "yup. i’m 36 and have had osteoporosis since my 20s 🫠🫠",
      "created_utc": 1746297650.0,
      "score": 9,
      "context": [
        {
          "id": "mqbpa06",
          "author": "toritxtornado",
          "body": "i actually chose to have anorexia…i just didn’t know how bad it would get",
          "created_utc": 1746248831.0
        },
        {
          "id": "mqc8hfk",
          "author": "Far-Lavishness-6519",
          "body": "This. I knew i was falling into that hole, yet dind't study any side effects yet. Because those \"your hair will fall out\" comments obviously dind't help. People should warn about the extreme side effects more to prevent this from happening",
          "created_utc": 1746260129.0
        }
      ]
    },
    {
      "id": "mqg5mur",
      "author": "toritxtornado",
      "body": "yeah i saw a video in health about anorexic lexi and was like yup that’s a good idea 🤦🏻‍♀️",
      "created_utc": 1746313047.0,
      "score": 7,
      "context": [
        {
          "id": "mqbpa06",
          "author": "toritxtornado",
          "body": "i actually chose to have anorexia…i just didn’t know how bad it would get",
          "created_utc": 1746248831.0
        },
        {
          "id": "mqg427k",
          "author": "SquareWalk6730",
          "body": "Sadly, a majority chose the disorder in an effort to be thin. \n\nI'm 31, but when I was like 10-11, I watched a documentary on YouTube about children with anorexia. Then binge watched a few more documentries on anorexia. That was the day I attempted restricting for the first time. (Also, holy crap it's hard to believe YouTube has been around that long.)",
          "created_utc": 1746312463.0
        }
      ]
    },
    {
      "id": "mqtht5u",
      "author": "Important-Media1349",
      "body": "My friend is just finishing his degree in psychology - he chose to read his dissertation on eating disorders with a focus on ana and he asked me to read it over which I had no issue with as I’ve been very open about my experience since beginning recovery 2 years ago. I was reading and I realised that however much theory there is it can’t ever really explain the real thoughts that people have.",
      "created_utc": 1746498244.0,
      "score": 3,
      "context": [
        {
          "id": "mqczu0v",
          "author": "OrganicDoughnut5965",
          "body": "My hot take is if you’ve never had anorexia, you will never understand what goes on in an anorexic person’s head. Truly believe the only way to understand it is to go through it yourself 🤷🏼‍♀️",
          "created_utc": 1746275276.0
        },
        {
          "id": "mqkqdd0",
          "author": "StummyAcheSurvivor",
          "body": "I say this to my mom. AN really is a, “you don’t get it unless if you’ve been there”. It’s like your whole world shifts",
          "created_utc": 1746382671.0
        }
      ]
    },
    {
      "id": "mqtita0",
      "author": "kizzletizzleizzle",
      "body": "same, the more i reflect the more i realize i just wish i had more control over my life right now and i don’t actually miss being sick bc it was hell and i worked so hard to get better. it’s a tricky head space to be in though",
      "created_utc": 1746498608.0,
      "score": 1,
      "context": [
        {
          "id": "mqbm0c8",
          "author": "kizzletizzleizzle",
          "body": "mine is i miss my eating disorder self a lot but i know i shouldn’t",
          "created_utc": 1746247150.0
        },
        {
          "id": "mqthfak",
          "author": "Important-Media1349",
          "body": "I’ve been in recovery for 2 years with only 2 brief relapses both caused by Snapchat flashbacks from 2-3 years ago. I’ve started to remember the bad more than the good which has prevented it since I feel",
          "created_utc": 1746498102.0
        }
      ]
    },
    {
      "id": "mqhqg2j",
      "author": "Deepspacechris",
      "body": "Oh definitely. A coping mechanism for sure, just like derealisation and dissociation.",
      "created_utc": 1746336854.0,
      "score": 6,
      "context": [
        {
          "id": "mqbtaf7",
          "author": "Deepspacechris",
          "body": "I like how my AN makes me focus less on  some of the other bad things in my life.",
          "created_utc": 1746251011.0
        },
        {
          "id": "mqgpnxy",
          "author": "db_anon8452",
          "body": "To me this is 70% the point of an ED, the other 30% is being thin.",
          "created_utc": 1746320644.0
        }
      ]
    },
    {
      "id": "mqiltwh",
      "author": "Ok_Dragonfly7683108",
      "body": "Absolutely. I was going through a (yet another) tough period in my life last year and was struggling to feel in control and then I remembered a little “trick” that worked in my late teens and 20s. Next thing you know, >!collar bones poppin in pics!< in December. Gained a bit of the weight back in April but it’s almost summer and the need for control remains so back in I dive.",
      "created_utc": 1746355766.0,
      "score": 3,
      "context": [
        {
          "id": "mqbtaf7",
          "author": "Deepspacechris",
          "body": "I like how my AN makes me focus less on  some of the other bad things in my life.",
          "created_utc": 1746251011.0
        },
        {
          "id": "mqgpnxy",
          "author": "db_anon8452",
          "body": "To me this is 70% the point of an ED, the other 30% is being thin.",
          "created_utc": 1746320644.0
        }
      ]
    },
    {
      "id": "mqd7lku",
      "author": "modernhate",
      "body": "It’s why I’m still stuck in my current relapse and is so afraid to reach out for help even though I have a mental breakdown near everyday at this point, suicidal as fuck and just overall miserable but ✨skinni ✨",
      "created_utc": 1746278362.0,
      "score": 11,
      "context": [
        {
          "id": "mqbuv6v",
          "author": "BallAffectionate4000",
          "body": "Now that I’m recovered and overweight, I miss being anorexic. Even though back then I was miserable and suicidal, I still have that ‘ana voice’ telling me I’d be happier if I was skinny again.",
          "created_utc": 1746251905.0
        },
        {
          "id": "mqc8kzr",
          "author": "Far-Lavishness-6519",
          "body": "This is my only reason i don't try to recover sigh 😞",
          "created_utc": 1746260190.0
        }
      ]
    },
    {
      "id": "mqea7w1",
      "author": "Culvertfun",
      "body": "It's like a best friend that will never leave you.",
      "created_utc": 1746290905.0,
      "score": 9,
      "context": [
        {
          "id": "mqbowx1",
          "author": "Stunning-Check2275",
          "body": "I’m pro Ana for me but not others.",
          "created_utc": 1746248641.0
        },
        {
          "id": "mqc4py4",
          "author": "None",
          "body": "And a lot of people think this is the competitive side but its the empathic side for me. Like I don't want ever feeling as miserable as AN has made me but I can't let it go",
          "created_utc": 1746257787.0
        }
      ]
    },
    {
      "id": "mqhnnzz",
      "author": "ExplorerQuiet9933",
      "body": "This. All of the girls at work are on their summer diets, they all got Mfp and have been doing that together, and it's almost all they talk about and ask me about how I lost weight. \n\nI just say I started eating a lot cleaner and portion control on top of being really active... It's not a lie. Other than that I encourage them to eat. \n\nI love them, I don't want them to follow me down this rabbit hole.",
      "created_utc": 1746335362.0,
      "score": 1,
      "context": [
        {
          "id": "mqbowx1",
          "author": "Stunning-Check2275",
          "body": "I’m pro Ana for me but not others.",
          "created_utc": 1746248641.0
        },
        {
          "id": "mqc4py4",
          "author": "None",
          "body": "And a lot of people think this is the competitive side but its the empathic side for me. Like I don't want ever feeling as miserable as AN has made me but I can't let it go",
          "created_utc": 1746257787.0
        }
      ]
    },
    {
      "id": "mqj6m8g",
      "author": "jcb300012",
      "body": "i know! i remember the first time i got my blood sugar taken it was 2.1 lmao",
      "created_utc": 1746365170.0,
      "score": 3,
      "context": [
        {
          "id": "mqcmjz5",
          "author": "jcb300012",
          "body": "people don't mention the other side-effects. you don't just get skinny and underweight, you don't just become weak. you can die, your heart can literally just stop. your organs can give up. so many other things can happen, it should be talked about more",
          "created_utc": 1746268905.0
        },
        {
          "id": "mqd1qni",
          "author": "m48_apocalypse",
          "body": "ur blood sugar gets so fucky and u get seizures from it sometimes 😭",
          "created_utc": 1746276073.0
        }
      ]
    },
    {
      "id": "mqj6jlv",
      "author": "jcb300012",
      "body": "have you gone to see somebody?",
      "created_utc": 1746365143.0,
      "score": 2,
      "context": [
        {
          "id": "mqcmjz5",
          "author": "jcb300012",
          "body": "people don't mention the other side-effects. you don't just get skinny and underweight, you don't just become weak. you can die, your heart can literally just stop. your organs can give up. so many other things can happen, it should be talked about more",
          "created_utc": 1746268905.0
        },
        {
          "id": "mqf458j",
          "author": "Ishouldntbleftlone",
          "body": "I can’t feel the right side of my body anymore it’s been 6 years",
          "created_utc": 1746300176.0
        }
      ]
    },
    {
      "id": "mqepvtp",
      "author": "lisa6547",
      "body": "Yea, it was pretty fucked honestly. Not okay \n\nWell I only managed to stop recently because I replaced it. With vodka. not a good idea",
      "created_utc": 1746295604.0,
      "score": 8,
      "context": [
        {
          "id": "mqc4t45",
          "author": "lisa6547",
          "body": "Don't swallow any toothbrushes while purging. It will rupture your intestines and you WILL DIE OF SEPSIS\n\nyes, I have done this twice in a row in a matter of two weeks \n\nThe doctors and nurses just looked at me when I went to the ER for surgery again, and said....oh you're back here again?? 🤨🤨",
          "created_utc": 1746257842.0
        },
        {
          "id": "mqddird",
          "author": "helianthus_0",
          "body": "Even better: don’t use object to purge!\n\nI’m sorry you had to go through that repeatedly.",
          "created_utc": 1746280473.0
        }
      ]
    },
    {
      "id": "mrd734b",
      "author": "helianthus_0",
      "body": "Thanks for sharing your experiences! Regarding your second paragraph, there are! There are treatment centers that cater to athletes in America. Opal Food + Body in Washington, SDSU in California and Eating Disorder Care in Colorado are three that come to mind.",
      "created_utc": 1746763730.0,
      "score": 1,
      "context": [
        {
          "id": "mqbkxye",
          "author": "helianthus_0",
          "body": "Not sure how hot this is but males should have separate ED treatment facilities. From what I’ve read, so many males are uncomfortable in treatment centers because they’re often the only male, the other clients are talking about things like their periods (or lack thereof), or other clients are talking about distrusting men due to past trauma. Males also tend to experience EDs differently, such as wanting to bulk up instead of slim down. Also, so many treatment centers are geared towards females with female-focused language, programming, etc. \n\nNot particularly hot but we need non-profit treatment centers and treatment centers that cater to people on the autism spectrum",
          "created_utc": 1746246620.0
        },
        {
          "id": "mrcg3wf",
          "author": "Admirable_Shallot752",
          "body": "As a male, I agree. It seems like all treatment is focused on females whereas males experience it differently. I don't like being skinny but I don't want any bit of what I think is fat on me, I just want to be shredded. The whole idea of resting and all is very opposite to what is common in men with discipline, drive and masculinity being desired in society.\n\nI wish there was a treatment center that helped get back into things like sports and strength training in a healthy way. Without making exercise seem like a crime.",
          "created_utc": 1746752936.0
        }
      ]
    },
    {
      "id": "mqdfrd6",
      "author": "NicoleKidmansCurls",
      "body": "It is stereotypical, and the minimization of women in your comment kind of sucks. Some of your comment implies that you believe women are so dumb/simple that a few sessions of knitting will heal our multi-layered, nuanced health issues. And what kind of recovery center are you at where arts and crafts are the main mode of treatment??",
      "created_utc": 1746281236.0,
      "score": 28,
      "context": [
        {
          "id": "mqbkxye",
          "author": "helianthus_0",
          "body": "Not sure how hot this is but males should have separate ED treatment facilities. From what I’ve read, so many males are uncomfortable in treatment centers because they’re often the only male, the other clients are talking about things like their periods (or lack thereof), or other clients are talking about distrusting men due to past trauma. Males also tend to experience EDs differently, such as wanting to bulk up instead of slim down. Also, so many treatment centers are geared towards females with female-focused language, programming, etc. \n\nNot particularly hot but we need non-profit treatment centers and treatment centers that cater to people on the autism spectrum",
          "created_utc": 1746246620.0
        },
        {
          "id": "mqcoasd",
          "author": "BigGainsBigBoobs",
          "body": "I agree with this to an extend, I'm myself in 24/7 treatment facility. Only male here, I can't say much about what the women talk about because they literally don't talk (i think it's cuz they maybe don't really have the power to and is scared to talk to me cuz I am a male???) but one thing I can say is I feel like that the treatment is kind of targeted or made in a way that applies best to women(I know this is kind of stereotypical) , but such as arts and crafts and this very calming kind of mindset they want us to get into whereas I think me and a lot of men would benefit more from getting into that drive/motivational kind of state and mindset. I really do think there is other better things for me and a lot of other men than sitting and building puzzles and knitting..",
          "created_utc": 1746269844.0
        }
      ]
    },
    {
      "id": "mqboca9",
      "author": "WhichAmphibian3152",
      "body": "Same here. I didn't even know about pro ana when I became anorexic and when I found out about it I found it really upsetting.",
      "created_utc": 1746248344.0,
      "score": 10,
      "context": [
        {
          "id": "mqbkjq8",
          "author": "-aquapixie-",
          "body": "Ooh I got a spicy one.\n\nWe're all secretly ProAna when it comes to ourselves. We've all used thinspo, tips and tricks, mantras, buzzwords, as a method of reinforcing the eating disorder behaviours within ourselves. (And strengthening its control.)\n\nEven if we publicly condemn actions within the community, all of us have at least once in our life, used a thinspo pic or a mantra or a trick we read off the internet. All of which is inherently ProAna, whether it's labelled that or not.",
          "created_utc": 1746246426.0
        },
        {
          "id": "mqblv62",
          "author": "marshmallo_floof",
          "body": "Nah, as someone who developed anorexia without influence from the internet I feel so detached from the proana stuff and frankly speaking rather corny/cringe and almost insulting to me",
          "created_utc": 1746247078.0
        }
      ]
    },
    {
      "id": "mqxqwvj",
      "author": "Nia_KR",
      "body": "Ive seen so many people be angry if you claim full recovery isn’t possible so idk 😭",
      "created_utc": 1746559200.0,
      "score": 1,
      "context": [
        {
          "id": "mqfw899",
          "author": "Nia_KR",
          "body": "I don’t think anybody recovers from an ed in the sense that it goes away for good. if you develop an ed you have an ed forever, you can get better and the thoughts can become significantly quieter or even go away completely (until something triggers it again), but you’re never not anorexic anymore, because it’s a mental illness. just like you can’t fully “recover” from bipolar or depression or any other mental illness, you just get better at dealing with it. and that’s ok",
          "created_utc": 1746309577.0
        },
        {
          "id": "mqtjb9n",
          "author": "Important-Media1349",
          "body": "I fully agree to the point that I don’t think this is even a hot take I feel like everyone who’s ever had an ed probably agrees with you. The crazy behaviours are gone but the thoughts are very much still here",
          "created_utc": 1746498790.0
        }
      ]
    },
    {
      "id": "mqxxtfr",
      "author": "slynne28",
      "body": "Exactly. This is not me saying recovery isn't worth it, but for sure, ED is a coping strategy. The odd thing is that I had plenty of things I enjoyed before my ED that helped me cope, which I stopped doing. For example, I love to draw and didn't pick up a pencil for months on end. I like swimming, baking, reading, and learning musical instruments, but didn't do any of this when sick. \n\nThe ED really doesn't get rid of anxiety and difficulty, it postpones it or distracts from it.",
      "created_utc": 1746561190.0,
      "score": 2,
      "context": [
        {
          "id": "mqf81kj",
          "author": "slynne28",
          "body": "Recovery means you actually have to deal with all the other crap, anger and trauma the eating disorder masked. At least in a day with AN, I knew what I had to focus on.",
          "created_utc": 1746301486.0
        },
        {
          "id": "mqvo8f6",
          "author": "sociallyawkward_teen",
          "body": "Yes!! I’ve noticed that I fall back into the ed because I liked having a goal. I liked waking up feeling proud of or motivated by the numbers changing on the scale. Having everything be the same, or even in an upward trend each day during recovery made me realize I don’t know my hobbies, I have to actually cope with difficult emotions, etc.",
          "created_utc": 1746537331.0
        }
      ]
    },
    {
      "id": "mqdx1s6",
      "author": "turnipkitty112",
      "body": "I know you can get sectioned for many reasons. And, like I said, *assuming basic decision making capacity*. I understand if someone is at imminent risk of death, and I understand other situations like severe self injury, suicidality, mania, psychosis etc. \n\nThis was “unhinged ED hot takes” for a reason. People have been “encouraging me to reconsider” for years. I’ve *been* sectioned, I’ve been force fed, multiple times, I’ve been coerced and pressured into treatment. It made me sicker, because I wasn’t ready. It almost killed me. \n\nNow, I have a wonderful therapist and family physician who work with me from a harm reduction perspective, who don’t try to threaten or scare me into treatment. They meet me where I’m at and for the first time in years I have actually found the genuine motivation to try and make changes, because I WANT to live a better quality of life. That’s something that forced treatment never did for me. I’m well informed of the risks and medical complications that can/will arise from an untreated ED. But it is my firm belief that for sound-minded, informed adults - especially those who have been ill many years - it is their choice to recover or not, or to pursue harm reduction. You can, in some cases, force someone to weight restore but you cannot force someone’s mind to heal.",
      "created_utc": 1746286773.0,
      "score": 7,
      "context": [
        {
          "id": "mqde8zk",
          "author": "turnipkitty112",
          "body": "It’s ok for people to not want to recover, not pursue recovery, and actively choose to remain sick. People shouldn’t be forced into treatment, assuming they have the most basic decision making capacity. Choosing to remain sick isn’t a bad or wrong choice, even if that choice is a direct result of the ED itself. \n\nOf course I want recovery for everyone (except maybe myself lol) and that would be the ideal scenario but some ppl aren’t capable of it at the moment, aren’t ready, or don’t want to and *that’s fine*. Professionals refusing to work with someone who isn’t willing to recover/go to a higher level of care/sign a contract is unethical and causes more harm. Threatening people into recovery doesn’t work. \n\nNo one wants to admit it, but oftentimes the ED is serving a function and, as a coping strategy or protective thing, it WORKS. There are downsides, yes, but forcing someone to give up ED behaviours that may be keeping them safe in other ways is cruel. Virtually everyone has harmful and negative coping mechanisms, whether that is alcohol/substances, relationship issues, overeating, isolation, overworking, self harm, whatever. No one coerces them into giving those things up or tells them they’re just delusional and incapable of making decisions… until it’s a restrictive ED.",
          "created_utc": 1746280723.0
        },
        {
          "id": "mqdhflq",
          "author": "being-weird",
          "body": "Uh you can actually get sectioned for a whole bunch of reasons, and EDs have the highest mortality rate of any mental Illness. If you're choosing to stay sick I would seriously recommend you reconsider",
          "created_utc": 1746281794.0
        }
      ]
    },
    {
      "id": "mqimltn",
      "author": "Ok_Dragonfly7683108",
      "body": "Same. It feels (to me) like a slow retreat rather than a sudden one. After I got a handle on my >!suicidal ideation!< switching that energy to an ed felt like the goal felt vaguely the same but with an (socially acceptable) aesthetic to it (“wow! You look great! You’ve lost so much weight”) and some general life benefits (discipline, focus etc) before it got too bleak",
      "created_utc": 1746356200.0,
      "score": 2,
      "context": [
        {
          "id": "mqfpaxe",
          "author": "Fluttery_Soul",
          "body": "Dont cancel me guys\n\n\nMy hot take is that being anorexic and slowly dying is better than committing s*icide. Not better for the anorexic person ofc lol but better for their family bc they should be grateful that the person is even still alive",
          "created_utc": 1746307167.0
        },
        {
          "id": "mqhv483",
          "author": "Proper_Salamander_84",
          "body": "This. I relate.",
          "created_utc": 1746339462.0
        }
      ]
    },
    {
      "id": "mqde59j",
      "author": "biggestballzzz",
      "body": "how is it reasonably accurate for most of the population when it’s data was gathered from european men??",
      "created_utc": 1746280688.0,
      "score": 6,
      "context": [
        {
          "id": "mqbjqf7",
          "author": "Thick_Reaction_9887",
          "body": "This generally applies to the majority of mental health issues and disorders but I firmly attest to the belief that eds are heavily misunderstood and the categories are really rigid and outdated. The diagnosis criteria is incredible invalidating for the majority of people with genuine eds and there are way too many factors playing into an individuals life that lead them to not falling into that very specific criteria. The majority of people, for example, with anorexia, fall into the \"atypical\" category specifically because of their bmi even though most doctors acknowledge that bmi is fucking arbitrary and health issues as a result from eds happen at ALL weights/bmi categories. \nI understand why these criteria were made, but eds are much too prevalent to invalidate a person who definitely has issues when these disorders often feed off of not feeling sick enough. It's a hell of a lot easier to prevent things from getting worse and validate each other for our struggles as they are than it is to keep seeing people suffer and give each other imposter's syndrome.",
          "created_utc": 1746246025.0
        },
        {
          "id": "mqc5mit",
          "author": "Itscatpicstime",
          "body": "BMI is reasonably accurate for most of the population - it is absolutely not arbitrary.\n\nBut yes, ana subtypes should be defined by the behaviors and thought processes involved, not the results. And it’s crazy how the psych and medical field doesn’t understand how harmful this can be, especially for a community that is notable for being and feeling “competitive” in their illness.",
          "created_utc": 1746258352.0
        }
      ]
    },
    {
      "id": "mqglk8w",
      "author": "FiannaNevra",
      "body": "Same! I was so annoyed when the internet shut them down, yet people like Andrew Tate and other misogynistic platforms are still allowed",
      "created_utc": 1746319046.0,
      "score": 8,
      "context": [
        {
          "id": "mqbumua",
          "author": "FiannaNevra",
          "body": "I loved the pro Ana and Mia forums online",
          "created_utc": 1746251774.0
        },
        {
          "id": "mqdd6ml",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1746280357.0
        }
      ]
    },
    {
      "id": "mqhsmz9",
      "author": "Old-Garden-9435",
      "body": "Did it???",
      "created_utc": 1746338049.0,
      "score": 2,
      "context": [
        {
          "id": "mqbumua",
          "author": "FiannaNevra",
          "body": "I loved the pro Ana and Mia forums online",
          "created_utc": 1746251774.0
        },
        {
          "id": "mqdd6ml",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1746280357.0
        }
      ]
    },
    {
      "id": "mr80tgn",
      "author": "Anxious_Lake_5566",
      "body": "All very good and very interesting takes! Very interesting!",
      "created_utc": 1746700993.0,
      "score": 1,
      "context": [
        {
          "id": "mqlflyc",
          "author": "Anxious_Lake_5566",
          "body": "I see a lot of these aren’t hot takes. Here is a really flammable take: I have not met an anorexic without discipline. It takes discipline to be anorexic. \n\nI also doubt that you ever fully really recover without that little voice in your head that would for example be happy after noticing collar bones that appeared after a long stomach bug or something. \n\nI never fell deep in the pits of an eating disorder I think partly because I am naturally thin, but I also never swam really to the shore - I could not enjoy either of my pregnancies because I saw myself as disfigured. I wish more people mentioned what a trigger pregnancy is.",
          "created_utc": 1746390582.0
        },
        {
          "id": "mr7b3lu",
          "author": "carotenemia",
          "body": "I have been an undisciplined anorexic! Beyond undisciplined, completely disastrous, even long before I ever started binging, or, subsequently, purging. I think it requires discipline to be a certain kind of anorexic. someone who like, leans ortho. but eating in a redundant, extreme deficit was very easy, just ride out the inertia. I ate a lot of oatmeal and chewed a lot of gum, drank a lot of monster. Eat (insert number) of quest bars a day, rinse/repeat, requires so much less discipline than eating like a normal human being. Much, much easier than trying to eat enough, but not too much, get the right macros, etc. etc. and eating different shit all the time, instead of the same shit over and over.\n\nMy flammable take is: \n\nThere is such a thing at being “good” and “bad” at an eating disorder. I, personally, was ok at orthorexia, good at anorexia, then bad, then very very good, then, briefly, bad again, then absolutely godly at bulimia, could win some sort of award or something. Guinness book. Of course it’s not *a good thing* to be good at an eating disorder. It’s fucked. But I think, like other people in this thread have said, some people (not all, and I wasn’t one of them) sort of do choose to peruse anorexia specifically, and a lack of success can be disuasive. I think there is such a thing as like, acute adolescent anorexia (or other restrictive ed) that only lasts around a year, and it is p different from chronic or persistent anorexia. (This also speaks to what you said abt the little voice, I think the former can recover without it, but for the latter it’s calcified as a part of who you are as a person, it just gets louder or quieter) \n\nAlso BED prob, atp, has a higher mortality rate from complications than AN, it’s just way, way underdiagnosed, as binge eating and compulsive overeating is more culturally normalized than starving oneself.",
          "created_utc": 1746685350.0
        }
      ]
    },
    {
      "id": "mqh9dzf",
      "author": "TroubledGirl_",
      "body": "Not exactly. ARFID is a phobia, anorexia fo4 me what a choice. I had a phobia of foods being poisoned, choking, etc as well as general pick eating (also a symptom of ARFID and SED which I also struggled with). As I starved myself on purpose to become thin, as my body began staving I suddenly lost those ohobias (instead just worried about weight) and finally wanted to try foods I had never had before due to my phobias, fears, etc. And eventually I did (then I went into anorexia recovery)",
      "created_utc": 1746328602.0,
      "score": 1,
      "context": [
        {
          "id": "mqfj10z",
          "author": "TroubledGirl_",
          "body": "My own hot take.... my Anorexia cured my AFRID and kept me from cutting myself",
          "created_utc": 1746305097.0
        },
        {
          "id": "mqglwj5",
          "author": "BasOutten",
          "body": "What. Arfid results in not eating anorexia results in not eating. It's different routes to the same place!",
          "created_utc": 1746319178.0
        }
      ]
    },
    {
      "id": "mqdk2e8",
      "author": "BasOutten",
      "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
      "created_utc": 1746282657.0,
      "score": 4,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        }
      ]
    },
    {
      "id": "mqhjhuu",
      "author": "Fluttery_Soul",
      "body": "Oh I mean diet wise. I used to eat only junk food and never eat vegetables or fruits ever. Now, I eat 90% whole foods and I no longer have nutrient deficiencies like I used to before my ed.\n\n\nSocial and mental health wise, that remains shit 😅",
      "created_utc": 1746333255.0,
      "score": 4,
      "context": [
        {
          "id": "mqfpno4",
          "author": "Fluttery_Soul",
          "body": "I am healthier now than before my ED",
          "created_utc": 1746307286.0
        },
        {
          "id": "mqhej5f",
          "author": "Ashamed_Ad8162",
          "body": "But what is healthy in that context? \n\nMental health, physical health, and social health all matter\n\nOr do you just mean you meet the white, thin, female ideal of health?",
          "created_utc": 1746330917.0
        }
      ]
    },
    {
      "id": "mqbrc79",
      "author": "biggestballzzz",
      "body": "yeah this is straight up promotion of restrictive eds",
      "created_utc": 1746249940.0,
      "score": 9,
      "context": [
        {
          "id": "mqbimqd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746245499.0
        },
        {
          "id": "mqbp6u6",
          "author": "Ashamed_Ad8162",
          "body": "This isn’t unhinged, it’s just icky. You can suffer with an ED at any weight, and advocating for someone to have this cruel disorder is not okay, even if you aren’t serious :/",
          "created_utc": 1746248785.0
        }
      ]
    },
    {
      "id": "mqbqqxw",
      "author": "Eh_Alright___",
      "body": "Porque no los dos?",
      "created_utc": 1746249619.0,
      "score": -8,
      "context": [
        {
          "id": "mqbimqd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746245499.0
        },
        {
          "id": "mqboikt",
          "author": "biggestballzzz",
          "body": "ummm whaaaaaa…… we asked for unhinged not disordered",
          "created_utc": 1746248435.0
        }
      ]
    },
    {
      "id": "mqdkxi6",
      "author": "anastasia_42",
      "body": "They asked for a hot take and that's mine 🤷‍♀️ Im not saying they don't have a disorder at all btw but I don't think it's anorexia.",
      "created_utc": 1746282936.0,
      "score": -1,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqddule",
          "author": "biggestballzzz",
          "body": "ooooof okay let’s also not invalidate actual diagnoses either pls",
          "created_utc": 1746280586.0
        }
      ]
    },
    {
      "id": "mqgmg08",
      "author": "BasOutten",
      "body": "> To be diagnosed with anorexia nervosa (AN) according to the DSM-5 TR, the following criteria must be met: Restriction of energy intake relative to requirements *leading to a significantly low body weight* in the context of age, sex, developmental trajectory, and physical health.\n\nThe viewpoint of the DSM 5 is that a healthcare provider should only intervene with a diagnosis when harm is occurring; when the disorder has progressed to the point of malnutrition.\n\nThis has a good side and a bad side.",
      "created_utc": 1746319386.0,
      "score": 0,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqddule",
          "author": "biggestballzzz",
          "body": "ooooof okay let’s also not invalidate actual diagnoses either pls",
          "created_utc": 1746280586.0
        }
      ]
    },
    {
      "id": "mqdlm07",
      "author": "anastasia_42",
      "body": "I actually will look into them, thank you. Personally, I say this from the standpoint that anorexia usually has very visible symptoms.. skinniness, exposed bones, thinning hair etc. And so I think it goes completely against the idea of \"anorexia\" to say that you can be overweight and anorexic (ie. Atypical anorexia). However, I do 100% that those people have eating disorders as well, just not specifically anorexia.",
      "created_utc": 1746283156.0,
      "score": -5,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqdhucm",
          "author": "Ashamed_Ad8162",
          "body": "The current research does not agree with you on this one— the HAES book and Sick Enough address this in a really understandable way. Highly recommended looking into them!",
          "created_utc": 1746281930.0
        }
      ]
    },
    {
      "id": "mqgrpol",
      "author": "SquareWalk6730",
      "body": "Lmao, I did a project in highschool for anatomy class about a particular party drug. The more research I did on it, all it did was make me want to do it. The point of the project was drug prevention. I did, in fact, do the drug a lot later in my early 20's. (I also used it to stay skinny without thinking about it or on purpose). \n\nThis disorder Is so strange.",
      "created_utc": 1746321450.0,
      "score": 9,
      "context": [
        {
          "id": "mqbpa06",
          "author": "toritxtornado",
          "body": "i actually chose to have anorexia…i just didn’t know how bad it would get",
          "created_utc": 1746248831.0
        },
        {
          "id": "mqg427k",
          "author": "SquareWalk6730",
          "body": "Sadly, a majority chose the disorder in an effort to be thin. \n\nI'm 31, but when I was like 10-11, I watched a documentary on YouTube about children with anorexia. Then binge watched a few more documentries on anorexia. That was the day I attempted restricting for the first time. (Also, holy crap it's hard to believe YouTube has been around that long.)",
          "created_utc": 1746312463.0
        },
        {
          "id": "mqg5mur",
          "author": "toritxtornado",
          "body": "yeah i saw a video in health about anorexic lexi and was like yup that’s a good idea 🤦🏻‍♀️",
          "created_utc": 1746313047.0
        }
      ]
    },
    {
      "id": "mqtjlbh",
      "author": "Important-Media1349",
      "body": "Very much so - I have to admit I do miss it sometimes - I still have terrible issues with self esteem and validation and there are some core memories I had in relation to that when I was at my worst. Genuinely meaningless stories to anyone that isn’t me but I won’t ever forget them",
      "created_utc": 1746498889.0,
      "score": 2,
      "context": [
        {
          "id": "mqbm0c8",
          "author": "kizzletizzleizzle",
          "body": "mine is i miss my eating disorder self a lot but i know i shouldn’t",
          "created_utc": 1746247150.0
        },
        {
          "id": "mqthfak",
          "author": "Important-Media1349",
          "body": "I’ve been in recovery for 2 years with only 2 brief relapses both caused by Snapchat flashbacks from 2-3 years ago. I’ve started to remember the bad more than the good which has prevented it since I feel",
          "created_utc": 1746498102.0
        },
        {
          "id": "mqtita0",
          "author": "kizzletizzleizzle",
          "body": "same, the more i reflect the more i realize i just wish i had more control over my life right now and i don’t actually miss being sick bc it was hell and i worked so hard to get better. it’s a tricky head space to be in though",
          "created_utc": 1746498608.0
        }
      ]
    },
    {
      "id": "mqdze04",
      "author": "RedDitRXIXXII",
      "body": "You're strong enough to get through this. Trust me - it's better on the other side of an ed. 🤍",
      "created_utc": 1746287499.0,
      "score": 6,
      "context": [
        {
          "id": "mqbuv6v",
          "author": "BallAffectionate4000",
          "body": "Now that I’m recovered and overweight, I miss being anorexic. Even though back then I was miserable and suicidal, I still have that ‘ana voice’ telling me I’d be happier if I was skinny again.",
          "created_utc": 1746251905.0
        },
        {
          "id": "mqc8kzr",
          "author": "Far-Lavishness-6519",
          "body": "This is my only reason i don't try to recover sigh 😞",
          "created_utc": 1746260190.0
        },
        {
          "id": "mqd7lku",
          "author": "modernhate",
          "body": "It’s why I’m still stuck in my current relapse and is so afraid to reach out for help even though I have a mental breakdown near everyday at this point, suicidal as fuck and just overall miserable but ✨skinni ✨",
          "created_utc": 1746278362.0
        }
      ]
    },
    {
      "id": "mqjr63o",
      "author": "Ishouldntbleftlone",
      "body": "Many times lots of bills they find nothing",
      "created_utc": 1746371962.0,
      "score": 2,
      "context": [
        {
          "id": "mqcmjz5",
          "author": "jcb300012",
          "body": "people don't mention the other side-effects. you don't just get skinny and underweight, you don't just become weak. you can die, your heart can literally just stop. your organs can give up. so many other things can happen, it should be talked about more",
          "created_utc": 1746268905.0
        },
        {
          "id": "mqf458j",
          "author": "Ishouldntbleftlone",
          "body": "I can’t feel the right side of my body anymore it’s been 6 years",
          "created_utc": 1746300176.0
        },
        {
          "id": "mqj6jlv",
          "author": "jcb300012",
          "body": "have you gone to see somebody?",
          "created_utc": 1746365143.0
        }
      ]
    },
    {
      "id": "mqfidt5",
      "author": "Skylaa_11",
      "body": "Hi, I’m a 16 year old girl and on Monday an eating disorder center is calling my parents to see what kind of treatment I would like to do. One is fbt and basically all about weight restoration and parents in full control. The other one is CBT and takes longer but goes more in depth about thoughts and is with a private psychologist. I definitely think the other one would be better, but I don’t actually want to do any of them. I just know it will be so much work and lists/schedules that have to do with eating. And I also don’t want to because I’m starting in a new school in August and just want a fresh start, nothing to do with the ed center, because it has just been bad so far. But I don’t know how to tell my parents that I don’t want to pursue any of their treatments. I’m scared they will get mad at me and force me. Also I have taken blood tests and heart monitor tests, which have been completely fine, my weigh is just a little low. Do you have any recommendations on how I could tell my parents I don’t feel comfortable at all doing the treatment?",
      "created_utc": 1746304888.0,
      "score": 1,
      "context": [
        {
          "id": "mqde8zk",
          "author": "turnipkitty112",
          "body": "It’s ok for people to not want to recover, not pursue recovery, and actively choose to remain sick. People shouldn’t be forced into treatment, assuming they have the most basic decision making capacity. Choosing to remain sick isn’t a bad or wrong choice, even if that choice is a direct result of the ED itself. \n\nOf course I want recovery for everyone (except maybe myself lol) and that would be the ideal scenario but some ppl aren’t capable of it at the moment, aren’t ready, or don’t want to and *that’s fine*. Professionals refusing to work with someone who isn’t willing to recover/go to a higher level of care/sign a contract is unethical and causes more harm. Threatening people into recovery doesn’t work. \n\nNo one wants to admit it, but oftentimes the ED is serving a function and, as a coping strategy or protective thing, it WORKS. There are downsides, yes, but forcing someone to give up ED behaviours that may be keeping them safe in other ways is cruel. Virtually everyone has harmful and negative coping mechanisms, whether that is alcohol/substances, relationship issues, overeating, isolation, overworking, self harm, whatever. No one coerces them into giving those things up or tells them they’re just delusional and incapable of making decisions… until it’s a restrictive ED.",
          "created_utc": 1746280723.0
        },
        {
          "id": "mqdhflq",
          "author": "being-weird",
          "body": "Uh you can actually get sectioned for a whole bunch of reasons, and EDs have the highest mortality rate of any mental Illness. If you're choosing to stay sick I would seriously recommend you reconsider",
          "created_utc": 1746281794.0
        },
        {
          "id": "mqdx1s6",
          "author": "turnipkitty112",
          "body": "I know you can get sectioned for many reasons. And, like I said, *assuming basic decision making capacity*. I understand if someone is at imminent risk of death, and I understand other situations like severe self injury, suicidality, mania, psychosis etc. \n\nThis was “unhinged ED hot takes” for a reason. People have been “encouraging me to reconsider” for years. I’ve *been* sectioned, I’ve been force fed, multiple times, I’ve been coerced and pressured into treatment. It made me sicker, because I wasn’t ready. It almost killed me. \n\nNow, I have a wonderful therapist and family physician who work with me from a harm reduction perspective, who don’t try to threaten or scare me into treatment. They meet me where I’m at and for the first time in years I have actually found the genuine motivation to try and make changes, because I WANT to live a better quality of life. That’s something that forced treatment never did for me. I’m well informed of the risks and medical complications that can/will arise from an untreated ED. But it is my firm belief that for sound-minded, informed adults - especially those who have been ill many years - it is their choice to recover or not, or to pursue harm reduction. You can, in some cases, force someone to weight restore but you cannot force someone’s mind to heal.",
          "created_utc": 1746286773.0
        }
      ]
    },
    {
      "id": "mqdg3bj",
      "author": "being-weird",
      "body": "And it wasn't even created by a doctor. It was created by a statistician",
      "created_utc": 1746281348.0,
      "score": 8,
      "context": [
        {
          "id": "mqbjqf7",
          "author": "Thick_Reaction_9887",
          "body": "This generally applies to the majority of mental health issues and disorders but I firmly attest to the belief that eds are heavily misunderstood and the categories are really rigid and outdated. The diagnosis criteria is incredible invalidating for the majority of people with genuine eds and there are way too many factors playing into an individuals life that lead them to not falling into that very specific criteria. The majority of people, for example, with anorexia, fall into the \"atypical\" category specifically because of their bmi even though most doctors acknowledge that bmi is fucking arbitrary and health issues as a result from eds happen at ALL weights/bmi categories. \nI understand why these criteria were made, but eds are much too prevalent to invalidate a person who definitely has issues when these disorders often feed off of not feeling sick enough. It's a hell of a lot easier to prevent things from getting worse and validate each other for our struggles as they are than it is to keep seeing people suffer and give each other imposter's syndrome.",
          "created_utc": 1746246025.0
        },
        {
          "id": "mqc5mit",
          "author": "Itscatpicstime",
          "body": "BMI is reasonably accurate for most of the population - it is absolutely not arbitrary.\n\nBut yes, ana subtypes should be defined by the behaviors and thought processes involved, not the results. And it’s crazy how the psych and medical field doesn’t understand how harmful this can be, especially for a community that is notable for being and feeling “competitive” in their illness.",
          "created_utc": 1746258352.0
        },
        {
          "id": "mqde59j",
          "author": "biggestballzzz",
          "body": "how is it reasonably accurate for most of the population when it’s data was gathered from european men??",
          "created_utc": 1746280688.0
        }
      ]
    },
    {
      "id": "mqgkwv6",
      "author": "BasOutten",
      "body": "And now we have versions for women.",
      "created_utc": 1746318798.0,
      "score": 0,
      "context": [
        {
          "id": "mqbjqf7",
          "author": "Thick_Reaction_9887",
          "body": "This generally applies to the majority of mental health issues and disorders but I firmly attest to the belief that eds are heavily misunderstood and the categories are really rigid and outdated. The diagnosis criteria is incredible invalidating for the majority of people with genuine eds and there are way too many factors playing into an individuals life that lead them to not falling into that very specific criteria. The majority of people, for example, with anorexia, fall into the \"atypical\" category specifically because of their bmi even though most doctors acknowledge that bmi is fucking arbitrary and health issues as a result from eds happen at ALL weights/bmi categories. \nI understand why these criteria were made, but eds are much too prevalent to invalidate a person who definitely has issues when these disorders often feed off of not feeling sick enough. It's a hell of a lot easier to prevent things from getting worse and validate each other for our struggles as they are than it is to keep seeing people suffer and give each other imposter's syndrome.",
          "created_utc": 1746246025.0
        },
        {
          "id": "mqc5mit",
          "author": "Itscatpicstime",
          "body": "BMI is reasonably accurate for most of the population - it is absolutely not arbitrary.\n\nBut yes, ana subtypes should be defined by the behaviors and thought processes involved, not the results. And it’s crazy how the psych and medical field doesn’t understand how harmful this can be, especially for a community that is notable for being and feeling “competitive” in their illness.",
          "created_utc": 1746258352.0
        },
        {
          "id": "mqde59j",
          "author": "biggestballzzz",
          "body": "how is it reasonably accurate for most of the population when it’s data was gathered from european men??",
          "created_utc": 1746280688.0
        }
      ]
    },
    {
      "id": "mqjh9mr",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1746368825.0,
      "score": 1,
      "context": [
        {
          "id": "mqbumua",
          "author": "FiannaNevra",
          "body": "I loved the pro Ana and Mia forums online",
          "created_utc": 1746251774.0
        },
        {
          "id": "mqdd6ml",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1746280357.0
        },
        {
          "id": "mqhsmz9",
          "author": "Old-Garden-9435",
          "body": "Did it???",
          "created_utc": 1746338049.0
        }
      ]
    },
    {
      "id": "mqn44t3",
      "author": "BasOutten",
      "body": "Arfid is not a phobia, it can be, but it is also extremely closely linked to Autism.",
      "created_utc": 1746411550.0,
      "score": 1,
      "context": [
        {
          "id": "mqfj10z",
          "author": "TroubledGirl_",
          "body": "My own hot take.... my Anorexia cured my AFRID and kept me from cutting myself",
          "created_utc": 1746305097.0
        },
        {
          "id": "mqglwj5",
          "author": "BasOutten",
          "body": "What. Arfid results in not eating anorexia results in not eating. It's different routes to the same place!",
          "created_utc": 1746319178.0
        },
        {
          "id": "mqh9dzf",
          "author": "TroubledGirl_",
          "body": "Not exactly. ARFID is a phobia, anorexia fo4 me what a choice. I had a phobia of foods being poisoned, choking, etc as well as general pick eating (also a symptom of ARFID and SED which I also struggled with). As I starved myself on purpose to become thin, as my body began staving I suddenly lost those ohobias (instead just worried about weight) and finally wanted to try foods I had never had before due to my phobias, fears, etc. And eventually I did (then I went into anorexia recovery)",
          "created_utc": 1746328602.0
        }
      ]
    },
    {
      "id": "mqgqivx",
      "author": "being-weird",
      "body": "This is supposed to be ed hot takes, not transphobia",
      "created_utc": 1746320983.0,
      "score": 3,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        }
      ]
    },
    {
      "id": "mqbr2um",
      "author": "biggestballzzz",
      "body": "porque this is not a pro ed space for you comment how you think overweight and obese people should develop restrictive eating disorders 😁😁",
      "created_utc": 1746249798.0,
      "score": 20,
      "context": [
        {
          "id": "mqbimqd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746245499.0
        },
        {
          "id": "mqboikt",
          "author": "biggestballzzz",
          "body": "ummm whaaaaaa…… we asked for unhinged not disordered",
          "created_utc": 1746248435.0
        },
        {
          "id": "mqbqqxw",
          "author": "Eh_Alright___",
          "body": "Porque no los dos?",
          "created_utc": 1746249619.0
        }
      ]
    },
    {
      "id": "mqehk4x",
      "author": "biggestballzzz",
      "body": "they asked for a hot take. not a disordered one. and regardless you just doubled down on the invalidation in this response. \n\nalso maybe, like, have some consideration for other people? this is a public platform for recovering from eating disorders. there are overweight people in the community. there are most likely overweight people interacting with this post. what you are saying is incredibly harmful, disrespectful, and ignorant. please keep it to yourself",
      "created_utc": 1746293108.0,
      "score": 6,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqddule",
          "author": "biggestballzzz",
          "body": "ooooof okay let’s also not invalidate actual diagnoses either pls",
          "created_utc": 1746280586.0
        },
        {
          "id": "mqdkxi6",
          "author": "anastasia_42",
          "body": "They asked for a hot take and that's mine 🤷‍♀️ Im not saying they don't have a disorder at all btw but I don't think it's anorexia.",
          "created_utc": 1746282936.0
        }
      ]
    },
    {
      "id": "mqe7ns2",
      "author": "Skythebluestars",
      "body": "Atypical anorexia is anorexia . Without being underweight. You have all the other criteria. An eating disorder is not a weight disorder. Its a mental illnes!",
      "created_utc": 1746290102.0,
      "score": 4,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqddule",
          "author": "biggestballzzz",
          "body": "ooooof okay let’s also not invalidate actual diagnoses either pls",
          "created_utc": 1746280586.0
        },
        {
          "id": "mqdkxi6",
          "author": "anastasia_42",
          "body": "They asked for a hot take and that's mine 🤷‍♀️ Im not saying they don't have a disorder at all btw but I don't think it's anorexia.",
          "created_utc": 1746282936.0
        }
      ]
    },
    {
      "id": "mqgy0fd",
      "author": "biggestballzzz",
      "body": "i’m so confused on why you brought this up and what point you’re trying to make. atypical anorexia is literally in the DSM-5 you dweeb 😭\n\n“Atypical anorexia nervosa – The individual meets the criteria for anorexia and has sustained significant weight loss as a result, but they remain within or above the weight range that is considered normal for their height and gender.”\n\nsource: https://www.mccallumplace.com/admissions/dsm-5-diagnostic-criteria/#:~:text=Atypical%20anorexia%20nervosa%20%E2%80%93%20The%20individual,for%20their%20height%20and%20gender.",
      "created_utc": 1746323934.0,
      "score": 5,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqddule",
          "author": "biggestballzzz",
          "body": "ooooof okay let’s also not invalidate actual diagnoses either pls",
          "created_utc": 1746280586.0
        },
        {
          "id": "mqgmg08",
          "author": "BasOutten",
          "body": "> To be diagnosed with anorexia nervosa (AN) according to the DSM-5 TR, the following criteria must be met: Restriction of energy intake relative to requirements *leading to a significantly low body weight* in the context of age, sex, developmental trajectory, and physical health.\n\nThe viewpoint of the DSM 5 is that a healthcare provider should only intervene with a diagnosis when harm is occurring; when the disorder has progressed to the point of malnutrition.\n\nThis has a good side and a bad side.",
          "created_utc": 1746319386.0
        }
      ]
    },
    {
      "id": "mqdmamp",
      "author": "Ashamed_Ad8162",
      "body": "If everyone ate exactly the same thing, and even exercised the same, their bodies wouldn’t look the same. There are so many factors at play. \n\nI say this all as someone who 100% believed what you are saying a while back, so I get where you are coming from :)",
      "created_utc": 1746283376.0,
      "score": 6,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqdhucm",
          "author": "Ashamed_Ad8162",
          "body": "The current research does not agree with you on this one— the HAES book and Sick Enough address this in a really understandable way. Highly recommended looking into them!",
          "created_utc": 1746281930.0
        },
        {
          "id": "mqdlm07",
          "author": "anastasia_42",
          "body": "I actually will look into them, thank you. Personally, I say this from the standpoint that anorexia usually has very visible symptoms.. skinniness, exposed bones, thinning hair etc. And so I think it goes completely against the idea of \"anorexia\" to say that you can be overweight and anorexic (ie. Atypical anorexia). However, I do 100% that those people have eating disorders as well, just not specifically anorexia.",
          "created_utc": 1746283156.0
        }
      ]
    },
    {
      "id": "mqgun37",
      "author": "toritxtornado",
      "body": "you aren’t the first one to mishear the diet coke diet as the coke diet 😂",
      "created_utc": 1746322609.0,
      "score": 7,
      "context": [
        {
          "id": "mqbpa06",
          "author": "toritxtornado",
          "body": "i actually chose to have anorexia…i just didn’t know how bad it would get",
          "created_utc": 1746248831.0
        },
        {
          "id": "mqg427k",
          "author": "SquareWalk6730",
          "body": "Sadly, a majority chose the disorder in an effort to be thin. \n\nI'm 31, but when I was like 10-11, I watched a documentary on YouTube about children with anorexia. Then binge watched a few more documentries on anorexia. That was the day I attempted restricting for the first time. (Also, holy crap it's hard to believe YouTube has been around that long.)",
          "created_utc": 1746312463.0
        },
        {
          "id": "mqg5mur",
          "author": "toritxtornado",
          "body": "yeah i saw a video in health about anorexic lexi and was like yup that’s a good idea 🤦🏻‍♀️",
          "created_utc": 1746313047.0
        },
        {
          "id": "mqgrpol",
          "author": "SquareWalk6730",
          "body": "Lmao, I did a project in highschool for anatomy class about a particular party drug. The more research I did on it, all it did was make me want to do it. The point of the project was drug prevention. I did, in fact, do the drug a lot later in my early 20's. (I also used it to stay skinny without thinking about it or on purpose). \n\nThis disorder Is so strange.",
          "created_utc": 1746321450.0
        }
      ]
    },
    {
      "id": "mqtju1a",
      "author": "kizzletizzleizzle",
      "body": "i get it- it’s nice to get the external validation from others when you reach those low points. i have photos from that time in my life that i don’t know of ill ever be able to delete for the same reasons",
      "created_utc": 1746498975.0,
      "score": 1,
      "context": [
        {
          "id": "mqbm0c8",
          "author": "kizzletizzleizzle",
          "body": "mine is i miss my eating disorder self a lot but i know i shouldn’t",
          "created_utc": 1746247150.0
        },
        {
          "id": "mqthfak",
          "author": "Important-Media1349",
          "body": "I’ve been in recovery for 2 years with only 2 brief relapses both caused by Snapchat flashbacks from 2-3 years ago. I’ve started to remember the bad more than the good which has prevented it since I feel",
          "created_utc": 1746498102.0
        },
        {
          "id": "mqtita0",
          "author": "kizzletizzleizzle",
          "body": "same, the more i reflect the more i realize i just wish i had more control over my life right now and i don’t actually miss being sick bc it was hell and i worked so hard to get better. it’s a tricky head space to be in though",
          "created_utc": 1746498608.0
        },
        {
          "id": "mqtjlbh",
          "author": "Important-Media1349",
          "body": "Very much so - I have to admit I do miss it sometimes - I still have terrible issues with self esteem and validation and there are some core memories I had in relation to that when I was at my worst. Genuinely meaningless stories to anyone that isn’t me but I won’t ever forget them",
          "created_utc": 1746498889.0
        }
      ]
    },
    {
      "id": "mqflzsh",
      "author": "turnipkitty112",
      "body": "If you are a minor, then things are kind of different. I will never tell a young person that it’s ok to not pursue treatment, and ultimately at that age it kind of isn’t up to you. I am personally not a fan of FBT because I had a negative experience, although I know it can work for some people. I doubt anything you say would convince your parents or team to just say “ok cool you can not do treatment, have a nice life”. You’re young, and chances are you haven’t had a long, enduring, entrenched illness so your chances of recovering and being able to live a full, happy, free life are better now. I advise you to really take this chance to give treatment your all and get this behind you. \n\nThat being said, it’s true that although, as a minor, they CAN make you gain weight and normalize your eating habits, only you can make the decision to commit to recovery and do the psychological work needed to truly get better. I can’t just tell you to do that, your team can’t make you, and it isn’t wrong to not want to recover. I’d argue that not wanting to recover is pretty normal, especially in the earlier years of illness. So, you’re kind of at a crossroads here. You’re probably going to have to do treatment of some kind whether you want to or not, but you can choose to get as much as you can out of that and really give it your best shot, or you can half-ass things and get through it without really giving recovery a chance. \n\nI’m sorry, I probably should have clarified in my original two comments that my stance on this is more so for adults. I don’t think forced treatment works, period, and I am not a fan of FBT… but I DO feel that family and the healthcare system have a responsibility to minors to try and help them get well even if they do not feel ready to.",
      "created_utc": 1746306063.0,
      "score": 3,
      "context": [
        {
          "id": "mqde8zk",
          "author": "turnipkitty112",
          "body": "It’s ok for people to not want to recover, not pursue recovery, and actively choose to remain sick. People shouldn’t be forced into treatment, assuming they have the most basic decision making capacity. Choosing to remain sick isn’t a bad or wrong choice, even if that choice is a direct result of the ED itself. \n\nOf course I want recovery for everyone (except maybe myself lol) and that would be the ideal scenario but some ppl aren’t capable of it at the moment, aren’t ready, or don’t want to and *that’s fine*. Professionals refusing to work with someone who isn’t willing to recover/go to a higher level of care/sign a contract is unethical and causes more harm. Threatening people into recovery doesn’t work. \n\nNo one wants to admit it, but oftentimes the ED is serving a function and, as a coping strategy or protective thing, it WORKS. There are downsides, yes, but forcing someone to give up ED behaviours that may be keeping them safe in other ways is cruel. Virtually everyone has harmful and negative coping mechanisms, whether that is alcohol/substances, relationship issues, overeating, isolation, overworking, self harm, whatever. No one coerces them into giving those things up or tells them they’re just delusional and incapable of making decisions… until it’s a restrictive ED.",
          "created_utc": 1746280723.0
        },
        {
          "id": "mqdhflq",
          "author": "being-weird",
          "body": "Uh you can actually get sectioned for a whole bunch of reasons, and EDs have the highest mortality rate of any mental Illness. If you're choosing to stay sick I would seriously recommend you reconsider",
          "created_utc": 1746281794.0
        },
        {
          "id": "mqdx1s6",
          "author": "turnipkitty112",
          "body": "I know you can get sectioned for many reasons. And, like I said, *assuming basic decision making capacity*. I understand if someone is at imminent risk of death, and I understand other situations like severe self injury, suicidality, mania, psychosis etc. \n\nThis was “unhinged ED hot takes” for a reason. People have been “encouraging me to reconsider” for years. I’ve *been* sectioned, I’ve been force fed, multiple times, I’ve been coerced and pressured into treatment. It made me sicker, because I wasn’t ready. It almost killed me. \n\nNow, I have a wonderful therapist and family physician who work with me from a harm reduction perspective, who don’t try to threaten or scare me into treatment. They meet me where I’m at and for the first time in years I have actually found the genuine motivation to try and make changes, because I WANT to live a better quality of life. That’s something that forced treatment never did for me. I’m well informed of the risks and medical complications that can/will arise from an untreated ED. But it is my firm belief that for sound-minded, informed adults - especially those who have been ill many years - it is their choice to recover or not, or to pursue harm reduction. You can, in some cases, force someone to weight restore but you cannot force someone’s mind to heal.",
          "created_utc": 1746286773.0
        },
        {
          "id": "mqfidt5",
          "author": "Skylaa_11",
          "body": "Hi, I’m a 16 year old girl and on Monday an eating disorder center is calling my parents to see what kind of treatment I would like to do. One is fbt and basically all about weight restoration and parents in full control. The other one is CBT and takes longer but goes more in depth about thoughts and is with a private psychologist. I definitely think the other one would be better, but I don’t actually want to do any of them. I just know it will be so much work and lists/schedules that have to do with eating. And I also don’t want to because I’m starting in a new school in August and just want a fresh start, nothing to do with the ed center, because it has just been bad so far. But I don’t know how to tell my parents that I don’t want to pursue any of their treatments. I’m scared they will get mad at me and force me. Also I have taken blood tests and heart monitor tests, which have been completely fine, my weigh is just a little low. Do you have any recommendations on how I could tell my parents I don’t feel comfortable at all doing the treatment?",
          "created_utc": 1746304888.0
        }
      ]
    },
    {
      "id": "mqgkv9m",
      "author": "BasOutten",
      "body": "Correct, it was developed by somebody whose job is to analyze thousands and thousands of people",
      "created_utc": 1746318781.0,
      "score": -1,
      "context": [
        {
          "id": "mqbjqf7",
          "author": "Thick_Reaction_9887",
          "body": "This generally applies to the majority of mental health issues and disorders but I firmly attest to the belief that eds are heavily misunderstood and the categories are really rigid and outdated. The diagnosis criteria is incredible invalidating for the majority of people with genuine eds and there are way too many factors playing into an individuals life that lead them to not falling into that very specific criteria. The majority of people, for example, with anorexia, fall into the \"atypical\" category specifically because of their bmi even though most doctors acknowledge that bmi is fucking arbitrary and health issues as a result from eds happen at ALL weights/bmi categories. \nI understand why these criteria were made, but eds are much too prevalent to invalidate a person who definitely has issues when these disorders often feed off of not feeling sick enough. It's a hell of a lot easier to prevent things from getting worse and validate each other for our struggles as they are than it is to keep seeing people suffer and give each other imposter's syndrome.",
          "created_utc": 1746246025.0
        },
        {
          "id": "mqc5mit",
          "author": "Itscatpicstime",
          "body": "BMI is reasonably accurate for most of the population - it is absolutely not arbitrary.\n\nBut yes, ana subtypes should be defined by the behaviors and thought processes involved, not the results. And it’s crazy how the psych and medical field doesn’t understand how harmful this can be, especially for a community that is notable for being and feeling “competitive” in their illness.",
          "created_utc": 1746258352.0
        },
        {
          "id": "mqde59j",
          "author": "biggestballzzz",
          "body": "how is it reasonably accurate for most of the population when it’s data was gathered from european men??",
          "created_utc": 1746280688.0
        },
        {
          "id": "mqdg3bj",
          "author": "being-weird",
          "body": "And it wasn't even created by a doctor. It was created by a statistician",
          "created_utc": 1746281348.0
        }
      ]
    },
    {
      "id": "mqgzcwa",
      "author": "biggestballzzz",
      "body": "what women? white women? black women? asian women? latina women??? our bodies are very different and trying to apply a universal standard is just not feasible",
      "created_utc": 1746324459.0,
      "score": 4,
      "context": [
        {
          "id": "mqbjqf7",
          "author": "Thick_Reaction_9887",
          "body": "This generally applies to the majority of mental health issues and disorders but I firmly attest to the belief that eds are heavily misunderstood and the categories are really rigid and outdated. The diagnosis criteria is incredible invalidating for the majority of people with genuine eds and there are way too many factors playing into an individuals life that lead them to not falling into that very specific criteria. The majority of people, for example, with anorexia, fall into the \"atypical\" category specifically because of their bmi even though most doctors acknowledge that bmi is fucking arbitrary and health issues as a result from eds happen at ALL weights/bmi categories. \nI understand why these criteria were made, but eds are much too prevalent to invalidate a person who definitely has issues when these disorders often feed off of not feeling sick enough. It's a hell of a lot easier to prevent things from getting worse and validate each other for our struggles as they are than it is to keep seeing people suffer and give each other imposter's syndrome.",
          "created_utc": 1746246025.0
        },
        {
          "id": "mqc5mit",
          "author": "Itscatpicstime",
          "body": "BMI is reasonably accurate for most of the population - it is absolutely not arbitrary.\n\nBut yes, ana subtypes should be defined by the behaviors and thought processes involved, not the results. And it’s crazy how the psych and medical field doesn’t understand how harmful this can be, especially for a community that is notable for being and feeling “competitive” in their illness.",
          "created_utc": 1746258352.0
        },
        {
          "id": "mqde59j",
          "author": "biggestballzzz",
          "body": "how is it reasonably accurate for most of the population when it’s data was gathered from european men??",
          "created_utc": 1746280688.0
        },
        {
          "id": "mqgkwv6",
          "author": "BasOutten",
          "body": "And now we have versions for women.",
          "created_utc": 1746318798.0
        }
      ]
    },
    {
      "id": "mqjhv7x",
      "author": "Old-Garden-9435",
      "body": "noooooooooooooo what:(",
      "created_utc": 1746369018.0,
      "score": 1,
      "context": [
        {
          "id": "mqbumua",
          "author": "FiannaNevra",
          "body": "I loved the pro Ana and Mia forums online",
          "created_utc": 1746251774.0
        },
        {
          "id": "mqdd6ml",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1746280357.0
        },
        {
          "id": "mqhsmz9",
          "author": "Old-Garden-9435",
          "body": "Did it???",
          "created_utc": 1746338049.0
        },
        {
          "id": "mqjh9mr",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1746368825.0
        }
      ]
    },
    {
      "id": "mqn6gwx",
      "author": "TroubledGirl_",
      "body": "Exactly. It can be. And for me it was. And I know the autism thing idk why you're bringing that up??? I'm autistic but not everyone with ARFID js and what's that gotta do with anorexia???",
      "created_utc": 1746412439.0,
      "score": 1,
      "context": [
        {
          "id": "mqfj10z",
          "author": "TroubledGirl_",
          "body": "My own hot take.... my Anorexia cured my AFRID and kept me from cutting myself",
          "created_utc": 1746305097.0
        },
        {
          "id": "mqglwj5",
          "author": "BasOutten",
          "body": "What. Arfid results in not eating anorexia results in not eating. It's different routes to the same place!",
          "created_utc": 1746319178.0
        },
        {
          "id": "mqh9dzf",
          "author": "TroubledGirl_",
          "body": "Not exactly. ARFID is a phobia, anorexia fo4 me what a choice. I had a phobia of foods being poisoned, choking, etc as well as general pick eating (also a symptom of ARFID and SED which I also struggled with). As I starved myself on purpose to become thin, as my body began staving I suddenly lost those ohobias (instead just worried about weight) and finally wanted to try foods I had never had before due to my phobias, fears, etc. And eventually I did (then I went into anorexia recovery)",
          "created_utc": 1746328602.0
        },
        {
          "id": "mqn44t3",
          "author": "BasOutten",
          "body": "Arfid is not a phobia, it can be, but it is also extremely closely linked to Autism.",
          "created_utc": 1746411550.0
        }
      ]
    },
    {
      "id": "mqn4jfb",
      "author": "BasOutten",
      "body": "Fallacy. Dismissal by labeling: Someone rejects an argument or criticism by slapping a label on it (like “-phobic” or “-ist”) rather than addressing its substance.\nExample: “You’re just being transphobic,” when the person raised a nuanced point about medical policy.",
      "created_utc": 1746411703.0,
      "score": 0,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        },
        {
          "id": "mqgqivx",
          "author": "being-weird",
          "body": "This is supposed to be ed hot takes, not transphobia",
          "created_utc": 1746320983.0
        }
      ]
    },
    {
      "id": "mqc5tzj",
      "author": "Itscatpicstime",
      "body": "Especially *recovered* anorexics too!",
      "created_utc": 1746258482.0,
      "score": 9,
      "context": [
        {
          "id": "mqbimqd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746245499.0
        },
        {
          "id": "mqboikt",
          "author": "biggestballzzz",
          "body": "ummm whaaaaaa…… we asked for unhinged not disordered",
          "created_utc": 1746248435.0
        },
        {
          "id": "mqbqqxw",
          "author": "Eh_Alright___",
          "body": "Porque no los dos?",
          "created_utc": 1746249619.0
        },
        {
          "id": "mqbr2um",
          "author": "biggestballzzz",
          "body": "porque this is not a pro ed space for you comment how you think overweight and obese people should develop restrictive eating disorders 😁😁",
          "created_utc": 1746249798.0
        }
      ]
    },
    {
      "id": "mqgn0nc",
      "author": "anastasia_42",
      "body": "I'm not gonna keep anything to myself. I haven't invalidated anyone and I've been respectful. My point is, being underweight is one of the core pillars of being anorexic. And so it doesn't make sense that overweight people can be considered anorexic. To the point, where they use another term in order for it to be considered anorexia (\"atypical\"). I'm not saying they don't have an eating disorder or eating issues that are similar. I'm merely saying that I don't think it can or should be considered anorexia. Either way, I hope everyone in this sub who is struggling with eating one day recovers.  Eating disorders are horrible for everyone - regardless of weight.",
      "created_utc": 1746319611.0,
      "score": -3,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqddule",
          "author": "biggestballzzz",
          "body": "ooooof okay let’s also not invalidate actual diagnoses either pls",
          "created_utc": 1746280586.0
        },
        {
          "id": "mqdkxi6",
          "author": "anastasia_42",
          "body": "They asked for a hot take and that's mine 🤷‍♀️ Im not saying they don't have a disorder at all btw but I don't think it's anorexia.",
          "created_utc": 1746282936.0
        },
        {
          "id": "mqehk4x",
          "author": "biggestballzzz",
          "body": "they asked for a hot take. not a disordered one. and regardless you just doubled down on the invalidation in this response. \n\nalso maybe, like, have some consideration for other people? this is a public platform for recovering from eating disorders. there are overweight people in the community. there are most likely overweight people interacting with this post. what you are saying is incredibly harmful, disrespectful, and ignorant. please keep it to yourself",
          "created_utc": 1746293108.0
        }
      ]
    },
    {
      "id": "mqgm6ld",
      "author": "anastasia_42",
      "body": "I'd say that being underweight is one of its core symptoms though. But either way, it's terrible to have",
      "created_utc": 1746319286.0,
      "score": -2,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqddule",
          "author": "biggestballzzz",
          "body": "ooooof okay let’s also not invalidate actual diagnoses either pls",
          "created_utc": 1746280586.0
        },
        {
          "id": "mqdkxi6",
          "author": "anastasia_42",
          "body": "They asked for a hot take and that's mine 🤷‍♀️ Im not saying they don't have a disorder at all btw but I don't think it's anorexia.",
          "created_utc": 1746282936.0
        },
        {
          "id": "mqe7ns2",
          "author": "Skythebluestars",
          "body": "Atypical anorexia is anorexia . Without being underweight. You have all the other criteria. An eating disorder is not a weight disorder. Its a mental illnes!",
          "created_utc": 1746290102.0
        }
      ]
    },
    {
      "id": "mqdn39i",
      "author": "anastasia_42",
      "body": "Thanks for being nice btw sometimes things like this can get heated so it's a nice change.\n\n\nBut yeah, I agree different factors influence weight.",
      "created_utc": 1746283630.0,
      "score": 5,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqdhucm",
          "author": "Ashamed_Ad8162",
          "body": "The current research does not agree with you on this one— the HAES book and Sick Enough address this in a really understandable way. Highly recommended looking into them!",
          "created_utc": 1746281930.0
        },
        {
          "id": "mqdlm07",
          "author": "anastasia_42",
          "body": "I actually will look into them, thank you. Personally, I say this from the standpoint that anorexia usually has very visible symptoms.. skinniness, exposed bones, thinning hair etc. And so I think it goes completely against the idea of \"anorexia\" to say that you can be overweight and anorexic (ie. Atypical anorexia). However, I do 100% that those people have eating disorders as well, just not specifically anorexia.",
          "created_utc": 1746283156.0
        },
        {
          "id": "mqdmamp",
          "author": "Ashamed_Ad8162",
          "body": "If everyone ate exactly the same thing, and even exercised the same, their bodies wouldn’t look the same. There are so many factors at play. \n\nI say this all as someone who 100% believed what you are saying a while back, so I get where you are coming from :)",
          "created_utc": 1746283376.0
        }
      ]
    },
    {
      "id": "mqgxsa7",
      "author": "SquareWalk6730",
      "body": "Oddly, I never used that one in particular to feed my eating disorder. \n\nBut my best friend was named Molly, and she and I used to go dancing every weekend or multiple times a week, for hours and hours. 😅",
      "created_utc": 1746323847.0,
      "score": 5,
      "context": [
        {
          "id": "mqbpa06",
          "author": "toritxtornado",
          "body": "i actually chose to have anorexia…i just didn’t know how bad it would get",
          "created_utc": 1746248831.0
        },
        {
          "id": "mqg427k",
          "author": "SquareWalk6730",
          "body": "Sadly, a majority chose the disorder in an effort to be thin. \n\nI'm 31, but when I was like 10-11, I watched a documentary on YouTube about children with anorexia. Then binge watched a few more documentries on anorexia. That was the day I attempted restricting for the first time. (Also, holy crap it's hard to believe YouTube has been around that long.)",
          "created_utc": 1746312463.0
        },
        {
          "id": "mqg5mur",
          "author": "toritxtornado",
          "body": "yeah i saw a video in health about anorexic lexi and was like yup that’s a good idea 🤦🏻‍♀️",
          "created_utc": 1746313047.0
        },
        {
          "id": "mqgrpol",
          "author": "SquareWalk6730",
          "body": "Lmao, I did a project in highschool for anatomy class about a particular party drug. The more research I did on it, all it did was make me want to do it. The point of the project was drug prevention. I did, in fact, do the drug a lot later in my early 20's. (I also used it to stay skinny without thinking about it or on purpose). \n\nThis disorder Is so strange.",
          "created_utc": 1746321450.0
        },
        {
          "id": "mqgun37",
          "author": "toritxtornado",
          "body": "you aren’t the first one to mishear the diet coke diet as the coke diet 😂",
          "created_utc": 1746322609.0
        }
      ]
    },
    {
      "id": "mqtok6q",
      "author": "Important-Media1349",
      "body": "Yeah I don’t think I will - it is a painful time remembering how big I felt then in boys large jeans. I’ve somehow become my own thinspo idek what’s happening anymore 😂",
      "created_utc": 1746500783.0,
      "score": 2,
      "context": [
        {
          "id": "mqbm0c8",
          "author": "kizzletizzleizzle",
          "body": "mine is i miss my eating disorder self a lot but i know i shouldn’t",
          "created_utc": 1746247150.0
        },
        {
          "id": "mqthfak",
          "author": "Important-Media1349",
          "body": "I’ve been in recovery for 2 years with only 2 brief relapses both caused by Snapchat flashbacks from 2-3 years ago. I’ve started to remember the bad more than the good which has prevented it since I feel",
          "created_utc": 1746498102.0
        },
        {
          "id": "mqtita0",
          "author": "kizzletizzleizzle",
          "body": "same, the more i reflect the more i realize i just wish i had more control over my life right now and i don’t actually miss being sick bc it was hell and i worked so hard to get better. it’s a tricky head space to be in though",
          "created_utc": 1746498608.0
        },
        {
          "id": "mqtjlbh",
          "author": "Important-Media1349",
          "body": "Very much so - I have to admit I do miss it sometimes - I still have terrible issues with self esteem and validation and there are some core memories I had in relation to that when I was at my worst. Genuinely meaningless stories to anyone that isn’t me but I won’t ever forget them",
          "created_utc": 1746498889.0
        },
        {
          "id": "mqtju1a",
          "author": "kizzletizzleizzle",
          "body": "i get it- it’s nice to get the external validation from others when you reach those low points. i have photos from that time in my life that i don’t know of ill ever be able to delete for the same reasons",
          "created_utc": 1746498975.0
        }
      ]
    },
    {
      "id": "mqg1m8m",
      "author": "Skylaa_11",
      "body": "Yeah, they probably won’t just let me go and will become even more concerned if I refuse treatment. I will go for the CBT, because then I don’t have to be home from school and can work more on the mental aspects.",
      "created_utc": 1746311553.0,
      "score": 4,
      "context": [
        {
          "id": "mqde8zk",
          "author": "turnipkitty112",
          "body": "It’s ok for people to not want to recover, not pursue recovery, and actively choose to remain sick. People shouldn’t be forced into treatment, assuming they have the most basic decision making capacity. Choosing to remain sick isn’t a bad or wrong choice, even if that choice is a direct result of the ED itself. \n\nOf course I want recovery for everyone (except maybe myself lol) and that would be the ideal scenario but some ppl aren’t capable of it at the moment, aren’t ready, or don’t want to and *that’s fine*. Professionals refusing to work with someone who isn’t willing to recover/go to a higher level of care/sign a contract is unethical and causes more harm. Threatening people into recovery doesn’t work. \n\nNo one wants to admit it, but oftentimes the ED is serving a function and, as a coping strategy or protective thing, it WORKS. There are downsides, yes, but forcing someone to give up ED behaviours that may be keeping them safe in other ways is cruel. Virtually everyone has harmful and negative coping mechanisms, whether that is alcohol/substances, relationship issues, overeating, isolation, overworking, self harm, whatever. No one coerces them into giving those things up or tells them they’re just delusional and incapable of making decisions… until it’s a restrictive ED.",
          "created_utc": 1746280723.0
        },
        {
          "id": "mqdhflq",
          "author": "being-weird",
          "body": "Uh you can actually get sectioned for a whole bunch of reasons, and EDs have the highest mortality rate of any mental Illness. If you're choosing to stay sick I would seriously recommend you reconsider",
          "created_utc": 1746281794.0
        },
        {
          "id": "mqdx1s6",
          "author": "turnipkitty112",
          "body": "I know you can get sectioned for many reasons. And, like I said, *assuming basic decision making capacity*. I understand if someone is at imminent risk of death, and I understand other situations like severe self injury, suicidality, mania, psychosis etc. \n\nThis was “unhinged ED hot takes” for a reason. People have been “encouraging me to reconsider” for years. I’ve *been* sectioned, I’ve been force fed, multiple times, I’ve been coerced and pressured into treatment. It made me sicker, because I wasn’t ready. It almost killed me. \n\nNow, I have a wonderful therapist and family physician who work with me from a harm reduction perspective, who don’t try to threaten or scare me into treatment. They meet me where I’m at and for the first time in years I have actually found the genuine motivation to try and make changes, because I WANT to live a better quality of life. That’s something that forced treatment never did for me. I’m well informed of the risks and medical complications that can/will arise from an untreated ED. But it is my firm belief that for sound-minded, informed adults - especially those who have been ill many years - it is their choice to recover or not, or to pursue harm reduction. You can, in some cases, force someone to weight restore but you cannot force someone’s mind to heal.",
          "created_utc": 1746286773.0
        },
        {
          "id": "mqfidt5",
          "author": "Skylaa_11",
          "body": "Hi, I’m a 16 year old girl and on Monday an eating disorder center is calling my parents to see what kind of treatment I would like to do. One is fbt and basically all about weight restoration and parents in full control. The other one is CBT and takes longer but goes more in depth about thoughts and is with a private psychologist. I definitely think the other one would be better, but I don’t actually want to do any of them. I just know it will be so much work and lists/schedules that have to do with eating. And I also don’t want to because I’m starting in a new school in August and just want a fresh start, nothing to do with the ed center, because it has just been bad so far. But I don’t know how to tell my parents that I don’t want to pursue any of their treatments. I’m scared they will get mad at me and force me. Also I have taken blood tests and heart monitor tests, which have been completely fine, my weigh is just a little low. Do you have any recommendations on how I could tell my parents I don’t feel comfortable at all doing the treatment?",
          "created_utc": 1746304888.0
        },
        {
          "id": "mqflzsh",
          "author": "turnipkitty112",
          "body": "If you are a minor, then things are kind of different. I will never tell a young person that it’s ok to not pursue treatment, and ultimately at that age it kind of isn’t up to you. I am personally not a fan of FBT because I had a negative experience, although I know it can work for some people. I doubt anything you say would convince your parents or team to just say “ok cool you can not do treatment, have a nice life”. You’re young, and chances are you haven’t had a long, enduring, entrenched illness so your chances of recovering and being able to live a full, happy, free life are better now. I advise you to really take this chance to give treatment your all and get this behind you. \n\nThat being said, it’s true that although, as a minor, they CAN make you gain weight and normalize your eating habits, only you can make the decision to commit to recovery and do the psychological work needed to truly get better. I can’t just tell you to do that, your team can’t make you, and it isn’t wrong to not want to recover. I’d argue that not wanting to recover is pretty normal, especially in the earlier years of illness. So, you’re kind of at a crossroads here. You’re probably going to have to do treatment of some kind whether you want to or not, but you can choose to get as much as you can out of that and really give it your best shot, or you can half-ass things and get through it without really giving recovery a chance. \n\nI’m sorry, I probably should have clarified in my original two comments that my stance on this is more so for adults. I don’t think forced treatment works, period, and I am not a fan of FBT… but I DO feel that family and the healthcare system have a responsibility to minors to try and help them get well even if they do not feel ready to.",
          "created_utc": 1746306063.0
        }
      ]
    },
    {
      "id": "mqp31ro",
      "author": "being-weird",
      "body": "If this person really wanted to learn how gender dysphoria works many people have answered this question better than I could. But they've clearly made up their mind in that regard and I'm not debating them, or you",
      "created_utc": 1746448192.0,
      "score": 1,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        },
        {
          "id": "mqgqivx",
          "author": "being-weird",
          "body": "This is supposed to be ed hot takes, not transphobia",
          "created_utc": 1746320983.0
        },
        {
          "id": "mqn4jfb",
          "author": "BasOutten",
          "body": "Fallacy. Dismissal by labeling: Someone rejects an argument or criticism by slapping a label on it (like “-phobic” or “-ist”) rather than addressing its substance.\nExample: “You’re just being transphobic,” when the person raised a nuanced point about medical policy.",
          "created_utc": 1746411703.0
        }
      ]
    },
    {
      "id": "mqgyppf",
      "author": "biggestballzzz",
      "body": "“i haven’t invalidated anyone” \n\n“you can’t be fat and anorexic”\n\natypical anorexia is recognized and has diagnosis criteria in the DSM-5 and just because you don’t feel that it should be considered anorexia, doesn’t mean that it’s not anorexia and perpetuating the idea that it’s not, on a PUBLIC EATING DISORDER FORUM with people of all shapes and sizes struggling, is incredibly invaliding and just plain honestly mean.",
      "created_utc": 1746324209.0,
      "score": 3,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqddule",
          "author": "biggestballzzz",
          "body": "ooooof okay let’s also not invalidate actual diagnoses either pls",
          "created_utc": 1746280586.0
        },
        {
          "id": "mqdkxi6",
          "author": "anastasia_42",
          "body": "They asked for a hot take and that's mine 🤷‍♀️ Im not saying they don't have a disorder at all btw but I don't think it's anorexia.",
          "created_utc": 1746282936.0
        },
        {
          "id": "mqehk4x",
          "author": "biggestballzzz",
          "body": "they asked for a hot take. not a disordered one. and regardless you just doubled down on the invalidation in this response. \n\nalso maybe, like, have some consideration for other people? this is a public platform for recovering from eating disorders. there are overweight people in the community. there are most likely overweight people interacting with this post. what you are saying is incredibly harmful, disrespectful, and ignorant. please keep it to yourself",
          "created_utc": 1746293108.0
        },
        {
          "id": "mqgn0nc",
          "author": "anastasia_42",
          "body": "I'm not gonna keep anything to myself. I haven't invalidated anyone and I've been respectful. My point is, being underweight is one of the core pillars of being anorexic. And so it doesn't make sense that overweight people can be considered anorexic. To the point, where they use another term in order for it to be considered anorexia (\"atypical\"). I'm not saying they don't have an eating disorder or eating issues that are similar. I'm merely saying that I don't think it can or should be considered anorexia. Either way, I hope everyone in this sub who is struggling with eating one day recovers.  Eating disorders are horrible for everyone - regardless of weight.",
          "created_utc": 1746319611.0
        }
      ]
    },
    {
      "id": "mqgkhks",
      "author": "Ashamed_Ad8162",
      "body": "FBT has the potential to destroy the relationship you have with your family. CBT, DBT, and ACT definitely have their pros for recovery in that regard.",
      "created_utc": 1746318630.0,
      "score": 3,
      "context": [
        {
          "id": "mqde8zk",
          "author": "turnipkitty112",
          "body": "It’s ok for people to not want to recover, not pursue recovery, and actively choose to remain sick. People shouldn’t be forced into treatment, assuming they have the most basic decision making capacity. Choosing to remain sick isn’t a bad or wrong choice, even if that choice is a direct result of the ED itself. \n\nOf course I want recovery for everyone (except maybe myself lol) and that would be the ideal scenario but some ppl aren’t capable of it at the moment, aren’t ready, or don’t want to and *that’s fine*. Professionals refusing to work with someone who isn’t willing to recover/go to a higher level of care/sign a contract is unethical and causes more harm. Threatening people into recovery doesn’t work. \n\nNo one wants to admit it, but oftentimes the ED is serving a function and, as a coping strategy or protective thing, it WORKS. There are downsides, yes, but forcing someone to give up ED behaviours that may be keeping them safe in other ways is cruel. Virtually everyone has harmful and negative coping mechanisms, whether that is alcohol/substances, relationship issues, overeating, isolation, overworking, self harm, whatever. No one coerces them into giving those things up or tells them they’re just delusional and incapable of making decisions… until it’s a restrictive ED.",
          "created_utc": 1746280723.0
        },
        {
          "id": "mqdhflq",
          "author": "being-weird",
          "body": "Uh you can actually get sectioned for a whole bunch of reasons, and EDs have the highest mortality rate of any mental Illness. If you're choosing to stay sick I would seriously recommend you reconsider",
          "created_utc": 1746281794.0
        },
        {
          "id": "mqdx1s6",
          "author": "turnipkitty112",
          "body": "I know you can get sectioned for many reasons. And, like I said, *assuming basic decision making capacity*. I understand if someone is at imminent risk of death, and I understand other situations like severe self injury, suicidality, mania, psychosis etc. \n\nThis was “unhinged ED hot takes” for a reason. People have been “encouraging me to reconsider” for years. I’ve *been* sectioned, I’ve been force fed, multiple times, I’ve been coerced and pressured into treatment. It made me sicker, because I wasn’t ready. It almost killed me. \n\nNow, I have a wonderful therapist and family physician who work with me from a harm reduction perspective, who don’t try to threaten or scare me into treatment. They meet me where I’m at and for the first time in years I have actually found the genuine motivation to try and make changes, because I WANT to live a better quality of life. That’s something that forced treatment never did for me. I’m well informed of the risks and medical complications that can/will arise from an untreated ED. But it is my firm belief that for sound-minded, informed adults - especially those who have been ill many years - it is their choice to recover or not, or to pursue harm reduction. You can, in some cases, force someone to weight restore but you cannot force someone’s mind to heal.",
          "created_utc": 1746286773.0
        },
        {
          "id": "mqfidt5",
          "author": "Skylaa_11",
          "body": "Hi, I’m a 16 year old girl and on Monday an eating disorder center is calling my parents to see what kind of treatment I would like to do. One is fbt and basically all about weight restoration and parents in full control. The other one is CBT and takes longer but goes more in depth about thoughts and is with a private psychologist. I definitely think the other one would be better, but I don’t actually want to do any of them. I just know it will be so much work and lists/schedules that have to do with eating. And I also don’t want to because I’m starting in a new school in August and just want a fresh start, nothing to do with the ed center, because it has just been bad so far. But I don’t know how to tell my parents that I don’t want to pursue any of their treatments. I’m scared they will get mad at me and force me. Also I have taken blood tests and heart monitor tests, which have been completely fine, my weigh is just a little low. Do you have any recommendations on how I could tell my parents I don’t feel comfortable at all doing the treatment?",
          "created_utc": 1746304888.0
        },
        {
          "id": "mqflzsh",
          "author": "turnipkitty112",
          "body": "If you are a minor, then things are kind of different. I will never tell a young person that it’s ok to not pursue treatment, and ultimately at that age it kind of isn’t up to you. I am personally not a fan of FBT because I had a negative experience, although I know it can work for some people. I doubt anything you say would convince your parents or team to just say “ok cool you can not do treatment, have a nice life”. You’re young, and chances are you haven’t had a long, enduring, entrenched illness so your chances of recovering and being able to live a full, happy, free life are better now. I advise you to really take this chance to give treatment your all and get this behind you. \n\nThat being said, it’s true that although, as a minor, they CAN make you gain weight and normalize your eating habits, only you can make the decision to commit to recovery and do the psychological work needed to truly get better. I can’t just tell you to do that, your team can’t make you, and it isn’t wrong to not want to recover. I’d argue that not wanting to recover is pretty normal, especially in the earlier years of illness. So, you’re kind of at a crossroads here. You’re probably going to have to do treatment of some kind whether you want to or not, but you can choose to get as much as you can out of that and really give it your best shot, or you can half-ass things and get through it without really giving recovery a chance. \n\nI’m sorry, I probably should have clarified in my original two comments that my stance on this is more so for adults. I don’t think forced treatment works, period, and I am not a fan of FBT… but I DO feel that family and the healthcare system have a responsibility to minors to try and help them get well even if they do not feel ready to.",
          "created_utc": 1746306063.0
        },
        {
          "id": "mqg1m8m",
          "author": "Skylaa_11",
          "body": "Yeah, they probably won’t just let me go and will become even more concerned if I refuse treatment. I will go for the CBT, because then I don’t have to be home from school and can work more on the mental aspects.",
          "created_utc": 1746311553.0
        }
      ]
    },
    {
      "id": "mqt24g3",
      "author": "BasOutten",
      "body": "That person has a name dude, it's me. \n\n> But they've clearly made up their mind in that regard and I'm not debating them, or you\n\nHave they made up their mind? Or have you?",
      "created_utc": 1746492801.0,
      "score": 1,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        },
        {
          "id": "mqgqivx",
          "author": "being-weird",
          "body": "This is supposed to be ed hot takes, not transphobia",
          "created_utc": 1746320983.0
        },
        {
          "id": "mqn4jfb",
          "author": "BasOutten",
          "body": "Fallacy. Dismissal by labeling: Someone rejects an argument or criticism by slapping a label on it (like “-phobic” or “-ist”) rather than addressing its substance.\nExample: “You’re just being transphobic,” when the person raised a nuanced point about medical policy.",
          "created_utc": 1746411703.0
        },
        {
          "id": "mqp31ro",
          "author": "being-weird",
          "body": "If this person really wanted to learn how gender dysphoria works many people have answered this question better than I could. But they've clearly made up their mind in that regard and I'm not debating them, or you",
          "created_utc": 1746448192.0
        }
      ]
    },
    {
      "id": "mqgzw9q",
      "author": "anastasia_42",
      "body": "Think what you want but I haven't invalidated anyone.",
      "created_utc": 1746324672.0,
      "score": -2,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqddule",
          "author": "biggestballzzz",
          "body": "ooooof okay let’s also not invalidate actual diagnoses either pls",
          "created_utc": 1746280586.0
        },
        {
          "id": "mqdkxi6",
          "author": "anastasia_42",
          "body": "They asked for a hot take and that's mine 🤷‍♀️ Im not saying they don't have a disorder at all btw but I don't think it's anorexia.",
          "created_utc": 1746282936.0
        },
        {
          "id": "mqehk4x",
          "author": "biggestballzzz",
          "body": "they asked for a hot take. not a disordered one. and regardless you just doubled down on the invalidation in this response. \n\nalso maybe, like, have some consideration for other people? this is a public platform for recovering from eating disorders. there are overweight people in the community. there are most likely overweight people interacting with this post. what you are saying is incredibly harmful, disrespectful, and ignorant. please keep it to yourself",
          "created_utc": 1746293108.0
        },
        {
          "id": "mqgn0nc",
          "author": "anastasia_42",
          "body": "I'm not gonna keep anything to myself. I haven't invalidated anyone and I've been respectful. My point is, being underweight is one of the core pillars of being anorexic. And so it doesn't make sense that overweight people can be considered anorexic. To the point, where they use another term in order for it to be considered anorexia (\"atypical\"). I'm not saying they don't have an eating disorder or eating issues that are similar. I'm merely saying that I don't think it can or should be considered anorexia. Either way, I hope everyone in this sub who is struggling with eating one day recovers.  Eating disorders are horrible for everyone - regardless of weight.",
          "created_utc": 1746319611.0
        },
        {
          "id": "mqgyppf",
          "author": "biggestballzzz",
          "body": "“i haven’t invalidated anyone” \n\n“you can’t be fat and anorexic”\n\natypical anorexia is recognized and has diagnosis criteria in the DSM-5 and just because you don’t feel that it should be considered anorexia, doesn’t mean that it’s not anorexia and perpetuating the idea that it’s not, on a PUBLIC EATING DISORDER FORUM with people of all shapes and sizes struggling, is incredibly invaliding and just plain honestly mean.",
          "created_utc": 1746324209.0
        }
      ]
    },
    {
      "id": "mqt4fk6",
      "author": "being-weird",
      "body": "Yeah man. If you wanted to understand how gender dysphoria works you could look it up. The information is widely available. But you're clearly pretty convinced it's a disorder and I have no interest in defending my existence to you",
      "created_utc": 1746493605.0,
      "score": 1,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        },
        {
          "id": "mqgqivx",
          "author": "being-weird",
          "body": "This is supposed to be ed hot takes, not transphobia",
          "created_utc": 1746320983.0
        },
        {
          "id": "mqn4jfb",
          "author": "BasOutten",
          "body": "Fallacy. Dismissal by labeling: Someone rejects an argument or criticism by slapping a label on it (like “-phobic” or “-ist”) rather than addressing its substance.\nExample: “You’re just being transphobic,” when the person raised a nuanced point about medical policy.",
          "created_utc": 1746411703.0
        },
        {
          "id": "mqp31ro",
          "author": "being-weird",
          "body": "If this person really wanted to learn how gender dysphoria works many people have answered this question better than I could. But they've clearly made up their mind in that regard and I'm not debating them, or you",
          "created_utc": 1746448192.0
        },
        {
          "id": "mqt24g3",
          "author": "BasOutten",
          "body": "That person has a name dude, it's me. \n\n> But they've clearly made up their mind in that regard and I'm not debating them, or you\n\nHave they made up their mind? Or have you?",
          "created_utc": 1746492801.0
        }
      ]
    },
    {
      "id": "mqkxcmp",
      "author": "thr0wawaynametaken",
      "body": "you literally did tho lol. words have meanings. you literally said people with the atypical anorexia diagnosis can't have anorexia. this is invalidating those people. who can not care and you can continue to have bad uninformed takes but you can't say you're not invalidating anyone when your entire point was specifically to invalidate a subset of ed sufferers different from you!",
      "created_utc": 1746384821.0,
      "score": 4,
      "context": [
        {
          "id": "mqcirhr",
          "author": "anastasia_42",
          "body": "Atypical anorexia isn't possible...you can't be fat and anorexic it's an oxymoron",
          "created_utc": 1746266683.0
        },
        {
          "id": "mqddule",
          "author": "biggestballzzz",
          "body": "ooooof okay let’s also not invalidate actual diagnoses either pls",
          "created_utc": 1746280586.0
        },
        {
          "id": "mqdkxi6",
          "author": "anastasia_42",
          "body": "They asked for a hot take and that's mine 🤷‍♀️ Im not saying they don't have a disorder at all btw but I don't think it's anorexia.",
          "created_utc": 1746282936.0
        },
        {
          "id": "mqehk4x",
          "author": "biggestballzzz",
          "body": "they asked for a hot take. not a disordered one. and regardless you just doubled down on the invalidation in this response. \n\nalso maybe, like, have some consideration for other people? this is a public platform for recovering from eating disorders. there are overweight people in the community. there are most likely overweight people interacting with this post. what you are saying is incredibly harmful, disrespectful, and ignorant. please keep it to yourself",
          "created_utc": 1746293108.0
        },
        {
          "id": "mqgn0nc",
          "author": "anastasia_42",
          "body": "I'm not gonna keep anything to myself. I haven't invalidated anyone and I've been respectful. My point is, being underweight is one of the core pillars of being anorexic. And so it doesn't make sense that overweight people can be considered anorexic. To the point, where they use another term in order for it to be considered anorexia (\"atypical\"). I'm not saying they don't have an eating disorder or eating issues that are similar. I'm merely saying that I don't think it can or should be considered anorexia. Either way, I hope everyone in this sub who is struggling with eating one day recovers.  Eating disorders are horrible for everyone - regardless of weight.",
          "created_utc": 1746319611.0
        },
        {
          "id": "mqgyppf",
          "author": "biggestballzzz",
          "body": "“i haven’t invalidated anyone” \n\n“you can’t be fat and anorexic”\n\natypical anorexia is recognized and has diagnosis criteria in the DSM-5 and just because you don’t feel that it should be considered anorexia, doesn’t mean that it’s not anorexia and perpetuating the idea that it’s not, on a PUBLIC EATING DISORDER FORUM with people of all shapes and sizes struggling, is incredibly invaliding and just plain honestly mean.",
          "created_utc": 1746324209.0
        },
        {
          "id": "mqgzw9q",
          "author": "anastasia_42",
          "body": "Think what you want but I haven't invalidated anyone.",
          "created_utc": 1746324672.0
        }
      ]
    },
    {
      "id": "mrbpe20",
      "author": "BasOutten",
      "body": "This is not about how gender dysphoria works. This is about whether or not it is a disorder.\n\n>  I have no interest in defending my existence to you\n\nI'm talking about gender dysphoria. Why do you keep inserting yourself into the conversation? Is your name dysphoria?",
      "created_utc": 1746743238.0,
      "score": 0,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        },
        {
          "id": "mqgqivx",
          "author": "being-weird",
          "body": "This is supposed to be ed hot takes, not transphobia",
          "created_utc": 1746320983.0
        },
        {
          "id": "mqn4jfb",
          "author": "BasOutten",
          "body": "Fallacy. Dismissal by labeling: Someone rejects an argument or criticism by slapping a label on it (like “-phobic” or “-ist”) rather than addressing its substance.\nExample: “You’re just being transphobic,” when the person raised a nuanced point about medical policy.",
          "created_utc": 1746411703.0
        },
        {
          "id": "mqp31ro",
          "author": "being-weird",
          "body": "If this person really wanted to learn how gender dysphoria works many people have answered this question better than I could. But they've clearly made up their mind in that regard and I'm not debating them, or you",
          "created_utc": 1746448192.0
        },
        {
          "id": "mqt24g3",
          "author": "BasOutten",
          "body": "That person has a name dude, it's me. \n\n> But they've clearly made up their mind in that regard and I'm not debating them, or you\n\nHave they made up their mind? Or have you?",
          "created_utc": 1746492801.0
        },
        {
          "id": "mqt4fk6",
          "author": "being-weird",
          "body": "Yeah man. If you wanted to understand how gender dysphoria works you could look it up. The information is widely available. But you're clearly pretty convinced it's a disorder and I have no interest in defending my existence to you",
          "created_utc": 1746493605.0
        }
      ]
    },
    {
      "id": "mrcn6eu",
      "author": "being-weird",
      "body": "I have gender dysphoria. You think it's a disorder. I know it's not. I thought that would be clear tbh",
      "created_utc": 1746755556.0,
      "score": 1,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        },
        {
          "id": "mqgqivx",
          "author": "being-weird",
          "body": "This is supposed to be ed hot takes, not transphobia",
          "created_utc": 1746320983.0
        },
        {
          "id": "mqn4jfb",
          "author": "BasOutten",
          "body": "Fallacy. Dismissal by labeling: Someone rejects an argument or criticism by slapping a label on it (like “-phobic” or “-ist”) rather than addressing its substance.\nExample: “You’re just being transphobic,” when the person raised a nuanced point about medical policy.",
          "created_utc": 1746411703.0
        },
        {
          "id": "mqp31ro",
          "author": "being-weird",
          "body": "If this person really wanted to learn how gender dysphoria works many people have answered this question better than I could. But they've clearly made up their mind in that regard and I'm not debating them, or you",
          "created_utc": 1746448192.0
        },
        {
          "id": "mqt24g3",
          "author": "BasOutten",
          "body": "That person has a name dude, it's me. \n\n> But they've clearly made up their mind in that regard and I'm not debating them, or you\n\nHave they made up their mind? Or have you?",
          "created_utc": 1746492801.0
        },
        {
          "id": "mqt4fk6",
          "author": "being-weird",
          "body": "Yeah man. If you wanted to understand how gender dysphoria works you could look it up. The information is widely available. But you're clearly pretty convinced it's a disorder and I have no interest in defending my existence to you",
          "created_utc": 1746493605.0
        },
        {
          "id": "mrbpe20",
          "author": "BasOutten",
          "body": "This is not about how gender dysphoria works. This is about whether or not it is a disorder.\n\n>  I have no interest in defending my existence to you\n\nI'm talking about gender dysphoria. Why do you keep inserting yourself into the conversation? Is your name dysphoria?",
          "created_utc": 1746743238.0
        }
      ]
    },
    {
      "id": "mrmnzyd",
      "author": "BasOutten",
      "body": "Ok. How is it not a disorder, and, define disorder.",
      "created_utc": 1746902526.0,
      "score": 1,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        },
        {
          "id": "mqgqivx",
          "author": "being-weird",
          "body": "This is supposed to be ed hot takes, not transphobia",
          "created_utc": 1746320983.0
        },
        {
          "id": "mqn4jfb",
          "author": "BasOutten",
          "body": "Fallacy. Dismissal by labeling: Someone rejects an argument or criticism by slapping a label on it (like “-phobic” or “-ist”) rather than addressing its substance.\nExample: “You’re just being transphobic,” when the person raised a nuanced point about medical policy.",
          "created_utc": 1746411703.0
        },
        {
          "id": "mqp31ro",
          "author": "being-weird",
          "body": "If this person really wanted to learn how gender dysphoria works many people have answered this question better than I could. But they've clearly made up their mind in that regard and I'm not debating them, or you",
          "created_utc": 1746448192.0
        },
        {
          "id": "mqt24g3",
          "author": "BasOutten",
          "body": "That person has a name dude, it's me. \n\n> But they've clearly made up their mind in that regard and I'm not debating them, or you\n\nHave they made up their mind? Or have you?",
          "created_utc": 1746492801.0
        },
        {
          "id": "mqt4fk6",
          "author": "being-weird",
          "body": "Yeah man. If you wanted to understand how gender dysphoria works you could look it up. The information is widely available. But you're clearly pretty convinced it's a disorder and I have no interest in defending my existence to you",
          "created_utc": 1746493605.0
        },
        {
          "id": "mrbpe20",
          "author": "BasOutten",
          "body": "This is not about how gender dysphoria works. This is about whether or not it is a disorder.\n\n>  I have no interest in defending my existence to you\n\nI'm talking about gender dysphoria. Why do you keep inserting yourself into the conversation? Is your name dysphoria?",
          "created_utc": 1746743238.0
        },
        {
          "id": "mrcn6eu",
          "author": "being-weird",
          "body": "I have gender dysphoria. You think it's a disorder. I know it's not. I thought that would be clear tbh",
          "created_utc": 1746755556.0
        }
      ]
    },
    {
      "id": "mrolur5",
      "author": "being-weird",
      "body": "No",
      "created_utc": 1746928189.0,
      "score": 1,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        },
        {
          "id": "mqgqivx",
          "author": "being-weird",
          "body": "This is supposed to be ed hot takes, not transphobia",
          "created_utc": 1746320983.0
        },
        {
          "id": "mqn4jfb",
          "author": "BasOutten",
          "body": "Fallacy. Dismissal by labeling: Someone rejects an argument or criticism by slapping a label on it (like “-phobic” or “-ist”) rather than addressing its substance.\nExample: “You’re just being transphobic,” when the person raised a nuanced point about medical policy.",
          "created_utc": 1746411703.0
        },
        {
          "id": "mqp31ro",
          "author": "being-weird",
          "body": "If this person really wanted to learn how gender dysphoria works many people have answered this question better than I could. But they've clearly made up their mind in that regard and I'm not debating them, or you",
          "created_utc": 1746448192.0
        },
        {
          "id": "mqt24g3",
          "author": "BasOutten",
          "body": "That person has a name dude, it's me. \n\n> But they've clearly made up their mind in that regard and I'm not debating them, or you\n\nHave they made up their mind? Or have you?",
          "created_utc": 1746492801.0
        },
        {
          "id": "mqt4fk6",
          "author": "being-weird",
          "body": "Yeah man. If you wanted to understand how gender dysphoria works you could look it up. The information is widely available. But you're clearly pretty convinced it's a disorder and I have no interest in defending my existence to you",
          "created_utc": 1746493605.0
        },
        {
          "id": "mrbpe20",
          "author": "BasOutten",
          "body": "This is not about how gender dysphoria works. This is about whether or not it is a disorder.\n\n>  I have no interest in defending my existence to you\n\nI'm talking about gender dysphoria. Why do you keep inserting yourself into the conversation? Is your name dysphoria?",
          "created_utc": 1746743238.0
        },
        {
          "id": "mrcn6eu",
          "author": "being-weird",
          "body": "I have gender dysphoria. You think it's a disorder. I know it's not. I thought that would be clear tbh",
          "created_utc": 1746755556.0
        },
        {
          "id": "mrmnzyd",
          "author": "BasOutten",
          "body": "Ok. How is it not a disorder, and, define disorder.",
          "created_utc": 1746902526.0
        }
      ]
    },
    {
      "id": "mrrqky8",
      "author": "BasOutten",
      "body": "if you want people to take you seriously, you're gonna have to \"put some skin in the game\" by articulating your logic and letting that logic be challenged",
      "created_utc": 1746980592.0,
      "score": 0,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        },
        {
          "id": "mqgqivx",
          "author": "being-weird",
          "body": "This is supposed to be ed hot takes, not transphobia",
          "created_utc": 1746320983.0
        },
        {
          "id": "mqn4jfb",
          "author": "BasOutten",
          "body": "Fallacy. Dismissal by labeling: Someone rejects an argument or criticism by slapping a label on it (like “-phobic” or “-ist”) rather than addressing its substance.\nExample: “You’re just being transphobic,” when the person raised a nuanced point about medical policy.",
          "created_utc": 1746411703.0
        },
        {
          "id": "mqp31ro",
          "author": "being-weird",
          "body": "If this person really wanted to learn how gender dysphoria works many people have answered this question better than I could. But they've clearly made up their mind in that regard and I'm not debating them, or you",
          "created_utc": 1746448192.0
        },
        {
          "id": "mqt24g3",
          "author": "BasOutten",
          "body": "That person has a name dude, it's me. \n\n> But they've clearly made up their mind in that regard and I'm not debating them, or you\n\nHave they made up their mind? Or have you?",
          "created_utc": 1746492801.0
        },
        {
          "id": "mqt4fk6",
          "author": "being-weird",
          "body": "Yeah man. If you wanted to understand how gender dysphoria works you could look it up. The information is widely available. But you're clearly pretty convinced it's a disorder and I have no interest in defending my existence to you",
          "created_utc": 1746493605.0
        },
        {
          "id": "mrbpe20",
          "author": "BasOutten",
          "body": "This is not about how gender dysphoria works. This is about whether or not it is a disorder.\n\n>  I have no interest in defending my existence to you\n\nI'm talking about gender dysphoria. Why do you keep inserting yourself into the conversation? Is your name dysphoria?",
          "created_utc": 1746743238.0
        },
        {
          "id": "mrcn6eu",
          "author": "being-weird",
          "body": "I have gender dysphoria. You think it's a disorder. I know it's not. I thought that would be clear tbh",
          "created_utc": 1746755556.0
        },
        {
          "id": "mrmnzyd",
          "author": "BasOutten",
          "body": "Ok. How is it not a disorder, and, define disorder.",
          "created_utc": 1746902526.0
        },
        {
          "id": "mrolur5",
          "author": "being-weird",
          "body": "No",
          "created_utc": 1746928189.0
        }
      ]
    },
    {
      "id": "mruashq",
      "author": "being-weird",
      "body": "Plenty of people take me seriously. I don't need you to take me seriously, I don't even know you. I've been pretty clear that I don't intend to debate you so I'm really not sure why you're surprised",
      "created_utc": 1747012233.0,
      "score": 1,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        },
        {
          "id": "mqgqivx",
          "author": "being-weird",
          "body": "This is supposed to be ed hot takes, not transphobia",
          "created_utc": 1746320983.0
        },
        {
          "id": "mqn4jfb",
          "author": "BasOutten",
          "body": "Fallacy. Dismissal by labeling: Someone rejects an argument or criticism by slapping a label on it (like “-phobic” or “-ist”) rather than addressing its substance.\nExample: “You’re just being transphobic,” when the person raised a nuanced point about medical policy.",
          "created_utc": 1746411703.0
        },
        {
          "id": "mqp31ro",
          "author": "being-weird",
          "body": "If this person really wanted to learn how gender dysphoria works many people have answered this question better than I could. But they've clearly made up their mind in that regard and I'm not debating them, or you",
          "created_utc": 1746448192.0
        },
        {
          "id": "mqt24g3",
          "author": "BasOutten",
          "body": "That person has a name dude, it's me. \n\n> But they've clearly made up their mind in that regard and I'm not debating them, or you\n\nHave they made up their mind? Or have you?",
          "created_utc": 1746492801.0
        },
        {
          "id": "mqt4fk6",
          "author": "being-weird",
          "body": "Yeah man. If you wanted to understand how gender dysphoria works you could look it up. The information is widely available. But you're clearly pretty convinced it's a disorder and I have no interest in defending my existence to you",
          "created_utc": 1746493605.0
        },
        {
          "id": "mrbpe20",
          "author": "BasOutten",
          "body": "This is not about how gender dysphoria works. This is about whether or not it is a disorder.\n\n>  I have no interest in defending my existence to you\n\nI'm talking about gender dysphoria. Why do you keep inserting yourself into the conversation? Is your name dysphoria?",
          "created_utc": 1746743238.0
        },
        {
          "id": "mrcn6eu",
          "author": "being-weird",
          "body": "I have gender dysphoria. You think it's a disorder. I know it's not. I thought that would be clear tbh",
          "created_utc": 1746755556.0
        },
        {
          "id": "mrmnzyd",
          "author": "BasOutten",
          "body": "Ok. How is it not a disorder, and, define disorder.",
          "created_utc": 1746902526.0
        },
        {
          "id": "mrolur5",
          "author": "being-weird",
          "body": "No",
          "created_utc": 1746928189.0
        },
        {
          "id": "mrrqky8",
          "author": "BasOutten",
          "body": "if you want people to take you seriously, you're gonna have to \"put some skin in the game\" by articulating your logic and letting that logic be challenged",
          "created_utc": 1746980592.0
        }
      ]
    },
    {
      "id": "mrxh4dy",
      "author": "BasOutten",
      "body": "No, they don't take your seriously. They avoid you.\n\nAnd if you don't want to debate, stop replying.",
      "created_utc": 1747064422.0,
      "score": 0,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        },
        {
          "id": "mqgqivx",
          "author": "being-weird",
          "body": "This is supposed to be ed hot takes, not transphobia",
          "created_utc": 1746320983.0
        },
        {
          "id": "mqn4jfb",
          "author": "BasOutten",
          "body": "Fallacy. Dismissal by labeling: Someone rejects an argument or criticism by slapping a label on it (like “-phobic” or “-ist”) rather than addressing its substance.\nExample: “You’re just being transphobic,” when the person raised a nuanced point about medical policy.",
          "created_utc": 1746411703.0
        },
        {
          "id": "mqp31ro",
          "author": "being-weird",
          "body": "If this person really wanted to learn how gender dysphoria works many people have answered this question better than I could. But they've clearly made up their mind in that regard and I'm not debating them, or you",
          "created_utc": 1746448192.0
        },
        {
          "id": "mqt24g3",
          "author": "BasOutten",
          "body": "That person has a name dude, it's me. \n\n> But they've clearly made up their mind in that regard and I'm not debating them, or you\n\nHave they made up their mind? Or have you?",
          "created_utc": 1746492801.0
        },
        {
          "id": "mqt4fk6",
          "author": "being-weird",
          "body": "Yeah man. If you wanted to understand how gender dysphoria works you could look it up. The information is widely available. But you're clearly pretty convinced it's a disorder and I have no interest in defending my existence to you",
          "created_utc": 1746493605.0
        },
        {
          "id": "mrbpe20",
          "author": "BasOutten",
          "body": "This is not about how gender dysphoria works. This is about whether or not it is a disorder.\n\n>  I have no interest in defending my existence to you\n\nI'm talking about gender dysphoria. Why do you keep inserting yourself into the conversation? Is your name dysphoria?",
          "created_utc": 1746743238.0
        },
        {
          "id": "mrcn6eu",
          "author": "being-weird",
          "body": "I have gender dysphoria. You think it's a disorder. I know it's not. I thought that would be clear tbh",
          "created_utc": 1746755556.0
        },
        {
          "id": "mrmnzyd",
          "author": "BasOutten",
          "body": "Ok. How is it not a disorder, and, define disorder.",
          "created_utc": 1746902526.0
        },
        {
          "id": "mrolur5",
          "author": "being-weird",
          "body": "No",
          "created_utc": 1746928189.0
        },
        {
          "id": "mrrqky8",
          "author": "BasOutten",
          "body": "if you want people to take you seriously, you're gonna have to \"put some skin in the game\" by articulating your logic and letting that logic be challenged",
          "created_utc": 1746980592.0
        },
        {
          "id": "mruashq",
          "author": "being-weird",
          "body": "Plenty of people take me seriously. I don't need you to take me seriously, I don't even know you. I've been pretty clear that I don't intend to debate you so I'm really not sure why you're surprised",
          "created_utc": 1747012233.0
        }
      ]
    },
    {
      "id": "mrzsk14",
      "author": "being-weird",
      "body": "You know I think I would have noticed if every single person in my life was trying to avoid me. Nice try though 🤗",
      "created_utc": 1747089568.0,
      "score": 1,
      "context": [
        {
          "id": "mqd620x",
          "author": "BasOutten",
          "body": "The massive over prevalence of eating disorders among trans people is one of several reasons why gender dysphoria is a disorder",
          "created_utc": 1746277775.0
        },
        {
          "id": "mqdglpg",
          "author": "being-weird",
          "body": "No I'm pretty sure for most people with gender dysphoria it's the other way around",
          "created_utc": 1746281519.0
        },
        {
          "id": "mqdk2e8",
          "author": "BasOutten",
          "body": "I'm aware gender dysphoria triggers EDs, but why is that cause effect irrelevant?\n\nAutism causes EDs, it is a disorder.\n\nBPD causes EDs, it is a disorder.\n\nOCD causes EDs, it is a disorder.\n\n\nGD causes EDs... It is a \"valid identity\" that cannot be criticized",
          "created_utc": 1746282657.0
        },
        {
          "id": "mqgqivx",
          "author": "being-weird",
          "body": "This is supposed to be ed hot takes, not transphobia",
          "created_utc": 1746320983.0
        },
        {
          "id": "mqn4jfb",
          "author": "BasOutten",
          "body": "Fallacy. Dismissal by labeling: Someone rejects an argument or criticism by slapping a label on it (like “-phobic” or “-ist”) rather than addressing its substance.\nExample: “You’re just being transphobic,” when the person raised a nuanced point about medical policy.",
          "created_utc": 1746411703.0
        },
        {
          "id": "mqp31ro",
          "author": "being-weird",
          "body": "If this person really wanted to learn how gender dysphoria works many people have answered this question better than I could. But they've clearly made up their mind in that regard and I'm not debating them, or you",
          "created_utc": 1746448192.0
        },
        {
          "id": "mqt24g3",
          "author": "BasOutten",
          "body": "That person has a name dude, it's me. \n\n> But they've clearly made up their mind in that regard and I'm not debating them, or you\n\nHave they made up their mind? Or have you?",
          "created_utc": 1746492801.0
        },
        {
          "id": "mqt4fk6",
          "author": "being-weird",
          "body": "Yeah man. If you wanted to understand how gender dysphoria works you could look it up. The information is widely available. But you're clearly pretty convinced it's a disorder and I have no interest in defending my existence to you",
          "created_utc": 1746493605.0
        },
        {
          "id": "mrbpe20",
          "author": "BasOutten",
          "body": "This is not about how gender dysphoria works. This is about whether or not it is a disorder.\n\n>  I have no interest in defending my existence to you\n\nI'm talking about gender dysphoria. Why do you keep inserting yourself into the conversation? Is your name dysphoria?",
          "created_utc": 1746743238.0
        },
        {
          "id": "mrcn6eu",
          "author": "being-weird",
          "body": "I have gender dysphoria. You think it's a disorder. I know it's not. I thought that would be clear tbh",
          "created_utc": 1746755556.0
        },
        {
          "id": "mrmnzyd",
          "author": "BasOutten",
          "body": "Ok. How is it not a disorder, and, define disorder.",
          "created_utc": 1746902526.0
        },
        {
          "id": "mrolur5",
          "author": "being-weird",
          "body": "No",
          "created_utc": 1746928189.0
        },
        {
          "id": "mrrqky8",
          "author": "BasOutten",
          "body": "if you want people to take you seriously, you're gonna have to \"put some skin in the game\" by articulating your logic and letting that logic be challenged",
          "created_utc": 1746980592.0
        },
        {
          "id": "mruashq",
          "author": "being-weird",
          "body": "Plenty of people take me seriously. I don't need you to take me seriously, I don't even know you. I've been pretty clear that I don't intend to debate you so I'm really not sure why you're surprised",
          "created_utc": 1747012233.0
        },
        {
          "id": "mrxh4dy",
          "author": "BasOutten",
          "body": "No, they don't take your seriously. They avoid you.\n\nAnd if you don't want to debate, stop replying.",
          "created_utc": 1747064422.0
        }
      ]
    }
  ]
}