{
  "id": "1kfh7yj",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1746465510.0,
  "title": "How do people without anorexia not worry about their weight",
  "selftext": "I generally wonder how people who are at a healthy weight, are able to eat healthy and eat enough food, without starving themselves, without obsessively checking the scale, without constantly thinking about what they eat and how it's prepared. How healthy people who aren't anorexic can just try a new food because it sounds good. How they go about their day, without constantly worrying about the number on the scale\n\nI know the obvious answer is they aren't anorexic. Some people who are not anorexic have disordered eating or they go on diets, but it never turns into anorexia. But I am mostly talking about people who are able to maintain a naturally healthy weight, while not starving themselves. They do not overeat or undereat, and they do not suffer health complications because of it\n\nThat used to be me, before this illness came into my life. I have been naturally thin, my entire life. Before my illness, I could eat what I wanted, without having to strictly monitor my food intake or constantly check my weight. My weight was just at a healthy weight. I never went above or below the number. Then one day, I decided to step on a scale and for some reason, couldn't stop losing weight\n\nSo now I am very underweight. And I miss how I was before. I miss not worrying about food or weight gain. But now that I am underweight, I am a lot more anxious than I ever was at my previously healthy weight. At my healthy weight, my mom always told me how pretty I was. But ever since I have been sick with anorexia, my mom always asks me what I am eating and is always worrying about me. She no longer calls me pretty. She sees how my illness changed me. No one in my family suffers from anorexia so it is a very isolating thing to go through. Also, I find returning to my previously healthy weight, the weight I once felt confident at, to be very anxiety provoking. Even when people tell me I wouldn't be overweight if I ate more and that gaining weight would improve my health and quality of life. I know I wouldn't be overweight if I ate more. But the idea of the number increasing is what bothers me. I know I would still be naturally thin. It's in my genetics. But the idea of the number going above where I want it to be is what I have anxiety about. \n\nThis disorder can change your thinking and how you view yourself. It is why anorexic people often do not stop losing weight, even when others approach them and tell them they are becoming too thin. I lost my freedom when I stood on the scale. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1kfh7yj/how_do_people_without_anorexia_not_worry_about/",
  "score": 133,
  "num_comments": 41,
  "comments": [
    {
      "id": "mqqm6gf",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1746465510.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqqml63",
      "author": "None",
      "body": "I don't even remember how I acted in relation to this before this disease",
      "created_utc": 1746465626.0,
      "score": 77,
      "context": []
    },
    {
      "id": "mqqqtgr",
      "author": "randommeowz",
      "body": "it warps your perception so bad. i think these healthy people are probably more in tune with their body and their natural needs and hunger signals and having healthier patterns in life. i was also thin before it became bad, but its like my whole world flipped on its head when i became aware of my weight and calories. just a full bodyslam into a different world. ive reached my highs and severe lows, ive felt delusionally great and horrid near death, and yet i cant remember how i could be normal before it. its a horrible intruder in my head that once i saw, i could never unsee. i think maybe some people dont have this at all, or it is so off in the shadows for others it doesnt really get activated. forbidden knowledge, i guess. the more you look in its eyes the more fucked yours get. or thats how i see it in my experience.",
      "created_utc": 1746466825.0,
      "score": 32,
      "context": []
    },
    {
      "id": "mqrfl84",
      "author": "Result-Beneficial",
      "body": "I think this every time I see someone weighing themselves at the gym, like in the middle of the day with all their clothes on. Where as I could never imagining not weighing myself naked, in the morning, after I’ve gone to the bathroom. The conditions have to be perfect! \nI guess other people just aren’t attached to their weight in the same way. They can just weigh themselves and then move on with their day.",
      "created_utc": 1746474100.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mqqt28l",
      "author": "Phantasmortuary",
      "body": "I think most people only start worrying about how their eating affects their weight if they start having noticeable changes in their weight. \n\nMy Mum was the about the same size about as long as I've been alive up until she started going through menopause and went up a size or two. She didn't start dieting or anything, just didn't wear her older clothes. Never bemoaned her \"old body\" or anything.  \n\nI too know I wouldn't be overweight if I ate more. For me it's more about feeling more comfortable at a certain weight/size even though it's a ridiculous destination. Since my Mum died several years ago, I feel less shame losing weight, as I don't have to see her worry. \n\nThere are still goals I have though, so I kind of live in a quasi-place. For instance, I don't exactly have fear foods, more-so anxiety around food in social settings.",
      "created_utc": 1746467462.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mqrvyrd",
      "author": "buzzybody21",
      "body": "For the most part, people without eating disorders don’t regularly weigh themselves, obsessively worry about the result of caloric intake on their body, and aren’t haunted by the constant thoughts. But everyone’s on a different journey with their bodies.",
      "created_utc": 1746478873.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mqryjl8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1746479649.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mqsgrfp",
      "author": "EepyPrincessKitten",
      "body": "I have had anorexia since I was literally 7/8 with signs from an earlier age so it really has been my entire sentient life. I absolutely get you , like I geniunly don’t understand how people can just eat what they want , when they want without being stressed about it but also without binging . I guess other than people who are obese/other eating disorders. It’s painful and I envy everyone around me . ESPECIALLY naturally skinny people who just somehow perfectly regulate their weight without trying + still eating fast food etc",
      "created_utc": 1746485570.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mqryqlp",
      "author": "TeakVanSol",
      "body": "People do worry about their weight, but it’s much more generalized with a realistic approach to handling it. Eat slightly fewer calories and exercise. They listen to their doctors (if that concern exists). We live in a weight obsessed society but people who aren’t already predisposed don’t fall down the rabbit hole. It’s considered a disorder for a reason. We’re just different.",
      "created_utc": 1746479709.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqrzb3q",
      "author": "Big-Molasses4788",
      "body": "Thank u for sharing this\nHonestly I feel exactly the same way so ur not alone \nMany people without anorexia don’t experience the same level of distress around eating and weight as we do because their brains simply don’t fixate on those numbers the way an ED does. I rlly wish I could go back to when I was healthy weight and never counted a single calorie or worried about what and when I'll eat and I'll just never truly understand how others aren't obsessively attached  to their weight and food intake like we are.",
      "created_utc": 1746479884.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqsym0t",
      "author": "theconfidentobserver",
      "body": "I don’t have a current eating disorder, but now that I don’t - I feel the best I have ever felt about my body and my weight. Going through pregnancy and breastfeeding really helped me to understand the importance of eating real food and how it impacts our organs and how eating well and often can really benefit your health/appearance. When I was starving and restricting… it’s all I could think about and I never felt good. Now I don’t think about it(because I am full and nourished) and I feel great.",
      "created_utc": 1746491601.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqsj257",
      "author": "bpa23",
      "body": "This was me before becoming disordered 10 years ago. I had moments some years ago being frustrated with past me for not knowing how much I weighed at my slimmest/happiest so I could aim for that, or could be happy I had surpassed that. But I just didn't think about it ever. Of course now me is so grateful and hopeful I can get back to that place of not caring one day.",
      "created_utc": 1746486345.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mqtafmm",
      "author": "Key-Amount-4249",
      "body": "I'm fully recovered right now. I think what helped the most is to set a goal, something that you really want to achieve for yourself and work for it every day. It could be anything for you, music, art, science, medicine, tailoring, cooking, cleaning.",
      "created_utc": 1746495677.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mqtafq5",
      "author": "CalligrapherDry177",
      "body": "i swear it’s not weight it’s fat. i’m not sure if it’s because i’m male but the scale number is eh important but being able to pinch fat is scary. I do worry about weight gain when i’m not strength training but for some reason i just don’t gain weight very easily contrary to what i think. I’m not too worried about the scale number but am worried if i can pinch fat so that way yes you can be anorexic and not worry about weight.",
      "created_utc": 1746495678.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mqu80t6",
      "author": "monsterzerog1rl",
      "body": "I honestly don't know a single person who doesn't worry about their weight. Women of any age around me like to stay slim, and men like to stay muscular and worry about losing too much. I'm not saying everyone is disordered. They definitely don't obsess over it like I do. They don't have breakdowns, etc. But we live in a time when body image is a big deal and takes up the mental space of lots of people",
      "created_utc": 1746509658.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mqymha7",
      "author": "spacing_out3",
      "body": "I can’t even imagine how people don’t worry or think about it every day.",
      "created_utc": 1746568275.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mrs07tg",
      "author": "lara_is_",
      "body": "(sorry for such a long comment, its hard to find words for this topic for me)  \n  \nI had anorexia for a period of time (before 18yo) and I fully believed that even IF I recovered, I would never feel positive about my body, my eating habits and what people thought/associated when they saw my body.  \n  \nI can now (I'm 26) say that I live a day to day life where my body size and what I eat are neutral things, its just like the color of my skin and brushing my teeth — I'm neutral about them, and think about them basically only in terms of objective health. Of course there are some practical aspects that annoy me like not being able to use a clothing item because it doesn't fit and I really liked it (big or small, its the same feeling). While in the past this would've made me spiral into a series of actions of self hate and control, now I start thinking where I could find another piece of clothing that I love and if anyone I know would like my item now that I'm not going to use it anymore. I can look at a picture where I don't feel like the angle/light flattered me and not feel disgusted, it simply is that: a non-flatering picture, that means nothing about my value as a person.\n\nI wish I had a step-by-step to how this change happened, but maybe its too personal/complex to be applied to everybody. I was heavily depressed while anorexic and while in recovery, and after recovery as well — turned out to be frustration and devaluation caused by untreated ADHD. When my anorexia started I was a little socially isolated and the friends I did have were people that cared a lot about how they looked, projected their frustrations and modeled this projection by commenting how others look and attaching value to it. I had been friends with them for years before this — this was my (perceived) reality.  \nWhen I changed schools I was in kind of a forced recovery because I was being closely monitored by a family member, however my mind was still completely focused on anorexia. Then the social scenario changed: these new colleagues didn't really care much about people's looks besides some comments on fashion / self expression. I noticed they were much more content with their lives, they had many more interests and hobbies and most of all, they showed me a reality beyond superficial value and I couldn't ignore anymore how shallow I had been towards myself: masked self-hate as some kind of need to adapt to a standard that whoever the fuck created. I started feeling a bit shameful of being so self centered, tried to model confidence (felt weird and forced for years, but \"fake it till you make it\" worked in the end) and never let myself be surrounded by superficial people again (not online and not in person either), made an effort to eliminate triggers from my life (deleted inspo accounts, deleted tumblr, actively rejected suggestions from my \"for you\" pages, tried thinking of myself as someone else to garner empathy because I could never be so cruel with others as I was to myself etc). At this point I still struggled but I did feel like a percentage of the time my brain spent thinking about body image was starting to be spent on other things that actually brought me joy/a challenge like trying new movie genres, meeting new people, finding hobbies, deciding next steps. Always trying to get away from what made me so sad, selfish and controlling. Eventually I could even workout again without associating weightloss to it, just strength.  \nI can't pinpoint where the tables turned but one random day (not so long ago tbh) I realized that I couldn't remember a recent event where I had felt shame/disgust/depressed relating to my body.\n\nAgain, I don't have the steps for it, but I like to think that if I had read something like this I could've found a little hope sooner.",
      "created_utc": 1746983653.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mqrdky4",
      "author": "Mountain_Friend7865",
      "body": "Most average people don’t care how they look or what they weigh, they are large mammals that eat everything.",
      "created_utc": 1746473503.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqtohh0",
      "author": "Shuyuya",
      "body": "Laziness or love for themselves. Sometimes both lol",
      "created_utc": 1746500752.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mru2qwz",
      "author": "eatrocks37",
      "body": "Respectfully - in my perspective, I have way more pressing things to be giving a shit about other than my weight. Do I worry about it sometimes? Yeah. But when I think about it, I worry about how far my body could take me if my daughter and I needed to flee our home in an emergency.",
      "created_utc": 1747009128.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqth0xe",
      "author": "Important-Media1349",
      "body": "Incredibly relatable - Ive been in recovery for 2 years but I don’t think there will ever be a day where I don’t think at all about what I’m eating and how it will effect me",
      "created_utc": 1746497958.0,
      "score": 9,
      "context": [
        {
          "id": "mqqml63",
          "author": "None",
          "body": "I don't even remember how I acted in relation to this before this disease",
          "created_utc": 1746465626.0
        }
      ]
    },
    {
      "id": "mqqnca2",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing",
      "created_utc": 1746465841.0,
      "score": 6,
      "context": [
        {
          "id": "mqqml63",
          "author": "None",
          "body": "I don't even remember how I acted in relation to this before this disease",
          "created_utc": 1746465626.0
        }
      ]
    },
    {
      "id": "mqqr42z",
      "author": "Coffeegreysky12",
      "body": "You described it perfectly. That's what it feels like. It really warps your perception of yourself",
      "created_utc": 1746466909.0,
      "score": 5,
      "context": [
        {
          "id": "mqqqtgr",
          "author": "randommeowz",
          "body": "it warps your perception so bad. i think these healthy people are probably more in tune with their body and their natural needs and hunger signals and having healthier patterns in life. i was also thin before it became bad, but its like my whole world flipped on its head when i became aware of my weight and calories. just a full bodyslam into a different world. ive reached my highs and severe lows, ive felt delusionally great and horrid near death, and yet i cant remember how i could be normal before it. its a horrible intruder in my head that once i saw, i could never unsee. i think maybe some people dont have this at all, or it is so off in the shadows for others it doesnt really get activated. forbidden knowledge, i guess. the more you look in its eyes the more fucked yours get. or thats how i see it in my experience.",
          "created_utc": 1746466825.0
        }
      ]
    },
    {
      "id": "mqrh1ck",
      "author": "Coffeegreysky12",
      "body": "Well said. Other people aren't attached to their weight as people with anorexia are.",
      "created_utc": 1746474528.0,
      "score": 4,
      "context": [
        {
          "id": "mqrfl84",
          "author": "Result-Beneficial",
          "body": "I think this every time I see someone weighing themselves at the gym, like in the middle of the day with all their clothes on. Where as I could never imagining not weighing myself naked, in the morning, after I’ve gone to the bathroom. The conditions have to be perfect! \nI guess other people just aren’t attached to their weight in the same way. They can just weigh themselves and then move on with their day.",
          "created_utc": 1746474100.0
        }
      ]
    },
    {
      "id": "mqqtjra",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing. Well said",
      "created_utc": 1746467600.0,
      "score": 4,
      "context": [
        {
          "id": "mqqt28l",
          "author": "Phantasmortuary",
          "body": "I think most people only start worrying about how their eating affects their weight if they start having noticeable changes in their weight. \n\nMy Mum was the about the same size about as long as I've been alive up until she started going through menopause and went up a size or two. She didn't start dieting or anything, just didn't wear her older clothes. Never bemoaned her \"old body\" or anything.  \n\nI too know I wouldn't be overweight if I ate more. For me it's more about feeling more comfortable at a certain weight/size even though it's a ridiculous destination. Since my Mum died several years ago, I feel less shame losing weight, as I don't have to see her worry. \n\nThere are still goals I have though, so I kind of live in a quasi-place. For instance, I don't exactly have fear foods, more-so anxiety around food in social settings.",
          "created_utc": 1746467462.0
        }
      ]
    },
    {
      "id": "mqrwdi4",
      "author": "Coffeegreysky12",
      "body": "That's true",
      "created_utc": 1746478996.0,
      "score": 0,
      "context": [
        {
          "id": "mqrvyrd",
          "author": "buzzybody21",
          "body": "For the most part, people without eating disorders don’t regularly weigh themselves, obsessively worry about the result of caloric intake on their body, and aren’t haunted by the constant thoughts. But everyone’s on a different journey with their bodies.",
          "created_utc": 1746478873.0
        }
      ]
    },
    {
      "id": "mqrzgzh",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing your perspective on this issue",
      "created_utc": 1746479934.0,
      "score": 3,
      "context": [
        {
          "id": "mqryjl8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1746479649.0
        }
      ]
    },
    {
      "id": "mqsinrf",
      "author": "Coffeegreysky12",
      "body": "Yes, it's such a painful disorder. It really changes how you view yourself and everyone around you",
      "created_utc": 1746486211.0,
      "score": 4,
      "context": [
        {
          "id": "mqsgrfp",
          "author": "EepyPrincessKitten",
          "body": "I have had anorexia since I was literally 7/8 with signs from an earlier age so it really has been my entire sentient life. I absolutely get you , like I geniunly don’t understand how people can just eat what they want , when they want without being stressed about it but also without binging . I guess other than people who are obese/other eating disorders. It’s painful and I envy everyone around me . ESPECIALLY naturally skinny people who just somehow perfectly regulate their weight without trying + still eating fast food etc",
          "created_utc": 1746485570.0
        }
      ]
    },
    {
      "id": "mqrzlus",
      "author": "Coffeegreysky12",
      "body": "Exactly",
      "created_utc": 1746479976.0,
      "score": 1,
      "context": [
        {
          "id": "mqryqlp",
          "author": "TeakVanSol",
          "body": "People do worry about their weight, but it’s much more generalized with a realistic approach to handling it. Eat slightly fewer calories and exercise. They listen to their doctors (if that concern exists). We live in a weight obsessed society but people who aren’t already predisposed don’t fall down the rabbit hole. It’s considered a disorder for a reason. We’re just different.",
          "created_utc": 1746479709.0
        }
      ]
    },
    {
      "id": "mqrzwnd",
      "author": "Coffeegreysky12",
      "body": "Same for me. People without anorexia may have a hard time understanding why anorexic people do what they do. And people with anorexia will have a hard time understanding why healthy people do what they do.",
      "created_utc": 1746480069.0,
      "score": 3,
      "context": [
        {
          "id": "mqrzb3q",
          "author": "Big-Molasses4788",
          "body": "Thank u for sharing this\nHonestly I feel exactly the same way so ur not alone \nMany people without anorexia don’t experience the same level of distress around eating and weight as we do because their brains simply don’t fixate on those numbers the way an ED does. I rlly wish I could go back to when I was healthy weight and never counted a single calorie or worried about what and when I'll eat and I'll just never truly understand how others aren't obsessively attached  to their weight and food intake like we are.",
          "created_utc": 1746479884.0
        }
      ]
    },
    {
      "id": "mqszcib",
      "author": "Coffeegreysky12",
      "body": "I am glad you are doing better. Thank you for sharing",
      "created_utc": 1746491853.0,
      "score": 1,
      "context": [
        {
          "id": "mqsym0t",
          "author": "theconfidentobserver",
          "body": "I don’t have a current eating disorder, but now that I don’t - I feel the best I have ever felt about my body and my weight. Going through pregnancy and breastfeeding really helped me to understand the importance of eating real food and how it impacts our organs and how eating well and often can really benefit your health/appearance. When I was starving and restricting… it’s all I could think about and I never felt good. Now I don’t think about it(because I am full and nourished) and I feel great.",
          "created_utc": 1746491601.0
        }
      ]
    },
    {
      "id": "mqsjthf",
      "author": "Coffeegreysky12",
      "body": "I hope I can get back to that place too one day. It was so freeing to wake up and not care about my weight or worry about what I was eating.",
      "created_utc": 1746486603.0,
      "score": 1,
      "context": [
        {
          "id": "mqsj257",
          "author": "bpa23",
          "body": "This was me before becoming disordered 10 years ago. I had moments some years ago being frustrated with past me for not knowing how much I weighed at my slimmest/happiest so I could aim for that, or could be happy I had surpassed that. But I just didn't think about it ever. Of course now me is so grateful and hopeful I can get back to that place of not caring one day.",
          "created_utc": 1746486345.0
        }
      ]
    },
    {
      "id": "mqtcmf9",
      "author": "Coffeegreysky12",
      "body": "Thank you for the advice",
      "created_utc": 1746496423.0,
      "score": 1,
      "context": [
        {
          "id": "mqtafmm",
          "author": "Key-Amount-4249",
          "body": "I'm fully recovered right now. I think what helped the most is to set a goal, something that you really want to achieve for yourself and work for it every day. It could be anything for you, music, art, science, medicine, tailoring, cooking, cleaning.",
          "created_utc": 1746495677.0
        }
      ]
    },
    {
      "id": "mqymvpd",
      "author": "Coffeegreysky12",
      "body": "Same",
      "created_utc": 1746568395.0,
      "score": 1,
      "context": [
        {
          "id": "mqymha7",
          "author": "spacing_out3",
          "body": "I can’t even imagine how people don’t worry or think about it every day.",
          "created_utc": 1746568275.0
        }
      ]
    },
    {
      "id": "mrs1b6m",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing. I am glad you are doing better",
      "created_utc": 1746983991.0,
      "score": 1,
      "context": [
        {
          "id": "mrs07tg",
          "author": "lara_is_",
          "body": "(sorry for such a long comment, its hard to find words for this topic for me)  \n  \nI had anorexia for a period of time (before 18yo) and I fully believed that even IF I recovered, I would never feel positive about my body, my eating habits and what people thought/associated when they saw my body.  \n  \nI can now (I'm 26) say that I live a day to day life where my body size and what I eat are neutral things, its just like the color of my skin and brushing my teeth — I'm neutral about them, and think about them basically only in terms of objective health. Of course there are some practical aspects that annoy me like not being able to use a clothing item because it doesn't fit and I really liked it (big or small, its the same feeling). While in the past this would've made me spiral into a series of actions of self hate and control, now I start thinking where I could find another piece of clothing that I love and if anyone I know would like my item now that I'm not going to use it anymore. I can look at a picture where I don't feel like the angle/light flattered me and not feel disgusted, it simply is that: a non-flatering picture, that means nothing about my value as a person.\n\nI wish I had a step-by-step to how this change happened, but maybe its too personal/complex to be applied to everybody. I was heavily depressed while anorexic and while in recovery, and after recovery as well — turned out to be frustration and devaluation caused by untreated ADHD. When my anorexia started I was a little socially isolated and the friends I did have were people that cared a lot about how they looked, projected their frustrations and modeled this projection by commenting how others look and attaching value to it. I had been friends with them for years before this — this was my (perceived) reality.  \nWhen I changed schools I was in kind of a forced recovery because I was being closely monitored by a family member, however my mind was still completely focused on anorexia. Then the social scenario changed: these new colleagues didn't really care much about people's looks besides some comments on fashion / self expression. I noticed they were much more content with their lives, they had many more interests and hobbies and most of all, they showed me a reality beyond superficial value and I couldn't ignore anymore how shallow I had been towards myself: masked self-hate as some kind of need to adapt to a standard that whoever the fuck created. I started feeling a bit shameful of being so self centered, tried to model confidence (felt weird and forced for years, but \"fake it till you make it\" worked in the end) and never let myself be surrounded by superficial people again (not online and not in person either), made an effort to eliminate triggers from my life (deleted inspo accounts, deleted tumblr, actively rejected suggestions from my \"for you\" pages, tried thinking of myself as someone else to garner empathy because I could never be so cruel with others as I was to myself etc). At this point I still struggled but I did feel like a percentage of the time my brain spent thinking about body image was starting to be spent on other things that actually brought me joy/a challenge like trying new movie genres, meeting new people, finding hobbies, deciding next steps. Always trying to get away from what made me so sad, selfish and controlling. Eventually I could even workout again without associating weightloss to it, just strength.  \nI can't pinpoint where the tables turned but one random day (not so long ago tbh) I realized that I couldn't remember a recent event where I had felt shame/disgust/depressed relating to my body.\n\nAgain, I don't have the steps for it, but I like to think that if I had read something like this I could've found a little hope sooner.",
          "created_utc": 1746983653.0
        }
      ]
    },
    {
      "id": "mqrhgj6",
      "author": "Coffeegreysky12",
      "body": "I think a lot of healthy people who aren't anorexic actually do care about what they look like, but they do not fixate on their weight in the way that a person with anorexia does",
      "created_utc": 1746474651.0,
      "score": 2,
      "context": [
        {
          "id": "mqrdky4",
          "author": "Mountain_Friend7865",
          "body": "Most average people don’t care how they look or what they weigh, they are large mammals that eat everything.",
          "created_utc": 1746473503.0
        }
      ]
    },
    {
      "id": "mqqwu63",
      "author": "Phantasmortuary",
      "body": "Thank you, and thanks for the thought-provoking post.",
      "created_utc": 1746468546.0,
      "score": 6,
      "context": [
        {
          "id": "mqqt28l",
          "author": "Phantasmortuary",
          "body": "I think most people only start worrying about how their eating affects their weight if they start having noticeable changes in their weight. \n\nMy Mum was the about the same size about as long as I've been alive up until she started going through menopause and went up a size or two. She didn't start dieting or anything, just didn't wear her older clothes. Never bemoaned her \"old body\" or anything.  \n\nI too know I wouldn't be overweight if I ate more. For me it's more about feeling more comfortable at a certain weight/size even though it's a ridiculous destination. Since my Mum died several years ago, I feel less shame losing weight, as I don't have to see her worry. \n\nThere are still goals I have though, so I kind of live in a quasi-place. For instance, I don't exactly have fear foods, more-so anxiety around food in social settings.",
          "created_utc": 1746467462.0
        },
        {
          "id": "mqqtjra",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing. Well said",
          "created_utc": 1746467600.0
        }
      ]
    },
    {
      "id": "mqs87dv",
      "author": "Big-Molasses4788",
      "body": "Yes exactly this\nThe worst part is when ppl without anorexia think that it's our choice and that just eating is the solution. 😭😭😭😭",
      "created_utc": 1746482695.0,
      "score": 5,
      "context": [
        {
          "id": "mqrzb3q",
          "author": "Big-Molasses4788",
          "body": "Thank u for sharing this\nHonestly I feel exactly the same way so ur not alone \nMany people without anorexia don’t experience the same level of distress around eating and weight as we do because their brains simply don’t fixate on those numbers the way an ED does. I rlly wish I could go back to when I was healthy weight and never counted a single calorie or worried about what and when I'll eat and I'll just never truly understand how others aren't obsessively attached  to their weight and food intake like we are.",
          "created_utc": 1746479884.0
        },
        {
          "id": "mqrzwnd",
          "author": "Coffeegreysky12",
          "body": "Same for me. People without anorexia may have a hard time understanding why anorexic people do what they do. And people with anorexia will have a hard time understanding why healthy people do what they do.",
          "created_utc": 1746480069.0
        }
      ]
    },
    {
      "id": "mrv9ahz",
      "author": "TumbleweedFabulous15",
      "body": "Plus there’s a genetic component and plenty of people have a sense of control and freedom and love in their lives",
      "created_utc": 1747027622.0,
      "score": 1,
      "context": [
        {
          "id": "mqrdky4",
          "author": "Mountain_Friend7865",
          "body": "Most average people don’t care how they look or what they weigh, they are large mammals that eat everything.",
          "created_utc": 1746473503.0
        },
        {
          "id": "mqrhgj6",
          "author": "Coffeegreysky12",
          "body": "I think a lot of healthy people who aren't anorexic actually do care about what they look like, but they do not fixate on their weight in the way that a person with anorexia does",
          "created_utc": 1746474651.0
        }
      ]
    },
    {
      "id": "mqqwy9f",
      "author": "Coffeegreysky12",
      "body": "You are welcome",
      "created_utc": 1746468580.0,
      "score": 2,
      "context": [
        {
          "id": "mqqt28l",
          "author": "Phantasmortuary",
          "body": "I think most people only start worrying about how their eating affects their weight if they start having noticeable changes in their weight. \n\nMy Mum was the about the same size about as long as I've been alive up until she started going through menopause and went up a size or two. She didn't start dieting or anything, just didn't wear her older clothes. Never bemoaned her \"old body\" or anything.  \n\nI too know I wouldn't be overweight if I ate more. For me it's more about feeling more comfortable at a certain weight/size even though it's a ridiculous destination. Since my Mum died several years ago, I feel less shame losing weight, as I don't have to see her worry. \n\nThere are still goals I have though, so I kind of live in a quasi-place. For instance, I don't exactly have fear foods, more-so anxiety around food in social settings.",
          "created_utc": 1746467462.0
        },
        {
          "id": "mqqtjra",
          "author": "Coffeegreysky12",
          "body": "Thank you for sharing. Well said",
          "created_utc": 1746467600.0
        },
        {
          "id": "mqqwu63",
          "author": "Phantasmortuary",
          "body": "Thank you, and thanks for the thought-provoking post.",
          "created_utc": 1746468546.0
        }
      ]
    },
    {
      "id": "mqs8rbp",
      "author": "Coffeegreysky12",
      "body": "Yes. Saying \"Just eat\" won't cure a person with anorexia, and if it was that simple, so many wouldn't be struggling",
      "created_utc": 1746482878.0,
      "score": 3,
      "context": [
        {
          "id": "mqrzb3q",
          "author": "Big-Molasses4788",
          "body": "Thank u for sharing this\nHonestly I feel exactly the same way so ur not alone \nMany people without anorexia don’t experience the same level of distress around eating and weight as we do because their brains simply don’t fixate on those numbers the way an ED does. I rlly wish I could go back to when I was healthy weight and never counted a single calorie or worried about what and when I'll eat and I'll just never truly understand how others aren't obsessively attached  to their weight and food intake like we are.",
          "created_utc": 1746479884.0
        },
        {
          "id": "mqrzwnd",
          "author": "Coffeegreysky12",
          "body": "Same for me. People without anorexia may have a hard time understanding why anorexic people do what they do. And people with anorexia will have a hard time understanding why healthy people do what they do.",
          "created_utc": 1746480069.0
        },
        {
          "id": "mqs87dv",
          "author": "Big-Molasses4788",
          "body": "Yes exactly this\nThe worst part is when ppl without anorexia think that it's our choice and that just eating is the solution. 😭😭😭😭",
          "created_utc": 1746482695.0
        }
      ]
    },
    {
      "id": "mqu7xbs",
      "author": "Big-Molasses4788",
      "body": "Exactlyyyy😭",
      "created_utc": 1746509606.0,
      "score": 1,
      "context": [
        {
          "id": "mqrzb3q",
          "author": "Big-Molasses4788",
          "body": "Thank u for sharing this\nHonestly I feel exactly the same way so ur not alone \nMany people without anorexia don’t experience the same level of distress around eating and weight as we do because their brains simply don’t fixate on those numbers the way an ED does. I rlly wish I could go back to when I was healthy weight and never counted a single calorie or worried about what and when I'll eat and I'll just never truly understand how others aren't obsessively attached  to their weight and food intake like we are.",
          "created_utc": 1746479884.0
        },
        {
          "id": "mqrzwnd",
          "author": "Coffeegreysky12",
          "body": "Same for me. People without anorexia may have a hard time understanding why anorexic people do what they do. And people with anorexia will have a hard time understanding why healthy people do what they do.",
          "created_utc": 1746480069.0
        },
        {
          "id": "mqs87dv",
          "author": "Big-Molasses4788",
          "body": "Yes exactly this\nThe worst part is when ppl without anorexia think that it's our choice and that just eating is the solution. 😭😭😭😭",
          "created_utc": 1746482695.0
        },
        {
          "id": "mqs8rbp",
          "author": "Coffeegreysky12",
          "body": "Yes. Saying \"Just eat\" won't cure a person with anorexia, and if it was that simple, so many wouldn't be struggling",
          "created_utc": 1746482878.0
        }
      ]
    }
  ]
}