{
  "id": "1kkwymu",
  "subreddit": "AnorexiaNervosa",
  "author": "Equivalent-Offer7869",
  "created_utc": 1747067394.0,
  "title": "why do these ppl want ana bruh",
  "selftext": "i hate that ana tumblr 2013 is coming back. 'well i'll get skinnny!!!!' stfu. you wanna restrict to get skinny but dont realize that you're on the verge of passing out every other hour. you're either sweating hot or shivering your balls off. your hair starts to thin out over time and you dont even realize it till you're showering and you think ur fucking balding. heart palpitations. your entire body fucking aching\n\nbut yeah girl...skinny!!! 😐 \n",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1kkwymu/why_do_these_ppl_want_ana_bruh/",
  "score": 223,
  "num_comments": 53,
  "comments": [
    {
      "id": "mrxr7jq",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1747067395.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mrxu4jt",
      "author": "basicbi-",
      "body": "You don't want it. I'm nineteen and I'm losing teeth, my ears are always ringing, I can't hear shit, I'm dizzy, my legs are tingly, one of my arms is numb, I always feel my heartbeat, I have a hard time taking deep breaths, I'm always cold & winded, I have at least 8 unexplainable bruises all the time, my joints hurt, and I'm always nauseous. This ain't even touching on the mental shit.\nWaking up every morning cataloging the shit that's wrong while debating if I caused it w/ my ed or I'm actually sick is hell. I can't mention these issues bc it's my own damn fault and I'm not gonna do anything about it. It's the constant \"is this serious enough for concern?\" Yall even everything is blurry, this ain't it don't try for it",
      "created_utc": 1747068261.0,
      "score": 68,
      "context": []
    },
    {
      "id": "mrxs59c",
      "author": "UnicornPoopCircus",
      "body": "I was in the Free People store yesterday. First of all, ana-chic is definitely back in a big way. Second, I heard two girls (I say girls, because there's no way they were adult women), talking about restricting. Bold as blue jays! Full voice in a public space! I have my theories as to why it's fashionable again, but it's all so dumb!",
      "created_utc": 1747067676.0,
      "score": 76,
      "context": []
    },
    {
      "id": "mry09j8",
      "author": "valentine420420",
      "body": "i feel so bad for them they have no idea what theyre about to get into",
      "created_utc": 1747070054.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mryhgkd",
      "author": "Fluttery_Soul",
      "body": "That was kind of me....I thought anorexic people were so lucky they were 'disciplined enough' to lose weight and I wished I had it so I could get skinny fast. Anyone who thinks ana is desirable has no idea...\n\n\nNow I am paying the consequences and continue to do so. I have frequent urination and go every 1-1.5 hours, indigestion, bloating, freezing in the middle of summer, dry ass skin, painful stomach aches everytime I dare to finish a meal in one sitting and the problems increase day by day. Oh and the body dysmorphia that won't ever let me see myself as anything close to skinny enough bc there's no such thing. It's an addiction, as obsession, a curse.",
      "created_utc": 1747075038.0,
      "score": 29,
      "context": []
    },
    {
      "id": "mryk5n4",
      "author": "myrasghost",
      "body": "i feel like most people’s EDs begin from wanting to have one and kinda forcing themself to be disordered, at least that’s the case for me. my anorexia started because i wanted to be skinny and i would force myself to have disordered behaviors until it became natural for me",
      "created_utc": 1747075831.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mryo8pk",
      "author": "Badgers_are_cute",
      "body": "2013 Tumblr 'Thinsporation' was literally what planted the ED in my head when i was 12 or 13 years old. I actually remember where I was, who I was with, how it make me feel, and suddenly I had this thing that all my friends were doing and I genuinely believed being skinnier and losing weight would fix my problems. \n\n12 years later, I'm mentioning it on an anorexia subreddit. It's so fucked up. ProAna is awful, and while I don't have any personal hatred towards those who post it (because they clearly need serious therapy), I do think they need to take serious responsibility for it. They are accountable for messing up the minds of young impressionable people like myself 12 years ago. \n\nIf you are ProAna, or if you need a space to let your ED express itself, please make it a private page at least. Don't make that shit public. It could literally cause someone to eventually die.",
      "created_utc": 1747077064.0,
      "score": 27,
      "context": []
    },
    {
      "id": "mrycox1",
      "author": "NeitherSpace3408",
      "body": "I’ve lost four teeth because of ana, some days I wake up weak and shaking so bad I have to crawl to the kitchen fridge and consume whatever will fill my stomach to make it stop because I feel like I’m actually dying. I feel like my value as a human is limited to how thin I am because I’m admired by others for what is in reality my suffering. “But yay so skinny” 😒",
      "created_utc": 1747073631.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mryp4jg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1747077331.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mrxv3ng",
      "author": "ankkani",
      "body": "And the idiots don't realise that the skinniness gotten from ana isn't maintainable, it'll transform into bulimia/another disorder or you get treated lol. Or yes live in hell",
      "created_utc": 1747068546.0,
      "score": 35,
      "context": []
    },
    {
      "id": "mry1mqs",
      "author": "Aromatic_Note8944",
      "body": "Yeah  it’s not worth it. I love having thick hair. My hair was so short and thin before. Gym and protein baby 💪",
      "created_utc": 1747070447.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mryv4u7",
      "author": "Kurapikasscarleteyes",
      "body": "They romanticize it. They only see the glorification of it on social media",
      "created_utc": 1747079146.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mrxxloo",
      "author": "Lopsided-Elk-748",
      "body": "I wake up soaking wet from sweat and shivering freezing cold most nights. I have to wear a wig. I faint when I walk across the room. \n\n\nNo one even acknowledges my body anyway. I'm at least taking vitamins and drinking more. \n\n\nI can't even eat one or two meals without feeling guilt due to water weight. I hate myself because I don't agree with my actions and feel like a bad parent. \n\n\nI'm grump all the time bc I'm hungry! ",
      "created_utc": 1747069276.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mry621w",
      "author": "rachrachcalero",
      "body": "Ah the memories of old come back to haunt me in adulthood. Frkn awful",
      "created_utc": 1747071712.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mrzihye",
      "author": "sa1ami_lid",
      "body": "It's the mentality of \"I'll get to my gw and then stop\" that gets me because no, you won't! You will not stop because you will stop recognising progress, and the goal will always move back, always be lower than last time because your brain is eating itself and can't see how much you've lost.\n\nEveryone thinks that they'll be the one who makes it out mentally unscathed, who can \"be anorexic\" for X amount of time, then quit, as if it's a damn prescription. Newsflash, that's not going to happen. No one can outrun it or its side effects no matter how many supplements you take. It doesn't matter how strong you start. The disorder eats away at you in every way, and you can't simply stop that when you feel like it.\n\nI'm scared for the next generation of young people who will be influenced by this the most from seeing \"skinnychic\" media at the most important developmental period of their lives.",
      "created_utc": 1747086244.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mryryq2",
      "author": "zaddyh0e",
      "body": "it honestly makes me sooo miserable. whenever i go to any supermarket i always hear young children talking about food being healthy because it’s “low in calories”. why do literal kids know about calories and their relation to “health”???",
      "created_utc": 1747078185.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ms0djho",
      "author": "walking-with-spiders",
      "body": "the resurgence of pro ana is SO scary because that used to be me, i used to think i wanted an ED. i wished i had the “self control” i thought people with restrictive EDs had. i didn’t understand the reality of an eating disorder so i restricted fully with the intention of developing one, using thinspo to motivate me and following- well, trying and failing to follow- those stupid pro ana “diets” like that insanely restrictive one that was like 8 weeks long with the 3 letter name that ended with c, iykyk 🫠\n\nand then when my mental health and life circumstances fell into place in a way that allowed me to actually be able to restrict, to finally have that “self control” that i craved, it was EUPHORIC. i was losing weight insanely fast, i felt great about myself, i got this rush of dopamine every time i saw the number go down. i had this manic energy all the time and i felt like my life finally had a purpose!! i was like why does everyone act like this is so awful? i’m totally fine!! actually i feel amazing!! and then the honeymoon phase ended lmao.\n\nnow i don’t enjoy any part of restricting, it doesn’t feel good, i just HAVE to do it so i’m slightly less disgusted with myself. so the guilt doesn’t keep me awake all night. i’ve missed out on so many things i wanted to do because i was afraid there’d be food (which is objectively so embarrassing. oooooo spooky hamburger so scary 😰) or because i was too weak and tired to go. i’m hungry all the time, all i can think about is food, i dream about it most nights. i’m SO weak all the time, especially in the morning before i’ve eaten and it’s really scary because sometimes i barely have the energy to drag myself to the kitchen to eat without passing out. i have no personality or hobbies anymore, my whole body hurts all the time, i’m always lightheaded and always feel like i’m about to pass out, my digestion is all fucked up. basically i just feel like shit constantly.\n\nbut this is what i wanted, right? every step of the way, i didn’t just want to lose weight, i wanted to be anorexic!! i really thought i did. you just can’t truly know what it’s like until you’ve experienced it and the way that eating disorders are being (not-so-)subtly promoted and glamorized on social media again is terrifying because i know how alluring ED’s can seem when you hate yourself and just want to be thin and i don’t want ANYONE else to go through this.\n\ni didn’t mean to ramble like this i’m sorry this post just really made me think about how i was one of those people who wanted an ED and how pro ana 2.0 is gonna make a whole new generation of kids think they want one too and go through the same hell and it’s terrifying :/",
      "created_utc": 1747096656.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mrz5u1p",
      "author": "to-the-moon-andback",
      "body": "There’s some truly disgusting side effects no one wants to talk about. Your muscles will break down and you will straight up piss yourself. Does adult bed wetting sound fun to you?? Here’s the kicker, you’re gonna 💩yourself too",
      "created_utc": 1747082350.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mryyj8d",
      "author": "Deepspacechris",
      "body": "Waking up swimming in sweat at night but freezing your ass off during the day in late spring, even with wool clothing and the heater on. Fun eh…",
      "created_utc": 1747080162.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mrze3di",
      "author": "Comfortable-Creme500",
      "body": "Personally, I actually learned about it from those American Girl books. I struggled with body dysmorphia since 7 and a half. Naturally, eleven year old me thought \"Oh. I never thought about that before.\" and decided it was a good idea. We know where that gets you.",
      "created_utc": 1747084868.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mrxvr0r",
      "author": "Thin-Junket-8105",
      "body": "The hair 😭",
      "created_utc": 1747068737.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ms1nznk",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1747115329.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ms20czq",
      "author": "PrincessTiaraLove",
      "body": "I don’t think people understand the consequences and just torture that comes with it.",
      "created_utc": 1747122553.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ms6b2kp",
      "author": "ri_islying2u",
      "body": "no, they know how awful it is for you and the shirt dude effects and straight up glorify it. opening tumblr is a sure fire way to ruin my day",
      "created_utc": 1747176503.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ms6fqpu",
      "author": "yonyona1",
      "body": "Maybe I’m in the wrong community but I have had the gastric sleeve. Went from 244 to 129 and now I’m at 144 and I’m terrified of gaining weight. I feel lost right new even though “I look healthy”. I get night sweats feel like I’m going to pass out and have extreme anemia. I’m rather so hot that’s it’s almost like I can’t breathe or shivering cold. I feel like now I am fantasizing about being skinny because I just feel so fat whenever I look in the mirror but everyone says I’m skinny. I don’t feel like it. I don’t know what to do honestly because looking at the weight scale is very upsetting and I keep setting a lower weight goal.",
      "created_utc": 1747178118.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ms7vjqr",
      "author": "Mountain-Safety2099",
      "body": "I don’t want it. I want to stop being able to over eat. I want the ability to control my thoughts in a healthy manner",
      "created_utc": 1747197386.0,
      "score": 2,
      "context": []
    },
    {
      "id": "msanujg",
      "author": "PsychologicalDog3769",
      "body": "Edtwt might even be worse. I have never met more hateful people on a social media app than on Twitter, especially eating disorder Twitter. I've seen people use fatspo of CHILDREN. Growing children that NEED fat on their bodies so they can grow. I've seen people nearly die because they were bullied by people on edtwt into starving themselves to the point their heart was damaged. I myself was shamed by a few people on edtwt for having to EAT WITH MY BIPOLAR MEDICATION. Mind you, I only needed 350 cals with my meds. I've seen beautiful women be used as fatspo and they're not even fat by any means. I've come across people on instagram begging people on edtwt to not use their body as thinspo. One person had a thyroid issue, they weren't even anorexic, they had a health issue that caused hypermetabolism. And they'll say \"God forbid a disordered person acts disordered.\"\n\nThis isn't disordered behavior. You're a fucking cunt. Your reach will not go past edtwt. And I think they know that, and that's why they're obsessed with it. The only validation they get is from people who are essentially encouraging them to kill themselves by starving. \n\nI understand that people need a community. I get that. Edtumblr and edtwt is not it.",
      "created_utc": 1747240495.0,
      "score": 2,
      "context": []
    },
    {
      "id": "msf04fl",
      "author": "Affectionate-Sell-69",
      "body": "They dont know how it makes you feel. Its nıt just feeling hungry or losing your hair. Its mental load is horrible and if they knew they would never want that",
      "created_utc": 1747297904.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mwuo7fw",
      "author": "abrahamsbitch",
      "body": "it's so tone deaf and maddening to hear this from people online and in real life. i am always rendered speechless when people so comfortably talk about my weight right in front of me and how they wish they could \"be that skinny\" and point at my body. first of all, weird as hell to say to someone. second, you wouldn't go up to an overweight person, point at their body and say, \"i don't wanna look like that!\" would you?\n\ngranted they think pointing out your skinniness is a compliment, but it really is just another reminder of your body image. i hate to be that sensitive person but can people really not just keep some thoughts to themselves? \n\nthey want all the glamour and none of the pain that comes with it.",
      "created_utc": 1749485011.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mrzhffe",
      "author": "MollilyPan",
      "body": "I have Chronic, intractable (don’t respond to treatment) Migraines, hyper mobile Fibromyalgia (suspected EDS), and really severe TMJ where my jaw will very painfully dislocate for sometimes\nMinutes while I try everything to get it back in place.  I have a pain clinic and take opioids almost every day just to function on some level at all. \n\nYet I have never felt worse than I did at my lowest weights.  Like guys…",
      "created_utc": 1747085910.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mrzfxf6",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1747085439.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mspgffa",
      "author": "zodiacqu33n",
      "body": "😭😭😭\nI’m not even skinny (I’m fat according to BMI bullsh*t) and still have all these symptoms. Anorexia sucks…",
      "created_utc": 1747436386.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwdxba5",
      "author": "BeansandBrewsof",
      "body": "They don’t want it omg.  I’m only 17 but have plenty of health problems cuz of it (dizzy, vertigo, tired, joint issues, cold, ringing sound in ears, etc)",
      "created_utc": 1749244712.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mrxue5f",
      "author": "Equivalent-Offer7869",
      "body": "this omg. every time i move or turn my head its like there's a delay, it's like living in a fever dream constantly",
      "created_utc": 1747068338.0,
      "score": 19,
      "context": [
        {
          "id": "mrxu4jt",
          "author": "basicbi-",
          "body": "You don't want it. I'm nineteen and I'm losing teeth, my ears are always ringing, I can't hear shit, I'm dizzy, my legs are tingly, one of my arms is numb, I always feel my heartbeat, I have a hard time taking deep breaths, I'm always cold & winded, I have at least 8 unexplainable bruises all the time, my joints hurt, and I'm always nauseous. This ain't even touching on the mental shit.\nWaking up every morning cataloging the shit that's wrong while debating if I caused it w/ my ed or I'm actually sick is hell. I can't mention these issues bc it's my own damn fault and I'm not gonna do anything about it. It's the constant \"is this serious enough for concern?\" Yall even everything is blurry, this ain't it don't try for it",
          "created_utc": 1747068261.0
        }
      ]
    },
    {
      "id": "mscbtbq",
      "author": "PerceptionOk8022",
      "body": "I can hear my heart beat pretty often, I had no idea this was from ana but yeah, you don't want it and it makes me sad when people say they do",
      "created_utc": 1747258001.0,
      "score": 3,
      "context": [
        {
          "id": "mrxu4jt",
          "author": "basicbi-",
          "body": "You don't want it. I'm nineteen and I'm losing teeth, my ears are always ringing, I can't hear shit, I'm dizzy, my legs are tingly, one of my arms is numb, I always feel my heartbeat, I have a hard time taking deep breaths, I'm always cold & winded, I have at least 8 unexplainable bruises all the time, my joints hurt, and I'm always nauseous. This ain't even touching on the mental shit.\nWaking up every morning cataloging the shit that's wrong while debating if I caused it w/ my ed or I'm actually sick is hell. I can't mention these issues bc it's my own damn fault and I'm not gonna do anything about it. It's the constant \"is this serious enough for concern?\" Yall even everything is blurry, this ain't it don't try for it",
          "created_utc": 1747068261.0
        }
      ]
    },
    {
      "id": "mrxukz6",
      "author": "Equivalent-Offer7869",
      "body": "i'll never understand why its so normalized to talk about such things in public so comfortably. its strange to me",
      "created_utc": 1747068393.0,
      "score": 21,
      "context": [
        {
          "id": "mrxs59c",
          "author": "UnicornPoopCircus",
          "body": "I was in the Free People store yesterday. First of all, ana-chic is definitely back in a big way. Second, I heard two girls (I say girls, because there's no way they were adult women), talking about restricting. Bold as blue jays! Full voice in a public space! I have my theories as to why it's fashionable again, but it's all so dumb!",
          "created_utc": 1747067676.0
        }
      ]
    },
    {
      "id": "ms0gxz3",
      "author": "britney7266",
      "body": "i always feel imposter syndrome over this stuff. not diagnosed but middle school me definitely modeled my habits after girls i saw online glamorizing it and body checking",
      "created_utc": 1747097857.0,
      "score": 9,
      "context": [
        {
          "id": "mryk5n4",
          "author": "myrasghost",
          "body": "i feel like most people’s EDs begin from wanting to have one and kinda forcing themself to be disordered, at least that’s the case for me. my anorexia started because i wanted to be skinny and i would force myself to have disordered behaviors until it became natural for me",
          "created_utc": 1747075831.0
        }
      ]
    },
    {
      "id": "mspssdw",
      "author": "thelittlewhitebunny",
      "body": "I think this is also one of the reasons the \"honeymoon phase\" is prominent in discussions online. I feel the period where you probably know what you're doing is disordered but can't really find it in yourself to care, is where the honeymoon phase takes place for a lot of people. I started off the same way, it's not like I was ignorant. I'm young (but not extremely) and live in the age of the internet, I knew they were disordered behaviors from the start. I just didn't really care, because I couldn't remember a time where I didn't think being underweight was the most beautiful and perfect I could be, even if I hadn't started engaging in the behaviors, I had a lot of thought patterns and long standing beliefs that laid the tracks for me to almost seamlessly slip into the behaviors and therefore accelerate the mental aspects as well, like obsession and genuine fear, anxiety, guilt, etc.",
      "created_utc": 1747440985.0,
      "score": 5,
      "context": [
        {
          "id": "mryk5n4",
          "author": "myrasghost",
          "body": "i feel like most people’s EDs begin from wanting to have one and kinda forcing themself to be disordered, at least that’s the case for me. my anorexia started because i wanted to be skinny and i would force myself to have disordered behaviors until it became natural for me",
          "created_utc": 1747075831.0
        }
      ]
    },
    {
      "id": "mryd0f8",
      "author": "NeitherSpace3408",
      "body": "“Thinspo~✨” we are walking ghosts. I literally couldn’t run for my life if I was in immediate danger",
      "created_utc": 1747073725.0,
      "score": 16,
      "context": [
        {
          "id": "mrycox1",
          "author": "NeitherSpace3408",
          "body": "I’ve lost four teeth because of ana, some days I wake up weak and shaking so bad I have to crawl to the kitchen fridge and consume whatever will fill my stomach to make it stop because I feel like I’m actually dying. I feel like my value as a human is limited to how thin I am because I’m admired by others for what is in reality my suffering. “But yay so skinny” 😒",
          "created_utc": 1747073631.0
        }
      ]
    },
    {
      "id": "mrzj219",
      "author": "MollilyPan",
      "body": "Constipation City omg 😂\n\nYou are so accurate about the marketing angles firmly planted in desperation. \n\nIf something about the can be exploited for money - it will be. Fuck marketing.",
      "created_utc": 1747086419.0,
      "score": 7,
      "context": [
        {
          "id": "mryp4jg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1747077331.0
        }
      ]
    },
    {
      "id": "mrxw0yp",
      "author": "Equivalent-Offer7869",
      "body": "THIS 😭",
      "created_utc": 1747068816.0,
      "score": 11,
      "context": [
        {
          "id": "mrxv3ng",
          "author": "ankkani",
          "body": "And the idiots don't realise that the skinniness gotten from ana isn't maintainable, it'll transform into bulimia/another disorder or you get treated lol. Or yes live in hell",
          "created_utc": 1747068546.0
        }
      ]
    },
    {
      "id": "ms6ctp9",
      "author": "ElectricalEconomy170",
      "body": "I caught my little brother reading a nutritional label so I said to him in a joking manner, “What do you think you are doing? You don’t need to worry about that!”. And my mom got annoyed with me and said that they need to know what’s in their food. Not at 13!",
      "created_utc": 1747177104.0,
      "score": 1,
      "context": [
        {
          "id": "mryryq2",
          "author": "zaddyh0e",
          "body": "it honestly makes me sooo miserable. whenever i go to any supermarket i always hear young children talking about food being healthy because it’s “low in calories”. why do literal kids know about calories and their relation to “health”???",
          "created_utc": 1747078185.0
        }
      ]
    },
    {
      "id": "mvklwbb",
      "author": "Function-Constant",
      "body": "this made my frontal lobe develop",
      "created_utc": 1748864498.0,
      "score": 1,
      "context": [
        {
          "id": "ms0djho",
          "author": "walking-with-spiders",
          "body": "the resurgence of pro ana is SO scary because that used to be me, i used to think i wanted an ED. i wished i had the “self control” i thought people with restrictive EDs had. i didn’t understand the reality of an eating disorder so i restricted fully with the intention of developing one, using thinspo to motivate me and following- well, trying and failing to follow- those stupid pro ana “diets” like that insanely restrictive one that was like 8 weeks long with the 3 letter name that ended with c, iykyk 🫠\n\nand then when my mental health and life circumstances fell into place in a way that allowed me to actually be able to restrict, to finally have that “self control” that i craved, it was EUPHORIC. i was losing weight insanely fast, i felt great about myself, i got this rush of dopamine every time i saw the number go down. i had this manic energy all the time and i felt like my life finally had a purpose!! i was like why does everyone act like this is so awful? i’m totally fine!! actually i feel amazing!! and then the honeymoon phase ended lmao.\n\nnow i don’t enjoy any part of restricting, it doesn’t feel good, i just HAVE to do it so i’m slightly less disgusted with myself. so the guilt doesn’t keep me awake all night. i’ve missed out on so many things i wanted to do because i was afraid there’d be food (which is objectively so embarrassing. oooooo spooky hamburger so scary 😰) or because i was too weak and tired to go. i’m hungry all the time, all i can think about is food, i dream about it most nights. i’m SO weak all the time, especially in the morning before i’ve eaten and it’s really scary because sometimes i barely have the energy to drag myself to the kitchen to eat without passing out. i have no personality or hobbies anymore, my whole body hurts all the time, i’m always lightheaded and always feel like i’m about to pass out, my digestion is all fucked up. basically i just feel like shit constantly.\n\nbut this is what i wanted, right? every step of the way, i didn’t just want to lose weight, i wanted to be anorexic!! i really thought i did. you just can’t truly know what it’s like until you’ve experienced it and the way that eating disorders are being (not-so-)subtly promoted and glamorized on social media again is terrifying because i know how alluring ED’s can seem when you hate yourself and just want to be thin and i don’t want ANYONE else to go through this.\n\ni didn’t mean to ramble like this i’m sorry this post just really made me think about how i was one of those people who wanted an ED and how pro ana 2.0 is gonna make a whole new generation of kids think they want one too and go through the same hell and it’s terrifying :/",
          "created_utc": 1747096656.0
        }
      ]
    },
    {
      "id": "ms6d5nk",
      "author": "ElectricalEconomy170",
      "body": "Me too! I remember my mom explaining what it was to me and I remember saying that it was weird and how I didn’t understand why someone would do that.",
      "created_utc": 1747177222.0,
      "score": 2,
      "context": [
        {
          "id": "mrze3di",
          "author": "Comfortable-Creme500",
          "body": "Personally, I actually learned about it from those American Girl books. I struggled with body dysmorphia since 7 and a half. Naturally, eleven year old me thought \"Oh. I never thought about that before.\" and decided it was a good idea. We know where that gets you.",
          "created_utc": 1747084868.0
        }
      ]
    },
    {
      "id": "mrydesc",
      "author": "madeofstardust___",
      "body": "I know 😭 I used to have such thick hair. I’ve had my ED for >!21 years!< now and over the past year it’s gotten so much thinner. I really hope when I start doing better and working more toward recovery it’ll grow back more. I hate it!",
      "created_utc": 1747073843.0,
      "score": 5,
      "context": [
        {
          "id": "mrxvr0r",
          "author": "Thin-Junket-8105",
          "body": "The hair 😭",
          "created_utc": 1747068737.0
        }
      ]
    },
    {
      "id": "mskevyq",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1747366124.0,
      "score": 1,
      "context": [
        {
          "id": "ms1nznk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1747115329.0
        }
      ]
    },
    {
      "id": "mskexds",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1747366139.0,
      "score": 1,
      "context": [
        {
          "id": "mrzfxf6",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1747085439.0
        }
      ]
    },
    {
      "id": "mrxv2sg",
      "author": "UnicornPoopCircus",
      "body": "And it's not always normalized. Ten years ago, I don't think they would have been so loud about it. The whole \"body positivity\" movement really turned down the volume on public behavior like that. Even when I was in high school (a million years ago) we knew better than to openly talk about our behavior.",
      "created_utc": 1747068539.0,
      "score": 21,
      "context": [
        {
          "id": "mrxs59c",
          "author": "UnicornPoopCircus",
          "body": "I was in the Free People store yesterday. First of all, ana-chic is definitely back in a big way. Second, I heard two girls (I say girls, because there's no way they were adult women), talking about restricting. Bold as blue jays! Full voice in a public space! I have my theories as to why it's fashionable again, but it's all so dumb!",
          "created_utc": 1747067676.0
        },
        {
          "id": "mrxukz6",
          "author": "Equivalent-Offer7869",
          "body": "i'll never understand why its so normalized to talk about such things in public so comfortably. its strange to me",
          "created_utc": 1747068393.0
        }
      ]
    },
    {
      "id": "ms8o1ao",
      "author": "zaddyh0e",
      "body": "my brother has started being like this and is really into the gym. i think a lot of it is from tiktok with all the emphasis on men needing to be gym bros but there’s so much contradictory information being spread",
      "created_utc": 1747213897.0,
      "score": 2,
      "context": [
        {
          "id": "mryryq2",
          "author": "zaddyh0e",
          "body": "it honestly makes me sooo miserable. whenever i go to any supermarket i always hear young children talking about food being healthy because it’s “low in calories”. why do literal kids know about calories and their relation to “health”???",
          "created_utc": 1747078185.0
        },
        {
          "id": "ms6ctp9",
          "author": "ElectricalEconomy170",
          "body": "I caught my little brother reading a nutritional label so I said to him in a joking manner, “What do you think you are doing? You don’t need to worry about that!”. And my mom got annoyed with me and said that they need to know what’s in their food. Not at 13!",
          "created_utc": 1747177104.0
        }
      ]
    },
    {
      "id": "mrymcg5",
      "author": "Thin-Junket-8105",
      "body": "I’ve had mine for 14 years and when I shower I wanna cry because of all the hair that comes out. It’s awful 😫I wear extensions so it looks thicker but I don’t think it will ever naturally be ☹️",
      "created_utc": 1747076483.0,
      "score": 2,
      "context": [
        {
          "id": "mrxvr0r",
          "author": "Thin-Junket-8105",
          "body": "The hair 😭",
          "created_utc": 1747068737.0
        },
        {
          "id": "mrydesc",
          "author": "madeofstardust___",
          "body": "I know 😭 I used to have such thick hair. I’ve had my ED for >!21 years!< now and over the past year it’s gotten so much thinner. I really hope when I start doing better and working more toward recovery it’ll grow back more. I hate it!",
          "created_utc": 1747073843.0
        }
      ]
    },
    {
      "id": "mrxvwdp",
      "author": "Equivalent-Offer7869",
      "body": "interesting, yeah im nearing the end of HS right now and i often hear people talking about restricting and how much they ate on the weekend and how 'disappointed' they are in themselves.",
      "created_utc": 1747068780.0,
      "score": 15,
      "context": [
        {
          "id": "mrxs59c",
          "author": "UnicornPoopCircus",
          "body": "I was in the Free People store yesterday. First of all, ana-chic is definitely back in a big way. Second, I heard two girls (I say girls, because there's no way they were adult women), talking about restricting. Bold as blue jays! Full voice in a public space! I have my theories as to why it's fashionable again, but it's all so dumb!",
          "created_utc": 1747067676.0
        },
        {
          "id": "mrxukz6",
          "author": "Equivalent-Offer7869",
          "body": "i'll never understand why its so normalized to talk about such things in public so comfortably. its strange to me",
          "created_utc": 1747068393.0
        },
        {
          "id": "mrxv2sg",
          "author": "UnicornPoopCircus",
          "body": "And it's not always normalized. Ten years ago, I don't think they would have been so loud about it. The whole \"body positivity\" movement really turned down the volume on public behavior like that. Even when I was in high school (a million years ago) we knew better than to openly talk about our behavior.",
          "created_utc": 1747068539.0
        }
      ]
    },
    {
      "id": "msbu446",
      "author": "ElectricalEconomy170",
      "body": "He’s literally just like this. He’s obsessed with working out ",
      "created_utc": 1747252643.0,
      "score": 1,
      "context": [
        {
          "id": "mryryq2",
          "author": "zaddyh0e",
          "body": "it honestly makes me sooo miserable. whenever i go to any supermarket i always hear young children talking about food being healthy because it’s “low in calories”. why do literal kids know about calories and their relation to “health”???",
          "created_utc": 1747078185.0
        },
        {
          "id": "ms6ctp9",
          "author": "ElectricalEconomy170",
          "body": "I caught my little brother reading a nutritional label so I said to him in a joking manner, “What do you think you are doing? You don’t need to worry about that!”. And my mom got annoyed with me and said that they need to know what’s in their food. Not at 13!",
          "created_utc": 1747177104.0
        },
        {
          "id": "ms8o1ao",
          "author": "zaddyh0e",
          "body": "my brother has started being like this and is really into the gym. i think a lot of it is from tiktok with all the emphasis on men needing to be gym bros but there’s so much contradictory information being spread",
          "created_utc": 1747213897.0
        }
      ]
    },
    {
      "id": "mrxwrne",
      "author": "UnicornPoopCircus",
      "body": "When I was in high school, so many of us restricted! It was incredibly common. My best friend would (quietly) brag about her *very* restrictive behavior. Then one day, she passed out in the parking lot. The ambulance was called. It was a huge deal. Suddenly, we were besieged by motivational speakers and educational materials about EDs. We all knew to be very quiet about it after that. We were still restricting, but we had to keep it from being detected.",
      "created_utc": 1747069031.0,
      "score": 13,
      "context": [
        {
          "id": "mrxs59c",
          "author": "UnicornPoopCircus",
          "body": "I was in the Free People store yesterday. First of all, ana-chic is definitely back in a big way. Second, I heard two girls (I say girls, because there's no way they were adult women), talking about restricting. Bold as blue jays! Full voice in a public space! I have my theories as to why it's fashionable again, but it's all so dumb!",
          "created_utc": 1747067676.0
        },
        {
          "id": "mrxukz6",
          "author": "Equivalent-Offer7869",
          "body": "i'll never understand why its so normalized to talk about such things in public so comfortably. its strange to me",
          "created_utc": 1747068393.0
        },
        {
          "id": "mrxv2sg",
          "author": "UnicornPoopCircus",
          "body": "And it's not always normalized. Ten years ago, I don't think they would have been so loud about it. The whole \"body positivity\" movement really turned down the volume on public behavior like that. Even when I was in high school (a million years ago) we knew better than to openly talk about our behavior.",
          "created_utc": 1747068539.0
        },
        {
          "id": "mrxvwdp",
          "author": "Equivalent-Offer7869",
          "body": "interesting, yeah im nearing the end of HS right now and i often hear people talking about restricting and how much they ate on the weekend and how 'disappointed' they are in themselves.",
          "created_utc": 1747068780.0
        }
      ]
    },
    {
      "id": "ms0iuz5",
      "author": "heartshapedmoon",
      "body": "My high school anorexic self would’ve felt so proud that I got so skinny I caused a bunch of motivational speakers to come 💀",
      "created_utc": 1747098547.0,
      "score": 14,
      "context": [
        {
          "id": "mrxs59c",
          "author": "UnicornPoopCircus",
          "body": "I was in the Free People store yesterday. First of all, ana-chic is definitely back in a big way. Second, I heard two girls (I say girls, because there's no way they were adult women), talking about restricting. Bold as blue jays! Full voice in a public space! I have my theories as to why it's fashionable again, but it's all so dumb!",
          "created_utc": 1747067676.0
        },
        {
          "id": "mrxukz6",
          "author": "Equivalent-Offer7869",
          "body": "i'll never understand why its so normalized to talk about such things in public so comfortably. its strange to me",
          "created_utc": 1747068393.0
        },
        {
          "id": "mrxv2sg",
          "author": "UnicornPoopCircus",
          "body": "And it's not always normalized. Ten years ago, I don't think they would have been so loud about it. The whole \"body positivity\" movement really turned down the volume on public behavior like that. Even when I was in high school (a million years ago) we knew better than to openly talk about our behavior.",
          "created_utc": 1747068539.0
        },
        {
          "id": "mrxvwdp",
          "author": "Equivalent-Offer7869",
          "body": "interesting, yeah im nearing the end of HS right now and i often hear people talking about restricting and how much they ate on the weekend and how 'disappointed' they are in themselves.",
          "created_utc": 1747068780.0
        },
        {
          "id": "mrxwrne",
          "author": "UnicornPoopCircus",
          "body": "When I was in high school, so many of us restricted! It was incredibly common. My best friend would (quietly) brag about her *very* restrictive behavior. Then one day, she passed out in the parking lot. The ambulance was called. It was a huge deal. Suddenly, we were besieged by motivational speakers and educational materials about EDs. We all knew to be very quiet about it after that. We were still restricting, but we had to keep it from being detected.",
          "created_utc": 1747069031.0
        }
      ]
    },
    {
      "id": "ms190vt",
      "author": "UnicornPoopCircus",
      "body": "We did get a good giggle out of it at the time.",
      "created_utc": 1747108218.0,
      "score": 6,
      "context": [
        {
          "id": "mrxs59c",
          "author": "UnicornPoopCircus",
          "body": "I was in the Free People store yesterday. First of all, ana-chic is definitely back in a big way. Second, I heard two girls (I say girls, because there's no way they were adult women), talking about restricting. Bold as blue jays! Full voice in a public space! I have my theories as to why it's fashionable again, but it's all so dumb!",
          "created_utc": 1747067676.0
        },
        {
          "id": "mrxukz6",
          "author": "Equivalent-Offer7869",
          "body": "i'll never understand why its so normalized to talk about such things in public so comfortably. its strange to me",
          "created_utc": 1747068393.0
        },
        {
          "id": "mrxv2sg",
          "author": "UnicornPoopCircus",
          "body": "And it's not always normalized. Ten years ago, I don't think they would have been so loud about it. The whole \"body positivity\" movement really turned down the volume on public behavior like that. Even when I was in high school (a million years ago) we knew better than to openly talk about our behavior.",
          "created_utc": 1747068539.0
        },
        {
          "id": "mrxvwdp",
          "author": "Equivalent-Offer7869",
          "body": "interesting, yeah im nearing the end of HS right now and i often hear people talking about restricting and how much they ate on the weekend and how 'disappointed' they are in themselves.",
          "created_utc": 1747068780.0
        },
        {
          "id": "mrxwrne",
          "author": "UnicornPoopCircus",
          "body": "When I was in high school, so many of us restricted! It was incredibly common. My best friend would (quietly) brag about her *very* restrictive behavior. Then one day, she passed out in the parking lot. The ambulance was called. It was a huge deal. Suddenly, we were besieged by motivational speakers and educational materials about EDs. We all knew to be very quiet about it after that. We were still restricting, but we had to keep it from being detected.",
          "created_utc": 1747069031.0
        },
        {
          "id": "ms0iuz5",
          "author": "heartshapedmoon",
          "body": "My high school anorexic self would’ve felt so proud that I got so skinny I caused a bunch of motivational speakers to come 💀",
          "created_utc": 1747098547.0
        }
      ]
    }
  ]
}