{
  "id": "1km6n1e",
  "subreddit": "AnorexiaNervosa",
  "author": "Wild-Constant-3578",
  "created_utc": 1747197332.0,
  "title": "Hospitalized",
  "selftext": "Well it's finally happened. I was taken to the hospital because I was short of breath, dizzy, blurry vision, loss of balance. They did labs and the doctor said \"I don't know what's going on I'm going to get you to a smarter doctor and admit you upstairs because I saw those labs and said 'boom admission'\". He said my glucose is low and my blood is dangerously acidic. He said \"It's like your body is starving but you're not\" I can't tell him that I am. I haven't eaten since 5pm Friday, and intended not eating until this upcoming Friday. I know, terrible, but I'm an addict. I can't bring myself to eat. They brought me apple juice? Dumped it in the linens bin. Brought me peanut butter? Stuffed it in a glove and threw the glove away. I am fat so the last thing they suspect is starvation. I know I need to eat and I would tell anyone else to eat but I can't bring myself to do it. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1km6n1e/hospitalized/",
  "score": 125,
  "num_comments": 13,
  "comments": [
    {
      "id": "ms7vfj5",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1747197333.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ms81ofe",
      "author": "No-Struggle-207",
      "body": "Wish you all the best, that everything goes as you wish. All the best anyway and less stress with the clinic",
      "created_utc": 1747200425.0,
      "score": 34,
      "context": []
    },
    {
      "id": "mscms5f",
      "author": "bumbumboleji",
      "body": "Please always be open and honest with the Dr, they have seen it all before and much worse, and are not there to judge you but to help you. \n\nI wish you all the best",
      "created_utc": 1747261515.0,
      "score": 15,
      "context": []
    },
    {
      "id": "msafxdu",
      "author": "banana-itch",
      "body": "Many hugs, OP. This is really really dangerous and I know you don't see it, but your eating disorder is serious. You need to get a handle or you will die. Let the staff there stabilise you, at least for now, please. Speak to the nurse or doctor you trust the most. You're gorgeous and you don't deserve this pain.",
      "created_utc": 1747238208.0,
      "score": 20,
      "context": []
    },
    {
      "id": "msa2hqx",
      "author": "FLAluv86",
      "body": "I know you’re going to do what you’re going to do but you should at least eat a little bit of something to keep your metabolism going. Starvation slows your metabolism greatly. Your going to have a very hard time losing weight if you literally eat nothing. It’s better to restrict than to starve completely. Sry about how you feel about yourself, I am sad for you.. ☹️(hugs)🤗",
      "created_utc": 1747234341.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ms848sa",
      "author": "Stunning-Check2275",
      "body": "Did they say anything about your bmi being low?? Why would he say it’s like your body is starving but you’re not. I’m confused",
      "created_utc": 1747201818.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ms8n7sw",
      "author": "Pink_Bread_76",
      "body": "I’m so sorry. on thursday my therapist brought in the nurse who took vitals and basically said they are about to send me to hospital again :/ I’m almost right there with you",
      "created_utc": 1747213377.0,
      "score": 5,
      "context": []
    },
    {
      "id": "msf2rya",
      "author": "Plastic-Collection-7",
      "body": "sending you a bunch of love ❤️. i know you didn’t ask for advice but i highly suggest upping your intake. not eating anything at all is just gonna make you wither yourself away and fuck up your metabolism. you can keep your intake low but you need to get some cals in your system or you’ll die before even achieving anything. and pls be honest with your doctor, they’ll probably figure out eventually anyways. you’re in danger. i know this is really triggering but i truly wish you the best.",
      "created_utc": 1747299603.0,
      "score": 2,
      "context": []
    },
    {
      "id": "msjrq19",
      "author": "FunctionPatient1040",
      "body": "There juice and peanut butter is for your glucose being low and they’re trying to bring your blood sugar back to normal- you could go into a coma if it’s that low. ",
      "created_utc": 1747357294.0,
      "score": 2,
      "context": []
    },
    {
      "id": "muwfek4",
      "author": "imstillherethough",
      "body": "anorexia can kill you at any weight. honestly most of the friends from treatment i’ve had who have died haven’t been “underweight”. please take care of yourself, you deserve peace.",
      "created_utc": 1748533004.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ms8db40",
      "author": "anxious_melon_45",
      "body": "I'm guessing OP is a healthy BMI (so atypical anorexia) which is why they don't suspect starvation, but the blood acidity etc. indicate it.",
      "created_utc": 1747207104.0,
      "score": 50,
      "context": [
        {
          "id": "ms848sa",
          "author": "Stunning-Check2275",
          "body": "Did they say anything about your bmi being low?? Why would he say it’s like your body is starving but you’re not. I’m confused",
          "created_utc": 1747201818.0
        }
      ]
    },
    {
      "id": "ms8516y",
      "author": "Wild-Constant-3578",
      "body": "Because my blood levels indicate starvation. Ketoacidosis.",
      "created_utc": 1747202255.0,
      "score": 29,
      "context": [
        {
          "id": "ms848sa",
          "author": "Stunning-Check2275",
          "body": "Did they say anything about your bmi being low?? Why would he say it’s like your body is starving but you’re not. I’m confused",
          "created_utc": 1747201818.0
        }
      ]
    },
    {
      "id": "mtb0g2g",
      "author": "likpinklady",
      "body": "I had this too. My BMI is overweight but I had ketoacidosis and hypokalemia. Starvation is starvation no matter your bmi",
      "created_utc": 1747753033.0,
      "score": 2,
      "context": [
        {
          "id": "ms848sa",
          "author": "Stunning-Check2275",
          "body": "Did they say anything about your bmi being low?? Why would he say it’s like your body is starving but you’re not. I’m confused",
          "created_utc": 1747201818.0
        },
        {
          "id": "ms8516y",
          "author": "Wild-Constant-3578",
          "body": "Because my blood levels indicate starvation. Ketoacidosis.",
          "created_utc": 1747202255.0
        }
      ]
    }
  ]
}