{
  "id": "1knezth",
  "subreddit": "AnorexiaNervosa",
  "author": "_TakeYourMeds",
  "created_utc": 1747332328.0,
  "title": "Alright- let’s talk about the REAL consequences of AN",
  "selftext": "I’ll start- brain fog. Even forgetting simple things like my address..",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1knezth/alright_lets_talk_about_the_real_consequences_of/",
  "score": 179,
  "num_comments": 132,
  "comments": [
    {
      "id": "mshm47z",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1747332328.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mshp9ed",
      "author": "atx_weird_o",
      "body": "As a mom to a gorgeous daughter with AN, I saw self hatred, furry skin, brittle hair, rage when confronted about eating, lying, spending copious amounts of time in the bathroom, IBS, orthostatic blood pressure, inability to concentrate, and extreme depression. Hugs and positive thoughts to all those suffering from this horrific disease.",
      "created_utc": 1747333261.0,
      "score": 206,
      "context": []
    },
    {
      "id": "mshnrch",
      "author": "Thick_Reaction_9887",
      "body": "Not being able to move enough to even type when it's not warm enough (literally room temp is too cold)",
      "created_utc": 1747332815.0,
      "score": 92,
      "context": []
    },
    {
      "id": "mshpcf7",
      "author": "NinjaSuperb7977",
      "body": "Being unable to make actual sentences when talking to people. \nBeing unable to be around people, including family, because everything is *too much*",
      "created_utc": 1747333286.0,
      "score": 87,
      "context": []
    },
    {
      "id": "mshoscm",
      "author": "Ok_mar8788",
      "body": "when malnutrition gets so bad ur pelvic floor muscles give up and u push a lil too hard and suddenly ur intestines r like ‘ok we’re outta here’",
      "created_utc": 1747333122.0,
      "score": 59,
      "context": []
    },
    {
      "id": "msho21p",
      "author": "skin_doggg",
      "body": "i can’t remember some things for more than a few seconds due to long term starvation",
      "created_utc": 1747332904.0,
      "score": 54,
      "context": []
    },
    {
      "id": "mshtvlq",
      "author": "Human_Swordfish5490",
      "body": "Alongside all the health implications, the biggest consequences I live with is the guilt of knowing I caused stress, anxiety and worry for all my friends and family. That they've laid awake worried that I might die. That is a true consequence.",
      "created_utc": 1747334647.0,
      "score": 52,
      "context": []
    },
    {
      "id": "mshr0i1",
      "author": "_TakeYourMeds",
      "body": "Forgot to mention the inability to take a shit 😀",
      "created_utc": 1747333782.0,
      "score": 45,
      "context": []
    },
    {
      "id": "mshmzyr",
      "author": "Skythebluestars",
      "body": "Not being able to shower yourself anymore",
      "created_utc": 1747332589.0,
      "score": 41,
      "context": []
    },
    {
      "id": "mshpkms",
      "author": "FruitSalad_24",
      "body": "Messed up digestive system/ reliant on laxatives because nothing functions right",
      "created_utc": 1747333354.0,
      "score": 38,
      "context": []
    },
    {
      "id": "mshpz1h",
      "author": "WeirdGirl825",
      "body": "Brain fog, horrific headaches, being cold all the time, and digestive issues that sometimes never resolve themselves even in recovery.",
      "created_utc": 1747333472.0,
      "score": 30,
      "context": []
    },
    {
      "id": "msi3les",
      "author": "Ok-House7690",
      "body": "Too exhausted to shower or even climb some steps. Too weak to speak normally or even at a normal volume, always felt tiring to speak at normal volume. Severe digestive issues. Extreme rage towards everything and everyone. Specific triggers like - family talking bout food, forcing me to eat it. Crying 24×7 for anything and everything. Became the most emotional I've been all my life.  No interests in anything. Wanting to end everything. I could go on and on bout this, truly something only someone suffering understands.",
      "created_utc": 1747337542.0,
      "score": 26,
      "context": []
    },
    {
      "id": "msiiapt",
      "author": "Sevennolater",
      "body": "Having all of these symptoms and still not caring enough to change",
      "created_utc": 1747341830.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mshs27b",
      "author": "RealisticPepper5308",
      "body": "i had a seizure and starvation ketoacidosis at one point, and i had a bone scan done recently and i have osteopenia.  \nto name some others: incontinence, bradycardia, postural tachycardia, muscle atrophy, loss of hunger cues, fainting, hypotension, electrolyte imbalances, feeling like your knees are going to buckle when you stand, hypothermia, general bitchiness, your social life disappearing, reliving the same day over and over, lying on the floor after a shower, dry skin, blood pooling, raised liver enzymes, high cholesterol, low white blood cells, delayed healing of wounds, vulnerability to infections",
      "created_utc": 1747334100.0,
      "score": 40,
      "context": []
    },
    {
      "id": "mshtrz0",
      "author": "yeaahhhhhhhhhhhh",
      "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
      "created_utc": 1747334617.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mshua6z",
      "author": "Solal-King-Raccoon",
      "body": "When you end up with osteoporosis as a teenager",
      "created_utc": 1747334769.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mshw3l1",
      "author": "Deepspacechris",
      "body": "Always being cold and almost never have a moment where I don’t count calories in my head.",
      "created_utc": 1747335310.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mshy91l",
      "author": "None",
      "body": "i haven’t had a period for 5 years (and still don’t have it obviously) due to HA which in my case is a consequence of anorexia. thus, i’m at a huge risk for osteoporosis and/or cardiovascular disease. i have heart issues. i’m 18 and i still look prepubescent. when i restrict as i do now (as i’ve had attempts at recovery before) i have incurable insomnia, heart palpitations, low body temperature, constant nausea, headaches, anxiety, and fatigue to the point of not being able to do anything except doomscroll (and even that feels exhausting). my hair is falling out and my nails are brittle. and that’s not even all of it. also, EXTREME short term memory loss. and i get so irritable i literally can’t control myself around people in real life at times. it’s hellish",
      "created_utc": 1747335959.0,
      "score": 16,
      "context": []
    },
    {
      "id": "msid20m",
      "author": "demonicstranger",
      "body": "The coldness, heightened anxiety, exhaustion, mood swings, organ damage, constant need to lie/pretend, relationship damage due to lies, and so many doctor/hospital visits",
      "created_utc": 1747340326.0,
      "score": 14,
      "context": []
    },
    {
      "id": "msj7cor",
      "author": "ddaniell444",
      "body": "couldn't have better timing considering i'm the worse i've ever been and it needs to stop being glorified/ romanticised:\n\nfeeling your teeth literally rot every time you grit them\n\npuss oozing out of cuts on your hands\n\ngetting fully naked trying out multiple positions while being on the toilet for 1-2 hours trying to have a bowel movement\n\nextreme cold and ineffable malaise 24/7 paired with constant shaking and senile-like characteristics\n\nloss of relationships between friends and/ or family bc even though they're supportive and want you to recover they will ALL eventually get tired of the only select few conversation subjects being: calories, bloating, cardio/ exercise, routinely checking the energy content whenever someone is making food without knowing it's become muscle memory\n\non extended fasts following 48 hours: slow, continuous mental/ physical/ emotional deterioration to the point where you lay lifeless in one position holding in urine for hours bc you don't have the energy to move. no energy to shower/ brush your teeth/ change out of dirty clothes etc and if by some miracle you do have the energy to shower you'll most likely end up just standing there letting the water run down your body while trying to maintain your composure to not faint/ get light headed for half an hour. afterwards you might let yourself air dry while you stand in front of the mirror looking at yourself in complete and utter disgust for a further two hours. and so by the time you go to bed it could potentially be 3-5am and boom there goes your sleep schedule that you worked so indefatigably hard to fix! and assuming you fast for minimum 120 hours (5 days) that's three more days of enduring the aforementioned events. you're absolutely fucking starving at this point, so you order a substantial amount of fast food that's too much to eat considering your eyes are more famished than your stomach. you don't finish the meal, feeling full as fuck and stuffed to the point of wanting to purge. you don't purge and so yay you had some food (after depleting yourself of energy for almost a week) and you feel you can shower/ brush your teeth/ basic hygiene. but wait you then realise how fucking worthless and redundant you feel so you then ruminate on how you spent the last 5-7 days essentially killing time as a preserved corpse in a state of inertia. and all of this is an unbreakable cycle that could very well repeat until you die.\n\ni could continue but i understand this was a fair amount to take in and idk if anyone is gonna even read this but this kind of information should be readily accessible to counter all the fucking glorification of this virulent illness. i acknowledge that not all of this is relatable to every person with anorexia and should definitely NOT become stereotypical of persons suffering from an ed/ etiological characteristics regarding eds. recovery is truly worth it <3",
      "created_utc": 1747349870.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mshyhdr",
      "author": "_-ollie",
      "body": "hypotension and bradycardia, I feel like I'm always on the verge of passing out.",
      "created_utc": 1747336029.0,
      "score": 10,
      "context": []
    },
    {
      "id": "msi356w",
      "author": "Nia_KR",
      "body": "Horrible reactive hypoglycemia. Basically anytime I eat carbs now my body freaks out because it wants more and my blood sugar drops too low within 2-3 hours. I can’t eat carbs anymore without feeling cold, tired, dizzy, nauseous, anxious, if it’s bad enough it feels like I’m dying. So cool",
      "created_utc": 1747337408.0,
      "score": 12,
      "context": []
    },
    {
      "id": "msi5vjy",
      "author": "nervous_veggie",
      "body": "Name an organ, any organ, it’ll be negatively affected by malnutrition from AN. The entire body suffers in ways you never imagined",
      "created_utc": 1747338221.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mskow9d",
      "author": "soda-pops",
      "body": "that a small part of your AN brian never goes away. even if its just your ears perking up at certain words. it haunts you.",
      "created_utc": 1747370655.0,
      "score": 12,
      "context": []
    },
    {
      "id": "msijefp",
      "author": "Electrical-Meal177",
      "body": "planning out birthday meal/dessert MONTHS in advance, isolating from everyone,fainting, nails falling off",
      "created_utc": 1747342149.0,
      "score": 10,
      "context": []
    },
    {
      "id": "msizgzh",
      "author": "0verbeforeitbegan",
      "body": "So I want to emphasize this greatly I’ve been in and out of recovery for 11 years. With that being said, my longest time with being active in it was 5 years consistently. And with my last time being my shortest and most damaging, 1 year. \nDuring my episodes it was constantly being cold, the anemia, hair growth on my body, and hair loss. In recovery 3 years after my last episode that lasted a year, I have issues with a lot of my organs, still anemic, I have an enlarged spleen, enlarged liver, I never was a drinker and now I can’t drink period. I can’t even have sugar free drinks and only sometimes if it’s in coffee or tea. They prefer I drink them with no sweetener. I can’t even take pain medication unless absolutely dire. I have to tell every doctor, dentist, therapist about all the medical issues I’ve had as a result and it now limits their treatment options for me for things that should be easy fixes because of the organs that have been heavily affected. Because of all this, my body also has a lot of issue absorbing iron and other things. I have contact inflammation and pain. I’ve caused damage to nerves and joints due to malnutrition. I have ruined my metabolism and I can gain weight like crazy if I’m not properly taking care of myself. I also now have fertility issues to. \n\nWe always lol at the effects during the course of the disease but the times we go into recovery, a lot of people don’t realize the dwindling issues that make it not worth it at all.",
      "created_utc": 1747347106.0,
      "score": 11,
      "context": []
    },
    {
      "id": "msi29w1",
      "author": "Maleficent_Bag_5002",
      "body": "I shit myself",
      "created_utc": 1747337150.0,
      "score": 8,
      "context": []
    },
    {
      "id": "msicxup",
      "author": "Bulky_Influence_4914",
      "body": "having to constantly come up with reasons why i don't eat or want food. i get exhausted pretending everything looks and tastes so delicious. food is repulsive.",
      "created_utc": 1747340293.0,
      "score": 8,
      "context": []
    },
    {
      "id": "msjjlmq",
      "author": "HopefulBike6424",
      "body": "When your legs go numb and you can’t walk anymore and fluid is filling your legs and you think your going to die and crying for your child in the ER bed… then lose your ability to digest food and painful edema, iron deficiency anemia, deficient in every vitamin, constipation and loss of muscle movement. 😔",
      "created_utc": 1747354221.0,
      "score": 8,
      "context": []
    },
    {
      "id": "msjtqg5",
      "author": "ThrowRA-sicksad",
      "body": "One of my friends who couldn’t get past their ED just died of a heart attack. They were 36.",
      "created_utc": 1747358043.0,
      "score": 9,
      "context": []
    },
    {
      "id": "msksip6",
      "author": "humbleavo",
      "body": "Loss of bladder control (literally peed myself in a store changing room before trying on a dress)\nLosing most of my hair\nStinking like trash despite good hygiene, since your body is catabolising itself it begins to stinkkkkk\nHorrific constipation to the point I literally had to fish out my own shit with gloves from my asshole\nEndless giant HEAVY trash bags of chew & spit \nAlways freezing, literal ice block, and no matter how hard you try you cannot warm up \nLies, all the lies, literally insane\nShoplifting foods to chew and spit (getting caught and arrested rip)\nPurging on a street\nMissing out in everything \nCompletely destroying your teeth \nLosing everyone\nFeet fulll of blisters and bruises and never ending infections bc of walking too much\nConstantly falling asleep unable to do anything\nIncapable of climbing up stairs\nGI issues forevermore \nYour loved ones watching you die  \n\n I could go on but the point is eating disorders aren’t glamorous, they’re life ruining and soul destroying",
      "created_utc": 1747372480.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mshylfp",
      "author": "reemyaple",
      "body": "Too weak to cough",
      "created_utc": 1747336063.0,
      "score": 6,
      "context": []
    },
    {
      "id": "msiw0ri",
      "author": "AbsolutelyNot5555",
      "body": "Lost potential",
      "created_utc": 1747345969.0,
      "score": 7,
      "context": []
    },
    {
      "id": "msj0ojm",
      "author": "runninginbubbles",
      "body": "This isn't physical but the social consequences. Not such an issue when you're a teenager or early 20s. But when you're in your 30s and you still feel like a teenager, never left home, never been in a relationship, unable to attend the weddings of the small group of friends you have left because it runs through two meal times, no children and utter fear of anyone ever getting close enough to make that possible, being unable to eat at cafes, restaurants, WORK functions (if you're able to hold down a job - but do you know how stupid that looks?)",
      "created_utc": 1747347515.0,
      "score": 7,
      "context": []
    },
    {
      "id": "msjh0o0",
      "author": "Defiant_Intention_50",
      "body": "the loneliness that unavoidably takes over eventually. nothing worse than that emptiness and isolation.",
      "created_utc": 1747353266.0,
      "score": 6,
      "context": []
    },
    {
      "id": "msjqw1g",
      "author": "margauxw",
      "body": "Teeth and gum erosion. Marks on skin from bones causing friction with hard surfaces. Total lack of immune system. Inability for the body to digest most foods properly since recovering - everything upsets my stomach now",
      "created_utc": 1747356980.0,
      "score": 6,
      "context": []
    },
    {
      "id": "msjrdo2",
      "author": "graphicinnit",
      "body": "Stretch marks EVERYWHERE, wrinkles, cavities, tooth loss, osteoporosis, permanent brain damage, pancreas/liver damage, gastroparesis, IBD, mitral valve prolapse, hair loss, infection, insomnia, constant pain, constant deep worry, a massive sense of dread like you're slowly drowning and there's nothing you can do to stop it bc you're in a bubble and it's just washing over you\nJust off the top of my head (literally)\n\nETA I got stretch marks and cavities in a relapse that lasted A MONTH and I only lost a few lbs. It's what snapped me out of it. They're even on my arms and calves",
      "created_utc": 1747357163.0,
      "score": 6,
      "context": []
    },
    {
      "id": "msk8tc9",
      "author": "urhotg0thgf",
      "body": "You think it won't happen, 'not me, I know what I'm doing, I'll be okay', and then it does.\n\n  \nI've lost relationships because I was too tired to do anything because I didn't eat, the brain fog (forgot what I was typing for a second Icl), pissing yourself, intense su1c1d4l urges/thoughts, doing ANYTHING to burn calories, refeeding syndrome, I blacked out for like ten minutes after an intense workout, hand/arm tremors, the binges, intense mood swings, yellowing/greying of your skin, etc",
      "created_utc": 1747363686.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mslpboy",
      "author": "Few_Bell_8166",
      "body": "Permanently fucked digestion from abusing laxatives, sudden intolerances to foods you grew up on, not having the strength to move and just being stuck in bed, people commenting on it constantly and it being the first thing they see about you, not your personality. Knowing the kcals to everything off by heart so no you will never forget and being freezing constantly.",
      "created_utc": 1747391884.0,
      "score": 6,
      "context": []
    },
    {
      "id": "msme17u",
      "author": "Satan-gives-boba997",
      "body": "Chronic body aches, hair loss and cuz of the dry skin och always feeling cold you have to dress like a homeless person 🙃",
      "created_utc": 1747401903.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mspyx4j",
      "author": "Altruistic_Ask_2769",
      "body": "Was literally about to post about my dire urge to relapse rn so thank you",
      "created_utc": 1747443311.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mshz57n",
      "author": "tacobellfriess",
      "body": "Had a seizure and lost hunger cues",
      "created_utc": 1747336227.0,
      "score": 6,
      "context": []
    },
    {
      "id": "msi1926",
      "author": "disorientating",
      "body": "Osteoarthritis before I’m even 18. 🥴",
      "created_utc": 1747336846.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mskuvh6",
      "author": "FriedLipstick",
      "body": "As a somewhat older person with AN: life long gut problems and recidivism at most painful life events. Also: loneliness. People always think I’m just lucky to be skinny while having children. They don’t know about the struggle with nutrition.",
      "created_utc": 1747373737.0,
      "score": 5,
      "context": []
    },
    {
      "id": "msmtpee",
      "author": "Admirable_Shallot752",
      "body": "What I would say has already been said by others but here is one you probably wont hear much as its a male issue, low testosterone. I know that females loose their period and have their own hormone issues with malnutrition but as a guy you completely loose any motivation/drive that comes with masculinity. Having the same test level as a ten year old girl but at 19 as a male can really hit hard, I've definitely stunted growth too.",
      "created_utc": 1747406817.0,
      "score": 6,
      "context": []
    },
    {
      "id": "msnch9e",
      "author": "Coconutwatervodka",
      "body": "Yes this. I almost forgot a purchase I bought today in the fitting room. Thank god the employee caught me before I left.\n\nAlso being fucking cold. Even when it’s not cold out. \nMy bones aching/struggling to walk because I have a lack of energy\nAlso making people feel uncomfortable when you eat out because of indecisiveness/struggling to order/eat\nI also eat so fucking slowly compared to other people and it draws attention to me which I don’t like.\nAlso pissing all the time- at least once an hour\nMy hair falling out\nMy mom having dreams that I’m dying and my family being constantly worried about me\nHowever the illness also comforts me like nothing else does that’s why I don’t stop",
      "created_utc": 1747412286.0,
      "score": 5,
      "context": []
    },
    {
      "id": "msol0ei",
      "author": "No-Action578",
      "body": "after having it for years alongside other eds and becoming chronically malnourished ur getting to a point where u develop literally physical problems that make u swell so easily and make u look puffy at the silliest inconveniences (ur suffering and dying and need help but it creates a situation where stupid ed noise is like omg ur so f** ur gaining sm w***** 😰 we need to be even sicker and sicker. and ur priorities are basically fucked because your brain is distorted and ur body is fighting for it's life while ur stuck in side quests focusing on ur control, and body image, isolation, constant fatigue where you cant carry yourself or achieve your goals and dreams.",
      "created_utc": 1747425602.0,
      "score": 4,
      "context": []
    },
    {
      "id": "msptrlm",
      "author": "mlk_alternative_",
      "body": "Pissing 👏🏻your 👏🏻self 👏🏻",
      "created_utc": 1747441360.0,
      "score": 4,
      "context": []
    },
    {
      "id": "msj580s",
      "author": "turnipkitty112",
      "body": "Incontinence - shitting and pissing yourself so often it becomes almost normal. Lying to everyone you love, because honestly is less important than your ED. It feels easy. You become mean and irritable and totally unpleasant to be around. You lash out to everyone around you, especially when it has to do with food. Depending on your particular behaviours, you might find yourself spending ungodly amounts of money on food (or heck, treatment) or dental work. \n\nAbsolutely stunting your EMOTIONAL development - now you’re an adult and you haven’t hit all the normal milestones, maybe your education or career has been derailed, you’ve lost social skills. Maybe it’s affected your ability to have a relationship or live independently. I’m in my 20s and am only part time in college and work, years behind in my degree, living with my parents, no money (as in, 0.74 in my bank account), no driver’s license, no friends (literally none), have never been in a relationship or even gone on a date. I feel light years away from everyone else my age, I can’t relate. I’m sure part of it is the autism, but having had an ED since age 13 certainly hasn’t helped.",
      "created_utc": 1747349107.0,
      "score": 5,
      "context": []
    },
    {
      "id": "msjigte",
      "author": "Fine-Yesterday-8936",
      "body": "For me, it made me PCOS worse. By the time I was diagnosed at 17 it was already bad enough that the OB I saw gave me like a 10% chance of carrying any child to viability and less than a 5% chance of carrying to term.",
      "created_utc": 1747353796.0,
      "score": 5,
      "context": []
    },
    {
      "id": "msjnp41",
      "author": "Ships_Bravery",
      "body": "literally the forgetfulness, memory issues, i might as well be brainless lmaoooo literally thought today was the day i was supposed to go somewhere but it's actually on saturday 🙃",
      "created_utc": 1747355775.0,
      "score": 5,
      "context": []
    },
    {
      "id": "msk70u0",
      "author": "megryanreynolds",
      "body": "Brain fog and memory issues.",
      "created_utc": 1747362992.0,
      "score": 4,
      "context": []
    },
    {
      "id": "msl55ah",
      "author": "OriginalOld3739",
      "body": "I think that the discomfort of things that you do I don’t know if that’s depression but you don’t really enjoy doing absolutely nothing like you are like in automatic mode, the discomfort of everything I can say it in a very short way to say it I think that the thing that’s happening to me right now",
      "created_utc": 1747379658.0,
      "score": 4,
      "context": []
    },
    {
      "id": "msleowg",
      "author": "ActivityIll8075",
      "body": "I'm currently in liver and kidney failure. Enough said",
      "created_utc": 1747385663.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mslgnu3",
      "author": "marshmallo_floof",
      "body": "Dying",
      "created_utc": 1747386909.0,
      "score": 4,
      "context": []
    },
    {
      "id": "msli6cj",
      "author": "No-Average6765",
      "body": "Being too tired to move in bed, feeling like youre on the brink of death, having 0 energy and having people point it out, too tired to feel anything, ana breath literally follows you for months after eating normally at random times too, your nutrition levels never fully go back to normal, relapses, weight gain, being told you dont look sick enough so you dont deserve treatment",
      "created_utc": 1747387852.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mslkpbb",
      "author": "Chaerin_Sistas",
      "body": "Brain fog is so bad with me. It’s not that I completely forget things, I just take SO LONG to recall simplest information. Like I’d be talking to my sister “Guess what??” And then I say “So…” twenty times (literally) before I remember what I was just about to say.\nAnd then there are times I actually do forget completely things that happen and my friend gets so frustrated with me.\nI take hours and hours to finish a school assignment. It took me two whole classes (3 hours total) to do TWO slides of my presentation for english class. Everyone else had finished the whole slideshow in about 3-4 classes.\nI’m really smart and I am so grateful I still have the ability to study and memorize information related to my class curriculum (although I end up forgetting everything within a few days after the test) but I just work extremely slow and have poor short-term memory.",
      "created_utc": 1747389345.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mslsa3a",
      "author": "sjjaewoo",
      "body": "fr my brain fog is so bad im actl consdiering recovery but  idt its gonna happen .... im so sick of my life rn",
      "created_utc": 1747393317.0,
      "score": 4,
      "context": []
    },
    {
      "id": "msme7r2",
      "author": "Asleep-Application55",
      "body": "nutritional neuropathy, parathesia, bone health issues…. i wish i didn’t have this illness",
      "created_utc": 1747401964.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mso7f2t",
      "author": "ActionJackson1566",
      "body": "The horrible gastroparesis and bitter nausea that accompanies it",
      "created_utc": 1747421430.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mspugfb",
      "author": "mlk_alternative_",
      "body": "There’s only so long people can stand by and see you repeat the same cycles of self destruction, they either leave or become resentful. At first you might have lots of people rallying around you, showing support and love but it’s devastating when you look up from your disorder after a whole and realise there’s almost no one left",
      "created_utc": 1747441620.0,
      "score": 4,
      "context": []
    },
    {
      "id": "msieo6w",
      "author": "PrincessMeepMeep",
      "body": "I’ve lost all the muscle mass in my back and I had to leave my job and I can no longer walk. That was my hobby 😭",
      "created_utc": 1747340784.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msj05io",
      "author": "rachrachcalero",
      "body": "My hair and my teeth/smile have never been the same",
      "created_utc": 1747347336.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msj9vjv",
      "author": "Paper182186902",
      "body": "Chronic constipation due to malnutrition and laxative abuse, rectal ulcers as a consequence, acid reflux, slow gut transit motility.",
      "created_utc": 1747350755.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msje1xb",
      "author": "CellPsychological630",
      "body": "Osteoporosis, infertility, self hatred, inability to get life insurance at a later stage, having to earn trust back from family and friends, brain fog, tummy problems, stunted growth, how expensive it is to get support ie-gp appointments psych, dietician, medications. How much time it takes from you and your job ie hospitalisations, appointments, lack of control, being seen as unreliable.",
      "created_utc": 1747352212.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msk4u4z",
      "author": "Sunshineheart02",
      "body": "It caused me internal bleeding where I bled out once to the point where I passed out and stopped breathing for 10 minutes and I ended up in ICU for a week luckily they were able to revive me",
      "created_utc": 1747362175.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msmi4fg",
      "author": "Fit-Mark3683",
      "body": "When i saw my tailbone I was TERRIFED. I was like WHAT.IS.THAT?! ",
      "created_utc": 1747403263.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msnkihk",
      "author": "Ok_Masterpiece_5754",
      "body": "Dental health and hair health.. also the random bouts of the room spinning and praying no one’s around just in case you pass out.",
      "created_utc": 1747414627.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mspgt0j",
      "author": "zodiacqu33n",
      "body": "Bone pain. Slow digestion. Chronic constipation. Fatigue. Irritability. Hopelessness!",
      "created_utc": 1747436529.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msq48ap",
      "author": "After_Shock8059",
      "body": "I started loosing my ability to speak… if I spoke for to long I’d start losing my voice. I also couldn’t lift my head to get out of bed most days and if I managed to I’d pass out after standing to long. AN is not a joke! Please seek help and support you deserve to live life guilt free with endless energy!",
      "created_utc": 1747445359.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msqgdt9",
      "author": "redoillamp",
      "body": "this was at my worst, keep in mind. \n\nill start with physical looks wise. was i thinner? yeah. but everytime i drank water or electrolytes my stomach puffed out and made me more triggered into starvation due to bloating. \nmy eyes were dull, my skin almost looked papery and grey. i had to use bronzer and self tanner to look even slightly normal due to almost all the color being drained out my natural complexion.\n\nmy skin was so taut over my bone structure that it looked like i had cheek implants. my eyes were sunken in and eye bags were massive. my hair was brittle and thinning out no matter what i did with it, to the point showering would pull out fist fuls at times \n\ni would be walking for multiple hours every single day, mostly in the morning and early afternoon. i live in the southern US and i was worse during the summer. one day i had come home not only to find multiple friction blisters on both my feet, but that i had sun poisoning on my shoulder and neck from how badly i burnt. my nails turned frail and literally translucent \n\ndon’t even get me started on the stomach issues. all I could think about was food. to the point that I’d literally have to go and cry in my work bathroom because I’d smell everything and couldn’t let myself have any. if i did eat something - it would shoot right through me. I’d have times where I’d be halfway through meals and physically feel all the old stuff in my system drop to make room for what im eating, so I’d use the bathroom halfway through. it was always liquid/watery. sorry for TMI, but it’s AN, she’s a gross bitch. \n\ni either had an excess of libido or nothing as well. or when i did actually do something - id check out halfway through because i simply was too tired\n\n\ni kind of permanently have tachycardia now. my heart rate never dips below 103. i have issues with hypoglycemia and my sugar can drop incredibly rapidly, even if ive ate normal. \n\nthe boredom as well. it’s crazy how boring it is. i consumed only one piece of media during my worst points and literally would just sit, bored as hell, for 10 hours watching one show and 10 select edits to get my mind off of food",
      "created_utc": 1747450073.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msqhdz1",
      "author": "sabsab510",
      "body": "Feeling suicidal and hopeless",
      "created_utc": 1747450488.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mswvjs3",
      "author": "Aaaaali786",
      "body": "Stunted height growth.\n\n5’4 guy here, lived my entire life being average height until heavy restriction from 13-15. Would have been 5’10. I’m shorter than even a good chunk of the women in my family and the shortest man by a lot.",
      "created_utc": 1747547576.0,
      "score": 2,
      "context": []
    },
    {
      "id": "msyxr3t",
      "author": "xg4bii",
      "body": "Omg there's so many, but one of the ones that pains me the most personally is losing hair. My hair started falling out in chunks, I lose like a hand full of hair every day it crazy. I'm literally scared to brush and wash my hair bc it just makes me so devastated to see how much hair I'm losing. And I used to have long and thick hair naturally, now it has become very thin and I'm going to have to pay alot of money to get extensions. Starving yourself is soooo not worth it!!💔",
      "created_utc": 1747583090.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mt837g2",
      "author": "glueinmyshoee",
      "body": "losing track of what im saying mid sentence and sounding stupid cause brain fog. and recently chest pains all day",
      "created_utc": 1747704689.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mtfcbxi",
      "author": "mylostzebra",
      "body": "Lost all my teeth.  Never thought it would happen",
      "created_utc": 1747804835.0,
      "score": 2,
      "context": []
    },
    {
      "id": "msqzt2w",
      "author": "Comfortable-Creme500",
      "body": "One that people don't talk about enough is how sore you get. Example: I don't work my glutes. Yet I woke up today feeling like I worked my glutes in isolation for an hour straight. It hurts and it's difficult to go through.",
      "created_utc": 1747459302.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mss9n29",
      "author": "foranonsense",
      "body": "I don’t remember nearly anything from the 2 years I was at my worst. My friends will talk about things we did and I can remember small flashes of things, but sometimes I don’t remember at all and it’s super upsetting. Being told about these super fun things I did or funny moments I can’t remember is devastating.",
      "created_utc": 1747485653.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mstq420",
      "author": "Sea-Firefighter-7780",
      "body": "Struggled with anorexia from 2013 to 2021, still have an iffy relationship with food. I was diagnosed with osteoporosis aged 20 and have since broken bones literally by walking up the stairs. I worry about how I’ll be when I’m 50+. My cycle never quite got back to normal either.",
      "created_utc": 1747503595.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mswcyes",
      "author": "Evening-Affect6091",
      "body": "all my organs shutting down, potassium ivs, being admitted to the icu, how painful it is to sit down because i’m so boney, dizzy standing up, so weak i can’t get out of bed, no desire to have sex, no desire for a social life, spend my entire day thinking about food, always cold, lips turning blue, having to quit my job, being constipated all the time so either using enemas or laxitives, the painful bloating when i actually eat.",
      "created_utc": 1747538155.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msxobco",
      "author": "VermicelliFinancial4",
      "body": "Two that I don't see much of, but have experienced are \n1. Severe hemorrhoids from being so underweight and constipated. The constipation starts the problem and then as weight is lost, they protrude more as everything does and get worse. They then can bleed, ooze mucus, and fecal matter can, and often, will leak also. It is gross and painful. \n2. Severe immune deficiency. While I generally am sick less often when engaging in behaviors, when I did get sick, it was much worse and took forever to heal. A light cold is knocking me  out right now. Others who I likely got it from were able to function and I am struggling to do so. As measles and the bird flu and other illnesses spread in the US and around the world, the impact of this issue grows also. I am a vaccinated adult and likely would be okay in most scenarios, but probably not right now.",
      "created_utc": 1747565345.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mshpkjq",
      "author": "_TakeYourMeds",
      "body": "Thank you ❤️ sending well wishes to you and your daughter 🫂",
      "created_utc": 1747333353.0,
      "score": 28,
      "context": [
        {
          "id": "mshp9ed",
          "author": "atx_weird_o",
          "body": "As a mom to a gorgeous daughter with AN, I saw self hatred, furry skin, brittle hair, rage when confronted about eating, lying, spending copious amounts of time in the bathroom, IBS, orthostatic blood pressure, inability to concentrate, and extreme depression. Hugs and positive thoughts to all those suffering from this horrific disease.",
          "created_utc": 1747333261.0
        }
      ]
    },
    {
      "id": "mshxz1i",
      "author": "_-ollie",
      "body": "thank you for this comment. I always wondered how much a parent notices.",
      "created_utc": 1747335875.0,
      "score": 15,
      "context": [
        {
          "id": "mshp9ed",
          "author": "atx_weird_o",
          "body": "As a mom to a gorgeous daughter with AN, I saw self hatred, furry skin, brittle hair, rage when confronted about eating, lying, spending copious amounts of time in the bathroom, IBS, orthostatic blood pressure, inability to concentrate, and extreme depression. Hugs and positive thoughts to all those suffering from this horrific disease.",
          "created_utc": 1747333261.0
        }
      ]
    },
    {
      "id": "msk2hvg",
      "author": "m0onbay",
      "body": "i had to check if this was my moms secret reddit account because this is exactly something she would say (and things i’ve experienced)",
      "created_utc": 1747361285.0,
      "score": 9,
      "context": [
        {
          "id": "mshp9ed",
          "author": "atx_weird_o",
          "body": "As a mom to a gorgeous daughter with AN, I saw self hatred, furry skin, brittle hair, rage when confronted about eating, lying, spending copious amounts of time in the bathroom, IBS, orthostatic blood pressure, inability to concentrate, and extreme depression. Hugs and positive thoughts to all those suffering from this horrific disease.",
          "created_utc": 1747333261.0
        }
      ]
    },
    {
      "id": "msqopi8",
      "author": "humancoloringbook923",
      "body": "Wait, wait. Furry skin? My fuzz could be from... this? How did i not know that?!",
      "created_utc": 1747453723.0,
      "score": 3,
      "context": [
        {
          "id": "mshp9ed",
          "author": "atx_weird_o",
          "body": "As a mom to a gorgeous daughter with AN, I saw self hatred, furry skin, brittle hair, rage when confronted about eating, lying, spending copious amounts of time in the bathroom, IBS, orthostatic blood pressure, inability to concentrate, and extreme depression. Hugs and positive thoughts to all those suffering from this horrific disease.",
          "created_utc": 1747333261.0
        }
      ]
    },
    {
      "id": "mspytjn",
      "author": "Altruistic_Ask_2769",
      "body": "Had to do a double take to make sure this wasn’t my mom, but my heart goes out to you, I can’t even imagine knowing what my mom had to go through",
      "created_utc": 1747443272.0,
      "score": 3,
      "context": [
        {
          "id": "mshp9ed",
          "author": "atx_weird_o",
          "body": "As a mom to a gorgeous daughter with AN, I saw self hatred, furry skin, brittle hair, rage when confronted about eating, lying, spending copious amounts of time in the bathroom, IBS, orthostatic blood pressure, inability to concentrate, and extreme depression. Hugs and positive thoughts to all those suffering from this horrific disease.",
          "created_utc": 1747333261.0
        }
      ]
    },
    {
      "id": "msr2c79",
      "author": "Thrwaway0596",
      "body": "I struggle with this a lot. Like, it isn’t the people I’m around that makes socializing hard. It just … is. It feels like my brain is static *ontop* of trying to keep up in a conversation, being asked questions. The dreaded “what are you eating tonight?” followed by an “Idk, I’ll figure something out soon”, “do you want (x, y or z)?” \n\nNOOOO JUST STOP EVERYBODY JUST STOP. Sorry. This happened to me last night so I pretended I needed to lay down. Turned on some reality tv and went to sleep. Ugh. I feel like such an asshole, honestly.",
      "created_utc": 1747460697.0,
      "score": 6,
      "context": [
        {
          "id": "mshpcf7",
          "author": "NinjaSuperb7977",
          "body": "Being unable to make actual sentences when talking to people. \nBeing unable to be around people, including family, because everything is *too much*",
          "created_utc": 1747333286.0
        }
      ]
    },
    {
      "id": "msiyawf",
      "author": "VirtualApricot",
      "body": "Prolapsing intestines is definitely one of the least discussed ones 😭-100/10 would not recommend.",
      "created_utc": 1747346712.0,
      "score": 21,
      "context": [
        {
          "id": "mshoscm",
          "author": "Ok_mar8788",
          "body": "when malnutrition gets so bad ur pelvic floor muscles give up and u push a lil too hard and suddenly ur intestines r like ‘ok we’re outta here’",
          "created_utc": 1747333122.0
        }
      ]
    },
    {
      "id": "msj7wy3",
      "author": "ddaniell444",
      "body": "holy fucking shit that is horrible. i knew that your organs start to eat themselves, then fail but i didn't know they literally fall out omg. stay safe and nourish yourself 🤍",
      "created_utc": 1747350067.0,
      "score": 20,
      "context": [
        {
          "id": "mshoscm",
          "author": "Ok_mar8788",
          "body": "when malnutrition gets so bad ur pelvic floor muscles give up and u push a lil too hard and suddenly ur intestines r like ‘ok we’re outta here’",
          "created_utc": 1747333122.0
        }
      ]
    },
    {
      "id": "msjp5ui",
      "author": "W3r3w0lf2003",
      "body": "why in gods name have i never heard of this, that is easily one of the most terrifying things ever",
      "created_utc": 1747356328.0,
      "score": 12,
      "context": [
        {
          "id": "mshoscm",
          "author": "Ok_mar8788",
          "body": "when malnutrition gets so bad ur pelvic floor muscles give up and u push a lil too hard and suddenly ur intestines r like ‘ok we’re outta here’",
          "created_utc": 1747333122.0
        }
      ]
    },
    {
      "id": "mskjjxq",
      "author": "muststandslowly",
      "body": "THIS THIS THIS",
      "created_utc": 1747368146.0,
      "score": 4,
      "context": [
        {
          "id": "mshoscm",
          "author": "Ok_mar8788",
          "body": "when malnutrition gets so bad ur pelvic floor muscles give up and u push a lil too hard and suddenly ur intestines r like ‘ok we’re outta here’",
          "created_utc": 1747333122.0
        }
      ]
    },
    {
      "id": "mshykym",
      "author": "None",
      "body": "god yes this….it’s so difficult to have everyone express their worry about you, even cry and feel bad out of it, and as a result you feel so empty and guilty. it’s the worst. the trust loss is so real too.",
      "created_utc": 1747336059.0,
      "score": 18,
      "context": [
        {
          "id": "mshtvlq",
          "author": "Human_Swordfish5490",
          "body": "Alongside all the health implications, the biggest consequences I live with is the guilt of knowing I caused stress, anxiety and worry for all my friends and family. That they've laid awake worried that I might die. That is a true consequence.",
          "created_utc": 1747334647.0
        }
      ]
    },
    {
      "id": "msor1dv",
      "author": "livv3ss",
      "body": "Messed up digestive system is the worst. I've been recovered for 2 years, and I still can't eat a full meal without my body projectile vomiting out. Almost like I'm rejecting the food. I have to eat in small quantities throughout the day instead.",
      "created_utc": 1747427442.0,
      "score": 6,
      "context": [
        {
          "id": "mshpkms",
          "author": "FruitSalad_24",
          "body": "Messed up digestive system/ reliant on laxatives because nothing functions right",
          "created_utc": 1747333354.0
        }
      ]
    },
    {
      "id": "msht9fj",
      "author": "_TakeYourMeds",
      "body": "I’m so sorry ❤️ wishing you health",
      "created_utc": 1747334462.0,
      "score": 6,
      "context": [
        {
          "id": "mshs27b",
          "author": "RealisticPepper5308",
          "body": "i had a seizure and starvation ketoacidosis at one point, and i had a bone scan done recently and i have osteopenia.  \nto name some others: incontinence, bradycardia, postural tachycardia, muscle atrophy, loss of hunger cues, fainting, hypotension, electrolyte imbalances, feeling like your knees are going to buckle when you stand, hypothermia, general bitchiness, your social life disappearing, reliving the same day over and over, lying on the floor after a shower, dry skin, blood pooling, raised liver enzymes, high cholesterol, low white blood cells, delayed healing of wounds, vulnerability to infections",
          "created_utc": 1747334100.0
        }
      ]
    },
    {
      "id": "msj0999",
      "author": "runninginbubbles",
      "body": "Jesus what? I know that sounds incredibly traumatic but if you're able to, can you explain a bit further? How the heck does that happen??",
      "created_utc": 1747347372.0,
      "score": 9,
      "context": [
        {
          "id": "mshtrz0",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
          "created_utc": 1747334617.0
        }
      ]
    },
    {
      "id": "msiyyt0",
      "author": "VirtualApricot",
      "body": "Aw, man. I’m so sorry. \n\nIf you're comfortable discussing it further, I'd be interested to learn more about your journey as I definitely haven’t heard of this potential side effect.. how did it manifest in relation to AN? Again, I’m so sorry :(",
      "created_utc": 1747346934.0,
      "score": 7,
      "context": [
        {
          "id": "mshtrz0",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
          "created_utc": 1747334617.0
        }
      ]
    },
    {
      "id": "msk4dhw",
      "author": "Sunshineheart02",
      "body": "The same thing happened to me and I needed physical therapy for months until I got enough strength back to even use a walker and I’m happy to say that a year later I am able to finally walk on my own again without any assistance but it was a long journey and I’m still super weak and still on the road to recovery ❤️‍🩹",
      "created_utc": 1747361999.0,
      "score": 4,
      "context": [
        {
          "id": "mshtrz0",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
          "created_utc": 1747334617.0
        }
      ]
    },
    {
      "id": "msws1z6",
      "author": "None",
      "body": "May I ask, what where the starting symptoms that happened when you developed Guillan Barre, because I've actually never heard of this before and am very curious? (If this isn't allowed aka this comment I can delete it, just thought it would also give insight to those who don't know of it as well)",
      "created_utc": 1747545617.0,
      "score": 3,
      "context": [
        {
          "id": "mshtrz0",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
          "created_utc": 1747334617.0
        }
      ]
    },
    {
      "id": "msj24cr",
      "author": "EmiomieletaViolateta",
      "body": ":(",
      "created_utc": 1747348006.0,
      "score": 3,
      "context": [
        {
          "id": "mshua6z",
          "author": "Solal-King-Raccoon",
          "body": "When you end up with osteoporosis as a teenager",
          "created_utc": 1747334769.0
        }
      ]
    },
    {
      "id": "mskxu09",
      "author": "musty-vagina",
      "body": "Omg and nobody talks about anorexia vagina - queefing, incontinence, infections, painful/impossible sex, feels like sandpaper when you sit\n\nSo glamorous",
      "created_utc": 1747375371.0,
      "score": 5,
      "context": [
        {
          "id": "mshy91l",
          "author": "None",
          "body": "i haven’t had a period for 5 years (and still don’t have it obviously) due to HA which in my case is a consequence of anorexia. thus, i’m at a huge risk for osteoporosis and/or cardiovascular disease. i have heart issues. i’m 18 and i still look prepubescent. when i restrict as i do now (as i’ve had attempts at recovery before) i have incurable insomnia, heart palpitations, low body temperature, constant nausea, headaches, anxiety, and fatigue to the point of not being able to do anything except doomscroll (and even that feels exhausting). my hair is falling out and my nails are brittle. and that’s not even all of it. also, EXTREME short term memory loss. and i get so irritable i literally can’t control myself around people in real life at times. it’s hellish",
          "created_utc": 1747335959.0
        }
      ]
    },
    {
      "id": "mslljt4",
      "author": "Chaerin_Sistas",
      "body": "This sounds horrific, I never knew this illness caused pus to come out of cuts and you really did a good job to convey that energy of NO energy. It just feels like you’re rotting, rotting, and rotting but you don’t really care cuz all you can focus on is the numbers",
      "created_utc": 1747389831.0,
      "score": 3,
      "context": [
        {
          "id": "msj7cor",
          "author": "ddaniell444",
          "body": "couldn't have better timing considering i'm the worse i've ever been and it needs to stop being glorified/ romanticised:\n\nfeeling your teeth literally rot every time you grit them\n\npuss oozing out of cuts on your hands\n\ngetting fully naked trying out multiple positions while being on the toilet for 1-2 hours trying to have a bowel movement\n\nextreme cold and ineffable malaise 24/7 paired with constant shaking and senile-like characteristics\n\nloss of relationships between friends and/ or family bc even though they're supportive and want you to recover they will ALL eventually get tired of the only select few conversation subjects being: calories, bloating, cardio/ exercise, routinely checking the energy content whenever someone is making food without knowing it's become muscle memory\n\non extended fasts following 48 hours: slow, continuous mental/ physical/ emotional deterioration to the point where you lay lifeless in one position holding in urine for hours bc you don't have the energy to move. no energy to shower/ brush your teeth/ change out of dirty clothes etc and if by some miracle you do have the energy to shower you'll most likely end up just standing there letting the water run down your body while trying to maintain your composure to not faint/ get light headed for half an hour. afterwards you might let yourself air dry while you stand in front of the mirror looking at yourself in complete and utter disgust for a further two hours. and so by the time you go to bed it could potentially be 3-5am and boom there goes your sleep schedule that you worked so indefatigably hard to fix! and assuming you fast for minimum 120 hours (5 days) that's three more days of enduring the aforementioned events. you're absolutely fucking starving at this point, so you order a substantial amount of fast food that's too much to eat considering your eyes are more famished than your stomach. you don't finish the meal, feeling full as fuck and stuffed to the point of wanting to purge. you don't purge and so yay you had some food (after depleting yourself of energy for almost a week) and you feel you can shower/ brush your teeth/ basic hygiene. but wait you then realise how fucking worthless and redundant you feel so you then ruminate on how you spent the last 5-7 days essentially killing time as a preserved corpse in a state of inertia. and all of this is an unbreakable cycle that could very well repeat until you die.\n\ni could continue but i understand this was a fair amount to take in and idk if anyone is gonna even read this but this kind of information should be readily accessible to counter all the fucking glorification of this virulent illness. i acknowledge that not all of this is relatable to every person with anorexia and should definitely NOT become stereotypical of persons suffering from an ed/ etiological characteristics regarding eds. recovery is truly worth it <3",
          "created_utc": 1747349870.0
        }
      ]
    },
    {
      "id": "mtj8b5y",
      "author": "__hara__",
      "body": "I’m fasting for 72 hours right now and you got that part sooo right. \n\nToo tired to even brush my teeth sometimes.",
      "created_utc": 1747858110.0,
      "score": 2,
      "context": [
        {
          "id": "msj7cor",
          "author": "ddaniell444",
          "body": "couldn't have better timing considering i'm the worse i've ever been and it needs to stop being glorified/ romanticised:\n\nfeeling your teeth literally rot every time you grit them\n\npuss oozing out of cuts on your hands\n\ngetting fully naked trying out multiple positions while being on the toilet for 1-2 hours trying to have a bowel movement\n\nextreme cold and ineffable malaise 24/7 paired with constant shaking and senile-like characteristics\n\nloss of relationships between friends and/ or family bc even though they're supportive and want you to recover they will ALL eventually get tired of the only select few conversation subjects being: calories, bloating, cardio/ exercise, routinely checking the energy content whenever someone is making food without knowing it's become muscle memory\n\non extended fasts following 48 hours: slow, continuous mental/ physical/ emotional deterioration to the point where you lay lifeless in one position holding in urine for hours bc you don't have the energy to move. no energy to shower/ brush your teeth/ change out of dirty clothes etc and if by some miracle you do have the energy to shower you'll most likely end up just standing there letting the water run down your body while trying to maintain your composure to not faint/ get light headed for half an hour. afterwards you might let yourself air dry while you stand in front of the mirror looking at yourself in complete and utter disgust for a further two hours. and so by the time you go to bed it could potentially be 3-5am and boom there goes your sleep schedule that you worked so indefatigably hard to fix! and assuming you fast for minimum 120 hours (5 days) that's three more days of enduring the aforementioned events. you're absolutely fucking starving at this point, so you order a substantial amount of fast food that's too much to eat considering your eyes are more famished than your stomach. you don't finish the meal, feeling full as fuck and stuffed to the point of wanting to purge. you don't purge and so yay you had some food (after depleting yourself of energy for almost a week) and you feel you can shower/ brush your teeth/ basic hygiene. but wait you then realise how fucking worthless and redundant you feel so you then ruminate on how you spent the last 5-7 days essentially killing time as a preserved corpse in a state of inertia. and all of this is an unbreakable cycle that could very well repeat until you die.\n\ni could continue but i understand this was a fair amount to take in and idk if anyone is gonna even read this but this kind of information should be readily accessible to counter all the fucking glorification of this virulent illness. i acknowledge that not all of this is relatable to every person with anorexia and should definitely NOT become stereotypical of persons suffering from an ed/ etiological characteristics regarding eds. recovery is truly worth it <3",
          "created_utc": 1747349870.0
        }
      ]
    },
    {
      "id": "mswgirz",
      "author": "Efficient-Oil1473",
      "body": "The planning out birthday meals is a tad to relatable.",
      "created_utc": 1747539790.0,
      "score": 3,
      "context": [
        {
          "id": "msijefp",
          "author": "Electrical-Meal177",
          "body": "planning out birthday meal/dessert MONTHS in advance, isolating from everyone,fainting, nails falling off",
          "created_utc": 1747342149.0
        }
      ]
    },
    {
      "id": "msllocu",
      "author": "Chaerin_Sistas",
      "body": "I’m curious, how is food disgusting to you? I find that most people with anorexia idolize food and spend most of their time looking at it (in grocery stores, social media, youtube) ",
      "created_utc": 1747389903.0,
      "score": 3,
      "context": [
        {
          "id": "msicxup",
          "author": "Bulky_Influence_4914",
          "body": "having to constantly come up with reasons why i don't eat or want food. i get exhausted pretending everything looks and tastes so delicious. food is repulsive.",
          "created_utc": 1747340293.0
        }
      ]
    },
    {
      "id": "msnd098",
      "author": "Coconutwatervodka",
      "body": "Yep",
      "created_utc": 1747412441.0,
      "score": 3,
      "context": [
        {
          "id": "msksip6",
          "author": "humbleavo",
          "body": "Loss of bladder control (literally peed myself in a store changing room before trying on a dress)\nLosing most of my hair\nStinking like trash despite good hygiene, since your body is catabolising itself it begins to stinkkkkk\nHorrific constipation to the point I literally had to fish out my own shit with gloves from my asshole\nEndless giant HEAVY trash bags of chew & spit \nAlways freezing, literal ice block, and no matter how hard you try you cannot warm up \nLies, all the lies, literally insane\nShoplifting foods to chew and spit (getting caught and arrested rip)\nPurging on a street\nMissing out in everything \nCompletely destroying your teeth \nLosing everyone\nFeet fulll of blisters and bruises and never ending infections bc of walking too much\nConstantly falling asleep unable to do anything\nIncapable of climbing up stairs\nGI issues forevermore \nYour loved ones watching you die  \n\n I could go on but the point is eating disorders aren’t glamorous, they’re life ruining and soul destroying",
          "created_utc": 1747372480.0
        }
      ]
    },
    {
      "id": "mt15kzn",
      "author": "Flat-Chance3301",
      "body": "what causes the stretch marks?",
      "created_utc": 1747608869.0,
      "score": 1,
      "context": [
        {
          "id": "msjrdo2",
          "author": "graphicinnit",
          "body": "Stretch marks EVERYWHERE, wrinkles, cavities, tooth loss, osteoporosis, permanent brain damage, pancreas/liver damage, gastroparesis, IBD, mitral valve prolapse, hair loss, infection, insomnia, constant pain, constant deep worry, a massive sense of dread like you're slowly drowning and there's nothing you can do to stop it bc you're in a bubble and it's just washing over you\nJust off the top of my head (literally)\n\nETA I got stretch marks and cavities in a relapse that lasted A MONTH and I only lost a few lbs. It's what snapped me out of it. They're even on my arms and calves",
          "created_utc": 1747357163.0
        }
      ]
    },
    {
      "id": "msoq5ay",
      "author": "amorbonitaaa",
      "body": "Feel you💗",
      "created_utc": 1747427170.0,
      "score": 5,
      "context": [
        {
          "id": "mslpboy",
          "author": "Few_Bell_8166",
          "body": "Permanently fucked digestion from abusing laxatives, sudden intolerances to foods you grew up on, not having the strength to move and just being stuck in bed, people commenting on it constantly and it being the first thing they see about you, not your personality. Knowing the kcals to everything off by heart so no you will never forget and being freezing constantly.",
          "created_utc": 1747391884.0
        }
      ]
    },
    {
      "id": "msqebkw",
      "author": "_TakeYourMeds",
      "body": "You’re welcome! ❤️ stay strong",
      "created_utc": 1747449256.0,
      "score": 2,
      "context": [
        {
          "id": "mspyx4j",
          "author": "Altruistic_Ask_2769",
          "body": "Was literally about to post about my dire urge to relapse rn so thank you",
          "created_utc": 1747443311.0
        }
      ]
    },
    {
      "id": "mspp727",
      "author": "kenna_rose",
      "body": "Oh my gosh. The COLD. Have you ever seen haunting of hill house series? One of the main characters is perpetually cold and some of his reasons/characteristics remind me of this.",
      "created_utc": 1747439637.0,
      "score": 3,
      "context": [
        {
          "id": "msnch9e",
          "author": "Coconutwatervodka",
          "body": "Yes this. I almost forgot a purchase I bought today in the fitting room. Thank god the employee caught me before I left.\n\nAlso being fucking cold. Even when it’s not cold out. \nMy bones aching/struggling to walk because I have a lack of energy\nAlso making people feel uncomfortable when you eat out because of indecisiveness/struggling to order/eat\nI also eat so fucking slowly compared to other people and it draws attention to me which I don’t like.\nAlso pissing all the time- at least once an hour\nMy hair falling out\nMy mom having dreams that I’m dying and my family being constantly worried about me\nHowever the illness also comforts me like nothing else does that’s why I don’t stop",
          "created_utc": 1747412286.0
        }
      ]
    },
    {
      "id": "mspgw3f",
      "author": "zodiacqu33n",
      "body": "Well said, omfg!",
      "created_utc": 1747436563.0,
      "score": 3,
      "context": [
        {
          "id": "msol0ei",
          "author": "No-Action578",
          "body": "after having it for years alongside other eds and becoming chronically malnourished ur getting to a point where u develop literally physical problems that make u swell so easily and make u look puffy at the silliest inconveniences (ur suffering and dying and need help but it creates a situation where stupid ed noise is like omg ur so f** ur gaining sm w***** 😰 we need to be even sicker and sicker. and ur priorities are basically fucked because your brain is distorted and ur body is fighting for it's life while ur stuck in side quests focusing on ur control, and body image, isolation, constant fatigue where you cant carry yourself or achieve your goals and dreams.",
          "created_utc": 1747425602.0
        }
      ]
    },
    {
      "id": "mspoofv",
      "author": "kenna_rose",
      "body": "As I sit here with a stomach screaming bloody murder at me and I’m like what bro stfu 🤫 no pain no gain 😓🤷‍♀️",
      "created_utc": 1747439444.0,
      "score": 3,
      "context": [
        {
          "id": "msol0ei",
          "author": "No-Action578",
          "body": "after having it for years alongside other eds and becoming chronically malnourished ur getting to a point where u develop literally physical problems that make u swell so easily and make u look puffy at the silliest inconveniences (ur suffering and dying and need help but it creates a situation where stupid ed noise is like omg ur so f** ur gaining sm w***** 😰 we need to be even sicker and sicker. and ur priorities are basically fucked because your brain is distorted and ur body is fighting for it's life while ur stuck in side quests focusing on ur control, and body image, isolation, constant fatigue where you cant carry yourself or achieve your goals and dreams.",
          "created_utc": 1747425602.0
        }
      ]
    },
    {
      "id": "mspgz9r",
      "author": "zodiacqu33n",
      "body": "I’m so sorry.",
      "created_utc": 1747436596.0,
      "score": 4,
      "context": [
        {
          "id": "msleowg",
          "author": "ActivityIll8075",
          "body": "I'm currently in liver and kidney failure. Enough said",
          "created_utc": 1747385663.0
        }
      ]
    },
    {
      "id": "msqhogd",
      "author": "_TakeYourMeds",
      "body": "Hope you’re doing better stranger 🫂 all the best",
      "created_utc": 1747450609.0,
      "score": 3,
      "context": [
        {
          "id": "msqgdt9",
          "author": "redoillamp",
          "body": "this was at my worst, keep in mind. \n\nill start with physical looks wise. was i thinner? yeah. but everytime i drank water or electrolytes my stomach puffed out and made me more triggered into starvation due to bloating. \nmy eyes were dull, my skin almost looked papery and grey. i had to use bronzer and self tanner to look even slightly normal due to almost all the color being drained out my natural complexion.\n\nmy skin was so taut over my bone structure that it looked like i had cheek implants. my eyes were sunken in and eye bags were massive. my hair was brittle and thinning out no matter what i did with it, to the point showering would pull out fist fuls at times \n\ni would be walking for multiple hours every single day, mostly in the morning and early afternoon. i live in the southern US and i was worse during the summer. one day i had come home not only to find multiple friction blisters on both my feet, but that i had sun poisoning on my shoulder and neck from how badly i burnt. my nails turned frail and literally translucent \n\ndon’t even get me started on the stomach issues. all I could think about was food. to the point that I’d literally have to go and cry in my work bathroom because I’d smell everything and couldn’t let myself have any. if i did eat something - it would shoot right through me. I’d have times where I’d be halfway through meals and physically feel all the old stuff in my system drop to make room for what im eating, so I’d use the bathroom halfway through. it was always liquid/watery. sorry for TMI, but it’s AN, she’s a gross bitch. \n\ni either had an excess of libido or nothing as well. or when i did actually do something - id check out halfway through because i simply was too tired\n\n\ni kind of permanently have tachycardia now. my heart rate never dips below 103. i have issues with hypoglycemia and my sugar can drop incredibly rapidly, even if ive ate normal. \n\nthe boredom as well. it’s crazy how boring it is. i consumed only one piece of media during my worst points and literally would just sit, bored as hell, for 10 hours watching one show and 10 select edits to get my mind off of food",
          "created_utc": 1747450073.0
        }
      ]
    },
    {
      "id": "mshsrv6",
      "author": "atx_weird_o",
      "body": "Thank you - same to you!",
      "created_utc": 1747334314.0,
      "score": 7,
      "context": [
        {
          "id": "mshp9ed",
          "author": "atx_weird_o",
          "body": "As a mom to a gorgeous daughter with AN, I saw self hatred, furry skin, brittle hair, rage when confronted about eating, lying, spending copious amounts of time in the bathroom, IBS, orthostatic blood pressure, inability to concentrate, and extreme depression. Hugs and positive thoughts to all those suffering from this horrific disease.",
          "created_utc": 1747333261.0
        },
        {
          "id": "mshpkjq",
          "author": "_TakeYourMeds",
          "body": "Thank you ❤️ sending well wishes to you and your daughter 🫂",
          "created_utc": 1747333353.0
        }
      ]
    },
    {
      "id": "mss9cxv",
      "author": "foranonsense",
      "body": "Yep, your body grows more hair to keep you warmer so you get super fuzzy.",
      "created_utc": 1747485534.0,
      "score": 3,
      "context": [
        {
          "id": "mshp9ed",
          "author": "atx_weird_o",
          "body": "As a mom to a gorgeous daughter with AN, I saw self hatred, furry skin, brittle hair, rage when confronted about eating, lying, spending copious amounts of time in the bathroom, IBS, orthostatic blood pressure, inability to concentrate, and extreme depression. Hugs and positive thoughts to all those suffering from this horrific disease.",
          "created_utc": 1747333261.0
        },
        {
          "id": "msqopi8",
          "author": "humancoloringbook923",
          "body": "Wait, wait. Furry skin? My fuzz could be from... this? How did i not know that?!",
          "created_utc": 1747453723.0
        }
      ]
    },
    {
      "id": "msqnt7m",
      "author": "FruitSalad_24",
      "body": "I thought I was out of the woods regarding digestive issues when I physically recovered but seemingly out of nowhere my body's decided to reject certain foods so now I cant eat them unless I want to deal with the nausea the following day (it was one of my favourite recovery foods too 😭)",
      "created_utc": 1747453313.0,
      "score": 2,
      "context": [
        {
          "id": "mshpkms",
          "author": "FruitSalad_24",
          "body": "Messed up digestive system/ reliant on laxatives because nothing functions right",
          "created_utc": 1747333354.0
        },
        {
          "id": "msor1dv",
          "author": "livv3ss",
          "body": "Messed up digestive system is the worst. I've been recovered for 2 years, and I still can't eat a full meal without my body projectile vomiting out. Almost like I'm rejecting the food. I have to eat in small quantities throughout the day instead.",
          "created_utc": 1747427442.0
        }
      ]
    },
    {
      "id": "mwv6yga",
      "author": "ophelia_la_teigne",
      "body": "I am recovered for almost 4 years now and i still have to take Lefax after every meal or flatulence is gonna kill me",
      "created_utc": 1749490226.0,
      "score": 1,
      "context": [
        {
          "id": "mshpkms",
          "author": "FruitSalad_24",
          "body": "Messed up digestive system/ reliant on laxatives because nothing functions right",
          "created_utc": 1747333354.0
        },
        {
          "id": "msor1dv",
          "author": "livv3ss",
          "body": "Messed up digestive system is the worst. I've been recovered for 2 years, and I still can't eat a full meal without my body projectile vomiting out. Almost like I'm rejecting the food. I have to eat in small quantities throughout the day instead.",
          "created_utc": 1747427442.0
        }
      ]
    },
    {
      "id": "mshtlmo",
      "author": "RealisticPepper5308",
      "body": "thank you💗💗 all the best to you too",
      "created_utc": 1747334565.0,
      "score": 5,
      "context": [
        {
          "id": "mshs27b",
          "author": "RealisticPepper5308",
          "body": "i had a seizure and starvation ketoacidosis at one point, and i had a bone scan done recently and i have osteopenia.  \nto name some others: incontinence, bradycardia, postural tachycardia, muscle atrophy, loss of hunger cues, fainting, hypotension, electrolyte imbalances, feeling like your knees are going to buckle when you stand, hypothermia, general bitchiness, your social life disappearing, reliving the same day over and over, lying on the floor after a shower, dry skin, blood pooling, raised liver enzymes, high cholesterol, low white blood cells, delayed healing of wounds, vulnerability to infections",
          "created_utc": 1747334100.0
        },
        {
          "id": "msht9fj",
          "author": "_TakeYourMeds",
          "body": "I’m so sorry ❤️ wishing you health",
          "created_utc": 1747334462.0
        }
      ]
    },
    {
      "id": "msj3x9f",
      "author": "yeaahhhhhhhhhhhh",
      "body": "The trauma I put my body through for so long caused something called guillen barre. I was walking 30k steps a day, not eating, killing myself… one day woke up paralyzed to my elbows. For 5 months. It’s a year later and I can walk but not run. My family loves to tell me I did it to myself because I wouldn’t stop 🙃",
      "created_utc": 1747348643.0,
      "score": 14,
      "context": [
        {
          "id": "mshtrz0",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
          "created_utc": 1747334617.0
        },
        {
          "id": "msj0999",
          "author": "runninginbubbles",
          "body": "Jesus what? I know that sounds incredibly traumatic but if you're able to, can you explain a bit further? How the heck does that happen??",
          "created_utc": 1747347372.0
        }
      ]
    },
    {
      "id": "msj4832",
      "author": "yeaahhhhhhhhhhhh",
      "body": "The trauma caused my body to start attacking my nerves. Killed them all in my legs, it’s called guillan barre. I’m 85% better now but was definitely a forced way to stop over exercising",
      "created_utc": 1747348750.0,
      "score": 9,
      "context": [
        {
          "id": "mshtrz0",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
          "created_utc": 1747334617.0
        },
        {
          "id": "msiyyt0",
          "author": "VirtualApricot",
          "body": "Aw, man. I’m so sorry. \n\nIf you're comfortable discussing it further, I'd be interested to learn more about your journey as I definitely haven’t heard of this potential side effect.. how did it manifest in relation to AN? Again, I’m so sorry :(",
          "created_utc": 1747346934.0
        }
      ]
    },
    {
      "id": "mspgpdc",
      "author": "yeaahhhhhhhhhhhh",
      "body": "Wishing you the best!!!!",
      "created_utc": 1747436491.0,
      "score": 2,
      "context": [
        {
          "id": "mshtrz0",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
          "created_utc": 1747334617.0
        },
        {
          "id": "msk4dhw",
          "author": "Sunshineheart02",
          "body": "The same thing happened to me and I needed physical therapy for months until I got enough strength back to even use a walker and I’m happy to say that a year later I am able to finally walk on my own again without any assistance but it was a long journey and I’m still super weak and still on the road to recovery ❤️‍🩹",
          "created_utc": 1747361999.0
        }
      ]
    },
    {
      "id": "msxxrga",
      "author": "yeaahhhhhhhhhhhh",
      "body": "I woke up one day and felt like fireworks were going off in my legs. Couldn’t feel the water or razor on my legs in the shower. Started to feel like I was walking through quick sand just trying to take a step. And then bam I just started falling down when I tried to stand up. My legs were fully paralyzed and it went to my elbows by the time anyone would take me seriously",
      "created_utc": 1747570166.0,
      "score": 4,
      "context": [
        {
          "id": "mshtrz0",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
          "created_utc": 1747334617.0
        },
        {
          "id": "msws1z6",
          "author": "None",
          "body": "May I ask, what where the starting symptoms that happened when you developed Guillan Barre, because I've actually never heard of this before and am very curious? (If this isn't allowed aka this comment I can delete it, just thought it would also give insight to those who don't know of it as well)",
          "created_utc": 1747545617.0
        }
      ]
    },
    {
      "id": "mtlawpl",
      "author": "ddaniell444",
      "body": "i'm glad you find it relatable! (because knowing you relate is the first step of recovery! (if you're in recovery or not) )\n\ni used mostly my experiences while writing that but not exclusively 👍👍",
      "created_utc": 1747882485.0,
      "score": 1,
      "context": [
        {
          "id": "msj7cor",
          "author": "ddaniell444",
          "body": "couldn't have better timing considering i'm the worse i've ever been and it needs to stop being glorified/ romanticised:\n\nfeeling your teeth literally rot every time you grit them\n\npuss oozing out of cuts on your hands\n\ngetting fully naked trying out multiple positions while being on the toilet for 1-2 hours trying to have a bowel movement\n\nextreme cold and ineffable malaise 24/7 paired with constant shaking and senile-like characteristics\n\nloss of relationships between friends and/ or family bc even though they're supportive and want you to recover they will ALL eventually get tired of the only select few conversation subjects being: calories, bloating, cardio/ exercise, routinely checking the energy content whenever someone is making food without knowing it's become muscle memory\n\non extended fasts following 48 hours: slow, continuous mental/ physical/ emotional deterioration to the point where you lay lifeless in one position holding in urine for hours bc you don't have the energy to move. no energy to shower/ brush your teeth/ change out of dirty clothes etc and if by some miracle you do have the energy to shower you'll most likely end up just standing there letting the water run down your body while trying to maintain your composure to not faint/ get light headed for half an hour. afterwards you might let yourself air dry while you stand in front of the mirror looking at yourself in complete and utter disgust for a further two hours. and so by the time you go to bed it could potentially be 3-5am and boom there goes your sleep schedule that you worked so indefatigably hard to fix! and assuming you fast for minimum 120 hours (5 days) that's three more days of enduring the aforementioned events. you're absolutely fucking starving at this point, so you order a substantial amount of fast food that's too much to eat considering your eyes are more famished than your stomach. you don't finish the meal, feeling full as fuck and stuffed to the point of wanting to purge. you don't purge and so yay you had some food (after depleting yourself of energy for almost a week) and you feel you can shower/ brush your teeth/ basic hygiene. but wait you then realise how fucking worthless and redundant you feel so you then ruminate on how you spent the last 5-7 days essentially killing time as a preserved corpse in a state of inertia. and all of this is an unbreakable cycle that could very well repeat until you die.\n\ni could continue but i understand this was a fair amount to take in and idk if anyone is gonna even read this but this kind of information should be readily accessible to counter all the fucking glorification of this virulent illness. i acknowledge that not all of this is relatable to every person with anorexia and should definitely NOT become stereotypical of persons suffering from an ed/ etiological characteristics regarding eds. recovery is truly worth it <3",
          "created_utc": 1747349870.0
        },
        {
          "id": "mtj8b5y",
          "author": "__hara__",
          "body": "I’m fasting for 72 hours right now and you got that part sooo right. \n\nToo tired to even brush my teeth sometimes.",
          "created_utc": 1747858110.0
        }
      ]
    },
    {
      "id": "msor146",
      "author": "Bulky_Influence_4914",
      "body": "EDs don't follow a simple template. Some of us have serious sensory and other issues with food.",
      "created_utc": 1747427439.0,
      "score": 3,
      "context": [
        {
          "id": "msicxup",
          "author": "Bulky_Influence_4914",
          "body": "having to constantly come up with reasons why i don't eat or want food. i get exhausted pretending everything looks and tastes so delicious. food is repulsive.",
          "created_utc": 1747340293.0
        },
        {
          "id": "msllocu",
          "author": "Chaerin_Sistas",
          "body": "I’m curious, how is food disgusting to you? I find that most people with anorexia idolize food and spend most of their time looking at it (in grocery stores, social media, youtube) ",
          "created_utc": 1747389903.0
        }
      ]
    },
    {
      "id": "msza566",
      "author": "SweetBabyMona",
      "body": "I absolutely hate food as well. It's part of why I struggle with anorexia amd bulimia in the first place. In my case, the Ed's came first and then very quickly I developed a fear and hatred of putting food in my body. I only eat when I absolutely have to and that's really hard for me right now. I'm trying to push myself to have more than 1 meal (or ig it's sometimes more a snack) a day, but the thought of food in my body disgusts me, no matter what food it is.",
      "created_utc": 1747587048.0,
      "score": 1,
      "context": [
        {
          "id": "msicxup",
          "author": "Bulky_Influence_4914",
          "body": "having to constantly come up with reasons why i don't eat or want food. i get exhausted pretending everything looks and tastes so delicious. food is repulsive.",
          "created_utc": 1747340293.0
        },
        {
          "id": "msllocu",
          "author": "Chaerin_Sistas",
          "body": "I’m curious, how is food disgusting to you? I find that most people with anorexia idolize food and spend most of their time looking at it (in grocery stores, social media, youtube) ",
          "created_utc": 1747389903.0
        }
      ]
    },
    {
      "id": "mt1hq8o",
      "author": "graphicinnit",
      "body": "Rapid weight loss (and rapid is very very subjective to your body) causes your skin to weaken, and as it fails to shrink down in time, it tears. Combine that with your skin being unable to heal itself or deal with stress because it can't even produce collagen (even if you supplement really really well all that it needs and eat the foods you need to effectively absorb it (you won't), starving yourself releases a shit ton of cortisol, and your body decides it would rather focus on survival than repairing your skin, so it kind of just tears everywhere",
      "created_utc": 1747613309.0,
      "score": 2,
      "context": [
        {
          "id": "msjrdo2",
          "author": "graphicinnit",
          "body": "Stretch marks EVERYWHERE, wrinkles, cavities, tooth loss, osteoporosis, permanent brain damage, pancreas/liver damage, gastroparesis, IBD, mitral valve prolapse, hair loss, infection, insomnia, constant pain, constant deep worry, a massive sense of dread like you're slowly drowning and there's nothing you can do to stop it bc you're in a bubble and it's just washing over you\nJust off the top of my head (literally)\n\nETA I got stretch marks and cavities in a relapse that lasted A MONTH and I only lost a few lbs. It's what snapped me out of it. They're even on my arms and calves",
          "created_utc": 1747357163.0
        },
        {
          "id": "mt15kzn",
          "author": "Flat-Chance3301",
          "body": "what causes the stretch marks?",
          "created_utc": 1747608869.0
        }
      ]
    },
    {
      "id": "mssaax6",
      "author": "humancoloringbook923",
      "body": "Well, that explains a lot.... ugh.",
      "created_utc": 1747485929.0,
      "score": 3,
      "context": [
        {
          "id": "mshp9ed",
          "author": "atx_weird_o",
          "body": "As a mom to a gorgeous daughter with AN, I saw self hatred, furry skin, brittle hair, rage when confronted about eating, lying, spending copious amounts of time in the bathroom, IBS, orthostatic blood pressure, inability to concentrate, and extreme depression. Hugs and positive thoughts to all those suffering from this horrific disease.",
          "created_utc": 1747333261.0
        },
        {
          "id": "msqopi8",
          "author": "humancoloringbook923",
          "body": "Wait, wait. Furry skin? My fuzz could be from... this? How did i not know that?!",
          "created_utc": 1747453723.0
        },
        {
          "id": "mss9cxv",
          "author": "foranonsense",
          "body": "Yep, your body grows more hair to keep you warmer so you get super fuzzy.",
          "created_utc": 1747485534.0
        }
      ]
    },
    {
      "id": "mtetibo",
      "author": "Sunshineheart02",
      "body": "Same to you! We’ve got this!!",
      "created_utc": 1747796321.0,
      "score": 2,
      "context": [
        {
          "id": "mshtrz0",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
          "created_utc": 1747334617.0
        },
        {
          "id": "msk4dhw",
          "author": "Sunshineheart02",
          "body": "The same thing happened to me and I needed physical therapy for months until I got enough strength back to even use a walker and I’m happy to say that a year later I am able to finally walk on my own again without any assistance but it was a long journey and I’m still super weak and still on the road to recovery ❤️‍🩹",
          "created_utc": 1747361999.0
        },
        {
          "id": "mspgpdc",
          "author": "yeaahhhhhhhhhhhh",
          "body": "Wishing you the best!!!!",
          "created_utc": 1747436491.0
        }
      ]
    },
    {
      "id": "mt0sgei",
      "author": "None",
      "body": "Geez, that is very rough. Sorry you had to experience that. But glad too hear from your other comment that you are able to walk again!",
      "created_utc": 1747604299.0,
      "score": 2,
      "context": [
        {
          "id": "mshtrz0",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
          "created_utc": 1747334617.0
        },
        {
          "id": "msws1z6",
          "author": "None",
          "body": "May I ask, what where the starting symptoms that happened when you developed Guillan Barre, because I've actually never heard of this before and am very curious? (If this isn't allowed aka this comment I can delete it, just thought it would also give insight to those who don't know of it as well)",
          "created_utc": 1747545617.0
        },
        {
          "id": "msxxrga",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I woke up one day and felt like fireworks were going off in my legs. Couldn’t feel the water or razor on my legs in the shower. Started to feel like I was walking through quick sand just trying to take a step. And then bam I just started falling down when I tried to stand up. My legs were fully paralyzed and it went to my elbows by the time anyone would take me seriously",
          "created_utc": 1747570166.0
        }
      ]
    },
    {
      "id": "mt10v4y",
      "author": "yeaahhhhhhhhhhhh",
      "body": "thank you!!! Take care of yourself 💜",
      "created_utc": 1747607164.0,
      "score": 2,
      "context": [
        {
          "id": "mshtrz0",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
          "created_utc": 1747334617.0
        },
        {
          "id": "msws1z6",
          "author": "None",
          "body": "May I ask, what where the starting symptoms that happened when you developed Guillan Barre, because I've actually never heard of this before and am very curious? (If this isn't allowed aka this comment I can delete it, just thought it would also give insight to those who don't know of it as well)",
          "created_utc": 1747545617.0
        },
        {
          "id": "msxxrga",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I woke up one day and felt like fireworks were going off in my legs. Couldn’t feel the water or razor on my legs in the shower. Started to feel like I was walking through quick sand just trying to take a step. And then bam I just started falling down when I tried to stand up. My legs were fully paralyzed and it went to my elbows by the time anyone would take me seriously",
          "created_utc": 1747570166.0
        },
        {
          "id": "mt0sgei",
          "author": "None",
          "body": "Geez, that is very rough. Sorry you had to experience that. But glad too hear from your other comment that you are able to walk again!",
          "created_utc": 1747604299.0
        }
      ]
    },
    {
      "id": "mt121to",
      "author": "None",
      "body": "You too! 😁",
      "created_utc": 1747607587.0,
      "score": 2,
      "context": [
        {
          "id": "mshtrz0",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I was paralyzed from ten years of anorexia. Stay safe friends",
          "created_utc": 1747334617.0
        },
        {
          "id": "msws1z6",
          "author": "None",
          "body": "May I ask, what where the starting symptoms that happened when you developed Guillan Barre, because I've actually never heard of this before and am very curious? (If this isn't allowed aka this comment I can delete it, just thought it would also give insight to those who don't know of it as well)",
          "created_utc": 1747545617.0
        },
        {
          "id": "msxxrga",
          "author": "yeaahhhhhhhhhhhh",
          "body": "I woke up one day and felt like fireworks were going off in my legs. Couldn’t feel the water or razor on my legs in the shower. Started to feel like I was walking through quick sand just trying to take a step. And then bam I just started falling down when I tried to stand up. My legs were fully paralyzed and it went to my elbows by the time anyone would take me seriously",
          "created_utc": 1747570166.0
        },
        {
          "id": "mt0sgei",
          "author": "None",
          "body": "Geez, that is very rough. Sorry you had to experience that. But glad too hear from your other comment that you are able to walk again!",
          "created_utc": 1747604299.0
        },
        {
          "id": "mt10v4y",
          "author": "yeaahhhhhhhhhhhh",
          "body": "thank you!!! Take care of yourself 💜",
          "created_utc": 1747607164.0
        }
      ]
    }
  ]
}