{
  "id": "1ktgzfi",
  "subreddit": "AnorexiaNervosa",
  "author": "hatsuneMcChickenn",
  "created_utc": 1747999111.0,
  "title": "Why is it so normalized to hate on us?",
  "selftext": "Why is it so normalized to hate on people with restrictive eating disorders? Daily i see people saying were annoying, were all fatphobic, we’re privileged for choosing to starve ourselves, ive even seen someone say wanting to be underweight is pedophilic. Why are we seen as monsters who are all proana and hate everybody whos not underweight? Why is it normalized for people to make accounts simply to hate on us or to go into our safe spaces and shame us? People need to understand were not choosing a silly little diet going online calling ourselves “best ana”. Were dying and everyones laughing at us for it.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ktgzfi/why_is_it_so_normalized_to_hate_on_us/",
  "score": 118,
  "num_comments": 31,
  "comments": [
    {
      "id": "mttdqcj",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1747999111.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mttil6i",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1748001185.0,
      "score": 74,
      "context": []
    },
    {
      "id": "mttfyni",
      "author": "nyctosys",
      "body": "because a lot of people are struggling right now. unfortunately, some people choose to take it out on others. but if theyve actively gone into YOUR space, simply to make you feel awful, then you need to remember just how fucking lame that is and how sour and empty their soul is.",
      "created_utc": 1748000090.0,
      "score": 25,
      "context": []
    },
    {
      "id": "mtts04m",
      "author": "OrganicDoughnut5965",
      "body": "I’ve said it once and I’ll say it again. Truly believe the only way to understand this disease is to go through it yourself. And if you’ve never gone through it, you’ll just never get what it’s really like. Sooo all these HATERS have clearly never gone through it. And they’re inconsiderate and small minded. Having this terrible disease has truly made me more considerate of others literally all the time bc u never know what ppl are going through. So these people are just selfish, idiotic, and to be honest, too stupid to wrap their head around the concept of an ED and the fact that no one chooses to be this way and slowly kill our bodies. So fuck the haters (can u tell this pisses me off lmaoooo)",
      "created_utc": 1748004680.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mttv2aj",
      "author": "mygarbagepersonacct",
      "body": "I think most people simply don’t know anyone with anorexia intimately enough to know what an ugly, damaging, and dangerous disease is actually is. They only see silly or dramatized versions of it in the media, or maybe even have a friend who is anorexic, but still don’t see the daily struggles. The media usually only shows us  one very specific type of anorexic and it’s easy to hate on people like that because who wants to feel sorry for pretty, acceptably thin, usually white, and middle to upper class young women.\n\nMy husband is a high school teacher. A couple months ago, one kid called another student a fat ass in class. My husband is pretty lenient with his students, but he stopped class to scold that kid about how harmful language like that is. He said he asked if anyone actually knew someone with an eating disorder because they are horrifying and only one person raised their hand and she looked like she was about to cry. I’m not sure who she knows, but she obviously was familiar with how destructive the disease is based on her reaction. \n\nI think most of the people who know us well, those who live with us or see the shit we do to ourselves and how it affects not only us but the people we love, would never be so flippant about it. I know that even when I was fresh in my disorder, I still had a romanticized idea of anorexia as being mostly beautiful ballerinas or models with self-discipline; I would never had imagined that I’d be 36 years old one day with my hair thinning, fighting with my husband about whether I lied about dinner or why I was too tired to go ride bikes with my son, hiding my sketchy ass gray market GLP agonists from everyone, or literally almost killing myself because I refused to eat in the triple digits even as my poor body was trying to repair itself after chemotherapy and radiation. \n\nTL;DR - It’s extremely difficult to find any accurate representations of anorexia because anorexics are so good at hiding themselves and lying to everyone, including ourselves, becomes second nature.",
      "created_utc": 1748005727.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mtvyinw",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1748027789.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mtyr25z",
      "author": "spooky_cat734",
      "body": "I see this a lot too but someone that’s morbidly obese gets told their beautiful weight doesn’t matter etc. if weight didn’t matter then why aren’t super thin people beautiful too? Both are damaging to the body? Maybe that’s just me but we should stop commenting on people’s bodies period you never know what someone is going through. I’ve suffered with Crohn’s and ED before that and was much more underweight from Crohn’s than anorexia. I constantly got told horrible things online or I got proanas asking for tips which is also vile especially knowing that I needed a part of my insides removed because they swelled shut.",
      "created_utc": 1748065354.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mtugsyp",
      "author": "Aggressive-Buddy2477",
      "body": "this happens so often with me especially on tumblr like i would be posted smth relevant to me but some random 30 year old dude has the audacity to say the most hurtful shit ever",
      "created_utc": 1748012365.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mu1nb2k",
      "author": "pdt666",
      "body": "others are jealous- it’s displaced. if anyone lived one week with a restrictive ED, they would never be jealous or say rude things ever again. people think it’s a choice and view things as having “self control” and being thin (even though we aren’t all thin) as things to desire and be jealous of. it has zero to do with self control, as we all know. if we all always had self control, we probably wouldn’t do a bunch of weird shit our brains are telling us to do.",
      "created_utc": 1748109974.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mtw04hw",
      "author": "ZhiYoNa",
      "body": "It’s jealousy. Thinness is prized in society and they get a sanitized version of what anorexia is in the media (thin, young, white, middle + upper class).",
      "created_utc": 1748028278.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mttify3",
      "author": "Temporary_Comfort435",
      "body": "They just don't know what its like 😔",
      "created_utc": 1748001126.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mtu089w",
      "author": "Baccoony",
      "body": "They are either shitting on those pro-ana mfs who just bully those who dont have ed's and laugh about it and criticise overweight people\n\nOr they just dont understand what eating disorders are",
      "created_utc": 1748007426.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mu2fg59",
      "author": "Beautiful_Reindeer18",
      "body": "they'll get so heated when someone has an eating disorder but when it's depression or bpd or bipolar disorder it's fine right????!!! it irks me so bad, it's why i refuse to ever talk about my ed with anyone or even bring it up bc i feel like anything i say will sound \"pick me\" or \"attention seeking\"",
      "created_utc": 1748119507.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mu01p69",
      "author": "RequirementNo3606",
      "body": "Some of it i think is jealous as the beauty standard still is skinny , they see it as “we’re the most disciplined in this diet” even though it is a mental illness",
      "created_utc": 1748091099.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mu2oejd",
      "author": "lestialstwt",
      "body": "literally so many ppl treat it like a joke",
      "created_utc": 1748122605.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mtv2he1",
      "author": "Worried_Brilliant939",
      "body": "Not every case, but often because they’re even more mentally unhinged than we are and hate on anorexics who aren’t yet fully cachexic-looking because they’re literally /jealous/. It’s pretty fucked up, actually!",
      "created_utc": 1748018504.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mtv4b2n",
      "author": "clementineshats",
      "body": "i don’t have any issue with peiple who struggle with anorexia. i have the most sympathy for anybody that has it cause i know what it’s like \n\nwhat i don’t like however is qhen obviously sick people try to romanticise or promote their eating habits and sell them as healthy. it just makes me feel horrible about myself. or when people like take their illness out on other people. i know á girl who told á naturally thin girl that her and kate moss were her idols and she only ever compliments peiple who are extremely thin.\n\ni’ll never comment on those behaviour's or comment on videos that promote them though, cause it would just end up getting me into an environment i don’t want to be in ",
      "created_utc": 1748019023.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mtu2aft",
      "author": "iswearimnotangry",
      "body": "It’s kinda ridiculous. It’s okay to hate on skinny or anorexic people because we’re all privileged and self absorbed, when in reality fat people are just the same. But if you say the same things about fat people, they’ll burn you at the stake. \n\nBeing privileged goes both ways. You can starve yourself into thinness or you can eat yourself into obesity. Both are unhealthy and destroy your body. \n\nBeing self absorbed goes both ways. Anorexic people only care about their weight and the way they look? Fat people do too. Obese and overweight people, in my experience, are always fixated on and unhappy with the way they look and are always trying to lose weight, like that will solve all their problems (like many anorexics also believe). \n\nIt’s okay for fat people to be upset with how they look, but god forbid a thin person be insecure with their own looks. \n\nMaybe it’s the world we live in, but being “too fat” is acceptable for some reason that being “too thin” is not.",
      "created_utc": 1748008081.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mtv93av",
      "author": "MetalingusMikeII",
      "body": "Because most people are overweight or obese. People are less likely to hate on their own group.",
      "created_utc": 1748020371.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mtziy5p",
      "author": "Lazy_Average_4187",
      "body": "I usually dont take it personally because i think theyre talking about online pro ana people who bully fat people.",
      "created_utc": 1748082163.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mu3j0wo",
      "author": "Shuyuya",
      "body": "Jealousy",
      "created_utc": 1748134160.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muauvu7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1748241044.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mul0eei",
      "author": "Moist_Record_8867",
      "body": "I think it's a mix. It is shitty to hate on people who have eating disorders, but also having anorexia can make you do some pretty fucked up stuff. I definitely did fucked up stuff that I really regret when I had anorexia - I take accountability for my behaviour and know the responsibility ultimately falls on me, but I do also think that anorexia encourages you to prioritise yourself over others (or, to put it another way, to prioritise not eating). A memorable incident for me is ruining my friend's eighteenth birthday because I refused to eat. I was trying to be sneaky about not eating but it was incredibly noticable and ruined what should have been a really good party for her. I still think about that day sometimes. I was never intentionally mean or nasty to others, but just stuff like that still caused people pain. Since I had anorexia, it wasn't like I could 'just eat', and I wasn't trying to bring attention to the fact that I wasn't eating. However, it still ruined what should have been a good day for her. \n\n  \nI'm not saying it's good to shit on us, and i don't think it's fair, but I do also think that ED can cause people to do some shitty stuff, and it's important to acknowledge it.",
      "created_utc": 1748379020.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mtxv5ag",
      "author": "username248124",
      "body": "I think they’re jealous tbh",
      "created_utc": 1748051215.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mtwjhq1",
      "author": "fuschiaoctopus",
      "body": "I dunno, I've noticed some of the most passionately hateful people towards anorexics are people with other eating disorders 😬. For example if you go on any of the mixed ed subs, AN is FAR more heavily censored and attacked than any other ed, with almost any mention of a behavior or symptom of the disorder garnering at least one \"lol ok humblebragging pro\" type accusation because they can't put aside their own disordered thoughts and feelings. Some of the least empathetic, most awful comments regarding glp1s and underweight celebrities (one in particular) have come from ed subs, with many of the comments tearing into their appearance, judging their character, and declaring them an evil immoral person for their body or suspected anorexia. You'd think they'd understand more, but it's like they understand less and they're so much more bitter??",
      "created_utc": 1748034178.0,
      "score": 12,
      "context": [
        {
          "id": "mtts04m",
          "author": "OrganicDoughnut5965",
          "body": "I’ve said it once and I’ll say it again. Truly believe the only way to understand this disease is to go through it yourself. And if you’ve never gone through it, you’ll just never get what it’s really like. Sooo all these HATERS have clearly never gone through it. And they’re inconsiderate and small minded. Having this terrible disease has truly made me more considerate of others literally all the time bc u never know what ppl are going through. So these people are just selfish, idiotic, and to be honest, too stupid to wrap their head around the concept of an ED and the fact that no one chooses to be this way and slowly kill our bodies. So fuck the haters (can u tell this pisses me off lmaoooo)",
          "created_utc": 1748004680.0
        }
      ]
    },
    {
      "id": "mtvzgu1",
      "author": "iswearimnotangry",
      "body": "Right! It’s always “every body is beautiful” until it’s someone who is struggling with anorexia. Like our mere existence is a slap in the face to body positivity. People just assume because we hate our bodies that we hate everyone else’s.",
      "created_utc": 1748028078.0,
      "score": 8,
      "context": [
        {
          "id": "mtvyinw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1748027789.0
        }
      ]
    },
    {
      "id": "mtvo0uz",
      "author": "Stunning-Check2275",
      "body": "Yeah and people automatically assume u have an ed if your thin, people just need to stop commenting on peoples bodies period.",
      "created_utc": 1748024613.0,
      "score": 3,
      "context": [
        {
          "id": "mtu2aft",
          "author": "iswearimnotangry",
          "body": "It’s kinda ridiculous. It’s okay to hate on skinny or anorexic people because we’re all privileged and self absorbed, when in reality fat people are just the same. But if you say the same things about fat people, they’ll burn you at the stake. \n\nBeing privileged goes both ways. You can starve yourself into thinness or you can eat yourself into obesity. Both are unhealthy and destroy your body. \n\nBeing self absorbed goes both ways. Anorexic people only care about their weight and the way they look? Fat people do too. Obese and overweight people, in my experience, are always fixated on and unhappy with the way they look and are always trying to lose weight, like that will solve all their problems (like many anorexics also believe). \n\nIt’s okay for fat people to be upset with how they look, but god forbid a thin person be insecure with their own looks. \n\nMaybe it’s the world we live in, but being “too fat” is acceptable for some reason that being “too thin” is not.",
          "created_utc": 1748008081.0
        }
      ]
    },
    {
      "id": "mtvg5el",
      "author": "hatsuneMcChickenn",
      "body": "You can be overweight and struggle with a restrictive ed",
      "created_utc": 1748022344.0,
      "score": 2,
      "context": [
        {
          "id": "mtv93av",
          "author": "MetalingusMikeII",
          "body": "Because most people are overweight or obese. People are less likely to hate on their own group.",
          "created_utc": 1748020371.0
        }
      ]
    },
    {
      "id": "muavb53",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1748241284.0,
      "score": 1,
      "context": [
        {
          "id": "muauvu7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1748241044.0
        }
      ]
    },
    {
      "id": "mtwmqgn",
      "author": "OrganicDoughnut5965",
      "body": "Honestly yes I do agree with this to an extent. I had a coworker who was anorexic and she literally fat shames my other coworkers. She’d call them “too big” and try to get them to size down. (They’re literally healthy and not overweight at all) so I can see this point of view too for sure",
      "created_utc": 1748035210.0,
      "score": 5,
      "context": [
        {
          "id": "mtts04m",
          "author": "OrganicDoughnut5965",
          "body": "I’ve said it once and I’ll say it again. Truly believe the only way to understand this disease is to go through it yourself. And if you’ve never gone through it, you’ll just never get what it’s really like. Sooo all these HATERS have clearly never gone through it. And they’re inconsiderate and small minded. Having this terrible disease has truly made me more considerate of others literally all the time bc u never know what ppl are going through. So these people are just selfish, idiotic, and to be honest, too stupid to wrap their head around the concept of an ED and the fact that no one chooses to be this way and slowly kill our bodies. So fuck the haters (can u tell this pisses me off lmaoooo)",
          "created_utc": 1748004680.0
        },
        {
          "id": "mtwjhq1",
          "author": "fuschiaoctopus",
          "body": "I dunno, I've noticed some of the most passionately hateful people towards anorexics are people with other eating disorders 😬. For example if you go on any of the mixed ed subs, AN is FAR more heavily censored and attacked than any other ed, with almost any mention of a behavior or symptom of the disorder garnering at least one \"lol ok humblebragging pro\" type accusation because they can't put aside their own disordered thoughts and feelings. Some of the least empathetic, most awful comments regarding glp1s and underweight celebrities (one in particular) have come from ed subs, with many of the comments tearing into their appearance, judging their character, and declaring them an evil immoral person for their body or suspected anorexia. You'd think they'd understand more, but it's like they understand less and they're so much more bitter??",
          "created_utc": 1748034178.0
        }
      ]
    },
    {
      "id": "mu0kexj",
      "author": "mygarbagepersonacct",
      "body": "I think part of the ugliness of EDs is how competitive they can be and how jealous they can make us of how other people’s sickness manifests itself.",
      "created_utc": 1748097668.0,
      "score": 3,
      "context": [
        {
          "id": "mtts04m",
          "author": "OrganicDoughnut5965",
          "body": "I’ve said it once and I’ll say it again. Truly believe the only way to understand this disease is to go through it yourself. And if you’ve never gone through it, you’ll just never get what it’s really like. Sooo all these HATERS have clearly never gone through it. And they’re inconsiderate and small minded. Having this terrible disease has truly made me more considerate of others literally all the time bc u never know what ppl are going through. So these people are just selfish, idiotic, and to be honest, too stupid to wrap their head around the concept of an ED and the fact that no one chooses to be this way and slowly kill our bodies. So fuck the haters (can u tell this pisses me off lmaoooo)",
          "created_utc": 1748004680.0
        },
        {
          "id": "mtwjhq1",
          "author": "fuschiaoctopus",
          "body": "I dunno, I've noticed some of the most passionately hateful people towards anorexics are people with other eating disorders 😬. For example if you go on any of the mixed ed subs, AN is FAR more heavily censored and attacked than any other ed, with almost any mention of a behavior or symptom of the disorder garnering at least one \"lol ok humblebragging pro\" type accusation because they can't put aside their own disordered thoughts and feelings. Some of the least empathetic, most awful comments regarding glp1s and underweight celebrities (one in particular) have come from ed subs, with many of the comments tearing into their appearance, judging their character, and declaring them an evil immoral person for their body or suspected anorexia. You'd think they'd understand more, but it's like they understand less and they're so much more bitter??",
          "created_utc": 1748034178.0
        }
      ]
    },
    {
      "id": "mtvp6a5",
      "author": "MetalingusMikeII",
      "body": "Sure, but the majority of people are biased towards themselves. We’re a tribalistic species.",
      "created_utc": 1748024953.0,
      "score": 2,
      "context": [
        {
          "id": "mtv93av",
          "author": "MetalingusMikeII",
          "body": "Because most people are overweight or obese. People are less likely to hate on their own group.",
          "created_utc": 1748020371.0
        },
        {
          "id": "mtvg5el",
          "author": "hatsuneMcChickenn",
          "body": "You can be overweight and struggle with a restrictive ed",
          "created_utc": 1748022344.0
        }
      ]
    },
    {
      "id": "mu0knfd",
      "author": "mygarbagepersonacct",
      "body": "That’s interesting because I feel like most of the anorexics I know irl WANT other people to gain weight. It’s that desperation to always be the smallest person in the room",
      "created_utc": 1748097744.0,
      "score": 4,
      "context": [
        {
          "id": "mtts04m",
          "author": "OrganicDoughnut5965",
          "body": "I’ve said it once and I’ll say it again. Truly believe the only way to understand this disease is to go through it yourself. And if you’ve never gone through it, you’ll just never get what it’s really like. Sooo all these HATERS have clearly never gone through it. And they’re inconsiderate and small minded. Having this terrible disease has truly made me more considerate of others literally all the time bc u never know what ppl are going through. So these people are just selfish, idiotic, and to be honest, too stupid to wrap their head around the concept of an ED and the fact that no one chooses to be this way and slowly kill our bodies. So fuck the haters (can u tell this pisses me off lmaoooo)",
          "created_utc": 1748004680.0
        },
        {
          "id": "mtwjhq1",
          "author": "fuschiaoctopus",
          "body": "I dunno, I've noticed some of the most passionately hateful people towards anorexics are people with other eating disorders 😬. For example if you go on any of the mixed ed subs, AN is FAR more heavily censored and attacked than any other ed, with almost any mention of a behavior or symptom of the disorder garnering at least one \"lol ok humblebragging pro\" type accusation because they can't put aside their own disordered thoughts and feelings. Some of the least empathetic, most awful comments regarding glp1s and underweight celebrities (one in particular) have come from ed subs, with many of the comments tearing into their appearance, judging their character, and declaring them an evil immoral person for their body or suspected anorexia. You'd think they'd understand more, but it's like they understand less and they're so much more bitter??",
          "created_utc": 1748034178.0
        },
        {
          "id": "mtwmqgn",
          "author": "OrganicDoughnut5965",
          "body": "Honestly yes I do agree with this to an extent. I had a coworker who was anorexic and she literally fat shames my other coworkers. She’d call them “too big” and try to get them to size down. (They’re literally healthy and not overweight at all) so I can see this point of view too for sure",
          "created_utc": 1748035210.0
        }
      ]
    },
    {
      "id": "mu0o1eu",
      "author": "OrganicDoughnut5965",
      "body": "Ikr. She’s wack",
      "created_utc": 1748098817.0,
      "score": 3,
      "context": [
        {
          "id": "mtts04m",
          "author": "OrganicDoughnut5965",
          "body": "I’ve said it once and I’ll say it again. Truly believe the only way to understand this disease is to go through it yourself. And if you’ve never gone through it, you’ll just never get what it’s really like. Sooo all these HATERS have clearly never gone through it. And they’re inconsiderate and small minded. Having this terrible disease has truly made me more considerate of others literally all the time bc u never know what ppl are going through. So these people are just selfish, idiotic, and to be honest, too stupid to wrap their head around the concept of an ED and the fact that no one chooses to be this way and slowly kill our bodies. So fuck the haters (can u tell this pisses me off lmaoooo)",
          "created_utc": 1748004680.0
        },
        {
          "id": "mtwjhq1",
          "author": "fuschiaoctopus",
          "body": "I dunno, I've noticed some of the most passionately hateful people towards anorexics are people with other eating disorders 😬. For example if you go on any of the mixed ed subs, AN is FAR more heavily censored and attacked than any other ed, with almost any mention of a behavior or symptom of the disorder garnering at least one \"lol ok humblebragging pro\" type accusation because they can't put aside their own disordered thoughts and feelings. Some of the least empathetic, most awful comments regarding glp1s and underweight celebrities (one in particular) have come from ed subs, with many of the comments tearing into their appearance, judging their character, and declaring them an evil immoral person for their body or suspected anorexia. You'd think they'd understand more, but it's like they understand less and they're so much more bitter??",
          "created_utc": 1748034178.0
        },
        {
          "id": "mtwmqgn",
          "author": "OrganicDoughnut5965",
          "body": "Honestly yes I do agree with this to an extent. I had a coworker who was anorexic and she literally fat shames my other coworkers. She’d call them “too big” and try to get them to size down. (They’re literally healthy and not overweight at all) so I can see this point of view too for sure",
          "created_utc": 1748035210.0
        },
        {
          "id": "mu0knfd",
          "author": "mygarbagepersonacct",
          "body": "That’s interesting because I feel like most of the anorexics I know irl WANT other people to gain weight. It’s that desperation to always be the smallest person in the room",
          "created_utc": 1748097744.0
        }
      ]
    }
  ]
}