{
  "id": "1kwr9t5",
  "subreddit": "AnorexiaNervosa",
  "author": "ialwaysknewwhy",
  "created_utc": 1748362261.0,
  "title": "Did you ever catch a glimpse of yourself and realize how bad you look?",
  "selftext": "I was just leaving a local cafe near me and the lady tried to give me a pastry and said “please take it looks like you need it” I didn’t know what to do and then saw my reflection and I look like hell I am sitting in my car crying typing this and I thought I was doing good I’ve put weight on it’s been months since I left treatment and I thought I was getting better maybe am I seeing something that isn’t there can I not trust my own eyes anymore what do I do I am not sure what’s happening 😭 ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1kwr9t5/did_you_ever_catch_a_glimpse_of_yourself_and/",
  "score": 172,
  "num_comments": 15,
  "comments": [
    {
      "id": "mujd2o7",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1748362261.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mujedog",
      "author": "anxious_melon_45",
      "body": "Oof I'm sorry - that's really not easy to hear. It's good that you're recovering though, strangers won't know that you are, but any improvement is amazing and something to be proud of.",
      "created_utc": 1748362641.0,
      "score": 37,
      "context": []
    },
    {
      "id": "mujhzb1",
      "author": "AngryPandaz",
      "body": "I've never had someone make a comment to me the way you've described but I do occasionally catch my reflection in shop/car windows etc and realise how bad I look - like my arms and legs are really skinny, my breastbone and ribs are really pronounced etc. I see these things in my mirrors at home yet for some reason they don't register as 'bad/unwell' like they do when I'm out. \n\nDon't let this derail you though, keep going with your recovery!",
      "created_utc": 1748363683.0,
      "score": 32,
      "context": []
    },
    {
      "id": "mun0hwm",
      "author": "Sensasie",
      "body": "Yes, occasionally I see a photo of myself and I’m surprised how skinny I look, because that’s not how I usually see myself. I find if I look at it repeatedly over time, it starts to morph into something I’m more used to, and the initial reaction is gone. I guess that’s just the body dysmorphia doing its work. I have no objective way to know how I’m doing, which is why I’m stuck weighing myself all the time I think.",
      "created_utc": 1748403207.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mukdq9y",
      "author": "bjhouse822",
      "body": "You are still recovering. Don't let this set you back!! Keep getting better!",
      "created_utc": 1748372526.0,
      "score": 7,
      "context": []
    },
    {
      "id": "muqivmv",
      "author": "megryanreynolds",
      "body": "I'm so sorry you were in the car crying. That makes me so sad. That person might have meant well and we could say that all day/give them the benefit of the doubt but no, fuck them.",
      "created_utc": 1748454164.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mujwjbl",
      "author": "Princessa-J",
      "body": "just because from someone else’s POV you aren’t progressing, doesn’t mean you aren’t!!! don’t let this discourage you! proud of you and i believe in your healing! be kind to yourself",
      "created_utc": 1748367713.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mvrxduc",
      "author": "Ok-Excuse-444",
      "body": "Today, I was taking pictures of myself from behind to see how my french braid turned out, and... I was shocked, to say the least. I have never seen myself look like this. It is scary. It's summer, and I am going to have to try to hide what I saw with baggy clothes or something...  But somehow, it still doesn't matter.",
      "created_utc": 1748960783.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mwvdstq",
      "author": "ophelia_la_teigne",
      "body": "When i was in treatment in the Hospital i had very much without warning a moment of realization after i showered and saw myself in the mirror. It was is if i was looking at another person. And it terrified me so much that i just ate. And gained 10 kg in a single month. It got harder again after that sadly...\n\nAnd another time i realized how old and gaunt and grey my face looked when i met a friend shortly after i got out of the hospital. Because she looked so healthy and radiant. I had really forgotten what a healthy face looked like...",
      "created_utc": 1749492075.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mwvol0j",
      "author": "ialwaysknewwhy",
      "body": "It’s sad how twisted self perception becomes and how you can be so motivated to recover one day and then it’s like you haven’t done anything.  I really hope you’re doing well.",
      "created_utc": 1749495098.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n43mcdh",
      "author": "Queenofwands1212",
      "body": "Yes and It’s gotten to the point where I am now having to cover up certain parts of my body, even tho I live in the hottest climate right now, but chest area looks scary even to me. I wish I could just gain weight in my chest bone area. But whenever I gain it goes right to stomach legs or arms. Never chest . Makes  me fucking furious",
      "created_utc": 1752978342.0,
      "score": 1,
      "context": []
    },
    {
      "id": "murbiyo",
      "author": "ialwaysknewwhy",
      "body": "Thank you and I agree.  I just thought I looked better than I do I guess I was feeling so good like I accomplished something but I guess not.",
      "created_utc": 1748462294.0,
      "score": 2,
      "context": [
        {
          "id": "muqivmv",
          "author": "megryanreynolds",
          "body": "I'm so sorry you were in the car crying. That makes me so sad. That person might have meant well and we could say that all day/give them the benefit of the doubt but no, fuck them.",
          "created_utc": 1748454164.0
        }
      ]
    },
    {
      "id": "muklx7d",
      "author": "nervous_veggie",
      "body": "Agree with your sentiment- but \n\nThey didn’t say they weren’t progressing. The comment implies they look poorly, and since recovery is often a long process, it just means that they’re not there/ done yet. It doesn’t take away from the progress they’ve made already, that person is only seeing them at a moment in time, not comparing them to how they used to look",
      "created_utc": 1748374898.0,
      "score": 4,
      "context": [
        {
          "id": "mujwjbl",
          "author": "Princessa-J",
          "body": "just because from someone else’s POV you aren’t progressing, doesn’t mean you aren’t!!! don’t let this discourage you! proud of you and i believe in your healing! be kind to yourself",
          "created_utc": 1748367713.0
        }
      ]
    },
    {
      "id": "mure606",
      "author": "megryanreynolds",
      "body": "You probably did accomplish something!!!! Please don't let one person's random opinion bring you down. And I realize that is NOT helpful advice at all but I'm saying it to you anyway.  Last week, my team at work had this all hands staff meeting and it was in person. My team is all over and we never see each other in real life/only our faces on teams calls. So, I put on a great dress that I felt confident in and thought I looked okay! At the end of the day when we were in the parking lot leaving; one of my superiors said \"megryanryenolds, you don't look well!\" and it just. Crushed me. So.. again this doesn't help but I get it. Hang in there!!!",
      "created_utc": 1748463048.0,
      "score": 3,
      "context": [
        {
          "id": "muqivmv",
          "author": "megryanreynolds",
          "body": "I'm so sorry you were in the car crying. That makes me so sad. That person might have meant well and we could say that all day/give them the benefit of the doubt but no, fuck them.",
          "created_utc": 1748454164.0
        },
        {
          "id": "murbiyo",
          "author": "ialwaysknewwhy",
          "body": "Thank you and I agree.  I just thought I looked better than I do I guess I was feeling so good like I accomplished something but I guess not.",
          "created_utc": 1748462294.0
        }
      ]
    },
    {
      "id": "murq760",
      "author": "ialwaysknewwhy",
      "body": "I won’t I promise and yes it does help to hear so thank you so much.",
      "created_utc": 1748466415.0,
      "score": 3,
      "context": [
        {
          "id": "muqivmv",
          "author": "megryanreynolds",
          "body": "I'm so sorry you were in the car crying. That makes me so sad. That person might have meant well and we could say that all day/give them the benefit of the doubt but no, fuck them.",
          "created_utc": 1748454164.0
        },
        {
          "id": "murbiyo",
          "author": "ialwaysknewwhy",
          "body": "Thank you and I agree.  I just thought I looked better than I do I guess I was feeling so good like I accomplished something but I guess not.",
          "created_utc": 1748462294.0
        },
        {
          "id": "mure606",
          "author": "megryanreynolds",
          "body": "You probably did accomplish something!!!! Please don't let one person's random opinion bring you down. And I realize that is NOT helpful advice at all but I'm saying it to you anyway.  Last week, my team at work had this all hands staff meeting and it was in person. My team is all over and we never see each other in real life/only our faces on teams calls. So, I put on a great dress that I felt confident in and thought I looked okay! At the end of the day when we were in the parking lot leaving; one of my superiors said \"megryanryenolds, you don't look well!\" and it just. Crushed me. So.. again this doesn't help but I get it. Hang in there!!!",
          "created_utc": 1748463048.0
        }
      ]
    }
  ]
}