{
  "id": "1l0i3ze",
  "subreddit": "AnorexiaNervosa",
  "author": "ialwaysknewwhy",
  "created_utc": 1748758899.0,
  "title": "Is it insane I am scared of no being the skinny one anymore",
  "selftext": "This probably sounds insane but I am scared to not be the “skinny” girl anymore.  A little context I am (22F) and have been dealing with anorexia since I was about 14 so it’s pretty much all I know myself as. I’ve realized pretty much all the attention I get from guys and girls is pretty much because of my size and if I am not the skinny one I’ll just be the same and no one will want me.  I don’t think guys find this attractive but it’s at least cute and small is feminine and being uw is something girls I don’t already know or just met will talk to me about so if I am just “normal” or worse bigger then I won’t have anything.  Is this crazy?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1l0i3ze/is_it_insane_i_am_scared_of_no_being_the_skinny/",
  "score": 127,
  "num_comments": 19,
  "comments": [
    {
      "id": "mvdggjm",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1748758899.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvf9fcr",
      "author": "azulezb",
      "body": "I don't think it's insane at all. I'm very similar to you (also 22F, AN started when I was around 14) and feel the same way. I'm also someone who has been tiny for my whole life and letting go of being small and dainty and feminine is actually really difficult when these qualities are praised so much.\n\nThat doesn't mean that your world will end or you will be worse off if you are an average weight. If anything, your life will improve dramatically if you recover, because it's impossible to both have anorexia and live a genuinely happy/fulfilled life. \n\nWhat I'm gonna write next is honestly for me more than it is for you:\n\nIt's harsh, but being small doesn't actually make you any more special than anyone else. Not only that, but there will always be someone smaller, unless you are rotting in the ground. If you can't decouple your self worth from your size, the miserable jealousy you feel towards anyone smaller than you won't go away, and you will continue to live a sad life where your only goal is to be as small as possible. And no one will actually want you if your life is that sad.",
      "created_utc": 1748789563.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mvdk46q",
      "author": "pessimistic_witch",
      "body": "I completely understand, this is one of the reasons my ed started in the first place and is still an identity I hold on to. I was always praised for being skinny and having the “perfect ballet body” as a kid and then I went through puberty…I think we know how that went",
      "created_utc": 1748760975.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mvdreag",
      "author": "Artistic_Worker_8499",
      "body": "As you age you will realize being thin isn't as important as being successful and needed in life. Needed in work, family and friendships. Successful as a parent, an employee or student.",
      "created_utc": 1748765237.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mveqokp",
      "author": "megryanreynolds",
      "body": "While I think the older I’ve gotten I’ve realized being thin is just something that only I think is important for myself and one else cares (and I also don’t care about other people’s body sizes.. it’s strictly about my own body which is annoying) BUT!!! I don’t think this is crazy or insane of you.",
      "created_utc": 1748783394.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mvdhwgb",
      "author": "klurble",
      "body": "i’m 24 and have never gotten attention about it but i am also afraid of not being the skinny one",
      "created_utc": 1748759716.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mvic3vh",
      "author": "angel_apocalypse",
      "body": "No you are not crazy, this is completely understandable. If I gain like 5lbs and no longer look kind of sickly I start getting hella anxiety. I keep trying to tell myself that “you can be thin and actually have a little boobs and a butt and look better” and it’s like I know I look better with those 5 extra lbs but it doesn’t matter. I don’t feel content until I look ill. So warped but it is what it is",
      "created_utc": 1748824482.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mvg7wrb",
      "author": "internetcat5000",
      "body": "It’s hard at first because of course it’s something you’ve built your identity around. But eventually it becomes freeing and quite exciting. You have the chance to define yourself in other ways, I tried out lots of new styles and found a lot of self love through that like defining myself in new ways. \n\nIt’s a valid feeling, it’s part of the recovery.",
      "created_utc": 1748799851.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mvdi5wl",
      "author": "Sea-Ladder-8744",
      "body": "A bit, but its understandable for the ed. Just know that your worth and your likeability are not tied to your weight. You are not your ed. IDK the context of how people you just met talk to you about being uw, but if its anything at all related to being jealous, then they dont understand the gravity of why you are uw and how it negatively impacts your health. And if its not about jealousy, than it is probably about concern. Neither one of those are the type of attention you should want",
      "created_utc": 1748759864.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvk4euw",
      "author": "Warrior-Skye",
      "body": "I'm 29y/o now and this is the thing why I can't let go of my skinny body. But I do know that people minds are changing when they grow up. Boys are attracted to feminine bodies, not children bodies. People do like you because of who you are not because of how you look.\n\nIt's hard to believe, I know. My partner loves my for who I am, is attracted to me, but begs me to recover and achieve a healthy body",
      "created_utc": 1748855275.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvl3x70",
      "author": "sunflowerforlife100",
      "body": "I feel the same (Im 23 soon 24 M/NB) and has been struggling with eating disorders since I was 14, been switching between AN and binge eating and now I don't really know what I have, I'm not underweight but quite thin. And it's like an identity now and I hate it so much. Getting anxiety every time I eat is a living hell",
      "created_utc": 1748871340.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvmy2ch",
      "author": "No-Building4113",
      "body": "This is the hardest part for me too. I’ve always been the skinny one and it’s hard to feel like you’re losing your identity.",
      "created_utc": 1748890569.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvndfdu",
      "author": "zodiacqu33n",
      "body": "If you have anorexia, it’s not. Pretty par for the course! Doesn’t mean you can’t get better tho, if you choose to 🙂",
      "created_utc": 1748895014.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mwhen67",
      "author": "dogsandcatslol",
      "body": "oh god after going to inpatient for bipolar reasons and i gained weight i was so horrified when i saw myself in the picture i started screaming suicide and was threatening to kill the therapist 😭😭😭😭😭",
      "created_utc": 1749301197.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mxgke07",
      "author": "None",
      "body": "Yeah, that’s how mine started. It’s not even that I hate how my body looks, I’m just worried about maintaining it. I also went through a time where I was binge eating a lot for whatever reason, and I don’t want to go back to that.",
      "created_utc": 1749766007.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvdnje7",
      "author": "Time_Shower_1825",
      "body": "I get u 10000%",
      "created_utc": 1748762967.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mvfnkmo",
      "author": "ialwaysknewwhy",
      "body": "Thank you and I know in my head you’re right about everything and I am sorry.",
      "created_utc": 1748793801.0,
      "score": 4,
      "context": [
        {
          "id": "mvf9fcr",
          "author": "azulezb",
          "body": "I don't think it's insane at all. I'm very similar to you (also 22F, AN started when I was around 14) and feel the same way. I'm also someone who has been tiny for my whole life and letting go of being small and dainty and feminine is actually really difficult when these qualities are praised so much.\n\nThat doesn't mean that your world will end or you will be worse off if you are an average weight. If anything, your life will improve dramatically if you recover, because it's impossible to both have anorexia and live a genuinely happy/fulfilled life. \n\nWhat I'm gonna write next is honestly for me more than it is for you:\n\nIt's harsh, but being small doesn't actually make you any more special than anyone else. Not only that, but there will always be someone smaller, unless you are rotting in the ground. If you can't decouple your self worth from your size, the miserable jealousy you feel towards anyone smaller than you won't go away, and you will continue to live a sad life where your only goal is to be as small as possible. And no one will actually want you if your life is that sad.",
          "created_utc": 1748789563.0
        }
      ]
    },
    {
      "id": "mvi29a7",
      "author": "Affection-Angel",
      "body": "The joy of being able to show up reliably in work, life, and friendships. Having the energy to be yourself and be present in the moment. This is what creates the opportunity for priceless connections and memories. Getting better is worth it.",
      "created_utc": 1748820915.0,
      "score": 3,
      "context": [
        {
          "id": "mvdreag",
          "author": "Artistic_Worker_8499",
          "body": "As you age you will realize being thin isn't as important as being successful and needed in life. Needed in work, family and friendships. Successful as a parent, an employee or student.",
          "created_utc": 1748765237.0
        }
      ]
    },
    {
      "id": "mvityc8",
      "author": "azulezb",
      "body": "It sucks and it's hard and I'm not sure if we will ever be able to completely stop feeling this way, but I hope things get better for both of us.",
      "created_utc": 1748831242.0,
      "score": 2,
      "context": [
        {
          "id": "mvf9fcr",
          "author": "azulezb",
          "body": "I don't think it's insane at all. I'm very similar to you (also 22F, AN started when I was around 14) and feel the same way. I'm also someone who has been tiny for my whole life and letting go of being small and dainty and feminine is actually really difficult when these qualities are praised so much.\n\nThat doesn't mean that your world will end or you will be worse off if you are an average weight. If anything, your life will improve dramatically if you recover, because it's impossible to both have anorexia and live a genuinely happy/fulfilled life. \n\nWhat I'm gonna write next is honestly for me more than it is for you:\n\nIt's harsh, but being small doesn't actually make you any more special than anyone else. Not only that, but there will always be someone smaller, unless you are rotting in the ground. If you can't decouple your self worth from your size, the miserable jealousy you feel towards anyone smaller than you won't go away, and you will continue to live a sad life where your only goal is to be as small as possible. And no one will actually want you if your life is that sad.",
          "created_utc": 1748789563.0
        },
        {
          "id": "mvfnkmo",
          "author": "ialwaysknewwhy",
          "body": "Thank you and I know in my head you’re right about everything and I am sorry.",
          "created_utc": 1748793801.0
        }
      ]
    }
  ]
}