{
  "id": "1l0y8az",
  "subreddit": "AnorexiaNervosa",
  "author": "soshingi",
  "created_utc": 1748807801.0,
  "title": "Being hungry makes you so boring",
  "selftext": "I've had a bit of a relapse over the past few weeks. My brain fog has been crazy, to the point where I was hanging out with my boyfriend today and simply struggling to keep up conversation. I had no thoughts. No opinions. Nothing to offer to the discussion. I felt so *boring*. It wasn't even like all I was thinking about was food, I just wasn't thinking about anything. \n\nFor me, the whole 'food is fuel' idea was never particularly helpful when it came to recovery. I didn't really care about my physical health. I'm not that athletic, I'm happy to be weak physically. \n\nBut mentally? \n\nWithout food, your brain is starved. How are people meant to hear all the interesting things I have to say, all the opinions I have - everything that makes me the person people know me to be, if my brain has nothing to run on? Who cares if I'm a little skinnier when I'm quiet and apathetic? I'm happier when I'm fuelled, and when I'm happier, I'm funnier. I'm more extroverted, spontaneous, chatty. I am the person I am.\n\nThat's why I'm going to eat. That is why. I don't want to be the person who has no energy to do anything. \n\n",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1l0y8az/being_hungry_makes_you_so_boring/",
  "score": 114,
  "num_comments": 6,
  "comments": [
    {
      "id": "mvgycn3",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1748807801.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvjoyri",
      "author": "googoogega",
      "body": "I 100% understand this and it makes me feel so guilty. The constant food noise completely takes over and I become just so incredibly boring especially for my husband. It’s to the point where he voiced I seemed less interested in him/being around him. I know eating is the fix but I admittedly am still telling myself I can “work around it,” I know I can’t though. I’m so glad you are taking this as a sign to take care of yourself. The people around you unfortunately do notice the behaviors changing, they just don’t understand why.",
      "created_utc": 1748845925.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mvh2f07",
      "author": "nzy0zx",
      "body": "I feel the same and have the same opinions as you but still find it hard to not restrict myself around food just because I want to be skinny haha funny.",
      "created_utc": 1748809031.0,
      "score": 6,
      "context": []
    },
    {
      "id": "myrf8dj",
      "author": "Lazy_Average_4187",
      "body": "I hate it. I used to be kind of intelligent and its obvious to me now that im genuinely getting dumber. Now i cant even explain basic politics or history without blanking. I used to talk about history for hours if people let me. I feel like ive just forgotten everything i spent so long learning.",
      "created_utc": 1750396192.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvh33ys",
      "author": "soshingi",
      "body": "For me it comes down to what is more important. Life is about people, relationships, and experiences. If you ended up in an accident that left you bed bound for the rest of your life tomorrow, would you look back and think you'd spent the time you had well? It's so fucking tough but I just try and think about what I'll think in 20 years. I don't think I'll look back and care about what I looked like as much as I'll care about the memories I missed out on.\n\nWhen I think back to myself at my skinniest, I don't remember loving my body. I remember being sad and alone.",
      "created_utc": 1748809239.0,
      "score": 11,
      "context": [
        {
          "id": "mvh2f07",
          "author": "nzy0zx",
          "body": "I feel the same and have the same opinions as you but still find it hard to not restrict myself around food just because I want to be skinny haha funny.",
          "created_utc": 1748809031.0
        }
      ]
    },
    {
      "id": "mvh4net",
      "author": "nzy0zx",
      "body": "I get your point like i understand where you're coming from and i know you're right but I can't help it. My whole life I've been considered 'ugly ' and after gaining weight aaah I can't tell you how ugly I feel everyday especially when you have pretty friends. So to me skinny is almost equivalent to becoming more beautiful and confident and actually feeling like I'm worth something. About memories and experiences ,i look at my old photos and just think about how fat I looked and what  other people must've thought about me after seeing me back then 🤣 and how embarassing it was to be the ugliest there ( cause I was not skinny)",
      "created_utc": 1748809708.0,
      "score": 1,
      "context": [
        {
          "id": "mvh2f07",
          "author": "nzy0zx",
          "body": "I feel the same and have the same opinions as you but still find it hard to not restrict myself around food just because I want to be skinny haha funny.",
          "created_utc": 1748809031.0
        },
        {
          "id": "mvh33ys",
          "author": "soshingi",
          "body": "For me it comes down to what is more important. Life is about people, relationships, and experiences. If you ended up in an accident that left you bed bound for the rest of your life tomorrow, would you look back and think you'd spent the time you had well? It's so fucking tough but I just try and think about what I'll think in 20 years. I don't think I'll look back and care about what I looked like as much as I'll care about the memories I missed out on.\n\nWhen I think back to myself at my skinniest, I don't remember loving my body. I remember being sad and alone.",
          "created_utc": 1748809239.0
        }
      ]
    }
  ]
}