{
  "id": "1l7wsun",
  "subreddit": "AnorexiaNervosa",
  "author": "Slow_Influence6453",
  "created_utc": 1749556543.0,
  "title": "Anyone else find AN ‘easier’ in the winter vs the summer?",
  "selftext": "Tr",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1l7wsun/anyone_else_find_an_easier_in_the_winter_vs_the/",
  "score": 132,
  "num_comments": 36,
  "comments": [
    {
      "id": "mx022d1",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1749556543.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx06f9y",
      "author": "runninginbubbles",
      "body": "Yup!!!!! No-one judges my getting up at 1030am and going to bed at 8pm. So much more comfortable to be hungry and lethargic when the days are short and its acceptable to curl up on the couch all day.",
      "created_utc": 1749558241.0,
      "score": 84,
      "context": []
    },
    {
      "id": "mx03dl2",
      "author": "guttedkat",
      "body": "Yup. Ig it’s because during winter I’m able to cover up with clothes more without getting questioned, therefore I’m able to hide my body easier",
      "created_utc": 1749557063.0,
      "score": 30,
      "context": []
    },
    {
      "id": "mx0mfgb",
      "author": "abrahamsbitch",
      "body": "for me it is harder. the urge to eat is so much stronger, i live in the midwest and winter time is casserole time. i always backslide and end up so worried/anxious all the time because of it.\n\nsummer comes and i feel the urge less to eat. i don't bloat as much, which always ruins my entire mood when i see it.",
      "created_utc": 1749563651.0,
      "score": 31,
      "context": []
    },
    {
      "id": "mx04o72",
      "author": "father_figyre",
      "body": "Not me. The winter is unforgiveably cold when youre underweight. Each winter, I always wonder if its going to be my last one. The summer isnt so hellishly cold, and I also lose my appetite in the summer for some reason.",
      "created_utc": 1749557571.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mx036gw",
      "author": "grapesodamilk",
      "body": "Nope so much harder because I feel the cold even worse 😬\n\nEven in summer I was layering with 3 blankets and wearing a jumper and long pants and now that it’s winter I cannot even breathe under all the layers and blankets I have to wear to bed \n\nI think I’m gonna buy an electric blanket…",
      "created_utc": 1749556985.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mx092l9",
      "author": "OrganicDoughnut5965",
      "body": "yes bc summer is when ppl where tiny bikinis and ppl see my body too much. Not putting on a bikini once this summer ong",
      "created_utc": 1749559212.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mx0alom",
      "author": "Horror-Dragonfly-266",
      "body": "For me it’s hardest in the winter. Always too cold. Can’t run or bike outside. Can’t control food around holidays. Too cold and tired to have the energy to run on the treadmill. ",
      "created_utc": 1749559754.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mx0wwqu",
      "author": "Unhappy_Fix_1515",
      "body": "i find it easier during summer to be honest since everyone around me is incredibly skinny and i get triggered more often",
      "created_utc": 1749566746.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mx0xpb7",
      "author": "mouse-bites",
      "body": "I’m the opposite. I find it’s harder on me in the winter months due to the cold.",
      "created_utc": 1749566973.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mx1afyd",
      "author": "Skythebluestars",
      "body": "I miss my hooddies during summer, i cont know what to wear. I feel so uncomfy in everything short. I just wanna hide in oversized pants and hoodies in my bed with million blankies. Do a summer hibbernation. Till winter",
      "created_utc": 1749570595.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mx29lcr",
      "author": "South-Job-794",
      "body": "Yesss. I feel incredibly ugly without a big fancy coat to hide my body 😭 winter is cute scarves, my hair looks nicer, all of my winter clothes are cute. Summer clothes are ugly, acne, sweaty back, mosquitos and barbeques. I hate summer in general but i get way hungrier in the summer. Winter i barely feel hunger",
      "created_utc": 1749580359.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mx07pd7",
      "author": "thesoapbeing",
      "body": "For me the summer is easier bc I don’t see as many people every day, so it’s easier for me to control intake. In the winter I’m always cold and hungry, and it’s when a lot of street food vendors come out for Holliday stuff. The air smells like a feast constantly in that season :/",
      "created_utc": 1749558717.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mx180t1",
      "author": "skxnnyangel",
      "body": "YES. i recover in summer and relapse in winter.",
      "created_utc": 1749569919.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mx1mtsj",
      "author": "Objective_Agency4923",
      "body": "i don’t know why but i’m 10x more physically active in winter",
      "created_utc": 1749574099.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mx1naz1",
      "author": "HonestToe2408",
      "body": "Agreed! BBQs, outings, small clothes and losing more calories to sweat increases my appetite. Let me cold and lazy 😭",
      "created_utc": 1749574232.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mx2wmsc",
      "author": "pixiemorningstar_",
      "body": "It's quite the opposite for me. The holidays here in the states are just too tempting to resist 😔",
      "created_utc": 1749586906.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mx2ybwt",
      "author": "nervous_veggie",
      "body": "The illness is never easier, but winter and summer have different challenges. Winter is horrendous for the cold and I hate layering up. But in summer longer days exhaust me.",
      "created_utc": 1749587376.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mx4mqkb",
      "author": "Aisukoshka",
      "body": "Naw. I always find it so much harder. I'm cold at normal ambient temperature. I find myself eating so much more in winter because I'm TOO COLD to function. \n\nBeing underweight in freezing temperatures feels worse than death.",
      "created_utc": 1749607004.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mxclrh7",
      "author": "Euphoric-Plane-6117",
      "body": "Omg yes. Idk y but I have more of an appetite in the summer. I also can feel comfortable in larger/more baggy clothes in the winter.",
      "created_utc": 1749718735.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mx3bwqb",
      "author": "stabbednsoping",
      "body": "Yes. I feel free in the summer sun and breeze. But in the winter I feel suffocated by my clothes and over warm sometimes other times im freezing in terror",
      "created_utc": 1749591293.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx3jnjs",
      "author": "Royal_Rose_20",
      "body": "Yes and no. Yes because during summer I'm bored and at home so I'm always wanting to eat, so I end up binging sometimes. But no because all the comments and praise I get on my body fuel my purging, and during summer is when I get the most compliments!",
      "created_utc": 1749593698.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx3xq32",
      "author": "rabbitheartedfool",
      "body": "Summer is awful! I’m very sensitive to the heat esp when I’m doing bad, and not to mention all the summer clothes 🙂‍↔️",
      "created_utc": 1749598323.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx4rhpl",
      "author": "cheesecakegirl3",
      "body": "personally theres more things to do during the summer so im more pre occupied",
      "created_utc": 1749608682.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx5cmzi",
      "author": "Deepspacechris",
      "body": "Lol no, because I'm freezing cold, even in the summer. It's June now (in Scandinavia, where I currently live), and I still wear long underwear, a long sleeve and a sweater or a jacket when I go outside. Inside I have to wear a woolen sweater, even with the heater still on. I guess winter is easy because I won't look like a dork wearing lots of clothes, but the cold weather can be quite rough up here.",
      "created_utc": 1749617455.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx5w7zr",
      "author": "Big-Molasses4788",
      "body": "Hmm kinda depends cuz both have downsides. Like its currently winter where i live (Australia , Sydney lol) and I feel the cold even more and that rlly sucks when I'm at school even with the heaters blasted in class. But in winter I like wearing winter clothing so that ppl can't see how fat my body probs looks (even tho ppl say I'm not)😭. But in winter I'm also too cold to have any energy to do anything such as even walking. I also get hungrier in winter.\nIn summer however I don't like it cuz I get insanely jealous when I see ppl wearing their summer bikinis and tight crop tops cuz they have a nicer body than mine and they look skinnier than me😭😭. I'm also always exhausted due to longer summer days.  At least in summer I don't get as hungry as I am in winter.",
      "created_utc": 1749628111.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx8rfc3",
      "author": "ProfessorThis4264",
      "body": "its soo much easier. im so busy, i can excuse not eating, and my parents wont see me enough to worry about my food intake. im also less hungry in the winter. ",
      "created_utc": 1749665928.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mxu4k52",
      "author": "Temporary_Comfort435",
      "body": "For me it's vice versa because in the summer everyone shows off their \"bikini bodies\" and it's so triggering that I relapse for nearly the whole summer.",
      "created_utc": 1749950192.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0a9n4g",
      "author": "Beautiful_Tank_6564",
      "body": "yes!!\n\ni always get down to a \"good\" weight and i believe i look way prettier in the winter because of AN. \n\nfor me it was because of having structure from school and feeling extremely dumb compared to all my classmates where i then feel the need to compensate for my dumbness by being thinner/thinnest.",
      "created_utc": 1751136698.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx09hgo",
      "author": "Slow_Influence6453",
      "body": "Omg you get it. Being painfully cold with 500 layers, two hot water bottles and a heated blanket was easier when there was 6 hours of light in the day. Moving around was too hard bcus of how cold I was so I could lay in one spot all day, meaning my apetite was minimal and the cold impacts the way my face looks. So eventho I’m cold now, if it’s warm outside the combination makes my face swell and I cant hide that under a hoodie or scarf",
      "created_utc": 1749559360.0,
      "score": 19,
      "context": [
        {
          "id": "mx06f9y",
          "author": "runninginbubbles",
          "body": "Yup!!!!! No-one judges my getting up at 1030am and going to bed at 8pm. So much more comfortable to be hungry and lethargic when the days are short and its acceptable to curl up on the couch all day.",
          "created_utc": 1749558241.0
        }
      ]
    },
    {
      "id": "mx0a6nr",
      "author": "Slow_Influence6453",
      "body": "This is my first time with AN, started last summer until now but I the affects of AN really started around October time so I havent reall experienced a summer with it at the severity it’s at. Eventhough the cold was horrifically painful and I definitely questioned if I was gna survive my way through, the heat makes it so much harder to hide under all the layers that provide me comfort outside. I feel way more exposed and the temperature changes make my face swell which is a huge trigger for my ED",
      "created_utc": 1749559608.0,
      "score": 5,
      "context": [
        {
          "id": "mx04o72",
          "author": "father_figyre",
          "body": "Not me. The winter is unforgiveably cold when youre underweight. Each winter, I always wonder if its going to be my last one. The summer isnt so hellishly cold, and I also lose my appetite in the summer for some reason.",
          "created_utc": 1749557571.0
        }
      ]
    },
    {
      "id": "mx09pgh",
      "author": "Slow_Influence6453",
      "body": "See for me, I miss that. Bcus i was too cold to move even with layers, blankets, hot water bottle & a heated blanket. So I had an excuse to lay in one spot all day.",
      "created_utc": 1749559439.0,
      "score": 3,
      "context": [
        {
          "id": "mx036gw",
          "author": "grapesodamilk",
          "body": "Nope so much harder because I feel the cold even worse 😬\n\nEven in summer I was layering with 3 blankets and wearing a jumper and long pants and now that it’s winter I cannot even breathe under all the layers and blankets I have to wear to bed \n\nI think I’m gonna buy an electric blanket…",
          "created_utc": 1749556985.0
        }
      ]
    },
    {
      "id": "mx1fisf",
      "author": "father_figyre",
      "body": "Ahh I understand. I mean, I do sort of relate. However, I just wear my baggy clothes and layers and everything no matter the weather. Id rather sweat to death than have people see my body XD",
      "created_utc": 1749572021.0,
      "score": 2,
      "context": [
        {
          "id": "mx04o72",
          "author": "father_figyre",
          "body": "Not me. The winter is unforgiveably cold when youre underweight. Each winter, I always wonder if its going to be my last one. The summer isnt so hellishly cold, and I also lose my appetite in the summer for some reason.",
          "created_utc": 1749557571.0
        },
        {
          "id": "mx0a6nr",
          "author": "Slow_Influence6453",
          "body": "This is my first time with AN, started last summer until now but I the affects of AN really started around October time so I havent reall experienced a summer with it at the severity it’s at. Eventhough the cold was horrifically painful and I definitely questioned if I was gna survive my way through, the heat makes it so much harder to hide under all the layers that provide me comfort outside. I feel way more exposed and the temperature changes make my face swell which is a huge trigger for my ED",
          "created_utc": 1749559608.0
        }
      ]
    },
    {
      "id": "mx0ap4c",
      "author": "grapesodamilk",
      "body": "I wish I could do that but I gotta get up for work 😭\n\nI do enjoy wearing more comfortable clothes though like oversized hoodies and sweatpants. I like looser clothing bc it’s less triggering",
      "created_utc": 1749559787.0,
      "score": 10,
      "context": [
        {
          "id": "mx036gw",
          "author": "grapesodamilk",
          "body": "Nope so much harder because I feel the cold even worse 😬\n\nEven in summer I was layering with 3 blankets and wearing a jumper and long pants and now that it’s winter I cannot even breathe under all the layers and blankets I have to wear to bed \n\nI think I’m gonna buy an electric blanket…",
          "created_utc": 1749556985.0
        },
        {
          "id": "mx09pgh",
          "author": "Slow_Influence6453",
          "body": "See for me, I miss that. Bcus i was too cold to move even with layers, blankets, hot water bottle & a heated blanket. So I had an excuse to lay in one spot all day.",
          "created_utc": 1749559439.0
        }
      ]
    },
    {
      "id": "mx0b7ci",
      "author": "Slow_Influence6453",
      "body": "Thats fair, I’ve been signed off sick for little over a year. Not proud of it but is what it is. So I cant imagine having to go to work in the cold every day whilst having this illness. The most I did was take my son to school & anywhere else I was in the car and even then the cold was deathly. Definitely buy an electric blanket though it was one of the only ways I could sleep when it was so unbarably cold. Id have minimum 2 layers on on my body + a hot water bottle & the heated blanket. I wouldnt have survived winter without it",
      "created_utc": 1749559962.0,
      "score": 2,
      "context": [
        {
          "id": "mx036gw",
          "author": "grapesodamilk",
          "body": "Nope so much harder because I feel the cold even worse 😬\n\nEven in summer I was layering with 3 blankets and wearing a jumper and long pants and now that it’s winter I cannot even breathe under all the layers and blankets I have to wear to bed \n\nI think I’m gonna buy an electric blanket…",
          "created_utc": 1749556985.0
        },
        {
          "id": "mx09pgh",
          "author": "Slow_Influence6453",
          "body": "See for me, I miss that. Bcus i was too cold to move even with layers, blankets, hot water bottle & a heated blanket. So I had an excuse to lay in one spot all day.",
          "created_utc": 1749559439.0
        },
        {
          "id": "mx0ap4c",
          "author": "grapesodamilk",
          "body": "I wish I could do that but I gotta get up for work 😭\n\nI do enjoy wearing more comfortable clothes though like oversized hoodies and sweatpants. I like looser clothing bc it’s less triggering",
          "created_utc": 1749559787.0
        }
      ]
    }
  ]
}