{
  "id": "1ldl0u8",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1750160902.0,
  "title": "My girlfriend has an anorexia fetish and I kinda like it. I don't know what to do",
  "selftext": "I (22M) am severely uw. I’ve struggled with anorexia for years. People usually stare, make comments, and I’ve gotten used to hearing that I look like a walking corpse, I kind of am.\n\nI lost my job recently because of my health. I have Bradycardia, Hypotension, I get regular heart palpitations, my bones are aching constantly, I have a lot of hair loss and I'm at a risk of a heart attack (I've actually gotten one before, at literally 15). Couldn’t keep up with the hours, couldn’t stay on my feet. Most of the time I feel like I’m running on fumes.\n\nThree weeks ago, this woman (20F) came up to me on the street. She just smiled and said I looked “hauntingly beautiful.” We got dinner (well, she got dinner), exchanged numbers, and somehow now we’re dating. We don't do sexual stuff since I'm unable, but she seems okay with just cuddling and dates. Doesn't want anything from me.\n\nShe’s incredibly affectionate, especially physically. She touches my arms, my back, my chest constantly. She traces my bones with her fingers like she’s studying me. A few nights ago we were lying on her couch and she asked, with this really excited voice, “Can I feel your ribs while we cuddle?” I said sure, not knowing what to expect, and she lit up. Just pressed her hand over them and stayed like that for a while, smiling. She looked so happy with me. \n\nShe also started buying me cigarettes, I never asked. She said, “In case you’re feeling hungry or anxious, they’ll help take the edge off.” I didn’t have the energy to argue. The only reason I wasn't smoking was because I didn't have the cash to spend - but now she's the one buying me the stuff so it's alright. She clearly likes that I'm so thin and I love that. I don't want anyone to force me to eat. \n\nIt should weird me out more than it does. Maybe if I were in a different place, it would. But honestly? I don’t think I’m going to be around that long. And she’s the first person in a long time who looks at me with something like awe instead of pity or disgust. But at the same time I'm wondering if this is very bad for me and if I should try to recover instead. ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ldl0u8/my_girlfriend_has_an_anorexia_fetish_and_i_kinda/",
  "score": 222,
  "num_comments": 47,
  "comments": [
    {
      "id": "my8x31j",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1750160902.0,
      "score": 1,
      "context": []
    },
    {
      "id": "my903ki",
      "author": "throwawayforlemoi",
      "body": "She cares more about her own desires than about your health. It's a huge red flag. OP, please leave her, for your own sake, and get into therapy if you aren't already. This (relationship) will kill you. She will only worsen both your mental and physical health, even if you can't see it right now, even if it feels good.",
      "created_utc": 1750162129.0,
      "score": 263,
      "context": []
    },
    {
      "id": "my8xuy5",
      "author": "terraterraeterrae",
      "body": "Honestly, this is not okay. You need help and she probably does too. You need to leave if you ever want to get better tbh\nNot saying this to be mean.\nIt is just concerning",
      "created_utc": 1750161226.0,
      "score": 338,
      "context": []
    },
    {
      "id": "my8z0c3",
      "author": "thesoapbeing",
      "body": "This is just as problematic as feeders are to overweight people. This is not okay at all.",
      "created_utc": 1750161693.0,
      "score": 300,
      "context": []
    },
    {
      "id": "myadr5s",
      "author": "Itscatpicstime",
      "body": "Idk if this is real or fetish content, but in the off chance it’s real -\n\nShe’s fetishizing you. You’re an object to her, not a person. She cares more about her selfish desires than your literal life. She is literally trying ***to help you kill yourself.***\n\nWhy the hell would you want to be with someone like that?\n\nIf you have any self respect at all (or want to) or a desire to live, leave this woman. She does not care about you. \n\nPlease seek therapy and consider inpatient treatment.",
      "created_utc": 1750177548.0,
      "score": 81,
      "context": []
    },
    {
      "id": "my92tl3",
      "author": "D1s4pp10nt3D",
      "body": "she is using you as her own personal spectacle. ask yourself— even in the your darkest place— why do you feel comforted that somebody wants to help kill you? that’s not suicide. that’s not your choice. that’s facilitated, drawn out murder.",
      "created_utc": 1750163185.0,
      "score": 86,
      "context": []
    },
    {
      "id": "my90j86",
      "author": "Far_Current_5275",
      "body": "this sounds like some fanfic on wattpad",
      "created_utc": 1750162302.0,
      "score": 131,
      "context": []
    },
    {
      "id": "my95s3u",
      "author": "Infinite-Most-8356",
      "body": "what's the opposite of a feeder/feedee situation? didn't even think that could be possible given how being malnourished is stygmatized\n\nalso she is a huge red flag, a relationship should want you to be better not getting worse for her own satisfaction...",
      "created_utc": 1750164288.0,
      "score": 37,
      "context": []
    },
    {
      "id": "mydjr7b",
      "author": "BravesMaedchen",
      "body": "This is not real.",
      "created_utc": 1750212042.0,
      "score": 12,
      "context": []
    },
    {
      "id": "my94dwu",
      "author": "revolution_a",
      "body": "please leave and get better :( I faced  similar/same symptoms as you with the heart issues, hypotension etc at the age of 14-now (even tho im recovering)\nplease leave, she is not good for you and is only feeding into your ED. I know how hard it is to not want to let go, and especially to not have someone that will ‘force you to eat’ But the people or person that ‘forces you to eat’ are and will be the only people that truly love and care about you, to the point they’d stay and help your recovery. Please leave her, don’t throw yourself in a deeper hole. Life is so much better when you live it properly.",
      "created_utc": 1750163774.0,
      "score": 23,
      "context": []
    },
    {
      "id": "myardfi",
      "author": "nervous_veggie",
      "body": "That’s horrifying. You are not a tool for her twisted fantasies.",
      "created_utc": 1750181293.0,
      "score": 12,
      "context": []
    },
    {
      "id": "myb1bor",
      "author": "ginger_beck",
      "body": "this is gonna sound harsh but someone who lets you be this unhealthy doesn’t love you or care about you",
      "created_utc": 1750183992.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mycpy4g",
      "author": "walking-with-spiders",
      "body": "i understand why someone like this would be appealing, someone who won’t try to stop you or force you to eat, but when it comes down to it even if their actions arent helpful people try to get us to recover because they love us and don’t want us to die. she’s putting her sexual gratification over your health and putting your life at risk and that’s so toxic and dangerous. you deserve better than that :(",
      "created_utc": 1750201877.0,
      "score": 6,
      "context": []
    },
    {
      "id": "my9a0i2",
      "author": "IVIilitarus",
      "body": "This is like those feeder fetish relationships people make fun of.\n\nExcept with a far higher risk profile in the immediate future.\n\nIf you proceed with this person, your life will be in danger. I am not exaggerating. You need to get out of this relationship. Even if you talk her down from the worst of her dangerous fetish, you aren't dislodging her underlying views about weight and body image. Those views will inform countless daily behaviors and responses to you that will accumulate into a net detriment to your health. \n\nEven if she stops imposing an active fetish on you, she'll still think a certain weight is better on you and encourage or discourage action in a direction that is harmful to you. A person who fetishizes this illness isn't just routinely dangerous. They will not be able to fully support their partner through recovery.",
      "created_utc": 1750165777.0,
      "score": 21,
      "context": []
    },
    {
      "id": "myeqyzr",
      "author": "Visible_Major_4693",
      "body": "ik how u feel, im 20 (ana, lil bit uw) and the only man that i can link up with, are the ones that have a fetish w anorexia or skinny bodies(?). \nthere’s this feeling inside me that says “ok this is lowk weird” but at the same time i feel loved, pretty, validated and GOOD, which i usually (most of the time) dont.\nespecially when they caress me or my bones, & when they comment on my body and say things like “ur so tiny/skinny” and shit like that. i feel protected. i don’t know why. but i do.",
      "created_utc": 1750231274.0,
      "score": 5,
      "context": []
    },
    {
      "id": "myaego9",
      "author": "its_trashcannot",
      "body": "You are dying.",
      "created_utc": 1750177747.0,
      "score": 8,
      "context": []
    },
    {
      "id": "myb3zz0",
      "author": "certifiedsharkhunter",
      "body": "THIS IS NOT OKAY i’m so sorry for you!! my ex boyfriend was kind of like this",
      "created_utc": 1750184742.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mybr1al",
      "author": "Environmental-Bowl49",
      "body": "this hurts to read. your body is already dying and will continue to deteriorate in ways you can't even imagine. recovery is hard, but wrecking a functional body to have life-time complications is even harder to live with. coming from someone who did just that through my entire early 20s. none of it was worth it. it's a daily struggle to except my flesh today, but being able to actually thrive and live my life fully has been worth it and continues to be worth it. i'd get away from this person. they also need some sort of healing and it doesn't sound like either of you can help each other heal your bodies how they need to be healed.",
      "created_utc": 1750191281.0,
      "score": 4,
      "context": []
    },
    {
      "id": "myavomr",
      "author": "sasz_ko",
      "body": "I have this fetish too, but I would never risk a health of my partner for the sake of my kinks. \nI used to have a very thin boyfriend, but it was just his nature, he always was like this and his father was thin as a rail too, so it was genetics. He loved to cook and to eat tasty food, so I never ever forbade him it. I liked his bones, but if he wanted to put on weight, I wouldn't interfere. \nNow I have my husband, who was a bit overweight when we met, but he is the best person on Earth for me, so why should I damage him? If he wants to lose weight - ok, I will help him, but we will not risk his health, because I love him. \nSo think good, if that girl sees you as a human being, or just and only as the sexual object? It's a huge difference.",
      "created_utc": 1750182450.0,
      "score": 8,
      "context": []
    },
    {
      "id": "myduugw",
      "author": "strbbb",
      "body": "She likes you for your body and buys you chemicals. Please look outside the box of anorexia",
      "created_utc": 1750215894.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myi5175",
      "author": "questioning_everyt",
      "body": "Listen to me: She does not view you as a person. Whether you like it or not, this is not good for your health whatsoever. You need to leave this relationship. Please get help.",
      "created_utc": 1750274813.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myjm60d",
      "author": "AvatarNell",
      "body": "She shouldn’t be your girlfriend if she does not truly care about you - and from this she clearly does not . She cares more about satisfying her fetish than your well-being. I promise you, there is  someone who will actually love you for you, and want you to get better-wait until you find them. Don’t kill yourself for some girl.",
      "created_utc": 1750291219.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myskkiv",
      "author": "PlusInteraction142",
      "body": "First, you deserve love for being you not how you look. And I honestly feel the same way, idk why but I think it hits that sub/ praise part of my brain. And it could be anyone I think, like even when family notices and said something. I think I made the mistake of making it a fetish but it's also just another thing I wouldn't mind if someone controlled for me",
      "created_utc": 1750418587.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mywphfd",
      "author": "Glittering_Bottle846",
      "body": "if you’re happy, and she’s happy, keep going with it. Everybody has their own personal experiences and they will never quite match with anyone else. You do you. If your post is a cry for help, then go get help.",
      "created_utc": 1750465767.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mz10zxg",
      "author": "West_Ad488",
      "body": "I've been anorexic for 18 years. My husband telling me he loved me triggered it (SA victim, not worthy of love blah, blah, blah). I'm still with him, it has damaged us both and he absolutely hates it. \n\nNow I'm a lifelong recovering anorexic, I try to keep my BMI at around 16.5, which is acceptable enough for him to not feel disgusted by me and for me to not feel obese. He wishes I was about 15kg heavier, which I was when we met but he gets that I'll never be comfortable with that. \n\nIf he'd have liked the illness, I wouldn't be here. I nearly wasn't at a couple of points.\n\nGet rid of this girl. She'll speed up your death.",
      "created_utc": 1750531417.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myars6i",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1750181400.0,
      "score": 4,
      "context": []
    },
    {
      "id": "myde3z3",
      "author": "Pretty_Salary_741",
      "body": "I’m sorry this is just weird af, she is basically helping you die.",
      "created_utc": 1750210114.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myfkiic",
      "author": "Ali_Nott",
      "body": "It might be hard but you need to try everything you can to get out of that relationship. It isn't safe for you, at all. Please, try your best to get out. I've struggled before with this stuff, and while I still struggle with food some times, eating feels so much better. Eating healthy, junk food when you want it and not counting. Please, you need to at least try. I know it's hard, i would advise therapy, but if you don't have a lot of money, that might not be the easiest option. Just please. I know I'm a random internet stranger, but I don't want you to get worse, please try and eat. ",
      "created_utc": 1750247124.0,
      "score": 1,
      "context": []
    },
    {
      "id": "myv5sdy",
      "author": "Internal_Section1398",
      "body": "She fancies morbidity. Run away as fast as you can.",
      "created_utc": 1750447636.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0ngmzc",
      "author": "Original_Reason1934",
      "body": "Oh God. I think you may be blinded by love. She's using you for her own desires, a person who would actually care about you would encourage you to eat, not not to eat. This is seriously not OK, and for your own sake, I think you should consider leaving her.",
      "created_utc": 1751319392.0,
      "score": 1,
      "context": []
    },
    {
      "id": "my91ejy",
      "author": "FriedLipstick",
      "body": "It’s a deadly relationship",
      "created_utc": 1750162641.0,
      "score": 106,
      "context": [
        {
          "id": "my8z0c3",
          "author": "thesoapbeing",
          "body": "This is just as problematic as feeders are to overweight people. This is not okay at all.",
          "created_utc": 1750161693.0
        }
      ]
    },
    {
      "id": "myskrti",
      "author": "PlusInteraction142",
      "body": "Yeah, it's basically the same but reversed",
      "created_utc": 1750418677.0,
      "score": 7,
      "context": [
        {
          "id": "my8z0c3",
          "author": "thesoapbeing",
          "body": "This is just as problematic as feeders are to overweight people. This is not okay at all.",
          "created_utc": 1750161693.0
        }
      ]
    },
    {
      "id": "myckt34",
      "author": "sad_handjob",
      "body": "It’s objectively worse",
      "created_utc": 1750200213.0,
      "score": 20,
      "context": [
        {
          "id": "my8z0c3",
          "author": "thesoapbeing",
          "body": "This is just as problematic as feeders are to overweight people. This is not okay at all.",
          "created_utc": 1750161693.0
        }
      ]
    },
    {
      "id": "mycrss0",
      "author": "Clireland",
      "body": "Glad somebody said it. Mods should remove it because it’s sketchy af.",
      "created_utc": 1750202482.0,
      "score": 29,
      "context": [
        {
          "id": "my90j86",
          "author": "Far_Current_5275",
          "body": "this sounds like some fanfic on wattpad",
          "created_utc": 1750162302.0
        }
      ]
    },
    {
      "id": "my9jpsn",
      "author": "bluemachinist",
      "body": "yeah LMAOOO this is not real",
      "created_utc": 1750168944.0,
      "score": 43,
      "context": [
        {
          "id": "my90j86",
          "author": "Far_Current_5275",
          "body": "this sounds like some fanfic on wattpad",
          "created_utc": 1750162302.0
        }
      ]
    },
    {
      "id": "myc9re1",
      "author": "strawberry-bunny",
      "body": "10000% lol. No shot this is real and it’s pathetic that someone would post fetish content to this subreddit to actual people struggling w the disorder..",
      "created_utc": 1750196711.0,
      "score": 19,
      "context": [
        {
          "id": "my90j86",
          "author": "Far_Current_5275",
          "body": "this sounds like some fanfic on wattpad",
          "created_utc": 1750162302.0
        }
      ]
    },
    {
      "id": "my9khho",
      "author": "duckfruits",
      "body": "A starver. Lots of them are pedos too. :(",
      "created_utc": 1750169179.0,
      "score": 38,
      "context": [
        {
          "id": "my95s3u",
          "author": "Infinite-Most-8356",
          "body": "what's the opposite of a feeder/feedee situation? didn't even think that could be possible given how being malnourished is stygmatized\n\nalso she is a huge red flag, a relationship should want you to be better not getting worse for her own satisfaction...",
          "created_utc": 1750164288.0
        }
      ]
    },
    {
      "id": "mydtu4g",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1750215525.0,
      "score": 0,
      "context": [
        {
          "id": "myars6i",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1750181400.0
        }
      ]
    },
    {
      "id": "myypwll",
      "author": "chainsawroulette",
      "body": "Not really. Both worsen health significantly and can kill because they encourage unhealthy eating habits. I don’t think it’s very just to compare don’t you think?",
      "created_utc": 1750500974.0,
      "score": 5,
      "context": [
        {
          "id": "my8z0c3",
          "author": "thesoapbeing",
          "body": "This is just as problematic as feeders are to overweight people. This is not okay at all.",
          "created_utc": 1750161693.0
        },
        {
          "id": "myckt34",
          "author": "sad_handjob",
          "body": "It’s objectively worse",
          "created_utc": 1750200213.0
        }
      ]
    },
    {
      "id": "myy5plt",
      "author": "Successful-Lock8595",
      "body": "how do you know it’s not real? op might be genuinely reaching out for help, i dont understand why it wouldnt be real. people like that exist the same way feeders exist",
      "created_utc": 1750488620.0,
      "score": 4,
      "context": [
        {
          "id": "my90j86",
          "author": "Far_Current_5275",
          "body": "this sounds like some fanfic on wattpad",
          "created_utc": 1750162302.0
        },
        {
          "id": "myc9re1",
          "author": "strawberry-bunny",
          "body": "10000% lol. No shot this is real and it’s pathetic that someone would post fetish content to this subreddit to actual people struggling w the disorder..",
          "created_utc": 1750196711.0
        }
      ]
    },
    {
      "id": "my9qhk1",
      "author": "Infinite-Most-8356",
      "body": "disgusting",
      "created_utc": 1750170963.0,
      "score": 15,
      "context": [
        {
          "id": "my95s3u",
          "author": "Infinite-Most-8356",
          "body": "what's the opposite of a feeder/feedee situation? didn't even think that could be possible given how being malnourished is stygmatized\n\nalso she is a huge red flag, a relationship should want you to be better not getting worse for her own satisfaction...",
          "created_utc": 1750164288.0
        },
        {
          "id": "my9khho",
          "author": "duckfruits",
          "body": "A starver. Lots of them are pedos too. :(",
          "created_utc": 1750169179.0
        }
      ]
    },
    {
      "id": "n1cg5o1",
      "author": "SquigSnuggler",
      "body": "I think that Anorexia is worse. It’s far more easily hidden and there is a different shame attached.\n\nAnorexia kills much faster and is harder to treat- remember, you can get weight loss surgery, but you can’t get weight gain surgery\n\nI am editing this to add a few things because after I posted this I did a quick bit of research: turns out that obesity *does* account for greater mortality and morbidity than anorexia, although anorexia is under reported- at least for many parts of the world. It can arguably be hidden for longer. \n\nObesity has a strong genetic link as well so is perhaps more likely in certain families. There is more research needed in this area regarding anorexia. \n\nObesity is not considered a MH condition, at least not in and of itself. With anorexia and other ED’s associated with weight loss, there is also a psychiatric element that requires treating. Whilst there are often co morbidities associated with obesity, it is not itself a MH disorder and therefore doesn’t always require the same multi-pronged approach.\n\nSorry if I rambled a little there- also I know this is an old thread",
      "created_utc": 1751652466.0,
      "score": 2,
      "context": [
        {
          "id": "my8z0c3",
          "author": "thesoapbeing",
          "body": "This is just as problematic as feeders are to overweight people. This is not okay at all.",
          "created_utc": 1750161693.0
        },
        {
          "id": "myckt34",
          "author": "sad_handjob",
          "body": "It’s objectively worse",
          "created_utc": 1750200213.0
        },
        {
          "id": "myypwll",
          "author": "chainsawroulette",
          "body": "Not really. Both worsen health significantly and can kill because they encourage unhealthy eating habits. I don’t think it’s very just to compare don’t you think?",
          "created_utc": 1750500974.0
        }
      ]
    },
    {
      "id": "mz0hz0f",
      "author": "sad_handjob",
      "body": "anorexia is significantly more deadly",
      "created_utc": 1750525436.0,
      "score": 2,
      "context": [
        {
          "id": "my8z0c3",
          "author": "thesoapbeing",
          "body": "This is just as problematic as feeders are to overweight people. This is not okay at all.",
          "created_utc": 1750161693.0
        },
        {
          "id": "myckt34",
          "author": "sad_handjob",
          "body": "It’s objectively worse",
          "created_utc": 1750200213.0
        },
        {
          "id": "myypwll",
          "author": "chainsawroulette",
          "body": "Not really. Both worsen health significantly and can kill because they encourage unhealthy eating habits. I don’t think it’s very just to compare don’t you think?",
          "created_utc": 1750500974.0
        }
      ]
    },
    {
      "id": "mz45jvs",
      "author": "kawaiiqueen21",
      "body": "No like literally. It doesn't remotely scream fake to me esp since my ex was also an anorexia fetishist, so the behavior OP described is insanely realistic. Like if it's fake that's ew obvi but if real like it seems to be then calling it fake could easily make OP dismiss what's going on",
      "created_utc": 1750575363.0,
      "score": 4,
      "context": [
        {
          "id": "my90j86",
          "author": "Far_Current_5275",
          "body": "this sounds like some fanfic on wattpad",
          "created_utc": 1750162302.0
        },
        {
          "id": "myc9re1",
          "author": "strawberry-bunny",
          "body": "10000% lol. No shot this is real and it’s pathetic that someone would post fetish content to this subreddit to actual people struggling w the disorder..",
          "created_utc": 1750196711.0
        },
        {
          "id": "myy5plt",
          "author": "Successful-Lock8595",
          "body": "how do you know it’s not real? op might be genuinely reaching out for help, i dont understand why it wouldnt be real. people like that exist the same way feeders exist",
          "created_utc": 1750488620.0
        }
      ]
    }
  ]
}