{
  "id": "1le36gv",
  "subreddit": "AnorexiaNervosa",
  "author": "uh_hi_its_moi",
  "created_utc": 1750205590.0,
  "title": "Am I wrong for this?",
  "selftext": "She isn’t aware I have an ed and I felt embarrassed even making this suggestion and her reply just made me feel worse. Was I being to rude since she doesn’t even know? I am not sure what I should label this so sorry if this was wrong.",
  "url": "https://i.redd.it/vum8qgxsvk7f1.jpeg",
  "score": 278,
  "num_comments": 43,
  "comments": [
    {
      "id": "myd1077",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1750205592.0,
      "score": 1,
      "context": []
    },
    {
      "id": "myd88nw",
      "author": "ConfidentStrength999",
      "body": "Honestly, I think what you said is fine. You were firm but kind and I don't personally think it comes across as harsh, just assertive",
      "created_utc": 1750208117.0,
      "score": 150,
      "context": []
    },
    {
      "id": "mydz27s",
      "author": "purpleunicorn5",
      "body": "I can't lie, I think it was weird of your friend to say that regardless, who replies to an offer of fast food like that? So specific for no reason, a simple \"nah, I'd rather ____\" or \"I'm not really in the mood for fast food\" would have sufficed",
      "created_utc": 1750217534.0,
      "score": 108,
      "context": []
    },
    {
      "id": "myd8w1n",
      "author": "Outrageous-Art6029",
      "body": "I don’t think it’s wrong. Whether this person knows you have an ED or not, eating fast food once does not make you unhealthy & will not make you gain weight",
      "created_utc": 1750208337.0,
      "score": 137,
      "context": []
    },
    {
      "id": "mydau9g",
      "author": "Turbulent-Ability271",
      "body": "It's not harsh. You've set a firm boundary around what you're comfortable discussing. If your friend is upset about it, they can communicate this and you can talk about it. People shouldn't be saying this to others regardless of whether they have an ED or not.",
      "created_utc": 1750208997.0,
      "score": 50,
      "context": []
    },
    {
      "id": "mye05sg",
      "author": "One-Exit-9390",
      "body": "i think you were kind, i wouldve screamed in caps lock instead.",
      "created_utc": 1750217980.0,
      "score": 14,
      "context": []
    },
    {
      "id": "myd4x8x",
      "author": "jun3_bugz",
      "body": "torn between a bit harsh but also you’re entirely right! even if she doesn’t know, it’s a weird thing to say to a friend suggesting something. If she didn’t want to she could have said I’d rather not :) Let’s all stop normalising saying weird shit about food to our friends ",
      "created_utc": 1750206967.0,
      "score": 53,
      "context": []
    },
    {
      "id": "mydr7r9",
      "author": "Alternative-Being-90",
      "body": "No, you were not being rude. You were being stern but polite. In all honesty, she was in the wrong. You shouldn’t mention that to anyone regardless of if you know or don’t know. If she wasn’t interested in fast food, she should’ve politely declined rather than saying that. But that’s just my opinion.",
      "created_utc": 1750214600.0,
      "score": 15,
      "context": []
    },
    {
      "id": "myfr5ss",
      "author": "yyizzyz",
      "body": "that’s such a weird thing for her to say?? 💀 awareness of ur ed or not who even says that",
      "created_utc": 1750249687.0,
      "score": 6,
      "context": []
    },
    {
      "id": "myd7212",
      "author": "Horror-Dragonfly-266",
      "body": "Honestly I don’t think it’s terribly harsh. To me it just seems more confusing as she doesn’t know about your ED.",
      "created_utc": 1750207707.0,
      "score": 12,
      "context": []
    },
    {
      "id": "myeoqpt",
      "author": "ultrazxr_ouo",
      "body": "i think it might be worth letting her know if she could stop making comments/discussions about weight gain/unhealthy foods going forward. disclose your ED if you feel comfortable but i think that request can be made regardless. a good friend will listen and stop.",
      "created_utc": 1750229993.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mym8y1z",
      "author": "grapesodamilk",
      "body": "Their response is so annoying I would YELL",
      "created_utc": 1750334618.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mzcotws",
      "author": "NeatSolid1183",
      "body": "Personally I would not want to be friends with someone like this, even if I did not have an ED! Your response is valid and mature.",
      "created_utc": 1750695504.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mye74w1",
      "author": "DawnHime",
      "body": "Its not harsh her response was weird",
      "created_utc": 1750220973.0,
      "score": 8,
      "context": []
    },
    {
      "id": "myfzoih",
      "author": "glazingmule",
      "body": "you responded great. you were firm and set your boundaries. it’s the kind of rhetoric that perpetuates ed’s in our society and it needs to stop",
      "created_utc": 1750252659.0,
      "score": 3,
      "context": []
    },
    {
      "id": "myrm39y",
      "author": "Strawberry_baby225",
      "body": "No, because who that is weird to say regardless.",
      "created_utc": 1750399613.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mydubpb",
      "author": "strbbb",
      "body": "Is that it? No, not harsh from that comment.",
      "created_utc": 1750215701.0,
      "score": 7,
      "context": []
    },
    {
      "id": "myd2swu",
      "author": "Equivalent_Bid_5678",
      "body": "It is a little bit of a harsh response because she seems to not know why you would not need to hear that. I get where you’re coming from and it’s hard with how normalized people who don’t struggle with an ed still struggle with the concept of eating “bad” foods. Don’t be too hard on yourself for your response though and maybe consider opening up if you feel comfortable enough to do so so that your friends can understand you a little bit better",
      "created_utc": 1750206221.0,
      "score": 12,
      "context": []
    },
    {
      "id": "myg5lhh",
      "author": "Extension_Visit4654",
      "body": "From what i've heard this is pretty normal for non ED people so your response is the best you can do to let them know you don't like to hear such things. What they said isn't wrong but it really hurts to hear so i feel your pain.",
      "created_utc": 1750254583.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mygva7w",
      "author": "sewcrazy4cats",
      "body": "Everything in moderation. My ED history isn't the classic definition of anorexia, more binge/restrict than total avoiding although periods of prolonged fasting after a binge was also a thing. So, fast food was very much a trigger to the point my heart got so bad I was allowed to miss at least 1 day of work a month to go to the ER. I was only 29. So getting to a mindset that broke the binge/restrict cycle and adopt a more morally neutral look towards nutrition, my body and sense of self is a lot. I am now 40 with a much more stable cardiovascular system. I can enjoy candy or treats  from time to time without worrying if I will go into a spiral or the hospital. \n\nDuring my time when I was working to stabilize my BMI and heart health my mom wasn't sure if I would want a birthday cake for my birthday. I said of course I would. It's a celebration and just part of making all foods normal. It's part of life. The more banal you can make something, the more likely you will succeed in that outcome.",
      "created_utc": 1750261981.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myh1tx5",
      "author": "HotDerivative",
      "body": "It’s not mean. You and your friend text like you’re very young. She sounds like she’s just parroting things she’s heard because why even say all that.",
      "created_utc": 1750263830.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myh7hen",
      "author": "bunkr33p",
      "body": "you’re not wrong. if SHE is worried about those things, okay whatever she’s allowed that right. that doesn’t mean she gets to push it onto you.",
      "created_utc": 1750265437.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myi9acz",
      "author": "Unusual_Breath_2397",
      "body": "I dont think so because regardless of whether u had an ed or not \nNo one needs to hear that",
      "created_utc": 1750276046.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myista6",
      "author": "Eclipse_106",
      "body": "No that was such a weird way for her to respond",
      "created_utc": 1750281744.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myjio8t",
      "author": "This-Situation",
      "body": "Sounds like Kayla may struggle with some food thoughts too. It’s obviously not my place to say for certain, and I’m not her!! But I do find I tend to say things like this to “bully food” or the idea of eating. \n\nI think what you said is perfectly appropriate, even if she isn’t aware of your personal feelings towards food! And to top it off… a burger won’t make or break any of us. It’s totally okay to eat out every so often, Kayla!",
      "created_utc": 1750290048.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myjrvam",
      "author": "BeansandBrewsof",
      "body": "I think you’re good, it was weird to just blurt, but you where assertive, and respectful",
      "created_utc": 1750293223.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mym2hlw",
      "author": "walking-with-spiders",
      "body": "you did nothing wrong, that’s such an unnecessary and weird reply on their part. eating fast food one time is not going have any noticeable effect on your health at all and that’s just such a rude and negative way to respond to a friend asking if they want to spend time together, theres no need to say this and come off like they’re trying to shame you for wanting to get fast food when they could have just said “i’d rather (blank) if that’s cool, i’m not really in the mood for fast food” or something.",
      "created_utc": 1750331851.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0nfgoi",
      "author": "Original_Reason1934",
      "body": "What you said was valid. Even if you didn't have an ED, it is a completely reasonable response. I think your friend is in the wrong for even saying that.",
      "created_utc": 1751319037.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n1l1gwv",
      "author": "allurinaaa",
      "body": "there was no need for your friend to say that, she could've politely declined without putting both of you down. you weren't being rude, you were being firm and polite setting your boundaries.",
      "created_utc": 1751776104.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n21epd6",
      "author": "purplen1ghtsky",
      "body": "no thats weird..",
      "created_utc": 1752002017.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myd48fk",
      "author": "Little_Treacle241",
      "body": "A bit harsh she doesn’t know u have an ed love ❤️",
      "created_utc": 1750206725.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myes8dt",
      "author": "OneFootDown",
      "body": "Idk, her saying “gain weight” is just a wrong move. Knowing if you have an ED or not, we are women/people in a society that slams us for this, all day every day. I’m quick to call people sensitive, but I don’t think you were. In society in general, it was just a bad move to say on her part, period, in my opinion.",
      "created_utc": 1750232022.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mydplm2",
      "author": "kenscrack",
      "body": "in hindsight no, but it may be a little harsh on her as she doesn’t know why you’re responding the way you’re responding.",
      "created_utc": 1750214055.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mydddek",
      "author": "Altruistic_Wind2004",
      "body": "I ended friendship because she won't stop talking like you it's way effecting than you think ",
      "created_utc": 1750209862.0,
      "score": 0,
      "context": []
    },
    {
      "id": "myl419f",
      "author": "Flames_are_flowers",
      "body": "She might have an ED too if she responded with that. I don’t think you’re wrong for that but seems like she’s not wanting to do fast food and that’s okay there’s other options. It’s just a boundary she has. She also could just be having a lot of food noise that day too\n\nIt’s good that you’re aware of yourself but you also have to be aware of others. I wouldn’t think so much of it. If it was recent or if you’re open to that discussion you can ask if she’s trying to have healthier eating  options moving forward.",
      "created_utc": 1750312744.0,
      "score": 1,
      "context": []
    },
    {
      "id": "myer3u7",
      "author": "currycatarina",
      "body": "That's a weird thing to say on your friend's part. Not a big fan of fast food myself but I normally just go \"I'd rather eat real food\". You're not harsh at all, cuz that was uncalled for",
      "created_utc": 1750231352.0,
      "score": 0,
      "context": []
    },
    {
      "id": "myfp5d6",
      "author": "strbbb",
      "body": "This kind of sounds like normal teenager talk/friend talk, though, if she's young and preppy 😂😂I think someone who doesn't have an eating disorder wouldve said something like \"girllll get the salad then\" and rolled eyes. She's just comfortable enough with you to project her inner demons too. Id recommend telling her, \"hey, I didn't mean to be rude earlier, I actually just have an/used to struggle with eating disorder and trying to stay recovery focused\". \n\nUnfortunately comments like this never leave, so do yourself a favor and get used to them. Shes probably a girl too and also has her insecurities. Many people, if you are close to them, feel comfortable enough saying it. Rationalize in your head. Now when someone says \"wow, you were hungry! That's a lot of food\" I usually agree with them 😂😂 because, yeah! I was hungry 😂 put the trigger guards down a bit and laugh a little.",
      "created_utc": 1750248938.0,
      "score": -3,
      "context": []
    },
    {
      "id": "mye3ava",
      "author": "uh_hi_its_moi",
      "body": "No she said sorry right away but I still felt bad about it. And Yeah that’s what threw me off the most, no matter my health I wouldn’t think to say this to anyone.",
      "created_utc": 1750219290.0,
      "score": 20,
      "context": [
        {
          "id": "mydau9g",
          "author": "Turbulent-Ability271",
          "body": "It's not harsh. You've set a firm boundary around what you're comfortable discussing. If your friend is upset about it, they can communicate this and you can talk about it. People shouldn't be saying this to others regardless of whether they have an ED or not.",
          "created_utc": 1750208997.0
        }
      ]
    },
    {
      "id": "mydkxsq",
      "author": "uh_hi_its_moi",
      "body": "This. I understand it was kinda mean of me but I would never think to say this !!",
      "created_utc": 1750212447.0,
      "score": 16,
      "context": [
        {
          "id": "myd4x8x",
          "author": "jun3_bugz",
          "body": "torn between a bit harsh but also you’re entirely right! even if she doesn’t know, it’s a weird thing to say to a friend suggesting something. If she didn’t want to she could have said I’d rather not :) Let’s all stop normalising saying weird shit about food to our friends ",
          "created_utc": 1750206967.0
        }
      ]
    },
    {
      "id": "mz2233m",
      "author": "blue_moonflower",
      "body": "what they said actually is wrong. they're not gonna gain loads of weight, become unhealthy, and break out from eating fast food once, that's ridiculous.",
      "created_utc": 1750543837.0,
      "score": 2,
      "context": [
        {
          "id": "myg5lhh",
          "author": "Extension_Visit4654",
          "body": "From what i've heard this is pretty normal for non ED people so your response is the best you can do to let them know you don't like to hear such things. What they said isn't wrong but it really hurts to hear so i feel your pain.",
          "created_utc": 1750254583.0
        }
      ]
    },
    {
      "id": "myf9mdd",
      "author": "Outrageous-Art6029",
      "body": "Fast food is real food",
      "created_utc": 1750242154.0,
      "score": 3,
      "context": [
        {
          "id": "myer3u7",
          "author": "currycatarina",
          "body": "That's a weird thing to say on your friend's part. Not a big fan of fast food myself but I normally just go \"I'd rather eat real food\". You're not harsh at all, cuz that was uncalled for",
          "created_utc": 1750231352.0
        }
      ]
    },
    {
      "id": "myeks9v",
      "author": "Turbulent-Ability271",
      "body": "Sometimes, being firm is really hard when you're not used to putting your needs first. If you do feel you were too harsh, that's okay. It happens sometimes. Personally, I think you did really well here.",
      "created_utc": 1750227802.0,
      "score": 13,
      "context": [
        {
          "id": "mydau9g",
          "author": "Turbulent-Ability271",
          "body": "It's not harsh. You've set a firm boundary around what you're comfortable discussing. If your friend is upset about it, they can communicate this and you can talk about it. People shouldn't be saying this to others regardless of whether they have an ED or not.",
          "created_utc": 1750208997.0
        },
        {
          "id": "mye3ava",
          "author": "uh_hi_its_moi",
          "body": "No she said sorry right away but I still felt bad about it. And Yeah that’s what threw me off the most, no matter my health I wouldn’t think to say this to anyone.",
          "created_utc": 1750219290.0
        }
      ]
    },
    {
      "id": "mye07da",
      "author": "BrowncoatIona",
      "body": "Personally I don't think it's harsh or mean. It's very direct, yes. But I think a lot of relationships would be improved by people being more direct about boundaries like this. \n\nAnd yeah, people also don't need to have a history of EDs to be uncomfortable with negative comments about food like this.",
      "created_utc": 1750217997.0,
      "score": 19,
      "context": [
        {
          "id": "myd4x8x",
          "author": "jun3_bugz",
          "body": "torn between a bit harsh but also you’re entirely right! even if she doesn’t know, it’s a weird thing to say to a friend suggesting something. If she didn’t want to she could have said I’d rather not :) Let’s all stop normalising saying weird shit about food to our friends ",
          "created_utc": 1750206967.0
        },
        {
          "id": "mydkxsq",
          "author": "uh_hi_its_moi",
          "body": "This. I understand it was kinda mean of me but I would never think to say this !!",
          "created_utc": 1750212447.0
        }
      ]
    }
  ]
}