{
  "id": "1lk5e5s",
  "subreddit": "AnorexiaNervosa",
  "author": "Beautiful_Sort_3267",
  "created_utc": 1750857356.0,
  "title": "I think my wife is anorexic",
  "selftext": "I’m not sure if this is the appropriate forum, I apologize if not.\n\nI’m 40 and my wife is 39. We’ve been together since 2013 and married since 2018.\n\nShe’s always been small, but it seems to have progressed recently. Multiple friends have expressed concerns about her well-being and it’s made me more observant of her behaviors and increasingly concerned.\n\nHer mother just tells her she’s “too skinny” and “needs to gain weight” which obviously isn’t helpful. \n\nFor those of you who are in recovery/got into treatment, how did family members/friends approach the topic with you initially?\n\nThanks and Love \n\n",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1lk5e5s/i_think_my_wife_is_anorexic/",
  "score": 129,
  "num_comments": 18,
  "comments": [
    {
      "id": "mzoxidm",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1750857356.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzp87np",
      "author": "unfamiliarplaces",
      "body": "a letter might help. but she will push back and insist that she’s fine, youll have to be careful to frame it in a very non accusatory way and focus on your own feelings and how its harming your mental health. if you just say ‘you have a problem’ she’s not going to really hear what you mean.",
      "created_utc": 1750860747.0,
      "score": 75,
      "context": []
    },
    {
      "id": "mzp958p",
      "author": "MelodicFriendship262",
      "body": "Seems worrisome ngl, but there’s no real way to know unless you ask her, and even then people with Ed’s can lie/downplay the situation. I’d be very careful to not say anything about her body, bad or good. I think it’s a big misconception that’s it’s all about the physical looks when ed’s often come from a need for control. I’d maybe even suggest getting just 1 session with a therapist to help guide you on how you should talk to her if you can. It’s such a sensitive situation if she does have an ed and I wouldn’t want you to cause problems in your relationship because of something you said, since ed’s can really change your thinking pattern/how you interpret something. Ex: every time I lose weight and I get a compliment all I hear is that I was ugly before and now I’m more worthy in the literal sense that someone wanted to compliment me. It reinforces that being smaller is better than being bigger each time",
      "created_utc": 1750861019.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mzoyzoz",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1750857849.0,
      "score": 52,
      "context": []
    },
    {
      "id": "mzp4hek",
      "author": "InnocentaMN",
      "body": "If you offer her favourite food, does she accept it? Do you see her eat? \n\nAnorexia is definitely an issue in people of all ages, despite being associated mostly with younger women and teens. As the other commenter said, though, there can be other reasons for low appetite / reduced eating. Do you think she would be open to discussing it with you?\n\n(I’m speaking as a woman in my thirties, currently in recovery from anorexia.)",
      "created_utc": 1750859629.0,
      "score": 12,
      "context": []
    },
    {
      "id": "n0w0sd0",
      "author": "celeste173",
      "body": "my mom has always been skinny. I remember i eventually told her i was worried about her and asked her if she could go to the doctor for a checkup. you’re supposed to do that now and then anyway. i never followed up about whether she had been told she was underweight or not, mostly because i didnt think i needed to know. But shes finally in therapy!! yaay!!",
      "created_utc": 1751431105.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n29jm8t",
      "author": "Old-Piccolo3986",
      "body": "Yes there is cause for concern and consistent with anorexia but at the same time:\n- Not all weight loss is food related, there could be something underlying \n- Not all eating disorders are anorexia.\n\nPlease try not to validate comments like\n\"I look so fat in this\"\n\"My thighs are so big\"\n\"Do you think I need to lose weight?\" \n\"I think I'm getting thinner, what do you think?\"\nThese are all comments made by the eating disorder seeking comfort and motivation to carry on self destructing.\n\nHere are just a few of the other possibilities and how to spot them coming from someone who has been through a lot of them.\n\nAnorexia:\n- The person restricts food.\n- The person avoids social interactions involving food\n- The person feels ill after eating a square meal\n- The person feels cold\n- The person feels dizzy/passes out often\n- The person might (NOT DEFINITELY) lose weight.\n\nBulimia:\n- The person may not avoid meals\n- The person disappears to the toilet after eating\n- The person stores laxatives/diuretics and takes them.\n( Bulimia does not mean just being sick after a meal, its carrying out an activity that compensates for the calories consumed. E.g. Purging, taking laxatives, over-exercising etc...)\n\nBinge Eating Disorder:\n- The person hides food\n- The person eats this food and purges it\n- The person eats food in secret \n(Binge Eating Disorder often goes hand in hand with bulimia)\n\nARFID (Avoidant Restrictive Food Intake Disorder):\n- The person avoids foods that aren't deemed as safe\n- The person seeks the same taste and texture in every bite\n- Often associated with Autism.\n- The person can be seriously underweight due to lack of nutrition.\n\nOrthorexia:\n- Focused entirely on health.\n- The same amount of exercise as calories\n- Only eating \"healthy\" food like fruit and veg\n- Stating that a certain food/food group is \"too unhealthy\" \n\nPlease offer comfort to your wife! Best of luck getting help, start with your GP and go from there. <3",
      "created_utc": 1752101590.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzpb8x3",
      "author": "Beautiful_Sort_3267",
      "body": "Thank you for that advice. It makes a lot of sense.",
      "created_utc": 1750861628.0,
      "score": 20,
      "context": [
        {
          "id": "mzp87np",
          "author": "unfamiliarplaces",
          "body": "a letter might help. but she will push back and insist that she’s fine, youll have to be careful to frame it in a very non accusatory way and focus on your own feelings and how its harming your mental health. if you just say ‘you have a problem’ she’s not going to really hear what you mean.",
          "created_utc": 1750860747.0
        }
      ]
    },
    {
      "id": "mzpanv8",
      "author": "Beautiful_Sort_3267",
      "body": "Thank you for the advice.\n\nI’ve been talking to my own therapist about the situation and she’s given me advice on how to approach the conversation. I just keep putting it off for fear of saying the wrong thing and upsetting her and creating more issues.",
      "created_utc": 1750861458.0,
      "score": 12,
      "context": [
        {
          "id": "mzp958p",
          "author": "MelodicFriendship262",
          "body": "Seems worrisome ngl, but there’s no real way to know unless you ask her, and even then people with Ed’s can lie/downplay the situation. I’d be very careful to not say anything about her body, bad or good. I think it’s a big misconception that’s it’s all about the physical looks when ed’s often come from a need for control. I’d maybe even suggest getting just 1 session with a therapist to help guide you on how you should talk to her if you can. It’s such a sensitive situation if she does have an ed and I wouldn’t want you to cause problems in your relationship because of something you said, since ed’s can really change your thinking pattern/how you interpret something. Ex: every time I lose weight and I get a compliment all I hear is that I was ugly before and now I’m more worthy in the literal sense that someone wanted to compliment me. It reinforces that being smaller is better than being bigger each time",
          "created_utc": 1750861019.0
        }
      ]
    },
    {
      "id": "mzp4v8j",
      "author": "Beautiful_Sort_3267",
      "body": "Thank you for the reply.\n\nShe deals with depression, though she generally doesn’t speak about it. She has a pretty bad/unhealthy relationship with her mom, which I think is the source of some of the things she struggles with. \n\nShe has tried therapy in the past but will go to a session or two and quit. \n\nHer weight loss just seems to have accelerated lately to the point where she looks unhealthy as opposed to small. I think she’s losing hair and recently started using Rogaine and other hair supplements to compensate. I’m just scared for lack of a better term.",
      "created_utc": 1750859746.0,
      "score": 33,
      "context": [
        {
          "id": "mzoyzoz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750857849.0
        }
      ]
    },
    {
      "id": "mzp72x7",
      "author": "Beautiful_Sort_3267",
      "body": "Thank you for the reply. \n\nShe eats, but it’s never much. When we go out to eat she will take a bite or two and then just mushes her food around and covers her plate with a napkin. \n\nIt’s not uncommon for waiters to ask her if something is wrong with the food/everything came out okay. \n\nAt home, she will have a few bites of dinner but I don’t think she eats much at all, if anything, during the work day. \n\nI get the sense that if I bring it up, she will just say she’s fine and doesn’t have an issue. \n\nI was thinking about writing a letter to read to her but haven’t yet.",
      "created_utc": 1750860417.0,
      "score": 20,
      "context": [
        {
          "id": "mzp4hek",
          "author": "InnocentaMN",
          "body": "If you offer her favourite food, does she accept it? Do you see her eat? \n\nAnorexia is definitely an issue in people of all ages, despite being associated mostly with younger women and teens. As the other commenter said, though, there can be other reasons for low appetite / reduced eating. Do you think she would be open to discussing it with you?\n\n(I’m speaking as a woman in my thirties, currently in recovery from anorexia.)",
          "created_utc": 1750859629.0
        }
      ]
    },
    {
      "id": "mzpc8sr",
      "author": "MelodicFriendship262",
      "body": "Idk your relationship, you seem like a good husband. You guys have been together for a long time, but if I were you I might just try to look at her phone to get an inclination. Many people don’t do this because of privacy etc, and some people with eds don’t even look up stuff online. But I’d assume if you looked at search history you might see things along the lines of: bmi/bmr calculator, calories, exercises etc. a little is nothing to be worried about but if it’s each thing then I’d say it could be a red flag. You may also want to check camera roll for body checks. I know this isn’t favored by a lot of people, but if you have an open phone policy then you could pretend as if you stumbled across it. Sorry I know this isn’t a very “healthy” way to go about it, but it could give you an idea of where her head space is at. \n\nObviously this is hard for me to not be biased, I’m not diagnosed or anything but I’ve struggled since I was a kid. The comment about her and her mom having a bad relationship could be connected to the restriction, but her mother saying she’s too thin could be a sign that she doesn’t want her daughter doing it, or could be a sign of competition between them. My mom does this all of the time. You’re too fat, then you’re too thin. Text book. \n\nAlso, I’d just like to say that maybe it isn’t anorexia. Maybe she’s on a medicine that has already taken her small frame and made her underweight. Maybe the only eating a few bites here and there is ARFID (picky eating but to the point of not being able to stomach it, swallow it, chew it, mainly because of textures). Maybe she doesn’t like to eat in front of others or has social anxiety at restaurants. There could be many innocent explanations, but my gut says some type of ED considering the mushing of food and rapid weight loss. \n\nGood luck to you and your wife my friend.",
      "created_utc": 1750861919.0,
      "score": 0,
      "context": [
        {
          "id": "mzp958p",
          "author": "MelodicFriendship262",
          "body": "Seems worrisome ngl, but there’s no real way to know unless you ask her, and even then people with Ed’s can lie/downplay the situation. I’d be very careful to not say anything about her body, bad or good. I think it’s a big misconception that’s it’s all about the physical looks when ed’s often come from a need for control. I’d maybe even suggest getting just 1 session with a therapist to help guide you on how you should talk to her if you can. It’s such a sensitive situation if she does have an ed and I wouldn’t want you to cause problems in your relationship because of something you said, since ed’s can really change your thinking pattern/how you interpret something. Ex: every time I lose weight and I get a compliment all I hear is that I was ugly before and now I’m more worthy in the literal sense that someone wanted to compliment me. It reinforces that being smaller is better than being bigger each time",
          "created_utc": 1750861019.0
        },
        {
          "id": "mzpanv8",
          "author": "Beautiful_Sort_3267",
          "body": "Thank you for the advice.\n\nI’ve been talking to my own therapist about the situation and she’s given me advice on how to approach the conversation. I just keep putting it off for fear of saying the wrong thing and upsetting her and creating more issues.",
          "created_utc": 1750861458.0
        }
      ]
    },
    {
      "id": "mzp64oh",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1750860128.0,
      "score": 26,
      "context": [
        {
          "id": "mzoyzoz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750857849.0
        },
        {
          "id": "mzp4v8j",
          "author": "Beautiful_Sort_3267",
          "body": "Thank you for the reply.\n\nShe deals with depression, though she generally doesn’t speak about it. She has a pretty bad/unhealthy relationship with her mom, which I think is the source of some of the things she struggles with. \n\nShe has tried therapy in the past but will go to a session or two and quit. \n\nHer weight loss just seems to have accelerated lately to the point where she looks unhealthy as opposed to small. I think she’s losing hair and recently started using Rogaine and other hair supplements to compensate. I’m just scared for lack of a better term.",
          "created_utc": 1750859746.0
        }
      ]
    },
    {
      "id": "mzp7k9o",
      "author": "InnocentaMN",
      "body": "Those are definitely concerning behaviours. A letter could be a good idea, as you’d have the chance to lay out your worries calmly and she could read through them without immediately reacting. You seem like a very loving and supportive spouse.\n\nThere is a major biological and genetic component to eating disorders, so it isn’t always a question of there being some specific “trigger” as the other commenter mentioned. Sometimes there definitely is one! But not always. Just something to keep in mind, as she might not be able to explain how she is feeling and what she is doing.",
      "created_utc": 1750860559.0,
      "score": 8,
      "context": [
        {
          "id": "mzp4hek",
          "author": "InnocentaMN",
          "body": "If you offer her favourite food, does she accept it? Do you see her eat? \n\nAnorexia is definitely an issue in people of all ages, despite being associated mostly with younger women and teens. As the other commenter said, though, there can be other reasons for low appetite / reduced eating. Do you think she would be open to discussing it with you?\n\n(I’m speaking as a woman in my thirties, currently in recovery from anorexia.)",
          "created_utc": 1750859629.0
        },
        {
          "id": "mzp72x7",
          "author": "Beautiful_Sort_3267",
          "body": "Thank you for the reply. \n\nShe eats, but it’s never much. When we go out to eat she will take a bite or two and then just mushes her food around and covers her plate with a napkin. \n\nIt’s not uncommon for waiters to ask her if something is wrong with the food/everything came out okay. \n\nAt home, she will have a few bites of dinner but I don’t think she eats much at all, if anything, during the work day. \n\nI get the sense that if I bring it up, she will just say she’s fine and doesn’t have an issue. \n\nI was thinking about writing a letter to read to her but haven’t yet.",
          "created_utc": 1750860417.0
        }
      ]
    },
    {
      "id": "mzr7xlt",
      "author": "Far-Fault-59",
      "body": "Please, no. I would not recommend snooping on her phone. If I knew someone had done that to me I would feel so betrayed that I would not be able to hear even the most compassionate concern. OP — I am so glad you are there for your wife. You have gotten a lot of good advice from others here, and I hope it is helpful to you and she is able comprehend how much love you have for here.",
      "created_utc": 1750880853.0,
      "score": 6,
      "context": [
        {
          "id": "mzp958p",
          "author": "MelodicFriendship262",
          "body": "Seems worrisome ngl, but there’s no real way to know unless you ask her, and even then people with Ed’s can lie/downplay the situation. I’d be very careful to not say anything about her body, bad or good. I think it’s a big misconception that’s it’s all about the physical looks when ed’s often come from a need for control. I’d maybe even suggest getting just 1 session with a therapist to help guide you on how you should talk to her if you can. It’s such a sensitive situation if she does have an ed and I wouldn’t want you to cause problems in your relationship because of something you said, since ed’s can really change your thinking pattern/how you interpret something. Ex: every time I lose weight and I get a compliment all I hear is that I was ugly before and now I’m more worthy in the literal sense that someone wanted to compliment me. It reinforces that being smaller is better than being bigger each time",
          "created_utc": 1750861019.0
        },
        {
          "id": "mzpanv8",
          "author": "Beautiful_Sort_3267",
          "body": "Thank you for the advice.\n\nI’ve been talking to my own therapist about the situation and she’s given me advice on how to approach the conversation. I just keep putting it off for fear of saying the wrong thing and upsetting her and creating more issues.",
          "created_utc": 1750861458.0
        },
        {
          "id": "mzpc8sr",
          "author": "MelodicFriendship262",
          "body": "Idk your relationship, you seem like a good husband. You guys have been together for a long time, but if I were you I might just try to look at her phone to get an inclination. Many people don’t do this because of privacy etc, and some people with eds don’t even look up stuff online. But I’d assume if you looked at search history you might see things along the lines of: bmi/bmr calculator, calories, exercises etc. a little is nothing to be worried about but if it’s each thing then I’d say it could be a red flag. You may also want to check camera roll for body checks. I know this isn’t favored by a lot of people, but if you have an open phone policy then you could pretend as if you stumbled across it. Sorry I know this isn’t a very “healthy” way to go about it, but it could give you an idea of where her head space is at. \n\nObviously this is hard for me to not be biased, I’m not diagnosed or anything but I’ve struggled since I was a kid. The comment about her and her mom having a bad relationship could be connected to the restriction, but her mother saying she’s too thin could be a sign that she doesn’t want her daughter doing it, or could be a sign of competition between them. My mom does this all of the time. You’re too fat, then you’re too thin. Text book. \n\nAlso, I’d just like to say that maybe it isn’t anorexia. Maybe she’s on a medicine that has already taken her small frame and made her underweight. Maybe the only eating a few bites here and there is ARFID (picky eating but to the point of not being able to stomach it, swallow it, chew it, mainly because of textures). Maybe she doesn’t like to eat in front of others or has social anxiety at restaurants. There could be many innocent explanations, but my gut says some type of ED considering the mushing of food and rapid weight loss. \n\nGood luck to you and your wife my friend.",
          "created_utc": 1750861919.0
        }
      ]
    },
    {
      "id": "mzp7osm",
      "author": "unfamiliarplaces",
      "body": "yeah hair loss is a big sign of malnutrition. \n\nop, can you try and convince her to see an ed aware dietician?",
      "created_utc": 1750860596.0,
      "score": 13,
      "context": [
        {
          "id": "mzoyzoz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750857849.0
        },
        {
          "id": "mzp4v8j",
          "author": "Beautiful_Sort_3267",
          "body": "Thank you for the reply.\n\nShe deals with depression, though she generally doesn’t speak about it. She has a pretty bad/unhealthy relationship with her mom, which I think is the source of some of the things she struggles with. \n\nShe has tried therapy in the past but will go to a session or two and quit. \n\nHer weight loss just seems to have accelerated lately to the point where she looks unhealthy as opposed to small. I think she’s losing hair and recently started using Rogaine and other hair supplements to compensate. I’m just scared for lack of a better term.",
          "created_utc": 1750859746.0
        },
        {
          "id": "mzp64oh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750860128.0
        }
      ]
    },
    {
      "id": "mzrbruw",
      "author": "MelodicFriendship262",
      "body": "Yeah that’s why I mentioned if they have an open phone policy and “stumbling” across it",
      "created_utc": 1750881955.0,
      "score": 1,
      "context": [
        {
          "id": "mzp958p",
          "author": "MelodicFriendship262",
          "body": "Seems worrisome ngl, but there’s no real way to know unless you ask her, and even then people with Ed’s can lie/downplay the situation. I’d be very careful to not say anything about her body, bad or good. I think it’s a big misconception that’s it’s all about the physical looks when ed’s often come from a need for control. I’d maybe even suggest getting just 1 session with a therapist to help guide you on how you should talk to her if you can. It’s such a sensitive situation if she does have an ed and I wouldn’t want you to cause problems in your relationship because of something you said, since ed’s can really change your thinking pattern/how you interpret something. Ex: every time I lose weight and I get a compliment all I hear is that I was ugly before and now I’m more worthy in the literal sense that someone wanted to compliment me. It reinforces that being smaller is better than being bigger each time",
          "created_utc": 1750861019.0
        },
        {
          "id": "mzpanv8",
          "author": "Beautiful_Sort_3267",
          "body": "Thank you for the advice.\n\nI’ve been talking to my own therapist about the situation and she’s given me advice on how to approach the conversation. I just keep putting it off for fear of saying the wrong thing and upsetting her and creating more issues.",
          "created_utc": 1750861458.0
        },
        {
          "id": "mzpc8sr",
          "author": "MelodicFriendship262",
          "body": "Idk your relationship, you seem like a good husband. You guys have been together for a long time, but if I were you I might just try to look at her phone to get an inclination. Many people don’t do this because of privacy etc, and some people with eds don’t even look up stuff online. But I’d assume if you looked at search history you might see things along the lines of: bmi/bmr calculator, calories, exercises etc. a little is nothing to be worried about but if it’s each thing then I’d say it could be a red flag. You may also want to check camera roll for body checks. I know this isn’t favored by a lot of people, but if you have an open phone policy then you could pretend as if you stumbled across it. Sorry I know this isn’t a very “healthy” way to go about it, but it could give you an idea of where her head space is at. \n\nObviously this is hard for me to not be biased, I’m not diagnosed or anything but I’ve struggled since I was a kid. The comment about her and her mom having a bad relationship could be connected to the restriction, but her mother saying she’s too thin could be a sign that she doesn’t want her daughter doing it, or could be a sign of competition between them. My mom does this all of the time. You’re too fat, then you’re too thin. Text book. \n\nAlso, I’d just like to say that maybe it isn’t anorexia. Maybe she’s on a medicine that has already taken her small frame and made her underweight. Maybe the only eating a few bites here and there is ARFID (picky eating but to the point of not being able to stomach it, swallow it, chew it, mainly because of textures). Maybe she doesn’t like to eat in front of others or has social anxiety at restaurants. There could be many innocent explanations, but my gut says some type of ED considering the mushing of food and rapid weight loss. \n\nGood luck to you and your wife my friend.",
          "created_utc": 1750861919.0
        },
        {
          "id": "mzr7xlt",
          "author": "Far-Fault-59",
          "body": "Please, no. I would not recommend snooping on her phone. If I knew someone had done that to me I would feel so betrayed that I would not be able to hear even the most compassionate concern. OP — I am so glad you are there for your wife. You have gotten a lot of good advice from others here, and I hope it is helpful to you and she is able comprehend how much love you have for here.",
          "created_utc": 1750880853.0
        }
      ]
    },
    {
      "id": "mzp8u6z",
      "author": "Beautiful_Sort_3267",
      "body": "I was hoping to get her to see some kind of ED specialist I am expecting her to say she doesn’t need to. That said, I feel like at this point, I have to try.",
      "created_utc": 1750860929.0,
      "score": 15,
      "context": [
        {
          "id": "mzoyzoz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750857849.0
        },
        {
          "id": "mzp4v8j",
          "author": "Beautiful_Sort_3267",
          "body": "Thank you for the reply.\n\nShe deals with depression, though she generally doesn’t speak about it. She has a pretty bad/unhealthy relationship with her mom, which I think is the source of some of the things she struggles with. \n\nShe has tried therapy in the past but will go to a session or two and quit. \n\nHer weight loss just seems to have accelerated lately to the point where she looks unhealthy as opposed to small. I think she’s losing hair and recently started using Rogaine and other hair supplements to compensate. I’m just scared for lack of a better term.",
          "created_utc": 1750859746.0
        },
        {
          "id": "mzp64oh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750860128.0
        },
        {
          "id": "mzp7osm",
          "author": "unfamiliarplaces",
          "body": "yeah hair loss is a big sign of malnutrition. \n\nop, can you try and convince her to see an ed aware dietician?",
          "created_utc": 1750860596.0
        }
      ]
    },
    {
      "id": "mzrcn8i",
      "author": "Far-Fault-59",
      "body": "Sorry — I was unfamiliar with that term — “open phone policy” — but I get it now.",
      "created_utc": 1750882205.0,
      "score": 2,
      "context": [
        {
          "id": "mzp958p",
          "author": "MelodicFriendship262",
          "body": "Seems worrisome ngl, but there’s no real way to know unless you ask her, and even then people with Ed’s can lie/downplay the situation. I’d be very careful to not say anything about her body, bad or good. I think it’s a big misconception that’s it’s all about the physical looks when ed’s often come from a need for control. I’d maybe even suggest getting just 1 session with a therapist to help guide you on how you should talk to her if you can. It’s such a sensitive situation if she does have an ed and I wouldn’t want you to cause problems in your relationship because of something you said, since ed’s can really change your thinking pattern/how you interpret something. Ex: every time I lose weight and I get a compliment all I hear is that I was ugly before and now I’m more worthy in the literal sense that someone wanted to compliment me. It reinforces that being smaller is better than being bigger each time",
          "created_utc": 1750861019.0
        },
        {
          "id": "mzpanv8",
          "author": "Beautiful_Sort_3267",
          "body": "Thank you for the advice.\n\nI’ve been talking to my own therapist about the situation and she’s given me advice on how to approach the conversation. I just keep putting it off for fear of saying the wrong thing and upsetting her and creating more issues.",
          "created_utc": 1750861458.0
        },
        {
          "id": "mzpc8sr",
          "author": "MelodicFriendship262",
          "body": "Idk your relationship, you seem like a good husband. You guys have been together for a long time, but if I were you I might just try to look at her phone to get an inclination. Many people don’t do this because of privacy etc, and some people with eds don’t even look up stuff online. But I’d assume if you looked at search history you might see things along the lines of: bmi/bmr calculator, calories, exercises etc. a little is nothing to be worried about but if it’s each thing then I’d say it could be a red flag. You may also want to check camera roll for body checks. I know this isn’t favored by a lot of people, but if you have an open phone policy then you could pretend as if you stumbled across it. Sorry I know this isn’t a very “healthy” way to go about it, but it could give you an idea of where her head space is at. \n\nObviously this is hard for me to not be biased, I’m not diagnosed or anything but I’ve struggled since I was a kid. The comment about her and her mom having a bad relationship could be connected to the restriction, but her mother saying she’s too thin could be a sign that she doesn’t want her daughter doing it, or could be a sign of competition between them. My mom does this all of the time. You’re too fat, then you’re too thin. Text book. \n\nAlso, I’d just like to say that maybe it isn’t anorexia. Maybe she’s on a medicine that has already taken her small frame and made her underweight. Maybe the only eating a few bites here and there is ARFID (picky eating but to the point of not being able to stomach it, swallow it, chew it, mainly because of textures). Maybe she doesn’t like to eat in front of others or has social anxiety at restaurants. There could be many innocent explanations, but my gut says some type of ED considering the mushing of food and rapid weight loss. \n\nGood luck to you and your wife my friend.",
          "created_utc": 1750861919.0
        },
        {
          "id": "mzr7xlt",
          "author": "Far-Fault-59",
          "body": "Please, no. I would not recommend snooping on her phone. If I knew someone had done that to me I would feel so betrayed that I would not be able to hear even the most compassionate concern. OP — I am so glad you are there for your wife. You have gotten a lot of good advice from others here, and I hope it is helpful to you and she is able comprehend how much love you have for here.",
          "created_utc": 1750880853.0
        },
        {
          "id": "mzrbruw",
          "author": "MelodicFriendship262",
          "body": "Yeah that’s why I mentioned if they have an open phone policy and “stumbling” across it",
          "created_utc": 1750881955.0
        }
      ]
    },
    {
      "id": "mzpak1k",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1750861427.0,
      "score": 16,
      "context": [
        {
          "id": "mzoyzoz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750857849.0
        },
        {
          "id": "mzp4v8j",
          "author": "Beautiful_Sort_3267",
          "body": "Thank you for the reply.\n\nShe deals with depression, though she generally doesn’t speak about it. She has a pretty bad/unhealthy relationship with her mom, which I think is the source of some of the things she struggles with. \n\nShe has tried therapy in the past but will go to a session or two and quit. \n\nHer weight loss just seems to have accelerated lately to the point where she looks unhealthy as opposed to small. I think she’s losing hair and recently started using Rogaine and other hair supplements to compensate. I’m just scared for lack of a better term.",
          "created_utc": 1750859746.0
        },
        {
          "id": "mzp64oh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750860128.0
        },
        {
          "id": "mzp7osm",
          "author": "unfamiliarplaces",
          "body": "yeah hair loss is a big sign of malnutrition. \n\nop, can you try and convince her to see an ed aware dietician?",
          "created_utc": 1750860596.0
        },
        {
          "id": "mzp8u6z",
          "author": "Beautiful_Sort_3267",
          "body": "I was hoping to get her to see some kind of ED specialist I am expecting her to say she doesn’t need to. That said, I feel like at this point, I have to try.",
          "created_utc": 1750860929.0
        }
      ]
    },
    {
      "id": "mzpcbeq",
      "author": "Beautiful_Sort_3267",
      "body": "Thank you for sharing that",
      "created_utc": 1750861940.0,
      "score": 6,
      "context": [
        {
          "id": "mzoyzoz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750857849.0
        },
        {
          "id": "mzp4v8j",
          "author": "Beautiful_Sort_3267",
          "body": "Thank you for the reply.\n\nShe deals with depression, though she generally doesn’t speak about it. She has a pretty bad/unhealthy relationship with her mom, which I think is the source of some of the things she struggles with. \n\nShe has tried therapy in the past but will go to a session or two and quit. \n\nHer weight loss just seems to have accelerated lately to the point where she looks unhealthy as opposed to small. I think she’s losing hair and recently started using Rogaine and other hair supplements to compensate. I’m just scared for lack of a better term.",
          "created_utc": 1750859746.0
        },
        {
          "id": "mzp64oh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750860128.0
        },
        {
          "id": "mzp7osm",
          "author": "unfamiliarplaces",
          "body": "yeah hair loss is a big sign of malnutrition. \n\nop, can you try and convince her to see an ed aware dietician?",
          "created_utc": 1750860596.0
        },
        {
          "id": "mzp8u6z",
          "author": "Beautiful_Sort_3267",
          "body": "I was hoping to get her to see some kind of ED specialist I am expecting her to say she doesn’t need to. That said, I feel like at this point, I have to try.",
          "created_utc": 1750860929.0
        },
        {
          "id": "mzpak1k",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750861427.0
        }
      ]
    }
  ]
}