{
  "id": "1ln5odi",
  "subreddit": "AnorexiaNervosa",
  "author": "Starlight-Edith",
  "created_utc": 1751170305.0,
  "title": "Am I the only one that doesn’t like “To the Bone”?",
  "selftext": "All my tumblr mutuals for YEARS have told me it is the single best ED movie in existence.\n\nI just watched it for the first time, and … I was pretty disappointed.\n\nThey hardly focused on the actual disorder at all. I’m not saying they should’ve done nothing but show ED behaviors but she does a set of sit ups twice and spits out some food, and that’s it. \n\nThe majority of the movie’s run time is focused on her relationship with Luke. \n\nThat man is the creepiest asshole I have ever seen!! He’s clearly using her as his “muse” and his “just eat” attitude screamed “I don’t know anything about EDs” so hard that I started to wonder if he faked the disorder just to chase down a pretty “broken” person for his art projects. \n\nThey clearly were pushing for a narrative about mother daughter relationships but they just… didn’t explore it. Like at all. Eli’s mom feeds her rice milk and that’s all that happens. \n\nThen she has a weird dream and she’s magically cured?? \n\nThey create so many loose ends that they just… never address. \n\nThis isn’t about the movie itself, but as a trans person, I find it incredibly fucking weird that EVERYONE who talks about this movie insists on calling Eli Ellen. She says several times that she hates the name. People call her Ellen so exclusively that I didn’t even know she changed her name!! What the hell!!\n\nAs far as ED movies go, having now seen “The” ED movie, I will tell you that Black Swan is leaps and bounds better for accurately reflecting the experience, and BS isn’t even an ED movie! It’s a psychological thriller! \n\nHonestly, the whole movie read to me like inspiration porn. Girl meets some creepy ass man and finds love and suddenly all her problems are fixed and her step mom magically loves her. I know it was made by people who have / had eating disorders but if it was not stated at the beginning I would’ve assumed it was made by someone whose only experience with AN was tabloids about celebrities being too thin. It reminds me WAY too much of the movie Wonder (which is also inspiration porn if you’re unfamiliar). \n\nSeriously. Why do people like this movie so much? (I hate to tear down the movie as I know a lot of people find a lot of comfort in it, but holy hell) ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1ln5odi/am_i_the_only_one_that_doesnt_like_to_the_bone/",
  "score": 176,
  "num_comments": 63,
  "comments": [
    {
      "id": "n0ct6w3",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1751170306.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0cvux9",
      "author": "rilatooma444",
      "body": "that movie is so cringe to me that i have to pause it to walk away or scream but i am obsessed with ED media so i watch it compulsively",
      "created_utc": 1751171556.0,
      "score": 111,
      "context": []
    },
    {
      "id": "n0e1506",
      "author": "lilbumble3",
      "body": "I enjoyed it when I was at my worst. \n\nNow I’m recovered/in recovery - it’s the most out of touch portrayal of AN. \nI’d be inclined to say it actually contributes to “stereotypical image/behaviours of AN” harmful discourse",
      "created_utc": 1751195022.0,
      "score": 25,
      "context": []
    },
    {
      "id": "n0cwf6c",
      "author": "bluebelle08",
      "body": "nope. search through edanon and you’ll see people here REALLY hate it. im positive your tumblr mutuals just see it as thinspo…",
      "created_utc": 1751171821.0,
      "score": 52,
      "context": []
    },
    {
      "id": "n0cxozm",
      "author": "monarchmondays",
      "body": "I also fucking hated that movie.\n\n\n1. The only two non skinny white women were portrayed as joke characters. Bulimic woman was made fun of because she puked in the plants, and the one with BED, who was Black, was made fun of for overeating. Fucking fantastic that the only two non anorexic people/token Black character are treated as jokes! \n\n2. Yes, Luke was such a weird character. He showed absolutely no signs of an ED, was on pass/leave all the time meaning he wasn’t exhibiting dangerous behaviours anymore, so why was he even there? For support? Okay fine. But why throw in a male character and not use it as a way to raise awareness for male EDs? Oh right so he can be a love interest 😒\n\n3. Lily Collins was told she didn’t HAVE TO LOSE WEIGHT FOR THE ROLE. But she “chose to” to better fit the role.\nHere’s a quote from an interview:\n“I personally knew that this was something I needed to do to tell this story,\" says Collins, who struggled with both anorexia and bulimia. \"I wanted to be able to best exert my experiences on (Ellen) by going to the lengths I felt comfortable going to as an actor.”\nYou NEEDED to be emaciated to tell the story of an eating disorder? Her already being a conventionally attractive white woman was already stereotypical enough (not hate to Lily Collins, just that we have enough media already of that exact character). Especially as someone who had an ED, she should know better…\n\n4. And yes, she magically got better at the end. Just chose to get better suddenly. Had one meltdown then got it out of her system and went back and all was good. That’s…not how anorexia works.\n\n5. Of course they show her fainting! Because everyone who’s anorexic starves themselves 24/7 and doesn’t eat a single crumb, never slips up,  and has the energy to exercise all the time! Because of course!  😝 of course, that’s an eating disorder, but again, the most STEREOTYPICAL and OVERDONE representation. I also haven’t heard of a a single person who acts like that and doesn’t get SECTIONED immediately. \n\n6. Apparently, everyone (or the main cast/crew at least) working on the film had a history of eating disorders. What the hell? How could someone who knew the struggle would let this be made? It’s a bastardization of ED struggles.\n\nThe same story that has told a million times already was told again. It wasn’t revolutionary. Sure it touched on how childhood trauma/family issues contribute to EDs, but that’s it.",
      "created_utc": 1751172430.0,
      "score": 107,
      "context": []
    },
    {
      "id": "n0dxq54",
      "author": "Skythebluestars",
      "body": "Her sister using her as a human calculator for food. Am sorry if you know your sister is serverly ill. Thats how you support? It bothered me alot!",
      "created_utc": 1751193124.0,
      "score": 24,
      "context": []
    },
    {
      "id": "n0cxchu",
      "author": "bunkr33p",
      "body": "i think it did a couple things well, but the rest of it is a huge cringefest full of stereotypes and misinformation.",
      "created_utc": 1751172263.0,
      "score": 19,
      "context": []
    },
    {
      "id": "n0e9n88",
      "author": "jarofonions",
      "body": "The substance is more of an ed movie than to the bone",
      "created_utc": 1751199224.0,
      "score": 16,
      "context": []
    },
    {
      "id": "n0ex8f2",
      "author": "HeartShapedSeaShells",
      "body": "If Luke has no haters, I’m dead.",
      "created_utc": 1751208052.0,
      "score": 13,
      "context": []
    },
    {
      "id": "n0d8dxq",
      "author": "haybails720",
      "body": "I’ve had ppl online tell me I didn’t like it bc I’m “not sick enough” as if a symptom of eds is shitty taste in movies😭they think you gotta like every piece of media relating back to your disorder or your not actually sick",
      "created_utc": 1751177941.0,
      "score": 31,
      "context": []
    },
    {
      "id": "n0emfw5",
      "author": "BipolarSkeleton",
      "body": "I hated it and I don’t understand why people people think it’s so triggering or that they got so many tips from it but maybe I just can’t see it from the perspective of someone who didn’t know all the tips in the first place \n\nI sincerely believe that starving in suburbia is better than To the bone \n\nIn my opinion it was a love story that took place in a ED clinic \n\nI also use love story extremely loosely",
      "created_utc": 1751204344.0,
      "score": 9,
      "context": []
    },
    {
      "id": "n0gnyt8",
      "author": "brickyicky",
      "body": "Haaaate this movie. When that kid said “because we’re alive” I wanted to throw my tv",
      "created_utc": 1751227893.0,
      "score": 11,
      "context": []
    },
    {
      "id": "n0d2unl",
      "author": "maberg04",
      "body": "It was. So bad. I couldn't even finish it.",
      "created_utc": 1751174962.0,
      "score": 18,
      "context": []
    },
    {
      "id": "n0djp8t",
      "author": "New_General4192",
      "body": "I haven’t actually watched the movie, just the trailer, but the trailer annoyed me so much that I didn’t want to watch the movie at all. it wasn’t triggering, just annoying. I hated how inpatient looked so nice and almost fun and she even found a romantic partner there, which I felt was so far from the reality of inpatient. idk maybe some american treatment facilities are a bit more relaxed like that, and maybe for the people who made the movie that was their experience with inpatient. I think I just have really bad memories from inpatient so seeing it portrayed that way bothered me, but maybe that’s unfair idk. once again, I haven’t watched the film, so maybe it’s portrayed differently in the movie.\n\ni loved black swan. that scene when her mum brought out the cake almost made me cry.",
      "created_utc": 1751184549.0,
      "score": 8,
      "context": []
    },
    {
      "id": "n0dytzx",
      "author": "BreakfastDue2269",
      "body": "I haven’t watched to the bone in a hot minute, but rewatching it, in a completely different mindset, and significantly better, to when I first saw it, it feels all different\n\nWhy is Ellen / Eli so nasty to everyone?!, I get it’s a reflection of the disorder and how it can make you irritable sometimes, but no one else in the house acts like that- surely the people in the house wouldn’t just be friends with her again immediately after being so nasty\n\nAt the start too pearl says she got tubed, has a tube when Ellen moves in, and by even bitch a bawl (group) it’s gone again? It makes no sense to me- Also was she threatened with being kicked out because she wasn’t gaining? With the ‘dr beck says hospitals are for sick people’ ? Is it more of a we can’t provide medical assistance here so if you aren’t stable you can’t be here?\n\nAlso I feel bad for Susan, she’s trying her best, originally I saw her as a villain but watching it back now she’s just a little out of touch and doesn’t really understand what’s happening, no step/parent in that situation is going to be perfect\n\nFinally, Luke gives me the creeps 😃",
      "created_utc": 1751193765.0,
      "score": 8,
      "context": []
    },
    {
      "id": "n0ey3e8",
      "author": "Kaleezee",
      "body": "You're definitely not the only one! It was a horrible representation. Lily played the typical \"I'm so tough, I can get through anything\" girl. There was the typical \"just eat\" scene. I feel like the movie glorified anorexia, instead of showing the true horror or it. It was a mess all around, and to be honest, it triggered my anorexia. I got much worse after watching it, but that's just me 😕",
      "created_utc": 1751208325.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n0ezohn",
      "author": "Easy-Molasses-2495",
      "body": "it’s not a great movie and i can’t even lie every time i’ve watched it was just to trigger myself into losing weihjt",
      "created_utc": 1751208829.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n0dnx12",
      "author": "Signal-Answer-6374",
      "body": "FINALLY, I thought I was the only one, the whole thing felt like it was narrated around Ellen and Luke, which what a fucking creep in my opinion. I agree with the loose ends and this movie barely portrays EDs.",
      "created_utc": 1751187148.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n0fbywx",
      "author": "obviousreasons1",
      "body": "I have watched it probably 30 times, specifically BECAUSE it’s triggering, and whether that makes it “good” or “bad” is, I suppose, open to the viewer’s interpretation lol",
      "created_utc": 1751212731.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n0gj1jm",
      "author": "AGoodKnave",
      "body": "It reminds me of films like Oppenheimer, or The Imitation Game, for example. Cinema doesn't know how to portray thought well. Sorry to say, but scientific or mathematical discoveries/breakthroughs are BORING to watch. They involve sitting in silence for long periods of time. Sometimes months' worth. And usually it doesn't go anywhere. So you get Hollywoodised versions that happen in rapid montages, numbers flying everywhere, with Queen's gambit-esque hallucinations. It's trite.\n\n\nSimilarly, movies about ED fall into stereotypes because at the end of the day, it's a mental illness with mental gymnastics, bargaining, spiralling and obsessive thoughts, and often is very boring to watch, even when it's internally chaotic. So they have to fall to these \"I'm completely reformed!\" Moments, or show over-the-top behaviours that, while real for some people, are not necessarily the norm. EDs are day-to-day demons that become so commonplace that you're not necessarily having a meltdown over a sandwich. You simply just don't make a sandwich and have a diet coke instead. The jury is fighting inside. ",
      "created_utc": 1751226314.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n0dqk7s",
      "author": "realmofobsidian",
      "body": "i feel like this film is universally hated in this community , or at least that’s the impression i got when it came out.",
      "created_utc": 1751188784.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0fleu7",
      "author": "SnarkyMamaBear",
      "body": "I feel like it could only appeal to people who haven't been deep into ED media lore canon for the past several decades because that episode of Degrassi TNG where Emma gets sudden onset anorexia is 50000000x better than To The Bone.",
      "created_utc": 1751215743.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n0fyyky",
      "author": "twoyearlongmentalbd",
      "body": "someone who knows i have an ed told me they have watched it and they literally think that’s how this illness works for everybody. I really HATE that movie because of that, it makes this illness look like a clownery. Why would they display such a topic they way they did… also i heard lead actress Lilly Collins actually suffered from AN and that makes this even crazier… if i was me and i was recovered i would totally relapse. It’s very very toxic",
      "created_utc": 1751219903.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n0ge04d",
      "author": "Lisa7x",
      "body": "I like \"Starving in Suburbia\"",
      "created_utc": 1751224679.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n0gpmri",
      "author": "None",
      "body": "I watch it ever few months just for the thinspo. It's a shit movie and the story and everything is awful. Buuut it's triggering so.",
      "created_utc": 1751228419.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n0h9cye",
      "author": "catsinsunglassess",
      "body": "Black swan is my ED movie and coincidentally so triggering to me that i walked out of the theater the first time i saw it",
      "created_utc": 1751234813.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n0dbi9l",
      "author": "existential-thinker",
      "body": "That’s so crazy you posted this just as I got done watching it for the first time tonight.\n\nI did enjoy it, but noticed there was a lot of things going on that normally wouldn’t be allowed to happen during intensive inpatient treatment. For example, it really threw me off when Eli and Luke started making out in the outdoor/rest area. Like that would never fly the way they be watching you like a hawk in those units 😭\nSome things were a little annoying, such as no one actually getting wet during the rain scene except for dapping a few water marks on Luke’s shirt collar at the end of their trip to make up for everyone else being completely bone dry (no pun intended).\n\nI did find myself wishing the story dived deeper and didn’t remain so surface level.\n\nI really appreciated Dr. Beckham calling out Eli in his office following the scene after the family meeting about how she essentially needs to “grow a pair.” It doesn’t always work, and timing is definitely crucial, but sometimes we can benefit from hearing something so jarring… being forced to look in the mirror with nowhere to run, even if it initially hurts.",
      "created_utc": 1751179702.0,
      "score": 10,
      "context": []
    },
    {
      "id": "n0e747n",
      "author": "mouse-bites",
      "body": "I hate it so much. It’s so fucking cringey.",
      "created_utc": 1751198053.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0eathq",
      "author": "m0rganfailure",
      "body": "I just fucking hated it, so cringe and not even close to the average ED experience",
      "created_utc": 1751199743.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0fdic4",
      "author": "Ill-Bite-6864",
      "body": "I thought it was funny tbh😂 a treatment center where you don’t have to eat😂 rexis😂 I wasn’t offended by it or anything, I don’t think it’s the best representation. What didn’t sit right with me was casting lily Collin’s as the lead.",
      "created_utc": 1751213224.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0fhdxu",
      "author": "GunpowderxGelatine",
      "body": "Wait, is that the movie where they had a really corny early 2000s R&B style music video with rain cascading down while they're dancing or something?? God I hated that movie. It was so cringe.",
      "created_utc": 1751214457.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0ihw0w",
      "author": "No-Event4806",
      "body": "I don’t hate it but the part that made me cringe the most was Luke and that stupid love story plot. It’s definitely not great in terms of representation, but I can’t say that was a make or break deal for me since it was based on an account of someone who fits the usual stereotypes. The only black character having BED was in terrible taste though.",
      "created_utc": 1751251262.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0d3r2e",
      "author": "Shuyuya",
      "body": "I like it but most ppl on this sub don’t",
      "created_utc": 1751175428.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n0jer0w",
      "author": "Lis4nAlGaib",
      "body": "We need better ED representation I swear",
      "created_utc": 1751267295.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0lhlfr",
      "author": "VirtualApricot",
      "body": "I get second, first, and third hand embarrassment during the bottle-feeding scene. I don’t understand the point of it and it just physically hurts to watch, it’s so cringe.",
      "created_utc": 1751298971.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0llske",
      "author": "Lazy_Albatross_5500",
      "body": "It doesn’t even trigger me it’s so bad lmao",
      "created_utc": 1751300182.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n2dzy7d",
      "author": "AnonymousAnorexic715",
      "body": "I don’t watch ED movies anymore specifically because they either don’t portray Ana properly or are just about love instead",
      "created_utc": 1752164643.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n2r3pe6",
      "author": "Ecstatic-Market7198",
      "body": "I finally watched it... And I'm just lost. Some ED behaviors' are a good portray, the first half is okay with hard family dynamics, compulsive exercising and etc until Luke's date. Then nothing make any sense. I just didn't get the plot, the other half... She gets assaulted by Luke and... Nobody did nothing? What was this end dream? There were some okay scenes in the end, but it's too much of non-sense. And too much of \"oh look how she's doing ED stuff, and look she's losing look-\" shut up. \n\nAnd I'm sad they didn't explore the other girls there, or even the only male character (they could have make him as an athlete anorexic at least? They could have make the bulimic ones interesting?). And they could just even got deeper with family stuff, with... all of the side story. And no, they just thrown to us this shitty romantic plot, weird as fuck but whatever...\n\nI did enjoyed it at first, yah, but it could be far better. And it was really gross sometimes also... Nope this is not a good movie. And I don't think I'd appreciate it even during deeper anorexic relapse. Or only the first minutes, maybe?",
      "created_utc": 1752338552.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0o632l",
      "author": "ResponsibleReading57",
      "body": "I hated that movie, couldn’t even finish it and it sucks that it is the main representation out there",
      "created_utc": 1751327665.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0tahan",
      "author": "No-Material694",
      "body": "I hate how in pro-ana spaces people are like 'just find a guy and he's gonna fix u' literally no one without this fucking disorder understands, and if anything he's just gonna trigger me",
      "created_utc": 1751397923.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1126sp",
      "author": "None",
      "body": "I couldn’t finish watching it not because of how intense it was because it was boring.",
      "created_utc": 1751497200.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n16xjeo",
      "author": "None",
      "body": "I don't like movies about eating disorders. The only character I liked was Cassie from Skins, complex and out of touch.",
      "created_utc": 1751575157.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0d4n2z",
      "author": "Shuyuya",
      "body": "She didn’t find love you didn’t understand the movie tbh. She didn’t have a dream either of being cured. \n\nI liked this movie bc I am similar to the protagonist and everything about it spoke to me. Like you said, the movie was made by people who had anorexia so it is accurate to **their** experiences. It isn’t to a lot of ppl on this sub but it doesn’t mean it portrayed the disease badly, not everyone can relate to smth even if we have the same illness and it’s ok. I have bpd and I don’t relate to Clementine from Eternal sunshine of the spotless mind nor do I relate much to the protagonist of Girl, interrupted while it’s about bpd. I still love both movies.",
      "created_utc": 1751175897.0,
      "score": 0,
      "context": []
    },
    {
      "id": "n0e1x34",
      "author": "runninginbubbles",
      "body": "A lot of people have families who say and do this kind of stuff though!!!",
      "created_utc": 1751195438.0,
      "score": 14,
      "context": [
        {
          "id": "n0dxq54",
          "author": "Skythebluestars",
          "body": "Her sister using her as a human calculator for food. Am sorry if you know your sister is serverly ill. Thats how you support? It bothered me alot!",
          "created_utc": 1751193124.0
        }
      ]
    },
    {
      "id": "n0gndn5",
      "author": "Starlight-Edith",
      "body": "That sounds interesting! I’ll give that movie a watch. I do seriously recommend black swan by the way. I watched it when I was like 10 and I still think about it all the time.",
      "created_utc": 1751227707.0,
      "score": 8,
      "context": [
        {
          "id": "n0e9n88",
          "author": "jarofonions",
          "body": "The substance is more of an ed movie than to the bone",
          "created_utc": 1751199224.0
        }
      ]
    },
    {
      "id": "n0gnhd8",
      "author": "Starlight-Edith",
      "body": "It sucks because I was so excited that they decided to portray a man with an ED. And then he doesn’t even act like he has one! Wtf!",
      "created_utc": 1751227740.0,
      "score": 5,
      "context": [
        {
          "id": "n0ex8f2",
          "author": "HeartShapedSeaShells",
          "body": "If Luke has no haters, I’m dead.",
          "created_utc": 1751208052.0
        }
      ]
    },
    {
      "id": "n0gnuuk",
      "author": "Starlight-Edith",
      "body": "Ive never been inpatient but I haven’t heard of a treatment center like that. It’s almost like they thought inpatient must be the same thing as a halfway house (which generally does take place in a home like environment). My guess is that the house environment was part of Dr. Beck being “unconventional” (they call him this several times)",
      "created_utc": 1751227859.0,
      "score": 2,
      "context": [
        {
          "id": "n0djp8t",
          "author": "New_General4192",
          "body": "I haven’t actually watched the movie, just the trailer, but the trailer annoyed me so much that I didn’t want to watch the movie at all. it wasn’t triggering, just annoying. I hated how inpatient looked so nice and almost fun and she even found a romantic partner there, which I felt was so far from the reality of inpatient. idk maybe some american treatment facilities are a bit more relaxed like that, and maybe for the people who made the movie that was their experience with inpatient. I think I just have really bad memories from inpatient so seeing it portrayed that way bothered me, but maybe that’s unfair idk. once again, I haven’t watched the film, so maybe it’s portrayed differently in the movie.\n\ni loved black swan. that scene when her mum brought out the cake almost made me cry.",
          "created_utc": 1751184549.0
        }
      ]
    },
    {
      "id": "n0godsb",
      "author": "Starlight-Edith",
      "body": "The cake thing was definitely out of touch on Susan’s part, but she comes from an era where this sort of thing isn’t talked about. \n\nAlso as a side note, they go on and on about how this one specific drawing on Eli’s tumblr triggered a girl so bad she killed herself, but when they show the drawing it’s just… a normal side profile? Like the girl in the drawing doesn’t even look underweight. wtf??",
      "created_utc": 1751228023.0,
      "score": 3,
      "context": [
        {
          "id": "n0dytzx",
          "author": "BreakfastDue2269",
          "body": "I haven’t watched to the bone in a hot minute, but rewatching it, in a completely different mindset, and significantly better, to when I first saw it, it feels all different\n\nWhy is Ellen / Eli so nasty to everyone?!, I get it’s a reflection of the disorder and how it can make you irritable sometimes, but no one else in the house acts like that- surely the people in the house wouldn’t just be friends with her again immediately after being so nasty\n\nAt the start too pearl says she got tubed, has a tube when Ellen moves in, and by even bitch a bawl (group) it’s gone again? It makes no sense to me- Also was she threatened with being kicked out because she wasn’t gaining? With the ‘dr beck says hospitals are for sick people’ ? Is it more of a we can’t provide medical assistance here so if you aren’t stable you can’t be here?\n\nAlso I feel bad for Susan, she’s trying her best, originally I saw her as a villain but watching it back now she’s just a little out of touch and doesn’t really understand what’s happening, no step/parent in that situation is going to be perfect\n\nFinally, Luke gives me the creeps 😃",
          "created_utc": 1751193765.0
        }
      ]
    },
    {
      "id": "n2r4x6x",
      "author": "Ecstatic-Market7198",
      "body": "I'd been in a hospital where they said the same as the doctor for \"hospitals are for sick people\", but it wasn't mean in this way... It was mostly because they would welcome people who weren't too UW for several months, with REAL treatment given and around 8-10 patients for a customized help, and they didn't have the medical stuff if someone was too close to death. \n\nIt does exist, but it's not like this AT ALL.",
      "created_utc": 1752338934.0,
      "score": 1,
      "context": [
        {
          "id": "n0dytzx",
          "author": "BreakfastDue2269",
          "body": "I haven’t watched to the bone in a hot minute, but rewatching it, in a completely different mindset, and significantly better, to when I first saw it, it feels all different\n\nWhy is Ellen / Eli so nasty to everyone?!, I get it’s a reflection of the disorder and how it can make you irritable sometimes, but no one else in the house acts like that- surely the people in the house wouldn’t just be friends with her again immediately after being so nasty\n\nAt the start too pearl says she got tubed, has a tube when Ellen moves in, and by even bitch a bawl (group) it’s gone again? It makes no sense to me- Also was she threatened with being kicked out because she wasn’t gaining? With the ‘dr beck says hospitals are for sick people’ ? Is it more of a we can’t provide medical assistance here so if you aren’t stable you can’t be here?\n\nAlso I feel bad for Susan, she’s trying her best, originally I saw her as a villain but watching it back now she’s just a little out of touch and doesn’t really understand what’s happening, no step/parent in that situation is going to be perfect\n\nFinally, Luke gives me the creeps 😃",
          "created_utc": 1751193765.0
        }
      ]
    },
    {
      "id": "n0nunc3",
      "author": "mde3919",
      "body": "literally same. that movie triggered my relapse and sent me back to res.",
      "created_utc": 1751323909.0,
      "score": 1,
      "context": [
        {
          "id": "n0ey3e8",
          "author": "Kaleezee",
          "body": "You're definitely not the only one! It was a horrible representation. Lily played the typical \"I'm so tough, I can get through anything\" girl. There was the typical \"just eat\" scene. I feel like the movie glorified anorexia, instead of showing the true horror or it. It was a mess all around, and to be honest, it triggered my anorexia. I got much worse after watching it, but that's just me 😕",
          "created_utc": 1751208325.0
        }
      ]
    },
    {
      "id": "n0gqbw7",
      "author": "Starlight-Edith",
      "body": "Maybe it would’ve gone over better as a book. Books are generally very good at portraying inner monologue.",
      "created_utc": 1751228641.0,
      "score": 2,
      "context": [
        {
          "id": "n0gj1jm",
          "author": "AGoodKnave",
          "body": "It reminds me of films like Oppenheimer, or The Imitation Game, for example. Cinema doesn't know how to portray thought well. Sorry to say, but scientific or mathematical discoveries/breakthroughs are BORING to watch. They involve sitting in silence for long periods of time. Sometimes months' worth. And usually it doesn't go anywhere. So you get Hollywoodised versions that happen in rapid montages, numbers flying everywhere, with Queen's gambit-esque hallucinations. It's trite.\n\n\nSimilarly, movies about ED fall into stereotypes because at the end of the day, it's a mental illness with mental gymnastics, bargaining, spiralling and obsessive thoughts, and often is very boring to watch, even when it's internally chaotic. So they have to fall to these \"I'm completely reformed!\" Moments, or show over-the-top behaviours that, while real for some people, are not necessarily the norm. EDs are day-to-day demons that become so commonplace that you're not necessarily having a meltdown over a sandwich. You simply just don't make a sandwich and have a diet coke instead. The jury is fighting inside. ",
          "created_utc": 1751226314.0
        }
      ]
    },
    {
      "id": "n0ftjmz",
      "author": "_morose-mongoose_",
      "body": "Sudden onset anorexia 🤣 that phrase is so funny to me omg  thank you. It reminds me of one episode of Lizzie McGuire where her friend suddenly decides to starve herself and by the end of the episode her friends convince her she's beautiful and she should eat (I think that's how it goes, I haven't seen it in about 20 years)",
      "created_utc": 1751218247.0,
      "score": 3,
      "context": [
        {
          "id": "n0fleu7",
          "author": "SnarkyMamaBear",
          "body": "I feel like it could only appeal to people who haven't been deep into ED media lore canon for the past several decades because that episode of Degrassi TNG where Emma gets sudden onset anorexia is 50000000x better than To The Bone.",
          "created_utc": 1751215743.0
        }
      ]
    },
    {
      "id": "n0n4s0i",
      "author": "Starlight-Edith",
      "body": "I saw it at like 10 years old because a family friend had leant my parents the DVD (am I dating myself here), and it’s haunted me ever since man. I don’t even remember anything concrete about it except the skin peeling scene at this point but from my feelings about it I remember it being good rep. I should watch it again.",
      "created_utc": 1751315913.0,
      "score": 2,
      "context": [
        {
          "id": "n0h9cye",
          "author": "catsinsunglassess",
          "body": "Black swan is my ED movie and coincidentally so triggering to me that i walked out of the theater the first time i saw it",
          "created_utc": 1751234813.0
        }
      ]
    },
    {
      "id": "n0gmhk3",
      "author": "fuschiaoctopus",
      "body": "It's been a decade since I've seen it but iirc the program Eli is at is modeled much more closely after weird expensive out of pocket only frufru residentials than a hospital inpatient unit. \n\nI did actually have and witness experiences similar to the movie in residential and even ip though, the industry can be quite horrible and staff can be bad at their jobs. That said I still think they were going for one of those weird \"experimental\" programs that aren't traditional and don't use evidence based methods, cause it was really bizarre what they were doing for \"therapy\" and how the program was set up in To The Bone.",
      "created_utc": 1751227423.0,
      "score": 5,
      "context": [
        {
          "id": "n0dbi9l",
          "author": "existential-thinker",
          "body": "That’s so crazy you posted this just as I got done watching it for the first time tonight.\n\nI did enjoy it, but noticed there was a lot of things going on that normally wouldn’t be allowed to happen during intensive inpatient treatment. For example, it really threw me off when Eli and Luke started making out in the outdoor/rest area. Like that would never fly the way they be watching you like a hawk in those units 😭\nSome things were a little annoying, such as no one actually getting wet during the rain scene except for dapping a few water marks on Luke’s shirt collar at the end of their trip to make up for everyone else being completely bone dry (no pun intended).\n\nI did find myself wishing the story dived deeper and didn’t remain so surface level.\n\nI really appreciated Dr. Beckham calling out Eli in his office following the scene after the family meeting about how she essentially needs to “grow a pair.” It doesn’t always work, and timing is definitely crucial, but sometimes we can benefit from hearing something so jarring… being forced to look in the mirror with nowhere to run, even if it initially hurts.",
          "created_utc": 1751179702.0
        }
      ]
    },
    {
      "id": "n0gpv3v",
      "author": "Starlight-Edith",
      "body": "Yes, that’s the one.",
      "created_utc": 1751228493.0,
      "score": 1,
      "context": [
        {
          "id": "n0fhdxu",
          "author": "GunpowderxGelatine",
          "body": "Wait, is that the movie where they had a really corny early 2000s R&B style music video with rain cascading down while they're dancing or something?? God I hated that movie. It was so cringe.",
          "created_utc": 1751214457.0
        }
      ]
    },
    {
      "id": "n0taslw",
      "author": "No-Material694",
      "body": "I feel like it would be very difficult to film because every movie or tv show needs some kind of either closure or a cliffhanger which I guess could be an option, but like, the person either recovers or falls deeper and deeper and ends their own life (truthfully). Most of us, however, are just here, miserably, relapsing and trying to push through those difficult episodes but that wouldn't be very fun to watch.",
      "created_utc": 1751398014.0,
      "score": 1,
      "context": [
        {
          "id": "n0jer0w",
          "author": "Lis4nAlGaib",
          "body": "We need better ED representation I swear",
          "created_utc": 1751267295.0
        }
      ]
    },
    {
      "id": "n2s8fhc",
      "author": "Starlight-Edith",
      "body": "I agree completely",
      "created_utc": 1752351325.0,
      "score": 1,
      "context": [
        {
          "id": "n2r3pe6",
          "author": "Ecstatic-Market7198",
          "body": "I finally watched it... And I'm just lost. Some ED behaviors' are a good portray, the first half is okay with hard family dynamics, compulsive exercising and etc until Luke's date. Then nothing make any sense. I just didn't get the plot, the other half... She gets assaulted by Luke and... Nobody did nothing? What was this end dream? There were some okay scenes in the end, but it's too much of non-sense. And too much of \"oh look how she's doing ED stuff, and look she's losing look-\" shut up. \n\nAnd I'm sad they didn't explore the other girls there, or even the only male character (they could have make him as an athlete anorexic at least? They could have make the bulimic ones interesting?). And they could just even got deeper with family stuff, with... all of the side story. And no, they just thrown to us this shitty romantic plot, weird as fuck but whatever...\n\nI did enjoyed it at first, yah, but it could be far better. And it was really gross sometimes also... Nope this is not a good movie. And I don't think I'd appreciate it even during deeper anorexic relapse. Or only the first minutes, maybe?",
          "created_utc": 1752338552.0
        }
      ]
    },
    {
      "id": "n0gps2p",
      "author": "Starlight-Edith",
      "body": "She does have a dream, at the very end of the movie. She falls asleep in the dirt, and in the dream She’s sitting in a tree with Luke and looks down at herself, naked, says “oh my god, is that me?” And then when she wakes up she immediately goes back to the treatment house. \n\nAlso she literally did “find love” — her relationship with Luke was the main focus of the movie, especially after the rain scene. Although as I stated throughout the post, I don’t think he genuinely loves her. \n\nIt’s fine to like the movie, but claiming I didn’t understand it just because I took different things away from it than you is a little mean spirited, and also kind of bizarre because the whole point of movies is that different people have different takeaways from them.",
      "created_utc": 1751228467.0,
      "score": 4,
      "context": [
        {
          "id": "n0d4n2z",
          "author": "Shuyuya",
          "body": "She didn’t find love you didn’t understand the movie tbh. She didn’t have a dream either of being cured. \n\nI liked this movie bc I am similar to the protagonist and everything about it spoke to me. Like you said, the movie was made by people who had anorexia so it is accurate to **their** experiences. It isn’t to a lot of ppl on this sub but it doesn’t mean it portrayed the disease badly, not everyone can relate to smth even if we have the same illness and it’s ok. I have bpd and I don’t relate to Clementine from Eternal sunshine of the spotless mind nor do I relate much to the protagonist of Girl, interrupted while it’s about bpd. I still love both movies.",
          "created_utc": 1751175897.0
        }
      ]
    },
    {
      "id": "n0h2ypz",
      "author": "AGoodKnave",
      "body": "Definitely. Although to be fair, it's also hard to really write the endless calculator and thoughts that spin like a rolodex as you navigate every interaction and decision you make, especially non-food related ones. I wonder if there's a way to show the consistent duality of thought and action.",
      "created_utc": 1751232680.0,
      "score": 2,
      "context": [
        {
          "id": "n0gj1jm",
          "author": "AGoodKnave",
          "body": "It reminds me of films like Oppenheimer, or The Imitation Game, for example. Cinema doesn't know how to portray thought well. Sorry to say, but scientific or mathematical discoveries/breakthroughs are BORING to watch. They involve sitting in silence for long periods of time. Sometimes months' worth. And usually it doesn't go anywhere. So you get Hollywoodised versions that happen in rapid montages, numbers flying everywhere, with Queen's gambit-esque hallucinations. It's trite.\n\n\nSimilarly, movies about ED fall into stereotypes because at the end of the day, it's a mental illness with mental gymnastics, bargaining, spiralling and obsessive thoughts, and often is very boring to watch, even when it's internally chaotic. So they have to fall to these \"I'm completely reformed!\" Moments, or show over-the-top behaviours that, while real for some people, are not necessarily the norm. EDs are day-to-day demons that become so commonplace that you're not necessarily having a meltdown over a sandwich. You simply just don't make a sandwich and have a diet coke instead. The jury is fighting inside. ",
          "created_utc": 1751226314.0
        },
        {
          "id": "n0gqbw7",
          "author": "Starlight-Edith",
          "body": "Maybe it would’ve gone over better as a book. Books are generally very good at portraying inner monologue.",
          "created_utc": 1751228641.0
        }
      ]
    },
    {
      "id": "n0gcau5",
      "author": "SnarkyMamaBear",
      "body": "That shit is my comfort entertainment lmao love 2000s girlie slop",
      "created_utc": 1751224132.0,
      "score": 3,
      "context": [
        {
          "id": "n0fleu7",
          "author": "SnarkyMamaBear",
          "body": "I feel like it could only appeal to people who haven't been deep into ED media lore canon for the past several decades because that episode of Degrassi TNG where Emma gets sudden onset anorexia is 50000000x better than To The Bone.",
          "created_utc": 1751215743.0
        },
        {
          "id": "n0ftjmz",
          "author": "_morose-mongoose_",
          "body": "Sudden onset anorexia 🤣 that phrase is so funny to me omg  thank you. It reminds me of one episode of Lizzie McGuire where her friend suddenly decides to starve herself and by the end of the episode her friends convince her she's beautiful and she should eat (I think that's how it goes, I haven't seen it in about 20 years)",
          "created_utc": 1751218247.0
        }
      ]
    },
    {
      "id": "n0nf7iw",
      "author": "catsinsunglassess",
      "body": "I saw it in the movie theaters as a full grown adult when it came out haha\n\nEdit: cannot imagine letting a 10 year old watch black swan !!",
      "created_utc": 1751318960.0,
      "score": 1,
      "context": [
        {
          "id": "n0h9cye",
          "author": "catsinsunglassess",
          "body": "Black swan is my ED movie and coincidentally so triggering to me that i walked out of the theater the first time i saw it",
          "created_utc": 1751234813.0
        },
        {
          "id": "n0n4s0i",
          "author": "Starlight-Edith",
          "body": "I saw it at like 10 years old because a family friend had leant my parents the DVD (am I dating myself here), and it’s haunted me ever since man. I don’t even remember anything concrete about it except the skin peeling scene at this point but from my feelings about it I remember it being good rep. I should watch it again.",
          "created_utc": 1751315913.0
        }
      ]
    },
    {
      "id": "n0goyzd",
      "author": "Starlight-Edith",
      "body": "They do specifically mention Dr. Beckham is known for being “unorthodox / unconventional” at least 3 times in the movie, so this is my guess too.",
      "created_utc": 1751228211.0,
      "score": 4,
      "context": [
        {
          "id": "n0dbi9l",
          "author": "existential-thinker",
          "body": "That’s so crazy you posted this just as I got done watching it for the first time tonight.\n\nI did enjoy it, but noticed there was a lot of things going on that normally wouldn’t be allowed to happen during intensive inpatient treatment. For example, it really threw me off when Eli and Luke started making out in the outdoor/rest area. Like that would never fly the way they be watching you like a hawk in those units 😭\nSome things were a little annoying, such as no one actually getting wet during the rain scene except for dapping a few water marks on Luke’s shirt collar at the end of their trip to make up for everyone else being completely bone dry (no pun intended).\n\nI did find myself wishing the story dived deeper and didn’t remain so surface level.\n\nI really appreciated Dr. Beckham calling out Eli in his office following the scene after the family meeting about how she essentially needs to “grow a pair.” It doesn’t always work, and timing is definitely crucial, but sometimes we can benefit from hearing something so jarring… being forced to look in the mirror with nowhere to run, even if it initially hurts.",
          "created_utc": 1751179702.0
        },
        {
          "id": "n0gmhk3",
          "author": "fuschiaoctopus",
          "body": "It's been a decade since I've seen it but iirc the program Eli is at is modeled much more closely after weird expensive out of pocket only frufru residentials than a hospital inpatient unit. \n\nI did actually have and witness experiences similar to the movie in residential and even ip though, the industry can be quite horrible and staff can be bad at their jobs. That said I still think they were going for one of those weird \"experimental\" programs that aren't traditional and don't use evidence based methods, cause it was really bizarre what they were doing for \"therapy\" and how the program was set up in To The Bone.",
          "created_utc": 1751227423.0
        }
      ]
    }
  ]
}