{
  "id": "1lnpl5v",
  "subreddit": "AnorexiaNervosa",
  "author": "hatsuneMcChickenn",
  "created_utc": 1751231121.0,
  "title": "Anorexia isnt just about weight loss",
  "selftext": "Why is it so hard to get people to understand that i dont just restrict simply bc i hate my body. Yes i dont like the way that i look and my weight definitely plays a role in my anorexia, but i also restrict bc i have a little appetite, i like the control, when my depression is extra bad i lose all want for food, etc. its just hard when my mom says “dont starve yourself, you’re beautiful” when its so much deeper than just my looks.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1lnpl5v/anorexia_isnt_just_about_weight_loss/",
  "score": 118,
  "num_comments": 13,
  "comments": [
    {
      "id": "n0gy6zv",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1751231122.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0h0nme",
      "author": "brownguyinthecorner",
      "body": "There's an unspoken global ignorance when it comes to ana, and this is just one slice of that high cal cake. Eating disorders are often not about food. Especially when untreated, they become an addiction. Would you tell a heroin addict to \"Stop shooting up\"? No. Telling an anorexic to stop starving themselves or to eat more is effectively the same thing. \n\nIt gets especially hard once you start noticing that your tummy rumbling is making you happy. Hell, sometimes you know that it's not normal and WANT to change but can't actually bring yourself to do so. \n\nAnorexia has the highest mortality rate for a reason...",
      "created_utc": 1751231924.0,
      "score": 41,
      "context": []
    },
    {
      "id": "n0h4c35",
      "author": "underthesauceyuh",
      "body": "I know for me it started as completely about weight loss for me. When I was anxious (about literally anything) I lost my appetite, I liked how I lost weight when I didn’t eat. It became very addictive and way too easy. I had no big trauma before I developed my eating disorder. I discovered that it made me feel better when I’m skinnier. I just enjoyed losing weight and felt more confident in myself as my body dysmorphia got worse. I had no idea what anorexia was when I developed it until I was diagnosed.\n\n I’m in recovery now, in therapy, doing somewhat better but for me the weight loss is really central to my ED. Could go deeper like societal standards and pressures, because logically that is an undeniable factor but it really does just feel like an “addiction” to me and less of a coping mechanism. It feels very vain but it’s just habits that are extremely hard to break. I care too much about my appearance and that paired with body dysmorphia is a recipe for disaster. It’s like a drug addiction where I’m physically and mentally dependent on weight loss and exercise.\n\nBut yes, scientifically it has been proven that most people with ED’s have some deeper trauma. It is more often than not a coping mechanism.",
      "created_utc": 1751233134.0,
      "score": 12,
      "context": []
    },
    {
      "id": "n0h575o",
      "author": "nervous_veggie",
      "body": "Weight loss is an effect of anorexia, it’s not the entire illness itself. Anyone who thinks there’s one reason for anorexia is ignorant and wrong!",
      "created_utc": 1751233415.0,
      "score": 7,
      "context": []
    },
    {
      "id": "n0hgxtf",
      "author": "Old_Kiwi_9400",
      "body": "Literally! Also anxiety plays such a big role too",
      "created_utc": 1751237468.0,
      "score": 9,
      "context": []
    },
    {
      "id": "n0h2y32",
      "author": "Sevennolater",
      "body": "Also trying to explain to people how much you actually love food, wish you could just eat “normally”, and don’t like how you look if you have lost weight.",
      "created_utc": 1751232674.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n0hafjq",
      "author": "reverie092",
      "body": "People can’t understand what they don’t have personal experience with. Their brain just isn’t capable of relating and they should not try to “help”.",
      "created_utc": 1751235179.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n0luix1",
      "author": "WhichAmphibian3152",
      "body": "It's an extremely complicated illness, especially when you've had it for a long time. All kinds of things get wrapped up in it. I don't think anyone who hasn't suffered will ever \"get\" it.",
      "created_utc": 1751302690.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0j48ag",
      "author": "Willing_Wonder_222",
      "body": "This though.",
      "created_utc": 1751261409.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0r77fr",
      "author": "prettylittleloserz",
      "body": "I feel the same it’s always “you won’t gain weight” etc but eating takes away the only thing I feel like i have control over. Everything else is falling apart but my eating disorder gives me comfort, it’s consistent. And I have a deep hatred for myself (never mind my body) and not eating is how I punish myself. Sometimes it’s a cry for help.",
      "created_utc": 1751376491.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0l5jpr",
      "author": "Easy-Molasses-2495",
      "body": "for me it was completely appearance based (this actually made me feel very invalid because it seems everyone else’s eating disorder is about control). i got bullied for my looks throughout my whole life and the one thing i can change about the way i look is lose weight. my body shape is unflattering so i thought “might as well be emaciated and boxy instead of fat and boxy!”. i can understand the control aspect though. at my lowest i loved the way people started to treat me because instead of being mean to my face they would be worried instead.",
      "created_utc": 1751295469.0,
      "score": 0,
      "context": []
    },
    {
      "id": "n0pklae",
      "author": "Alarming-Meaning-719",
      "body": "Now i feel stupid because i don't have a súper deep and intelectual explanantion to My ED\n\nI mean Is just more like yeah I want to look squeletical and i'm to lazy to do exercise so...yeah :l",
      "created_utc": 1751347207.0,
      "score": 0,
      "context": []
    },
    {
      "id": "n0lux5i",
      "author": "WhichAmphibian3152",
      "body": "And other mental illnesses/disorders. My bipolar, addictions, autism and ADHD all contribute. I know a lot of people whose OCD plays into their ED heavily and it makes it so much more complicated to get better.",
      "created_utc": 1751302799.0,
      "score": 5,
      "context": [
        {
          "id": "n0hgxtf",
          "author": "Old_Kiwi_9400",
          "body": "Literally! Also anxiety plays such a big role too",
          "created_utc": 1751237468.0
        }
      ]
    }
  ]
}