{
  "id": "1lnu90q",
  "subreddit": "AnorexiaNervosa",
  "author": "Middle_Addendum_484",
  "created_utc": 1751243990.0,
  "title": "(Suicide during anorexia) HUGE TW (maybe)",
  "selftext": "Okay so I thought this is super interesting and SUPER depressing and awful, so of course I’ll share 😍☺️. During the peak of my anorexia I finally began to feel actually suicidal. Like I genuinely did not want to live anymore and wouldn’t care about being careful on the roads and what not. I genuinely just hated my life so much and felt so worthless and felt so isolated. I just think like WOW a human becomes so numb and so incredibly malnourished to the point ur brain begins telling you to kill yourself. Does this happen to many anorexic people? Like ur brain actually telling you to kill yourself. It’s just insane. Looking back 6 months later I feel so bad for myself like that’s insane! \n\nThis is a super ridiculous story that I never tell anyone but when I was little I would watch rly scary horror movies and it just wired my brain to be scared of the dark even to this grown ass adult age. Whenever I would walk in the middle of the night through my house or just down the hallway to my bathroom, I no longer turned all the lights on, I no longer gave a fuck if there were demons or ghosts standing in the dark. I did. Not. Care. About. Being. Alive. My life was worthless. That whole scary dark thing situation made me realise wow this is lowkey the beginning of the end. Anyways, super random but \n\nP.s, if anyone is going through these thoughts right now, please know you’re going to fucking get through this bitch of a disorder, you’re life isn’t as worthless as the disorder makes u think it is. I love u, stay fierce xx",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1lnu90q/suicide_during_anorexia_huge_tw_maybe/",
  "score": 132,
  "num_comments": 41,
  "comments": [
    {
      "id": "n0hyt0k",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1751243991.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0i1m4y",
      "author": "Local_Guava_2747",
      "body": "Yes, whenever I was in the car while a train passed by, I would just think about running out and jumping. And I’ve only ever had these thoughts deep into my ED",
      "created_utc": 1751245042.0,
      "score": 39,
      "context": []
    },
    {
      "id": "n0ibge3",
      "author": "Best-Criticism810",
      "body": "yeah it honestly affects life so much like life revolves around eating and when that is causing so much stress and anxiety it makes me feel that way about life. like this anxiety I feel with food is going to affect my whole life it affects everything it makes me worry about everything",
      "created_utc": 1751248752.0,
      "score": 27,
      "context": []
    },
    {
      "id": "n0igdpf",
      "author": "Sao_118",
      "body": "I would say my mind is definitely touching into this subject and it scares me. I’m home alone a lot especially since I have no job or any friends so my mind is constantly thinking how I would do it.",
      "created_utc": 1751250659.0,
      "score": 20,
      "context": []
    },
    {
      "id": "n0iuuw2",
      "author": "DueConsequence8605",
      "body": "When I was at my worst I was my most suicidal.",
      "created_utc": 1751256797.0,
      "score": 15,
      "context": []
    },
    {
      "id": "n0iq6zb",
      "author": "kizzletizzleizzle",
      "body": "yes, i drove down the wrong side of the highway once. it was mostly an accident bc it was very late and i had a bit of a drive to get home and was in a new area but all i remember is truly not caring if i collided with the median or another car. horribly depressing but since recovering, i have not had nearly as many or any suicidal thoughts as when i was in the throes of my eating disorder.",
      "created_utc": 1751254705.0,
      "score": 12,
      "context": []
    },
    {
      "id": "n0ioht7",
      "author": "AnyManufacturer2048",
      "body": "ita suuuuucks currently going through it 👍",
      "created_utc": 1751253972.0,
      "score": 10,
      "context": []
    },
    {
      "id": "n0iy52a",
      "author": "tpwkluvr",
      "body": "no literally but it’s always been this way it’s just with the ed i’m now more reckless with it like im barely scared of walking alone at night even tho im a woman and i actually finally tried to kms this yr bc my ed is so bad but also So many other things",
      "created_utc": 1751258345.0,
      "score": 9,
      "context": []
    },
    {
      "id": "n0j9yb3",
      "author": "to_tired_to_clare",
      "body": "I have been feeling this way for years and did follow through with the thoughts which ended in a lengthy hospital stay. I hear stories all the time from people saying they are so glad they didn’t succeed because it was a wake up call but this isn’t how I feel. For me it just added to the list of failures. I too just cross aroad without looking and take big risks with life hoping it will be the end. I am glad to hear that you know longer feel that way",
      "created_utc": 1751264537.0,
      "score": 8,
      "context": []
    },
    {
      "id": "n0j1qzj",
      "author": "Zealousideal-Dog9547",
      "body": "Oh yeah definitely, I just don’t care anymore, I don’t give a fuck about looking both ways before crossing the street, have strangled myself quite some times :)",
      "created_utc": 1751260122.0,
      "score": 7,
      "context": []
    },
    {
      "id": "n0j584s",
      "author": "RepulsivePipe9904",
      "body": "I always have it, but it's worse than usual right now and I am restricting the most I have in a while.",
      "created_utc": 1751261943.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n0j8705",
      "author": "Guppy_fromtheWest",
      "body": "Yes. I dream about starving myself and feel relief. The worst part isn't the malnourishment for me but my family crying for me and are scared of pictures because they think I look like a walking corpse. The weight of that is heavy as fuck",
      "created_utc": 1751263558.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n0ji8ke",
      "author": "Winter-Rabbit-3814",
      "body": "100% tried to end my life by drinking laundry detergent. they sent me to a mental health facility and everything. i was deep into my anorexia. i even had a plan to try again with benadryl, i wrote letters and planned my whole week out before i was gonna do it to be the best week of my life. luckily my boyfriend found out. eventually i began to eat better and then i felt better. haven’t had a situation like that in a long time",
      "created_utc": 1751269412.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n0kah9g",
      "author": "South-Job-794",
      "body": "Struggled with it for many years even long before anorexia but ed's can definently intensify it. I feel so weak and have to sit down every 10-20 minutes because i feel like i'll collapse any second, a very big kill joy for me. I still fantazise about suicide alot, i'm improving but still considering euthanasia because of it. Shit sucks but i take it day-to-day now. I think it's also common because alot of people already have prior depression before ed's",
      "created_utc": 1751284915.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n0j641d",
      "author": "pinkienewbie",
      "body": "Yep 😔",
      "created_utc": 1751262423.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n0jhzna",
      "author": "twoyearlongmentalbd",
      "body": "thanks for sharing this, OP \ngoing through that rn… hopefully better days will come soon. sending love to everyone",
      "created_utc": 1751269259.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n0joxev",
      "author": "bb-03",
      "body": "absolutely. ive honestly dealt w/ suicidal thoughts in some capacity since middle school so its nothing new to me but when i heavily restrict, the thoughts are NONSTOP. like constant intrusive thoughts ab offing myself lmao.",
      "created_utc": 1751273546.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n0kbqrh",
      "author": "Double_Contest_6812",
      "body": "Yes. 100%. Living was HARD! I was soooo depressed. It must be from your brain not having enough nutrients. Now 4 years into recovery, I love my life and I’m so glad I made it🩷",
      "created_utc": 1751285442.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n0l4l2v",
      "author": "Easy-Molasses-2495",
      "body": "at my lowest weight i was just waiting for the disorder to kill me. even though i never got to an insanely low weight (bmi 9-13) i was using drugs (especially speed) and taking lots of diuretics filled with caffeine. every night my heart would feel like its about to explode and kill me, but that is what i wanted.",
      "created_utc": 1751295188.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0n0y75",
      "author": "NotAThrowAway28",
      "body": "this is me right now. constantly. the food noise, disappointing and worrying my family, constantly acting out and being in the wrong, harming myself. \n\ni dont know what to do anymore. if im honest at therapy tomorrow ill be hospitalized",
      "created_utc": 1751314802.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0nbite",
      "author": "oyroo",
      "body": "Yes, near my lowest weight. then started to get symptoms that if i had allowed them to worsen, would have done it i think. ultimately decided i really don't want to die yet. recovery 1 month and counting :)",
      "created_utc": 1751317865.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0jrnc3",
      "author": "shakethedisease666",
      "body": "My intrusive thoughts thanks to OCD and low weight managed to drive me mad. Several times I spiraled so hard I checked myself in to hospital, it’s like my brain kept poking me with questions like “what if you hit your head as hard as you can on the wall?” “What if you held your breath underwater forever?” “What if you took that kn*** and stuck it right into your ch***?” 😟",
      "created_utc": 1751275214.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0l2yjj",
      "author": "Pink_Bread_76",
      "body": "I personally believe it’s spiritual warfare, and “the enemy comes to steal, kill and destroy”. end game is always to kill/ won’t stop until you’re dead. i’ve been at that point on and off this year and I’m sorry you have been there too 🤍🥺",
      "created_utc": 1751294708.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0p3nsv",
      "author": "justradiationhere",
      "body": "Yes. It can all just seem so pointless. Like— even if I do get better, I know it'll get worse again too. And now at 26 I'm old enough to know that I'll be struggling with this the rest of my life. \n\nI get pretty bleak about life a lot when I'm severely restricting. Probably because I'm not even truly living? My \"life\" is pretty much just a half-life of isolation and self-harm and doing anything to shut my brain and hunger cues/cravings tf up.",
      "created_utc": 1751339738.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0qx701",
      "author": "collectedd",
      "body": "Yeah. I felt the same. I have also lost my best friend to suicide whilst she was deep in her AN. It was horrendous.",
      "created_utc": 1751372979.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0v0ske",
      "author": "17xlie",
      "body": "yes currently going through it and it sucks",
      "created_utc": 1751417461.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0wpxrv",
      "author": "Critical-Key4662",
      "body": "Yes absolutely. I really did not see a point anymore but to give people hope I have been in recovery for around a year and after around 6 months post weight restoration and settling into my body i feel excited to be alive, happy, and safe - things i never felt in my ED. It really does get better even though recovery was one of the hardest things i have ever done.",
      "created_utc": 1751444683.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0y7i2w",
      "author": "Capital_Ad1318",
      "body": "Honestly it was so strange. I hadn’t felt like that during my ‘active’ disorder phase, it was more paralysing anxiety. However once I started or was pushed into the recovery journey I started to experience the depression and hopelessness and emptiness.",
      "created_utc": 1751467024.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n1433bk",
      "author": "Ok-Entertainer-64",
      "body": "yes, i struggled with that too and it definitely sucks 🙃",
      "created_utc": 1751544524.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1fqhpc",
      "author": "Yuthenia",
      "body": "I really thought it was just my other mental illnesses putting me thru another suicidal episode but idk this time it felt eternally! I did things that I have never done before. I dropped out of college the suicidal thoughts didn’t let me focus anymore. But I kept pushing through why I would have multiple mental breakdowns everyday.",
      "created_utc": 1751701130.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1fw7x5",
      "author": "xXbellamuerteXx",
      "body": "actually for me it was kinda opposite ?? I’ve struggled with ideations since I was about 10yo (im almost 20 now) and I find that in the peaks of my anorexia I feel less suicidal because I “can’t possibly die fat” and thoughts of that sort. I could be a weird outlier case tho so who knows :)",
      "created_utc": 1751704610.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0k9plg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1751284591.0,
      "score": 0,
      "context": []
    },
    {
      "id": "n2va818",
      "author": "AmountStriking6269",
      "body": "Please be honest I lost my best friend to anorexia ",
      "created_utc": 1752396733.0,
      "score": 2,
      "context": [
        {
          "id": "n0n0y75",
          "author": "NotAThrowAway28",
          "body": "this is me right now. constantly. the food noise, disappointing and worrying my family, constantly acting out and being in the wrong, harming myself. \n\ni dont know what to do anymore. if im honest at therapy tomorrow ill be hospitalized",
          "created_utc": 1751314802.0
        }
      ]
    },
    {
      "id": "n0laakk",
      "author": "Middle_Addendum_484",
      "body": "Hi! So the emojis aren’t unnecessary as I am a sarcastic person who, in real life, giggles to my psychologist after telling her a very heavy thing or laughs/puts humour in my own traumatic stories. It’s my way of coping, it’s who I AM. This story that I have shared about ME has nothing to do with your trauma, but I am very sorry for what you’ve been through. if the two emojis have offended you, perhaps click off this post. Now I have a burden on me that I’ve offended someone using a love heart eyes emoji. Wow. Feels great explaining my feelings. Thanks Junggalo Enlightenment",
      "created_utc": 1751296857.0,
      "score": 4,
      "context": [
        {
          "id": "n0k9plg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284591.0
        }
      ]
    },
    {
      "id": "n0ka524",
      "author": "South-Job-794",
      "body": "As a person whose survived multiple attempts she's allowed to joke about her trauma. The emojis are used sarcastically. Yes suicide is a heavy topic but also some people don't want to talk about it and make it a very dark heavy topic because they don't feel comfortable with that. They're joking about their own trauma, not yours. Don't take it as something personal, i joke about it alot too",
      "created_utc": 1751284772.0,
      "score": 5,
      "context": [
        {
          "id": "n0k9plg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284591.0
        }
      ]
    },
    {
      "id": "n0lahhm",
      "author": "Middle_Addendum_484",
      "body": "AUGH THANK YOU 🙏",
      "created_utc": 1751296912.0,
      "score": 1,
      "context": [
        {
          "id": "n0k9plg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284591.0
        },
        {
          "id": "n0ka524",
          "author": "South-Job-794",
          "body": "As a person whose survived multiple attempts she's allowed to joke about her trauma. The emojis are used sarcastically. Yes suicide is a heavy topic but also some people don't want to talk about it and make it a very dark heavy topic because they don't feel comfortable with that. They're joking about their own trauma, not yours. Don't take it as something personal, i joke about it alot too",
          "created_utc": 1751284772.0
        }
      ]
    },
    {
      "id": "n0kam6e",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1751284973.0,
      "score": -1,
      "context": [
        {
          "id": "n0k9plg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284591.0
        },
        {
          "id": "n0ka524",
          "author": "South-Job-794",
          "body": "As a person whose survived multiple attempts she's allowed to joke about her trauma. The emojis are used sarcastically. Yes suicide is a heavy topic but also some people don't want to talk about it and make it a very dark heavy topic because they don't feel comfortable with that. They're joking about their own trauma, not yours. Don't take it as something personal, i joke about it alot too",
          "created_utc": 1751284772.0
        }
      ]
    },
    {
      "id": "n0kb1jj",
      "author": "South-Job-794",
      "body": "I do know.... because i tried and have had suicidal friends. People are allowed to joke about THEIR trauma. It's not a personal attack.",
      "created_utc": 1751285150.0,
      "score": 5,
      "context": [
        {
          "id": "n0k9plg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284591.0
        },
        {
          "id": "n0ka524",
          "author": "South-Job-794",
          "body": "As a person whose survived multiple attempts she's allowed to joke about her trauma. The emojis are used sarcastically. Yes suicide is a heavy topic but also some people don't want to talk about it and make it a very dark heavy topic because they don't feel comfortable with that. They're joking about their own trauma, not yours. Don't take it as something personal, i joke about it alot too",
          "created_utc": 1751284772.0
        },
        {
          "id": "n0kam6e",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284973.0
        }
      ]
    },
    {
      "id": "n0nffo4",
      "author": "alytesobstetricans",
      "body": "I lost my sister to suicide. I am not offended by the emojis, i get what role they play in coping, in OP setting the tone of their post.\n\nI think you are legitimate to be upset about it, but please don't assume we share a collective grieving conscience. I joke all the time about the way my sister died. Coping, simple as that. We're all different. And I am sorry for your loss(es).",
      "created_utc": 1751319028.0,
      "score": 2,
      "context": [
        {
          "id": "n0k9plg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284591.0
        },
        {
          "id": "n0ka524",
          "author": "South-Job-794",
          "body": "As a person whose survived multiple attempts she's allowed to joke about her trauma. The emojis are used sarcastically. Yes suicide is a heavy topic but also some people don't want to talk about it and make it a very dark heavy topic because they don't feel comfortable with that. They're joking about their own trauma, not yours. Don't take it as something personal, i joke about it alot too",
          "created_utc": 1751284772.0
        },
        {
          "id": "n0kam6e",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284973.0
        }
      ]
    },
    {
      "id": "n0kbh0u",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1751285329.0,
      "score": -2,
      "context": [
        {
          "id": "n0k9plg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284591.0
        },
        {
          "id": "n0ka524",
          "author": "South-Job-794",
          "body": "As a person whose survived multiple attempts she's allowed to joke about her trauma. The emojis are used sarcastically. Yes suicide is a heavy topic but also some people don't want to talk about it and make it a very dark heavy topic because they don't feel comfortable with that. They're joking about their own trauma, not yours. Don't take it as something personal, i joke about it alot too",
          "created_utc": 1751284772.0
        },
        {
          "id": "n0kam6e",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284973.0
        },
        {
          "id": "n0kb1jj",
          "author": "South-Job-794",
          "body": "I do know.... because i tried and have had suicidal friends. People are allowed to joke about THEIR trauma. It's not a personal attack.",
          "created_utc": 1751285150.0
        }
      ]
    },
    {
      "id": "n0lbk1d",
      "author": "Middle_Addendum_484",
      "body": "Clearly u just simply aren’t sarcastic or awkwardly put humour in YOUR traumatic situations, and that IS OKAY. seriously it’s fine, but don’t judge people for doing that with their own trauma. It’s similar to how if someone falls over a lot of people laugh, but there’s some who don’t and rush to see if they’re okay. Both bystanders are completely normal and valid and how they react to that event is just who they are and how they chose to live their lives!!!",
      "created_utc": 1751297224.0,
      "score": 4,
      "context": [
        {
          "id": "n0k9plg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284591.0
        },
        {
          "id": "n0ka524",
          "author": "South-Job-794",
          "body": "As a person whose survived multiple attempts she's allowed to joke about her trauma. The emojis are used sarcastically. Yes suicide is a heavy topic but also some people don't want to talk about it and make it a very dark heavy topic because they don't feel comfortable with that. They're joking about their own trauma, not yours. Don't take it as something personal, i joke about it alot too",
          "created_utc": 1751284772.0
        },
        {
          "id": "n0kam6e",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284973.0
        },
        {
          "id": "n0kb1jj",
          "author": "South-Job-794",
          "body": "I do know.... because i tried and have had suicidal friends. People are allowed to joke about THEIR trauma. It's not a personal attack.",
          "created_utc": 1751285150.0
        },
        {
          "id": "n0kbh0u",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751285329.0
        }
      ]
    },
    {
      "id": "n0kqwot",
      "author": "South-Job-794",
      "body": "I know what's it like jesus christ stop invalidating me whilst being a massive turd about this all. It was a joke, grow up, people are allowed to joke about THEIR trauma. BECAUSE IT'S THEIRS. And you are taking it personal, we can all tell",
      "created_utc": 1751290982.0,
      "score": 3,
      "context": [
        {
          "id": "n0k9plg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284591.0
        },
        {
          "id": "n0ka524",
          "author": "South-Job-794",
          "body": "As a person whose survived multiple attempts she's allowed to joke about her trauma. The emojis are used sarcastically. Yes suicide is a heavy topic but also some people don't want to talk about it and make it a very dark heavy topic because they don't feel comfortable with that. They're joking about their own trauma, not yours. Don't take it as something personal, i joke about it alot too",
          "created_utc": 1751284772.0
        },
        {
          "id": "n0kam6e",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284973.0
        },
        {
          "id": "n0kb1jj",
          "author": "South-Job-794",
          "body": "I do know.... because i tried and have had suicidal friends. People are allowed to joke about THEIR trauma. It's not a personal attack.",
          "created_utc": 1751285150.0
        },
        {
          "id": "n0kbh0u",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751285329.0
        }
      ]
    },
    {
      "id": "n0lg4o9",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1751298555.0,
      "score": 0,
      "context": [
        {
          "id": "n0k9plg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284591.0
        },
        {
          "id": "n0ka524",
          "author": "South-Job-794",
          "body": "As a person whose survived multiple attempts she's allowed to joke about her trauma. The emojis are used sarcastically. Yes suicide is a heavy topic but also some people don't want to talk about it and make it a very dark heavy topic because they don't feel comfortable with that. They're joking about their own trauma, not yours. Don't take it as something personal, i joke about it alot too",
          "created_utc": 1751284772.0
        },
        {
          "id": "n0kam6e",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284973.0
        },
        {
          "id": "n0kb1jj",
          "author": "South-Job-794",
          "body": "I do know.... because i tried and have had suicidal friends. People are allowed to joke about THEIR trauma. It's not a personal attack.",
          "created_utc": 1751285150.0
        },
        {
          "id": "n0kbh0u",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751285329.0
        },
        {
          "id": "n0kqwot",
          "author": "South-Job-794",
          "body": "I know what's it like jesus christ stop invalidating me whilst being a massive turd about this all. It was a joke, grow up, people are allowed to joke about THEIR trauma. BECAUSE IT'S THEIRS. And you are taking it personal, we can all tell",
          "created_utc": 1751290982.0
        }
      ]
    },
    {
      "id": "n0lqc4o",
      "author": "South-Job-794",
      "body": "Well it's none of your business now, have a nice day lmao",
      "created_utc": 1751301491.0,
      "score": 1,
      "context": [
        {
          "id": "n0k9plg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284591.0
        },
        {
          "id": "n0ka524",
          "author": "South-Job-794",
          "body": "As a person whose survived multiple attempts she's allowed to joke about her trauma. The emojis are used sarcastically. Yes suicide is a heavy topic but also some people don't want to talk about it and make it a very dark heavy topic because they don't feel comfortable with that. They're joking about their own trauma, not yours. Don't take it as something personal, i joke about it alot too",
          "created_utc": 1751284772.0
        },
        {
          "id": "n0kam6e",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751284973.0
        },
        {
          "id": "n0kb1jj",
          "author": "South-Job-794",
          "body": "I do know.... because i tried and have had suicidal friends. People are allowed to joke about THEIR trauma. It's not a personal attack.",
          "created_utc": 1751285150.0
        },
        {
          "id": "n0kbh0u",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751285329.0
        },
        {
          "id": "n0kqwot",
          "author": "South-Job-794",
          "body": "I know what's it like jesus christ stop invalidating me whilst being a massive turd about this all. It was a joke, grow up, people are allowed to joke about THEIR trauma. BECAUSE IT'S THEIRS. And you are taking it personal, we can all tell",
          "created_utc": 1751290982.0
        },
        {
          "id": "n0lg4o9",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1751298555.0
        }
      ]
    }
  ]
}