{
  "id": "1lt5pvj",
  "subreddit": "AnorexiaNervosa",
  "author": "Coffeegreysky12",
  "created_utc": 1751820113.0,
  "title": "You won't stop once you reach a certain weight",
  "selftext": "You think you have things under control at first. You start restricting your food intake and losing weight. You reach a number you have in your head. But you don't stop at that number, because this is a serious mental illness. And there is no off switch. You will never feel sick enough, underweight enough. You can start to look visibly ill, and you may think at that point, you are going to turn things around. Pursue recovery, because you've finally proved at this point you are sick. But you won't. In fact, resistance to treatment and finding comfort in this disorder, being in denial of how ill you are, is very common. I remember being hospitalized, severely ill, with failing health and people afraid I would die. I didn't have good insight back then. I thought everyone worried about me and trying to make me eat was wrong. That's what this disorder does to you. You can be in a hospital, emaciated, about to get a feeding tube because you are refusing to eat, and you still won't see it. I didn't see it at that time. My only focus at that point in time was my weight and what the scale was saying. Instead of thinking about the fact that people in the hospital were trying to get me healthier, all I thought about was my weight. I was younger, so I wasn't focused on the future consequences. And there are consequences to staying sick, remaining in a malnourished body. There are side effects to starving yourself. It is different for everyone. Maybe you start to notice you get cold easier and can no longer stay warm. Maybe you start losing energy and your bones start to weaken. Maybe you find it's hard to sleep at night. Your mind starts only focusing on what you eat, what you weigh. All other concerns drift into the background. Hopefully, you have people around you that try to get you to understand that what you are doing is deadly and that you need help. Maybe you will recover early, and find a way out of this disorder, before it becomes chronic. Maybe you accept to go to treatment and be refed. You accept help, knowing help means weight gain and letting go of the ed behaviors. Some people do very well in treatment and they never go on to be chronic. But for others, they don't respond the same to hospitalization. They stay sick for years, medical complications become worse. And full recovery seems impossible at times. But if you go through treatment, and it doesn't work, maybe it was not you that resisted the treatment. Maybe the treatment given was done poorly and people didn't tailor things to fit your needs. Everyone is different. Everyone reacts differently to treatment. Some fight the process. Some go along with it. It's not easy for anyone. And at any point in your disorder, whether you have been sick for two years and twenty years, you can suffer medical complications. You do not have to feel sick, to be sick. If you had asked me at the time of my inpatient hospitalizations if I felt sick and like I needed to be there, I would have said no. I was in denial. I didn't feel any pain or discomfort at the time, even though I was near death. No matter how many times people repeated to me they were afraid I was going to die, my illness had taken over and malnourishment was clouding my thinking. And I couldn't agree to what they said. I eventually agreed to eat, but only under pressure, because I felt I had no other choice. And when you go through treatment, and you aren't willing to see you have a problem, then you are going to have a difficult time getting better. When I was younger, I was unaware of all the terrible consequences. I had no idea there were so many side effects. Many they will not tell you about and you often do not consider things, until one day, they hit you and then you can't stop thinking about the damage done to your body. Damage from anorexia can be silent. It can occur for many years. Because this illness is an addiction, you may think because you do not feel bad, physically, that you can keep going. But your body can only take so much. I wish I could reverse time, and go back to the moments people were telling me to treat this early. I pushed away help after my hospitalizations, believing I could go home, retreat into the safety and comfort of my disorder, which was actually anything but safe. For years, my disorder grew more and more severe. And I avoided further hospitalization, for the fear it would be another repeated cycle. Then, my body began to show signs of damage. I have a hard time controlling my bladder, and get frequent and painful urination. This symptom basically keeps me staying at home all the time. And I have found no way to reverse it. It's not just frequency but constant pain. And this will erode your self esteem quickly. I wish I was warned about anorexia and bladder issues. But I had no idea. And that is the most devastating thing about this disorder. It silently takes away your comfort, your peace of mind, and steals little bits of your health in the most cruel ways. My digestive system is damaged from all the stress. Years of remaining at a low weight, never fully restoring my weight to a healthy level, has caused organ damage. I used to be able to eat and gain weight. But now, my body doesn't respond to food the same way, and I lose weight, unintentionally. It's not just weight loss, but chronic pain, stomach issues, and a general weak feeling. I was unaware that palliative care for anorexia existed. But I find myself on palliative care. I was unaware my disorder would become deeply entrenched. I was unaware these medical issues would have such a huge impact on my quality of life. Once a disorder becomes chronic, it is not impossible to get better. But you need support and understanding. With this disorder, it consumes your thoughts. You do not know why, but that number you see on the scale means so much. Yet, you long for a life free from this disorder and you try to be positive. But with anorexia, also comes depression. You do not see things in the same way that a healthy person without anorexia sees things. People say \"go to treatment\" and maybe things will get better. But a lot of people with anorexia fear change, fear changing what they are doing, even when a part of them understands the harm this disorder is causing them. Even if you wind up with very painful medical complications, even when people are waring you that you can die, even when you are a chronic sufferer, on palliative care, and feeling unsure about recovery, you will never feel sick enough. You will try to convince yourself that you can keep going like this. But that is just the disorder lying to you. Anorexia isn't fun. Anorexia isn't peaceful. Anorexia doesn't give you a break when you get tired of it. I try to be hopeful I can get better. What that may look like, I cannot predict. But I do miss the days when I did not have an eating disorder in my life. It's not glamorous or fun to suffer. If you do not feel sick or worthy enough to get help, that is already a sign of how much you deserve support. Not only support, but understanding. Whether you are in recovery, younger with an ed, older with an ed, or chronic, everyone deserves respect and compassion. Because this illness is not your fault",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1lt5pvj/you_wont_stop_once_you_reach_a_certain_weight/",
  "score": 126,
  "num_comments": 18,
  "comments": [
    {
      "id": "n1nrcl7",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1751820115.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1o0x58",
      "author": "nervous_veggie",
      "body": "Agreed. My heart stopped- I still didn’t.",
      "created_utc": 1751823004.0,
      "score": 24,
      "context": []
    },
    {
      "id": "n1nwg4d",
      "author": "None",
      "body": "Thank you. You hit the mark. Anorexia leaves immensely serious collateral damage that can't be talked about enough. I fainted from my heart, lost my memory, lost my concentration, looked handicapped, and went crazy. Seriously crazy, I have schizoaffective disorder that started during anorexia. I also feel pain when I pee but they told me it was an infection from the catheter they gave me in intensive care. I attempted suicide. Anorexia takes everything. I'm very sorry about your health problems, I wish I could tell you that you will overcome them but we are both in a lifeboat and we don't know what will happen tomorrow.",
      "created_utc": 1751821664.0,
      "score": 13,
      "context": []
    },
    {
      "id": "n1qjs2z",
      "author": "lostyouorsomething",
      "body": "thank you for sharing this post i’m proud of you and you’re helping so many people",
      "created_utc": 1751853068.0,
      "score": 7,
      "context": []
    },
    {
      "id": "n1pvqac",
      "author": "AvocadoElectronic247",
      "body": "Thank you so much for sharing this.",
      "created_utc": 1751844300.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n1rgya1",
      "author": "Loud-Condition-4005",
      "body": "Once I reached my initial goal weight, every single day I thought to myself “i need to restrict today because XYZ but I’ll stop tomorrow” \n\nIt was so exhausting but if I made it out, you can too",
      "created_utc": 1751867654.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n1q22yi",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1751846563.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n237k00",
      "author": "Good-Maintenance-802",
      "body": "thank you for sharing this made me cry cause i just started all in recovery and am struggling with the recovery feasting went from eating nothing to eating upwards of double the recommended daily calories and it’s been very hard because it feels like i developed bed in the 6 days i’ve been recovering but i couldn’t stand to watch my family cry anymore i couldn’t stand to live that routine anymore i couldn’t stand to not have the energy or will to get out of bed yet sunrise to sundown  overworking myself, i don’t believe this yet but i’ve got to be worth more then the number on that stupid fuckin scale i’ve gotta be worth more then maintaining this sick body hopefully we all can learn to love ourselves in our transfer from our small sick body to our temporary bigger body while we heal",
      "created_utc": 1752021347.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n1nzkz9",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1751822604.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1o1y4b",
      "author": "Coffeegreysky12",
      "body": "Yes, anorexia is a very scary illness. I am sorry for what you went through",
      "created_utc": 1751823312.0,
      "score": 5,
      "context": [
        {
          "id": "n1o0x58",
          "author": "nervous_veggie",
          "body": "Agreed. My heart stopped- I still didn’t.",
          "created_utc": 1751823004.0
        }
      ]
    },
    {
      "id": "n1nykhv",
      "author": "Coffeegreysky12",
      "body": "Thank you for sharing and I am sorry you are struggling as well. Exactly. This is such a cruel disorder. It comes with so many medical complications. Yes, the painful urination is one of the worst symptoms. Chronic pain will affect your mental health too. Therapy is helpful. I hope anyone struggling with this disorder has some type of support",
      "created_utc": 1751822301.0,
      "score": 6,
      "context": [
        {
          "id": "n1nwg4d",
          "author": "None",
          "body": "Thank you. You hit the mark. Anorexia leaves immensely serious collateral damage that can't be talked about enough. I fainted from my heart, lost my memory, lost my concentration, looked handicapped, and went crazy. Seriously crazy, I have schizoaffective disorder that started during anorexia. I also feel pain when I pee but they told me it was an infection from the catheter they gave me in intensive care. I attempted suicide. Anorexia takes everything. I'm very sorry about your health problems, I wish I could tell you that you will overcome them but we are both in a lifeboat and we don't know what will happen tomorrow.",
          "created_utc": 1751821664.0
        }
      ]
    },
    {
      "id": "n1qkbv5",
      "author": "Coffeegreysky12",
      "body": "You are welcome. I am glad this post is helpful",
      "created_utc": 1751853272.0,
      "score": 1,
      "context": [
        {
          "id": "n1qjs2z",
          "author": "lostyouorsomething",
          "body": "thank you for sharing this post i’m proud of you and you’re helping so many people",
          "created_utc": 1751853068.0
        }
      ]
    },
    {
      "id": "n1q3lsu",
      "author": "Coffeegreysky12",
      "body": "You are welcome",
      "created_utc": 1751847117.0,
      "score": 2,
      "context": [
        {
          "id": "n1pvqac",
          "author": "AvocadoElectronic247",
          "body": "Thank you so much for sharing this.",
          "created_utc": 1751844300.0
        }
      ]
    },
    {
      "id": "n1t64q9",
      "author": "Coffeegreysky12",
      "body": "Thanks",
      "created_utc": 1751897349.0,
      "score": 1,
      "context": [
        {
          "id": "n1rgya1",
          "author": "Loud-Condition-4005",
          "body": "Once I reached my initial goal weight, every single day I thought to myself “i need to restrict today because XYZ but I’ll stop tomorrow” \n\nIt was so exhausting but if I made it out, you can too",
          "created_utc": 1751867654.0
        }
      ]
    },
    {
      "id": "n1q3rie",
      "author": "Coffeegreysky12",
      "body": "Exactly. It's never enough",
      "created_utc": 1751847175.0,
      "score": 1,
      "context": [
        {
          "id": "n1q22yi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1751846563.0
        }
      ]
    },
    {
      "id": "n1r2eo0",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1751860533.0,
      "score": 1,
      "context": [
        {
          "id": "n1q22yi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1751846563.0
        }
      ]
    },
    {
      "id": "n239aml",
      "author": "Coffeegreysky12",
      "body": "You are welcome. I am glad this post is helpful to you",
      "created_utc": 1752021937.0,
      "score": 1,
      "context": [
        {
          "id": "n237k00",
          "author": "Good-Maintenance-802",
          "body": "thank you for sharing this made me cry cause i just started all in recovery and am struggling with the recovery feasting went from eating nothing to eating upwards of double the recommended daily calories and it’s been very hard because it feels like i developed bed in the 6 days i’ve been recovering but i couldn’t stand to watch my family cry anymore i couldn’t stand to live that routine anymore i couldn’t stand to not have the energy or will to get out of bed yet sunrise to sundown  overworking myself, i don’t believe this yet but i’ve got to be worth more then the number on that stupid fuckin scale i’ve gotta be worth more then maintaining this sick body hopefully we all can learn to love ourselves in our transfer from our small sick body to our temporary bigger body while we heal",
          "created_utc": 1752021347.0
        }
      ]
    },
    {
      "id": "n1r2gm7",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "This post has been removed for rule 2: Advertising isn't allowed. \n\nNOTE: The following is temporarily outdated. We will not allow surveys, self promo, or anything similar for a period of time. This is due to wanting to focus on the subreddit's community for a time before allowing such posts and comments again. Thank you for understanding. \n\nIf you would like to post something like a survey or website you created in the future, please MOD MAIL the moderators of r/AnorexiaNervosa asking for permission to post the advertisement. Please keep in mind that we won't allow it to be posted if it's a survey or similar that needs addresses and other personal information. We will prohibit things like this for the safety of the members of r/AnorexiaNervosa. \n\nPlease be sure to reread the rules of r/AnorexiaNervosa before posting again. Thank you.",
      "created_utc": 1751860556.0,
      "score": 1,
      "context": [
        {
          "id": "n1nzkz9",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1751822604.0
        }
      ]
    }
  ]
}