{
  "id": "1lxqmsh",
  "subreddit": "AnorexiaNervosa",
  "author": "ophelia_la_teigne",
  "created_utc": 1752291455.0,
  "title": "I love having low energy",
  "selftext": "Does anyone else really enjoy being low on energy because of starving? I feel like it is the only time i can actually relax. The world literally goes quiet and everything feels like a dream. I feel like it really helps me to dissociate. And i feel kinda like my head is floating and no longer connected with my body. I love it. I am addicted to it. It holds mw back from recovery, because i don't want to have more energy, i am almost afraid of it. How am i going to relax? Starving is honestly like a drug. And i am really addicted...",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1lxqmsh/i_love_having_low_energy/",
  "score": 149,
  "num_comments": 36,
  "comments": [
    {
      "id": "n2o5oz6",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1752291456.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2ob2bh",
      "author": "Coconutwatervodka",
      "body": "Not really I don’t like feeling weak \nBut it is nice feeling out of it most of the time and unfazed/numb/detached",
      "created_utc": 1752293725.0,
      "score": 46,
      "context": []
    },
    {
      "id": "n2o9d5c",
      "author": "miscexploration",
      "body": "Kind of, yeah. I feel more valid when I’m too drained to even move from bed but I’ve also gotten to the point of feeling very keenly like my body was eating itself and I might’ve been dying (better now) so just be careful.",
      "created_utc": 1752292997.0,
      "score": 21,
      "context": []
    },
    {
      "id": "n2od6zd",
      "author": "None",
      "body": "Here I am. If I feel hungry and weak I feel on the right path. This is a big problem.",
      "created_utc": 1752294676.0,
      "score": 17,
      "context": []
    },
    {
      "id": "n2odgcg",
      "author": "Glittering-Area-491",
      "body": "i relate A LOT. i dont feel justified in letting myself rest unless im literally so depleted i have no choice",
      "created_utc": 1752294794.0,
      "score": 13,
      "context": []
    },
    {
      "id": "n2p1eh1",
      "author": "not_the_cicada",
      "body": "I wrote some of the most surreal best poetic verses of my life while in this state. \n\n\nUnfortunately, I can't think to work on plot mechanics or do anything else. For myself, I noted what levels and duration it  took to get to that state, folded it up and filed that away. Like an \"in case of emergency\" provision. And then started trying to climb up and out. \n\n\nIt does suck how addictive it can be. For writing I realized I can access a similar state via sleep deprivation, I'm hesitating to recommend that haha. But also, I've been able to get there with very deep meditation as well. Maybe there are some other ways for you to access that mindset ✨",
      "created_utc": 1752307618.0,
      "score": 8,
      "context": []
    },
    {
      "id": "n2qe7hb",
      "author": "Kantian_sculpts",
      "body": "Yes - I’m getting evaluated for a possible PTSD diagnosis right now, and realise that a lot of it is that starving lets me let down some of my hypervigilance. Otherwise, I’d be on edge the entire day, stressed out of my mind.",
      "created_utc": 1752330524.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n2ozd9l",
      "author": "bb-03",
      "body": "ngl ive been experiencing dissociation prior to my ed & i usually hate the feeling. but i also have verrrry intense emotions when not restricting so i do like that it keeps me more “stable” in a sense.",
      "created_utc": 1752306442.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n2qkqs9",
      "author": "nervous_veggie",
      "body": "Not to sound unkind but this can only come from someone who doesn’t have a job or responsibilities or people that rely on them, or an active social or working life. Most people- even if they want to feel switched off and depleted (do not confuse that with true relaxation- being exhausted is not the same as being relaxed!)- cannot afford to feel that way without it having a hugely damaging impact on their life (even more damaging than the illness already has)",
      "created_utc": 1752332631.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n2p97md",
      "author": "Holly_Hobbie",
      "body": "No, sorry. I hate my constant anxiety but I also don’t enjoy feeling completely drained and lethargic.",
      "created_utc": 1752312356.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n2q9k8u",
      "author": "BasOutten",
      "body": "You know there are medications out there than can put your brain to rest without half killing you...",
      "created_utc": 1752328962.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n2ozgi8",
      "author": "Ok-Excuse-444",
      "body": "I do cus it's the only way I can relax or sit still",
      "created_utc": 1752306494.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n2xbdh6",
      "author": "Vegetable-Side8772",
      "body": "I get that bc I hate having too much energy bc mine is like nervous energy and sometimes when I am so tired I can actually focus on one thing at a time . Also it gives me a reason to chill and relax",
      "created_utc": 1752425617.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n3e8vhh",
      "author": "zodiacqu33n",
      "body": "Unfortunately so yes. I’ve heard of it as addicted to energy deficit, I believe 🙁 I think there’s a book on it!!! Super interesting concept. 💭🧠🧐",
      "created_utc": 1752642521.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n2oal5g",
      "author": "i-am-no-more994",
      "body": "Oath! I get this",
      "created_utc": 1752293517.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n2ofjpp",
      "author": "lestialstwt",
      "body": "Me too",
      "created_utc": 1752295762.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n2p0vyj",
      "author": "Last-Put-1643",
      "body": "I feel this post recovery it's been two years since I'm fine and I still get these jolts of low energy if I miss a meal ",
      "created_utc": 1752307320.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n2qgat6",
      "author": "baileyyxoxo",
      "body": "What you’re talking about is the effects of your body being in a ketosis state. This is what ppl who fast say they also experience. Quieting of the mind to hear Gods voice",
      "created_utc": 1752331213.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n2v70pl",
      "author": "bruisedbimbo",
      "body": "yesss but than your immune system goes with it:/",
      "created_utc": 1752394839.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n36pvwu",
      "author": "ImpossibleClaim6836",
      "body": "I agree with this sm. Same with those little head rushes you get any time you move 🙏🙏 tiny reminders throughout the day that I’m doing the right thing, even though ik it’s bad for me",
      "created_utc": 1752543769.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n2oyqcr",
      "author": "Queenofwands1212",
      "body": "Yeah. I relate the only time I can relax is when I have conpletler exhausted myself. Starving myself literally is an addiction to the euphoria and the emptiness and the feeling of calm. But it’s fake . It’s actually just the body giving out and reaching a level of burnout and fatigue. I feel I need to find some balance of an in between place of still being starved enough to be calm but not eat enough to feel overly energetic because that will just spiral me too",
      "created_utc": 1752306073.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n2u2hf5",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1752374762.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n30z029",
      "author": "The-true-Memelord",
      "body": "Not me. Ig I nearly always ate enough food to have energy (idk if I'm allowed to say numbers, but it was the range people often diet with (sometimes much lower, though, when I didn't count properly or was purging/compensating), extra energy, in fact, probably bc my ancient brain wanted me to search/hunt for enough food until I'm safe lol. I needed almost an hour less of sleep when I restricted.",
      "created_utc": 1752470344.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n32gnv0",
      "author": "sociallyawkward_teen",
      "body": "Not the low energy, but I did get really used to my veins being small because I was cold all of the time. It made me uncomfortable when I started sweating and being able to feel the big vein on my arm. Also that the veins in my neck and by my temples got noticeable once my blood flow increased from eating enough to help my blood pressure and increase heart rate. \n\nSomething I noticed was that I actually got used to having energy again. I reintroduced foods slowly to prevent refeeding and over the 3-6 weeks my energy levels began to go up. Not enough to tell day by day, but if I missed a meal or snack my body would go into panic mode and throw me into fatigue. This time I could tell I was tired because I hadn’t been in that state constantly, and the inability to think, smile, move as quickly etc. was no longer desirable. I didn’t desire to take naps every day because I didn’t need to. When I was restricting my eyes constantly felt like they wanted to close even if I was highly caffeinated or had slept well.   \n  \nMy therapist explained to me that your brain gets used to being in panic mode, hence why people with ed’s tend to have higher rates of anxiety, depression, suicidal thoughts, etc. It knows it can’t survive like that, so it‘s response to having no energy is to keep up a lifestyle that maintains that because energy (food) isn’t being provided. The reason you can dissociate is because you don’t have enough energy to feed your brain to do more than its basic functions. I was addicted to my ed because I didn’t have time to think about anything but food/body/numbers. It was a coping mechanism since everything in my life felt out of control and like a threat.   \nI would recommend getting a therapist just so that they can help you filter through your thoughts as you start to fuel yourself enough to think. \n\nOn the bright side, as I was able to think more, my hobbies came back! I had energy to sing in my car. I could smile without forcing it. I could engage in conversation and connect with people again. If anything, relaxation is about letting go, not silencing everything. I realized that I had also been working a ton (3 jobs) to stay busy enough that I couldn’t think about my problems. It had made me put walls up that felt “safe” but they really isolated me and stressed me out more.",
      "created_utc": 1752497669.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2ouhdz",
      "author": "blueberrybananablast",
      "body": "agreed - the mental side is good in some aspects, physical is crap",
      "created_utc": 1752303618.0,
      "score": 21,
      "context": [
        {
          "id": "n2ob2bh",
          "author": "Coconutwatervodka",
          "body": "Not really I don’t like feeling weak \nBut it is nice feeling out of it most of the time and unfazed/numb/detached",
          "created_utc": 1752293725.0
        }
      ]
    },
    {
      "id": "n3e8yz7",
      "author": "zodiacqu33n",
      "body": "I definitely have gotten to that point too. Not good!",
      "created_utc": 1752642569.0,
      "score": 2,
      "context": [
        {
          "id": "n2o9d5c",
          "author": "miscexploration",
          "body": "Kind of, yeah. I feel more valid when I’m too drained to even move from bed but I’ve also gotten to the point of feeling very keenly like my body was eating itself and I might’ve been dying (better now) so just be careful.",
          "created_utc": 1752292997.0
        }
      ]
    },
    {
      "id": "n3e905a",
      "author": "zodiacqu33n",
      "body": "Right??? I feel you. 😳",
      "created_utc": 1752642585.0,
      "score": 1,
      "context": [
        {
          "id": "n2od6zd",
          "author": "None",
          "body": "Here I am. If I feel hungry and weak I feel on the right path. This is a big problem.",
          "created_utc": 1752294676.0
        }
      ]
    },
    {
      "id": "n2oub1k",
      "author": "bigbluebelufa",
      "body": "Omg yes.",
      "created_utc": 1752303517.0,
      "score": 3,
      "context": [
        {
          "id": "n2odgcg",
          "author": "Glittering-Area-491",
          "body": "i relate A LOT. i dont feel justified in letting myself rest unless im literally so depleted i have no choice",
          "created_utc": 1752294794.0
        }
      ]
    },
    {
      "id": "n3rj565",
      "author": "Rose_theaterkid",
      "body": "Oh this makes sense, I think it may be a similar case for me actually. You just made me realize it haha.",
      "created_utc": 1752815128.0,
      "score": 1,
      "context": [
        {
          "id": "n2qe7hb",
          "author": "Kantian_sculpts",
          "body": "Yes - I’m getting evaluated for a possible PTSD diagnosis right now, and realise that a lot of it is that starving lets me let down some of my hypervigilance. Otherwise, I’d be on edge the entire day, stressed out of my mind.",
          "created_utc": 1752330524.0
        }
      ]
    },
    {
      "id": "n2qlb41",
      "author": "ophelia_la_teigne",
      "body": "Well, i don't think i can afford it, but that doesn't mean that i don't do it anyway. I am studying at university at the moment. And yes i am definitely less social than i once was.\nAnd lots of things are actually easier to do in this state, because otherwise i am on edge constantly.",
      "created_utc": 1752332810.0,
      "score": 5,
      "context": [
        {
          "id": "n2qkqs9",
          "author": "nervous_veggie",
          "body": "Not to sound unkind but this can only come from someone who doesn’t have a job or responsibilities or people that rely on them, or an active social or working life. Most people- even if they want to feel switched off and depleted (do not confuse that with true relaxation- being exhausted is not the same as being relaxed!)- cannot afford to feel that way without it having a hugely damaging impact on their life (even more damaging than the illness already has)",
          "created_utc": 1752332631.0
        }
      ]
    },
    {
      "id": "n2u621h",
      "author": "Little_Sal",
      "body": "Second this! What OP is describing sounds like a luxury that most people with jobs, families, etc don’t have.",
      "created_utc": 1752376215.0,
      "score": 2,
      "context": [
        {
          "id": "n2qkqs9",
          "author": "nervous_veggie",
          "body": "Not to sound unkind but this can only come from someone who doesn’t have a job or responsibilities or people that rely on them, or an active social or working life. Most people- even if they want to feel switched off and depleted (do not confuse that with true relaxation- being exhausted is not the same as being relaxed!)- cannot afford to feel that way without it having a hugely damaging impact on their life (even more damaging than the illness already has)",
          "created_utc": 1752332631.0
        }
      ]
    },
    {
      "id": "n3ypqeg",
      "author": "ophelia_la_teigne",
      "body": "And who said it doesn't have a damaging impact on my life",
      "created_utc": 1752914244.0,
      "score": 1,
      "context": [
        {
          "id": "n2qkqs9",
          "author": "nervous_veggie",
          "body": "Not to sound unkind but this can only come from someone who doesn’t have a job or responsibilities or people that rely on them, or an active social or working life. Most people- even if they want to feel switched off and depleted (do not confuse that with true relaxation- being exhausted is not the same as being relaxed!)- cannot afford to feel that way without it having a hugely damaging impact on their life (even more damaging than the illness already has)",
          "created_utc": 1752332631.0
        }
      ]
    },
    {
      "id": "n2ykpx2",
      "author": "ophelia_la_teigne",
      "body": "This exactly!",
      "created_utc": 1752439009.0,
      "score": 1,
      "context": [
        {
          "id": "n2xbdh6",
          "author": "Vegetable-Side8772",
          "body": "I get that bc I hate having too much energy bc mine is like nervous energy and sometimes when I am so tired I can actually focus on one thing at a time . Also it gives me a reason to chill and relax",
          "created_utc": 1752425617.0
        }
      ]
    },
    {
      "id": "n2up3vp",
      "author": "ophelia_la_teigne",
      "body": "The odd thing is, i really like feeling dizzy and like i'm about to faint...However it's all miracle to me how i manage studying for my university exams. There are next week :/",
      "created_utc": 1752384859.0,
      "score": 1,
      "context": [
        {
          "id": "n2u2hf5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1752374762.0
        }
      ]
    },
    {
      "id": "n39br6f",
      "author": "ophelia_la_teigne",
      "body": "As i said, i don't really can afford it, i have exams everyday right now and i am still doing it.",
      "created_utc": 1752586527.0,
      "score": 1,
      "context": [
        {
          "id": "n2qkqs9",
          "author": "nervous_veggie",
          "body": "Not to sound unkind but this can only come from someone who doesn’t have a job or responsibilities or people that rely on them, or an active social or working life. Most people- even if they want to feel switched off and depleted (do not confuse that with true relaxation- being exhausted is not the same as being relaxed!)- cannot afford to feel that way without it having a hugely damaging impact on their life (even more damaging than the illness already has)",
          "created_utc": 1752332631.0
        },
        {
          "id": "n2u621h",
          "author": "Little_Sal",
          "body": "Second this! What OP is describing sounds like a luxury that most people with jobs, families, etc don’t have.",
          "created_utc": 1752376215.0
        }
      ]
    },
    {
      "id": "n39ub5y",
      "author": "Little_Sal",
      "body": "Taking an exam is not equivalent to working an 8+ hour shift or parenting young children (which is a 24/7 job with no breaks). Then add on energy spent maintaining a household (chores, cleaning, repairs, yard work) as well as social commitments. None of these things (including exams) are easy while restricting, but they are not in the same ballpark in terms of difficulty.",
      "created_utc": 1752591973.0,
      "score": 2,
      "context": [
        {
          "id": "n2qkqs9",
          "author": "nervous_veggie",
          "body": "Not to sound unkind but this can only come from someone who doesn’t have a job or responsibilities or people that rely on them, or an active social or working life. Most people- even if they want to feel switched off and depleted (do not confuse that with true relaxation- being exhausted is not the same as being relaxed!)- cannot afford to feel that way without it having a hugely damaging impact on their life (even more damaging than the illness already has)",
          "created_utc": 1752332631.0
        },
        {
          "id": "n2u621h",
          "author": "Little_Sal",
          "body": "Second this! What OP is describing sounds like a luxury that most people with jobs, families, etc don’t have.",
          "created_utc": 1752376215.0
        },
        {
          "id": "n39br6f",
          "author": "ophelia_la_teigne",
          "body": "As i said, i don't really can afford it, i have exams everyday right now and i am still doing it.",
          "created_utc": 1752586527.0
        }
      ]
    },
    {
      "id": "n3a6pja",
      "author": "ophelia_la_teigne",
      "body": "I just think that it is not an expression of luxory. A mother of three kids and with a full time job could have the same experience as i do. Which of course in her situation would pose an even bigger problem and the consequences would be even worse.",
      "created_utc": 1752595435.0,
      "score": 1,
      "context": [
        {
          "id": "n2qkqs9",
          "author": "nervous_veggie",
          "body": "Not to sound unkind but this can only come from someone who doesn’t have a job or responsibilities or people that rely on them, or an active social or working life. Most people- even if they want to feel switched off and depleted (do not confuse that with true relaxation- being exhausted is not the same as being relaxed!)- cannot afford to feel that way without it having a hugely damaging impact on their life (even more damaging than the illness already has)",
          "created_utc": 1752332631.0
        },
        {
          "id": "n2u621h",
          "author": "Little_Sal",
          "body": "Second this! What OP is describing sounds like a luxury that most people with jobs, families, etc don’t have.",
          "created_utc": 1752376215.0
        },
        {
          "id": "n39br6f",
          "author": "ophelia_la_teigne",
          "body": "As i said, i don't really can afford it, i have exams everyday right now and i am still doing it.",
          "created_utc": 1752586527.0
        },
        {
          "id": "n39ub5y",
          "author": "Little_Sal",
          "body": "Taking an exam is not equivalent to working an 8+ hour shift or parenting young children (which is a 24/7 job with no breaks). Then add on energy spent maintaining a household (chores, cleaning, repairs, yard work) as well as social commitments. None of these things (including exams) are easy while restricting, but they are not in the same ballpark in terms of difficulty.",
          "created_utc": 1752591973.0
        }
      ]
    }
  ]
}