{
  "id": "1lyly58",
  "subreddit": "AnorexiaNervosa",
  "author": "Slight_Pass2148",
  "created_utc": 1752388023.0,
  "title": "is anyone else just waiting to d*3",
  "selftext": "tw: mention suicide \n\ni feel like when I first started restricting (won’t say how much) it was to just be prettier, i wasn’t ever overweight but getting into “non-american” tv shows I realized i wasn’t skinny enough. and chased it for years.\n\nnow Im kind of on and off recovery but when i’m off it I really do just think I don’t care for how I look anymore, I don’t even like the “super thin” look on me anymore, i feel like i look scary. but I do just want to di3? is anyone else using anorexia as a slow suicide method in their head?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1lyly58/is_anyone_else_just_waiting_to_d3/",
  "score": 145,
  "num_comments": 27,
  "comments": [
    {
      "id": "n2uv3nl",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1752388024.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2vxmqo",
      "author": "NamazSasz",
      "body": "Yes it‘s my suicide method of choice. The only thing that is stopping me to go all in atp are weirdly my work responsibilities. Once I‘ve quit or got fired it will be the beginning of the end for me",
      "created_utc": 1752409221.0,
      "score": 35,
      "context": []
    },
    {
      "id": "n2vkww7",
      "author": "Idkwhattocallblub",
      "body": "TW very honest language now \n\nI used to be anorexic when I was a teenager, it was about being skinny etc. Kinda what you would \"expect\" ig. Started off as a weight loss journey, a bit of sports but escalated\n\nNow I've relapsed because I just don't want to be here. I don't plan on being here in 5 years, 3 maybe ig but yeah. Gives me peace knowing i won't have to live for much longer. I think it's because I'm too scared to end it any other way so not eating it is. I'm still living at home so I'm controlling it, not losing too much but once I'll have my own place in about 5 months or something I think it will all go downhill",
      "created_utc": 1752403001.0,
      "score": 30,
      "context": []
    },
    {
      "id": "n2uy5q3",
      "author": "maberg04",
      "body": "yes, honestly. I kind of thought when I started this that I'd, well.. y'know.. 💀.. before I got to my 'gw', which is why I put it so low. I'm not in recovery and haven't been, but I feel like I look scary too. I guess this entire thing was a combination of a distraction from my life and a way to end it. But the more I go on the more I realize I might just keep living -- why is my body so stubborn, I don't know. Oh, well.",
      "created_utc": 1752389782.0,
      "score": 11,
      "context": []
    },
    {
      "id": "n2ydd9j",
      "author": "Invisible2ewe",
      "body": "I feel like it's appropriate to die that way.  Just sitting and watching life drain away.  I can't commit active suicide because my kids will never forgive me, but if I just am trying to look better and fade away in the process, can I really be labeled as dying from suicide?",
      "created_utc": 1752436845.0,
      "score": 8,
      "context": []
    },
    {
      "id": "n2w0m5e",
      "author": "EconomyChocolate7704",
      "body": "tbh yeah. im insecure of my body, but besides that, it's mostly because i just want my body to fail until i die. even if i give life a chance, it would already be too late. Maybe my organs are already failing by then",
      "created_utc": 1752410466.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n30sc6c",
      "author": "Calm_Conversation451",
      "body": "I've literally called it a slow suicide for that reason",
      "created_utc": 1752467179.0,
      "score": 7,
      "context": []
    },
    {
      "id": "n2y8onh",
      "author": "DoNotGoGentle27",
      "body": "Yes. 13 long years of waiting. It’s like my body is determined to keep going in spite of my mentality. \n\nI’ve really been underestimating the human body and its ability to keep itself alive.",
      "created_utc": 1752435459.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n37tmst",
      "author": "pessimistic_witch",
      "body": "Yes, this is why all the treatment for my ed and being told all the positives about recovery has never motivated me or made me want to change — because the end goal has always been death for me. So whenever I had professionals trying to scare me with the health consequences I never gave a shit cause it didn’t matter since my goal was/is death.",
      "created_utc": 1752560639.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n2wppl6",
      "author": "along_4_tha_ride",
      "body": "Yes.",
      "created_utc": 1752419074.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n2xqrns",
      "author": "debrayoubitch",
      "body": "I feel so confused seeing this post now because just ago so I reached the same conclusion with myself. I've attempted before and failed, and now I have responsibilities that prevent me from wanting to do anything other than self-harm. I've never been o/w but it makes me feel so much better knowing that I will not be around as long as I would have been otherwise",
      "created_utc": 1752430077.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n2y6433",
      "author": "mygwismydream",
      "body": "I experienced it both ways. In my case when ana is at its worst it is when I do not care about food/phisyque anymore, I am just tired about being alive and I wait for days to end (both I wake up waiting for the time to go to bed and I wait death). When I care about my phisyque and restrict because of that it is usually pretty better phisycally",
      "created_utc": 1752434678.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n2zdd5y",
      "author": "mouse-bites",
      "body": "I wish it every single day.",
      "created_utc": 1752448135.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n373qij",
      "author": "Realistic_Distance33",
      "body": "it is in fact a suicide method, i have tried. in recovery now. wishing you luck. if anyone needs to vent just message me!",
      "created_utc": 1752548753.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3b4wfp",
      "author": "NeedsVacation1",
      "body": "yes tired of living in disability and pain from non-ED related stuff",
      "created_utc": 1752604779.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3fyrvu",
      "author": "LowEast5246",
      "body": "Same here, well not really anymore, since I've been recovering, but yesterday idk I kinda started undereating and counting calories and I literally wanted to d*e last night. \n\nAt one point I also realized I looked terrifying, but I genuinely felt so depressed, I had a mental breakdown every single day (I'm not joking), I hated myself, I hated everyone and everything and I decided that if I don't even care anymore I'll dip my toes into recovery. Things got better fast, as I went all-in, my mood and everything. But now that I'm 3 months in, I've gotten so much better, but now that I am, Im dealing with my worst trigger again. For me that's having fun with people, and now that I'm able to do that, without thinking about food the whole time, afterwards it makes me want to engage in behaviors again, because I feel like if the others make me feel so good, I should at least look good for them, so they don't feel ashamed for hanging out with me. And since recovery my weight-insecurity somewhat got better, I have started nit-picking at my face to the point where I can hardly look into a mirror without feeling discomfort",
      "created_utc": 1752672458.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3wfdhx",
      "author": "c0b41tm1dn1ght",
      "body": "Yeah that's exactly exactly me about 10 months ago, but since then I've been in recovery. The only part that made this possible is probably my boyfriend (we weren't dating until about 6 months ago) but he stuck with me through so much and we give each other a reason to live. I hope he knows how much I love and appreciate him and all the time he's spent with me and every word he's ever said to me. \n\n\nI truly believe you can recover like I did. Finding a person that you know you can rely on for support and kindness but also honesty when you're doing worse so you're aware that you need to lock in is extremely important. This person should help you explore your interests and yourself as a whole, because they might not be there forever. But the things you learned from them will remain.",
      "created_utc": 1752878587.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n439dan",
      "author": "colorfulbrawl",
      "body": "Yes, and i’ve never seen anyone say it before.\nThank you for sharing… it makes me feel less alone.",
      "created_utc": 1752973356.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n46ybt8",
      "author": "ClNNAMONROLL",
      "body": "when it first began i could not conceive of the idea that I would fall down that path--where suicide felt easier than living in this body and enduring the chaotic stream of thoughts and emotions my mind was swimming in. ive now come to find that feeling far too familiar. it's not even about the weight or body image anymore. It's a perpetual spiral of regressing into my ed and forgetting the physical aspect of it all. I'm just. in my head and whatever ends up happening is practically inconceivable. i don't really have an \"aim\" or \"goal\" anymore; i'm just living with my ed as it drives me further and further towards my body's surrender mark",
      "created_utc": 1753030513.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n2yoi34",
      "author": "Glittering-Eye-3435",
      "body": "U wanna d3 because ur hungry hope that helps",
      "created_utc": 1752440129.0,
      "score": -4,
      "context": []
    },
    {
      "id": "n4iqd4z",
      "author": "CodApprehensive8553",
      "body": "im so sorry, I cant imagine what you must be going through to consider leaving your family. I hope you realise your worth in this world",
      "created_utc": 1753190054.0,
      "score": 1,
      "context": [
        {
          "id": "n2ydd9j",
          "author": "Invisible2ewe",
          "body": "I feel like it's appropriate to die that way.  Just sitting and watching life drain away.  I can't commit active suicide because my kids will never forgive me, but if I just am trying to look better and fade away in the process, can I really be labeled as dying from suicide?",
          "created_utc": 1752436845.0
        }
      ]
    },
    {
      "id": "n3e9gm9",
      "author": "zodiacqu33n",
      "body": "The way this is so sad but true 🤦🏼‍♀️",
      "created_utc": 1752642812.0,
      "score": 2,
      "context": [
        {
          "id": "n2w0m5e",
          "author": "EconomyChocolate7704",
          "body": "tbh yeah. im insecure of my body, but besides that, it's mostly because i just want my body to fail until i die. even if i give life a chance, it would already be too late. Maybe my organs are already failing by then",
          "created_utc": 1752410466.0
        }
      ]
    },
    {
      "id": "n2ykbik",
      "author": "Slight_Pass2148",
      "body": "i feel you, it’s frustrating like how has this been going on since i was 9 and im still alive? but at the same time it’s comforting to know ill ATLEAST not live AS LONG as most",
      "created_utc": 1752438893.0,
      "score": 3,
      "context": [
        {
          "id": "n2y8onh",
          "author": "DoNotGoGentle27",
          "body": "Yes. 13 long years of waiting. It’s like my body is determined to keep going in spite of my mentality. \n\nI’ve really been underestimating the human body and its ability to keep itself alive.",
          "created_utc": 1752435459.0
        }
      ]
    },
    {
      "id": "n3yiekz",
      "author": "SushiAndKetamine",
      "body": "Holy shit. The former describes exactly where I am right now. Just waiting.",
      "created_utc": 1752910095.0,
      "score": 1,
      "context": [
        {
          "id": "n2y6433",
          "author": "mygwismydream",
          "body": "I experienced it both ways. In my case when ana is at its worst it is when I do not care about food/phisyque anymore, I am just tired about being alive and I wait for days to end (both I wake up waiting for the time to go to bed and I wait death). When I care about my phisyque and restrict because of that it is usually pretty better phisycally",
          "created_utc": 1752434678.0
        }
      ]
    },
    {
      "id": "n3ccv6m",
      "author": "Slight_Pass2148",
      "body": "ed almost feels like an escape sadly",
      "created_utc": 1752617389.0,
      "score": 3,
      "context": [
        {
          "id": "n3b4wfp",
          "author": "NeedsVacation1",
          "body": "yes tired of living in disability and pain from non-ED related stuff",
          "created_utc": 1752604779.0
        }
      ]
    },
    {
      "id": "n2ze86j",
      "author": "Slight_Pass2148",
      "body": "you can’t really say that because you don’t know me as a person, even when in recovery when i’m not hungry i still do hope to die. not because i’m hungry, i know exactly why but I also know not to include that in this post as it would take away from my main point",
      "created_utc": 1752448426.0,
      "score": 10,
      "context": [
        {
          "id": "n2yoi34",
          "author": "Glittering-Eye-3435",
          "body": "U wanna d3 because ur hungry hope that helps",
          "created_utc": 1752440129.0
        }
      ]
    },
    {
      "id": "n4aaic7",
      "author": "mygwismydream",
      "body": "Yes I mean, I know it is awful, but at the same time it is also some kind of peaceful",
      "created_utc": 1753071530.0,
      "score": 2,
      "context": [
        {
          "id": "n2y6433",
          "author": "mygwismydream",
          "body": "I experienced it both ways. In my case when ana is at its worst it is when I do not care about food/phisyque anymore, I am just tired about being alive and I wait for days to end (both I wake up waiting for the time to go to bed and I wait death). When I care about my phisyque and restrict because of that it is usually pretty better phisycally",
          "created_utc": 1752434678.0
        },
        {
          "id": "n3yiekz",
          "author": "SushiAndKetamine",
          "body": "Holy shit. The former describes exactly where I am right now. Just waiting.",
          "created_utc": 1752910095.0
        }
      ]
    }
  ]
}