{
  "id": "1m35blf",
  "subreddit": "AnorexiaNervosa",
  "author": "randomthings124",
  "created_utc": 1752852392.0,
  "title": "Did anyone here go from overweight to anorexic?",
  "selftext": "",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1m35blf/did_anyone_here_go_from_overweight_to_anorexic/",
  "score": 131,
  "num_comments": 70,
  "comments": [
    {
      "id": "n3tyvmc",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1752852393.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3ubb5q",
      "author": "Sunnivat",
      "body": "yup. started as a deire to lose weight for health reasons and then i found myself unable to stop wanting to lose",
      "created_utc": 1752855900.0,
      "score": 77,
      "context": []
    },
    {
      "id": "n3udcr3",
      "author": "mushroomstew32",
      "body": "“Obese class 1” to severely underweight. I don’t need to tell you which got more care, compassion and attention. I think it’s interesting cause I look like the stereotype now but I have the lived experience, YEARS worth of bigotry and discrimination and the loose skin to prove it. But whenever I try to talk about it and how much living in that body once impacts me still to this day,, I get written off?? because of the body I happen to inhabit now?? As if it never happened? As if my privilege now erases the formative years I spent being marginalised? It’s odd and hard to describe idk, I’m not doing it justice please if you’ve experienced this too reply to this and phrase it better than me lmao",
      "created_utc": 1752856494.0,
      "score": 100,
      "context": []
    },
    {
      "id": "n3tzwwm",
      "author": "jeffwingerslexus",
      "body": "No but I went from anorexic to overweight lol",
      "created_utc": 1752852680.0,
      "score": 80,
      "context": []
    },
    {
      "id": "n3u33y9",
      "author": "Electrical_Lemon_385",
      "body": "i was obese",
      "created_utc": 1752853569.0,
      "score": 30,
      "context": []
    },
    {
      "id": "n3u3m1w",
      "author": "WannabeThinLeah",
      "body": "I did. I was a normal weight child until about age 8-9 when I started getting heavier, then I got really insecure at age eleven and became anorexic. Now I’m older and gained a bit of weight back, my parents say I’m healthy but I feel overweight again.",
      "created_utc": 1752853709.0,
      "score": 21,
      "context": []
    },
    {
      "id": "n3u6opt",
      "author": "magistratemiki",
      "body": "Yes.\nI was UW as a child-- but praised for it, father made comments about my body constantly, etc etc... \nDue to A LOT of factors, I ended up being obese as a young adult instead. Something inside me snapped and I had AN by the end of age 21",
      "created_utc": 1752854577.0,
      "score": 17,
      "context": []
    },
    {
      "id": "n3uv3bp",
      "author": "DangerousPride",
      "body": "I was fat all of my life and in my teen years I was morbidly obese. It started off just wanting to lose weight but the validation I got from people getting skinnier combined with my need for control really solidified things.",
      "created_utc": 1752861434.0,
      "score": 8,
      "context": []
    },
    {
      "id": "n3w3rnv",
      "author": "_InvisibleGirl_",
      "body": "I went from normal weight, to overweight, to anorexic,  to obese, to anorexic,  back to obese (almost morbidly obese) and back to anorexic.\n\nIt is safe to say, my skin did not survive the journey. \n\nI think I *may* have some problems with food?!",
      "created_utc": 1752874736.0,
      "score": 9,
      "context": []
    },
    {
      "id": "n3uv6iz",
      "author": "luminous_hallway",
      "body": "Sort of. I was always UW as a child and dealt with anorexia around 12, on and off for years, due to insecurity. When I became an adult, I got put on numerous different medications that caused me to become overweight, which led to a relapse.",
      "created_utc": 1752861459.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n3u2wt9",
      "author": "definitelytheproblem",
      "body": "Yes. I was morbidly obese and went through weight loss surgery a few years ago. Had various EDs throughout my life that resulted in years of yo-yo dieting but after the surgery, once I hit the GW my surgeons gave me after a few months, unfortunately it was the first time I truly felt in control of my weight and I just kept going. So now I’m UW and diagnosed AN and finding it very hard to regain to a healthy weight because I had >!the vast majority of my stomach removed!< from the weight loss surgery",
      "created_utc": 1752853513.0,
      "score": 12,
      "context": []
    },
    {
      "id": "n3ulcl9",
      "author": "felisfluffica",
      "body": "when i was with my abusive family i became overweight because food was the only thing that wouldn’t make my mother angry and i would eat more than i wanted to keep that peace going. and when i left something snapped and i wanted to be hungry and get away from all those feelings of fullness",
      "created_utc": 1752858727.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n3vpmwh",
      "author": "likpinklady",
      "body": "Yeah. My BMI was 42",
      "created_utc": 1752870432.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n3xc428",
      "author": "Worried_Brilliant939",
      "body": "Yeah. Class III obese to severely underweight. Havent been above the low normal end of normal BMI since getting sick, even in remission periods. It completely ruined my life.",
      "created_utc": 1752890395.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n3ylowl",
      "author": "None",
      "body": "I had a drug addiction years ago (to cope w/ domestic/workplace violence, drown out my ED etc) and developed schizophrenia. I was suicidal and had hallucinations/psychosis from drug withdrawals. I'd had anorexia episode(s) which involved compulsive exercise/chronic restriction, workaholism, I was high and didn't care about food/\"forgot\" etc or Id just eat peanut butter out of jars/random junk food. I had a break down, couldn't work and was heavily medicated w/ antipsychotics and neuroleptics/epilepsy drugs- I gained a lot of weight (it didn't register- I think I was bullied/it translated strangely), my metabolism slowed. I was a vegetable. I was almost put in a psych ward in early 2009 and administered regular Clozapine injections. I was given a tour and said no/terminated treatment. I was oblivious/in denial and not mentally recovered. Sorry sort of opposite response to your question, this was in 2007-2009. I have struggled w/ compulsive spending and online dating/swiping culture for years. I was diagnosed w/ AuDHD a few months ago",
      "created_utc": 1752911950.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n3ui2rb",
      "author": "Icy-Lettuce-8944",
      "body": "you can be overweight and have anorexia",
      "created_utc": 1752857820.0,
      "score": 11,
      "context": []
    },
    {
      "id": "n3u7rbj",
      "author": "WairyFings4",
      "body": "Yes i was definitely overweight from around 9 years old, then aged 13 copied my mums dieting habits and it spiralled out of control into AN quite quickly for me.",
      "created_utc": 1752854884.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n3ufrk4",
      "author": "fineok_17",
      "body": "I kinda did. I was really small and underweight as a kid and when I got to middle school I was overweight and then junior year of high school I joined track and lost a lot of weight and pretty much when my anorexia started. Now I can barely maintain being on the lower end of a healthy weight",
      "created_utc": 1752857184.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n3urc9q",
      "author": "CommunistBarabbas",
      "body": "i was obese class 3,",
      "created_utc": 1752860404.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n3ve9gj",
      "author": "whointarnationcares",
      "body": "It’s amazing the whiplash you get from treatment when you go between the two and it shows on your outward appearance.",
      "created_utc": 1752867067.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n3viehn",
      "author": "i-got-bored69",
      "body": "yup. my relationship w food is abt the same as what is was when i was overweight - but ppl only care now bcs im UW. fucking sucks",
      "created_utc": 1752868299.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n3vk4tb",
      "author": "Unusual-Egg-98",
      "body": "I went from overweight to underweight and recovered back to overweight",
      "created_utc": 1752868811.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n3v3r36",
      "author": "Classic-Tale-9278",
      "body": "Yep started after a pretty ruff relationship trying to get my life in order to a very unhealthy way.",
      "created_utc": 1752863963.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3v6km5",
      "author": "Satan-gives-boba997",
      "body": "Yes, I was a bit overweight in my early teens, 4 years later severely underweight and anemic.",
      "created_utc": 1752864785.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3w5mxf",
      "author": "hangry_witch",
      "body": "Yes",
      "created_utc": 1752875329.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3wqsie",
      "author": "hubby-honey-bunny",
      "body": "i did but all it dod was show my bones more but i still was overweight, im getting better at eating so after all those years ive gained about 20 ish pounds",
      "created_utc": 1752882497.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3x73ru",
      "author": "MizzPizz",
      "body": "I did, but I was only 15lns over my bmi",
      "created_utc": 1752888495.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3ybbiw",
      "author": "celeste173",
      "body": "yes. despite the dsm-5’s outdated definition , anorexia isnt limited to those w low bmi. \nthat being said, i developed anorexia when i was overweight. I was never technically underweight but the bmi is a terrible metric made to generalize english men. I gained basically all that weight back in recovery. I am living in hell",
      "created_utc": 1752906203.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3uqc1q",
      "author": "Throw_me_Away256",
      "body": "I went from being underweight to overweight. I went on a weightloss journey and have relapsed and still currently in it again",
      "created_utc": 1752860112.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3uvrw7",
      "author": "Visible_Blood_4813",
      "body": "I was an average weight as a child, developed very disordered eating  and eventually an eating disorder as a teenager / young adult. Then due to comorbid issues I went on psych meds and became very overweight. Recently relapsed and lost a lot again. Apparently a fair amount of us can flip between restriction and overeating over the years",
      "created_utc": 1752861629.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3v4zvt",
      "author": "Desperate_Front9792",
      "body": "Went from obese to a hair over “severely underweight” (per my doctor) and back up to the lower end of obese.",
      "created_utc": 1752864326.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3vxgml",
      "author": "New_General4192",
      "body": "Yeah. i weighed myself at 14 and realised i was overweight (i never used to weigh myself). it scared me to realise that i was medically considered overweight, and that started a diet that started my ed. i was underweight after 4-5 months, which got me a lot of weight loss compliments unfortunately.",
      "created_utc": 1752872755.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3w81yz",
      "author": "Ok_Lingonberry6957",
      "body": "i was a very skinny child that gained weight during puberty which is when i first remember becoming disordered. in highschool i became borderline obese from birth control and the scrutiny i received from my weight gain made me relapse.",
      "created_utc": 1752876109.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3xteto",
      "author": "individual_ljgt",
      "body": "Yep. Was insane, at first getting praise until they noticed it kept falling off. Ibremeber the worried looks I got from my teachers as it got worse. All of a sudden I was 'unhealthy again",
      "created_utc": 1752897479.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3xuq0h",
      "author": "manic-fairy",
      "body": "I cycle back and fourth",
      "created_utc": 1752898060.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3xv414",
      "author": "psychedelic666",
      "body": "Yes",
      "created_utc": 1752898234.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3xvxh1",
      "author": "bibedibabedibum",
      "body": "Yup and it all happened last year in a very short time. I'm still at the lowest i got and there's two sides arguing within;one part wants to go to sick levels of uw to prove something and other part realizes that even current weight isn't sustainable for my lifestyle and activity level and wishes to grow big&muscular instead, even if it means ow.\n\n\nThe thing is this is the common experience that NOW i suddenly get romantic/sexual attention, people call me attractive and even friendshipmaking is much easier, looking skinny. I fucking hate this dissonance that i still hate myself like before weightloss and am severely depressed but get positive attention because of ana, it really cements one to it.",
      "created_utc": 1752898600.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3y08n3",
      "author": "Shuyuya",
      "body": "Never been overweight",
      "created_utc": 1752900572.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3yafs3",
      "author": "Confident-Owl8388",
      "body": "ye",
      "created_utc": 1752905730.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3ycwlw",
      "author": "winby_losing",
      "body": "Workin on it! Jk\n\nI am overweight and anorexic. It happens. Yay me.",
      "created_utc": 1752907058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3yi7l9",
      "author": "doomandgloomm",
      "body": "I was over weight, then anorexic, then now overweight again. Im trying super hard not to slip into old patterns but its incredibly hard.",
      "created_utc": 1752909987.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3yrakg",
      "author": "After_Shock8059",
      "body": "Yep I did… what started as cutting out a few carbs and exercising to lose some weight and become a bit more healthy and happy turned into an obsession and a never ending desire to lose weight",
      "created_utc": 1752915124.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3z7w2v",
      "author": "tot3bagbarista",
      "body": "Yup! I’ve been overweight my entire life and when my ana began, I was at my heaviest (considered obese on the BMI scale) and now i’m on the lower end of “healthy weight”. It’s hard to let go of ana when she’s given me something I’ve been trying for and wanting my entire life.",
      "created_utc": 1752924058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n40etu3",
      "author": "AerienaFairweather",
      "body": "I fluctuate from quite overweight borderline obese to fairly healthy looking to very overweight again. Currently very overweight and the fact I’m in here shows where I’m headed again",
      "created_utc": 1752939431.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n40w464",
      "author": "ThrowRA-sicksad",
      "body": "I was anorexic on and off the whole time I was overweight too, but I struggled with BED too.\n\nAfter I had WLS I strayed too far at times into restricting. I’ve never been underweight and I’m happy where I’m at, but everytime the scale goes up, I panic",
      "created_utc": 1752944827.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4bqnvm",
      "author": "FallMedical",
      "body": "Yuppppp",
      "created_utc": 1753098872.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4fi3tc",
      "author": "Evening-Affect6091",
      "body": "yeah i was really overweight. then as time went on and things in my life were going downhill i started using the weight lose as a form of control and coping. been stuck in this for 8 years now.",
      "created_utc": 1753139654.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4io0e4",
      "author": "sunflowerforlife100",
      "body": "Yup, I was considering being obese and when I started to lose weight due to health issues such as high blood pressure and joint pain I got so many compliments and then it went out hills very quickly and people started to say I was too thin but I couldn't see it. I looked like a 12 y/o when I was 18 ☠️",
      "created_utc": 1753189262.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3ukroy",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1752858565.0,
      "score": 0,
      "context": []
    },
    {
      "id": "n3uc8n2",
      "author": "Rhyme_orange_",
      "body": "Same here. I started restricting in sixth grade, then had issues binging that was a natural consequence to restricting in high school. Went on a diet for the better part of a year and lost x pounds. Have been all over the place in terms of weight but have always had AN in one shape or another.",
      "created_utc": 1752856169.0,
      "score": 12,
      "context": [
        {
          "id": "n3ubb5q",
          "author": "Sunnivat",
          "body": "yup. started as a deire to lose weight for health reasons and then i found myself unable to stop wanting to lose",
          "created_utc": 1752855900.0
        }
      ]
    },
    {
      "id": "n3u17h7",
      "author": "Historical_Ad4804",
      "body": "Glad I’m not alone 🤣",
      "created_utc": 1752853040.0,
      "score": 23,
      "context": [
        {
          "id": "n3tzwwm",
          "author": "jeffwingerslexus",
          "body": "No but I went from anorexic to overweight lol",
          "created_utc": 1752852680.0
        }
      ]
    },
    {
      "id": "n3uwihj",
      "author": "yonah94",
      "body": "Me too",
      "created_utc": 1752861842.0,
      "score": 2,
      "context": [
        {
          "id": "n3tzwwm",
          "author": "jeffwingerslexus",
          "body": "No but I went from anorexic to overweight lol",
          "created_utc": 1752852680.0
        }
      ]
    },
    {
      "id": "n3xku0s",
      "author": "haybails720",
      "body": "Wait stop we are literally the exact person down to the ages😭this is so freaky",
      "created_utc": 1752893838.0,
      "score": 2,
      "context": [
        {
          "id": "n3u3m1w",
          "author": "WannabeThinLeah",
          "body": "I did. I was a normal weight child until about age 8-9 when I started getting heavier, then I got really insecure at age eleven and became anorexic. Now I’m older and gained a bit of weight back, my parents say I’m healthy but I feel overweight again.",
          "created_utc": 1752853709.0
        }
      ]
    },
    {
      "id": "n3u6wvc",
      "author": "magistratemiki",
      "body": "I'm finally doing trauma informed therapy and learning why all of these things happened and why I reacted to them the way I did, and trying to get healthy now.",
      "created_utc": 1752854642.0,
      "score": 5,
      "context": [
        {
          "id": "n3u6opt",
          "author": "magistratemiki",
          "body": "Yes.\nI was UW as a child-- but praised for it, father made comments about my body constantly, etc etc... \nDue to A LOT of factors, I ended up being obese as a young adult instead. Something inside me snapped and I had AN by the end of age 21",
          "created_utc": 1752854577.0
        }
      ]
    },
    {
      "id": "n3vh14f",
      "author": "maracujadodo",
      "body": "this is in some way similar to my story! i was UW until my mid teens, everyone was worried about me and then up until a few months ago i was overweight, also anorexic now",
      "created_utc": 1752867896.0,
      "score": 2,
      "context": [
        {
          "id": "n3u6opt",
          "author": "magistratemiki",
          "body": "Yes.\nI was UW as a child-- but praised for it, father made comments about my body constantly, etc etc... \nDue to A LOT of factors, I ended up being obese as a young adult instead. Something inside me snapped and I had AN by the end of age 21",
          "created_utc": 1752854577.0
        }
      ]
    },
    {
      "id": "n3w3xna",
      "author": "randomthings124",
      "body": "What about the skin?",
      "created_utc": 1752874788.0,
      "score": 2,
      "context": [
        {
          "id": "n3w3rnv",
          "author": "_InvisibleGirl_",
          "body": "I went from normal weight, to overweight, to anorexic,  to obese, to anorexic,  back to obese (almost morbidly obese) and back to anorexic.\n\nIt is safe to say, my skin did not survive the journey. \n\nI think I *may* have some problems with food?!",
          "created_utc": 1752874736.0
        }
      ]
    },
    {
      "id": "n3uw1lv",
      "author": "Skythebluestars",
      "body": "this! My metabloism sucked bc of meds. So i gained easier. I got  overweight. And i relapsed again.",
      "created_utc": 1752861707.0,
      "score": 4,
      "context": [
        {
          "id": "n3uv6iz",
          "author": "luminous_hallway",
          "body": "Sort of. I was always UW as a child and dealt with anorexia around 12, on and off for years, due to insecurity. When I became an adult, I got put on numerous different medications that caused me to become overweight, which led to a relapse.",
          "created_utc": 1752861459.0
        }
      ]
    },
    {
      "id": "n3w0y08",
      "author": "randomthings124",
      "body": "How do u feel now?",
      "created_utc": 1752873834.0,
      "score": 2,
      "context": [
        {
          "id": "n3vpmwh",
          "author": "likpinklady",
          "body": "Yeah. My BMI was 42",
          "created_utc": 1752870432.0
        }
      ]
    },
    {
      "id": "n3us0om",
      "author": "AnonymousVolcano",
      "body": "Yeah, atypical an is really does suck",
      "created_utc": 1752860567.0,
      "score": 8,
      "context": [
        {
          "id": "n3ui2rb",
          "author": "Icy-Lettuce-8944",
          "body": "you can be overweight and have anorexia",
          "created_utc": 1752857820.0
        }
      ]
    },
    {
      "id": "n3vih9x",
      "author": "Choudhar946340",
      "body": "this ⬆",
      "created_utc": 1752868322.0,
      "score": 5,
      "context": [
        {
          "id": "n3ui2rb",
          "author": "Icy-Lettuce-8944",
          "body": "you can be overweight and have anorexia",
          "created_utc": 1752857820.0
        }
      ]
    },
    {
      "id": "n3vqq4p",
      "author": "Odd-Patient-2093",
      "body": "No you can't ,being anorexic means your underweight",
      "created_utc": 1752870752.0,
      "score": -12,
      "context": [
        {
          "id": "n3ui2rb",
          "author": "Icy-Lettuce-8944",
          "body": "you can be overweight and have anorexia",
          "created_utc": 1752857820.0
        }
      ]
    },
    {
      "id": "n3uql93",
      "author": "AnorexiaNervosa-ModTeam",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1752860184.0,
      "score": 1,
      "context": [
        {
          "id": "n3ukroy",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1752858565.0
        }
      ]
    },
    {
      "id": "n3uspff",
      "author": "GozzolanBlue42",
      "body": "I went from overweight to anorexic then had a baby and am now borderline obese and I’m only 18 😭😭",
      "created_utc": 1752860759.0,
      "score": 16,
      "context": [
        {
          "id": "n3tzwwm",
          "author": "jeffwingerslexus",
          "body": "No but I went from anorexic to overweight lol",
          "created_utc": 1752852680.0
        },
        {
          "id": "n3u17h7",
          "author": "Historical_Ad4804",
          "body": "Glad I’m not alone 🤣",
          "created_utc": 1752853040.0
        }
      ]
    },
    {
      "id": "n3v167c",
      "author": "nervous_veggie",
      "body": "I’m so pleased to read that, I think that’s so important and super glad that you’re in the place where you can engage with that type of support xx",
      "created_utc": 1752863204.0,
      "score": 2,
      "context": [
        {
          "id": "n3u6opt",
          "author": "magistratemiki",
          "body": "Yes.\nI was UW as a child-- but praised for it, father made comments about my body constantly, etc etc... \nDue to A LOT of factors, I ended up being obese as a young adult instead. Something inside me snapped and I had AN by the end of age 21",
          "created_utc": 1752854577.0
        },
        {
          "id": "n3u6wvc",
          "author": "magistratemiki",
          "body": "I'm finally doing trauma informed therapy and learning why all of these things happened and why I reacted to them the way I did, and trying to get healthy now.",
          "created_utc": 1752854642.0
        }
      ]
    },
    {
      "id": "n3vh2di",
      "author": "maracujadodo",
      "body": "good luck <3",
      "created_utc": 1752867906.0,
      "score": 2,
      "context": [
        {
          "id": "n3u6opt",
          "author": "magistratemiki",
          "body": "Yes.\nI was UW as a child-- but praised for it, father made comments about my body constantly, etc etc... \nDue to A LOT of factors, I ended up being obese as a young adult instead. Something inside me snapped and I had AN by the end of age 21",
          "created_utc": 1752854577.0
        },
        {
          "id": "n3u6wvc",
          "author": "magistratemiki",
          "body": "I'm finally doing trauma informed therapy and learning why all of these things happened and why I reacted to them the way I did, and trying to get healthy now.",
          "created_utc": 1752854642.0
        }
      ]
    },
    {
      "id": "n42ck8y",
      "author": "_InvisibleGirl_",
      "body": "It's lost elasticity from repeated gaining and losing, plus really deep set stretch marks. My skin will never shrink back to how it was, that body is gone forever. The stretch marks aren't just surface colour, they are like really deep wrinkles gouged in the loose skin. I have the thighs of a 90 year old. Ironically I acknowledge I would look better if I gained some weight back to pad out the skin a bit.",
      "created_utc": 1752961617.0,
      "score": 1,
      "context": [
        {
          "id": "n3w3rnv",
          "author": "_InvisibleGirl_",
          "body": "I went from normal weight, to overweight, to anorexic,  to obese, to anorexic,  back to obese (almost morbidly obese) and back to anorexic.\n\nIt is safe to say, my skin did not survive the journey. \n\nI think I *may* have some problems with food?!",
          "created_utc": 1752874736.0
        },
        {
          "id": "n3w3xna",
          "author": "randomthings124",
          "body": "What about the skin?",
          "created_utc": 1752874788.0
        }
      ]
    },
    {
      "id": "n3v16kb",
      "author": "luminous_hallway",
      "body": "It’s so frustrating. I’m sorry you had to go through that as well.",
      "created_utc": 1752863208.0,
      "score": 2,
      "context": [
        {
          "id": "n3uv6iz",
          "author": "luminous_hallway",
          "body": "Sort of. I was always UW as a child and dealt with anorexia around 12, on and off for years, due to insecurity. When I became an adult, I got put on numerous different medications that caused me to become overweight, which led to a relapse.",
          "created_utc": 1752861459.0
        },
        {
          "id": "n3uw1lv",
          "author": "Skythebluestars",
          "body": "this! My metabloism sucked bc of meds. So i gained easier. I got  overweight. And i relapsed again.",
          "created_utc": 1752861707.0
        }
      ]
    },
    {
      "id": "n3wipdv",
      "author": "AnonymousVolcano",
      "body": "It’s not determined by your weight, it’s determined by the way you think and act. The illness itself is a mental eating disorder. Being underweight is common due to the nature of the disorder, but it’s not a requirement. It’s a diagnosis, not a number on the scale.",
      "created_utc": 1752879737.0,
      "score": 4,
      "context": [
        {
          "id": "n3ui2rb",
          "author": "Icy-Lettuce-8944",
          "body": "you can be overweight and have anorexia",
          "created_utc": 1752857820.0
        },
        {
          "id": "n3vqq4p",
          "author": "Odd-Patient-2093",
          "body": "No you can't ,being anorexic means your underweight",
          "created_utc": 1752870752.0
        }
      ]
    },
    {
      "id": "n3w0at0",
      "author": "sad-rad-grad",
      "body": "not at all what it means lol all the updated literature says that weight is not an indicator of an eating disorder. it’s not a mental disorder, not a weight disorder.",
      "created_utc": 1752873631.0,
      "score": 4,
      "context": [
        {
          "id": "n3ui2rb",
          "author": "Icy-Lettuce-8944",
          "body": "you can be overweight and have anorexia",
          "created_utc": 1752857820.0
        },
        {
          "id": "n3vqq4p",
          "author": "Odd-Patient-2093",
          "body": "No you can't ,being anorexic means your underweight",
          "created_utc": 1752870752.0
        }
      ]
    },
    {
      "id": "n3v0y4i",
      "author": "nervous_veggie",
      "body": "Your body grew a whole human being! Give it some grace 💜",
      "created_utc": 1752863138.0,
      "score": 24,
      "context": [
        {
          "id": "n3tzwwm",
          "author": "jeffwingerslexus",
          "body": "No but I went from anorexic to overweight lol",
          "created_utc": 1752852680.0
        },
        {
          "id": "n3u17h7",
          "author": "Historical_Ad4804",
          "body": "Glad I’m not alone 🤣",
          "created_utc": 1752853040.0
        },
        {
          "id": "n3uspff",
          "author": "GozzolanBlue42",
          "body": "I went from overweight to anorexic then had a baby and am now borderline obese and I’m only 18 😭😭",
          "created_utc": 1752860759.0
        }
      ]
    }
  ]
}