{
  "id": "1m55dq8",
  "subreddit": "AnorexiaNervosa",
  "author": "Bo_Is_A_Loser",
  "created_utc": 1753059685.0,
  "title": "I was/am a popular ana blogger; it's cancer.",
  "selftext": "The worst thing that ever happened to me wasn't the brain damage or psychosis; it was being considered 'thnspo'.\n\nBack in the spring of last year it really started happening, I remember vividly scrolling on tumblr next to my friend in bed and seeing myself in one of those collages. It felt so surreal, all of my disorder feels so surreal to me. Like if I turned the screen off it would all go away. \n\nBut of course, that's not true. I've ruined my life in a way now I don't even know fully. The end of junior year, I was under medical supervision (you guys know, weekly weigh ins, threats of the tube) and I got my biggest (by follower count) ban on tumblr. I had a doctor's appointment later the next day, I hadn't been in school for weeks because of how sick I had gotten, I closed my labtop and crawled outside. I remember laying in the grass, touching my knees together but not my thighs and wondering why I was still sick. Why wasn't it going away? I hated this, I hated living in it, so, I went back on the computer and made a new account.\n\nThose pictures of me and people begging to have the body that I have but never the life that comes with it, will probably live longer than me. If you use EDBLR it's a huge mistake. I regret digitizing my disorder but, if you ever wondered what being famous feels like, it feels like nothing. Because you are an anorexic. Nothing will ever feel like anything for you. \n\nI've come to terms that I am not one of the ones that will ever get better. She's like a tumor to me. I am eighteen and entering college now, I have a job I can only work for ten hours stretched across two days, I can't shower standing up and I've long forgotten what most food tastes like. In these brief moments of lucidity, I really just mourn the life I could have had, and I only have myself to blame. I never wanted to be thin as a little boy, I wanted to be an artist, an activist, he is the one I feel most guilty for disappointing. The view from halfway down is really sobering. \n\nThank you for letting me bellyache :,D i dont have access to therapy ",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/1m55dq8/i_wasam_a_popular_ana_blogger_its_cancer/",
  "score": 188,
  "num_comments": 12,
  "comments": [
    {
      "id": "n49ge4h",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/4jyQ7Zfr9P \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1753059685.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4a2nol",
      "author": "dave_ebubbles",
      "body": "If you're open to advice (if not, disregard): >!one step you can make in the right direction is deleting your accounts if you haven't already. EDtwt, EDblr, EDtok, all of them. At minimum deactivate or never login again. I'm sure you've made real connections with some people there. However, ultimately, it is dragging/will drag you *and* others down further into your/their disorder.!<\n\n>!Speaking from experience and I don't mean to be rude when I say this, but therapy will only go so far even when you do have access to it, particularly if you are severely malnourished. You have to decide you want change and take steps to implement that change. Nobody else can make you get better. I think it is very urgent that you look within and try to see what is truly important to you so you feel that you can take those steps.!<\n\n>!Family? Friends? The activism? Being an artist like you wrote? Anorexia will take everything you have until you have nothing left to give. It really is like a tumor. It's addicting, it's comforting, but it will sink its teeth in you and suck the life out of you. But you have the power to change everything - yet you need to reach out for help and *also* accept that help.!<\n\nDo NOT give up. You have your whole life ahead of you. It's true that the Internet is forever and that these pictures may never be taken down. It's also true that having an ED account on any form of social media is a terrible idea and a mistake. That does not mean you cannot recover, nor that you cannot move past your mistakes. You deserve to be able to pursue the future you want. You deserve a life free from anorexia. You deserve to be happy. \n\nAgain, I apologize if this was just a vent and you were not seeking any advice/comments.",
      "created_utc": 1753068169.0,
      "score": 51,
      "context": []
    },
    {
      "id": "n4aj2bm",
      "author": "Anabundanceofbunda",
      "body": "Delete your Ed social media, it's not serving you.\n\nYou haven't come to terms with that, your eating disorder has decided that for you. I felt the same way when I was underweight and malnourished. It was still hard when I started to gain weight, but a lot of the crazy irrational delusions disappeared when my brain and body had enough energy to think clearly. Dont give up, you're only 18. \n\nI don't know if writing is something you do often or if it's something you enjoy but if it is, or if you want to explore that, it's a really good tool. Poetry really helped me process my emotions and navigate hard situations during the start of my recovery last year. It slows you down, depending on how you go about it. First draft, second draft, third, fourth and then by the end you often realise situations that seem like the end of the world to your disordered brain really aren't. Sometimes you can figure out why you feel like that. It was basically free therapy for me lol. Definitely worth a shot. And also definitely easier to do with a brain that isn't malnourished.",
      "created_utc": 1753075617.0,
      "score": 32,
      "context": []
    },
    {
      "id": "n49qpi6",
      "author": "brownguyinthecorner",
      "body": "This reads very well. Writing is an art, and you're damn good at it. I wish you the best in college. Thank you for sharing your experience.",
      "created_utc": 1753063527.0,
      "score": 58,
      "context": []
    },
    {
      "id": "n4apgdb",
      "author": "runningonempty03",
      "body": "I had a moment like this once. It was shocking to see myself staring at me on my phone",
      "created_utc": 1753078978.0,
      "score": 10,
      "context": []
    },
    {
      "id": "n4baepb",
      "author": "replyplumber",
      "body": "We're the same age, I also have a job and am entering college. You seem so talented with your words, I genuinely wish you all the best.",
      "created_utc": 1753091003.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n4c6u5r",
      "author": "shonapokemon",
      "body": "thank you for sharing. sorry for your situation. you write beautifully. wishing you the best. 💕",
      "created_utc": 1753104737.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n4cqprn",
      "author": "yuru2323",
      "body": "Please don't give up on yourself, don't lose hope. You never know what life brings. A sunny day may follow a rainy day. And, you're so good with words too.",
      "created_utc": 1753110818.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n4exrws",
      "author": "coldhardash",
      "body": "i unfortunately relate to a lof of what ur saying :( when ur In something , u don't realize how harmful it elly is . i used to have 10k on edtwt and was on tspo threads etc , posting bcs for validation - since i deleted my edtwt acct i have honestly felt less competitive in my ed - definitely not Gone , but it's just slightly less of an obsession for me compared to when i was 24/7 on edtwt",
      "created_utc": 1753133138.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4f15mi",
      "author": "Bo_Is_A_Loser",
      "body": "Thank you, guys, for all the compliments on my writing. :<D",
      "created_utc": 1753134168.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4hpjiu",
      "author": "Skythebluestars",
      "body": "I deleted all of that, but i found a pic of one of my friends once while scrolling. It made me really mad people disering that body. While she never had conseted to having that photo posted anywhere. They just took it of her socials. I realized that there were no rules if it came to pics. Or where it came from. As long as it served the community.\n\nSadly my friend whom i talking about lost her battle 🌷",
      "created_utc": 1753173306.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4f0taw",
      "author": "Bo_Is_A_Loser",
      "body": "Edtwt scares the shit out of me you deserve a metal of honor for that shit. I am so glad you are able to get away from that.",
      "created_utc": 1753134065.0,
      "score": 1,
      "context": [
        {
          "id": "n4exrws",
          "author": "coldhardash",
          "body": "i unfortunately relate to a lof of what ur saying :( when ur In something , u don't realize how harmful it elly is . i used to have 10k on edtwt and was on tspo threads etc , posting bcs for validation - since i deleted my edtwt acct i have honestly felt less competitive in my ed - definitely not Gone , but it's just slightly less of an obsession for me compared to when i was 24/7 on edtwt",
          "created_utc": 1753133138.0
        }
      ]
    }
  ]
}