{
  "id": "c9achg",
  "subreddit": "AnorexiaNervosa",
  "author": "__Goner__",
  "created_utc": 1562291333.0,
  "title": "Anorexic to a binge eater",
  "selftext": "Who else went from being an anorexic to a binge eater? I might be happier now but I miss being skinny, feeling like the smallest person in the room. I wish I could just go back to being anorexic. I know that sounds very dumb.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/c9achg/anorexic_to_a_binge_eater/",
  "score": 115,
  "num_comments": 12,
  "comments": [
    {
      "id": "esv8nz4",
      "author": "Winterobin",
      "body": "I could not relate more. I’m sitting here feeling disgusting, missing anorexic tendencies and gah it’s so frustrating",
      "created_utc": 1562295420.0,
      "score": 33,
      "context": []
    },
    {
      "id": "esv0260",
      "author": "BigBoiLola",
      "body": "It made my body dysmorphia terrible.  I am the same but I don't feel happier at all.  I was force fed food and it turned anorexia into binge eating.  103 to 160 in six months.  I feel awful, I look awful, and no eating clinics around me have taken me seriously.  All I've got is my therapist and she doesn't specialize in food.  I feel like dying a lot, it's so fucking hard.  I don't know how to stop eating.   And it's so frustrating knowing I used to be in complete control.",
      "created_utc": 1562291583.0,
      "score": 26,
      "context": []
    },
    {
      "id": "esvt6oj",
      "author": "eardingu",
      "body": "I did! Actually, I went from BED to anorexia and then back to BED. I hate it",
      "created_utc": 1562303777.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eswyf5j",
      "author": "None",
      "body": "I was anorexic at 16, mom forcefed me til I gained weight (and I kinda went with it cuz I missed food and felt like I had been caught so I had to give up).  Took me until like now to realize wait that may have low key given me a binge eating disorder\n\nI guess it’s ok now tho cuz I’m back to being anorexic with a slight purging problem.  Thanks mom",
      "created_utc": 1562322707.0,
      "score": 8,
      "context": []
    },
    {
      "id": "esvyytz",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1562306421.0,
      "score": 2,
      "context": []
    },
    {
      "id": "esx8i6z",
      "author": "AssistedSuicide_",
      "body": "Im sad to hear we are in the same boat. I can’t stand what Ive become. My therapist acts like it was so brave to recover from anorexia but I’ve lost all control and I just miss the old days sooo much  [my youtube vid on this](https://youtu.be/tyGu9TEdsAo)",
      "created_utc": 1562326955.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eszoo0l",
      "author": "Art3mmis",
      "body": "I understand completely. I went from bulimia to anorexia to BED to starting to fall back into old tendencies. It sucks and I hate how I look and feel now. I’m trying to find that balance between not eating enough and eating too much to be healthy, but it’s hard. I started counting calories in an app that has me at 1600 a day and I just tell myself to stay with that. My issue is that I tend to get extreme with counting and start starving myself again, but I have to keep reminding myself to reach that daily goal. So far it hasn’t been too bad, but it’s only been a week",
      "created_utc": 1562365403.0,
      "score": 3,
      "context": []
    },
    {
      "id": "et04mde",
      "author": "Samboidy",
      "body": "I can relate a lot. I was anorexic a year back, started eating normally and then more, eventually binging a good amount of the time. And on the verge of relapsing back into ana but can't stop binging half the time.",
      "created_utc": 1562372690.0,
      "score": 3,
      "context": []
    },
    {
      "id": "evdkq9e",
      "author": "ButtJam2",
      "body": "I was Anorexic as a teen, enjoyed some degree of normalcy for 4-5 years, now I’m yo-yoing back and forth every year. Gets to UGW- immediately binge eats to highest weight ever.",
      "created_utc": 1564440619.0,
      "score": 1,
      "context": []
    },
    {
      "id": "esv13uk",
      "author": "__Goner__",
      "body": "Dude yes the weight gain from binge eating is just the worse. It’s so scary, I use to consume about 5000 or more calories in a day till I felt physically sick. I just wouldn’t stop eating I went from being 108 pound to 150 pounds..In just 3 months. I really wanna gain back control..",
      "created_utc": 1562292050.0,
      "score": 19,
      "context": [
        {
          "id": "esv0260",
          "author": "BigBoiLola",
          "body": "It made my body dysmorphia terrible.  I am the same but I don't feel happier at all.  I was force fed food and it turned anorexia into binge eating.  103 to 160 in six months.  I feel awful, I look awful, and no eating clinics around me have taken me seriously.  All I've got is my therapist and she doesn't specialize in food.  I feel like dying a lot, it's so fucking hard.  I don't know how to stop eating.   And it's so frustrating knowing I used to be in complete control.",
          "created_utc": 1562291583.0
        }
      ]
    },
    {
      "id": "esw4fk4",
      "author": "__Goner__",
      "body": "Hey, I’m sorry, I hope you feel better. History does tend repeat itself.. when we starve our body so much of course as soon as we start eating again we don’t stop, because our body is kinda scared what if we stop eating again? So its like trying to get in all the food it can.. and we tell ourselves last binging day everyday and it never is last...I know being anorexic makes us feel like we are in control, but how about you recover slowly, I’m not saying just eat, start your own diet plan that contains sufficient calories that your body requires be it 1000 calories, so that history doesn’t repeat.. I hope the best for you.",
      "created_utc": 1562309030.0,
      "score": 3,
      "context": [
        {
          "id": "esvyytz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1562306421.0
        }
      ]
    },
    {
      "id": "esvyyxk",
      "author": "None",
      "body": "If you or someone you know is contemplating suicide, please do not hesitate to talk to someone.\n\n**US:**\n\nCall 1-800-273-8255 or text HOME to 741-741\n\n**Non-US:**\n\n[https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines](https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines)\n \n --- \n \n^^I ^^am ^^a ^^bot.  ^^Feedback ^^appreciated.",
      "created_utc": 1562306423.0,
      "score": 1,
      "context": [
        {
          "id": "esvyytz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1562306421.0
        }
      ]
    },
    {
      "id": "esv1j03",
      "author": "BigBoiLola",
      "body": "I wish I could tell you I figured it out.  I haven't yet.  Recently I've been really depressed and even talking about it rn is making me kinda cry.  It feels so pointless.  I'm too \"small\" for people to take my binging seriously and way too big for anyone to take the fasting seriously.  I wish my aunt never force fed me.  If I was still at a low weight I could get into an eating clinic.  But I'm at this disgusting (to me) weight and no doctors take me serious, my case isn't bad enough for inpatient but I can't do transportation for the only outpatient services in my area because it's too far.  I just got out of the hospital for suicidal ideation and they couldn't even really help me there.  This is unrelated to eating, but I just feel like I keep reaching out to try to get help and get nothing from it at all.  I put in all this effort and shit is still exactly the same as it's always been.  I hope you can find peace of mind in it all and I wish you a recovery, hopefully soon.",
      "created_utc": 1562292406.0,
      "score": 9,
      "context": [
        {
          "id": "esv0260",
          "author": "BigBoiLola",
          "body": "It made my body dysmorphia terrible.  I am the same but I don't feel happier at all.  I was force fed food and it turned anorexia into binge eating.  103 to 160 in six months.  I feel awful, I look awful, and no eating clinics around me have taken me seriously.  All I've got is my therapist and she doesn't specialize in food.  I feel like dying a lot, it's so fucking hard.  I don't know how to stop eating.   And it's so frustrating knowing I used to be in complete control.",
          "created_utc": 1562291583.0
        },
        {
          "id": "esv13uk",
          "author": "__Goner__",
          "body": "Dude yes the weight gain from binge eating is just the worse. It’s so scary, I use to consume about 5000 or more calories in a day till I felt physically sick. I just wouldn’t stop eating I went from being 108 pound to 150 pounds..In just 3 months. I really wanna gain back control..",
          "created_utc": 1562292050.0
        }
      ]
    }
  ]
}