{
  "id": "d8z5rv",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1569391030.0,
  "title": "“At least I’m thinner than her”",
  "selftext": "I feel horrible and superficial and also good which I hate. Anyone else get this thought? \n\nIt’s one of those days where my body image isn’t so bad and I can see that I am actually thin. And then I see on social media a girl I used to be friends with who betrayed me and hurt me and she’s sharing her latest success, and my brain just goes “at least I’m thinner than her”. And I felt better. As if my restricting and obsession with size and calories and my weight and clothing size is worth more than her career success ?? It’s so stupid. \n\nIt’s the same as when I have one of these good body image days and sit in a room thinking, “at least I’m the thinnest in the room”. I may not be the most educated yet, or the top of whatever hierarchy, or the most popular, but I’m the thinnest. Like anyone cares. But I care.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/d8z5rv/at_least_im_thinner_than_her/",
  "score": 194,
  "num_comments": 11,
  "comments": [
    {
      "id": "f1drm6k",
      "author": "hedge-mustard",
      "body": "My brain does this too!! I’m sorry you have to deal with this but I’m oddly glad I’m not the only one.",
      "created_utc": 1569396221.0,
      "score": 32,
      "context": []
    },
    {
      "id": "f1eidrn",
      "author": "the_real_blobfish",
      "body": "oh god same... i always compare myself to my friends and i hate it\n\ni always think 'oh thank god i'm thinner than (x)' and i feel really bad because i guess i'm kind of implicitly saying they're fat in comparison to me?? but like? i think my friends are really pretty but if i was their weight i would be absolutely repulsed by myself (even though i already am rip)\n\ni also tend to get really jealous, not even just when people are thinner than me. Like, i have this one friend who is so pretty and thin and smart and kind and just generally better than me in every respect. and i can't help but resent her sometimes and it's really bad and i don't like it but kdfjsh'gsdfklghsdkl",
      "created_utc": 1569422933.0,
      "score": 16,
      "context": []
    },
    {
      "id": "f1e3tio",
      "author": "_riv-",
      "body": "omg i do this so much. though i’m not actually thin to ED standards or anything, i can still see it sometimes",
      "created_utc": 1569411829.0,
      "score": 7,
      "context": []
    },
    {
      "id": "f1esubf",
      "author": "tokieofrivia",
      "body": "I do this all. the. Time. My ex and I broke up ages ago, he was a horrible douchebag and I've moved on to the most amazing man in the world and my future husband. However, my ex and I still follow each other on social media and I love being able to say \"at least I'm thinner than her!\" about my ex's current girlfriend.",
      "created_utc": 1569429490.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f1elfkj",
      "author": "None",
      "body": "Girl omg I do it too",
      "created_utc": 1569424894.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f1etxyu",
      "author": "cuntycartier",
      "body": "omg me",
      "created_utc": 1569430181.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f1n5l0i",
      "author": "mlkjih",
      "body": "My ex husband called my fat every day, and then left me for someone clinically obese. My self worth is zero. I’m worse than *her* (she’s not even a good person so my feelings are valid but shouldn’t concern her weight) I’m fucked up.",
      "created_utc": 1569609502.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f1eovo3",
      "author": "jskgazer",
      "body": "same!! it’s so stupid and i feel like an awful person but you’re aware that it’s your disorder talking and you don’t actually believe skinny>success and well being and that’s important",
      "created_utc": 1569427073.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f1ff9eq",
      "author": "NotoriousBPD",
      "body": "This idea pops up in my mind all the time. It’s a bit different for me since I’m a guy and middle aged. I do separate guys that seriously work out since they are a different species. I have guy friends that have families and a steady life and I’ll think, “at least I don’t have his gut.”",
      "created_utc": 1569443237.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f4yd3a9",
      "author": "petewentz-from-mcr",
      "body": "I hate that I do this too",
      "created_utc": 1571874782.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f8nmnmq",
      "author": "MissBaltimoreBitch",
      "body": "Same. There’s a girl I pass going home every day who’s the same height but a bit bigger and I feel so guilty for thinking she’s fat, even though I don’t know her",
      "created_utc": 1574647713.0,
      "score": 1,
      "context": []
    }
  ]
}