{
  "id": "ef6xka",
  "subreddit": "AnorexiaNervosa",
  "author": "boiledchicken99",
  "created_utc": 1577220724.0,
  "title": "I am so appreciative for how my sister can just *listen*",
  "selftext": "",
  "url": "https://i.redd.it/i9gttwvg9n641.jpg",
  "score": 148,
  "num_comments": 5,
  "comments": [
    {
      "id": "fbz006t",
      "author": "MoosieGoose",
      "body": "It is so important to have support. You said right there that you're worried about your brain, your eyes, joints and bones. Life is much more than our physical forms, but without them, there is no life.\n\nTaking care of yourself will allow you to experience life, and all the wonders it has in store. If your body is broken, it makes it that much more difficult to appreciate the beautiful moments. You could be in the most beautiful place on earth, and if you hate yourself, you will not see it. You'll miss it, and 15 years later be begging to go back/do something again. Take this courage and jump, leave this nonsense in the dust, you deserve it!",
      "created_utc": 1577231031.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fbyx73u",
      "author": "tinybrainiac",
      "body": "I teared up. That’s wonderful that you have such support. I’m so glad for you 💕",
      "created_utc": 1577228780.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fbz3w6w",
      "author": "cpjkyl",
      "body": "luckyy. my sister literally makes fat jokes and insults fat people and brags about how skinny and hot she is to me. she stole and read my old diary so she knows how much i hate myself and that im suicidal.",
      "created_utc": 1577234299.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fbz2vmn",
      "author": "zklmarty",
      "body": "I agree with comment above, though I wouldn’t quite call it nonsense, since this disease ate me alive. I’m 10 years in now and have health problems that will last a lifetime. You don’t need to hear this, though. You need a solid support system which it seems like you can access. I don’t know you but I love you, and I’m rooting for you.",
      "created_utc": 1577233435.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fc20a3d",
      "author": "Marinel-",
      "body": "r/humansbeinbros :')",
      "created_utc": 1577335462.0,
      "score": 1,
      "context": []
    }
  ]
}