{
  "id": "egigyv",
  "subreddit": "AnorexiaNervosa",
  "author": "throwawayadvice87p",
  "created_utc": 1577488063.0,
  "title": "How was your Christmas?",
  "selftext": "",
  "url": "https://i.redd.it/75gyizmec9741.jpg",
  "score": 320,
  "num_comments": 6,
  "comments": [
    {
      "id": "fc6yd65",
      "author": "Kaysie",
      "body": "The opposite happened to me and I’ve been fasting since- \nHer: buys size large after I told her I was medium\nMe: these are too big\nHer: Oh, I know you said medium but you look like large to me\nFML\n\nI’m so sorry sweetie",
      "created_utc": 1577492679.0,
      "score": 57,
      "context": []
    },
    {
      "id": "fc7ij1x",
      "author": "lladyrose",
      "body": "Weight Trigger Warning\n\nMy friend (5’3” 17M) and I (5’6” 16F) were talking about weights and he guessed that I weighed 95 lbs because we always joke about me being stick thin.\n\nIt killed me inside and made me skip lunch for a whole month to tell him I was actually 125 because I’m tall.\n\nBut my Christmas was fine otherwise, thank you <3",
      "created_utc": 1577508501.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fc7m6ms",
      "author": "Supersassycatlassie",
      "body": "I'm so sorry to hear that :( I can relate. Last Christmas, my mother bought a bunch of used clothes in size child large, child xl, and adult s. She then got irritated when not all of the clothes fit me. Every day multiple times a day she kept saying, \"I can't believe it all didn't fit! Are you sure?? I spent $30 on it all and most of it is going to waste!\"\n\nI was about ready to give her $30 to stop talking about it. Thanks for shaming me, a grown ass woman, for not fitting into CHILD SIZED CLOTHES. I was so mad. And she knows I have eating issues. I think she meant well, but come on. She even went through all the clothes to fold them. Did she not notice the youth sizes?! Families just don't get it.",
      "created_utc": 1577511997.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fc7333o",
      "author": "nymphormaniac",
      "body": "I got the flu this Christmas, wasn’t hard not eat while feeling sick but the worse of the monkeys is that I’ve been trying to gain weight and it isn’t happening. I am completely broke too so a fag diet has been working for me but breaking out of these old habits man. \n\nTips: stress is terrible for weight loss, you plateau faster and it only triggers you more. \n\nCW105/48(?)GW0-currently SOS (scared of scale)",
      "created_utc": 1577496231.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fc7tfef",
      "author": "daddydangles911",
      "body": "Oof I'm sorry. I'm relating really hard, these medium size leggings my in-laws got me are feeling way tighter than I want them to. Hope your holidays improve. ❤️",
      "created_utc": 1577518169.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fdwr86i",
      "author": "None",
      "body": "Being tall with an eating disorder is the worst, I’m 5,’7 and when my anorexia was at its worst, I always felt like my goal weight was too high because I kept seeing people with goal weights in the double digits, which just isn’t possible for me.",
      "created_utc": 1578761547.0,
      "score": 4,
      "context": [
        {
          "id": "fc7ij1x",
          "author": "lladyrose",
          "body": "Weight Trigger Warning\n\nMy friend (5’3” 17M) and I (5’6” 16F) were talking about weights and he guessed that I weighed 95 lbs because we always joke about me being stick thin.\n\nIt killed me inside and made me skip lunch for a whole month to tell him I was actually 125 because I’m tall.\n\nBut my Christmas was fine otherwise, thank you <3",
          "created_utc": 1577508501.0
        }
      ]
    }
  ]
}