{
  "id": "f9nf87",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1582690195.0,
  "title": "Anyone feel invalidated being anorexic and normal weight",
  "selftext": "I’m 17 and a female and I’ve recently relapsed back into anorexia. I have to say though, I don’t really believe I need help on some level because I’m still normal weight. And it’s that warped mindset my ED has. That I’m fine or that I need to lose weight and it’s fine because I’m normal weight. Does anyone else struggle with this?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/f9nf87/anyone_feel_invalidated_being_anorexic_and_normal/",
  "score": 134,
  "num_comments": 17,
  "comments": [
    {
      "id": "fisth4e",
      "author": "MissGKali",
      "body": "Yes\n I feel like im fine and ill worry when im underweight but i feel like right now im just a poser",
      "created_utc": 1582692887.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fisr9oo",
      "author": "Onewholemess",
      "body": "This is me. This is me all the way, I totally understand.",
      "created_utc": 1582691185.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fisvd4v",
      "author": "iampieman",
      "body": "I’m overweight and have just been diagnosed with anorexia?? I cringe just saying it. I’ve lost a lot in a short time, but I’m still overweight.",
      "created_utc": 1582694464.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fitxp1c",
      "author": "imnotreallysureuguys",
      "body": "lmao hi! i lost a good ass amt of weight and then have remained stagnant at a healthy weight for the last four years while still using anorexic tendencies and feeling like hell physically and around food. my weight barely changes out of the same 5-10 pounds now and i doubt anyone takes me seriously and it feels miserable",
      "created_utc": 1582731580.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fitnun9",
      "author": "FlatDecision",
      "body": "I’ve struggled with an ed since I was 14.  Only twice did I ever fit into the “underweight” category.  Even now, I’m far from the low weight I used to be and that can feel super invalidating.  So I really have to remind myself that it’s my relationship with food that’s my ed, not my weight.",
      "created_utc": 1582725247.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fiu1fe7",
      "author": "cupcakecat27",
      "body": "I’m underweight and fairly medically compromised but get told how good I look and how healthy I look like daily. It’s maddening. I just want someone to understand the struggle!",
      "created_utc": 1582733506.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fit71zm",
      "author": "rollthepairofdice",
      "body": "I was overweight when I relapsed and I JUST reached a normal weight. I’m still fluctuating to a little overweight but I know exactly what you mean.",
      "created_utc": 1582707444.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fiusy9f",
      "author": "RexieSquad",
      "body": "Don't worry. Venting is why we are here for. \n\nListen, as long as you are not one of those fat people who claim ana for ed points, you are fine. Weight isn't the only thing that measures if you have anorexia. I myself am slightly underweight , but i don't look like what the media portraits ana's to typically look like at all. So, my advice is for you to try your best at recovery mentally, the body will follow. You can eat healthy and exercise, but if  the mind set doesn't change, nothing really will.\n\n\nThere's no glory in anorexia. \n\nLeave it as fast as you can.",
      "created_utc": 1582747687.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fitr8ox",
      "author": "Not-Madi",
      "body": "me all the way... i’m also 17 and a girl so if you want to talk to someone i’m always down to make a new friend\n\nplus being fairly tall for my age i weigh a lot more than my shorter friends ughhh",
      "created_utc": 1582727573.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiuvj4x",
      "author": "knittingNikki84",
      "body": "So the time my mind tells me I'm ok. It got to the point my wife told me of I didn't eat she we taking me to the hospital and all I could think we I'm so fat though. What she saw was me almost passing out though. Sometimes we need the perspective of a loved one.",
      "created_utc": 1582749038.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fivo3af",
      "author": "None",
      "body": "I won't use exact numbers to avoid triggering people, but I've been told by someone (who doesnt know about my an) that anorexia won't be taken seriously unless my bmi is 4.5 less than what it was. I'm considered average weight but it really hurts to hear someone say that. It makes my strive for that lower weight, but I just cant get that low. My weight is at its lowest right now than ever before, and my bmi is still 4.3 higher than it \"should\" be. It really fucks my mind up. I like to think that my breast reduction coming up will help, but I just don't know :(",
      "created_utc": 1582764326.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiy77cq",
      "author": "cosmic_frigg",
      "body": "Yes yes 1000x yes. I feel like such a failure when I eat semi normally and when I look at myself in the mirror bc I know I’m not underweight anymore. It’s so defeating. Makes me feel more disgusted with myself",
      "created_utc": 1582833876.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fit3i1y",
      "author": "KPOP_AND_ANIME_TRASH",
      "body": "This and being overweight :( sometimes idek if it's real..",
      "created_utc": 1582702888.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fit5akb",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1582705080.0,
      "score": -1,
      "context": []
    },
    {
      "id": "fittrns",
      "author": "RexieSquad",
      "body": "If you have been diagnosed by certified physicians, then they know more than us and you, so they might be right. Listen to them.",
      "created_utc": 1582729232.0,
      "score": 10,
      "context": [
        {
          "id": "fisvd4v",
          "author": "iampieman",
          "body": "I’m overweight and have just been diagnosed with anorexia?? I cringe just saying it. I’ve lost a lot in a short time, but I’m still overweight.",
          "created_utc": 1582694464.0
        }
      ]
    },
    {
      "id": "fittwxj",
      "author": "RexieSquad",
      "body": "Max_skellington_ on IG for anyone who wants to talk about this.",
      "created_utc": 1582729324.0,
      "score": 1,
      "context": [
        {
          "id": "fitr8ox",
          "author": "Not-Madi",
          "body": "me all the way... i’m also 17 and a girl so if you want to talk to someone i’m always down to make a new friend\n\nplus being fairly tall for my age i weigh a lot more than my shorter friends ughhh",
          "created_utc": 1582727573.0
        }
      ]
    },
    {
      "id": "fitkg9s",
      "author": "Shadowed-Heart",
      "body": "rule 10.",
      "created_utc": 1582722678.0,
      "score": 1,
      "context": [
        {
          "id": "fit5akb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1582705080.0
        }
      ]
    },
    {
      "id": "fiuiuu4",
      "author": "iampieman",
      "body": "Yes it was my GP and a psychiatrist. I’m just embarrassed about it - it seems so dumb saying I have anorexia when I’m overweight. They didn’t even write “atypical” on my notes which makes me more anxious because I’m gonna walk into the dieticians office who just has notes saying I’m diagnosed with “anorexia nervosa” , then my overweight self is going to walk in. \n\nAnyway, sorry, just sort of venting here haha.",
      "created_utc": 1582742231.0,
      "score": 2,
      "context": [
        {
          "id": "fisvd4v",
          "author": "iampieman",
          "body": "I’m overweight and have just been diagnosed with anorexia?? I cringe just saying it. I’ve lost a lot in a short time, but I’m still overweight.",
          "created_utc": 1582694464.0
        },
        {
          "id": "fittrns",
          "author": "RexieSquad",
          "body": "If you have been diagnosed by certified physicians, then they know more than us and you, so they might be right. Listen to them.",
          "created_utc": 1582729232.0
        }
      ]
    }
  ]
}