{
  "id": "fbul8t",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1583072113.0,
  "title": "fear of wasting calories",
  "selftext": "I'm in recovery and I have such a huge fear of 'wasting calories' aka eating something that I don't 100% enjoy. I spend so long trying to decide what to eat for lunch and if I end up not loving what I chose I get so stressed out and agitated. I guess it's because I'm still always counting calories in the back of my head and it's frustrating to have my total go up on something that doesn't feel worth it. Anyone else experience this/know how to get past it?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/fbul8t/fear_of_wasting_calories/",
  "score": 182,
  "num_comments": 6,
  "comments": [
    {
      "id": "fj6kzug",
      "author": "Himmelsfeder",
      "body": "Yes, I know this feeling very well, especially when I'm with family and didn't exactly choose the food I'll eat myself but ate it under social pressure.\n\nWhat helps me is knowing that there is a LOT of time. This was one meal and the rest of the day is still mine to choose. Or: Today wasn't the best day, but tomorrow there will be another chance. \n\nPerfection is nothing but a cruel illusion. Life isn't a straight path but it's going up and down and the beauty of it is that it is forgiving and giving us millions of chances to change our ways and redo something we feel we '' messed up''.   \nAnother aspect that helps me is understanding that food is only one aspect of life. Obviously, with an ED that is an extremely difficult conviction to maintain, but I try to make sure that I regularly do stuff that I consider to be fun. So even if food-wise the day wasn't good, I enjoyed myself pursuing my hobbies /seeing people I care about / etc so that all in all, it was still a good day in my book.  \n\n\nHope it helps!",
      "created_utc": 1583074581.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fj6nfsb",
      "author": "None",
      "body": "I have this problem as well.. I spend a lot of time deciding what to eat, and then changing my mind a hundred times.. it's exhausting..",
      "created_utc": 1583076111.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fj7ny86",
      "author": "None",
      "body": "Same. It’s exhausting. Every time I eat it needs to be the perfect food, in the perfect environment (usually my bedroom) with the perfect show on TV. My food needs to be the perfect temperature and I will reheat it multiple times during a meal. I have to eat with the perfect utensils ( I have specific spoons for cereal, icecream, etc). I also have salt and pepper beside my bed so that I can add more to perfect the seasoning without going downstairs and using the salt and pepper shakers in the kitchen. I basically refuse to eat anywhere besides alone in my bedroom watching netflix. It’s brutal and I have no idea what to do. My mindset is pretty much “ If I have to gain recovery weight, it’s only gonna be on perfect food that I enjoy”, so i’m essentially still stuck in my eating disorder but eating a lot more than I was when I wasn’t in “recovery”.",
      "created_utc": 1583094450.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fj7btd7",
      "author": "Birdie49",
      "body": "I do the exact same thing. I get so upset when food gets cold or isn't as good as I expected it to be. I have to get the maximum pleasure out of everything I eat or I've wasted calories",
      "created_utc": 1583089370.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fj7cs2n",
      "author": "None",
      "body": "Same :/\n\nI only really got past it partially, when I was in treatment and had to gain weight. Turns out pretty much nothing is appealing after you’ve eaten 3000 calories a day!",
      "created_utc": 1583089770.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fj8srza",
      "author": "complexmariner",
      "body": "goddd sameee",
      "created_utc": 1583121266.0,
      "score": 1,
      "context": []
    }
  ]
}