{
  "id": "feyvoo",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1583604523.0,
  "title": "Anorexia is not just about body image",
  "selftext": "Look, I see myself as beautiful. I never developed anorexia because of my physical appearance. I developed anorexia because it terrified me to watch a loved ones' health decline due to weight gain.\n\nANOREXIA IS NOT JUST SELF ESTEEM BASED.\n\nI'm much more focused on my health than most people (My psychologist said that anyhow), and I'm so afraid of my health deteriorating due to being fat. Nobody understands that I don't have issues with my body image, I've learned to love and embrace my insecurities. Nobody understands that I have anorexia out of fear. I'm not anorexic because I want others to see me as beautiful, I'm anorexic because I'm so overly concious of my health that it fucked up my thought process.\n\nI mean, I get it, a lot of 14yo's have self esteem issues, but you can't just assume that these issues are because of that. It hurts more and more to be told I'm beautiful how I am, it just makes me feel like looks are more important than anything else. I just want to be told he'll be okay in the end, that's all",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/feyvoo/anorexia_is_not_just_about_body_image/",
  "score": 123,
  "num_comments": 11,
  "comments": [
    {
      "id": "fjtcaf4",
      "author": "None",
      "body": "> I never developed anorexia because of my physical appearance.\n>\n> Nobody understands that I don't have issues with my body image,\n\nI think it's pretty common in AN. The nature of disturbed body image in anorexia is more about denial of the seriousness of low weight/delusional denial of emaciation. It's definitely not an illness of vanity. \n\nUnfortunately the popular perception is that it's a teenage girls' disease about wanting to look like a supermodel...",
      "created_utc": 1583606374.0,
      "score": 43,
      "context": []
    },
    {
      "id": "fjtnku1",
      "author": "STAR-Gritz",
      "body": "Though, yes you're right it's not always because of body image, it is by far the most common cause. So the presumption many people have isn't that wrong is most scenarios. Not to invalidate your situation 9f course",
      "created_utc": 1583609403.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fju6xz8",
      "author": "chancedd",
      "body": "I totally get what you mean and I agree. However the wording of the DSM-5’s diagnostic criteria for AN makes it sound like a vain thing (imo) which is how I deluded myself for so long and believed I didn’t have it. (I’ve taken courses on abnormal psychology and psychiatry in general) It’s so frustrating.",
      "created_utc": 1583614144.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fjtrdsg",
      "author": "osano420",
      "body": "I had anorexia bc of the same reason dont worry youre not alone <3",
      "created_utc": 1583610329.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fjunql1",
      "author": "None",
      "body": "My disordered thinking really started with seeing how miserable my mom was with her own body image and how it was effecting her mood towards everyone because she use to be very thin naturally- same with all the women in her family.",
      "created_utc": 1583618424.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fjujdmt",
      "author": "hedge-mustard",
      "body": "same boat",
      "created_utc": 1583617301.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fjv3eja",
      "author": "FlatDecision",
      "body": "My eating disorder doesn’t even have a physical reason.  It’s not really about weight loss (even though I’m obsessed with the number on the scale as a way to monitor my “success”); it’s about control.  The less I eat, the more I’m “succeeding”.",
      "created_utc": 1583622740.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fjtgb6i",
      "author": "kenmayy",
      "body": ">Unfortunately the popular perception is that it's a teenage girls' disease about wanting to look like a supermodel...\n\nThat's why it's not taken as seriously. \n\nI started developing anorexia when I realized everyone in my family was morbidly obese and I was going to end up like them if I didn't change. \n\nThen started the healthy dieting.\n\nThen started the calorie restriction.\n\nAfter that it just got worse and worse before I realized it I could see bones I never saw before. My first thought was \"at least I'm healthy\". My obsession with being healthy and not wanting heart disease and diabetes was causing me to get sick without realizing it. \n\nI think the last step into my descent was trying to look like models, I looked at myself and said \"you know what I could look like that if I lost a little more weight\".\n\nIt's really a sad illness, I feel sorrow for anyone with eating disorders because no matter what once you start it's like you can never stop, even after recovery.",
      "created_utc": 1583607516.0,
      "score": 16,
      "context": [
        {
          "id": "fjtcaf4",
          "author": "None",
          "body": "> I never developed anorexia because of my physical appearance.\n>\n> Nobody understands that I don't have issues with my body image,\n\nI think it's pretty common in AN. The nature of disturbed body image in anorexia is more about denial of the seriousness of low weight/delusional denial of emaciation. It's definitely not an illness of vanity. \n\nUnfortunately the popular perception is that it's a teenage girls' disease about wanting to look like a supermodel...",
          "created_utc": 1583606374.0
        }
      ]
    },
    {
      "id": "fju7xqz",
      "author": "chancedd",
      "body": "Yes I agree. It’s in the diagnostic criteria of AN to have an extreme fear of being fat and/or being in denial about your body shape despite being severely underweight (I’m paraphrasing bc my DSM-5 is across the room lol), but it definitely isn’t everyone’s experience. For me it wasn’t until I was underweight that I started to have disordered thoughts related to body shape and even then I don’t feel like that was my primary cause for restricting. It’s always always always been related to my anxiety. \n\nIt makes me wonder if I really have anorexia or if I just happen to meet the diagnostic criteria but in reality have some other type of disordered eating that there isn’t a diagnosis for yet. (I’m not self-diagnosed btw & I’ve had these discussions with my psychiatrist) But I have to acknowledge its name (whether it be a placeholder or not) so that I can overcome it.",
      "created_utc": 1583614499.0,
      "score": 4,
      "context": [
        {
          "id": "fjtnku1",
          "author": "STAR-Gritz",
          "body": "Though, yes you're right it's not always because of body image, it is by far the most common cause. So the presumption many people have isn't that wrong is most scenarios. Not to invalidate your situation 9f course",
          "created_utc": 1583609403.0
        }
      ]
    },
    {
      "id": "fjurc5w",
      "author": "RexieSquad",
      "body": " Fuck the DSM 5, to be honest.",
      "created_utc": 1583619399.0,
      "score": 3,
      "context": [
        {
          "id": "fju6xz8",
          "author": "chancedd",
          "body": "I totally get what you mean and I agree. However the wording of the DSM-5’s diagnostic criteria for AN makes it sound like a vain thing (imo) which is how I deluded myself for so long and believed I didn’t have it. (I’ve taken courses on abnormal psychology and psychiatry in general) It’s so frustrating.",
          "created_utc": 1583614144.0
        }
      ]
    },
    {
      "id": "fjut00i",
      "author": "chancedd",
      "body": "Honestly yes. It’s so inaccurate in so many ways. (But I acknowledge it’s the best we have rn)",
      "created_utc": 1583619915.0,
      "score": 1,
      "context": [
        {
          "id": "fju6xz8",
          "author": "chancedd",
          "body": "I totally get what you mean and I agree. However the wording of the DSM-5’s diagnostic criteria for AN makes it sound like a vain thing (imo) which is how I deluded myself for so long and believed I didn’t have it. (I’ve taken courses on abnormal psychology and psychiatry in general) It’s so frustrating.",
          "created_utc": 1583614144.0
        },
        {
          "id": "fjurc5w",
          "author": "RexieSquad",
          "body": " Fuck the DSM 5, to be honest.",
          "created_utc": 1583619399.0
        }
      ]
    }
  ]
}