{
  "id": "fp30o1",
  "subreddit": "AnorexiaNervosa",
  "author": "me-hoy-minoy-",
  "created_utc": 1585187619.0,
  "title": "Worst fear happened with this virus",
  "selftext": "So I was very aware that have and ED would put me at a higher risk for getting this. But because I’m a teenager I assumed “I’d be fine”. I now have a horrible cough, feel short of breath, and am running a fever. My family is trying to get me a test tomorrow. And I’m very scared that I won’t be okay because my immune system is so bad right now. I already feel so crappy and weak. I don’t know why exactly I’m posting this but I figured you’d all understand my fears.\n\n\nEdit- Hey guys, thank for all the kind words and support. It truly means so much and has really been pushing me forward, I even ate breakfast this morning which is something I haven’t done in I don’t even know how long. So thank you all🤍",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/fp30o1/worst_fear_happened_with_this_virus/",
  "score": 130,
  "num_comments": 12,
  "comments": [
    {
      "id": "flix9bl",
      "author": "None",
      "body": "I definitely sympathize :(\n\nAnorexia is weird, you get to feel like both the victim and the persecutor. I do this to myself but I truly don’t like it?",
      "created_utc": 1585192991.0,
      "score": 37,
      "context": []
    },
    {
      "id": "fliwwrj",
      "author": "RapidMongrel",
      "body": "Be honest with the doctors, listen to them if they try to get you to eat do it. It's not a punishment they just want you to recover. I was 1.5 weeks into recovery when this started and it has made it into challenge mode. Just remember to preserve.",
      "created_utc": 1585192742.0,
      "score": 19,
      "context": []
    },
    {
      "id": "flj912m",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1585202962.0,
      "score": 17,
      "context": []
    },
    {
      "id": "flj9dwc",
      "author": "None",
      "body": "Don’t be scared. You will get through this 🖤",
      "created_utc": 1585203335.0,
      "score": 9,
      "context": []
    },
    {
      "id": "flkejm7",
      "author": "FairInvestigator",
      "body": "Sending comforting energy your way. Really fantastic news that you managed to have breakfast. Please try and increase your intake, think of it as medicine. Building strength. Keep going, we are all here for you.",
      "created_utc": 1585239438.0,
      "score": 5,
      "context": []
    },
    {
      "id": "flk040w",
      "author": "None",
      "body": "I hope it’s not actually the virus, you may just be paranoid (i know i am!). If it is, it’s not necessarily a death sentence - take it easy and please don’t feel guilty if you need to eat a bit more or reduce exercise, if you struggle with that, to help your immune system cope. You could use this as an opportunity to recover, it’s completely understandable if that seems terrifying but recovery helps better other illnesses so much. Take care of yourself love",
      "created_utc": 1585230999.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fljxc5e",
      "author": "ImMaGoNnAcRy",
      "body": "Hope you will get well soon!\nYou are strong you can do it :)",
      "created_utc": 1585229084.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flk4whc",
      "author": "MsArinko",
      "body": "Sleep, eat and drink as much as you can. Please, I know it's scary, but try to calm down and help your body as much as possible, you can fight this! \nAlso if your family has the option, it would be great if they could buy you echinacea or pelargonium extract, it should be sold in a pharmacy. Those plants can help your immune system and have some antivirotic tendencies, it's not a cure, but if it will make you feel only 1 % better, it's worth to try it. (of course other then that try to take some meds to help with your cough and fever, adhere to the pharmacist advice). Stay safe, I have my fingers crossed for you!",
      "created_utc": 1585233986.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flkmv5e",
      "author": "MoosieGoose",
      "body": "The struggle is real. I have OCD so I'm obsessively cleaning & my food phobia is pretty bad lately.\n\nBut we have to eat, our bodies need fuel to fight this (and many other things) off every day. Take care of yourself, we'll make it through this.",
      "created_utc": 1585243873.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flk3cp3",
      "author": "me-hoy-minoy-",
      "body": "Ate breakfast this morning, thank you for the support and advice💛",
      "created_utc": 1585233054.0,
      "score": 6,
      "context": [
        {
          "id": "flj912m",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1585202962.0
        }
      ]
    },
    {
      "id": "flkqk9y",
      "author": "praythestars",
      "body": "The thing is, even if it isn't C19 when you have an ED more common diseases can be just as bad as something like C19. The danger is hospitals running low on things to help with pneumonia. At my worst simple colds turned into pneumonia 4/5 times, literally had it three times in a year and them again the following summer. The sad truth is that in some of the harder hit countries they are having to make some hard decisions on who gets the limited supplies based on likelihood of survival, and us ED folks aren't anywhere near the top of the list.",
      "created_utc": 1585245818.0,
      "score": 1,
      "context": [
        {
          "id": "flk040w",
          "author": "None",
          "body": "I hope it’s not actually the virus, you may just be paranoid (i know i am!). If it is, it’s not necessarily a death sentence - take it easy and please don’t feel guilty if you need to eat a bit more or reduce exercise, if you struggle with that, to help your immune system cope. You could use this as an opportunity to recover, it’s completely understandable if that seems terrifying but recovery helps better other illnesses so much. Take care of yourself love",
          "created_utc": 1585230999.0
        }
      ]
    },
    {
      "id": "flk9a5c",
      "author": "me-hoy-minoy-",
      "body": "I’ll shoot my parents a text and see if we have those items at our local pharmacy. Thank you for the suggestion! 💛",
      "created_utc": 1585236522.0,
      "score": 3,
      "context": [
        {
          "id": "flk4whc",
          "author": "MsArinko",
          "body": "Sleep, eat and drink as much as you can. Please, I know it's scary, but try to calm down and help your body as much as possible, you can fight this! \nAlso if your family has the option, it would be great if they could buy you echinacea or pelargonium extract, it should be sold in a pharmacy. Those plants can help your immune system and have some antivirotic tendencies, it's not a cure, but if it will make you feel only 1 % better, it's worth to try it. (of course other then that try to take some meds to help with your cough and fever, adhere to the pharmacist advice). Stay safe, I have my fingers crossed for you!",
          "created_utc": 1585233986.0
        }
      ]
    }
  ]
}