{
  "id": "ftgxzp",
  "subreddit": "AnorexiaNervosa",
  "author": "dudephoenix",
  "created_utc": 1585806861.0,
  "title": "Is it normal to really miss being anorexic after recovering?",
  "selftext": "I feels so disappointed in myself because I worked so hard over all of last year to gain this weight, and I was so determined then, but now that I actually am a healthy weight I just feel really fat and miss everything about being as thin as I was. Like I worked so hard to actually become healthy, and now that I'm healthy I feel like it wasn't worth it... Sometimes I feel like I made a mistake, but then I feel worse for feeling like that, so disappointed in myself for wishing to go back to that horrible illness, but then keep missing it... \n\nSorry if this broke any rules or isn't allowed here; I haven't really used reddit in a few years.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ftgxzp/is_it_normal_to_really_miss_being_anorexic_after/",
  "score": 152,
  "num_comments": 21,
  "comments": [
    {
      "id": "fm6yun0",
      "author": "_fidgetspinner",
      "body": "I feel the same way. I don’t think I ever really recovered. I miss being anorexic and underweight every day, I kid you not. It feels like missing a part of myself that died. It feels like a huge loss.",
      "created_utc": 1585807419.0,
      "score": 65,
      "context": []
    },
    {
      "id": "fm73rqi",
      "author": "crumpzilla",
      "body": "It fades away a little bit, but for me personally I will always have a small part of me that misses it. And that part grows stronger in times of stress or when I feel I’ve lost control.",
      "created_utc": 1585812169.0,
      "score": 24,
      "context": []
    },
    {
      "id": "fm72xnt",
      "author": "Reachingout365",
      "body": "I have these days sometimes.\n\nOne of my friend who use to have anorexia has said this before too.",
      "created_utc": 1585811326.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fm74g40",
      "author": "nadiaxpetrova",
      "body": "Same here. I’m not underweight anymore and i miss it very much",
      "created_utc": 1585812892.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fm7kkii",
      "author": "SarcasmManifest",
      "body": "I hate even saying this, but I am in my 40’s and have had anorexia (only restrictive) on and off since I was fifteen. I have had long years of recovery, and a couple of serious inpatient stays. I have lost two women to anorexia, good friends I met in inpat and knew for years afterwards. They both died in their thirties. Yet...I still miss it when I am “healthy.” Still. Probably always.",
      "created_utc": 1585830044.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fm7f2sf",
      "author": "Blue-796",
      "body": "I feel the same way all the time, when I was anorexic I worked out religiously and I didn't have time to care so much about the things I care about now because I am as so consumed in my anorexia, losing weight and lying was all I had time for but I had my daughter and I got better for her when I found out I was pregnant and since after I had her I thought I was okay and I got healthier and now I'm fat as fuck and I just want to be as committed to working out as I was",
      "created_utc": 1585824605.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fm779vp",
      "author": "Im_actually_satan",
      "body": "There are sometimes when I miss the feeling of fasting and how ecstatic I could get over reaching my goal weights. I think that’s normal since EDs change the way you think. I’m not sure I’ll ever recover from having disordered thinking when it comes to weight or food",
      "created_utc": 1585815837.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fm7j4lq",
      "author": "None",
      "body": "Yeah it’s an egosyntonic mental illness, it’s not quite the same as OCD or depression (for instance)",
      "created_utc": 1585828759.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fm7pvso",
      "author": "MoosieGoose",
      "body": "Every time. You are able to do more in life once recovered (more energy, better focus, improved immune system, etc) but I do think about it every day. The fact that it consumes so much of my energy, but doesn't actually amount to something physical, makes me feel like a failure. I feel like a failure if I relapse, too, so it's great.",
      "created_utc": 1585834103.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fm7qwrv",
      "author": "mynameismyname333",
      "body": "Yes, I even sometimes regret switching classes because I wasn't told that I'm fat all the time, which made me binge eat and then fall in a deep depression because I binged.",
      "created_utc": 1585834806.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fm84l8n",
      "author": "taikutsuu",
      "body": "I feel the same way. Please don't be ashamed, it's only a sign that you're hurting. I believe we all have another problem, another thing deep down, that caused this in the first place, that used the anorexia as a coping mechanism. And only when we figure out what that is, and fix that issue deep down, will it stop craving the disorder to cope with it and allow us to live normal lives, wanting to be healthy and happy.",
      "created_utc": 1585842699.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fm843xu",
      "author": "RexieSquad",
      "body": "Being healthy can never be the wrong  choice, specially nowadays when we all need a strong immune system. Keep it up, thoughts aren't reality,  your  ED is trying to fool you to go back, don't listen to it.",
      "created_utc": 1585842443.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fm8wbti",
      "author": "litteringminds",
      "body": "I feel this way some days too, all I can say that I think could help is that this Ed will make you an insomniac, drained of life , malnourished, ruin relationship, hold you back from experiences , age you terrible and possibly insane, before it’ll make you thinner. And I mean it took my so long to come to terms with that but once you do, you’ll notice just how much you’ve missed out on because of the disorder and you can finally begin to live again. I don’t know if that makes sense everyone’s experience is different but that was mine anyways :)",
      "created_utc": 1585857238.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fm875z8",
      "author": "None",
      "body": "I've missed it, not even being that thin but counting calories and the feeling of having control and just the feeling of seeing your weight go down.",
      "created_utc": 1585844076.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fm904y1",
      "author": "RapidMongrel",
      "body": "I feel that way, but when ever I have something happen that keeps me from eating for a long time, and I start having the dizzy, confused, and emotional feelings. It changes that desire.",
      "created_utc": 1585859219.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmdihgf",
      "author": "em_3375",
      "body": "I feel the same way. Ever since I have begun eating well again I have always wanted to stop, but it has become so hard",
      "created_utc": 1585968678.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hoh9kxv",
      "author": "Obvious-Brief6579",
      "body": "Omg I needed to read this question tonight! Yes!! Or at least...i hope so? I tried to fix my issues on my own. No professional help... I lied very well at how I lost weight so easily and quickly. My weight came off so fast that I couldnt see how bad I had gotten. It wasnt until my best friends called me out on it on a moms getaway over the summer. I begged them not too tell my spouse ( I know how awful that sounds) and I told them I would get professional help. I didn't. I tried to fix it on my own. I did pretty well for no help. At first, it felt awful. Then, it felt amazing to give myself permission to eat again.... I binged without purging. My hair has stopped falling out, I don't have the white little hairs growing on me anymore and I am not as cold as I used to be. I know overall, I am doing the right thing for my body, but I absolutely hate it. Physically and mentally hate it. I now hate the way my body looks, and feels...even more so then i did before. At this very moment, I would do anything not too crave food, not too feel hunger, and to have that control again. I can remember feeling so genuinely fat still when people would compliment me. I was so addicted to the praise yet I also didn't want the attention on my body either. I wanted to not be hungry ever but I also wanted to have a good enough body to eat whatever i wanted. I didnt want anyone to ever know I was not eating or purging what I did eat, yet at the same time I was screaming inside for someone to lovingly notice that something was wrong..... I was constantly at odds with myself. It was exhausting. It still is. My body issues have not gone away. I just struggle on different sides at different times( if that's makes sense). Either way..... To fat...to thin....my entire day and mind set...every single thing revolves around how much I hate my body and myself and food. It always has. During the holidays...when I binge eat... I miss anorexia and purging more than ever.\nI am not sure if what I typed made sense to anyone else, but thanks for letting me vent. I never shared anything like that before. Hang in there everyone .",
      "created_utc": 1639461200.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fm7061m",
      "author": "thequestionssss",
      "body": "I feel sort of similar. I probably should have sought professional treatment but for awhile I thought I was better.",
      "created_utc": 1585808639.0,
      "score": 11,
      "context": [
        {
          "id": "fm6yun0",
          "author": "_fidgetspinner",
          "body": "I feel the same way. I don’t think I ever really recovered. I miss being anorexic and underweight every day, I kid you not. It feels like missing a part of myself that died. It feels like a huge loss.",
          "created_utc": 1585807419.0
        }
      ]
    },
    {
      "id": "fm9h1gt",
      "author": "None",
      "body": "do you think trying to grieve it might help? i think a lot about the grieving process lately",
      "created_utc": 1585868577.0,
      "score": 1,
      "context": [
        {
          "id": "fm6yun0",
          "author": "_fidgetspinner",
          "body": "I feel the same way. I don’t think I ever really recovered. I miss being anorexic and underweight every day, I kid you not. It feels like missing a part of myself that died. It feels like a huge loss.",
          "created_utc": 1585807419.0
        }
      ]
    }
  ]
}