{
  "id": "fv93wb",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1586067106.0,
  "title": "Something people don’t understand about anorexia",
  "selftext": "Everyone’s ED is different, but overall I have found laypeople often fail to understand that not everyone with anorexia desires to be healthy. I’d like to say that I do, and to actually mean it. But if we wanted so badly to be healthy, we would “just eat” as people wisely advise me. A girl in my anxiety disorders seminar once said “anorexic people know it’s bad to not eat, so why would they still starve themselves?“ \n\nI want to be underweight. I think many of us do. The diagnostic criteria for anorexia literally references weight loss. So telling me “you can’t afford to lose any more weight because then you’ll be unhealthy” isn’t going to change anything. In my eating-disordered mind, healthy = fat = bad. \n\nRecovery is all about gaining the desire to be healthy, to feel healthy. But in the vices of anorexia, I don’t think any of us are sitting around under any pretenses that what we are doing is conducive to our maximal health. Nobody is like, “restricting/being underweight makes my body function better than it could if it was sufficiently nourished! It helps my mental health so much! 10/10 would recommend feeling like shit every day!” The nature of this illness is that I want to lose weight, to be underweight, and by definition, that is “unhealthy”.\n\nI wish people would stop trying to use the “you know this isn’t healthy!” argument because honestly that only encourages and applauds my ED. My advice to those people is to stop assuming that the end goal for the eating disordered mind is health, and trying to handle the conversations as such. Take away healthy/unhealthy references and focus on other aspects beyond physical fitness when trying to help someone who is suffering. \n\nPeople assume we all have a survival instinct and a drive to be happy and healthy and to preserve our own lives. That’s why it’s unfathomable to many why someone would deliberately eat less than they should to be healthy, if the food is available. But if that were the case, then mental illnesses wouldn’t exist. \n\nWhat do you guys think? Do you feel similarly? Have people tried to cure you by telling you that you don’t “need” to lose weight and it’s “not healthy” to restrict?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/fv93wb/something_people_dont_understand_about_anorexia/",
  "score": 164,
  "num_comments": 48,
  "comments": [
    {
      "id": "fmh85cn",
      "author": "humanskincalories",
      "body": "I've definitely been told that I don't need to lose weight because \"Boys like girls with thick thighs and big tits\" which I mean . . . Even if I was doing this for other people, if someone didn't like me BECAUSE of whatever body I have, they don't deserve to be with me, simple as that\n\nI also feel like we as a community have this conversation every other week about how you can't \"just eat\" and then be cured, but somehow nobody else gets the memo .\\_.",
      "created_utc": 1586069969.0,
      "score": 43,
      "context": []
    },
    {
      "id": "fmh8yf7",
      "author": "RexieSquad",
      "body": "They don't understand it because it's unnatural , we are basically wired to aspire to be as healthy as possible. We go against the most basic human survival instincts. \n\nBut, personally of course i get what you are saying, we don't care we just want to get low in weight, low in BMI, low in the space we occupy.",
      "created_utc": 1586070780.0,
      "score": 27,
      "context": []
    },
    {
      "id": "fmhbkw4",
      "author": "None",
      "body": "When I was in group treatment (for bulimia but anyway), they were like \"but when you lose all that weight unhealthily then you'll have thin hair, bad skin etc, you won't even look pretty then\" and me and another girl were both saying \"yeaaaah I'd still rather be thin\". Like how did they not get it? We weren't doing it to LOOK PRETTY. And these were people licensed to help us.",
      "created_utc": 1586073556.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fmhq8p0",
      "author": "chris-is-tht-a-weed",
      "body": "I knew that eventful day 2 years ago that starving myself would be bad and could eventually lead to bad things.  I’m not “pro” but I remember trying to lose weight the healthy way and just couldn’t anymore. \nBut I didn’t care, I wanted to be thin. I’m recovering now but I hate it. With anorexia, you’re delusional and people wont understand it because they don’t feel our same delusion. Randomly I’ll get a look in the mirror and realize how thin I actually am and get kind of nervous but 99% of the time I will always see fat, feel fat, just fat. All the time. It’s 5:30 am and I’m awake because I had a normal person amount of food my stomach feels swollen and uncomfortable. The worst part is when I get on that scale and see a “good number” even when it’s painfully low it sparks this feeling of euphoria like no other.",
      "created_utc": 1586090166.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fmhchpq",
      "author": "ImJustTired__",
      "body": "I guess the reason people don’t get it is because it’s so unnatural. People have to eat to stay alive, and anorexia goes completely against that. Purposely being both unhealthy and unhappy doesn’t really make sense at all.",
      "created_utc": 1586074564.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fmhmbn0",
      "author": "justtellmeimcrazy",
      "body": "It’s like the people who tell smokers they’re going to get cancer. They know. They just don’t care about that outcome as much as the other ones they perceive as beneficial.",
      "created_utc": 1586086081.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fmhv57b",
      "author": "henriuitant",
      "body": "I feel this. And I think it's even further than that, it's doesn't have to be healthy = fat, it's also healthy = not destructive enough, unhealthy = the only thing you you're allowed to be, suffering through hunger is the only thing that prevents you from feeling too much but at the same time the only thing that makes you feel alive. I hated when people talked to me about health because it was so far from my concerns for myself.\n\nI'm basically recovered and the balance has switched, I feel healthy and I'm happy about it, it basically switches by itself throughout recovery (even though it feels terribly wrong at first) . It's a hard and long way to go but it's definitely worth it and mainly it's possible, I wish you all the best !!!",
      "created_utc": 1586094395.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fmhnbrn",
      "author": "None",
      "body": "> Have people tried to cure you by telling you that you don’t “need” to lose weight and it’s “not healthy” to restrict?\n\nPeople definitely don’t get it. I don’t necessarily blame them, but it makes it even more difficult and isolating. \n\nI think my parents think it’s “just” a mental illness and they want recovery but I’m ambivalent every step of the way :/",
      "created_utc": 1586087157.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fmhoguq",
      "author": "None",
      "body": "i wish people would understand that some people don’t lose weight as quickly as others - i’ve not been eating much at all or purging but just because i look “normal” doesn’t mean i’m not suffering",
      "created_utc": 1586088375.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fmi5d3b",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1586102754.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fmjtsah",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1586137589.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fmiis10",
      "author": "Wanna-be_skinnyfit",
      "body": "I have ednos... and my parents always tell me that I have orthorexia and have had anorexia (my Ed is a goddamn shapeshifter) but to be honest, yes I eat very healthy, yes I’m scared of eating “normal” amounts of saturated fat and sugar or other generally unhealthy food (butter, cream, sugary things, Lot of white carbs, fatty meat, and so on) BUT I actually don’t really care about my health that much... what I do care about is how much fat/muscle I have on my body and which body fat percentage I have... not “eating healthy” I just do it to maintain my weight and low body fat percentage and I’m just scared I will gain fat if I eat normal amounts of sugar, saturated fat and so on... (I have also struggled with orthorexia about a little under a year ago... I told you it was a shapeshifter😉)",
      "created_utc": 1586110404.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmhyu8y",
      "author": "None",
      "body": "Yes definitely. I don’t really care about being healthy. I’m 107 pounds but my goal weight is ~100. I want to be skinny. I want to look a certain way in clothing. I want to be confident in my own skin. I want to wear summer clothes and be comfortable with how I look. I want collarbones showing, skinny arms, small stomach. \nAnd the only way I can be confident in myself is if I get down to my goal weight. I’ve done it about twice before and I loved the way I looked. It’s not about being healthy, and I’m surprised a lot of people think so",
      "created_utc": 1586097948.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmv94ao",
      "author": "AllergicToChicken69",
      "body": "op, you are absolutely right. it’s not easy as “just eat.” i feel disgusting for eating. i can’t do it, even if i know it’s bad for me.",
      "created_utc": 1586409471.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmhbshu",
      "author": "None",
      "body": "Ugh I HATE that whole \"guys like girls with meat on their bones\" thing. Um. No. Guys are individual people who like different things, and anyway they're not all so shallow that only one body type will be acceptable to them, and also why should I care what guys like anyway. It's just the worst.",
      "created_utc": 1586073788.0,
      "score": 23,
      "context": [
        {
          "id": "fmh85cn",
          "author": "humanskincalories",
          "body": "I've definitely been told that I don't need to lose weight because \"Boys like girls with thick thighs and big tits\" which I mean . . . Even if I was doing this for other people, if someone didn't like me BECAUSE of whatever body I have, they don't deserve to be with me, simple as that\n\nI also feel like we as a community have this conversation every other week about how you can't \"just eat\" and then be cured, but somehow nobody else gets the memo .\\_.",
          "created_utc": 1586069969.0
        }
      ]
    },
    {
      "id": "fmh9hhu",
      "author": "None",
      "body": "Complimenting our bodies or making \"reassuring\" comments isn't going to help ANYTHING. And as you point out, I'm not doing this for other people. I'm not doing it to look attractive to guys. \n\nThe other thing is people think that those with anorexia straight-up starve. If we literally did not eat or drink a single thing, the mortaility rate would be through the roof. It's more like intermittent starvation mixed with restriction over time. So I do eat. Just not enough. \n\nI hate how people comment on my food too. Sometimes they'll be like wow you're so lucky you can eat like that and still look good. I'm like, how do you know this goddamn burger isn't the first food I've had in 3 days? Unsolicited comments on my body and diet will be the death of me.",
      "created_utc": 1586071328.0,
      "score": 27,
      "context": [
        {
          "id": "fmh85cn",
          "author": "humanskincalories",
          "body": "I've definitely been told that I don't need to lose weight because \"Boys like girls with thick thighs and big tits\" which I mean . . . Even if I was doing this for other people, if someone didn't like me BECAUSE of whatever body I have, they don't deserve to be with me, simple as that\n\nI also feel like we as a community have this conversation every other week about how you can't \"just eat\" and then be cured, but somehow nobody else gets the memo .\\_.",
          "created_utc": 1586069969.0
        }
      ]
    },
    {
      "id": "fmhub59",
      "author": "OuterKitKat",
      "body": "Ugh, I got told this so often and it fucking made my ED worse because I’m a lesbian with a ton of intrusive thoughts relating to men so what I want most in this earth is to be unattractive to them >_<. \n\nNo help at all + its fucking dumb.",
      "created_utc": 1586093727.0,
      "score": 10,
      "context": [
        {
          "id": "fmh85cn",
          "author": "humanskincalories",
          "body": "I've definitely been told that I don't need to lose weight because \"Boys like girls with thick thighs and big tits\" which I mean . . . Even if I was doing this for other people, if someone didn't like me BECAUSE of whatever body I have, they don't deserve to be with me, simple as that\n\nI also feel like we as a community have this conversation every other week about how you can't \"just eat\" and then be cured, but somehow nobody else gets the memo .\\_.",
          "created_utc": 1586069969.0
        }
      ]
    },
    {
      "id": "fmh9pjm",
      "author": "None",
      "body": "It's so messed up that we feel like that. I get how strange it seems to the outside world that we could tamp down our survival instinct. I am an otherwise healthy young woman. Good vitals, no pre-existing conditions, good teeth, good skin, always have great lab work, great immune system, etc. so why would I want to be unhealthy by losing weight when I should be grateful for my health and take care of my body? Ugh. That's just the nature of the eating disorder.",
      "created_utc": 1586071562.0,
      "score": 9,
      "context": [
        {
          "id": "fmh8yf7",
          "author": "RexieSquad",
          "body": "They don't understand it because it's unnatural , we are basically wired to aspire to be as healthy as possible. We go against the most basic human survival instincts. \n\nBut, personally of course i get what you are saying, we don't care we just want to get low in weight, low in BMI, low in the space we occupy.",
          "created_utc": 1586070780.0
        }
      ]
    },
    {
      "id": "fmi6s83",
      "author": "maps_on_the_wall",
      "body": ">low in the space we occupy \n\nI relate so hard",
      "created_utc": 1586103578.0,
      "score": 6,
      "context": [
        {
          "id": "fmh8yf7",
          "author": "RexieSquad",
          "body": "They don't understand it because it's unnatural , we are basically wired to aspire to be as healthy as possible. We go against the most basic human survival instincts. \n\nBut, personally of course i get what you are saying, we don't care we just want to get low in weight, low in BMI, low in the space we occupy.",
          "created_utc": 1586070780.0
        }
      ]
    },
    {
      "id": "fmip2cn",
      "author": "None",
      "body": "But didn't you know, only girls develop anorexia because Barbie and supermodels brainwashed us-\n\nLike what do they think about boys who have an ED? Are they trying to be pretty??",
      "created_utc": 1586114019.0,
      "score": 6,
      "context": [
        {
          "id": "fmhbkw4",
          "author": "None",
          "body": "When I was in group treatment (for bulimia but anyway), they were like \"but when you lose all that weight unhealthily then you'll have thin hair, bad skin etc, you won't even look pretty then\" and me and another girl were both saying \"yeaaaah I'd still rather be thin\". Like how did they not get it? We weren't doing it to LOOK PRETTY. And these were people licensed to help us.",
          "created_utc": 1586073556.0
        }
      ]
    },
    {
      "id": "fmhncsb",
      "author": "None",
      "body": "> And these were people licensed to help us.\n\nYeah even therapists don’t get it.",
      "created_utc": 1586087189.0,
      "score": 5,
      "context": [
        {
          "id": "fmhbkw4",
          "author": "None",
          "body": "When I was in group treatment (for bulimia but anyway), they were like \"but when you lose all that weight unhealthily then you'll have thin hair, bad skin etc, you won't even look pretty then\" and me and another girl were both saying \"yeaaaah I'd still rather be thin\". Like how did they not get it? We weren't doing it to LOOK PRETTY. And these were people licensed to help us.",
          "created_utc": 1586073556.0
        }
      ]
    },
    {
      "id": "fmibfh1",
      "author": "None",
      "body": "Oh my god that's terrible. That's the other thing. I generally care more about what my body looks like than my face. The goal is not to look pretty, it's to look thin. I hate when people are like \"you're such a pretty little girl!\" First of all, telling anyone they'll be ugly if they do xyz isn't helpful. Second of all, I appreciate the compliment but my ED brain is not flattered that you are commenting on my face.",
      "created_utc": 1586106225.0,
      "score": 3,
      "context": [
        {
          "id": "fmhbkw4",
          "author": "None",
          "body": "When I was in group treatment (for bulimia but anyway), they were like \"but when you lose all that weight unhealthily then you'll have thin hair, bad skin etc, you won't even look pretty then\" and me and another girl were both saying \"yeaaaah I'd still rather be thin\". Like how did they not get it? We weren't doing it to LOOK PRETTY. And these were people licensed to help us.",
          "created_utc": 1586073556.0
        }
      ]
    },
    {
      "id": "fmhro31",
      "author": "None",
      "body": "I'm with you. I made a post the other day about fluctuating body image. I\"m only on the cusp of being underweight, but I know I've lost weight in the past year or so through gradual under-eating, and I have noticed at points that I do look thinner, but not enough to ever be nervous or concerned. I made another post about how shitty my stomach feels after eating when I've been restricting, I get the worst stomach cramps if I have a regular sized meal. \n\nAN is an addiction and the brain's reward circuitry as well as dopamine, both things involved in addiction, are affected by it. That's where the sense of euphoria comes from. Knowing that you've lost weight sends the same dopaminergic burst to your brain that addicts always experience when they engage in the addictive behavior. It's misguided, but at least it's scientifically backed!",
      "created_utc": 1586091472.0,
      "score": 8,
      "context": [
        {
          "id": "fmhq8p0",
          "author": "chris-is-tht-a-weed",
          "body": "I knew that eventful day 2 years ago that starving myself would be bad and could eventually lead to bad things.  I’m not “pro” but I remember trying to lose weight the healthy way and just couldn’t anymore. \nBut I didn’t care, I wanted to be thin. I’m recovering now but I hate it. With anorexia, you’re delusional and people wont understand it because they don’t feel our same delusion. Randomly I’ll get a look in the mirror and realize how thin I actually am and get kind of nervous but 99% of the time I will always see fat, feel fat, just fat. All the time. It’s 5:30 am and I’m awake because I had a normal person amount of food my stomach feels swollen and uncomfortable. The worst part is when I get on that scale and see a “good number” even when it’s painfully low it sparks this feeling of euphoria like no other.",
          "created_utc": 1586090166.0
        }
      ]
    },
    {
      "id": "fmhrohb",
      "author": "None",
      "body": "I'm with you. I made a post the other day about fluctuating body image. I\"m only on the cusp of being underweight, but I know I've lost weight in the past year or so through gradual under-eating, and I have noticed at points that I do look thinner, but not enough to ever be nervous or concerned. I made another post about how shitty my stomach feels after eating when I've been restricting, I get the worst stomach cramps if I have a regular sized meal. \n\nAN is an addiction and the brain's reward circuitry as well as dopamine, both things involved in addiction, are affected by it. That's where the sense of euphoria comes from. Knowing that you've lost weight sends the same dopaminergic burst to your brain that addicts always experience when they engage in the addictive behavior. It's misguided, but at least it's scientifically backed!",
      "created_utc": 1586091482.0,
      "score": 2,
      "context": [
        {
          "id": "fmhq8p0",
          "author": "chris-is-tht-a-weed",
          "body": "I knew that eventful day 2 years ago that starving myself would be bad and could eventually lead to bad things.  I’m not “pro” but I remember trying to lose weight the healthy way and just couldn’t anymore. \nBut I didn’t care, I wanted to be thin. I’m recovering now but I hate it. With anorexia, you’re delusional and people wont understand it because they don’t feel our same delusion. Randomly I’ll get a look in the mirror and realize how thin I actually am and get kind of nervous but 99% of the time I will always see fat, feel fat, just fat. All the time. It’s 5:30 am and I’m awake because I had a normal person amount of food my stomach feels swollen and uncomfortable. The worst part is when I get on that scale and see a “good number” even when it’s painfully low it sparks this feeling of euphoria like no other.",
          "created_utc": 1586090166.0
        }
      ]
    },
    {
      "id": "fmiabsg",
      "author": "None",
      "body": "Right and that's why people struggle to understand GAD as well. They're like how on earth/why would people want to be in a state of constant negativity and pessimism?? It does seem paradoxical to emotionally torment yourself and be perpetually anxious, because shouldn't we all want to be healthy and happy? But when your baseline is stress/anxiety/being unhealthy, it's hard to diverge from that.",
      "created_utc": 1586105593.0,
      "score": 5,
      "context": [
        {
          "id": "fmhchpq",
          "author": "ImJustTired__",
          "body": "I guess the reason people don’t get it is because it’s so unnatural. People have to eat to stay alive, and anorexia goes completely against that. Purposely being both unhealthy and unhappy doesn’t really make sense at all.",
          "created_utc": 1586074564.0
        }
      ]
    },
    {
      "id": "fmhnfn0",
      "author": "None",
      "body": "> Purposely being both unhealthy and unhappy doesn’t really make sense at all.\n\nTotally, and they steamroll us in an attempt to explain it. Especially psychologists IME",
      "created_utc": 1586087272.0,
      "score": 4,
      "context": [
        {
          "id": "fmhchpq",
          "author": "ImJustTired__",
          "body": "I guess the reason people don’t get it is because it’s so unnatural. People have to eat to stay alive, and anorexia goes completely against that. Purposely being both unhealthy and unhappy doesn’t really make sense at all.",
          "created_utc": 1586074564.0
        }
      ]
    },
    {
      "id": "fmhngus",
      "author": "None",
      "body": "It’s deeper than that. Addiction isn’t egosyntonic, AN is. It’s really deep-rooted.",
      "created_utc": 1586087309.0,
      "score": 7,
      "context": [
        {
          "id": "fmhmbn0",
          "author": "justtellmeimcrazy",
          "body": "It’s like the people who tell smokers they’re going to get cancer. They know. They just don’t care about that outcome as much as the other ones they perceive as beneficial.",
          "created_utc": 1586086081.0
        }
      ]
    },
    {
      "id": "fmi97d0",
      "author": "None",
      "body": "Exactly. I'm not an idiot, I'm under no delusions that this is the healthiest coping mechanism and my body totally loves what I'm doing to it. But it's a coping mechanism nonetheless so the benefits outweight the downsides. People \"shouldn't\" want to inflict pain and injury on themselves, either, but they do. That's the nature of mental illness.",
      "created_utc": 1586104949.0,
      "score": 5,
      "context": [
        {
          "id": "fmhmbn0",
          "author": "justtellmeimcrazy",
          "body": "It’s like the people who tell smokers they’re going to get cancer. They know. They just don’t care about that outcome as much as the other ones they perceive as beneficial.",
          "created_utc": 1586086081.0
        }
      ]
    },
    {
      "id": "fmhyejb",
      "author": "None",
      "body": "I was in pretty solid recovery for about 8 years, but it creeps back up when I'm stressed and it is so easy to slide back into that. For me my ED isn't so much about suffering and preventing me feeling too much (I wish it did) but just a sense of control towards a goal that I have that for whatever reason I think will make me happy. In order to reach that goal, I know I will have to be unhealthy. The idea of being healthy is in direct opposition to the purpose and end goal of my ED behaviors, so people lecturing me about health is beside the point. Thanks for your well wishes!",
      "created_utc": 1586097589.0,
      "score": 3,
      "context": [
        {
          "id": "fmhv57b",
          "author": "henriuitant",
          "body": "I feel this. And I think it's even further than that, it's doesn't have to be healthy = fat, it's also healthy = not destructive enough, unhealthy = the only thing you you're allowed to be, suffering through hunger is the only thing that prevents you from feeling too much but at the same time the only thing that makes you feel alive. I hated when people talked to me about health because it was so far from my concerns for myself.\n\nI'm basically recovered and the balance has switched, I feel healthy and I'm happy about it, it basically switches by itself throughout recovery (even though it feels terribly wrong at first) . It's a hard and long way to go but it's definitely worth it and mainly it's possible, I wish you all the best !!!",
          "created_utc": 1586094395.0
        }
      ]
    },
    {
      "id": "fmi8kpq",
      "author": "None",
      "body": "Trivializing mental illness makes me so angry. It's as serious a condition as any other medical condition and anorexia especially can have dire medical consequences. Of all the mental illnesses, it has the highest mortality rate by far. It's absurd that anyone would dismiss it.",
      "created_utc": 1586104588.0,
      "score": 2,
      "context": [
        {
          "id": "fmhnbrn",
          "author": "None",
          "body": "> Have people tried to cure you by telling you that you don’t “need” to lose weight and it’s “not healthy” to restrict?\n\nPeople definitely don’t get it. I don’t necessarily blame them, but it makes it even more difficult and isolating. \n\nI think my parents think it’s “just” a mental illness and they want recovery but I’m ambivalent every step of the way :/",
          "created_utc": 1586087157.0
        }
      ]
    },
    {
      "id": "fmi8g9u",
      "author": "None",
      "body": "You are so right. Everyone's body is different. I actually just made a post about this - https://www.reddit.com/r/AnorexiaNervosa/comments/fvej8k/anorexia_does_not_have_one_fixed_image_lets_stop/",
      "created_utc": 1586104517.0,
      "score": 1,
      "context": [
        {
          "id": "fmhoguq",
          "author": "None",
          "body": "i wish people would understand that some people don’t lose weight as quickly as others - i’ve not been eating much at all or purging but just because i look “normal” doesn’t mean i’m not suffering",
          "created_utc": 1586088375.0
        }
      ]
    },
    {
      "id": "fmic7rh",
      "author": "None",
      "body": "Ugh, I have a specific look I want to achieve and I feel like once I'm a certain amount of underweight, I'll feel better. Of course I know it'll never be enough, but I just feel like I'll finally be where I want to be and people will be able to see my suffering. I guess it's like how self-harming can have the same effect, showing the outside world a physical representation of your pain.",
      "created_utc": 1586106677.0,
      "score": 1,
      "context": [
        {
          "id": "fmi5d3b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1586102754.0
        }
      ]
    },
    {
      "id": "fmjuc29",
      "author": "None",
      "body": "Haha feel free to quote the post or send it to her! Parents in particular are the worst with this stuff. They want their children to be healthy and their goal as a nurturer is to ensure that, so when their child is doing something unhealthy, they automatically take that stance. But I always got a high from people telling me I looked/was doing something unhealthy, because the end goal of anorexia as a disorder is to reach that point on the scale where you no longer fall in the “healthy” weight range. Telling someone with anorexia that it’s not good for their health is like telling a smoker that it’s not good for their lungs. Chances are, they’re quite well aware of it. But reminding them isn’t going to change a thing, especially when anorexia is oftentimes driven by the desire to be at an unhealthy weight.",
      "created_utc": 1586137913.0,
      "score": 4,
      "context": [
        {
          "id": "fmjtsah",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1586137589.0
        }
      ]
    },
    {
      "id": "fmij9so",
      "author": "None",
      "body": "Oh man, I'm sorry to hear that. I'm lucky that I was never an exerciser or paid attention to specific macronutrients, etc. - just focused on my overall body size/weight. That would be a whole new level of exhausting, it's stressful enough obsessing over calories and the number on the scale without taking those aspects into account... I'm so sorry you have to deal with all of that!",
      "created_utc": 1586110687.0,
      "score": 1,
      "context": [
        {
          "id": "fmiis10",
          "author": "Wanna-be_skinnyfit",
          "body": "I have ednos... and my parents always tell me that I have orthorexia and have had anorexia (my Ed is a goddamn shapeshifter) but to be honest, yes I eat very healthy, yes I’m scared of eating “normal” amounts of saturated fat and sugar or other generally unhealthy food (butter, cream, sugary things, Lot of white carbs, fatty meat, and so on) BUT I actually don’t really care about my health that much... what I do care about is how much fat/muscle I have on my body and which body fat percentage I have... not “eating healthy” I just do it to maintain my weight and low body fat percentage and I’m just scared I will gain fat if I eat normal amounts of sugar, saturated fat and so on... (I have also struggled with orthorexia about a little under a year ago... I told you it was a shapeshifter😉)",
          "created_utc": 1586110404.0
        }
      ]
    },
    {
      "id": "fmh9wzu",
      "author": "humanskincalories",
      "body": "There's also the fact that everyone has binged or has felt like they have binged, it doesn't automatically make anyone a fake anorexic or anything!!! and it's not like EDNOS doesn't exist, either which is just as valid!!",
      "created_utc": 1586071786.0,
      "score": 11,
      "context": [
        {
          "id": "fmh85cn",
          "author": "humanskincalories",
          "body": "I've definitely been told that I don't need to lose weight because \"Boys like girls with thick thighs and big tits\" which I mean . . . Even if I was doing this for other people, if someone didn't like me BECAUSE of whatever body I have, they don't deserve to be with me, simple as that\n\nI also feel like we as a community have this conversation every other week about how you can't \"just eat\" and then be cured, but somehow nobody else gets the memo .\\_.",
          "created_utc": 1586069969.0
        },
        {
          "id": "fmh9hhu",
          "author": "None",
          "body": "Complimenting our bodies or making \"reassuring\" comments isn't going to help ANYTHING. And as you point out, I'm not doing this for other people. I'm not doing it to look attractive to guys. \n\nThe other thing is people think that those with anorexia straight-up starve. If we literally did not eat or drink a single thing, the mortaility rate would be through the roof. It's more like intermittent starvation mixed with restriction over time. So I do eat. Just not enough. \n\nI hate how people comment on my food too. Sometimes they'll be like wow you're so lucky you can eat like that and still look good. I'm like, how do you know this goddamn burger isn't the first food I've had in 3 days? Unsolicited comments on my body and diet will be the death of me.",
          "created_utc": 1586071328.0
        }
      ]
    },
    {
      "id": "fmhm5fv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1586085887.0,
      "score": 9,
      "context": [
        {
          "id": "fmh85cn",
          "author": "humanskincalories",
          "body": "I've definitely been told that I don't need to lose weight because \"Boys like girls with thick thighs and big tits\" which I mean . . . Even if I was doing this for other people, if someone didn't like me BECAUSE of whatever body I have, they don't deserve to be with me, simple as that\n\nI also feel like we as a community have this conversation every other week about how you can't \"just eat\" and then be cured, but somehow nobody else gets the memo .\\_.",
          "created_utc": 1586069969.0
        },
        {
          "id": "fmh9hhu",
          "author": "None",
          "body": "Complimenting our bodies or making \"reassuring\" comments isn't going to help ANYTHING. And as you point out, I'm not doing this for other people. I'm not doing it to look attractive to guys. \n\nThe other thing is people think that those with anorexia straight-up starve. If we literally did not eat or drink a single thing, the mortaility rate would be through the roof. It's more like intermittent starvation mixed with restriction over time. So I do eat. Just not enough. \n\nI hate how people comment on my food too. Sometimes they'll be like wow you're so lucky you can eat like that and still look good. I'm like, how do you know this goddamn burger isn't the first food I've had in 3 days? Unsolicited comments on my body and diet will be the death of me.",
          "created_utc": 1586071328.0
        }
      ]
    },
    {
      "id": "fmipsky",
      "author": "None",
      "body": "Yeah, they were talking to us like it was just some kind of extreme diet and we could be reasoned out of it. They also told us purging doesn't work cause you absorb most of the calories before you throw them up, which... isn't true, and also sometimes you just NEED IT OUT OF YOUR BODY, which they didn't seem to get at all. So I found it hard to trust they could help me when they didn't understand my state of mind at all.",
      "created_utc": 1586114443.0,
      "score": 7,
      "context": [
        {
          "id": "fmhbkw4",
          "author": "None",
          "body": "When I was in group treatment (for bulimia but anyway), they were like \"but when you lose all that weight unhealthily then you'll have thin hair, bad skin etc, you won't even look pretty then\" and me and another girl were both saying \"yeaaaah I'd still rather be thin\". Like how did they not get it? We weren't doing it to LOOK PRETTY. And these were people licensed to help us.",
          "created_utc": 1586073556.0
        },
        {
          "id": "fmip2cn",
          "author": "None",
          "body": "But didn't you know, only girls develop anorexia because Barbie and supermodels brainwashed us-\n\nLike what do they think about boys who have an ED? Are they trying to be pretty??",
          "created_utc": 1586114019.0
        }
      ]
    },
    {
      "id": "fmipaas",
      "author": "None",
      "body": "True but it's a good analogy for normal people to try to understand, cause some people have no idea",
      "created_utc": 1586114148.0,
      "score": 4,
      "context": [
        {
          "id": "fmhmbn0",
          "author": "justtellmeimcrazy",
          "body": "It’s like the people who tell smokers they’re going to get cancer. They know. They just don’t care about that outcome as much as the other ones they perceive as beneficial.",
          "created_utc": 1586086081.0
        },
        {
          "id": "fmhngus",
          "author": "None",
          "body": "It’s deeper than that. Addiction isn’t egosyntonic, AN is. It’s really deep-rooted.",
          "created_utc": 1586087309.0
        }
      ]
    },
    {
      "id": "fmiikoc",
      "author": "None",
      "body": "Absolutely. It’s one of the most widespread forms of stigma against anorexia. Even my female friends do it. \n\nIt has by far the highest mortality rate, and it kills the young, but no one cares because it afflicts 90% women.",
      "created_utc": 1586110285.0,
      "score": 2,
      "context": [
        {
          "id": "fmhnbrn",
          "author": "None",
          "body": "> Have people tried to cure you by telling you that you don’t “need” to lose weight and it’s “not healthy” to restrict?\n\nPeople definitely don’t get it. I don’t necessarily blame them, but it makes it even more difficult and isolating. \n\nI think my parents think it’s “just” a mental illness and they want recovery but I’m ambivalent every step of the way :/",
          "created_utc": 1586087157.0
        },
        {
          "id": "fmi8kpq",
          "author": "None",
          "body": "Trivializing mental illness makes me so angry. It's as serious a condition as any other medical condition and anorexia especially can have dire medical consequences. Of all the mental illnesses, it has the highest mortality rate by far. It's absurd that anyone would dismiss it.",
          "created_utc": 1586104588.0
        }
      ]
    },
    {
      "id": "fmjv2sz",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1586138348.0,
      "score": 2,
      "context": [
        {
          "id": "fmjtsah",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1586137589.0
        },
        {
          "id": "fmjuc29",
          "author": "None",
          "body": "Haha feel free to quote the post or send it to her! Parents in particular are the worst with this stuff. They want their children to be healthy and their goal as a nurturer is to ensure that, so when their child is doing something unhealthy, they automatically take that stance. But I always got a high from people telling me I looked/was doing something unhealthy, because the end goal of anorexia as a disorder is to reach that point on the scale where you no longer fall in the “healthy” weight range. Telling someone with anorexia that it’s not good for their health is like telling a smoker that it’s not good for their lungs. Chances are, they’re quite well aware of it. But reminding them isn’t going to change a thing, especially when anorexia is oftentimes driven by the desire to be at an unhealthy weight.",
          "created_utc": 1586137913.0
        }
      ]
    },
    {
      "id": "fmik4ld",
      "author": "Wanna-be_skinnyfit",
      "body": "Oh well we’ve all been through some stuff that nobody should have been through... but I promise you! I have been counting macros, exercising between #-#hours A DAY, obsessing over my body and all that kinda shit... and anorexia was kinda more simple to me... eat less, and less, and less, weigh yourself again and again, but it was just more simple... also I’m still counting macros and calories, exercising between #-#hours a day, eating real healthy (I’ve only eaten one actually “unhealthy” thing THIS YEAR and it was ONE FRICKIN SMALL REESES PB CUP WORTH ## kcal ) but to be Honest i just dont really Care about “healthy” i just dont wanna gain fat...😒",
      "created_utc": 1586111174.0,
      "score": 2,
      "context": [
        {
          "id": "fmiis10",
          "author": "Wanna-be_skinnyfit",
          "body": "I have ednos... and my parents always tell me that I have orthorexia and have had anorexia (my Ed is a goddamn shapeshifter) but to be honest, yes I eat very healthy, yes I’m scared of eating “normal” amounts of saturated fat and sugar or other generally unhealthy food (butter, cream, sugary things, Lot of white carbs, fatty meat, and so on) BUT I actually don’t really care about my health that much... what I do care about is how much fat/muscle I have on my body and which body fat percentage I have... not “eating healthy” I just do it to maintain my weight and low body fat percentage and I’m just scared I will gain fat if I eat normal amounts of sugar, saturated fat and so on... (I have also struggled with orthorexia about a little under a year ago... I told you it was a shapeshifter😉)",
          "created_utc": 1586110404.0
        },
        {
          "id": "fmij9so",
          "author": "None",
          "body": "Oh man, I'm sorry to hear that. I'm lucky that I was never an exerciser or paid attention to specific macronutrients, etc. - just focused on my overall body size/weight. That would be a whole new level of exhausting, it's stressful enough obsessing over calories and the number on the scale without taking those aspects into account... I'm so sorry you have to deal with all of that!",
          "created_utc": 1586110687.0
        }
      ]
    },
    {
      "id": "fmibm5r",
      "author": "None",
      "body": "I know! I just made a post sorta related - https://www.reddit.com/r/AnorexiaNervosa/comments/fvej8k/anorexia_does_not_have_one_fixed_image_lets_stop/\n\nI hate that there is this pressure on you when you have an ED to \"do it right\". I always felt out of place because I didn't weigh as little as the other girls I was in treatment with. Or I would eat a full meal and be like, well, guess I'm not anorexic anymore. I was ashamed to really get help because I just felt like it was overreacting because my body didn't look the way I thought it should in order to be valid.",
      "created_utc": 1586106332.0,
      "score": 7,
      "context": [
        {
          "id": "fmh85cn",
          "author": "humanskincalories",
          "body": "I've definitely been told that I don't need to lose weight because \"Boys like girls with thick thighs and big tits\" which I mean . . . Even if I was doing this for other people, if someone didn't like me BECAUSE of whatever body I have, they don't deserve to be with me, simple as that\n\nI also feel like we as a community have this conversation every other week about how you can't \"just eat\" and then be cured, but somehow nobody else gets the memo .\\_.",
          "created_utc": 1586069969.0
        },
        {
          "id": "fmh9hhu",
          "author": "None",
          "body": "Complimenting our bodies or making \"reassuring\" comments isn't going to help ANYTHING. And as you point out, I'm not doing this for other people. I'm not doing it to look attractive to guys. \n\nThe other thing is people think that those with anorexia straight-up starve. If we literally did not eat or drink a single thing, the mortaility rate would be through the roof. It's more like intermittent starvation mixed with restriction over time. So I do eat. Just not enough. \n\nI hate how people comment on my food too. Sometimes they'll be like wow you're so lucky you can eat like that and still look good. I'm like, how do you know this goddamn burger isn't the first food I've had in 3 days? Unsolicited comments on my body and diet will be the death of me.",
          "created_utc": 1586071328.0
        },
        {
          "id": "fmh9wzu",
          "author": "humanskincalories",
          "body": "There's also the fact that everyone has binged or has felt like they have binged, it doesn't automatically make anyone a fake anorexic or anything!!! and it's not like EDNOS doesn't exist, either which is just as valid!!",
          "created_utc": 1586071786.0
        }
      ]
    },
    {
      "id": "fmia125",
      "author": "None",
      "body": "OH MY GOD I have so many horror stories... I remember I came into work with a bag of Doritos. My coworker teased me like \"is that your lunch?\" and I was like \"don't judge\" and she goes \"I'm just jealous that you can eat like THIS and look like THAT\" and gestured to my body. Another girl was like \"I wish I could eat like that and still be small\" when talking about my \"unhealthy\" chicken parm sandwich. My coworkers and I went out to dinner once and my coworker who knew about my eating disorder past was like \"you ate a whole meal and you seem fine.\" \n\nAnd I consistently get comments like \"wow you must have a great metabolism!\" if they see me eating a lot in one sitting, because when I undereat I'm undereating carbs and fast food so I usually joke about that. I'm like honestly no my metabolism is probably shit because I eat like one meal a day but thx lmao.",
      "created_utc": 1586105423.0,
      "score": 7,
      "context": [
        {
          "id": "fmh85cn",
          "author": "humanskincalories",
          "body": "I've definitely been told that I don't need to lose weight because \"Boys like girls with thick thighs and big tits\" which I mean . . . Even if I was doing this for other people, if someone didn't like me BECAUSE of whatever body I have, they don't deserve to be with me, simple as that\n\nI also feel like we as a community have this conversation every other week about how you can't \"just eat\" and then be cured, but somehow nobody else gets the memo .\\_.",
          "created_utc": 1586069969.0
        },
        {
          "id": "fmh9hhu",
          "author": "None",
          "body": "Complimenting our bodies or making \"reassuring\" comments isn't going to help ANYTHING. And as you point out, I'm not doing this for other people. I'm not doing it to look attractive to guys. \n\nThe other thing is people think that those with anorexia straight-up starve. If we literally did not eat or drink a single thing, the mortaility rate would be through the roof. It's more like intermittent starvation mixed with restriction over time. So I do eat. Just not enough. \n\nI hate how people comment on my food too. Sometimes they'll be like wow you're so lucky you can eat like that and still look good. I'm like, how do you know this goddamn burger isn't the first food I've had in 3 days? Unsolicited comments on my body and diet will be the death of me.",
          "created_utc": 1586071328.0
        },
        {
          "id": "fmhm5fv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1586085887.0
        }
      ]
    },
    {
      "id": "fmiqhb5",
      "author": "None",
      "body": "Ugh I hate when people say that lol if you can throw it up then the cals haven't been absorbed by your intestines obviously, I wouldn't be able to trust them either. Like are they teaching that in medical school??",
      "created_utc": 1586114848.0,
      "score": 6,
      "context": [
        {
          "id": "fmhbkw4",
          "author": "None",
          "body": "When I was in group treatment (for bulimia but anyway), they were like \"but when you lose all that weight unhealthily then you'll have thin hair, bad skin etc, you won't even look pretty then\" and me and another girl were both saying \"yeaaaah I'd still rather be thin\". Like how did they not get it? We weren't doing it to LOOK PRETTY. And these were people licensed to help us.",
          "created_utc": 1586073556.0
        },
        {
          "id": "fmip2cn",
          "author": "None",
          "body": "But didn't you know, only girls develop anorexia because Barbie and supermodels brainwashed us-\n\nLike what do they think about boys who have an ED? Are they trying to be pretty??",
          "created_utc": 1586114019.0
        },
        {
          "id": "fmipsky",
          "author": "None",
          "body": "Yeah, they were talking to us like it was just some kind of extreme diet and we could be reasoned out of it. They also told us purging doesn't work cause you absorb most of the calories before you throw them up, which... isn't true, and also sometimes you just NEED IT OUT OF YOUR BODY, which they didn't seem to get at all. So I found it hard to trust they could help me when they didn't understand my state of mind at all.",
          "created_utc": 1586114443.0
        }
      ]
    },
    {
      "id": "fmizh59",
      "author": "None",
      "body": "I'm not sure! I think one thing people don't understand about anorexia is that outcomes are grim and treatments aren't good.\n\nIt can make people more compassionate about the \"I can't believe you don't like food!!1!\" bit I guess?",
      "created_utc": 1586120012.0,
      "score": 2,
      "context": [
        {
          "id": "fmhmbn0",
          "author": "justtellmeimcrazy",
          "body": "It’s like the people who tell smokers they’re going to get cancer. They know. They just don’t care about that outcome as much as the other ones they perceive as beneficial.",
          "created_utc": 1586086081.0
        },
        {
          "id": "fmhngus",
          "author": "None",
          "body": "It’s deeper than that. Addiction isn’t egosyntonic, AN is. It’s really deep-rooted.",
          "created_utc": 1586087309.0
        },
        {
          "id": "fmipaas",
          "author": "None",
          "body": "True but it's a good analogy for normal people to try to understand, cause some people have no idea",
          "created_utc": 1586114148.0
        }
      ]
    },
    {
      "id": "fmijzqm",
      "author": "None",
      "body": "I feel like anorexia is the most commonly referenced and stigmatized eating disorder by far. One girl in a class told everyone \"like with anorexia, it's because people are vain\" YUP that's exactly it. We are just vain, shallow people.\n\nI know naturally thin people get that thrown at them too. I do think skinny-shaming is a thing. My coworker struggled to keep up her weight and people would tell her she looked disgusting, emaciated, and anorexic. \n\nI think also the norm for body weight in celebrities etc. is basically underweight, so it isn't until ribs and bones are showing that people start labeling them as anorexic (and even then, they still get praised a lot of times). So people start to associate anorexia with these radically emaciated actresses, even though the ones that seem \"healthy\" could very well have eating disorders too.",
      "created_utc": 1586111098.0,
      "score": 4,
      "context": [
        {
          "id": "fmhnbrn",
          "author": "None",
          "body": "> Have people tried to cure you by telling you that you don’t “need” to lose weight and it’s “not healthy” to restrict?\n\nPeople definitely don’t get it. I don’t necessarily blame them, but it makes it even more difficult and isolating. \n\nI think my parents think it’s “just” a mental illness and they want recovery but I’m ambivalent every step of the way :/",
          "created_utc": 1586087157.0
        },
        {
          "id": "fmi8kpq",
          "author": "None",
          "body": "Trivializing mental illness makes me so angry. It's as serious a condition as any other medical condition and anorexia especially can have dire medical consequences. Of all the mental illnesses, it has the highest mortality rate by far. It's absurd that anyone would dismiss it.",
          "created_utc": 1586104588.0
        },
        {
          "id": "fmiikoc",
          "author": "None",
          "body": "Absolutely. It’s one of the most widespread forms of stigma against anorexia. Even my female friends do it. \n\nIt has by far the highest mortality rate, and it kills the young, but no one cares because it afflicts 90% women.",
          "created_utc": 1586110285.0
        }
      ]
    },
    {
      "id": "fmjyee7",
      "author": "None",
      "body": "Screenshot and send it to her! It isn’t personal. No mental illness is. You’re not doing it to hurt her. I hate when people try to guilt you. My mental illness has nothing to do with anyone but myself. It isn’t to hurt anyone. It isn’t that I don’t care. It’s deeply personal and internal and independent of anyone but me myself and I.",
      "created_utc": 1586140271.0,
      "score": 2,
      "context": [
        {
          "id": "fmjtsah",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1586137589.0
        },
        {
          "id": "fmjuc29",
          "author": "None",
          "body": "Haha feel free to quote the post or send it to her! Parents in particular are the worst with this stuff. They want their children to be healthy and their goal as a nurturer is to ensure that, so when their child is doing something unhealthy, they automatically take that stance. But I always got a high from people telling me I looked/was doing something unhealthy, because the end goal of anorexia as a disorder is to reach that point on the scale where you no longer fall in the “healthy” weight range. Telling someone with anorexia that it’s not good for their health is like telling a smoker that it’s not good for their lungs. Chances are, they’re quite well aware of it. But reminding them isn’t going to change a thing, especially when anorexia is oftentimes driven by the desire to be at an unhealthy weight.",
          "created_utc": 1586137913.0
        },
        {
          "id": "fmjv2sz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1586138348.0
        }
      ]
    },
    {
      "id": "fmil1tf",
      "author": "None",
      "body": "(I would edit that to not include non-time related numbers) but I have gone through phases of trying to \"eat healthy\" which was really a thinly veiled attempt to try to restrict in the name of health. It isn't healthy when you're doing it for the wrong reasons, and I tended to abandon it because honestly, I don't like \"healthy\" food so I'd rather restrict on Taco Bell and McDonald's than try to eat salad every day, haha.",
      "created_utc": 1586111708.0,
      "score": 2,
      "context": [
        {
          "id": "fmiis10",
          "author": "Wanna-be_skinnyfit",
          "body": "I have ednos... and my parents always tell me that I have orthorexia and have had anorexia (my Ed is a goddamn shapeshifter) but to be honest, yes I eat very healthy, yes I’m scared of eating “normal” amounts of saturated fat and sugar or other generally unhealthy food (butter, cream, sugary things, Lot of white carbs, fatty meat, and so on) BUT I actually don’t really care about my health that much... what I do care about is how much fat/muscle I have on my body and which body fat percentage I have... not “eating healthy” I just do it to maintain my weight and low body fat percentage and I’m just scared I will gain fat if I eat normal amounts of sugar, saturated fat and so on... (I have also struggled with orthorexia about a little under a year ago... I told you it was a shapeshifter😉)",
          "created_utc": 1586110404.0
        },
        {
          "id": "fmij9so",
          "author": "None",
          "body": "Oh man, I'm sorry to hear that. I'm lucky that I was never an exerciser or paid attention to specific macronutrients, etc. - just focused on my overall body size/weight. That would be a whole new level of exhausting, it's stressful enough obsessing over calories and the number on the scale without taking those aspects into account... I'm so sorry you have to deal with all of that!",
          "created_utc": 1586110687.0
        },
        {
          "id": "fmik4ld",
          "author": "Wanna-be_skinnyfit",
          "body": "Oh well we’ve all been through some stuff that nobody should have been through... but I promise you! I have been counting macros, exercising between #-#hours A DAY, obsessing over my body and all that kinda shit... and anorexia was kinda more simple to me... eat less, and less, and less, weigh yourself again and again, but it was just more simple... also I’m still counting macros and calories, exercising between #-#hours a day, eating real healthy (I’ve only eaten one actually “unhealthy” thing THIS YEAR and it was ONE FRICKIN SMALL REESES PB CUP WORTH ## kcal ) but to be Honest i just dont really Care about “healthy” i just dont wanna gain fat...😒",
          "created_utc": 1586111174.0
        }
      ]
    },
    {
      "id": "fmiz7mx",
      "author": "None",
      "body": "> I feel like anorexia is the most commonly referenced and stigmatized eating disorder by far.\n\nI mean, different mental illnesses all have their idiosyncratic forms of stigma. Envy, for instance, is a form of stigma relatively unique to anorexia. But e.g. schizophrenia has its own forms of stigma. \n\nTbh I feel like a lot of it comes from the fact that it affects 90% women. Ironically, anorexics are not at all vain or shallow! \n\n>So people start to associate anorexia with these radically emaciated actresses, even though the ones that seem \"healthy\" could very well have eating disorders too.\n\nYeah totally, it's gross. A lot of them are in fact anorexic, one of the odd things about anorexia is that some people are quite accomplished (and well-groomed, going against what people expect for the mentally ill).",
      "created_utc": 1586119873.0,
      "score": 1,
      "context": [
        {
          "id": "fmhnbrn",
          "author": "None",
          "body": "> Have people tried to cure you by telling you that you don’t “need” to lose weight and it’s “not healthy” to restrict?\n\nPeople definitely don’t get it. I don’t necessarily blame them, but it makes it even more difficult and isolating. \n\nI think my parents think it’s “just” a mental illness and they want recovery but I’m ambivalent every step of the way :/",
          "created_utc": 1586087157.0
        },
        {
          "id": "fmi8kpq",
          "author": "None",
          "body": "Trivializing mental illness makes me so angry. It's as serious a condition as any other medical condition and anorexia especially can have dire medical consequences. Of all the mental illnesses, it has the highest mortality rate by far. It's absurd that anyone would dismiss it.",
          "created_utc": 1586104588.0
        },
        {
          "id": "fmiikoc",
          "author": "None",
          "body": "Absolutely. It’s one of the most widespread forms of stigma against anorexia. Even my female friends do it. \n\nIt has by far the highest mortality rate, and it kills the young, but no one cares because it afflicts 90% women.",
          "created_utc": 1586110285.0
        },
        {
          "id": "fmijzqm",
          "author": "None",
          "body": "I feel like anorexia is the most commonly referenced and stigmatized eating disorder by far. One girl in a class told everyone \"like with anorexia, it's because people are vain\" YUP that's exactly it. We are just vain, shallow people.\n\nI know naturally thin people get that thrown at them too. I do think skinny-shaming is a thing. My coworker struggled to keep up her weight and people would tell her she looked disgusting, emaciated, and anorexic. \n\nI think also the norm for body weight in celebrities etc. is basically underweight, so it isn't until ribs and bones are showing that people start labeling them as anorexic (and even then, they still get praised a lot of times). So people start to associate anorexia with these radically emaciated actresses, even though the ones that seem \"healthy\" could very well have eating disorders too.",
          "created_utc": 1586111098.0
        }
      ]
    },
    {
      "id": "fmilpz2",
      "author": "Wanna-be_skinnyfit",
      "body": "Like that? (See edit) Also haha I really get that and I completely agree with what you are writing... the problem is just that when you start with orthorexia, you do it for the right reasons but then it turns obsessive and takes over your life... but just imagine when I went through a mix of AN and Orthorexia... starving/restricting while ONLY eating certain foods and exercising as much as possible.... god I don’t even know how I actually did it without straying from the low amounts of my very few safe foods😓",
      "created_utc": 1586112095.0,
      "score": 3,
      "context": [
        {
          "id": "fmiis10",
          "author": "Wanna-be_skinnyfit",
          "body": "I have ednos... and my parents always tell me that I have orthorexia and have had anorexia (my Ed is a goddamn shapeshifter) but to be honest, yes I eat very healthy, yes I’m scared of eating “normal” amounts of saturated fat and sugar or other generally unhealthy food (butter, cream, sugary things, Lot of white carbs, fatty meat, and so on) BUT I actually don’t really care about my health that much... what I do care about is how much fat/muscle I have on my body and which body fat percentage I have... not “eating healthy” I just do it to maintain my weight and low body fat percentage and I’m just scared I will gain fat if I eat normal amounts of sugar, saturated fat and so on... (I have also struggled with orthorexia about a little under a year ago... I told you it was a shapeshifter😉)",
          "created_utc": 1586110404.0
        },
        {
          "id": "fmij9so",
          "author": "None",
          "body": "Oh man, I'm sorry to hear that. I'm lucky that I was never an exerciser or paid attention to specific macronutrients, etc. - just focused on my overall body size/weight. That would be a whole new level of exhausting, it's stressful enough obsessing over calories and the number on the scale without taking those aspects into account... I'm so sorry you have to deal with all of that!",
          "created_utc": 1586110687.0
        },
        {
          "id": "fmik4ld",
          "author": "Wanna-be_skinnyfit",
          "body": "Oh well we’ve all been through some stuff that nobody should have been through... but I promise you! I have been counting macros, exercising between #-#hours A DAY, obsessing over my body and all that kinda shit... and anorexia was kinda more simple to me... eat less, and less, and less, weigh yourself again and again, but it was just more simple... also I’m still counting macros and calories, exercising between #-#hours a day, eating real healthy (I’ve only eaten one actually “unhealthy” thing THIS YEAR and it was ONE FRICKIN SMALL REESES PB CUP WORTH ## kcal ) but to be Honest i just dont really Care about “healthy” i just dont wanna gain fat...😒",
          "created_utc": 1586111174.0
        },
        {
          "id": "fmil1tf",
          "author": "None",
          "body": "(I would edit that to not include non-time related numbers) but I have gone through phases of trying to \"eat healthy\" which was really a thinly veiled attempt to try to restrict in the name of health. It isn't healthy when you're doing it for the wrong reasons, and I tended to abandon it because honestly, I don't like \"healthy\" food so I'd rather restrict on Taco Bell and McDonald's than try to eat salad every day, haha.",
          "created_utc": 1586111708.0
        }
      ]
    },
    {
      "id": "fmin28x",
      "author": "None",
      "body": "That's fine, you could've said the same but just left out the calorie count - it's just a (good) rule of thumb on here not to use numbers!\n\nI was lucky I guess that I didn't have \"safe\" foods but my problem is I'm extremely picky because if I don't like what I'm eating it's not worth it to me to eat it. It wasn't so much about health/calories as it was just about needing to enjoy food. My nutritionist was always telling me that I am not going to love every single thing I eat but I still need to eat. A lot of times when I've fallen into under-eating patterns it's because I don't like the food available to me (or I'm lazy and don't have the drive to feed myself), so I just end up living on fast food or mainly carbs. \n\nI could never exercise. Nope. Part of it is my bad hips (I'm hypermobile so my hips pop in and out) but I always found exercise triggering anyway and just couldn't cope with it for some reason. Laziness? I might be the laziest anorexic person ever LOL.",
      "created_utc": 1586112861.0,
      "score": 1,
      "context": [
        {
          "id": "fmiis10",
          "author": "Wanna-be_skinnyfit",
          "body": "I have ednos... and my parents always tell me that I have orthorexia and have had anorexia (my Ed is a goddamn shapeshifter) but to be honest, yes I eat very healthy, yes I’m scared of eating “normal” amounts of saturated fat and sugar or other generally unhealthy food (butter, cream, sugary things, Lot of white carbs, fatty meat, and so on) BUT I actually don’t really care about my health that much... what I do care about is how much fat/muscle I have on my body and which body fat percentage I have... not “eating healthy” I just do it to maintain my weight and low body fat percentage and I’m just scared I will gain fat if I eat normal amounts of sugar, saturated fat and so on... (I have also struggled with orthorexia about a little under a year ago... I told you it was a shapeshifter😉)",
          "created_utc": 1586110404.0
        },
        {
          "id": "fmij9so",
          "author": "None",
          "body": "Oh man, I'm sorry to hear that. I'm lucky that I was never an exerciser or paid attention to specific macronutrients, etc. - just focused on my overall body size/weight. That would be a whole new level of exhausting, it's stressful enough obsessing over calories and the number on the scale without taking those aspects into account... I'm so sorry you have to deal with all of that!",
          "created_utc": 1586110687.0
        },
        {
          "id": "fmik4ld",
          "author": "Wanna-be_skinnyfit",
          "body": "Oh well we’ve all been through some stuff that nobody should have been through... but I promise you! I have been counting macros, exercising between #-#hours A DAY, obsessing over my body and all that kinda shit... and anorexia was kinda more simple to me... eat less, and less, and less, weigh yourself again and again, but it was just more simple... also I’m still counting macros and calories, exercising between #-#hours a day, eating real healthy (I’ve only eaten one actually “unhealthy” thing THIS YEAR and it was ONE FRICKIN SMALL REESES PB CUP WORTH ## kcal ) but to be Honest i just dont really Care about “healthy” i just dont wanna gain fat...😒",
          "created_utc": 1586111174.0
        },
        {
          "id": "fmil1tf",
          "author": "None",
          "body": "(I would edit that to not include non-time related numbers) but I have gone through phases of trying to \"eat healthy\" which was really a thinly veiled attempt to try to restrict in the name of health. It isn't healthy when you're doing it for the wrong reasons, and I tended to abandon it because honestly, I don't like \"healthy\" food so I'd rather restrict on Taco Bell and McDonald's than try to eat salad every day, haha.",
          "created_utc": 1586111708.0
        },
        {
          "id": "fmilpz2",
          "author": "Wanna-be_skinnyfit",
          "body": "Like that? (See edit) Also haha I really get that and I completely agree with what you are writing... the problem is just that when you start with orthorexia, you do it for the right reasons but then it turns obsessive and takes over your life... but just imagine when I went through a mix of AN and Orthorexia... starving/restricting while ONLY eating certain foods and exercising as much as possible.... god I don’t even know how I actually did it without straying from the low amounts of my very few safe foods😓",
          "created_utc": 1586112095.0
        }
      ]
    }
  ]
}