{
  "id": "fxap9p",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1586366802.0,
  "title": "Do you have distorted body image when looking at old photos of yourself long before your ED?",
  "selftext": "I realized recently that even though I know I was small as a child, when I look back at photos of me as young as four years old, I still internally criticize my body. As a baby I could see my ribs, so I recognize how underweight and tiny I was, but I know my poor body image began at like age four and so even looking back at old photos I find myself thinking that I look chubby and should have lost weight. I know objectively that I was close to underweight my entire childhood as well but even still, almost two decades later, I perceive my body image as distorted as I perceive it today. Just wondering what anyone else’s experiences are.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/fxap9p/do_you_have_distorted_body_image_when_looking_at/",
  "score": 123,
  "num_comments": 10,
  "comments": [
    {
      "id": "fmt5nj8",
      "author": "uglybuttons",
      "body": "Yeah same.  As a kid I remember my friends playing wii fit and it would always tell you your bmi.  I always had like a good BMI, but because it wasn’t “underweight” I wasn’t having it.  Literally as a first grader I had body issues and can still look at pictures of myself as a kid and see how my stomach poked out.  \n\nI remember at Christmas this year my cousin told me that when I was like six I told her I didn’t like the way my stomach looked.  I don’t remember saying it but I do remember trying to suck in 100% of the time",
      "created_utc": 1586367255.0,
      "score": 27,
      "context": []
    },
    {
      "id": "fmtuakk",
      "author": "HermioneGranger152",
      "body": "When I’m in a bad mood, I scroll through my mother’s Facebook account and look at all the photos that include me. I find myself thinking “How did I not see how fat I was?” Or “Why did the doctor always say I was healthy? I looked so overweight” or “Dang, my sister has always been the skinnier one...”",
      "created_utc": 1586379128.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fmtqhqx",
      "author": "cholula420",
      "body": "I grew up a really chubby kid and started losing weight naturally around the start of puberty, but I viewed myself as that kid still. I recently looked back at my pre-ED photos and realized how distorted my view of myself was, how much that differed from what I actually looked like.\n\nThat being said, it's the photos from when I was really young I still have trouble not criticizing. It hurts my heart for the girl I was then, but it's just the truth. \n\nEven at the peak of my ED two/three years ago, I hated my body and wanted to lose even more weight. Now looking at the photos, I was visibly sick. Even though I was never underweight or particularly thin to begin with, the visible difference between being healthy and starving was palpable.\n\nNow I'm chillin and eating cheez-itz lol but just some food (haha) for thought.",
      "created_utc": 1586377244.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fmu30w7",
      "author": "EDwannabe",
      "body": "Yes- when I look at photos just before my ED, when I started to have thoughts (as an early teen) i literally hate my horrible fat thighs and fat ugly face",
      "created_utc": 1586383628.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmuhuur",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1586391708.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmvjcex",
      "author": "28ter01",
      "body": "I luckily don't have a distorted body image.",
      "created_utc": 1586419058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmwhv6c",
      "author": "zombieggs",
      "body": "I always thought I was fat. I got told by my parents to lose weight when I was eight. Looking back I was not fat at all and I have no idea why they said that to me.",
      "created_utc": 1586446863.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn223yz",
      "author": "kgilbie",
      "body": "YESSSS. I went through periods of overeating from childhood to high school so sometimes I was very overweight. I can't even look at it.",
      "created_utc": 1586575836.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmthg7b",
      "author": "None",
      "body": "OMG same except I was like... ashamed? So I didn’t say anything. The few times I did I got laughed off and told I was being ridiculous. I remember my mom telling my doctor “haha her new thing is that she’s fat” like it was amusing. \n\nI used to get body work done on me for my anxiety and I would lie on the table and the woman would like slightly touch my stomach and I ALWAYS tried to suck it in. Especially since her daughters were overweight and my mom commented on it to me, I felt even worse about my body and perceived myself as looking like them, which I thought was a bad thing.",
      "created_utc": 1586372784.0,
      "score": 9,
      "context": [
        {
          "id": "fmt5nj8",
          "author": "uglybuttons",
          "body": "Yeah same.  As a kid I remember my friends playing wii fit and it would always tell you your bmi.  I always had like a good BMI, but because it wasn’t “underweight” I wasn’t having it.  Literally as a first grader I had body issues and can still look at pictures of myself as a kid and see how my stomach poked out.  \n\nI remember at Christmas this year my cousin told me that when I was like six I told her I didn’t like the way my stomach looked.  I don’t remember saying it but I do remember trying to suck in 100% of the time",
          "created_utc": 1586367255.0
        }
      ]
    },
    {
      "id": "fmuoy6a",
      "author": "None",
      "body": "Strangely I'm the most critical of the photos that are closest to and even following the development of my ED. I mean I really don't like my body at any point in my life, but I know how little I was eating in some photos yet I feel sort of hateful disappointment almost that I wasn't smaller.",
      "created_utc": 1586395768.0,
      "score": 2,
      "context": [
        {
          "id": "fmu30w7",
          "author": "EDwannabe",
          "body": "Yes- when I look at photos just before my ED, when I started to have thoughts (as an early teen) i literally hate my horrible fat thighs and fat ugly face",
          "created_utc": 1586383628.0
        }
      ]
    },
    {
      "id": "fmuorsp",
      "author": "None",
      "body": "Is your name Edith? That's mine too haha but I go by a nickname.\n\nAnyway, yeah, it's interesting because I know how much I weighed and that I was small, yet I still perceive my body differently. I guess I still view myself through the same lens as I viewed myself at that period of time in my life, which was in a distorted way as it was.",
      "created_utc": 1586395663.0,
      "score": 1,
      "context": [
        {
          "id": "fmuhuur",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1586391708.0
        }
      ]
    }
  ]
}