{
  "id": "g2swy4",
  "subreddit": "AnorexiaNervosa",
  "author": "mlefleur",
  "created_utc": 1587089192.0,
  "title": "i’m so sick and tired of hating myself for eating a normal sized meal",
  "selftext": "it’s exhausting :(\n\ndoes anyone have any tips on how to deal with this feeling? i can’t eat ‘cheat’ meals, fast food, or foods outside of my normal routine without having a breakdown afterwards. it’s so tiring to have to fight myself to not throw up or punish myself \n\nthis shit is annoying af like why can’t i just enjoy food like a normal person lmaoaoxijsjwjxjwjwif\n\nthnx for allowing me a space to vent i hope y’all’re all doing lovely <3",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/g2swy4/im_so_sick_and_tired_of_hating_myself_for_eating/",
  "score": 126,
  "num_comments": 14,
  "comments": [
    {
      "id": "fnneuj9",
      "author": "None",
      "body": "I don’t have any advice, I wish I did, but I’m literally staring at my dinner rn having a hard time w it too. Just know you absolutely deserve to eat, you’re not alone, and I’m sending good vibes your way 💗",
      "created_utc": 1587090744.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fnnjbwr",
      "author": "kellytran96",
      "body": "Hi! I’m sorry you’re going through that. I’m currently going through the same situation. Not sure if it’ll help, but thoughts like “I deserve to maintain a healthy lifestyle” or “if the situation worsen, I can’t afford hospital bills” is helping me. It’s a process but constantly reminding yourself and not allowing negativity overcome you is the biggest step to take!",
      "created_utc": 1587093712.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fnnkya9",
      "author": "Reachingout365",
      "body": "I grew up in a home where my external achievements and appearance was valued  over anything internal and good I had to offer from the inside.  My appearance even mattered more than my health and feelings!! My \"father\" preyed on me, my mother resented and hated me. The most praise, love, and attention I got was for my appearance. As long as I could  shove my pesky, annoying, encumber-some emotions down to stop myself from annoying other people, and having to deal with them myself, became empty, but put on a pretty smile and have a tiny trim waist, then I could get some love and attention. Shove those feelings down. I felt so guilty for eating a  bowl of oatmeal.\n\n\"Ugh you're going to get fat.\"\n\n\"Look at that pudge.\"\n\n\"Omg just stop eating!\"\n\n\"Don't worry we will shed all this fat this summer.\"\n\nJust stay skinny... then they will value you, and you will find value in yourself. You can be in the driver's seat, as long as you stay slim.\n\nBut this isn't control, this is an illusion.\n\nThe treatment I received made me feel so disgusting that maybe there was just something inherently wrong with me, that I needed to make my outsides more tolerable and smash my insides down because I couldn't see any value in myself.  \n\nWhen food centers your thoughts and emotions and every waking moment of your day, you truly are not in control.\n\nIt wasn't until I started loving that little hurt child that I started seeing some progress (this includes speaking to a certified dietitian/nutritionist; having a compassion doctor to help me know how many calories I needed as a stepping stone for intuitive eating, helped with the uncertainty.) \n\nThink of your emotions like a child.  It sounds like you really struggle with feelings and regulating them and use food to shove them down and avoid them.  \n\n\n\nFeelings are hard but they demand to be felt.\n\nI recently had someone call me \"manic\" in response to me in crisis. It hurt. They knew how I felt about being diagnosed (I'm a victim of facetious disorder,)  and they know how bad my situation is and instead of having compassion for me and having a fearful response to an oppressive situation, (they claimed to be a friend,) they judged me and blamed me. I felt a surge of anxiety and was afraid of that anxiety.\n\nI went in the kitchen to eat a samdwhich to stuff it down. But I still felt so anxious. I didn't want to feel it. I had to put my hand over my chest and ask myself \"what fundamental boundary was crossed just now?\" I had to really sit and talk with myself about and acknowledge my emotions. She gaslight me. She victim shamed me. And that HURT. I let myself cry, and feel the hurt. It helped. It still hurts, but restricting and eating can't take that pain away. \n\nMy advice is to try to love yourself like you would your daughter. Start journaling. Start listening inward. Talk to a professional if you need to. (Someone who understands exposure and trauma therapy.) \n\nFollow food and body positive blogs and pages. Surrounding yourself with good people and practice talking to yourself kindly, forgive yourself as means times as you need to, don't demand perfection of yourself while going through this process, and love those emotions like you would a child. \"What? What is is that you need right now?\" Feelings come from a place of hurt. Acknowledge your hurts, have compassion for your hurts. \n\nLook at your body not as the enemy but as a source of energy that warns you with emotions and sensations when someone is off or wrong about someone or something, look to your body as a source of love and healing. \n\nThe journey will be long and difficult but it will get easier with time.\n\nAs simple as it may sound, love and self compassion is the only way out. \n\nAnd repeat after me; \"my body is not too big, too small, too weak or too frail, my body is not too dark, too light, too \"broken\" or too strong or too flawed, it is a vessel carrying a precious life, and that is enough.\"",
      "created_utc": 1587094822.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fnnfvbz",
      "author": "ZeenyxThePhoenix",
      "body": "I just had what amounted to two normal meals today and I’m over here having a crisis. Tomorrow when I weigh myself I’ll weigh more even if I didn’t hit my TDEE today and even though I know why I won’t believe it’s from anything but more fat.",
      "created_utc": 1587091414.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fnnq1wr",
      "author": "dgcgxxw",
      "body": "My advice is to find some distractions and also space out your meal. If you have a meal that you think is too large in front of you it makes it harder. Divide your meal and leave the other parts on the counter, fridge or microwave. Outta sight outta mind. Once you’re done with the first portion you can move onto the next. No need to rush, it’s not a race! As far as a distraction goes if you’re able to watch YouTube, or listen to music while you eat I highly suggest that. Go for one of your comfort movies. You’re not alone ♥️",
      "created_utc": 1587098498.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fnpchaq",
      "author": "SquargyBoi",
      "body": "I'm sorry you're going through this - but the fact that your head tries to guilt you after a normal meal means you are doing the right thing. You are strong, and you are in control. Your eating disorder will try to punish you for doing the right thing - the best thing I found and still find that helps is knowing it's hard because I'm doing the right thing and distractions. Call a friend, tell them you've just done something positive towards recovery. Watch your favourite film, crochet, draw, knit, paint - you've got this 💖",
      "created_utc": 1587143080.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnp571w",
      "author": "STAR-Gritz",
      "body": "Well, venting sometimes works. I'm not suffering from an ED but my best friend is. If she's feeling like crap for eating a meal she sometimes sends me a text to just vent or just have a chat to distract her. Im afraid it isn't much of a solution, but it can be a way to cope. Pick an empathetic friend who knows of your situation and maybe try and find some support. Best of luck, you'll get through this❤️",
      "created_utc": 1587139414.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnolamg",
      "author": "darkcrystal1905",
      "body": "Yup, I'ts about controll. you associate your food choices and how much you eat with your self-worth and how moral and disciplined you are. When you feel too full or eat a cheat meal, it's not just that you're scared of having gained a tiny bit of weight. It's a breach on the standards you've set for yourself, a betrayal in some way. If you broke out of the routine this once, it's just the first step in your life falling into complete chaos.   \n when I was at my worst, just a slight feeling of fullness would make me feel worthless and scared. It's such a silly thing when you try to explain someone who is well, but to an anorexic it really can feel like the end of the world.",
      "created_utc": 1587128150.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fo13eps",
      "author": "whataboutbrie",
      "body": "I love bananagrams! I’m not sure if me and my partner play by the proper rules but it gives me an ‘out’ for my competitive side and he loves it when he beats me! It’s kinda like a desensitisation process- he’s like “on a scale of one to ten... how furious are you now?” It’s said jokingly- but he gets it!",
      "created_utc": 1587424953.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fo14ugr",
      "author": "whataboutbrie",
      "body": "The other thing that distracts me is just going somewhere I can’t purge- I go to my park and just sit there. I watch the water and just try and (even though I suck at traditional meditation) count the waves coming onto the little beachy thing and say  to myself “this is one wave that I haven’t puked- this is another wave...” then I go home and am surprised at the fact that I don’t want to puke anymore. And then also realise how exhausting my binging and purging was- because I feel enervated that I walked to the river and enjoyed it-and didn’t have to feel all the psychic self- loathing of purging",
      "created_utc": 1587425779.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnprdv8",
      "author": "lickingbuttdaily33",
      "body": "fast food is terrible for you",
      "created_utc": 1587150601.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fnno2b8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1587097031.0,
      "score": 3,
      "context": [
        {
          "id": "fnnkya9",
          "author": "Reachingout365",
          "body": "I grew up in a home where my external achievements and appearance was valued  over anything internal and good I had to offer from the inside.  My appearance even mattered more than my health and feelings!! My \"father\" preyed on me, my mother resented and hated me. The most praise, love, and attention I got was for my appearance. As long as I could  shove my pesky, annoying, encumber-some emotions down to stop myself from annoying other people, and having to deal with them myself, became empty, but put on a pretty smile and have a tiny trim waist, then I could get some love and attention. Shove those feelings down. I felt so guilty for eating a  bowl of oatmeal.\n\n\"Ugh you're going to get fat.\"\n\n\"Look at that pudge.\"\n\n\"Omg just stop eating!\"\n\n\"Don't worry we will shed all this fat this summer.\"\n\nJust stay skinny... then they will value you, and you will find value in yourself. You can be in the driver's seat, as long as you stay slim.\n\nBut this isn't control, this is an illusion.\n\nThe treatment I received made me feel so disgusting that maybe there was just something inherently wrong with me, that I needed to make my outsides more tolerable and smash my insides down because I couldn't see any value in myself.  \n\nWhen food centers your thoughts and emotions and every waking moment of your day, you truly are not in control.\n\nIt wasn't until I started loving that little hurt child that I started seeing some progress (this includes speaking to a certified dietitian/nutritionist; having a compassion doctor to help me know how many calories I needed as a stepping stone for intuitive eating, helped with the uncertainty.) \n\nThink of your emotions like a child.  It sounds like you really struggle with feelings and regulating them and use food to shove them down and avoid them.  \n\n\n\nFeelings are hard but they demand to be felt.\n\nI recently had someone call me \"manic\" in response to me in crisis. It hurt. They knew how I felt about being diagnosed (I'm a victim of facetious disorder,)  and they know how bad my situation is and instead of having compassion for me and having a fearful response to an oppressive situation, (they claimed to be a friend,) they judged me and blamed me. I felt a surge of anxiety and was afraid of that anxiety.\n\nI went in the kitchen to eat a samdwhich to stuff it down. But I still felt so anxious. I didn't want to feel it. I had to put my hand over my chest and ask myself \"what fundamental boundary was crossed just now?\" I had to really sit and talk with myself about and acknowledge my emotions. She gaslight me. She victim shamed me. And that HURT. I let myself cry, and feel the hurt. It helped. It still hurts, but restricting and eating can't take that pain away. \n\nMy advice is to try to love yourself like you would your daughter. Start journaling. Start listening inward. Talk to a professional if you need to. (Someone who understands exposure and trauma therapy.) \n\nFollow food and body positive blogs and pages. Surrounding yourself with good people and practice talking to yourself kindly, forgive yourself as means times as you need to, don't demand perfection of yourself while going through this process, and love those emotions like you would a child. \"What? What is is that you need right now?\" Feelings come from a place of hurt. Acknowledge your hurts, have compassion for your hurts. \n\nLook at your body not as the enemy but as a source of energy that warns you with emotions and sensations when someone is off or wrong about someone or something, look to your body as a source of love and healing. \n\nThe journey will be long and difficult but it will get easier with time.\n\nAs simple as it may sound, love and self compassion is the only way out. \n\nAnd repeat after me; \"my body is not too big, too small, too weak or too frail, my body is not too dark, too light, too \"broken\" or too strong or too flawed, it is a vessel carrying a precious life, and that is enough.\"",
          "created_utc": 1587094822.0
        }
      ]
    },
    {
      "id": "fnpmdkg",
      "author": "whataboutbrie",
      "body": "This comment is so right! We were forced to sit for 1/2 an hour after meals when I was hospitalised- but this one nurse turned it from being horrible to actually understanding that support was actually distraction! She would get us to play hang-man (the words we came up with were hilarious, but very much the gallows humour you need in hospital!! 9 letters: po_a_a_um! I got it!) or she’d put up a puzzle for us to solve. It kinda turned into a joke because usually it would be like....literally counting down seconds to get out of that after-meal ‘support’...but when she was on most of us would stay for extra time to make sure the puzzle was solved...or she would be interested in a certain knit pattern someone was doing, so we’d all hang around and listen to the person explain how to work it. Kudos to her- she was a brilliant nurse and I don’t doubt that she saved many lives",
      "created_utc": 1587148043.0,
      "score": 2,
      "context": [
        {
          "id": "fnpchaq",
          "author": "SquargyBoi",
          "body": "I'm sorry you're going through this - but the fact that your head tries to guilt you after a normal meal means you are doing the right thing. You are strong, and you are in control. Your eating disorder will try to punish you for doing the right thing - the best thing I found and still find that helps is knowing it's hard because I'm doing the right thing and distractions. Call a friend, tell them you've just done something positive towards recovery. Watch your favourite film, crochet, draw, knit, paint - you've got this 💖",
          "created_utc": 1587143080.0
        }
      ]
    },
    {
      "id": "fnno80c",
      "author": "Reachingout365",
      "body": "You are welcome. It was my pleasure. I hope it helped some and I wish you well on your path to growth and healing. You deserve to feel at peace with yourself. 💞",
      "created_utc": 1587097145.0,
      "score": 2,
      "context": [
        {
          "id": "fnnkya9",
          "author": "Reachingout365",
          "body": "I grew up in a home where my external achievements and appearance was valued  over anything internal and good I had to offer from the inside.  My appearance even mattered more than my health and feelings!! My \"father\" preyed on me, my mother resented and hated me. The most praise, love, and attention I got was for my appearance. As long as I could  shove my pesky, annoying, encumber-some emotions down to stop myself from annoying other people, and having to deal with them myself, became empty, but put on a pretty smile and have a tiny trim waist, then I could get some love and attention. Shove those feelings down. I felt so guilty for eating a  bowl of oatmeal.\n\n\"Ugh you're going to get fat.\"\n\n\"Look at that pudge.\"\n\n\"Omg just stop eating!\"\n\n\"Don't worry we will shed all this fat this summer.\"\n\nJust stay skinny... then they will value you, and you will find value in yourself. You can be in the driver's seat, as long as you stay slim.\n\nBut this isn't control, this is an illusion.\n\nThe treatment I received made me feel so disgusting that maybe there was just something inherently wrong with me, that I needed to make my outsides more tolerable and smash my insides down because I couldn't see any value in myself.  \n\nWhen food centers your thoughts and emotions and every waking moment of your day, you truly are not in control.\n\nIt wasn't until I started loving that little hurt child that I started seeing some progress (this includes speaking to a certified dietitian/nutritionist; having a compassion doctor to help me know how many calories I needed as a stepping stone for intuitive eating, helped with the uncertainty.) \n\nThink of your emotions like a child.  It sounds like you really struggle with feelings and regulating them and use food to shove them down and avoid them.  \n\n\n\nFeelings are hard but they demand to be felt.\n\nI recently had someone call me \"manic\" in response to me in crisis. It hurt. They knew how I felt about being diagnosed (I'm a victim of facetious disorder,)  and they know how bad my situation is and instead of having compassion for me and having a fearful response to an oppressive situation, (they claimed to be a friend,) they judged me and blamed me. I felt a surge of anxiety and was afraid of that anxiety.\n\nI went in the kitchen to eat a samdwhich to stuff it down. But I still felt so anxious. I didn't want to feel it. I had to put my hand over my chest and ask myself \"what fundamental boundary was crossed just now?\" I had to really sit and talk with myself about and acknowledge my emotions. She gaslight me. She victim shamed me. And that HURT. I let myself cry, and feel the hurt. It helped. It still hurts, but restricting and eating can't take that pain away. \n\nMy advice is to try to love yourself like you would your daughter. Start journaling. Start listening inward. Talk to a professional if you need to. (Someone who understands exposure and trauma therapy.) \n\nFollow food and body positive blogs and pages. Surrounding yourself with good people and practice talking to yourself kindly, forgive yourself as means times as you need to, don't demand perfection of yourself while going through this process, and love those emotions like you would a child. \"What? What is is that you need right now?\" Feelings come from a place of hurt. Acknowledge your hurts, have compassion for your hurts. \n\nLook at your body not as the enemy but as a source of energy that warns you with emotions and sensations when someone is off or wrong about someone or something, look to your body as a source of love and healing. \n\nThe journey will be long and difficult but it will get easier with time.\n\nAs simple as it may sound, love and self compassion is the only way out. \n\nAnd repeat after me; \"my body is not too big, too small, too weak or too frail, my body is not too dark, too light, too \"broken\" or too strong or too flawed, it is a vessel carrying a precious life, and that is enough.\"",
          "created_utc": 1587094822.0
        },
        {
          "id": "fnno2b8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1587097031.0
        }
      ]
    },
    {
      "id": "fnsqbfg",
      "author": "SquargyBoi",
      "body": "I'm so glad you that you found something that helped! Bananagrams was something that really helped me and all the staff got involved, and phone calls with people I'm close to. I hope you're well and let's all keep fighting 💖",
      "created_utc": 1587226765.0,
      "score": 1,
      "context": [
        {
          "id": "fnpchaq",
          "author": "SquargyBoi",
          "body": "I'm sorry you're going through this - but the fact that your head tries to guilt you after a normal meal means you are doing the right thing. You are strong, and you are in control. Your eating disorder will try to punish you for doing the right thing - the best thing I found and still find that helps is knowing it's hard because I'm doing the right thing and distractions. Call a friend, tell them you've just done something positive towards recovery. Watch your favourite film, crochet, draw, knit, paint - you've got this 💖",
          "created_utc": 1587143080.0
        },
        {
          "id": "fnpmdkg",
          "author": "whataboutbrie",
          "body": "This comment is so right! We were forced to sit for 1/2 an hour after meals when I was hospitalised- but this one nurse turned it from being horrible to actually understanding that support was actually distraction! She would get us to play hang-man (the words we came up with were hilarious, but very much the gallows humour you need in hospital!! 9 letters: po_a_a_um! I got it!) or she’d put up a puzzle for us to solve. It kinda turned into a joke because usually it would be like....literally counting down seconds to get out of that after-meal ‘support’...but when she was on most of us would stay for extra time to make sure the puzzle was solved...or she would be interested in a certain knit pattern someone was doing, so we’d all hang around and listen to the person explain how to work it. Kudos to her- she was a brilliant nurse and I don’t doubt that she saved many lives",
          "created_utc": 1587148043.0
        }
      ]
    }
  ]
}