{
  "id": "g4ac0n",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1587313023.0,
  "title": "Who else feels like anorexia makes their brain totally unable to function academically in addition to emotionally?",
  "selftext": "I'm a diligent student, graduating with my BS in psychology (ironic) in May, have a 4.0, and yet I'm struggling and failing to complete my work. It makes me feel like shit because the reason I can't isn't clear. I end up doing crosswords and watching YouTube all day and falling into the reddit rabbit hole.\n\nI feel like I just don't have mental energy, but it seems like such bullshit that I'd be able to do those other mindless activities but can't sit down and write an essay or read abstracts. It isn't just anxiety-procrastinating, which I know I also do. At this point I feel like I physically can't. I just stare at the screen. It makes me hate myself and think I'm just making things up.\n\nI've been weak, cold, and dizzy almost every day, though I am making efforts to eat more. But I can't just tell my professor, sorry, I've been starving myself (with a daily mental breakdown, just to mix it up) so I wasn't able to get my work done. Obviously restriction worsens emotional stuff as well, which includes my OCD and anxiety, and that takes up mental energy to cope with too.\n\nDoes anyone else experience this? Am I just being a slacker?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/g4ac0n/who_else_feels_like_anorexia_makes_their_brain/",
  "score": 169,
  "num_comments": 26,
  "comments": [
    {
      "id": "fnw958p",
      "author": "None",
      "body": "You aren't just being a slacker. I'm going into my third year next September, and have suffered with anorexia for 3 ish years. I'm also studying psychology actually, and have a high GPA somehow. But no, I have no energy to do my work, I have no clue how I manage to pass, let alone get good grades. My brain always feels scrambled and fried, and the amount of energy it takes to read an article is ridiculous. \nI went to uni with the intent to honor in psych, maybe do a double major. Be involved, volunteer, join some clubs, work. Slowly but surely each of these goals faded away when I realized I can barely manage class, head home, and homework. That is all I can do, and I hate it because I know if I was healthy I could do so much more. I feel like I've wasted my university experience.",
      "created_utc": 1587313900.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fnwvgzx",
      "author": "manicpixiedreamsqrrl",
      "body": "I’m the same exact way. 4.0, about to graduate, and academic work and reading takes SO much more energy than it should. I can get it together enough to cram for tests or crank out a paper but I honestly have zero retention from any of my classes, like to the point where I can barely remember the details of a 20 page research paper I finished like .. a month ago. I used to be able to get up early and be super motivated to work on things, now I wake up and drink coffee and do crosswords or look at my phone for hours. It makes me feel shitty bc I feel like I’m wasting my college education, I worked hard to be here and now I’m not even learning anything since I can’t focus.",
      "created_utc": 1587326245.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fny6f70",
      "author": "annielovesbacon",
      "body": "You’re definitely not a slacker. I wrote a research paper on this — eating disorders literally affect your brain matter, meaning your cognitive functioning is severely impacted. It’s not your fault! The mindless activities you mentioned, you’re able to do them because they require less concentration. Doing your work, writing papers, etc requires a ton of concentration, which requires a ton of energy even though you’re not moving around or anything. \n\nI also wanted to say that I just graduated in December, and if I can do it, so can you! I’m rooting for you :)",
      "created_utc": 1587354548.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fnwyham",
      "author": "MyMeanBunny",
      "body": "Yep, I'm in my last semester of Accounting and I'm constantly running on 20% energy. No matter how much I sleep and drink coffee, I'm perpetually tired. Can't grasp any information unless its a tight deadline, then my brain runs off anxiety lol.",
      "created_utc": 1587327938.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fnx5f5b",
      "author": "None",
      "body": "i almost failed high school cuz i couldnt focus on jack shit after my ed was fully developed. the brain fog is real.",
      "created_utc": 1587331827.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnxbx14",
      "author": "None",
      "body": "YES. It’s the absolute worst. You’re not alone. I feel like my brain can’t function properly and I don’t have the energy to do all the reading, writing, and thinking that I have to do for my online classes. I am used to getting mostly As and excelling at school but now I feel like I just don’t care anymore as much. Like I don’t have the energy to care, and I don’t even care if my work is mediocre because the only thing I care about right now is weight loss. And with my brain just all foggy and not cooperating with my work I just can’t put in the amount of effort that I used to. \nAnd not sure if this is because of my “ed” but my hands are always freezing and I don’t want to type an essay when I could be holding them on my hand warmer or sleeping in my warm bed instead. \nI also have been having insomnia lately (can’t fall/stay asleep) and it means I am literally just exhausted all the time. Then I end up sleeping half the day away, and when I am awake I’m just so tired all the time (even after I do get sleep). It’s just not a good time. \nWhat’s weird is that I have diagnosed anxiety (and take prescribed antidepressants for it/have been for a couple years), but with my “ed” worsening, I just don’t care anymore about half the things I used to worry about. I’m still an over thinker and a worrier, but it interferes with my life so much less now because I don’t have the physical and mental energy to care anymore. My brain just can’t handle it. \nSo you’re not alone; hang in there. 💜",
      "created_utc": 1587335528.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnys3cl",
      "author": "STAR-Gritz",
      "body": "Yeah, besides AN being extremely tiring disorder, as it is mentally pretty all-consuming (no pun intended there), your brain is also likely to lack energy due to malnurishment. Your body essentially makes the decision 'hey, studying is not important right now, keeping your vitals healthy is'",
      "created_utc": 1587373560.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnxly8t",
      "author": "hxneyfxck",
      "body": "You are not alone! This was me 100% before I graduated (thank goodness I’m done & out of there). Complete inability to focus, attention span of a concussed goldfish, pretty much 0 retention of new material unless I was hopped up on enough caffeine/anxiety to power through.\n\nIt sucked realizing that my ED was drawing strength from one of the loves of my life: academia.\n\nLooking back, I can confidently say I only graduated because of the following:\n\n• I made the dean’s list my very first semester of college, and tbh I kind of used my initially high GPA as a buffer of sorts to dip into during the tougher semesters. \nBy the time I was done and graduated, my GPA was hovering around a 3.4 or something. So not the best by my standards (for me) but not too shabby all things considering!\n\n• I was honest & upfront with my profs...kinda. I didn’t go into details about the ED, but went to them one on one and let them know I was really struggling with my mental health, and also with the unhealthy coping mechanisms I’d developed as a result. No specifics, just very factual. I let them know I was in therapy (at the time) and working with a psychiatrist to try and help me along. Letting them know about the psychiatrist was important because I was able to basically say, “sorry if my attendance/work quality/attention span is incredibly hit or miss. It probably will be for several months, because we are trying to figure out dosages. I’m not sure how I’m going to react, but I am going to try my best and I will try to keep you informed on my progress.”\n\nI was lucky enough to have three very understanding, compassionate, and flexible professors. I was a double major, two of them made up the entire department of one of my majors, and the other was a long-time prof of mine for my other major. They had seen me for all 4 years, so they all got first hand seats to watch my mental decline lol. But it ended up working in my favor, because they had already seen what I was capable of when I was doing well mentally. Because of that, they were willing to be incredibly accommodating and work with me to help me find my potential again.\nI sincerely believe I wouldn’t have graduated without them.\n\n\nI would encourage you to talk to your prof. You don’t need to give details, but don’t sugar coat anything. Just be factual and goal-oriented: “This thing is happening. It is causing these issues for me. Here’s what I’m doing to try and mitigate the negative effects, I would greatly appreciate your patience as I try my best to complete your work during this difficult time.” \nIt’s scary and hard but very important. Out of all the profs I had to talk to about my mental health, I only had mediocre to less than helpful reactions from two of them. The rest were all willing to work with me.",
      "created_utc": 1587341412.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnx9w1u",
      "author": "sel_darling",
      "body": "Dude! Back when i was studying mechanical engineerung i got medical withdraw because of my mental health. I literally couldnt het out of bed. One time i ate only 3 baby carrots for a whole day. I would (still do) constantly count calories and focus all my energy on \"her\" that i just couldnt do my work. In back in uni doing a different degree in a different country and the thoughts are still there.",
      "created_utc": 1587334368.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnwa6ej",
      "author": "None",
      "body": "I'm glad it isn't just me. I think I might talk to my professor and reach out to her. Especially with psychology, I don't have to tell you how much mental energy it takes to slog through a research article.\n\nThose goals don't have to fade away, though. With recovery, you can definitely gain that back. You also still have time to right the ship and make sure you don't end up wasting your university experience! Also, if you are struggling, it's always worth it to reach out to professors or the dean of students office. My case manager there was incredible and helped me and advocated for me so much.\n\nI feel like the problem with anorexia is that professors will understand anxiety and depression, but a lot of them don't specialize in EDs and I'm scared they will think like \"okay, so then eat and don't use anorexia as an excuse\". I'm scared to try and reach out to a doctor because I don't want to be told to gain weight. I also don't look underweight yet (I think I lost weight, but not a lot) so I feel like they might not take that seriously either.\n\nAHHH anyway I'm glad I'm not alone in this haha. Please hang in there and take advantage of your university's resources.",
      "created_utc": 1587314471.0,
      "score": 6,
      "context": [
        {
          "id": "fnw958p",
          "author": "None",
          "body": "You aren't just being a slacker. I'm going into my third year next September, and have suffered with anorexia for 3 ish years. I'm also studying psychology actually, and have a high GPA somehow. But no, I have no energy to do my work, I have no clue how I manage to pass, let alone get good grades. My brain always feels scrambled and fried, and the amount of energy it takes to read an article is ridiculous. \nI went to uni with the intent to honor in psych, maybe do a double major. Be involved, volunteer, join some clubs, work. Slowly but surely each of these goals faded away when I realized I can barely manage class, head home, and homework. That is all I can do, and I hate it because I know if I was healthy I could do so much more. I feel like I've wasted my university experience.",
          "created_utc": 1587313900.0
        }
      ]
    },
    {
      "id": "fnwyvgp",
      "author": "None",
      "body": "I'm glad I'm not alone because that's literally my situation. I can rally and end up producing something the night before it's due or like 3am the day after it was due, but otherwise I feel like I can't mentally do it. I'm not enjoying the work either, even though I normally do. All I have to do by the end of the week is organize some abstracts into categories, I don't even have to write entries for my annotated bibliography, but even that seems mentally exhausting.\n\nI have like 2 hours tops of work for my seminar (probably less) the entire week. Normally I'd be doing it without a problem, but I can't even get it together to *think* about an article let alone come up with anything profound to say about it. I was always good at bullshitting when necessary but I hate that that's all I do now and I don't even care, even though it's something I'm SO passionate about.",
      "created_utc": 1587328162.0,
      "score": 3,
      "context": [
        {
          "id": "fnwvgzx",
          "author": "manicpixiedreamsqrrl",
          "body": "I’m the same exact way. 4.0, about to graduate, and academic work and reading takes SO much more energy than it should. I can get it together enough to cram for tests or crank out a paper but I honestly have zero retention from any of my classes, like to the point where I can barely remember the details of a 20 page research paper I finished like .. a month ago. I used to be able to get up early and be super motivated to work on things, now I wake up and drink coffee and do crosswords or look at my phone for hours. It makes me feel shitty bc I feel like I’m wasting my college education, I worked hard to be here and now I’m not even learning anything since I can’t focus.",
          "created_utc": 1587326245.0
        }
      ]
    },
    {
      "id": "fny79xf",
      "author": "None",
      "body": "Thank you so much! That's so interesting, please let me know if I could read the paper, I've done a couple papers on AN but not on that aspect.",
      "created_utc": 1587355164.0,
      "score": 3,
      "context": [
        {
          "id": "fny6f70",
          "author": "annielovesbacon",
          "body": "You’re definitely not a slacker. I wrote a research paper on this — eating disorders literally affect your brain matter, meaning your cognitive functioning is severely impacted. It’s not your fault! The mindless activities you mentioned, you’re able to do them because they require less concentration. Doing your work, writing papers, etc requires a ton of concentration, which requires a ton of energy even though you’re not moving around or anything. \n\nI also wanted to say that I just graduated in December, and if I can do it, so can you! I’m rooting for you :)",
          "created_utc": 1587354548.0
        }
      ]
    },
    {
      "id": "fnx2apk",
      "author": "None",
      "body": "\"My brain runs off anxiety\" is the best way to describe it ever. That's the problem, I have to be borderline panicking because it's the deadline in order to get something done. I keep falling asleep, but it's the kind of sleep that comes from not eating enough. I am going to attempt to do *something* today even if it's just opening up the meta-analysis spreadsheet I made on Box for this independent study... so wish me luck lol.",
      "created_utc": 1587330071.0,
      "score": 7,
      "context": [
        {
          "id": "fnwyham",
          "author": "MyMeanBunny",
          "body": "Yep, I'm in my last semester of Accounting and I'm constantly running on 20% energy. No matter how much I sleep and drink coffee, I'm perpetually tired. Can't grasp any information unless its a tight deadline, then my brain runs off anxiety lol.",
          "created_utc": 1587327938.0
        }
      ]
    },
    {
      "id": "fnxhkfz",
      "author": "None",
      "body": "I'm experiencing the same thing. I was really struggling with my relationship OCD the last few weeks, but as I've gotten increasingly entrenched in my ED, I've been somewhat free (knock on wood) of those obsessions. Which is nice, but not so nice that it's been replaced with this. I spend too much brain power worrying about calories, my weight, and then twice as much trying to battle my ED voice so I don't fuck myself over right before I graduate, that I just don't have the mental energy left over to cope with anything. I've had really weird sleep patterns as well because I'll randomly fall asleep from lack of nourishment. This just takes up so much headspace, it's exhausting. Honestly I hate even sitting at my desk anymore. I'd rather be buried under blankets, but I try to be somewhat good about getting out of bed during the day at least for a portion of it.",
      "created_utc": 1587338775.0,
      "score": 2,
      "context": [
        {
          "id": "fnxbx14",
          "author": "None",
          "body": "YES. It’s the absolute worst. You’re not alone. I feel like my brain can’t function properly and I don’t have the energy to do all the reading, writing, and thinking that I have to do for my online classes. I am used to getting mostly As and excelling at school but now I feel like I just don’t care anymore as much. Like I don’t have the energy to care, and I don’t even care if my work is mediocre because the only thing I care about right now is weight loss. And with my brain just all foggy and not cooperating with my work I just can’t put in the amount of effort that I used to. \nAnd not sure if this is because of my “ed” but my hands are always freezing and I don’t want to type an essay when I could be holding them on my hand warmer or sleeping in my warm bed instead. \nI also have been having insomnia lately (can’t fall/stay asleep) and it means I am literally just exhausted all the time. Then I end up sleeping half the day away, and when I am awake I’m just so tired all the time (even after I do get sleep). It’s just not a good time. \nWhat’s weird is that I have diagnosed anxiety (and take prescribed antidepressants for it/have been for a couple years), but with my “ed” worsening, I just don’t care anymore about half the things I used to worry about. I’m still an over thinker and a worrier, but it interferes with my life so much less now because I don’t have the physical and mental energy to care anymore. My brain just can’t handle it. \nSo you’re not alone; hang in there. 💜",
          "created_utc": 1587335528.0
        }
      ]
    },
    {
      "id": "fnynkda",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1587368874.0,
      "score": 2,
      "context": [
        {
          "id": "fnxbx14",
          "author": "None",
          "body": "YES. It’s the absolute worst. You’re not alone. I feel like my brain can’t function properly and I don’t have the energy to do all the reading, writing, and thinking that I have to do for my online classes. I am used to getting mostly As and excelling at school but now I feel like I just don’t care anymore as much. Like I don’t have the energy to care, and I don’t even care if my work is mediocre because the only thing I care about right now is weight loss. And with my brain just all foggy and not cooperating with my work I just can’t put in the amount of effort that I used to. \nAnd not sure if this is because of my “ed” but my hands are always freezing and I don’t want to type an essay when I could be holding them on my hand warmer or sleeping in my warm bed instead. \nI also have been having insomnia lately (can’t fall/stay asleep) and it means I am literally just exhausted all the time. Then I end up sleeping half the day away, and when I am awake I’m just so tired all the time (even after I do get sleep). It’s just not a good time. \nWhat’s weird is that I have diagnosed anxiety (and take prescribed antidepressants for it/have been for a couple years), but with my “ed” worsening, I just don’t care anymore about half the things I used to worry about. I’m still an over thinker and a worrier, but it interferes with my life so much less now because I don’t have the physical and mental energy to care anymore. My brain just can’t handle it. \nSo you’re not alone; hang in there. 💜",
          "created_utc": 1587335528.0
        }
      ]
    },
    {
      "id": "fnxn2qh",
      "author": "None",
      "body": "I'm super super lucky also to have really understanding and accommodating professors (aren't they the best?) and being a psychology major is nice because most professors are doubly supportive. I also have two professors who've known me for the past two years (since I started at my current university) and have had to witness far too many panic attacks and receive far too many panicked incoherent emails LOL. I'm an open book with mental health stuff though so they practically know my life story by now.\n\nI think my biggest concern is telling them about my eating disorder stuff. They completely understand anxiety/OCD/mental health in general, but I feel like saying that my anorexia/restriction is making it difficult for me to focus and rise to the occasion sounds so dumb and they'll just be like \"....or you could eat and this wouldn't be a problem,\" you know? I guess I don't need to go into detail, but I'm super honest and I want them to know what's happening instead of just saying it's my anxiety or whatever.",
      "created_utc": 1587342107.0,
      "score": 2,
      "context": [
        {
          "id": "fnxly8t",
          "author": "hxneyfxck",
          "body": "You are not alone! This was me 100% before I graduated (thank goodness I’m done & out of there). Complete inability to focus, attention span of a concussed goldfish, pretty much 0 retention of new material unless I was hopped up on enough caffeine/anxiety to power through.\n\nIt sucked realizing that my ED was drawing strength from one of the loves of my life: academia.\n\nLooking back, I can confidently say I only graduated because of the following:\n\n• I made the dean’s list my very first semester of college, and tbh I kind of used my initially high GPA as a buffer of sorts to dip into during the tougher semesters. \nBy the time I was done and graduated, my GPA was hovering around a 3.4 or something. So not the best by my standards (for me) but not too shabby all things considering!\n\n• I was honest & upfront with my profs...kinda. I didn’t go into details about the ED, but went to them one on one and let them know I was really struggling with my mental health, and also with the unhealthy coping mechanisms I’d developed as a result. No specifics, just very factual. I let them know I was in therapy (at the time) and working with a psychiatrist to try and help me along. Letting them know about the psychiatrist was important because I was able to basically say, “sorry if my attendance/work quality/attention span is incredibly hit or miss. It probably will be for several months, because we are trying to figure out dosages. I’m not sure how I’m going to react, but I am going to try my best and I will try to keep you informed on my progress.”\n\nI was lucky enough to have three very understanding, compassionate, and flexible professors. I was a double major, two of them made up the entire department of one of my majors, and the other was a long-time prof of mine for my other major. They had seen me for all 4 years, so they all got first hand seats to watch my mental decline lol. But it ended up working in my favor, because they had already seen what I was capable of when I was doing well mentally. Because of that, they were willing to be incredibly accommodating and work with me to help me find my potential again.\nI sincerely believe I wouldn’t have graduated without them.\n\n\nI would encourage you to talk to your prof. You don’t need to give details, but don’t sugar coat anything. Just be factual and goal-oriented: “This thing is happening. It is causing these issues for me. Here’s what I’m doing to try and mitigate the negative effects, I would greatly appreciate your patience as I try my best to complete your work during this difficult time.” \nIt’s scary and hard but very important. Out of all the profs I had to talk to about my mental health, I only had mediocre to less than helpful reactions from two of them. The rest were all willing to work with me.",
          "created_utc": 1587341412.0
        }
      ]
    },
    {
      "id": "fnxhmmn",
      "author": "None",
      "body": "How did you get medical withdrawal? I don't think I need that, but I'm somewhat nervous about talking to anyone about my restriction and how it's affecting me mentally because I'm worried they won't take it seriously.",
      "created_utc": 1587338811.0,
      "score": 2,
      "context": [
        {
          "id": "fnx9w1u",
          "author": "sel_darling",
          "body": "Dude! Back when i was studying mechanical engineerung i got medical withdraw because of my mental health. I literally couldnt het out of bed. One time i ate only 3 baby carrots for a whole day. I would (still do) constantly count calories and focus all my energy on \"her\" that i just couldnt do my work. In back in uni doing a different degree in a different country and the thoughts are still there.",
          "created_utc": 1587334368.0
        }
      ]
    },
    {
      "id": "fny87jb",
      "author": "annielovesbacon",
      "body": "I wish I could share but sadly it’s lost forever on an old computer that died :(",
      "created_utc": 1587355836.0,
      "score": 3,
      "context": [
        {
          "id": "fny6f70",
          "author": "annielovesbacon",
          "body": "You’re definitely not a slacker. I wrote a research paper on this — eating disorders literally affect your brain matter, meaning your cognitive functioning is severely impacted. It’s not your fault! The mindless activities you mentioned, you’re able to do them because they require less concentration. Doing your work, writing papers, etc requires a ton of concentration, which requires a ton of energy even though you’re not moving around or anything. \n\nI also wanted to say that I just graduated in December, and if I can do it, so can you! I’m rooting for you :)",
          "created_utc": 1587354548.0
        },
        {
          "id": "fny79xf",
          "author": "None",
          "body": "Thank you so much! That's so interesting, please let me know if I could read the paper, I've done a couple papers on AN but not on that aspect.",
          "created_utc": 1587355164.0
        }
      ]
    },
    {
      "id": "fny55eh",
      "author": "None",
      "body": "Exactly—it’s nice to have one problem solved, but it only got solved by another problem starting. It’s just such a drain on the mind and it’s physically and mentally exhausting. Hoping for you to heal and beat your ed!",
      "created_utc": 1587353657.0,
      "score": 1,
      "context": [
        {
          "id": "fnxbx14",
          "author": "None",
          "body": "YES. It’s the absolute worst. You’re not alone. I feel like my brain can’t function properly and I don’t have the energy to do all the reading, writing, and thinking that I have to do for my online classes. I am used to getting mostly As and excelling at school but now I feel like I just don’t care anymore as much. Like I don’t have the energy to care, and I don’t even care if my work is mediocre because the only thing I care about right now is weight loss. And with my brain just all foggy and not cooperating with my work I just can’t put in the amount of effort that I used to. \nAnd not sure if this is because of my “ed” but my hands are always freezing and I don’t want to type an essay when I could be holding them on my hand warmer or sleeping in my warm bed instead. \nI also have been having insomnia lately (can’t fall/stay asleep) and it means I am literally just exhausted all the time. Then I end up sleeping half the day away, and when I am awake I’m just so tired all the time (even after I do get sleep). It’s just not a good time. \nWhat’s weird is that I have diagnosed anxiety (and take prescribed antidepressants for it/have been for a couple years), but with my “ed” worsening, I just don’t care anymore about half the things I used to worry about. I’m still an over thinker and a worrier, but it interferes with my life so much less now because I don’t have the physical and mental energy to care anymore. My brain just can’t handle it. \nSo you’re not alone; hang in there. 💜",
          "created_utc": 1587335528.0
        },
        {
          "id": "fnxhkfz",
          "author": "None",
          "body": "I'm experiencing the same thing. I was really struggling with my relationship OCD the last few weeks, but as I've gotten increasingly entrenched in my ED, I've been somewhat free (knock on wood) of those obsessions. Which is nice, but not so nice that it's been replaced with this. I spend too much brain power worrying about calories, my weight, and then twice as much trying to battle my ED voice so I don't fuck myself over right before I graduate, that I just don't have the mental energy left over to cope with anything. I've had really weird sleep patterns as well because I'll randomly fall asleep from lack of nourishment. This just takes up so much headspace, it's exhausting. Honestly I hate even sitting at my desk anymore. I'd rather be buried under blankets, but I try to be somewhat good about getting out of bed during the day at least for a portion of it.",
          "created_utc": 1587338775.0
        }
      ]
    },
    {
      "id": "fnyqgow",
      "author": "None",
      "body": "Voice text is a great idea, I need to try that! Then I can write essays while half asleep in bed 😂. Thank you!",
      "created_utc": 1587371810.0,
      "score": 1,
      "context": [
        {
          "id": "fnxbx14",
          "author": "None",
          "body": "YES. It’s the absolute worst. You’re not alone. I feel like my brain can’t function properly and I don’t have the energy to do all the reading, writing, and thinking that I have to do for my online classes. I am used to getting mostly As and excelling at school but now I feel like I just don’t care anymore as much. Like I don’t have the energy to care, and I don’t even care if my work is mediocre because the only thing I care about right now is weight loss. And with my brain just all foggy and not cooperating with my work I just can’t put in the amount of effort that I used to. \nAnd not sure if this is because of my “ed” but my hands are always freezing and I don’t want to type an essay when I could be holding them on my hand warmer or sleeping in my warm bed instead. \nI also have been having insomnia lately (can’t fall/stay asleep) and it means I am literally just exhausted all the time. Then I end up sleeping half the day away, and when I am awake I’m just so tired all the time (even after I do get sleep). It’s just not a good time. \nWhat’s weird is that I have diagnosed anxiety (and take prescribed antidepressants for it/have been for a couple years), but with my “ed” worsening, I just don’t care anymore about half the things I used to worry about. I’m still an over thinker and a worrier, but it interferes with my life so much less now because I don’t have the physical and mental energy to care anymore. My brain just can’t handle it. \nSo you’re not alone; hang in there. 💜",
          "created_utc": 1587335528.0
        },
        {
          "id": "fnynkda",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1587368874.0
        }
      ]
    },
    {
      "id": "fnyd5fs",
      "author": "hxneyfxck",
      "body": "I think that’s totally valid! Idk about you, but my ED/restriction stems largely from OCD. It’s worse than ever right now because food intake is the only I can control in my current environment/lockdown. \n\nIf it’s true for you, maybe approach it like, “Hey, my OCD sometimes manifests itself in my relationship with food. I’m aware of this and working on it, but it’s really impacting my ability to focus and turn in good work right now.”\n\nOr even, “Hey, so my OCD behaviors are really taking over right now because I feel like I have such a lack of control during this time/these circumstances. They’re getting in the way, but I’m aware and trying to address them to minimize the effects.”\n\nOr something like that? And I 100% understand not wanting to disclose an ED even if you’ve discussed other mental health stuff. For me, my ED is so much more...vulnerable? Intimate? Than my anxiety/depression/OCD/whatever. The good news is that they’re psych profs — they should be knowledgeable enough to not tell you to “just eat” (although let’s be real, ignorance abounds and it is a risk). \n\nJust remember: you can disclose however much you want to or don’t want to! You could even just tell them that you’re struggling with a different aspect of your mental health that you’re not comfortable disclosing, but that it ties in closely with x/y/z you’ve already discussed with them or something?\n\nSorry I feel like I’m rambling lol. Either way, you got this! It’s a weird and stressful time for everyone, and you’re not alone!",
      "created_utc": 1587359645.0,
      "score": 2,
      "context": [
        {
          "id": "fnxly8t",
          "author": "hxneyfxck",
          "body": "You are not alone! This was me 100% before I graduated (thank goodness I’m done & out of there). Complete inability to focus, attention span of a concussed goldfish, pretty much 0 retention of new material unless I was hopped up on enough caffeine/anxiety to power through.\n\nIt sucked realizing that my ED was drawing strength from one of the loves of my life: academia.\n\nLooking back, I can confidently say I only graduated because of the following:\n\n• I made the dean’s list my very first semester of college, and tbh I kind of used my initially high GPA as a buffer of sorts to dip into during the tougher semesters. \nBy the time I was done and graduated, my GPA was hovering around a 3.4 or something. So not the best by my standards (for me) but not too shabby all things considering!\n\n• I was honest & upfront with my profs...kinda. I didn’t go into details about the ED, but went to them one on one and let them know I was really struggling with my mental health, and also with the unhealthy coping mechanisms I’d developed as a result. No specifics, just very factual. I let them know I was in therapy (at the time) and working with a psychiatrist to try and help me along. Letting them know about the psychiatrist was important because I was able to basically say, “sorry if my attendance/work quality/attention span is incredibly hit or miss. It probably will be for several months, because we are trying to figure out dosages. I’m not sure how I’m going to react, but I am going to try my best and I will try to keep you informed on my progress.”\n\nI was lucky enough to have three very understanding, compassionate, and flexible professors. I was a double major, two of them made up the entire department of one of my majors, and the other was a long-time prof of mine for my other major. They had seen me for all 4 years, so they all got first hand seats to watch my mental decline lol. But it ended up working in my favor, because they had already seen what I was capable of when I was doing well mentally. Because of that, they were willing to be incredibly accommodating and work with me to help me find my potential again.\nI sincerely believe I wouldn’t have graduated without them.\n\n\nI would encourage you to talk to your prof. You don’t need to give details, but don’t sugar coat anything. Just be factual and goal-oriented: “This thing is happening. It is causing these issues for me. Here’s what I’m doing to try and mitigate the negative effects, I would greatly appreciate your patience as I try my best to complete your work during this difficult time.” \nIt’s scary and hard but very important. Out of all the profs I had to talk to about my mental health, I only had mediocre to less than helpful reactions from two of them. The rest were all willing to work with me.",
          "created_utc": 1587341412.0
        },
        {
          "id": "fnxn2qh",
          "author": "None",
          "body": "I'm super super lucky also to have really understanding and accommodating professors (aren't they the best?) and being a psychology major is nice because most professors are doubly supportive. I also have two professors who've known me for the past two years (since I started at my current university) and have had to witness far too many panic attacks and receive far too many panicked incoherent emails LOL. I'm an open book with mental health stuff though so they practically know my life story by now.\n\nI think my biggest concern is telling them about my eating disorder stuff. They completely understand anxiety/OCD/mental health in general, but I feel like saying that my anorexia/restriction is making it difficult for me to focus and rise to the occasion sounds so dumb and they'll just be like \"....or you could eat and this wouldn't be a problem,\" you know? I guess I don't need to go into detail, but I'm super honest and I want them to know what's happening instead of just saying it's my anxiety or whatever.",
          "created_utc": 1587342107.0
        }
      ]
    },
    {
      "id": "fnxi140",
      "author": "sel_darling",
      "body": "My uni had therapists and counselors. I went to see if had any learning disabilities and that lead to mr talking about depression and anxiety. Although i somewhat mentioned my eating habits, since i wasnt extremely underweight and i wasnt ready to talk about that, they didnt push me. We mostly focused on the other stuff. Before uni i had never been diagnosed but there was a lot of stuff i kept hidden.",
      "created_utc": 1587339049.0,
      "score": 2,
      "context": [
        {
          "id": "fnx9w1u",
          "author": "sel_darling",
          "body": "Dude! Back when i was studying mechanical engineerung i got medical withdraw because of my mental health. I literally couldnt het out of bed. One time i ate only 3 baby carrots for a whole day. I would (still do) constantly count calories and focus all my energy on \"her\" that i just couldnt do my work. In back in uni doing a different degree in a different country and the thoughts are still there.",
          "created_utc": 1587334368.0
        },
        {
          "id": "fnxhmmn",
          "author": "None",
          "body": "How did you get medical withdrawal? I don't think I need that, but I'm somewhat nervous about talking to anyone about my restriction and how it's affecting me mentally because I'm worried they won't take it seriously.",
          "created_utc": 1587338811.0
        }
      ]
    },
    {
      "id": "fnyfqfw",
      "author": "None",
      "body": "Yup, it was absolutely triggered by my GAD/OCD. When all this stuff first started happening, I went back to self-harming (which for me is a compulsive/control behavior) to deal with the anxiety. My relationship OCD spiked, which worsened everything, then I just kind of... slid back into my ED behaviors, which then replaced the self-harm and ROCD.\n\nMy plan is to try and get a weight check tomorrow at CVS. When I saw my doctor in January she said that I could come back for a weight check if I was struggling in a few months, but clearly that's not an option now. I generally try to avoid seeing my weight, but I am thinking of trying to find a nutritionist as well as an ED therapist, and if I do, I want to be able to be forthcoming about wherever I'm at. Right now I have *literally* no idea what my weight could be in relation to in January. If my weight is for some reason at a more concerning point than I expected, then I definitely will pursue a nutritionist because even though I HATE the idea of being told to gain weight, I know there's a certain point at which I need professional support and can't just do this alone.\n\nSo once I hopefully get a better picture of where I stand, I think I'll feel more comfortable talking to my professors openly about what's been going on. I guess I'll just feel like I am more validated if I know for sure that I've lost weight? It like \"proves\" that I'm restricting and it's something tangible I can explain to my professors. Sorry I'm totally rambling too but thank you so much for your support and listening ear. All of this is so stressful for me, ugh. Thank you again <3",
      "created_utc": 1587361745.0,
      "score": 2,
      "context": [
        {
          "id": "fnxly8t",
          "author": "hxneyfxck",
          "body": "You are not alone! This was me 100% before I graduated (thank goodness I’m done & out of there). Complete inability to focus, attention span of a concussed goldfish, pretty much 0 retention of new material unless I was hopped up on enough caffeine/anxiety to power through.\n\nIt sucked realizing that my ED was drawing strength from one of the loves of my life: academia.\n\nLooking back, I can confidently say I only graduated because of the following:\n\n• I made the dean’s list my very first semester of college, and tbh I kind of used my initially high GPA as a buffer of sorts to dip into during the tougher semesters. \nBy the time I was done and graduated, my GPA was hovering around a 3.4 or something. So not the best by my standards (for me) but not too shabby all things considering!\n\n• I was honest & upfront with my profs...kinda. I didn’t go into details about the ED, but went to them one on one and let them know I was really struggling with my mental health, and also with the unhealthy coping mechanisms I’d developed as a result. No specifics, just very factual. I let them know I was in therapy (at the time) and working with a psychiatrist to try and help me along. Letting them know about the psychiatrist was important because I was able to basically say, “sorry if my attendance/work quality/attention span is incredibly hit or miss. It probably will be for several months, because we are trying to figure out dosages. I’m not sure how I’m going to react, but I am going to try my best and I will try to keep you informed on my progress.”\n\nI was lucky enough to have three very understanding, compassionate, and flexible professors. I was a double major, two of them made up the entire department of one of my majors, and the other was a long-time prof of mine for my other major. They had seen me for all 4 years, so they all got first hand seats to watch my mental decline lol. But it ended up working in my favor, because they had already seen what I was capable of when I was doing well mentally. Because of that, they were willing to be incredibly accommodating and work with me to help me find my potential again.\nI sincerely believe I wouldn’t have graduated without them.\n\n\nI would encourage you to talk to your prof. You don’t need to give details, but don’t sugar coat anything. Just be factual and goal-oriented: “This thing is happening. It is causing these issues for me. Here’s what I’m doing to try and mitigate the negative effects, I would greatly appreciate your patience as I try my best to complete your work during this difficult time.” \nIt’s scary and hard but very important. Out of all the profs I had to talk to about my mental health, I only had mediocre to less than helpful reactions from two of them. The rest were all willing to work with me.",
          "created_utc": 1587341412.0
        },
        {
          "id": "fnxn2qh",
          "author": "None",
          "body": "I'm super super lucky also to have really understanding and accommodating professors (aren't they the best?) and being a psychology major is nice because most professors are doubly supportive. I also have two professors who've known me for the past two years (since I started at my current university) and have had to witness far too many panic attacks and receive far too many panicked incoherent emails LOL. I'm an open book with mental health stuff though so they practically know my life story by now.\n\nI think my biggest concern is telling them about my eating disorder stuff. They completely understand anxiety/OCD/mental health in general, but I feel like saying that my anorexia/restriction is making it difficult for me to focus and rise to the occasion sounds so dumb and they'll just be like \"....or you could eat and this wouldn't be a problem,\" you know? I guess I don't need to go into detail, but I'm super honest and I want them to know what's happening instead of just saying it's my anxiety or whatever.",
          "created_utc": 1587342107.0
        },
        {
          "id": "fnyd5fs",
          "author": "hxneyfxck",
          "body": "I think that’s totally valid! Idk about you, but my ED/restriction stems largely from OCD. It’s worse than ever right now because food intake is the only I can control in my current environment/lockdown. \n\nIf it’s true for you, maybe approach it like, “Hey, my OCD sometimes manifests itself in my relationship with food. I’m aware of this and working on it, but it’s really impacting my ability to focus and turn in good work right now.”\n\nOr even, “Hey, so my OCD behaviors are really taking over right now because I feel like I have such a lack of control during this time/these circumstances. They’re getting in the way, but I’m aware and trying to address them to minimize the effects.”\n\nOr something like that? And I 100% understand not wanting to disclose an ED even if you’ve discussed other mental health stuff. For me, my ED is so much more...vulnerable? Intimate? Than my anxiety/depression/OCD/whatever. The good news is that they’re psych profs — they should be knowledgeable enough to not tell you to “just eat” (although let’s be real, ignorance abounds and it is a risk). \n\nJust remember: you can disclose however much you want to or don’t want to! You could even just tell them that you’re struggling with a different aspect of your mental health that you’re not comfortable disclosing, but that it ties in closely with x/y/z you’ve already discussed with them or something?\n\nSorry I feel like I’m rambling lol. Either way, you got this! It’s a weird and stressful time for everyone, and you’re not alone!",
          "created_utc": 1587359645.0
        }
      ]
    },
    {
      "id": "fnxigyp",
      "author": "None",
      "body": "I was in therapy for probably 7 years solid, starting with wraparound therapy after I was discharged from inpatient 9 years ago, but I'd taken a break... I went to my school's counseling department last spring and it was helpful because I was lapsing, but unfortunately they aren't taking any new clients now :/ I have a Zoom meeting with a case manager from the dean of students office on Tuesday and my last case manager was super helpful, so I think I'm going to talk to her. I'm open about my ED, just really scared of being dismissed.",
      "created_utc": 1587339312.0,
      "score": 1,
      "context": [
        {
          "id": "fnx9w1u",
          "author": "sel_darling",
          "body": "Dude! Back when i was studying mechanical engineerung i got medical withdraw because of my mental health. I literally couldnt het out of bed. One time i ate only 3 baby carrots for a whole day. I would (still do) constantly count calories and focus all my energy on \"her\" that i just couldnt do my work. In back in uni doing a different degree in a different country and the thoughts are still there.",
          "created_utc": 1587334368.0
        },
        {
          "id": "fnxhmmn",
          "author": "None",
          "body": "How did you get medical withdrawal? I don't think I need that, but I'm somewhat nervous about talking to anyone about my restriction and how it's affecting me mentally because I'm worried they won't take it seriously.",
          "created_utc": 1587338811.0
        },
        {
          "id": "fnxi140",
          "author": "sel_darling",
          "body": "My uni had therapists and counselors. I went to see if had any learning disabilities and that lead to mr talking about depression and anxiety. Although i somewhat mentioned my eating habits, since i wasnt extremely underweight and i wasnt ready to talk about that, they didnt push me. We mostly focused on the other stuff. Before uni i had never been diagnosed but there was a lot of stuff i kept hidden.",
          "created_utc": 1587339049.0
        }
      ]
    },
    {
      "id": "fo1e953",
      "author": "hxneyfxck",
      "body": "I totally understand the need to validate/prove your ED with documented weight loss. The DSM-V is a bitch hahaha. And anytime! Feel free to DM me whenever <3",
      "created_utc": 1587431394.0,
      "score": 2,
      "context": [
        {
          "id": "fnxly8t",
          "author": "hxneyfxck",
          "body": "You are not alone! This was me 100% before I graduated (thank goodness I’m done & out of there). Complete inability to focus, attention span of a concussed goldfish, pretty much 0 retention of new material unless I was hopped up on enough caffeine/anxiety to power through.\n\nIt sucked realizing that my ED was drawing strength from one of the loves of my life: academia.\n\nLooking back, I can confidently say I only graduated because of the following:\n\n• I made the dean’s list my very first semester of college, and tbh I kind of used my initially high GPA as a buffer of sorts to dip into during the tougher semesters. \nBy the time I was done and graduated, my GPA was hovering around a 3.4 or something. So not the best by my standards (for me) but not too shabby all things considering!\n\n• I was honest & upfront with my profs...kinda. I didn’t go into details about the ED, but went to them one on one and let them know I was really struggling with my mental health, and also with the unhealthy coping mechanisms I’d developed as a result. No specifics, just very factual. I let them know I was in therapy (at the time) and working with a psychiatrist to try and help me along. Letting them know about the psychiatrist was important because I was able to basically say, “sorry if my attendance/work quality/attention span is incredibly hit or miss. It probably will be for several months, because we are trying to figure out dosages. I’m not sure how I’m going to react, but I am going to try my best and I will try to keep you informed on my progress.”\n\nI was lucky enough to have three very understanding, compassionate, and flexible professors. I was a double major, two of them made up the entire department of one of my majors, and the other was a long-time prof of mine for my other major. They had seen me for all 4 years, so they all got first hand seats to watch my mental decline lol. But it ended up working in my favor, because they had already seen what I was capable of when I was doing well mentally. Because of that, they were willing to be incredibly accommodating and work with me to help me find my potential again.\nI sincerely believe I wouldn’t have graduated without them.\n\n\nI would encourage you to talk to your prof. You don’t need to give details, but don’t sugar coat anything. Just be factual and goal-oriented: “This thing is happening. It is causing these issues for me. Here’s what I’m doing to try and mitigate the negative effects, I would greatly appreciate your patience as I try my best to complete your work during this difficult time.” \nIt’s scary and hard but very important. Out of all the profs I had to talk to about my mental health, I only had mediocre to less than helpful reactions from two of them. The rest were all willing to work with me.",
          "created_utc": 1587341412.0
        },
        {
          "id": "fnxn2qh",
          "author": "None",
          "body": "I'm super super lucky also to have really understanding and accommodating professors (aren't they the best?) and being a psychology major is nice because most professors are doubly supportive. I also have two professors who've known me for the past two years (since I started at my current university) and have had to witness far too many panic attacks and receive far too many panicked incoherent emails LOL. I'm an open book with mental health stuff though so they practically know my life story by now.\n\nI think my biggest concern is telling them about my eating disorder stuff. They completely understand anxiety/OCD/mental health in general, but I feel like saying that my anorexia/restriction is making it difficult for me to focus and rise to the occasion sounds so dumb and they'll just be like \"....or you could eat and this wouldn't be a problem,\" you know? I guess I don't need to go into detail, but I'm super honest and I want them to know what's happening instead of just saying it's my anxiety or whatever.",
          "created_utc": 1587342107.0
        },
        {
          "id": "fnyd5fs",
          "author": "hxneyfxck",
          "body": "I think that’s totally valid! Idk about you, but my ED/restriction stems largely from OCD. It’s worse than ever right now because food intake is the only I can control in my current environment/lockdown. \n\nIf it’s true for you, maybe approach it like, “Hey, my OCD sometimes manifests itself in my relationship with food. I’m aware of this and working on it, but it’s really impacting my ability to focus and turn in good work right now.”\n\nOr even, “Hey, so my OCD behaviors are really taking over right now because I feel like I have such a lack of control during this time/these circumstances. They’re getting in the way, but I’m aware and trying to address them to minimize the effects.”\n\nOr something like that? And I 100% understand not wanting to disclose an ED even if you’ve discussed other mental health stuff. For me, my ED is so much more...vulnerable? Intimate? Than my anxiety/depression/OCD/whatever. The good news is that they’re psych profs — they should be knowledgeable enough to not tell you to “just eat” (although let’s be real, ignorance abounds and it is a risk). \n\nJust remember: you can disclose however much you want to or don’t want to! You could even just tell them that you’re struggling with a different aspect of your mental health that you’re not comfortable disclosing, but that it ties in closely with x/y/z you’ve already discussed with them or something?\n\nSorry I feel like I’m rambling lol. Either way, you got this! It’s a weird and stressful time for everyone, and you’re not alone!",
          "created_utc": 1587359645.0
        },
        {
          "id": "fnyfqfw",
          "author": "None",
          "body": "Yup, it was absolutely triggered by my GAD/OCD. When all this stuff first started happening, I went back to self-harming (which for me is a compulsive/control behavior) to deal with the anxiety. My relationship OCD spiked, which worsened everything, then I just kind of... slid back into my ED behaviors, which then replaced the self-harm and ROCD.\n\nMy plan is to try and get a weight check tomorrow at CVS. When I saw my doctor in January she said that I could come back for a weight check if I was struggling in a few months, but clearly that's not an option now. I generally try to avoid seeing my weight, but I am thinking of trying to find a nutritionist as well as an ED therapist, and if I do, I want to be able to be forthcoming about wherever I'm at. Right now I have *literally* no idea what my weight could be in relation to in January. If my weight is for some reason at a more concerning point than I expected, then I definitely will pursue a nutritionist because even though I HATE the idea of being told to gain weight, I know there's a certain point at which I need professional support and can't just do this alone.\n\nSo once I hopefully get a better picture of where I stand, I think I'll feel more comfortable talking to my professors openly about what's been going on. I guess I'll just feel like I am more validated if I know for sure that I've lost weight? It like \"proves\" that I'm restricting and it's something tangible I can explain to my professors. Sorry I'm totally rambling too but thank you so much for your support and listening ear. All of this is so stressful for me, ugh. Thank you again <3",
          "created_utc": 1587361745.0
        }
      ]
    },
    {
      "id": "fnxiyex",
      "author": "sel_darling",
      "body": "When i started getting better i felt like i could get work done but by that time it was too late. They were understanding of me. When i stopped attending classes i had a professor email me asking if everything was ok. I felt guilty about \"failing\" because i had never \"failed\" a class before. Counselor reassured me that it wasnt failing, but a medical withdrawal. If you have can use your resources and turn things around right now before its too late, do it. I would cry myself to sleep because \"she\" took my education away. In my mind, \"well i already failed my classes might as well commit to her\"",
      "created_utc": 1587339602.0,
      "score": 2,
      "context": [
        {
          "id": "fnx9w1u",
          "author": "sel_darling",
          "body": "Dude! Back when i was studying mechanical engineerung i got medical withdraw because of my mental health. I literally couldnt het out of bed. One time i ate only 3 baby carrots for a whole day. I would (still do) constantly count calories and focus all my energy on \"her\" that i just couldnt do my work. In back in uni doing a different degree in a different country and the thoughts are still there.",
          "created_utc": 1587334368.0
        },
        {
          "id": "fnxhmmn",
          "author": "None",
          "body": "How did you get medical withdrawal? I don't think I need that, but I'm somewhat nervous about talking to anyone about my restriction and how it's affecting me mentally because I'm worried they won't take it seriously.",
          "created_utc": 1587338811.0
        },
        {
          "id": "fnxi140",
          "author": "sel_darling",
          "body": "My uni had therapists and counselors. I went to see if had any learning disabilities and that lead to mr talking about depression and anxiety. Although i somewhat mentioned my eating habits, since i wasnt extremely underweight and i wasnt ready to talk about that, they didnt push me. We mostly focused on the other stuff. Before uni i had never been diagnosed but there was a lot of stuff i kept hidden.",
          "created_utc": 1587339049.0
        },
        {
          "id": "fnxigyp",
          "author": "None",
          "body": "I was in therapy for probably 7 years solid, starting with wraparound therapy after I was discharged from inpatient 9 years ago, but I'd taken a break... I went to my school's counseling department last spring and it was helpful because I was lapsing, but unfortunately they aren't taking any new clients now :/ I have a Zoom meeting with a case manager from the dean of students office on Tuesday and my last case manager was super helpful, so I think I'm going to talk to her. I'm open about my ED, just really scared of being dismissed.",
          "created_utc": 1587339312.0
        }
      ]
    },
    {
      "id": "fnxjcdi",
      "author": "None",
      "body": "Thank you! Yeah, I already have asked for an Incomplete in one of my classes. Luckily I finished my Honors Thesis and did the defense which was the biggie for me to do before graduation, and my faculty said that I'll get an A on that. I have an independent reading to do and one other class, though, and I just feel so mentally exhausted. I'm going to reach out to my professors though because I'm generally communicative (and being a psych major they're pretty understanding). I don't think I'm that underweight, but I know that I'm consciously restricting and calorie-counting and eating below what I should be. I tend to invalidate myself though because I feel like I'm overreacting since I'm like barely on the cusp of being underweight... I hate this disorder, ugh.",
      "created_utc": 1587339838.0,
      "score": 2,
      "context": [
        {
          "id": "fnx9w1u",
          "author": "sel_darling",
          "body": "Dude! Back when i was studying mechanical engineerung i got medical withdraw because of my mental health. I literally couldnt het out of bed. One time i ate only 3 baby carrots for a whole day. I would (still do) constantly count calories and focus all my energy on \"her\" that i just couldnt do my work. In back in uni doing a different degree in a different country and the thoughts are still there.",
          "created_utc": 1587334368.0
        },
        {
          "id": "fnxhmmn",
          "author": "None",
          "body": "How did you get medical withdrawal? I don't think I need that, but I'm somewhat nervous about talking to anyone about my restriction and how it's affecting me mentally because I'm worried they won't take it seriously.",
          "created_utc": 1587338811.0
        },
        {
          "id": "fnxi140",
          "author": "sel_darling",
          "body": "My uni had therapists and counselors. I went to see if had any learning disabilities and that lead to mr talking about depression and anxiety. Although i somewhat mentioned my eating habits, since i wasnt extremely underweight and i wasnt ready to talk about that, they didnt push me. We mostly focused on the other stuff. Before uni i had never been diagnosed but there was a lot of stuff i kept hidden.",
          "created_utc": 1587339049.0
        },
        {
          "id": "fnxigyp",
          "author": "None",
          "body": "I was in therapy for probably 7 years solid, starting with wraparound therapy after I was discharged from inpatient 9 years ago, but I'd taken a break... I went to my school's counseling department last spring and it was helpful because I was lapsing, but unfortunately they aren't taking any new clients now :/ I have a Zoom meeting with a case manager from the dean of students office on Tuesday and my last case manager was super helpful, so I think I'm going to talk to her. I'm open about my ED, just really scared of being dismissed.",
          "created_utc": 1587339312.0
        },
        {
          "id": "fnxiyex",
          "author": "sel_darling",
          "body": "When i started getting better i felt like i could get work done but by that time it was too late. They were understanding of me. When i stopped attending classes i had a professor email me asking if everything was ok. I felt guilty about \"failing\" because i had never \"failed\" a class before. Counselor reassured me that it wasnt failing, but a medical withdrawal. If you have can use your resources and turn things around right now before its too late, do it. I would cry myself to sleep because \"she\" took my education away. In my mind, \"well i already failed my classes might as well commit to her\"",
          "created_utc": 1587339602.0
        }
      ]
    }
  ]
}