{
  "id": "g9hzs5",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1588055248.0,
  "title": "My friend told me this",
  "selftext": "I outgrew my clothes from before puberty hit but I refused to let go of them. My friend told me that your clothes should fit you.. not the other way around. Why was I forcing myself to such limits to try and fit into a piece of cloth lol and I was super stunned. (By the way I was 18 trying to fit into smth from when I was 12). \n\nThe body obviously grows during this period of time. And I shouldn’t be trying to stop that! 😊 currently about 1 year recovered and I do look back occasionally but more often than not I win over the unreasonable voices in my head :-)",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/g9hzs5/my_friend_told_me_this/",
  "score": 111,
  "num_comments": 10,
  "comments": [
    {
      "id": "fotnmpd",
      "author": "bewilderedtea",
      "body": "That’s a really beautiful way of looking at it. Our bodies are there to support us we shouldn’t be making them try to fit into anything, they have enough to do!",
      "created_utc": 1588059689.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fouskmy",
      "author": "None",
      "body": "This is something I constantly try to remind myself. You're *supposed* to gain weight over puberty. I *shouldn't* weigh what I did as an adult as I did in middle school, even if I'm only an inch taller. It's so hard to let go of the mentality that I should be the same, but that's how your body works and that's what it wants to be doing. I know many of my friends who also underwent those physical changes, including weight gain, and weren't fazed by it because that's literally what every medical text says is supposed to happen. \n\nI actually did one of those dumb \"ideal body weight\" calculators and realized that if I change the age from fourteen to twenty-three, the lower end of a healthy/expected weight is *significantly* lower for a teenager than an adult. When my doctor was worried because my weight hadn't been so low in nine years, I scoffed because I was still within my healthy weight range... but then realized that her concern stems from the fact that I *shouldn't* be weighing what I weighed when I hadn't even gotten my period yet.\n\nI always thought because I'm basically the same height still, I should weigh the same. I forgot to take into account that the body develops no matter its height and adds hips and bone structure and body parts and does the things necessary to prepare me for having a baby (someday). I was watching an old video of me from when I had just started restricting and realized I was almost completely flat-chested and had no curves. I was like, whoa, of course I should've gained weight since then. I think it's a common mentality in older females with anorexia, and it's such a trap.",
      "created_utc": 1588089700.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fotpf5g",
      "author": "minessa",
      "body": "You Can be \"skinny\" without have a child body ! I dont understand why a lot of girls want back her kid body. I think it is a way to express a fear of being an adult.\nI want to be as skinnier as possible but i dont want to look like a child. I want to be a skinny woman not a small kid. (I'm not shaming you, just trying to make you understand that maybe there's an explaination why you are trying your kid clothes while being an adult)",
      "created_utc": 1588061440.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fourf73",
      "author": "None",
      "body": "What age did you stop growing? I stopped growing at like 11 lmao",
      "created_utc": 1588089155.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fov8ftv",
      "author": "mooneyes7",
      "body": "Yes... this is so true. Even as an adult, it’s okay to not wear the smallest size. It’s okay to not wear the smallest size. It’s okay to not be the absolute smallest size available.",
      "created_utc": 1588097082.0,
      "score": 1,
      "context": []
    },
    {
      "id": "foty6th",
      "author": "Friendly-Introvert",
      "body": "I’m 20 cm/ ~8 inches taller now than when i was 12. Even if She was refering to weight do you expect people not to grow taller?",
      "created_utc": 1588070329.0,
      "score": -2,
      "context": []
    },
    {
      "id": "fouttid",
      "author": "ravi0li_draws",
      "body": "most people stop around 16-19, but it can continue in some places until 28.",
      "created_utc": 1588090293.0,
      "score": 3,
      "context": [
        {
          "id": "fourf73",
          "author": "None",
          "body": "What age did you stop growing? I stopped growing at like 11 lmao",
          "created_utc": 1588089155.0
        }
      ]
    },
    {
      "id": "fourgqx",
      "author": "None",
      "body": "I havent grown since i was 11",
      "created_utc": 1588089176.0,
      "score": 3,
      "context": [
        {
          "id": "foty6th",
          "author": "Friendly-Introvert",
          "body": "I’m 20 cm/ ~8 inches taller now than when i was 12. Even if She was refering to weight do you expect people not to grow taller?",
          "created_utc": 1588070329.0
        }
      ]
    },
    {
      "id": "foutyyd",
      "author": "ravi0li_draws",
      "body": "that's the thing with EDs though, they arent logical",
      "created_utc": 1588090365.0,
      "score": 3,
      "context": [
        {
          "id": "foty6th",
          "author": "Friendly-Introvert",
          "body": "I’m 20 cm/ ~8 inches taller now than when i was 12. Even if She was refering to weight do you expect people not to grow taller?",
          "created_utc": 1588070329.0
        }
      ]
    },
    {
      "id": "fouulqs",
      "author": "None",
      "body": "oh wow lol im short so I guess I didnt need much time 😂",
      "created_utc": 1588090662.0,
      "score": 2,
      "context": [
        {
          "id": "fourf73",
          "author": "None",
          "body": "What age did you stop growing? I stopped growing at like 11 lmao",
          "created_utc": 1588089155.0
        },
        {
          "id": "fouttid",
          "author": "ravi0li_draws",
          "body": "most people stop around 16-19, but it can continue in some places until 28.",
          "created_utc": 1588090293.0
        }
      ]
    }
  ]
}