{
  "id": "gax6ub",
  "subreddit": "AnorexiaNervosa",
  "author": "OuterKitKat",
  "created_utc": 1588258637.0,
  "title": "Am I the only one who feels like crying when people ask them if they’ve eaten?",
  "selftext": "Like, not even a sort of “boo boo I’m so sad because I haven’t eaten and that reminds me how I’m failing” or all that. It’s just I was having an okay morning, did my exercise, went downstairs thinking I should eat a light breakfast because yay recovery, and then my mom comes and asks me if I had breakfast already and I got so nervous and felt so terrible, I only wanted to get out of there. \n\nLong story short I had a panic attack in the bathroom and weighed myself (even though I promised I wouldn’t) and i weight more than expected and I’m not having breakfast or any other meal today :’)\n\nHas anyone else felt the same? Like it’s not even logical, I just felt a switch go off from my happy mode to straight up suicidal",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/gax6ub/am_i_the_only_one_who_feels_like_crying_when/",
  "score": 133,
  "num_comments": 13,
  "comments": [
    {
      "id": "fp2wjkt",
      "author": "tokieofrivia",
      "body": "I get frustrated and angry which generally brings me to tears (I'm not a yeller, I'm a crier).\n\nI *hate* it when people ask me if I've eaten and what I've eaten. I could eat perfectly fine all day and not feel guilty but the second I'm asked to recount everything I've put in my mouth? That's a no-go for me.",
      "created_utc": 1588269073.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fp2nt0x",
      "author": "PrincessTiaraLove",
      "body": "Yes this used to be me. Not totally sure how it manifested, but there was a time when putting food to my mouth would trigger bursts of tears lol. This lasted for a very long time. Sounds funny now, but yeah. \n\nNow I just take the food or say I’m not hungry. Mostly I take the food tho haha.",
      "created_utc": 1588264914.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fp2zz9u",
      "author": "dhehebdj",
      "body": "It's probably because that question hits straight at a vulnerbale part of u and it kinda feels like you're being scrutinised",
      "created_utc": 1588270739.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fp3814r",
      "author": "None",
      "body": "Does anyone elses brain feel like mud like it's so hard to think to even comprehend what your doing. In general and to yourself",
      "created_utc": 1588274700.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fp3et6f",
      "author": "MoosieGoose",
      "body": "I always hate it.\n\nSo often it results in the person saying \"Yeah, me either.\" and then I feel bad if I was planning to eat. \n\nOther times, they want to make food for me, and I feel 1000x worse wasting food.",
      "created_utc": 1588278058.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fp3vria",
      "author": "WillowIris",
      "body": "I cry when I starve myself and see other people eat or if I see food",
      "created_utc": 1588286717.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fp3kttt",
      "author": "Gees_sass",
      "body": "Me too, like I'm slowly trying to do better but that won't be enough for other people",
      "created_utc": 1588281066.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fp3q20b",
      "author": "pityparty69",
      "body": "I get that feeling all the time. It's so bad that I get to the point where I've locked myself up in my room because I don't want my mom to question me. Like, I know the questions she asks are not meant to hurt me, but it's not helping that she asks. It's a toxic trigger that I have.",
      "created_utc": 1588283735.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fp3h24f",
      "author": "mooneyes7",
      "body": "I hate being asked “What do you want to eat?” 🤬🤬🤬🤬🤬",
      "created_utc": 1588279173.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fp41l9n",
      "author": "shinyxcrab",
      "body": "I’ve told my husband it’s better to just not mention anything about food, weight, eating habits, my looks, or anything relevant at all, because it all triggers me. Even when it’s a compliment or not even about me. I’m sure it’s like walking on eggshells, but I just don’t know what else to do to prevent it. He thinks that equals supporting my disorder, but it’s definitely the opposite. I wouldn’t say I’m in recovery, but sort of a remission? Idk. So keeping the triggers down really helps.",
      "created_utc": 1588289893.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fp46447",
      "author": "complexmariner",
      "body": "yup me, i used to come home from work quite late planning to make myself some food, then my dad would instantly ask me if i had food and i couldn't say no so i would always just lie and say i picked something up on my way home,,,, i totally get u",
      "created_utc": 1588292440.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fp3886z",
      "author": "OuterKitKat",
      "body": "Yeah!!  This terrible muddy feeling is what I get when people mention that I should eat >_< it’s not even a logical train of thought to accurately say I feel “sad”, it’s just... mud",
      "created_utc": 1588274797.0,
      "score": 9,
      "context": [
        {
          "id": "fp3814r",
          "author": "None",
          "body": "Does anyone elses brain feel like mud like it's so hard to think to even comprehend what your doing. In general and to yourself",
          "created_utc": 1588274700.0
        }
      ]
    },
    {
      "id": "fp38o87",
      "author": "None",
      "body": "Like everything kind of slows down and is just like hard to think",
      "created_utc": 1588275015.0,
      "score": 6,
      "context": [
        {
          "id": "fp3814r",
          "author": "None",
          "body": "Does anyone elses brain feel like mud like it's so hard to think to even comprehend what your doing. In general and to yourself",
          "created_utc": 1588274700.0
        },
        {
          "id": "fp3886z",
          "author": "OuterKitKat",
          "body": "Yeah!!  This terrible muddy feeling is what I get when people mention that I should eat >_< it’s not even a logical train of thought to accurately say I feel “sad”, it’s just... mud",
          "created_utc": 1588274797.0
        }
      ]
    }
  ]
}