{
  "id": "geq20s",
  "subreddit": "AnorexiaNervosa",
  "author": "cat_faced_",
  "created_utc": 1588791302.0,
  "title": "DAE feel irrationally protective over their cutlery/dinner ware?",
  "selftext": "I pretty much eat all of my food out of this smallish bowl, it just feels weirdly safe to me. I always clean it and put it away after using it.\nWell, today I found it used and left out covered in this weird sticky orange sauce and I pretty much had a mini mental breakdown over it.\nI know it's ridiculous... But I still can't stop thinking about it even after scrubbing it clean. All my safe foods that I usually eat out of it seem tainted now. \nDoes anyone else get this kind of thing? Wtf is wrong with my brain",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/geq20s/dae_feel_irrationally_protective_over_their/",
  "score": 113,
  "num_comments": 8,
  "comments": [
    {
      "id": "fpp147q",
      "author": "sorcerers_apprentice",
      "body": "Yes, I have a spoon that I'm weirdly attached to...I don't know why this is a thing, but it is. Something to do with the obsessiveness, maybe.",
      "created_utc": 1588794134.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fppop6k",
      "author": "None",
      "body": "I hide my “special” spoon. It’s smaller than the rest.",
      "created_utc": 1588806211.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fppsbof",
      "author": "anonsimz",
      "body": "I can only eat off plastic plates or bowls. ceramic is just too much for me",
      "created_utc": 1588808190.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fppwn96",
      "author": "mooneyes7",
      "body": "I used to have “my plate” even used it after it chipped.",
      "created_utc": 1588810596.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fpq6xgb",
      "author": "Yyousuckk",
      "body": "nobody else can use them otherwise it will have leftover cals (ed thoughts make no sense)",
      "created_utc": 1588816393.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpq9plr",
      "author": "whataboutbrie",
      "body": "I’m glad other people have experienced this!! I lost my shit when my just right bowl got ‘accidentally’ melted. Sigh- that was the best bowl ever.",
      "created_utc": 1588818037.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fppvp45",
      "author": "dandelionbaaby",
      "body": "I'm the same way. When I.moved out of my parents I forgot my safe bowl and and actually going to find it and bring it to my place next time I visit.",
      "created_utc": 1588810069.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpq9hwy",
      "author": "Phantasmortuary",
      "body": "I use the same special mug and spoon for coffee. I actually collect mugs which no one else can use.\n\nLooking back, I've always had some food-rule or another.",
      "created_utc": 1588817908.0,
      "score": 1,
      "context": []
    }
  ]
}