{
  "id": "gjgbtu",
  "subreddit": "AnorexiaNervosa",
  "author": "jaimer23456789",
  "created_utc": 1589435295.0,
  "title": "I try so hard to get better but my ed wins",
  "selftext": "",
  "url": "https://i.redd.it/reudf0rn5oy41.jpg",
  "score": 215,
  "num_comments": 5,
  "comments": [
    {
      "id": "fql82t1",
      "author": "ofstoriesandsongs",
      "body": "I'm sorry. I get it. Lockdown and having too much time on my hands has been enticing me back into my old patterns. I'm weight restored and I was really putting in the work on my mental recovery too, and rationally, I *know* that I'm better and happier for it than when I was restricting... but now I have too much time to overthink my food and my weight and my relationship to both, and all I want is to restrict, restrict, restrict, just so I could feel like I'm control of *something*.",
      "created_utc": 1589449562.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fqlbrwu",
      "author": "I_own_18_penguins",
      "body": "It might feel impossible but you can get better. Whether better means recovered, approaching recovery, or learning to live with the ED, can can get there. You have the strength in you, even if it doesn't feel like it. You've made it this far, which is a tough one on its own, and you can undoubtedly make it further. Consider changes you might need to make, or priorities to reconsider, that could maximise your potential to achieve 'better'. If all else fails, listen to a beautiful song and try to feel peace in the moment. I wish you the best of luck.",
      "created_utc": 1589453234.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fqm9ap2",
      "author": "cosmic_frigg",
      "body": "Sometimes your ED may win but try to remember you are at war with yourself and sometimes that means to win the war you have to lose some of the battles. I lose sometimes too but that doesn’t mean my ED completely wins, just that one battle ya know. Keep your head up baby and keep on pushing forward. I believe in you. Sometimes you gotta hurt a little to know what it means to be strong.",
      "created_utc": 1589473672.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqn54dv",
      "author": "AcidBathPrincessR",
      "body": "As lockdown gets longer I’m binging more and more- my cravings are getting worse and losing weight is getting harder",
      "created_utc": 1589488832.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqpapt3",
      "author": "Cupcakeann",
      "body": "It’s ok to admit you need extra help against the devious ED. I strongly encourage talking to your doctor, a most eating disorders are linked anxiety issues. Anti anxiety medicine is what finally helped me win my battle with eating/myself. It’s not a magic pill but it just keeps your mind from wandering to dark corners and places of defeat",
      "created_utc": 1589540927.0,
      "score": 1,
      "context": []
    }
  ]
}