{
  "id": "gl3wyr",
  "subreddit": "AnorexiaNervosa",
  "author": "afuckingcabbage",
  "created_utc": 1589668792.0,
  "title": "My little sister has anorexia and my family won't stop calling her fat",
  "selftext": "I apologise if this is the wrong sub but I'm not sure where else I could ask for advice.\n\nShe barely eats anymore and tonight I cooked dinner and got her to sit down and eat with us. She even ate a couple of shrimp while talking to me in the kitchen. I felt so fucking happy that she was feeling good, and that she was eating.\n\nMy two brothers and my little sister went to eat in the living room while I stayed in the kitchen to set some food aside for my dad, my brother apperantly threatened one of our pups because \"she tried to take food from the cat\". This is bullshit, because that dog never does things like that and my little sister later confirmed what I thought. When my little sister angrily told him to stop talking to the dogs like that he snapped and told her to, \"Go back to pigging out\".\n\nI went to my siblings to see if this was a good meal, and if it's worth making again, to see my little sister not in there and her plate on the table, with some of the food flung off as if she threw it down and ran.\n\nI went to our room with her food to ask what happened and she told me. I tried to give her the plate but she refused and told me she didn't want to eat anymore. I said that I knew she didn't eat anything today, and that the meal wasn't super unhealthy. She still refused. I started to tear up and I told her how much I worry about her. I told her that if she just ate the food I would go outside and jump on the trampoline a little bit, knowing she loves it when I'm outside with her and that she wouldn't be able to burn off all the calories from 30 minutes of activity. \n\nShe took a bite of shrimp and angrily said she was fine. I don't know what to do. My dad wouldn't listen, because he doesn't care. I'm lost and I'm worried about how to help her myself. I can't lose her. She feels like my own kid, in a way. I love her with everything in my being and she's honestly the only reason I'm here.\n\nIf anyone has any advice that would be great.\n\nEDIT: Thank you all for the great advice. I've decided to make healthier meals so she won't feel as much guilt eating. I've started doing relaxed exercise with her, and I'm trying to help her lose weight in a healthy way while also trying to show her she doesn't have to stop eating entirely. Every single one of you are wonderful for taking the time to read this, and for taking the time to give me advice. My heart goes out to all of you.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/gl3wyr/my_little_sister_has_anorexia_and_my_family_wont/",
  "score": 172,
  "num_comments": 17,
  "comments": [
    {
      "id": "fqv4hvg",
      "author": "Margkam",
      "body": "My heart breaks reading this. I’m sorry you’re watching someone you love struggle and more than that I’m so saddened to hear of another young girl struggling. Honestly there’s not a ton that you can do as you’re not her parent other than continue to be there for her, listen to her when she feels comfortable and let her know you love her and are there for her. As for the family situation that kind of talk needs to stop. It sounds like it could be hard as it’s other children who are antagonizing her and they may not have the capacity to know the depth of pain they are causing. If there is some way to make it clear that’s really hurtful without outing her and potentially making her more of a target I would try it. \n\nIs there a parent aware of what’s going on? Does your sister realize the issue? Can the two of you eat meals together that are outside of time’s that she may be antagonized less?",
      "created_utc": 1589669702.0,
      "score": 48,
      "context": []
    },
    {
      "id": "fqv5epz",
      "author": "gardenfaiiri",
      "body": "I’m sorry that I can’t offer you any advice, apart from to ask if there is any way you think you would be able to seek some part of help for her that involved family therapy? \nBut other than that I want you to know that my heart goes out to the both of you, it’s quite frankly disgusting that the other members of the household treat your sister that way when she is clearly struggling with something that is not only awful to go through without the added toxicity of the family, but also potentially life threatening. You sound like a really lovely older sister, and I can see that all you want is the best of your sister. You could perhaps talk to your sister about everything going on, and offer her a safe space to talk through her issues. I don’t know how old she is but it could be a good idea if she was in a position to if you say down together and agreed on some meals you could make for her and yourself and sit and eat them together away from the rest of the family? \n\nSorry if none of those suggestions are any help, but honestly my heart does go out to you both, I would give both of you a massive hug if I could, stay strong. I wish you both all the best and I hope that one day soon your sister will be able to take the first steps on what will hopefully be a difficult, but rewarding recovery process. Not only for her, but also the rest of your family.",
      "created_utc": 1589670219.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fqvvgls",
      "author": "_riv-",
      "body": "I don't have advice that hasn't already been said, but my heart goes out to you.",
      "created_utc": 1589686097.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fqvx5nk",
      "author": "None",
      "body": "Wow, I’m not really sure what to say. When I was 13 my dad started calling me names and told me my “stomach was getting huge”. I developed a severe eating disorder that has almost killed me multiple times. The only suggestions I have is to keep being supportive and stick up for her. Maybe find out what foods she feels comfortable eating and try to keep those around, ask her if she wants a snack when the other family members aren’t eating. Early intervention is key to recovery. The longer you go without getting help the harder it gets. Unfortunately eating disorders are very powerful, you can’t make someone change. They have to want to.",
      "created_utc": 1589687217.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fqw3q4b",
      "author": "lemonssea",
      "body": "I kinda get where your sister is coming from. If I’m not wrong I’ll try to explain how your sister is feeling. It’s very easy to get triggered and lose your appetite. Having food on our mind all the time is exhausting and eating something can produce guilty feelings or so. Being called on like that openly in such a negative way must have been brutal for her. It’s like a reminder saying ‘see what happens when you eat’. She could have been feeling very negative about herself having those words repeating in her head over again. Just a suggestion but find out what her safe foods are and start there maybe. Safe foods are like good we feel okay to eat. Mostly it’s something healthy or so. Don’t try to force her to eat something she doesn’t want cause it may lead to her feeling more guilty. Start small and work your way from there to help her. Since the goal is to lose weight maybe you can help her understand and do it in a healthier way. I hope this helps!",
      "created_utc": 1589691986.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fqw45ru",
      "author": "mooneyes7",
      "body": "In private, with just you two, start building trust. And if you want to confront her about her diet I suggest you do it assertively. Say what you notice, and that you know she is harming her body and self(Mind) this way.",
      "created_utc": 1589692339.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fqw2c7o",
      "author": "None",
      "body": "I don't have any advice, but I'm sending love and best wishes!!! there's also r/EDAnonymous and r/antidiet that you might wanna crosspost to, they're similar subs",
      "created_utc": 1589690914.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fqvvex9",
      "author": "jmuszynski16",
      "body": "Hey, I was that little sister, and having someone like you in my life could have saved me. My own twin sister was definitely not a caring and compassionate as you are. Thank you so much.",
      "created_utc": 1589686067.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fqwfeqq",
      "author": "VoidMayonnaise",
      "body": "You're really precious, i can tell you care for her a lot. I think complimenting her would be a good way to up her confidence before it's too late. I developed an ED because my dad called me a seal, and commented things like \"why are you eating so much, your ass is already huge, look at you\"\nNow i can tell he's uncomfortable near me and my precious food scale, and he's guilty, so shame on himmmm.\nBtw, my little sister is in the same position as yours, but i think i might have influenced her too a bit with constant breakdowns about my weight. She went through the same \"gain lots of weight in a short time as a child\" thing. And our little brother loves to comment on our eating habits, and brings up triggering topics out of nowhere too. He also eats a lot and says stuff like \"yeah, i can eat a lot and not gain weight, not like you two\"\nSo i can completely understand your situation, and i hope that your bond with your sister stay strong, and you'll stay there for each other ❤️",
      "created_utc": 1589702473.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fr71x9a",
      "author": "None",
      "body": "As a girl who has verbally abusive parents, I can tell you that comments about my body from my parents while struggling with anorexia absolutely kills me. I wish I had a sibling like you, what you are doing for your sister is incredible and even though she might not show it all the time, having you as her support probably helps her a lot. A few months ago I went a week without eating anything, was a constantly passing out and felt horrible, and I decided to make food for myself which took a lot of courage. I ate one serving of spaghetti and I was so proud of myself that I went to get a second serving. My mom (doesn’t know about my ed) walked in the kitchen and started screaming at me for being such a glutton. Yeah, a glutton. Because I ate for the first time all week. It absolute broke me down when I was trying to recover and I’ve been struggling so much since. The rude comments never stop. One time I was putting beans in a bowl for part of my meal I was making and my mom screamed at me for being selfish and eating too much and she took my bowl (while I was eating) and she threw it in a big pan for the whole family. I only had a serving size and she still took it and added a bunch of crap to it so I just ended up skipping supper. I honestly don’t know how to even recover again. But you being there for your sister is the best thing you can do for her even if she’s having a hard time. I have no one to support me at home and it’s so hard.",
      "created_utc": 1589937878.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fr42j7f",
      "author": "LoliMadi",
      "body": "First i’m so sorry this is terrible I couldn’t imagine But i see you’ve already been told to make healthier meals and going outside with her more and stuff but if you’re close enough to age to become her legal guardian you can attempt to if you’re in a right place to and get her help",
      "created_utc": 1589873622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqv5glq",
      "author": "afuckingcabbage",
      "body": "Thank you for responding\n\nI tried to let my brother know what he was doing and he stormed out of the house. I don't think I can do much about the teasing. My only parent is my dad. I'll try to eat meals without my other siblings present.",
      "created_utc": 1589670250.0,
      "score": 22,
      "context": [
        {
          "id": "fqv4hvg",
          "author": "Margkam",
          "body": "My heart breaks reading this. I’m sorry you’re watching someone you love struggle and more than that I’m so saddened to hear of another young girl struggling. Honestly there’s not a ton that you can do as you’re not her parent other than continue to be there for her, listen to her when she feels comfortable and let her know you love her and are there for her. As for the family situation that kind of talk needs to stop. It sounds like it could be hard as it’s other children who are antagonizing her and they may not have the capacity to know the depth of pain they are causing. If there is some way to make it clear that’s really hurtful without outing her and potentially making her more of a target I would try it. \n\nIs there a parent aware of what’s going on? Does your sister realize the issue? Can the two of you eat meals together that are outside of time’s that she may be antagonized less?",
          "created_utc": 1589669702.0
        }
      ]
    },
    {
      "id": "fqvsyb7",
      "author": "afuckingcabbage",
      "body": "Sorry for the late response but these are good ideas. A lot of things have happened since I've posted this, and I've played outside with her for at least a couple of hours. I think I'll try to eat with her when my brother is home.",
      "created_utc": 1589684467.0,
      "score": 8,
      "context": [
        {
          "id": "fqv5epz",
          "author": "gardenfaiiri",
          "body": "I’m sorry that I can’t offer you any advice, apart from to ask if there is any way you think you would be able to seek some part of help for her that involved family therapy? \nBut other than that I want you to know that my heart goes out to the both of you, it’s quite frankly disgusting that the other members of the household treat your sister that way when she is clearly struggling with something that is not only awful to go through without the added toxicity of the family, but also potentially life threatening. You sound like a really lovely older sister, and I can see that all you want is the best of your sister. You could perhaps talk to your sister about everything going on, and offer her a safe space to talk through her issues. I don’t know how old she is but it could be a good idea if she was in a position to if you say down together and agreed on some meals you could make for her and yourself and sit and eat them together away from the rest of the family? \n\nSorry if none of those suggestions are any help, but honestly my heart does go out to you both, I would give both of you a massive hug if I could, stay strong. I wish you both all the best and I hope that one day soon your sister will be able to take the first steps on what will hopefully be a difficult, but rewarding recovery process. Not only for her, but also the rest of your family.",
          "created_utc": 1589670219.0
        }
      ]
    },
    {
      "id": "g8a2516",
      "author": "afuckingcabbage",
      "body": "Hey, ik it's been like 4 months but I just looked through the comments here, & I'm a bit worried about you. How are you doing now? Hopefully a little bit better than when you commented this. If you need to talk, I'll be here 💜",
      "created_utc": 1602297126.0,
      "score": 1,
      "context": [
        {
          "id": "fqvvex9",
          "author": "jmuszynski16",
          "body": "Hey, I was that little sister, and having someone like you in my life could have saved me. My own twin sister was definitely not a caring and compassionate as you are. Thank you so much.",
          "created_utc": 1589686067.0
        }
      ]
    },
    {
      "id": "fr7vekp",
      "author": "afuckingcabbage",
      "body": "I'm 15, and I'll be 16 in December. I've been thinking about finding a job and saving up enough money to move out the second I turn 18. I've thought about bringing her with me when I move out but my dad might actually kill me for it. Thanks for the advice 💜",
      "created_utc": 1589958559.0,
      "score": 1,
      "context": [
        {
          "id": "fr42j7f",
          "author": "LoliMadi",
          "body": "First i’m so sorry this is terrible I couldn’t imagine But i see you’ve already been told to make healthier meals and going outside with her more and stuff but if you’re close enough to age to become her legal guardian you can attempt to if you’re in a right place to and get her help",
          "created_utc": 1589873622.0
        }
      ]
    },
    {
      "id": "fqv5z4o",
      "author": "Margkam",
      "body": "I recognize it sounds like you’re in a really tough spot, walking a fine line between advocating for her and potentially breaching her trust and maybe making her feel more alone. I wonder if it’s a possibility to bring it up with your father. \n\nThank you for being a wonderful sibling. Having someone that loves you is an indispensable resource.",
      "created_utc": 1589670545.0,
      "score": 10,
      "context": [
        {
          "id": "fqv4hvg",
          "author": "Margkam",
          "body": "My heart breaks reading this. I’m sorry you’re watching someone you love struggle and more than that I’m so saddened to hear of another young girl struggling. Honestly there’s not a ton that you can do as you’re not her parent other than continue to be there for her, listen to her when she feels comfortable and let her know you love her and are there for her. As for the family situation that kind of talk needs to stop. It sounds like it could be hard as it’s other children who are antagonizing her and they may not have the capacity to know the depth of pain they are causing. If there is some way to make it clear that’s really hurtful without outing her and potentially making her more of a target I would try it. \n\nIs there a parent aware of what’s going on? Does your sister realize the issue? Can the two of you eat meals together that are outside of time’s that she may be antagonized less?",
          "created_utc": 1589669702.0
        },
        {
          "id": "fqv5glq",
          "author": "afuckingcabbage",
          "body": "Thank you for responding\n\nI tried to let my brother know what he was doing and he stormed out of the house. I don't think I can do much about the teasing. My only parent is my dad. I'll try to eat meals without my other siblings present.",
          "created_utc": 1589670250.0
        }
      ]
    },
    {
      "id": "fr8j59e",
      "author": "LoliMadi",
      "body": "if your dad does anything to harm her or you you can always report him ♡ ♡",
      "created_utc": 1589980037.0,
      "score": 2,
      "context": [
        {
          "id": "fr42j7f",
          "author": "LoliMadi",
          "body": "First i’m so sorry this is terrible I couldn’t imagine But i see you’ve already been told to make healthier meals and going outside with her more and stuff but if you’re close enough to age to become her legal guardian you can attempt to if you’re in a right place to and get her help",
          "created_utc": 1589873622.0
        },
        {
          "id": "fr7vekp",
          "author": "afuckingcabbage",
          "body": "I'm 15, and I'll be 16 in December. I've been thinking about finding a job and saving up enough money to move out the second I turn 18. I've thought about bringing her with me when I move out but my dad might actually kill me for it. Thanks for the advice 💜",
          "created_utc": 1589958559.0
        }
      ]
    }
  ]
}