{
  "id": "gpa4rr",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1590259227.0,
  "title": "Can’t tell if I’m fat or thin anymore",
  "selftext": "A part of me thinks I’m getting thinner like I want and a part of me doesn’t. I know I’ve lost weight but I don’t want to weigh myself because I feel like I’ll be upset no matter how much weight I’ve lost/haven’t lost. I just want to be “normal” again and lose weight the healthy way but I feel like I’ll never be able to get back to that mindset. I’m at a healthy weight right now but for some reason I can’t stop with all the negative self-talk and seeing myself as fat. \n\nThis is going to sound so bad, and it might possibly be triggering, so fair warning: \n\nI know I’m an attractive person. Not because that’s what I think, but because I see how others react to me. I get hit on a lot and will notice when others check me out in public. I’ve had many boyfriends and girlfriends (I’m bisexual) and I have a natural hourglass figure; small waist, big butt, big boobs. My current boyfriend worships me and always gives me compliments on my appearance (as well as other things) and that reassures me. I’m just so confused; If other people think I’m “hot” the way I am now, why do I only see myself as this fat and undesirable person?\n\nI just want to be at a lower weight, but a part of me feels like I’ll never be satisfied and I’ll always come up with a new “low” once I reach the old one, if that makes sense. \n\nI think one of the reasons I can’t stop starving myself is because I am absolutely terrified of gaining weight. A couple years ago I was at my highest, and most unhealthy, weight and I was able to lose it all and then some, and I’ve realized that my biggest fear is gaining it all back. The thought of getting bigger terrifies me and I’m not happy with how I look now so the only solution in my mind is to get smaller. \n\nIf you took the time to read this, and maybe you feel some of the same things I do, know that you’re not alone. Our situations we’re in truly suck and we don’t deserve it, but I’m hoping we will get through it together. :,)",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/gpa4rr/cant_tell_if_im_fat_or_thin_anymore/",
  "score": 125,
  "num_comments": 5,
  "comments": [
    {
      "id": "frkxpwu",
      "author": "wingednova",
      "body": "this is the same. i literally don’t understand which way to go. neither staying where i am nor losing more weight seems that rewarding anymore",
      "created_utc": 1590265504.0,
      "score": 17,
      "context": []
    },
    {
      "id": "frm93si",
      "author": "EmilyVS",
      "body": "I’m in the same boat. Body dysmorphic disorder is a hell of a drug. I swear, both my body and face change drastically every time I look in a mirror. Sometimes, if I sit in front of it long enough, it seems like my image is morphing before my eyes, like I’m on some sort of acid trip. I know that I am underweight, by every standard, but then WHY DO I ALSO LOOK MORBIDLY OBESE?!?",
      "created_utc": 1590294396.0,
      "score": 2,
      "context": []
    },
    {
      "id": "frmbxdb",
      "author": "headintheskye",
      "body": "i'm right with you. stay strong <3",
      "created_utc": 1590296522.0,
      "score": 2,
      "context": []
    },
    {
      "id": "frm2kq5",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1590289878.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frmceuw",
      "author": "Shadowed-Heart",
      "body": "rule 10",
      "created_utc": 1590296903.0,
      "score": 1,
      "context": [
        {
          "id": "frm2kq5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1590289878.0
        }
      ]
    }
  ]
}