{
  "id": "gt4gok",
  "subreddit": "AnorexiaNervosa",
  "author": "abisexualqueen",
  "created_utc": 1590797819.0,
  "title": "staying up to avoid meals",
  "selftext": "does anyone else do this? at this point I'm actually afraid to sleep early, in case I'm hungry in the morning and can't wait until lunch. part of me knows I would be fine, but I just can't bring myself to get up before 11.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/gt4gok/staying_up_to_avoid_meals/",
  "score": 146,
  "num_comments": 16,
  "comments": [
    {
      "id": "fs9au2w",
      "author": "iwannaberepulsive",
      "body": "im the same lately. been sleeping in until noon everyday",
      "created_utc": 1590798253.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fs9fibq",
      "author": "jbrittan",
      "body": "I purposely stay up really late so I don’t wake up until 1 or 2 then I won’t have my first meal until 5. Also even though I’m exhausted, I just have a hard time falling asleep when restricting.",
      "created_utc": 1590800995.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fs9es2r",
      "author": "DisorderlyHum",
      "body": "Yeah I sleep till just about noon at least every day. Getting up has been an issue for me for a long time, since way before the eating disorder, but it being the only way I can avoid breakfast doesn't help",
      "created_utc": 1590800563.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fs9lvmg",
      "author": "SweatshirtHoe",
      "body": "I do the same. I don't wake up until eleven, then I get coffee and come back to bed, and I usually don't eat until 2 or 3. Then I have a late dinner (7-9)",
      "created_utc": 1590804861.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fs9hhsn",
      "author": "lilimahaut",
      "body": "I can feel this too much. This is the only reason why my whole routine is like this",
      "created_utc": 1590802173.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fs9nas6",
      "author": "shakethedisease666",
      "body": "I was just about to post about the same thing!!!",
      "created_utc": 1590805744.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fs9nhgc",
      "author": "shakethedisease666",
      "body": "I sleep at 6am and wake up at 4 pm just so I can be up when nobody else is there to tempt me to eat with them when I’m awake and also to sleep when everyone else is snacking and eating. The only thing I get forced to eat is dinner at 6 pm so my mom at least doesn’t suspect I’m relapsing.",
      "created_utc": 1590805861.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fs9ythd",
      "author": "bunanbunv",
      "body": "This is me plus my sister does this unintentionally (she has her first meal at 3pm and then dinner) so I feel as if I can't be losing to her. My mum does workouts every night which is triggering. I can't help but to restrict like this, it's competitive :-(",
      "created_utc": 1590813311.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fsa0hdb",
      "author": "None",
      "body": "Honestly I do this accidentally because I have such bad insomnia that I can never actually sleep (or stay asleep for long if I manage to doze off). It’s like my body doesn’t want to let me stay asleep...so I’m so exhausted in the morning that even though I’m not actually asleep that most mornings I just lie in bad with my eyes closed until like 1 pm haha.\n\nBut also I do agree with what you’re saying. I feel super guilty if I eat anything before around 6 pm. I just have coffee/energy drinks usually. Eating always makes me *more* hungry so I try to put it off.",
      "created_utc": 1590814492.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fs9pbd1",
      "author": "MandaThePants",
      "body": "I get up with a 7 year old every morning at 6, it's hard by 2 I feel like falling through my bed, and then today he told me that I should probably gain just a little weight, it made me feel good, but when does it end",
      "created_utc": 1590807016.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsa0k3v",
      "author": "FlatDecision",
      "body": "I’m exactly the opposite. I go to sleep as early as possible and wake up as late as possible.",
      "created_utc": 1590814547.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsa16yt",
      "author": "pansexual-lampshade",
      "body": "i sleep at odd times so im always thrown off",
      "created_utc": 1590815011.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsadcyq",
      "author": "VoidMayonnaise",
      "body": "Sameee",
      "created_utc": 1590825167.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsalzjq",
      "author": "k__ie",
      "body": "Yess I do this when I’m fasting I make sure I go to bed at like 3 am so that I will sleep till 10 means less time having to think about not eating",
      "created_utc": 1590833706.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsfi1j5",
      "author": "RebeccaUsesReddit",
      "body": "I sleep a lot so I dont think about meals",
      "created_utc": 1590939607.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsp19wk",
      "author": "shakalakadee",
      "body": "I would purposefully take classes at 11 AM so I could sleep in and avoid breakfast while also coming back to my dorm (usually around 2:30 PM) so I could skip lunch with the excuse that I might as well wait until dinner to actually eat",
      "created_utc": 1591144365.0,
      "score": 1,
      "context": []
    }
  ]
}