{
  "id": "gv1igg",
  "subreddit": "AnorexiaNervosa",
  "author": "itsyaboi189",
  "created_utc": 1591076793.0,
  "title": "probs the most obvious and dumbest thing said on here but I just wanna say it to someone...",
  "selftext": "\nfuck i just wanna be skinny \n\n\n\n\nthat's all folks thanks for coming.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/gv1igg/probs_the_most_obvious_and_dumbest_thing_said_on/",
  "score": 119,
  "num_comments": 4,
  "comments": [
    {
      "id": "fsmda3e",
      "author": "the-no-no-word",
      "body": "That pretty much sums up everyone here",
      "created_utc": 1591092009.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fsmvwai",
      "author": "Seeyalatur",
      "body": "I gained a lot (my sister says it isn't a lot, but I think it is) of muscle weight after 2 months of IDGAF eating healthy but highly calorific food (PEANUT BUTTER) and working out with a martial arts instructor. I know it's stupid, since at least I can kind of defend myself should I ever need to, but I wish I never forced my mom to get me that instructor. I was so thin that I actually had a prominent thigh gap, but now my muscular and fat thighs touch and I just wish I were as thin as possible. My shoulders are kind of muscular too because I worked out like crazy and did the wrong kinds of exercise :< (I kind of have a toned body though)\n\n\\[fyi: I've been diagnosed with chronic depression, GAD, and ADHD, and I've never opened up to my therapist about my dieting days, but I really do think it's AN.\\]\n\n**it's been 3 years since I was thin AF, and yet I miss that body every day.**",
      "created_utc": 1591106184.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fsm35y6",
      "author": "johnporndonner",
      "body": "Smh tho",
      "created_utc": 1591082410.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsn8b40",
      "author": "blueberrybitshhh",
      "body": "I do like 5 Chloe ting excersizes a day and it helps so so so so much\nIve been slimming down and toning!",
      "created_utc": 1591112553.0,
      "score": 1,
      "context": []
    }
  ]
}