{
  "id": "h17p1u",
  "subreddit": "AnorexiaNervosa",
  "author": "ratslut420",
  "created_utc": 1591908508.0,
  "title": "if i get called “fatphobic” one more time",
  "selftext": "there is a person who i went to school with who, to put it bluntly, has become quite obese and constantly shares posts about fat acceptance and how you aren’t unhealthy if you’re fat, etc etc, fine. you do you, i’m not judging at all infact i literally wish i could be that accepting of myself but it was REALLY fucking with me constantly seeing how “toxic” skinny people are and how wanting to be skinny is “toxic” so i unfollowed her. \nshe somehow notices this... private messages me asking why and i said that her posts make me feel bad for wanting to lose weight, initially trying to avoid mentioning how it’s an eating disorder not just a diet, and she absolutely blasted me. she called me disgusting and fatphobic and literally tried to call me out on her story. she said that by trying to fit an “ideal” body type i’m trying to silence fat people, and trying to demonise fat body types. i finally snapped and said that i have an eating disorder, i know how toxic my eating disorder is, but it’s a disorder and im not doing it because i “hate fat people” and she just wouldn’t listen and basically insisted that trying to gain fat acceptance is harder than battling an eating disorder. i seriously,, sorry to say this,,, but can’t fucking deal with these “woke” bitches sometimes. fuck me. you can do whatever the fuck you want with your body, but calling me fatphobic for having an eating disorder is so fucked up. god",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/h17p1u/if_i_get_called_fatphobic_one_more_time/",
  "score": 652,
  "num_comments": 41,
  "comments": [
    {
      "id": "ftqw6tr",
      "author": "Bossishlike",
      "body": "you can unfollow ANYONE you want for ANY reason. She has no right to force you to see her content.",
      "created_utc": 1591915923.0,
      "score": 126,
      "context": []
    },
    {
      "id": "ftqtrn7",
      "author": "paperklipp",
      "body": "She sounds insanely stupid.",
      "created_utc": 1591914657.0,
      "score": 116,
      "context": []
    },
    {
      "id": "ftr5c7p",
      "author": "clamack",
      "body": "i feel like a lot of the HAES people disregard that the harmful image of the “perfect skinny body”, is harmful to EVERYONE, not just “fat” people. even if someone fits that unrealistic image, they still can face the emotional and health ramifications that come with an eating disorder. this unrealistic standard of a body is harmful, whether you fit in it or not, and demonizing those who do look that way isn’t actually helping anyone.",
      "created_utc": 1591921015.0,
      "score": 39,
      "context": []
    },
    {
      "id": "ftqlncr",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1591910740.0,
      "score": 51,
      "context": []
    },
    {
      "id": "ftqv2zv",
      "author": "maonue",
      "body": "> private messages me asking why and i said that her posts make me feel bad for wanting to lose weight, initially trying to avoid mentioning how it’s an eating disorder not just a diet, and she absolutely blasted me. she called me disgusting and fatphobic and literally tried to call me out on her story. she said that by trying to fit an “ideal” body type i’m trying to silence fat people, and trying to demonise fat body types. i finally snapped and said that i have an eating disorder, i know how toxic my eating disorder is, but it’s a disorder and im not doing it because i “hate fat people” and she just wouldn’t listen and basically insisted that trying to gain fat acceptance is harder than battling an eating disorder. i seriously,, sorry to say this,,, but can’t fucking deal with these “woke” bitches sometimes.\n\nHoly shit that's so out of line on her part. I'm sorry you had to deal with that.\n\nThat's absolutely insane that she tried to make her problems into something bigger than ANOREXIA NERVOSA. Like, I get that this is underestimated but what a blatant and rude thing to say. \n\nIt's frankly outrageous that ANYONE can envy anorexia, but she really takes the cake.",
      "created_utc": 1591915343.0,
      "score": 35,
      "context": []
    },
    {
      "id": "ftrprk7",
      "author": "DanciaKS",
      "body": "People are so fucked. I’m sorry you’re going through this. I’m lucky my friends are accepting now but I’ve had a “fat girl” tell me how as a fat girl she automatically hates skinny girls. Like how is that okay? You hate me because I’m skinny? I could have cancer for all they know.",
      "created_utc": 1591933507.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ftrayt5",
      "author": "uglee_girl",
      "body": "Fatphobia is a cultural mindset that needs to be challenged...eating disorders are a MENTAL ILLNESS. While you can say that EDs can be a result of engrained fatphobia, you cannot say those who suffer with EDs are fatphobic by default. I feel like most people know this. She probably just made herself look like a bitch for attacking someone with a mental illness.",
      "created_utc": 1591924330.0,
      "score": 29,
      "context": []
    },
    {
      "id": "fukuib9",
      "author": "Zombeedee",
      "body": "Even if you didn't have an eating disorder, the choices you make for your body and the choices she makes for her body are completely separate things. You don't have to justify your views to her and you certainly don't have to discuss your eating disorder as your reasoning either. It's none of her business why you disagree, you're entitled to do so. Why is she so insecure that she needs total and unabashed support from everyone? If she is so strong in her convictions then one person not agreeing shouldn't rustle her jimmies so much.\n\n You are allowed to disagree with her views without it being an attack on her views. Why are is she allowed to make choices for her body but you're not allowed for yours? This is where the line between fat acceptance and skinny hate lies. It's not ok. You don't get to tear down one body type or lifestyle choice just to uphold another. \n\nAlso post script; the fact that she immediately noticed you unfollowing/unsubbing tells me that she's keeping a close eye on you and was waiting for a chance to go off.",
      "created_utc": 1591950183.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ftrpxsp",
      "author": "fuckedupceiling",
      "body": "You know, chances are she's extremely self conscious and is desperately trying to surround herself with people that say she's perfect so she doesn't have to face her disordered eating or whatever is making her put on weight. If it had happened to me, I would've kicked her sorry ass hahaha",
      "created_utc": 1591933622.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ftqpbgm",
      "author": "sorkhoktani",
      "body": "This is terrible. She doesn’t realize it, but she’s ill, mentally and physically (I know they’re really the same thing, but you know what I mean). She’s in denial that she’s ill, yet harasses and punishes others for being ill. She’s basically screeching at everyone else that they’re ableist, while she’s the one who’s actually being ableist.\n\nUgh. Yeet that bitch into the sun.",
      "created_utc": 1591912439.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ful3knd",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1591959226.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fv8rih3",
      "author": "None",
      "body": "That doesn't make you fatphobic... Honestly I don't think being fat is a good thing... Being a little chubby isn't bad but being obese is bad. I think fat acceptance is toxic, extremely toxic. There is a BBC documentary about fat during an autopsy and it's bad. Everything is affected by the fat. It's probably what led to me developing my eating disorder. Don't worry about her she has toxic self acceptance. Just keep bettering yourself.",
      "created_utc": 1592495782.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ful1mqx",
      "author": "MilaKsenia",
      "body": "That chick sounds legitimately insane. What an asshole",
      "created_utc": 1591957391.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fulys7g",
      "author": "WideAtmosphere",
      "body": "Fat Acceptance is a death cult. If you don't fall in line with their eat-yourself-to-death ideology, you are a threat that must be neutralized. She doesn't 'love' or 'accept' her fat body, or she wouldn't mention it at all. She'd just live her life. Her hateful behavior tells you straight up she's unhappy with her fat body. She hates it just as much as we hate our imperfections. Trust.  \nHer behavior is unacceptable and hateful, and she should be ashamed of herself. Acceptance isn't hateful.",
      "created_utc": 1591977723.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fuld23w",
      "author": "bpdix",
      "body": "ill say im fatphobic and idc, its the ed but if people are not just slightly overweight/fat but are immensely obese they have no self control and cant take care of themselves",
      "created_utc": 1591966688.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ftr0abi",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1591918165.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fwzvo4d",
      "author": "None",
      "body": "I feel you! I tried to open up to a past therapist about my eating disorder. He accused me of being fat phobic. That made me close up about my struggles and feel guilty for having a disorder. I am literally afraid of the fat on my body. I don’t hate fat people though, just myself at times. I don’t project my unhealthy, unrealistic body standard onto others. Of course having weight focused media can be bad for someone with an eating disorder and that should be understandable. I’m sorry you went through that 💙",
      "created_utc": 1593955730.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ful6ytc",
      "author": "None",
      "body": "this is gonna get downvoted to hell but anyone with anorexia is inherently fatphobic. this is coming from a woman who has been both underweight and overweight. please unlearn this behaviour",
      "created_utc": 1591962197.0,
      "score": -4,
      "context": []
    },
    {
      "id": "ftqyp8i",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1591917286.0,
      "score": -18,
      "context": []
    },
    {
      "id": "jh9ta9a",
      "author": "HornyComment",
      "body": "Wait, you called your eating disorder toxic? What the hell is this supposed to even mean? Anyway, your friend is obviously a complete moron.",
      "created_utc": 1682173212.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftqu4xo",
      "author": "ratslut420",
      "body": "she has surrounded herself w people w similar views and has turned into someone absolutely stuck in her way. it’s so strange to see having known her in school - really offended how she treated me tbh lol",
      "created_utc": 1591914849.0,
      "score": 56,
      "context": [
        {
          "id": "ftqtrn7",
          "author": "paperklipp",
          "body": "She sounds insanely stupid.",
          "created_utc": 1591914657.0
        }
      ]
    },
    {
      "id": "ftrbmzc",
      "author": "ratslut420",
      "body": "absolutely! i have never once shamed her for her body weight nor even really thought twice about it, it was literally just her constant body shaming of typically skinny ppl i couldn’t handle. tried explaining to her that i wish i could have a healthy body image but my ed literally doesn’t allow that and she basically said that i’m just being consumed by societal standards, like bruh it’s more than that it’s a mental illness",
      "created_utc": 1591924734.0,
      "score": 16,
      "context": [
        {
          "id": "ftr5c7p",
          "author": "clamack",
          "body": "i feel like a lot of the HAES people disregard that the harmful image of the “perfect skinny body”, is harmful to EVERYONE, not just “fat” people. even if someone fits that unrealistic image, they still can face the emotional and health ramifications that come with an eating disorder. this unrealistic standard of a body is harmful, whether you fit in it or not, and demonizing those who do look that way isn’t actually helping anyone.",
          "created_utc": 1591921015.0
        }
      ]
    },
    {
      "id": "ftqpnt4",
      "author": "sorkhoktani",
      "body": "It was tried in the late 90s-early 00s, and nearly every web-hosting service that was big then banned it. Pro-anorexia sites were a big thing for a minute, and then scattered like cockroaches under a rock had the censors come down. You had to buy your own domain after that, and that was a lot more expensive than it is now. It was reported about in the news frequently and portrayed as sick, dangerous, and horrible for young girls in particular.",
      "created_utc": 1591912605.0,
      "score": 23,
      "context": [
        {
          "id": "ftqlncr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1591910740.0
        }
      ]
    },
    {
      "id": "ftrr31v",
      "author": "Shadowed-Heart",
      "body": "rule 10",
      "created_utc": 1591934388.0,
      "score": 1,
      "context": [
        {
          "id": "ftqlncr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1591910740.0
        }
      ]
    },
    {
      "id": "ftqvrda",
      "author": "ratslut420",
      "body": "yeah i was in shock, it was literally that behaviour that made me unfollow her. she used to be a friend, but her constant shaming of anyone who isn’t obese or proud of being obese was literally disrupting my day to the point where i had to unfollow. i just can’t believe i finally caved in and said that i have an eating disorder, and i literally said i’d do anything to have a normal perception of my body but she still said tht i’m letting the media and the idealised female body type dictate my life and that when you conform to societal beauty standards you’re shaming people who are overweight. i was just,, in shock. i know she’s probably just uneducated but it doesn’t take a genius to know that anorexia is a mental illness and i wouldn’t be doing this for fun.. really fucked my day up tbh lol",
      "created_utc": 1591915696.0,
      "score": 11,
      "context": [
        {
          "id": "ftqv2zv",
          "author": "maonue",
          "body": "> private messages me asking why and i said that her posts make me feel bad for wanting to lose weight, initially trying to avoid mentioning how it’s an eating disorder not just a diet, and she absolutely blasted me. she called me disgusting and fatphobic and literally tried to call me out on her story. she said that by trying to fit an “ideal” body type i’m trying to silence fat people, and trying to demonise fat body types. i finally snapped and said that i have an eating disorder, i know how toxic my eating disorder is, but it’s a disorder and im not doing it because i “hate fat people” and she just wouldn’t listen and basically insisted that trying to gain fat acceptance is harder than battling an eating disorder. i seriously,, sorry to say this,,, but can’t fucking deal with these “woke” bitches sometimes.\n\nHoly shit that's so out of line on her part. I'm sorry you had to deal with that.\n\nThat's absolutely insane that she tried to make her problems into something bigger than ANOREXIA NERVOSA. Like, I get that this is underestimated but what a blatant and rude thing to say. \n\nIt's frankly outrageous that ANYONE can envy anorexia, but she really takes the cake.",
          "created_utc": 1591915343.0
        }
      ]
    },
    {
      "id": "fuv9lpw",
      "author": "didimakeanalt",
      "body": "It's like saying a kid is homophobic for wishing he was straight... It's not his fault, it's the fault of society saying that straight is great and gay is nay. I'm not fat phobic, I was bullied by my parents into being their perfect little baby boy who's athletic and perfect and I caved at some point.",
      "created_utc": 1592193424.0,
      "score": 12,
      "context": [
        {
          "id": "ftrayt5",
          "author": "uglee_girl",
          "body": "Fatphobia is a cultural mindset that needs to be challenged...eating disorders are a MENTAL ILLNESS. While you can say that EDs can be a result of engrained fatphobia, you cannot say those who suffer with EDs are fatphobic by default. I feel like most people know this. She probably just made herself look like a bitch for attacking someone with a mental illness.",
          "created_utc": 1591924330.0
        }
      ]
    },
    {
      "id": "ftqvc1a",
      "author": "maonue",
      "body": "> She doesn’t realize it, but she’s ill, mentally and physically (I know they’re really the same thing, but you know what I mean). She’s in denial that she’s ill, yet harasses and punishes others for being ill.\n\nEh, I don't think it excuses what she did by a long shot. I think her behavior mostly has to do with her being an asshole.",
      "created_utc": 1591915471.0,
      "score": 13,
      "context": [
        {
          "id": "ftqpbgm",
          "author": "sorkhoktani",
          "body": "This is terrible. She doesn’t realize it, but she’s ill, mentally and physically (I know they’re really the same thing, but you know what I mean). She’s in denial that she’s ill, yet harasses and punishes others for being ill. She’s basically screeching at everyone else that they’re ableist, while she’s the one who’s actually being ableist.\n\nUgh. Yeet that bitch into the sun.",
          "created_utc": 1591912439.0
        }
      ]
    },
    {
      "id": "ftqu1hb",
      "author": "ratslut420",
      "body": "this huge sudden culture of fat acceptance and preaching that you can live a healthy lifestyle whilst obese is so concerning. like, being so in denial about the blatant health complications that come alongside obesity? i don’t really understand it, and if you oppose it you’re “cancelled” or you’re body shaming.. like ahhhhh she’s literally body shaming me by calling skinny ppl disgusting i didn’t say shit about her weight",
      "created_utc": 1591914798.0,
      "score": 21,
      "context": [
        {
          "id": "ftqpbgm",
          "author": "sorkhoktani",
          "body": "This is terrible. She doesn’t realize it, but she’s ill, mentally and physically (I know they’re really the same thing, but you know what I mean). She’s in denial that she’s ill, yet harasses and punishes others for being ill. She’s basically screeching at everyone else that they’re ableist, while she’s the one who’s actually being ableist.\n\nUgh. Yeet that bitch into the sun.",
          "created_utc": 1591912439.0
        }
      ]
    },
    {
      "id": "fulfopk",
      "author": "ratslut420",
      "body": "yes exactly! i know that of course you can technically be “overweight” and still perfectly healthy but she is not healthy, and she is promoting an unhealthy lifestyle whilst also bashing people who don’t follow it. ofc i know EDs are unhealthy but it’s so counterproductive to bash people who know their habits are unhealthy and make them feel more shame for it. i’m doing okay now lmaoo was just shocked at how bitchy she was to me hahah",
      "created_utc": 1591968367.0,
      "score": 4,
      "context": [
        {
          "id": "ful3knd",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1591959226.0
        }
      ]
    },
    {
      "id": "fupa2dq",
      "author": "None",
      "body": "Spoiler alert but none of us have control over this thing, even the people who are at a healthy weight. We’re all in the same sinking boat. So, no, it’s not just the ED. Have some compassion.",
      "created_utc": 1592055927.0,
      "score": 3,
      "context": [
        {
          "id": "fuld23w",
          "author": "bpdix",
          "body": "ill say im fatphobic and idc, its the ed but if people are not just slightly overweight/fat but are immensely obese they have no self control and cant take care of themselves",
          "created_utc": 1591966688.0
        }
      ]
    },
    {
      "id": "ftr35ow",
      "author": "ratslut420",
      "body": "just venting",
      "created_utc": 1591919771.0,
      "score": 6,
      "context": [
        {
          "id": "ftr0abi",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1591918165.0
        }
      ]
    },
    {
      "id": "ful7bbx",
      "author": "ratslut420",
      "body": "i do understand where thats coming from, but for me to be accused of hating fat people because i unfollowed someone to protect my feelings is ridiculous. obviously it IS rooted in the societal disapproval of fat body images but for her to constantly shame skinny people, who could just as well be suffering at the hands of the same idealised body image? i don’t really understand how that is justified.\ni don’t hate fat people, i don’t try to silence fat people or make people feel ashamed for being overweight, i would do anything to not freak out when i gain weight - in my opinion there is a complete difference between a mental illness that affects you and your body image vs being “fatphobic” towards people",
      "created_utc": 1591962480.0,
      "score": 7,
      "context": [
        {
          "id": "ful6ytc",
          "author": "None",
          "body": "this is gonna get downvoted to hell but anyone with anorexia is inherently fatphobic. this is coming from a woman who has been both underweight and overweight. please unlearn this behaviour",
          "created_utc": 1591962197.0
        }
      ]
    },
    {
      "id": "fum1tzp",
      "author": "Zombeedee",
      "body": "\nThere are multiple causes for anorexia. And it manifests itself in many ways. Not everyone with AN inherently does it to lose weight or be thin. For many, the pathology is control or self harm, for some it's an abuse response, and there are many more triggers. So suggesting ALL of the millions of anorexics across the planet are fatphobic is shortsighted.",
      "created_utc": 1591979143.0,
      "score": 4,
      "context": [
        {
          "id": "ful6ytc",
          "author": "None",
          "body": "this is gonna get downvoted to hell but anyone with anorexia is inherently fatphobic. this is coming from a woman who has been both underweight and overweight. please unlearn this behaviour",
          "created_utc": 1591962197.0
        }
      ]
    },
    {
      "id": "ftqz9ok",
      "author": "ratslut420",
      "body": "sorry what lol \nmy negative body perception is directed at myself and only me. i dont care if someone is overweight, but to deny being obese doesn’t come with health complications isn’t being fatphobic?",
      "created_utc": 1591917599.0,
      "score": 9,
      "context": [
        {
          "id": "ftqyp8i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1591917286.0
        }
      ]
    },
    {
      "id": "ftqueao",
      "author": "paperklipp",
      "body": "The way she spoke to you was abhorrent. Her dismissal of your very real and very difficult struggle in order to centre herself as some sort of perpetual victim was pathetic. Try not to carry what she said or how she made you feel with you - she is the fool in this situation.",
      "created_utc": 1591914983.0,
      "score": 28,
      "context": [
        {
          "id": "ftqtrn7",
          "author": "paperklipp",
          "body": "She sounds insanely stupid.",
          "created_utc": 1591914657.0
        },
        {
          "id": "ftqu4xo",
          "author": "ratslut420",
          "body": "she has surrounded herself w people w similar views and has turned into someone absolutely stuck in her way. it’s so strange to see having known her in school - really offended how she treated me tbh lol",
          "created_utc": 1591914849.0
        }
      ]
    },
    {
      "id": "ftr31sl",
      "author": "RexieSquad",
      "body": "They are delusional, run away from ppl like that.",
      "created_utc": 1591919710.0,
      "score": 12,
      "context": [
        {
          "id": "ftqtrn7",
          "author": "paperklipp",
          "body": "She sounds insanely stupid.",
          "created_utc": 1591914657.0
        },
        {
          "id": "ftqu4xo",
          "author": "ratslut420",
          "body": "she has surrounded herself w people w similar views and has turned into someone absolutely stuck in her way. it’s so strange to see having known her in school - really offended how she treated me tbh lol",
          "created_utc": 1591914849.0
        }
      ]
    },
    {
      "id": "ftqpxek",
      "author": "None",
      "body": "Yeah I remember that stuff. But they weren't telling everyone it was \"healthy\", is all I'm saying",
      "created_utc": 1591912736.0,
      "score": 16,
      "context": [
        {
          "id": "ftqlncr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1591910740.0
        },
        {
          "id": "ftqpnt4",
          "author": "sorkhoktani",
          "body": "It was tried in the late 90s-early 00s, and nearly every web-hosting service that was big then banned it. Pro-anorexia sites were a big thing for a minute, and then scattered like cockroaches under a rock had the censors come down. You had to buy your own domain after that, and that was a lot more expensive than it is now. It was reported about in the news frequently and portrayed as sick, dangerous, and horrible for young girls in particular.",
          "created_utc": 1591912605.0
        }
      ]
    },
    {
      "id": "ftrkbwl",
      "author": "toritxtornado",
      "body": "proana sites still exist all over the internet. the difference is they’re underground and not trying to make it a “movement”. it’s a bunch of anorexics that know they’re sick and need a safe space.",
      "created_utc": 1591930019.0,
      "score": 8,
      "context": [
        {
          "id": "ftqlncr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1591910740.0
        },
        {
          "id": "ftqpnt4",
          "author": "sorkhoktani",
          "body": "It was tried in the late 90s-early 00s, and nearly every web-hosting service that was big then banned it. Pro-anorexia sites were a big thing for a minute, and then scattered like cockroaches under a rock had the censors come down. You had to buy your own domain after that, and that was a lot more expensive than it is now. It was reported about in the news frequently and portrayed as sick, dangerous, and horrible for young girls in particular.",
          "created_utc": 1591912605.0
        }
      ]
    },
    {
      "id": "ftqx4ml",
      "author": "maonue",
      "body": "That's awful :(\n\n>  i know she’s probably just uneducated but it doesn’t take a genius to know that anorexia is a mental illness \n\nehh I mean people do misunderstand anorexia, but that sounds frankly worse than what most people think. And I mean, at the least, her not being receptive to you explaining is really not appropriate.",
      "created_utc": 1591916419.0,
      "score": 6,
      "context": [
        {
          "id": "ftqv2zv",
          "author": "maonue",
          "body": "> private messages me asking why and i said that her posts make me feel bad for wanting to lose weight, initially trying to avoid mentioning how it’s an eating disorder not just a diet, and she absolutely blasted me. she called me disgusting and fatphobic and literally tried to call me out on her story. she said that by trying to fit an “ideal” body type i’m trying to silence fat people, and trying to demonise fat body types. i finally snapped and said that i have an eating disorder, i know how toxic my eating disorder is, but it’s a disorder and im not doing it because i “hate fat people” and she just wouldn’t listen and basically insisted that trying to gain fat acceptance is harder than battling an eating disorder. i seriously,, sorry to say this,,, but can’t fucking deal with these “woke” bitches sometimes.\n\nHoly shit that's so out of line on her part. I'm sorry you had to deal with that.\n\nThat's absolutely insane that she tried to make her problems into something bigger than ANOREXIA NERVOSA. Like, I get that this is underestimated but what a blatant and rude thing to say. \n\nIt's frankly outrageous that ANYONE can envy anorexia, but she really takes the cake.",
          "created_utc": 1591915343.0
        },
        {
          "id": "ftqvrda",
          "author": "ratslut420",
          "body": "yeah i was in shock, it was literally that behaviour that made me unfollow her. she used to be a friend, but her constant shaming of anyone who isn’t obese or proud of being obese was literally disrupting my day to the point where i had to unfollow. i just can’t believe i finally caved in and said that i have an eating disorder, and i literally said i’d do anything to have a normal perception of my body but she still said tht i’m letting the media and the idealised female body type dictate my life and that when you conform to societal beauty standards you’re shaming people who are overweight. i was just,, in shock. i know she’s probably just uneducated but it doesn’t take a genius to know that anorexia is a mental illness and i wouldn’t be doing this for fun.. really fucked my day up tbh lol",
          "created_utc": 1591915696.0
        }
      ]
    },
    {
      "id": "ftr8two",
      "author": "sorkhoktani",
      "body": "I didn’t say, nor did I intend to convey, that it excused anything. I’m saying that it makes her a hypocrite, even if she doesn’t realize it.",
      "created_utc": 1591923051.0,
      "score": 2,
      "context": [
        {
          "id": "ftqpbgm",
          "author": "sorkhoktani",
          "body": "This is terrible. She doesn’t realize it, but she’s ill, mentally and physically (I know they’re really the same thing, but you know what I mean). She’s in denial that she’s ill, yet harasses and punishes others for being ill. She’s basically screeching at everyone else that they’re ableist, while she’s the one who’s actually being ableist.\n\nUgh. Yeet that bitch into the sun.",
          "created_utc": 1591912439.0
        },
        {
          "id": "ftqvc1a",
          "author": "maonue",
          "body": "> She doesn’t realize it, but she’s ill, mentally and physically (I know they’re really the same thing, but you know what I mean). She’s in denial that she’s ill, yet harasses and punishes others for being ill.\n\nEh, I don't think it excuses what she did by a long shot. I think her behavior mostly has to do with her being an asshole.",
          "created_utc": 1591915471.0
        }
      ]
    },
    {
      "id": "fuv9r9f",
      "author": "didimakeanalt",
      "body": "I get some of it, a lot is probably trying to prevent eating disorders, and being overweight is okay, but there are problems with being extremely overweight.",
      "created_utc": 1592193533.0,
      "score": 1,
      "context": [
        {
          "id": "ftqpbgm",
          "author": "sorkhoktani",
          "body": "This is terrible. She doesn’t realize it, but she’s ill, mentally and physically (I know they’re really the same thing, but you know what I mean). She’s in denial that she’s ill, yet harasses and punishes others for being ill. She’s basically screeching at everyone else that they’re ableist, while she’s the one who’s actually being ableist.\n\nUgh. Yeet that bitch into the sun.",
          "created_utc": 1591912439.0
        },
        {
          "id": "ftqu1hb",
          "author": "ratslut420",
          "body": "this huge sudden culture of fat acceptance and preaching that you can live a healthy lifestyle whilst obese is so concerning. like, being so in denial about the blatant health complications that come alongside obesity? i don’t really understand it, and if you oppose it you’re “cancelled” or you’re body shaming.. like ahhhhh she’s literally body shaming me by calling skinny ppl disgusting i didn’t say shit about her weight",
          "created_utc": 1591914798.0
        }
      ]
    },
    {
      "id": "fupbcb7",
      "author": "bpdix",
      "body": "yeah but i think there’s a difference between binge eating/disordered eating and repeatedly making unhealthy choices",
      "created_utc": 1592056792.0,
      "score": 2,
      "context": [
        {
          "id": "fuld23w",
          "author": "bpdix",
          "body": "ill say im fatphobic and idc, its the ed but if people are not just slightly overweight/fat but are immensely obese they have no self control and cant take care of themselves",
          "created_utc": 1591966688.0
        },
        {
          "id": "fupa2dq",
          "author": "None",
          "body": "Spoiler alert but none of us have control over this thing, even the people who are at a healthy weight. We’re all in the same sinking boat. So, no, it’s not just the ED. Have some compassion.",
          "created_utc": 1592055927.0
        }
      ]
    },
    {
      "id": "ftr1lvs",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1591918901.0,
      "score": -8,
      "context": [
        {
          "id": "ftqyp8i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1591917286.0
        },
        {
          "id": "ftqz9ok",
          "author": "ratslut420",
          "body": "sorry what lol \nmy negative body perception is directed at myself and only me. i dont care if someone is overweight, but to deny being obese doesn’t come with health complications isn’t being fatphobic?",
          "created_utc": 1591917599.0
        }
      ]
    },
    {
      "id": "fupc1co",
      "author": "None",
      "body": "We are all repeatedly making unhealthy choices.",
      "created_utc": 1592057259.0,
      "score": 2,
      "context": [
        {
          "id": "fuld23w",
          "author": "bpdix",
          "body": "ill say im fatphobic and idc, its the ed but if people are not just slightly overweight/fat but are immensely obese they have no self control and cant take care of themselves",
          "created_utc": 1591966688.0
        },
        {
          "id": "fupa2dq",
          "author": "None",
          "body": "Spoiler alert but none of us have control over this thing, even the people who are at a healthy weight. We’re all in the same sinking boat. So, no, it’s not just the ED. Have some compassion.",
          "created_utc": 1592055927.0
        },
        {
          "id": "fupbcb7",
          "author": "bpdix",
          "body": "yeah but i think there’s a difference between binge eating/disordered eating and repeatedly making unhealthy choices",
          "created_utc": 1592056792.0
        }
      ]
    },
    {
      "id": "ftr1p99",
      "author": "ratslut420",
      "body": "and i never denied that? but to deny any possibility of health complications and to body shame skinny people? where’s the logic?",
      "created_utc": 1591918952.0,
      "score": 4,
      "context": [
        {
          "id": "ftqyp8i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1591917286.0
        },
        {
          "id": "ftqz9ok",
          "author": "ratslut420",
          "body": "sorry what lol \nmy negative body perception is directed at myself and only me. i dont care if someone is overweight, but to deny being obese doesn’t come with health complications isn’t being fatphobic?",
          "created_utc": 1591917599.0
        },
        {
          "id": "ftr1lvs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1591918901.0
        }
      ]
    }
  ]
}