{
  "id": "h8ip3d",
  "subreddit": "AnorexiaNervosa",
  "author": "NickUnencumbered",
  "created_utc": 1592091873.0,
  "title": "how i almost killed my girlfriend: a confession",
  "selftext": "on our first official date we ordered breakfast burritos and ate them in bed, gleefully enjoying a meal together and not caring in the slightest about the cal content. that's how it was at first, happy together sharing plates and finding fun new restaurants...all the while i was severely underweight and struggling, completely entrenched in the eating disorder I've had for nearly a decade. she used to have bulimia nervosa, had it for most of middle and high school, but after becoming homeless around 11th grade she felt too guilty to carry on with her behaviors and had been in recovery for a couple years. \n\nin the years following her ED she gained some weight, a bit above what was healthy but no more than 5 or so pounds, normal for a teenager with a fluctuating metabolism. she noticed how quickly i lost weight though, how quickly anorexia nervosa can take the life from someone but take the fat from them too, she would support me and i'd talk to her about it but i never wanted to trigger her past disordered behaviors so i was always careful. after some months being together we'd go to a restaurant and share a coke 0 rather than a plate for two, or spend days together not eating at all. \n\nslowly she started wasting away, becoming completely and utterly consumed with anorexia and restricting/p\\*rging. she'd mimic my weight loss behaviors because she knew they worked, i watched her fade away from me just like my friends watched me fade from them. it was the most horrible thing in the world. most horrible thing I've ever witnessed, especially considering i have something called hyper-responsibility OCD, which makes me utterly obsessed with not hurting others or causing them to hurt themselves--to the point where my fear of causing harm consumes me. months went by and her chest and heart hurt constantly, her drug abuse became severe, she fell out of her healthy weight range, and would spend all day either sleeping or on the phone with me crying and begging to die to rid herself of the fat under her skin. the things she said about her body send shivers down my spine, all things i say about myself but hearing my girl recite back to me the horrible things i think about myself was unbearable.\n\ni went in-patient for re-feeding and weight restoration but she just kept getting worse, every day she was with me she got worse. and worse. and worse. every day i feared she wouldn't wake up, i felt like a monster for not only triggering her ED but unknowingly supplying her with numerous maladaptive \"tips and tricks\" so to speak. she broke up with me eventually and immediately started getting better, now she's happy with someone else and at a healthy weight. I'm so happy she's alive and okay, if she hadn't left me I'm sure she would have died and i would have felt like i killed her. \n\nif this was an isolated incident i might have been able to brush it off (not minimize my impact of course, rather not blaming myself so much) but it wasn't. it happened again with a friend on mine in university, when she saw how fast i lost weight she started eating when i ate (which was rarely) and eventually developed anorexia nervosa, also landing her in an in-patient facility (she is also now in recovery luckily). the damaged I've caused to the people i love is evil and irreparable, and it's hard to not blame my character as opposed to my disorder. it weighs so heavily on me that i try and isolate myself, try and save others from the fate of disordered eating. I've done so successfully for about a year, and as far as im aware this has prevented me from hurting anyone else like this. but now the circumstances have changed and more ED vulnerable people have been introduced into my life. my fear and obsession eats me alive but there is nothing i can do, im well into recovery now (as of today im 5 months sober from p\\*rging!!) but i still have many disordered behaviors. EDs have taken so much from me, even if i beat anorexia it feels like it will still kill me nonetheless because of how much i hurt others with my behavior, its made me hate myself more than anything. \n\nfuck anorexia. fuck disordered eating. fuck them for killing me because even if i recover completely, the damage I've caused because of said disorder has destroyed me. its left me dead with shame, grief, sorrow, anxiety, and fear.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/h8ip3d/how_i_almost_killed_my_girlfriend_a_confession/",
  "score": 132,
  "num_comments": 5,
  "comments": [
    {
      "id": "furkorw",
      "author": "avant_emm",
      "body": "I know you blame yourself, and in a way I understand that yes, you (unintentionally) showed her some of those behaviours. If it makes you feel any better though: my best friend developed anorexia and recovered (as much as she could anyways) and she is now thin and gorgeous. I've always thought she was beautiful regardless of her weight, but seeing her 'success' is what triggered me to fall into restrictive behaviours. But the thing is, I don't blame her at all. I love her with all of my heart, and I could never blame her struggle. She's not responsible for the way that I control my life.\n\nAnyways, I hope that helps to bring you some piece of mind. You deserve to have friendships, but maybe it would be wise to set boundaries on what you feel comfortable talking about in terms of your ED.",
      "created_utc": 1592103745.0,
      "score": 23,
      "context": []
    },
    {
      "id": "furqvdu",
      "author": "outtie-5000",
      "body": "When you heard your ex say she wanted to die and saw her ED consume her, you were able to see more clearly in her the intrinsic violence an ED inflicts. I know it’s incredibly difficult to forgive yourself when you feel like you played some part in their harm; you’re the only person responsible for every decision you make, and you feel like those decisions lead to their harm. But you don’t have the responsibility to make other people’s decisions or hide yourself away to spare other people. Your more “advanced” knowledge of your ED does not give you greater responsibility over a person who wants to seek out more information. Life has no shortage of triggers for an ED; of course I don’t know the situation personally, but you probably weren’t the only people in their lives at the time. It’s unfair to anyone else who may have played a part in the relapse, and to yourself, to take all the blame.\nThese were both very unfortunate circumstances, but now you have the wisdom and experience to see when a friend is struggling and needs intervention. That doesn’t automatically make you a caretaker of course, but your experience and your stories are a greater benefit to the community than if they weren’t told. Please hang in there 💕 I know I’m just a stranger on the internet, but I forgive you and I think you’re a really strong person.",
      "created_utc": 1592108006.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fuss77h",
      "author": "inmda",
      "body": "It's not your fault. Anorexia is \"contagious\"\nJust like a drug addiction, it takes down the vulnerable people around you. We are all influenced by the people around us, and some illnesses of habits are contagious. It is NOT you fault. You did NOT nearly kill them. The illness did\n\nAnorexia is contagious. And just like with the current pandemic, we should be careful to not infect vulnerable people. If someone takes too much interest in the illness, in the abd habits, if they start going down the same math, we know how it feels and we should stay away, stop enabling, and get them help before it's too late\n\nBut remember, you did not nearly kill them, the illness did. We should all be more careful, your story is a situation some of us don't realise can happen, and we should all be careful. But you did not nearlt kill them",
      "created_utc": 1592141803.0,
      "score": 7,
      "context": []
    },
    {
      "id": "furcxxt",
      "author": "RapidMongrel",
      "body": "My friend who was recovered told me stuff he used to do. And when I was having a food relapse issue I remembered what he said. So I followed all of it. 4 months later was in the hospital dieing. He's been helping with my recovery. I am still over weight so when I'm at a point I can work on it again it's gonna be interesting.",
      "created_utc": 1592098619.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fuss837",
      "author": "wingednova",
      "body": "i'm so sorry you have to go through this.  one of my closest friends and i bonded over our shared ed; she'd started before me and was always a step ahead in the process. it was toxic, seeing her gain weight through bulimia while i stayed anorexic and then when i reached her stage, she's gone back. we kept each other in the loop. we've been out of it but i'm sure if we meet we'll be comparing ourselves again. but at the same time she was such a support.\n\nyou shouldn't have to blame yourself for this. i sometimes feel like eds are meant to happen to those that have them. i got mine from - of all places - chicken soup for the teenage soul. maybe it's just me, but perhaps you just triggered something that might have happened eventually. your friend, your ex, might've recovered sooner if they hadn't met you. maybe they'd have gotten worse. you can't know, please don't blame yourself too much. sure, you definitely enabled this but think of it as causing 10, 20 % of the problem. \n\nthat said - they're better now. you're better now. if you're in touch with ed-vulnerable people again, make sure you *do not enable them*. don't justify ed behavior in any way. if you think your body could act as a trigger to them - i don't know, blame it on metabolism or something. do not discuss stats, of now or before. and try exposing them as much as possible to normal, guilt-free eating, while avoiding potential triggers. if you think it helps, you could drop in hints of how happier you are now. also, be aware of any possible triggering behavior you or they might show - OP, take care of yourself here too.\n\ncongratulations on your recovery, i really hope this is it!",
      "created_utc": 1592141820.0,
      "score": 1,
      "context": []
    }
  ]
}