{
  "id": "ha0mmc",
  "subreddit": "AnorexiaNervosa",
  "author": "chin_chins_waifu",
  "created_utc": 1592299627.0,
  "title": "I just need to vent",
  "selftext": "Since I was sent to the hospital last year and put into “recovery” its so much worse. Everyone around me is like “okay, she went to the hospital so she’s ALL BETTER now” it’s like they just expect me to be fine again. But I’m not, and they don’t care. I gained 46 lbs in recovery, and I fucking hate it. Every time I look in the mirror I just breakdown. I have to cry in the shower just so my family won’t hear, because they don’t understand it. I hate going outside, I hate people, I literally hate living. And no one notices how much pain I’m in. Because I’m always the happy outgoing girl that’s there for everyone else. But why is no one here for me when I’m in such a dark place? Am I being too selfish to ask for my mom to hug me and tell me it’s okay? Or for my siblings to stop making fun of my body? For my dance instructor to acknowledge my hard work and passion? Or for my best friend to listen to me? I feel like I’m just annoying and not good enough for anyone :/",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ha0mmc/i_just_need_to_vent/",
  "score": 123,
  "num_comments": 7,
  "comments": [
    {
      "id": "fv00l00",
      "author": "None",
      "body": "No! You are absolutely not being selfish by asking for compassion. I am recently out of treatment as well and there is nothing weak about asking for help. It’s something I had to learn to do once I came home because I was so used to holding everything in and being “fine”.",
      "created_utc": 1592305521.0,
      "score": 25,
      "context": []
    },
    {
      "id": "fv02b8x",
      "author": "Ikumi_",
      "body": "Awww I relate so much, I gained over 50kg in \"recovery\" and everyone assume I'm ED free (I think that for them anorexia just means being skinny and they don't get it's a mental illness), complain about my weight and tell me to lose weight and to exercise because I'm so unhealthy and stuff, well thanks to them and not being able to stand my obese version I relapsed hard and since they think I'm forever cured from anorexia at least they don't care if I barely eat... I'm so damn mad at people being so uneducated about eating disorders and stuff and also for the so called \"recovery\" where people don't even care if you feel better and if your relationship with food and your body is better and just want you to stop being underweight..",
      "created_utc": 1592307023.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fv0dwna",
      "author": "None",
      "body": "This is so much to get used to! You’re so strong. You want a healthy body. Please try and love it for what it is. Easier said than done of course but :/. You’ve made huge strides in the past, and it’s okay to fall down a few times in the process. You’re going to make it through this, you’re beautiful 🥺",
      "created_utc": 1592314988.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fv0o9ug",
      "author": "bunanbunv",
      "body": "I feel like I wrote this. I've not gotten treatment but I'm afraid that I'll \"get better\" but everything will be the same. I hope things get better for you OP.",
      "created_utc": 1592320478.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fv0n85h",
      "author": "5drinksamy",
      "body": "Weight restoration doesn't equal recovered. I wish there was something I could say that would get them and others to believe that.\n\nLike regardless of body size; if that same voice is still in your head there's still work to do.",
      "created_utc": 1592319953.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fv21hri",
      "author": "None",
      "body": "I went to the psych ward for a week for a suicide attempt and when I came back my parents assumed my bulimia was cured. I’m 95 lb and throw up like five times every single day but ok",
      "created_utc": 1592342408.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fv14htq",
      "author": "SquargyBoi",
      "body": "I completely agree with you and you're not being selfish - it's hard :( as soon as I came out of hospital no one is checking up on me, I'm too scared to go on holiday with my friends - mentally I'm not okay. I hope you're getting the outpatient help you need X",
      "created_utc": 1592327377.0,
      "score": 2,
      "context": []
    }
  ]
}