{
  "id": "hem7w7",
  "subreddit": "AnorexiaNervosa",
  "author": "lbvl",
  "created_utc": 1592943719.0,
  "title": "Does anyone else never ever steps on a scale out of intense fear and you have no idea what you weigh?",
  "selftext": "Really wondering if I am completely on my own in this, in this illness not having the courage to step on a scale makes me feel quite alone and in a weird way also ashamed and cowardice. Last time I stepped on a scale was 10+ years ago (which is also roughly the duration of ED) and have been afraid of them since. On the other hand, there is also a strong curiosity about my actual weight but the fear of what this number will do to my brain freaks me out. Anyone recognises him/herself in this? Hope I am not alone.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/hem7w7/does_anyone_else_never_ever_steps_on_a_scale_out/",
  "score": 129,
  "num_comments": 16,
  "comments": [
    {
      "id": "fvsasks",
      "author": "peachaleach",
      "body": "I wouldn't say I have an intense fear of being weighed, I think being in tx and getting weighed daily/weekly for years has desensitized me a bit but I will only do blind weights and it still makes me a bit panicky when I'm in a new doctor's office/clinician/etc. \n\nI'm petrified of *knowing* my weight though. I can remember how intense the obsession was when I was really deep in my ED and I know seeing my weight would likely trigger a relapse. \n\nDumbest comment I've ever made but I just like...don't want to have a relationship with gravity that's measurable in any way.",
      "created_utc": 1592947647.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fvsicbn",
      "author": "kookiekk7",
      "body": "Yes. Im always so scared that I gained. I will usually only try to weigh after hardly eating anything, just to see.",
      "created_utc": 1592951479.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fvsy0t3",
      "author": "Xx420OKBOOMER69xX",
      "body": "Yes! I’m actually scared of stepping in the scale to see how much I’ve gained. I’d much rather get to what I think my goal weight looks like, and then check how much I weigh",
      "created_utc": 1592960174.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fvsoumn",
      "author": "None",
      "body": "I literally feel the same way! Thought I was alone! When I was younger I would feel anxious about going onto the scale because my mom would slightly judge or make a comment like girls your age are _ number. Maybe you should be on diet to be at that number. So I now i can't even get on a scale and I don't like going to the doctors because of this. Instead though I measure my body which I'll be compulsive about it or not do it for weeks cause I'm scared.",
      "created_utc": 1592954974.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fvt4upd",
      "author": "jaimer23456789",
      "body": "You serious? get out of my head lol but on a serious note a came to terms that no matter how much I weigh I will never like what's the scale so my reaction is always the same🤷‍♂️",
      "created_utc": 1592964147.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fvsm1oi",
      "author": "misskittenmittenss",
      "body": "Yes, me! I have absolutely no clue but somehow not having an idea stresses me out, too.",
      "created_utc": 1592953437.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fvt5u4m",
      "author": "uglee_girl",
      "body": "I literally haven’t known my weight for at least 4years now... I’ve come to realize that I’ll never be happy with that number. I already deal with BDD and anytime I know my weight I begin to quantify my “ugliness”. I start to set goals, count calories, cry over breaking a fast/calorie limit. And no matter how much I lose I still feel ugly. \n\nIm by no means fully recovered but I’ve found peace in not knowing my weight. I sometimes limit how many times I eat, but I don’t count calories. I sometimes cry when I feel full, but it’s no where near the stress of binging because I ate 1cal over my budget. \n\nI don’t think being afraid of the scale means you haven’t recovered either! To me it isn’t so much a fear, but the STRENGTH to walk away from a possible trigger. \n\n\nWhen you see fire you are not a coward for not touching it. You are wise enough to know it might burn❤️",
      "created_utc": 1592964724.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fvt009p",
      "author": "PrincessTiaraLove",
      "body": " I have zero ideas how much I weigh and haven’t known for years. I measure my progress by the way my clothes fit. A scale would probably drive me crazy.",
      "created_utc": 1592961341.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fvt6j91",
      "author": "morespacepls",
      "body": "Oh yes, I just measure my waist and hips compulsively cause that seems... better... somehow? Than knowing my weight lollllllll",
      "created_utc": 1592965133.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fvtbb01",
      "author": "EdBen0",
      "body": "Can relate. My ED started to be a big problem for me and my family four years ago, i've been in \"recovery\" for two years and I haven't step on a scale since then. For me it's just that I used to weight myself twice a day and it was so hard for me to stop doing that and I'm afraid of what would happen if I don't like the number I see",
      "created_utc": 1592967940.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fw0puia",
      "author": "for800",
      "body": "I’ve been pretty okay, but slipping back into some bad habits. I usually get only weigh myself at the doctors’, but then a few weeks ago I found my roommates scale, and realized I weighed 10lbs less than I thought I did. Since then my ED voice has gotten louder, and I’ve started weighing myself pretty frequently and letting the number control my mood and eating pattern. \n\nI knew this would happen beforehand, but my advice is don’t do it.",
      "created_utc": 1593136843.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fvx2y9p",
      "author": "katskrat",
      "body": "I just bought a scAle this morning and weighed myself three times already. I know this is a bad idea. I was afraid to weigh myself before my relapse, but now I just need to know if I gained or a confidence booster to see if I've lost. I'm going away for two days tomorrow and I'm already stressed about not having it",
      "created_utc": 1593053444.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fvtp7my",
      "author": "lbvl",
      "body": "Hahaha your last line made me laugh, not a dumb comment at all. It’s like, we know that relationship with gravity will be 100% obsession so better stay the hell away from it and try (but fail) to deny any physical components and matter of our body.",
      "created_utc": 1592977335.0,
      "score": 3,
      "context": [
        {
          "id": "fvsasks",
          "author": "peachaleach",
          "body": "I wouldn't say I have an intense fear of being weighed, I think being in tx and getting weighed daily/weekly for years has desensitized me a bit but I will only do blind weights and it still makes me a bit panicky when I'm in a new doctor's office/clinician/etc. \n\nI'm petrified of *knowing* my weight though. I can remember how intense the obsession was when I was really deep in my ED and I know seeing my weight would likely trigger a relapse. \n\nDumbest comment I've ever made but I just like...don't want to have a relationship with gravity that's measurable in any way.",
          "created_utc": 1592947647.0
        }
      ]
    },
    {
      "id": "fvwaf1q",
      "author": "Silver_Oakleaf",
      "body": "That last bit really spoke to me, i didn’t think it was dumb at all",
      "created_utc": 1593035749.0,
      "score": 1,
      "context": [
        {
          "id": "fvsasks",
          "author": "peachaleach",
          "body": "I wouldn't say I have an intense fear of being weighed, I think being in tx and getting weighed daily/weekly for years has desensitized me a bit but I will only do blind weights and it still makes me a bit panicky when I'm in a new doctor's office/clinician/etc. \n\nI'm petrified of *knowing* my weight though. I can remember how intense the obsession was when I was really deep in my ED and I know seeing my weight would likely trigger a relapse. \n\nDumbest comment I've ever made but I just like...don't want to have a relationship with gravity that's measurable in any way.",
          "created_utc": 1592947647.0
        }
      ]
    },
    {
      "id": "fvtpctr",
      "author": "lbvl",
      "body": "I’ve been thinking that for a long time too but my brain never accepts my body as ‘weighable,’ I always have to lose more.",
      "created_utc": 1592977448.0,
      "score": 3,
      "context": [
        {
          "id": "fvsy0t3",
          "author": "Xx420OKBOOMER69xX",
          "body": "Yes! I’m actually scared of stepping in the scale to see how much I’ve gained. I’d much rather get to what I think my goal weight looks like, and then check how much I weigh",
          "created_utc": 1592960174.0
        }
      ]
    },
    {
      "id": "fvwhzps",
      "author": "peachaleach",
      "body": "I guess it always *feels* dumb/sillly to me because the chemist/scientist me looks at it from that standpoint and it's hard to reconcile the side of my brain that looks at as a scientific/mathematical equation with the ED side of my brain that is like \"this is what defines you as a person and your worth and it must be as low as possible\"\n\nIdk I struggle with other things too given my background in chem/biochem and understanding things from a purely scientific perspective yet completely throwing that all out the window when it comes to how I view and treat myself/food/body/weight.",
      "created_utc": 1593039702.0,
      "score": 2,
      "context": [
        {
          "id": "fvsasks",
          "author": "peachaleach",
          "body": "I wouldn't say I have an intense fear of being weighed, I think being in tx and getting weighed daily/weekly for years has desensitized me a bit but I will only do blind weights and it still makes me a bit panicky when I'm in a new doctor's office/clinician/etc. \n\nI'm petrified of *knowing* my weight though. I can remember how intense the obsession was when I was really deep in my ED and I know seeing my weight would likely trigger a relapse. \n\nDumbest comment I've ever made but I just like...don't want to have a relationship with gravity that's measurable in any way.",
          "created_utc": 1592947647.0
        },
        {
          "id": "fvwaf1q",
          "author": "Silver_Oakleaf",
          "body": "That last bit really spoke to me, i didn’t think it was dumb at all",
          "created_utc": 1593035749.0
        }
      ]
    }
  ]
}