{
  "id": "hk0fvs",
  "subreddit": "AnorexiaNervosa",
  "author": "bugswillbite",
  "created_utc": 1593708140.0,
  "title": "this is stupid",
  "selftext": "I hate this. A few days ago, I noticed my Mom has started to like feel for the bones protruding in my back whenever we hug. Now I feel the need to put on two jackets before I go to hug her to avoid her feeling my back.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/hk0fvs/this_is_stupid/",
  "score": 137,
  "num_comments": 6,
  "comments": [
    {
      "id": "fwpxyqv",
      "author": "gotprobsyo",
      "body": "I’m so sorry. That happened to me too. It made hugs feel like they were no longer safe and I ended up pulling away from everyone (when I was closest to my parents). I still have a hard time hugging my mom now that I’m a normal weight.",
      "created_utc": 1593712294.0,
      "score": 49,
      "context": []
    },
    {
      "id": "fwq32y3",
      "author": "friendlybunny98",
      "body": "That’s so horrible. I could have sworn my mom did the same thing last night — was wearing a thick hoodie and when she tried to give me a hug from the side she like deliberately ran her finger along my side, feeling for my hip bone. Felt so invasive.",
      "created_utc": 1593714720.0,
      "score": 30,
      "context": []
    },
    {
      "id": "fwqgj3h",
      "author": "None",
      "body": "My mom does this too and she thinks she’s being subtle. She doesn’t realize I know exactly what she’s doing",
      "created_utc": 1593721141.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fwqj7t8",
      "author": "VoidMayonnaise",
      "body": "My mom does this too, and she makes a worried face and i always feel guilty :(",
      "created_utc": 1593722458.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fwrgpx5",
      "author": "None",
      "body": "My mom will put her hand on my stomach and sometimes squeeze it and since I’m still fat it makes me feel horrible and like I can’t ever eat again",
      "created_utc": 1593740973.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fwr7rh2",
      "author": "Snowypaton1",
      "body": "My parents did this :(",
      "created_utc": 1593735486.0,
      "score": 3,
      "context": []
    }
  ]
}