{
  "id": "hlrzt7",
  "subreddit": "AnorexiaNervosa",
  "author": "MaiaSolomon",
  "created_utc": 1593975446.0,
  "title": "What I hate TW:",
  "selftext": "I hate waking up in the middle of the night to use the bathroom because I drank far too much filling water the day before. I hate not knowing what to do or what to eat and having to decide the day before. I hate being the only one on a summer day wearing pants and a sweater. I hate that I can’t make people understand my ED. I hate hiding behind the fact that I’m “not normal” or whatever that means anymore. I hate seeing my mom cry. I hate that my dad can make a triggering comment and not know it offends me. I hate that the only soda I will have is diet. I hate that I can’t have freedom with food. I hate that food is all I can think about, whether it’s how many more hours until my next meal, how I will avoid snacking, etc. I hate that I have t bring extra jackets everywhere I go not only because I’m cold but also because the bones in my body press up against the chairs, benches, etc. I feel like I fell into a 2x1x2 of bedrock in survival mode.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/hlrzt7/what_i_hate_tw/",
  "score": 111,
  "num_comments": 9,
  "comments": [
    {
      "id": "fx1at5b",
      "author": "moonchild966",
      "body": "and I hate that I relate to every single one of these things",
      "created_utc": 1593984045.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fx2huq7",
      "author": "None",
      "body": "This feels like the biggest call out...\nI guess the only good thing is knowing we’re not alone",
      "created_utc": 1594009983.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fx1bj2f",
      "author": "aga133r2t",
      "body": "Aw babe, i hate that Ana makes us feel, think and do all of these terrible things to ourselves. We will get through it, slowly but surely. promise. sending you so much love ❤️",
      "created_utc": 1593984430.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fx2snh9",
      "author": "Nothingspecialmyguy",
      "body": "Relate to everything on this list for the most part, seems reddit likes to show me posts that are loud as heck",
      "created_utc": 1594018957.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fx317bc",
      "author": "Snowypaton1",
      "body": "Hey I know you don’t want to hear this but recovery is possible. You can get there. I love u",
      "created_utc": 1594027494.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fx71034",
      "author": "None",
      "body": "I can relate to how you're feeling. My relationship with scales and food gets the better of me and makes me feel like I'm going crazy sometimes. I go backwards and forwards regarding what to do about it. I don't have problems weighing myself if I like what I see (in terms of numbers) and food is no drama (obviously). If I'm upset with what my weight is doing, I have existential issues and I feel insecure in myself. I feel threatened. I've never been stable. Eventually I'll chip away at the insecurities I'm grappling with. No one else can tell you what to think or how to feel\n\nDuring periods of high stress and isolation with existing mental health issues I don't think it's a good idea to scare yourself into any major changes you're not ready for. The worst part about it is the distracting thoughts, anxiety and self-loathing. I think the hardest part about relinquishing ED behaviours is feeling like you're losing control and you can't trust yourself. And your body is going to mutate into something you're not comfortable with and don't recognise, against your will",
      "created_utc": 1594120770.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fx1avqq",
      "author": "MaiaSolomon",
      "body": "😔",
      "created_utc": 1593984084.0,
      "score": 5,
      "context": [
        {
          "id": "fx1at5b",
          "author": "moonchild966",
          "body": "and I hate that I relate to every single one of these things",
          "created_utc": 1593984045.0
        }
      ]
    },
    {
      "id": "fx1bnrl",
      "author": "MaiaSolomon",
      "body": "Thank you so much ❤️ I’ve been struggling recently but this gave me some hope",
      "created_utc": 1593984498.0,
      "score": 1,
      "context": [
        {
          "id": "fx1bj2f",
          "author": "aga133r2t",
          "body": "Aw babe, i hate that Ana makes us feel, think and do all of these terrible things to ourselves. We will get through it, slowly but surely. promise. sending you so much love ❤️",
          "created_utc": 1593984430.0
        }
      ]
    },
    {
      "id": "fx44g5e",
      "author": "MaiaSolomon",
      "body": "❤️🥺",
      "created_utc": 1594054077.0,
      "score": 2,
      "context": [
        {
          "id": "fx317bc",
          "author": "Snowypaton1",
          "body": "Hey I know you don’t want to hear this but recovery is possible. You can get there. I love u",
          "created_utc": 1594027494.0
        }
      ]
    }
  ]
}