{
  "id": "hoousc",
  "subreddit": "AnorexiaNervosa",
  "author": "Gingla04",
  "created_utc": 1594387365.0,
  "title": "I feel like i can't be anorexic",
  "selftext": "I feel like i can't be anorexic since i want food. Even right now i really really badly want to Just eat something. I just feel like i'm faking it since i want food Even tho i don't eat since i know i'll have a huge mental breakdown if i do eat it.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/hoousc/i_feel_like_i_cant_be_anorexic/",
  "score": 172,
  "num_comments": 7,
  "comments": [
    {
      "id": "fxj8wwg",
      "author": "Lismale",
      "body": "it's not the \"loving food\" part that is your illness, it's the hatred you feel for yourself for loving it.",
      "created_utc": 1594391775.0,
      "score": 79,
      "context": []
    },
    {
      "id": "fxj6cuq",
      "author": "chelso17",
      "body": "i feel this wayyy too hard. i LOVE food and everything ab it. eating it, smelling it, cooking it, baking it, serving it, anything. it’s all my mind is filled w anymore and BOY does it make having this disorder so much harder :/",
      "created_utc": 1594390395.0,
      "score": 48,
      "context": []
    },
    {
      "id": "fxju5wm",
      "author": "5drinksamy",
      "body": "The DSM (even the latest one) doesn't really accurately represent the thoughts behind anorexia. It's a disease of thoughts that influence behavior so the thoughts you have about wanting food are normal but the thoughts you have about overriding that natural urge to eat is where the disorder comes in to play, for all of us! Basically, we all \"want\" food because it comes preprogrammed in our brains but the interfering / interrupting thoughts are experienced at all different degrees in the community...the interference is the disorder...i hope that makes sense. Basically your disorder is valid and its probably tricking you into thinking you don't have ED! <3",
      "created_utc": 1594402294.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fxk04we",
      "author": "Panic-atthepanic",
      "body": "Same. I feel like I failed even anorexia.",
      "created_utc": 1594405171.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fxktkv0",
      "author": "None",
      "body": "I think that's often a symptom of the disease. The more/longer you restrict, the more obsessed you become with food- imagining it, poring over cookbooks, watching people eat... I think it's pretty common, honestly. Either way, your struggle is valid.",
      "created_utc": 1594420136.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fxj688i",
      "author": "maonue",
      "body": "I was like that at the beginning, you do stay hungry kind of throughout the illness. I enjoyed eating at every stage, even though my preference for foods shifted.\n\nI became more rigid as things progressed but it was more diet-y when I started to be honest.",
      "created_utc": 1594390323.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fxjhtzv",
      "author": "None",
      "body": "I miss popeyes",
      "created_utc": 1594396326.0,
      "score": 12,
      "context": [
        {
          "id": "fxj6cuq",
          "author": "chelso17",
          "body": "i feel this wayyy too hard. i LOVE food and everything ab it. eating it, smelling it, cooking it, baking it, serving it, anything. it’s all my mind is filled w anymore and BOY does it make having this disorder so much harder :/",
          "created_utc": 1594390395.0
        }
      ]
    }
  ]
}