{
  "id": "hqvdlt",
  "subreddit": "AnorexiaNervosa",
  "author": "aguyandana",
  "created_utc": 1594703155.0,
  "title": "I feel bad for being happy that I weigh less than my younger sister",
  "selftext": "For context my family went on a trip a while ago and we did a lot of swimming in the lake. My 3 siblings and I wanted to climb on each others shoulders and try to knock each other into the water, just typical fun stuff. I then discovered now all of my siblings, who are younger than me, could lift me up. Even the youngest who is tiny could lift me. My siblings were surprised too, and we all started comparing weights. I found out that I was smaller in weight to my brother and my sister. My brother is taller than me, so that wasn't too much of a surprise that he weighed more, but my sister is around my height. I felt delighted immediately, then I felt sick to my stomach. What is wrong with me? Feeling happy that I weigh less than my siblings? That's disgusting. But yet I can't help but feel strangely happy and overjoyed to be the sk\\*nniest out of my siblings. It feels so wrong and twisted and I hate it.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/hqvdlt/i_feel_bad_for_being_happy_that_i_weigh_less_than/",
  "score": 120,
  "num_comments": 7,
  "comments": [
    {
      "id": "fy0rs10",
      "author": "cottagecow",
      "body": "My sister weighs less than me and I'm honestly jealous of that, which is twisted in it's own way too. Don't feel too bad.",
      "created_utc": 1594719262.0,
      "score": 28,
      "context": []
    },
    {
      "id": "fy0ubiq",
      "author": "_stone_b",
      "body": "I am also happy to weight less than my younger sister, but she is one head smaller than me...",
      "created_utc": 1594721891.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fy1a0jm",
      "author": "RIpronouncedREE",
      "body": "My brother is a few inches taller than me and weighs the same as me but looks so much thinner than I do and I’m always so jealous. I hate myself for feeling this way.",
      "created_utc": 1594734013.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fy13m28",
      "author": "caj065",
      "body": "i definitely understand where you’re coming from, my twin sister is taller than me by like an inch and a half so it’s not super difficult to weigh less than her. she isn’t big by any means, she’s at a healthy weight. so when i found out how much she weighed, i was really surprised to find out how big of a difference there was, especially since im not even underweight. i don’t wanna be specific with numbers but yeah, i was shocked",
      "created_utc": 1594729950.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fy1dbc3",
      "author": "Jayayaje",
      "body": "My older sister is a few inches shorter than me but weighs more than me and I feel so bad for being proud of that",
      "created_utc": 1594735903.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fy1pto7",
      "author": "MamasBoyFrankie",
      "body": "You are correct, it’s not a great thought, but give yourself some credit please!! The thoughts have stayed in your head and not come out your mouth. You obviously love them too much to hurt them, and you recognize that it’s not a healthy thought. And yes, I’ve been there, and feel like a disgusting human being; I’ve been happy that I weigh less than my daughter! How sick is that. I’ve never admitted it before, and I feel humiliated and ashamed. Well, now that I have the topic of conversation for my next therapy session...",
      "created_utc": 1594742373.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fy2dwwg",
      "author": "superjunior1480",
      "body": "Omg saaaaame. I thought I was the only one",
      "created_utc": 1594753827.0,
      "score": 2,
      "context": []
    }
  ]
}