{
  "id": "hxh04s",
  "subreddit": "AnorexiaNervosa",
  "author": "spaghettieggrolls",
  "created_utc": 1595652649.0,
  "title": "I wish there was a button I could press that could take away everyone's EDs",
  "selftext": "Okay so I just cried a whole bunch because I was just thinking about how hard recovery is and how since I've been in treatment I've met so many amazing people who are struggling so much and it's just not fair. So I felt the need to throw out some positivity and love to all you beautiful people.\n\nPeople with EDs are determined and intelligent. We are resilient in that we fight a disorder that is very stigmatized and misunderstood. Unfortunately there is no magic button, but we can use our gifts to fight our illness and reclaim our lives.\n\nRecovery is not linear. Life is not linear. It's okay to fall apart. It's okay to relapse. It's okay to want to give up. But on the other side there is something beautiful waiting for you.\n\nFeed your body to fight your illness instead of feeding your illness to fight your body.\n\nIf you feel like nobody understands you, just know that I do and there are millions of people worldwide who do.\n\nI mean it with my whole heart when I say that regardless of your age, race, gender, weight, or eating disorder, you are fucking worthy.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/hxh04s/i_wish_there_was_a_button_i_could_press_that/",
  "score": 145,
  "num_comments": 5,
  "comments": [
    {
      "id": "fz6999n",
      "author": "i_like_sunflowers",
      "body": "i couldn’t agree with this more 🥺❤️",
      "created_utc": 1595657862.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fz794mm",
      "author": "RIpronouncedREE",
      "body": "Thank you so much for this. Yesterday was a really hard day for me 😭so waking up to this was really nice. It made me remember all the amazing friends I made in treatment and why I should keep fighting even if it’s hard.",
      "created_utc": 1595689298.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fz7gv6d",
      "author": "anu_start_69",
      "body": "\"Feed your body to fight your illness instead of feeding your illness to fight your body.\"\n\nLove that!",
      "created_utc": 1595693717.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fz6uad2",
      "author": "smolpotato15",
      "body": "Yes take away mine",
      "created_utc": 1595678787.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fz6uqtq",
      "author": "spaghettieggrolls",
      "body": "If I could I would in a heartbeat. Your ED is a bully and a liar and you deserve so much better ❤️",
      "created_utc": 1595679187.0,
      "score": 5,
      "context": [
        {
          "id": "fz6uad2",
          "author": "smolpotato15",
          "body": "Yes take away mine",
          "created_utc": 1595678787.0
        }
      ]
    }
  ]
}