{
  "id": "ia02fp",
  "subreddit": "AnorexiaNervosa",
  "author": "moneysignsarah",
  "created_utc": 1597460750.0,
  "title": "Apology",
  "selftext": "Recently I made a post with details and numbers about my weight loss & i was asked to take it down because it was triggering. I just wanted to say to anyone that saw my post with specific numbers in it, I am so sorry. I am sorry if i caused a negative thought for even one second, i didn't mean to, and i didn't realize that what i said could have been harmful to someone. My post was only up for a couple hours but to anyone saw it or was triggered or wasn't triggered, I really do apologize. I'm learning the acceptable things to say on this thread, and i now know what not to say. \n\nI took a moment to weigh myself at work and saw that i was an even ___.0 lbs so i typed a little paragraph real fast and posted it. I should have thought harder about what i had said & I should be able to filter it myself, not have other people tell me what i said was wrong. I apologize to the deepest of depths",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ia02fp/apology/",
  "score": 150,
  "num_comments": 6,
  "comments": [
    {
      "id": "g1ilbnz",
      "author": "avocantdough",
      "body": "It is so huge of you to make this apology post. Try not to worry too much. We all make mistakes and are just doing our best ❤️",
      "created_utc": 1597460917.0,
      "score": 45,
      "context": []
    },
    {
      "id": "g1jhzol",
      "author": "Moosycakes",
      "body": "You're so sweet, I really love seeing people apologising because it shows that they are mature and care about the feelings of other people.\n\nI didn't see the original post but thank you for this ❤️",
      "created_utc": 1597475043.0,
      "score": 20,
      "context": []
    },
    {
      "id": "g1k2kv8",
      "author": "MamasBoyFrankie",
      "body": "You are lovely to care enough to say this! I’m sure you made a positive difference today for many people. Hold on to that good thought, and may it grow into a good feeling. You deserve one❤️❤️❤️",
      "created_utc": 1597483523.0,
      "score": 12,
      "context": []
    },
    {
      "id": "g1m1pt3",
      "author": "None",
      "body": "Thanks for posting this. I saw your post and was not bothered by it. Take care!",
      "created_utc": 1597508956.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g1mwhwu",
      "author": "GeniGeniGeni",
      "body": "Love you.",
      "created_utc": 1597518353.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1mwj7v",
      "author": "agree-with-you",
      "body": "I love you both",
      "created_utc": 1597518364.0,
      "score": 3,
      "context": [
        {
          "id": "g1mwhwu",
          "author": "GeniGeniGeni",
          "body": "Love you.",
          "created_utc": 1597518353.0
        }
      ]
    }
  ]
}