{
  "id": "ibpzvs",
  "subreddit": "AnorexiaNervosa",
  "author": "caleafornias",
  "created_utc": 1597708502.0,
  "title": "Faking recovery",
  "selftext": "I am SO full of shit. I sent the single most pretentious hypocritical photo to all my friends today telling everyone that I’m no longer at an underweight BMI, I eat 3 normal meals a day, and I’m living my best life!!!!!! But the truth is that I hate every moment of this, I absolutely cannot stand the sight and thought of all the weight I worked so hard to lose coming back onto my body. I’ve started throwing up after meals again even though I HATE doing it, just because my family is so happy to see me eating and if I stop they’ll be worried. It’s so awful and exhausting pretending to be in recovery for other people, but I also know that a full on visible relapse will make me a burden on everyone again and I can’t have that either. *tears out hair*",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ibpzvs/faking_recovery/",
  "score": 135,
  "num_comments": 3,
  "comments": [
    {
      "id": "g1xp4vv",
      "author": "breathelikeatree",
      "body": "Your body is fighting hard to keep you alive! Don’t let your brain bully you into doing things you don’t want. You are so so so strong and you’re making so much progress. I was in your shoes and I was always so close to breakdowns everyday. I hated people congratulating me for getting better and I hated people being concerned for what I was doing. I told myself I was fine. But I wasn’t. I didn’t want to be healthy even though I knew I was killing myself. Everyone’s eye opener is different but mine was realizing how I only have one shot at life and that one day I will have an experience that will make me think “I’m glad I stayed” no matter how long it takes, that moment will come. Recovery was *so* hard for me, I wished to die. Once I was fully recovered, everything got so much easier and I felt like a new person. I’d have bad days where I’d be tempted to relapse but I kept thinking “my body deserves better. It’s been fighting for so long, my brain can’t control me.” \n\nIt’s so hard and I’m honestly tearing up writing this, but ik you’ve got it. I’ve been there. Recovery is harder than anything, but here’s me, talking from the other end of timeline. The feeling of being recovered, even if only 80% of the way, is so refreshing and euphoric. Instead of *pushing* myself at working out and crying every night, I *pushed* myself to eat and get through it; because I am strong. *you* are strong. It’s the same mental energy, just focusing on something else. Don’t doubt yourself. You’ve gotten so far. You can make it. There will be ups and down. Mama raised no quitter. Don’t let your brain let you say that you’re a quitter. I have my faith in you even in your darkest days. Ily:’) <3",
      "created_utc": 1597714179.0,
      "score": 34,
      "context": []
    },
    {
      "id": "g1ybtfu",
      "author": "kirbysuckslol",
      "body": "I am having a similar experience. I told my friends I checked myself into a phych ward and disipeared for 3 months and if I was seen i would say I was visiting or picking up more stuff to bring to the hospital. I don't want to be known as the anorexic girl anymore and if they think I'm recovered they might get off my case",
      "created_utc": 1597727863.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g1zxeau",
      "author": "caleafornias",
      "body": "Thank you so much for your kind words. Honestly they made me tear up too. I just find it so unbearable how recovery “on the surface” can be so different to how I feel inside. Yes, I eat now, and I’m back at a healthy BMI, but it all feels so fake and performative because I don’t actually feel any better and all I want is to go back to starving in peace. You’re definitely right that recovery has to be more than just eating. It needs to be feeling okay about eating too, and changing the direction of my focus. Thank you again for your sweet words and I am so proud of you too for getting where you are. ❤️",
      "created_utc": 1597767147.0,
      "score": 1,
      "context": [
        {
          "id": "g1xp4vv",
          "author": "breathelikeatree",
          "body": "Your body is fighting hard to keep you alive! Don’t let your brain bully you into doing things you don’t want. You are so so so strong and you’re making so much progress. I was in your shoes and I was always so close to breakdowns everyday. I hated people congratulating me for getting better and I hated people being concerned for what I was doing. I told myself I was fine. But I wasn’t. I didn’t want to be healthy even though I knew I was killing myself. Everyone’s eye opener is different but mine was realizing how I only have one shot at life and that one day I will have an experience that will make me think “I’m glad I stayed” no matter how long it takes, that moment will come. Recovery was *so* hard for me, I wished to die. Once I was fully recovered, everything got so much easier and I felt like a new person. I’d have bad days where I’d be tempted to relapse but I kept thinking “my body deserves better. It’s been fighting for so long, my brain can’t control me.” \n\nIt’s so hard and I’m honestly tearing up writing this, but ik you’ve got it. I’ve been there. Recovery is harder than anything, but here’s me, talking from the other end of timeline. The feeling of being recovered, even if only 80% of the way, is so refreshing and euphoric. Instead of *pushing* myself at working out and crying every night, I *pushed* myself to eat and get through it; because I am strong. *you* are strong. It’s the same mental energy, just focusing on something else. Don’t doubt yourself. You’ve gotten so far. You can make it. There will be ups and down. Mama raised no quitter. Don’t let your brain let you say that you’re a quitter. I have my faith in you even in your darkest days. Ily:’) <3",
          "created_utc": 1597714179.0
        }
      ]
    }
  ]
}