{
  "id": "ifpsgj",
  "subreddit": "AnorexiaNervosa",
  "author": "unicorn20023",
  "created_utc": 1598278522.0,
  "title": "Is it weird or does anyone else get triggered when they someone who is thinner than them irl or online?",
  "selftext": "\nHi everyone so I’ve struggled for restrictive eating disordered behavior patterns since I was maybe 15 or 16 (by the time I hit puberty and started to notice my metabolism to slow a little and be being more prone of weight gain - idk why, maybe due to the media, but I’ve always been very fat-phobic & extremely fearful of becoming obese or even being marginally overweight as I feel I would be ugly and undesired) and ever since, especially since moving into my own apartment my ED & restrictive, anorexic eating patterns and behaviors have worsened in intensity, in terms of the number of rules (very little carbs, fat, sodium and sugar) along w/ occasional guilt binges (eating a Burger King order probably meant for a couple and not finishing it fully & throwing the rest out of disgust and shame for relapsing). I’ve been eating salads paired w/ fruit per w/meal each day to reach my goal. Long story short, the coordinator at internship site of mine for a class km doing looks to be very thin and I get severely triggered and upset because I feel fat in comparison whenever I see her (I analyze how her arms and legs for instance are a lot thinner than mine . How do I stop this unhealthy thinking? Sorry :(",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ifpsgj/is_it_weird_or_does_anyone_else_get_triggered/",
  "score": 175,
  "num_comments": 7,
  "comments": [
    {
      "id": "g2q1x3w",
      "author": "JackStrawBerryfields",
      "body": "Not weird, and yes, seeing someone thinner than me, doesn't even matter what gender, triggers my ED",
      "created_utc": 1598297513.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g2p5nmp",
      "author": "niacinameowde",
      "body": "It's not unusual to have a competitive eating disorder. I've had to put some lovely people on mute on my social media because all my mind wanted to do was compare myself to them. In real life, it's kind of hard to avoid as much and it can be a struggle when it can be literally ANYONE. Sometimes what I do is I rationalize that this person is either sick like me (which makes me sad and not as resentful) or just naturally like that (which makes me still a little resentful but then I feel less inclined to \"catch up\"). So sorry you're dealing with this. Hope this helps!",
      "created_utc": 1598282123.0,
      "score": 22,
      "context": []
    },
    {
      "id": "g2qa3k2",
      "author": "SarcasmManifest",
      "body": "I still do and I am 48 yo female. A friend from high school posted a full body selfie and was so thin I was completely triggered...ate nothing for three days. I don’t think the ana voice for me will ever go away.\n\nEdit she posted a mirrored, full body selfie on Facebook.",
      "created_utc": 1598301480.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g2q79bd",
      "author": "longnecklytle",
      "body": "not uncommon! i've had to unfollow people (strangers and acquaintances alike) for this reason. it's not that person's fault, but seeing it isn't good for my brain. it's really difficult to move on from this, but i think a solid first step is maybe hiding posts that make you feel this way, maybe working on kind self-talk as well. no matter what you do, you CAN do it. it's hard and it's nonlinear, but you absolutely can make it through this. if you can, i'd consider picking up a book on recovery too, those are really helpful for me.",
      "created_utc": 1598300099.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2qb5ht",
      "author": "easylasagne",
      "body": "Yes! I will say I’ve stopped writing them off as bad people, making hateful or undercutting comments about them or saying awful untrue things about them “probably p*king up their food” as I’ve gotten older and realized these are projections based on my own self hate and insecurity. \n\nOOOOF. Grow thru what you go thru amirite?",
      "created_utc": 1598301996.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g2rjd1n",
      "author": "skxtxn",
      "body": "Super common, there are some communities online that purposefully trigger each-other continuously. Not weird at all, whether it’s in person or online. You’re not alone!",
      "created_utc": 1598325597.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g2rqqhn",
      "author": "Lismale",
      "body": "all the time.",
      "created_utc": 1598330526.0,
      "score": 1,
      "context": []
    }
  ]
}