{
  "id": "ig791n",
  "subreddit": "AnorexiaNervosa",
  "author": "cryblythe",
  "created_utc": 1598339190.0,
  "title": "Today i got my first “omg im younger than u and i weigh more than u :(“ comment, and i feel shitty for my initial thought being proud of myself, instead of sad for the girl who said it to me.",
  "selftext": "",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ig791n/today_i_got_my_first_omg_im_younger_than_u_and_i/",
  "score": 116,
  "num_comments": 5,
  "comments": [
    {
      "id": "g2se2w9",
      "author": "LischenVonEngels",
      "body": "It's kind of strange: I bet most of us have wished at one point or another that someone would be jealous and wish they had our bodies, but once we're hit with the reality of hit, it all seems to crumble.\n\nTake care of yourself OP, guilt is an awful thing when you haven't even done anything that bad.",
      "created_utc": 1598353463.0,
      "score": 25,
      "context": []
    },
    {
      "id": "g2sl3ns",
      "author": "whataboutbrie",
      "body": "I feel this... someone said to me it was disgusting that I fit into my daughter’s clothes (I was in my 30s and she was preteen) I didn’t see a problem be cause my daughter had no Ed issues/ but damn!",
      "created_utc": 1598359130.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g37smk2",
      "author": "murb98",
      "body": "At my job a new girl was telling me how she’s jealous I’m so small and she feels bad about herself because she is not. I try to express that actually it’s not all it’s cracked up to be. I started feeling that satisfaction feeling. We all love to have our bodies acknowledged because we are literally killing ourselves to have the body we have. You have a good heart for feeling bad about it but don’t. It’s just the ED talking. Like the person above said “guilt is an awful thing” \n\nTake care of yourself 🖤",
      "created_utc": 1598680421.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g2scpd1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1598352111.0,
      "score": 0,
      "context": []
    },
    {
      "id": "g2scxh7",
      "author": "Livie_Lovely",
      "body": "Because that girl has body issues, she's clearly not happy with herself.",
      "created_utc": 1598352334.0,
      "score": 19,
      "context": [
        {
          "id": "g2scpd1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1598352111.0
        }
      ]
    },
    {
      "id": "g2sd76g",
      "author": "caj065",
      "body": "im not OP, but i would guess that it’s because we’ve all been jealous of someone else’s weight before and now look at us, we’re all on a subreddit for anorexia. i know that for me personally, it breaks my heart to see someone else comparing themself to me",
      "created_utc": 1598352600.0,
      "score": 13,
      "context": [
        {
          "id": "g2scpd1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1598352111.0
        }
      ]
    }
  ]
}