{
  "id": "imxv6d",
  "subreddit": "AnorexiaNervosa",
  "author": "PixelPower0502",
  "created_utc": 1599295644.0,
  "title": "What disordered eating habits did you have pre-ED?",
  "selftext": "For me, I realized recently that for as long as I can remember I’ve eaten most of my food late at night to avoid people seeing me eat. Idek why. I have a lot of childhood trauma but none that I can remember specifically revolve around people seeing me eat. Did anyone else have disordered eating habits before developing your ED and what were they? I’m just in a curious mood.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/imxv6d/what_disordered_eating_habits_did_you_have_preed/",
  "score": 152,
  "num_comments": 80,
  "comments": [
    {
      "id": "g43vbpq",
      "author": "TheCrazyPsychiatrist",
      "body": "Eating rituals. For example I HAD to eat the crust off my sandwich before I could eat the rest. I also picked meals apart and would eat each component individually... So...super fucking weird",
      "created_utc": 1599302029.0,
      "score": 75,
      "context": []
    },
    {
      "id": "g43nqe6",
      "author": "Panic-atthepanic",
      "body": "I was never taught how to eat and so, uhm, I didn't realise most people had set meals. I lived off of chicken nuggets and chocolate bars for years.",
      "created_utc": 1599296336.0,
      "score": 53,
      "context": []
    },
    {
      "id": "g43s5mp",
      "author": "shark_robinson",
      "body": "I never had much awareness of hunger or fullness. I always wanted to eat more, and usually only stopped when the food ran out. I also used to hoard food and eat in secret. Don’t really know how or why the switch flipped so drastically from that to restricting but here we are lol",
      "created_utc": 1599300108.0,
      "score": 53,
      "context": []
    },
    {
      "id": "g444kh5",
      "author": "None",
      "body": "sooooo many. grew up in an abusive home with super damaged parents so they didn’t model healthy eating habits for me and also underfed me and restricted my food. when i was really little, i used to sneak into the kitchen and eat peanut butter out of the jar with my fingers then smooth it back out so there’d be no evidence bc i was starving but couldn’t have snacks. \n\ni wasn’t allowed junk food, so id trade away my whole lunch for a single pack of gushers or a cosmic brownie when i was in elementary school. i binged at bday parties, friends houses, and on Halloween candy (we only got to eat it for one night, the rest got put away and eventually thrown out). when i was 8 i started skipping lunch at school bc i wanted someone to notice smth was wrong w me and ask me if i was okay so i could say “no, im not”. that summer i would only eat like 3 things and had to make food for me and my 4 yo sis and i only let myself have 1 hot dog and 1 popsicle per day + whatever my dad would make for dinner. i also hoarded chocolate in my room after either Easter or Halloween. my parents were pissed when they found out. I also read nutrition labels as a kid bc my mom told me to. that’s all the specifics I can remember \n\nbut Ive always had secretive eating habits, shame and guilt around wanting/needing/asking for food to the point where if i didn’t have money for lunch i would just skip (my school had a program where you could still get a PB & J and they’d charge at the end of the month) and i would never ask my friends parents/my parents/my aunt for food no matter how hungry I was. but yeah maybe halfway through the school year when i was 8 i actually started developing anorexia and now here i am 🙃",
      "created_utc": 1599307414.0,
      "score": 28,
      "context": []
    },
    {
      "id": "g43wfxm",
      "author": "None",
      "body": "Calories counting, guilt after eating, distorted body image, constantly comparing myself to others. I’ve done this all since I was 6/7",
      "created_utc": 1599302737.0,
      "score": 26,
      "context": []
    },
    {
      "id": "g446tj8",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1599308731.0,
      "score": 24,
      "context": []
    },
    {
      "id": "g444cai",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1599307288.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g43senj",
      "author": "Westher98",
      "body": "I've never liked to be looked at while eating",
      "created_utc": 1599300265.0,
      "score": 15,
      "context": []
    },
    {
      "id": "g440uky",
      "author": "None",
      "body": "As a kid I had chronic stomachaches and eventually I assumed it was eating so that’s one thing that started it later on. I was underweight  as a kid and people would always comment which made me make my identity around being skinny. \n\nI feel I ate relatively intuitively and normally until puberty. Now 10 years later here we are! I wish I could’ve kept up normal eating bc having an ed makes life a bit less delightful and I’m tryna manifest a delightful ass life! just gotta let go of this shit but Idk what’s holding me back",
      "created_utc": 1599305351.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g4422u6",
      "author": "katfish4A4",
      "body": "Idk if this counts but I’d chew my food to the rythme of songs (I kinda assume that’s normal) which developed into counting chews of each bite",
      "created_utc": 1599306062.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g445b5o",
      "author": "maybe_nj",
      "body": "I used to, and still do sometimes, chew on random stuff to suppress my hunger. Like I'd keep a spoon in my mouth or chew on some gum that has low sugar",
      "created_utc": 1599307818.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g44a72h",
      "author": "thinkpozzy",
      "body": "I started throwing my lunches away by grade two, grade three I was skipping breakfast at my daycare too.\n\nEta I wanted to be thin even then.  I remember skipping meals because I wasnt the lightest girl in class, I hated people watching me eat, and I hated hearing someone tell my glorified babysitter that \"we were looking so HEALTHY now\" i've virtually anyways had a fucked up relationship with food.",
      "created_utc": 1599310937.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g4450r9",
      "author": "smallnpc",
      "body": "I wouldn’t eat anything like cake or pastry’s because they made my stomach feel too big. I would always eat off a small plate with a small fork and knife and all of my food had to be separated. But I guess I just learned all of that from my mam 😎",
      "created_utc": 1599307654.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g4403m6",
      "author": "annaannaana",
      "body": "i basically had orthorexia before it developed  into AN :( soooo clean eating?",
      "created_utc": 1599304901.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g446idk",
      "author": "dinonuggis",
      "body": "I have always been SUPER picky about my food. For example, if I had a plate full of different things and say something touched something else that it wasn’t supposed to and transferred something like juice/sauce/flavor/etc I would throw out or straight up not eat the bit/whole part that got “contaminated”. I also still to this day think A LOT if not most food is gross for their texture/flavor and I could make a much bigger list of food that I refuse to try/think is gross than food that I like even before I started caring about calories. I also never really ate breakfast (thanks school🙄). I also had to eat things in a certain order on my plate from “worst” to “best” iykwim.",
      "created_utc": 1599308513.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g446p6v",
      "author": "None",
      "body": "Unintentionally lost so much weight in fourth grade my parents made the doctor scare me and guilt me about it. Only made me worse off later on",
      "created_utc": 1599308650.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g448spv",
      "author": "LischenVonEngels",
      "body": "I was a section eater. Honestly though, I developed my ED when I was super young, so I don't really remember what my eating habits were like before that.",
      "created_utc": 1599310070.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g44kn12",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1599315841.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g45y8dk",
      "author": "ResilliantWarrior",
      "body": "Eating paper, tissue, grass, leaves and never eating breakfast or a small one (like a tbsp cereal or yoghurt or so or rarely snacking unless before bed.",
      "created_utc": 1599339526.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g449i4l",
      "author": "maonue",
      "body": "Yeah my sister has ARFID, I was a picky eater pre-AN. It got weirder because of the AN.",
      "created_utc": 1599310528.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g449kkr",
      "author": "mxmnators",
      "body": "for as long as i’ve lived, i’ve always eaten burgers/sandwiches/pizzas in a straight line(?) as in i’d take one normal-sized bite and then slowly eat the parts around it until there’s a horizontal line as if it was cut with a knife, rinse and repeat. very shortly before my ed began, i started eating pizza backwards (crust-first) as well. did that with sandwiches too, don’t know why.",
      "created_utc": 1599310569.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g44aodt",
      "author": "lilkurobitch",
      "body": "I was taught not to eat fatty food, like chicken skin, bacon, etc. by my mom, she would get mad if she found out my dad took me to Mcdonalds to have breakfast. I was given a fixed and portioned amount of food each meal if she cooked(she cooks food with a small amount of oil, sugar, and salt) and I needed to finish it even if I was fulled.",
      "created_utc": 1599311154.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g44jb5o",
      "author": "lookforspirals",
      "body": "I don't know if it's pre ED or the beginning but when I was a kid I started to like the feeling of being hungry and feel like being hungry meant I was good. I still have that now",
      "created_utc": 1599315235.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g44jgad",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1599315293.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g44klrj",
      "author": "Ironicbanana14",
      "body": "My mom let me grab whatever i want from the cabinet, so as a literal child of course im gonna grab candy and bad foods. So i got fat by the time i was age 8.\n\nI also have other trauma but not around food at all, so i guess that just gave me control issues and controlling what i eat was something i did for \"fun\" kinda? This was when i turned 14, i also never ate breakfast or lunch at school to avoid the cafeteria and people would see a fat person there and think \"ew she doesnt need to eat.\" At least that's how i felt.\n\nThen at 17 it really evolved into cycles of binging and restricting, i would eat really a lot for a week then i would restrict as long as i could.",
      "created_utc": 1599315825.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g453g9d",
      "author": "None",
      "body": "I have always had issues with textures/sensations and can't handle certain foods touching or being combined. Also if you put a bunch of foods on my plate as a kid, I would start at one and go around clockwise. No idea why.\n\nMy brother has a sensory processing disorder and I have ADD, so that may be some of the sensitivity to texture. But I strongly dislike the texture of hamburger and buns together unless the buns are toasted? So I didn't eat a hamburger until I was in my 30s. \n\nSweets/sodas were limited and if we wanted a soda, we also had to drink milk. I realize my mom was trying to install healthy habits (milk > soda) but by the time I had my soda I didn't really want the milk, and would have to drink it anyway or vice versa. We didn't have a lot of money and if I didn't get my soda, there was a chance there wouldn't be any (in my childish mind). \n\nI'm not sure if it's disordered behavior but I will cut the mold off things and eat them anyway. Saw my mom and Grandma doing it growing up.",
      "created_utc": 1599324356.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g457mi2",
      "author": "Ros3yteeth",
      "body": "I used to binge like a LOT it mainly stemmed from the fact that it was drilled in my head that I had to eat everything on my plate in order for it to not be a waste",
      "created_utc": 1599326643.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g459ynu",
      "author": "YearsOfGlitter",
      "body": "Before I had a clue about weight consciousness, when I was like 12, I bought slimfast shakes at the grocery store. I was a beanpole and wasn’t trying to lose weight. I have no idea what motivated that purchase. No one in my house and no families I knew used slimfast.",
      "created_utc": 1599327746.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g45imfl",
      "author": "Bossishlike",
      "body": "eating constantly to fill the void",
      "created_utc": 1599331944.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g45kkd6",
      "author": "moneysignsarah",
      "body": "My dad always gave me significantly smaller portions as a child than he gave to my sibilings because i was a different build, i guess. I was just taller, i wasn't really all that much 'bigger', not that it would matter if I was. \nAs i grew into being a teenager, I always ate with the smaller fork and spoon, fed myself smaller portions to adviod looks from my dad, and always looked for the smallest slice of pizza. \nMy dad contributed a lot to my troubled relationship with food, but I wouldn't say he contributed to my ED",
      "created_utc": 1599332899.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g448fje",
      "author": "SoftDreamer",
      "body": "I would read labels and I planned meal times far ahead and was kicking out lots of foods from my safe list",
      "created_utc": 1599309828.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g44fq3k",
      "author": "None",
      "body": "idk if this counts but i would always (and still do) cover my mouth with my hand when eating around other people",
      "created_utc": 1599313547.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g44m6sm",
      "author": "None",
      "body": "for me, i’ve always been able to eat a lot of food, considering that i’m a tall guy. still to this day i can eat pretty much infinitely, and it’s caused me a lot of stress. \n\nbut now instead of just eating a lot of food all the time and feeling happy, i do the same thing maybe once a month or two and then feel guilty about it for ages",
      "created_utc": 1599316536.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g44zfnm",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1599322302.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g4510pw",
      "author": "None",
      "body": "None of my food could be touching each other on the plate and I would eat one thing, in bulk, for days on end.",
      "created_utc": 1599323036.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g4516y9",
      "author": "None",
      "body": "This whole thread really does bring me comfort. Thanks for sharing, y’all. I related to most of these. ❤️",
      "created_utc": 1599323121.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g451fsj",
      "author": "brookleiaway",
      "body": "I’ve never had a good relationship with food. Even when I was eating healthy non restrictive meals with one or two cheat days a week I was always craving more unhealthy food, or just more food in general, so I figured it will always be this way and I’ll just lose weight faster",
      "created_utc": 1599323245.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g45s1kl",
      "author": "None",
      "body": "My Ed started when I was in my teens, but even before then I used to try to run around my garage because kids in gym class made fun of how I run and I was too afraid to run outside (because people might see and make fun of me). I thought I was \"practicing\" running.\n\nAnd then when my Ed started I developed a major exercise addiction.",
      "created_utc": 1599336587.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g45s9xh",
      "author": "atof3",
      "body": "Oh God yes! I didn't eat in public for like a year straight in high school because I was so embarrassed and I was convinced someone would make a comment about me eating. Calorie counting since forever. Sleeping to avoid eating. Always leaving a bite of something on the plate and just generally never finishing food in public. The list goes on lol",
      "created_utc": 1599336689.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g4648w4",
      "author": "depressedbitch202",
      "body": "skipping breakfast and chewing on paper",
      "created_utc": 1599342448.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g465iav",
      "author": "None",
      "body": "i would eat anything that my mum claimed as healthy and not eat the things she claimed as unhealthy.",
      "created_utc": 1599342890.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g46ddc9",
      "author": "stellarsunset",
      "body": "small bites...i try to justify it by saying i’m just savoring my food",
      "created_utc": 1599346858.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g44c6jp",
      "author": "_ghostie_toastie_",
      "body": "i would try to see how long i could go without eating in a day. i wouldn't eat until dinner usually and then around that time id get in all the calories i needed (i didnt know calories were a thing)",
      "created_utc": 1599311861.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g44mckb",
      "author": "breathelikeatree",
      "body": "I don’t know if this is “disordered eating” but I would never dip my food in any sauce and if I did, I used it sparingly. I knew about empty calories as a kid and I was taught that they were bad, but I thought that sauce was empty calories, so I never used it",
      "created_utc": 1599316604.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g459et3",
      "author": "EnvironmentalRope6",
      "body": "I used to not eat the ends of things? So like I would leave the end of a chicken tender or the end of a hot dog. So at the end I would just have all these little bits of everything I ate remaining on my plate that I wouldn't finish. I guess it made me feel good to not fully finish my food but still make it look like to my parents that I at least ate some of everything??",
      "created_utc": 1599327484.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g46jr1o",
      "author": "hnr-2000",
      "body": "I skipped meals long before it became a problem for me. Never really ate breakfast from the age of like 10 onwards. Then stopped eating lunch at 12. It didn’t become a problem until I was about 14 though. Before that I would still eat everything in sight haha. I also won’t mix foods and am weird with textures. I’ve always been fussy so I’ve kind of always been ‘afraid’ of food",
      "created_utc": 1599349895.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g46o5ah",
      "author": "tssclay",
      "body": "well i had bed all my life before i restricted. only ate processed foods and never anything healthy.",
      "created_utc": 1599352027.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g47yuo0",
      "author": "Awkward_Gxrl",
      "body": "Constantly body checking before, during and after meals. This one is rare af, but around the time to eat I was constantly thinking about my body and worried about it. Even if there wasn't a mirror near, I focused on how tight the clothes were, I pinched my belly etc.\n\nI used that behaviour in my first steps to labelling food as bad or good depending on a bloated-saciety ratio, being the bad foods the ones that made me feel bloated before saciated , and good foods the ones that made me feel saciated before full.",
      "created_utc": 1599389796.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g47yx3x",
      "author": "TrontBeznor",
      "body": "Tucked in my shirts since eighth grade to make me look skinnier. Now I still do it out of habit and look like a nerd constantly. I even do it with sweat pants...",
      "created_utc": 1599389869.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4ej052",
      "author": "MLQC-Atherosclerosis",
      "body": "Uh idk what part of my life was pre-ED. I kinda went from ARFID to AN-R. So I never ate anything new except for like 10-15 foods and I only liked them a specific way. I never even liked food or eating and I always got in trouble starting preschool all the way to high school for never eating lunch. It was so weird that everyone else was always like can I have your food? And I was like sure",
      "created_utc": 1599531605.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4k58px",
      "author": "lmkast",
      "body": "I actually had an overeating problem before I developed my anorexia. Growing up I always used eating as a coping mechanism for almost any emotion or experience. It basically just switched to the other extreme at some point.",
      "created_utc": 1599668546.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9jrixr",
      "author": "SkinnyPeach99",
      "body": "I have no clue when my disordered eating became an eating disorder. Ever since I can remember, my food can’t touch unless it’s supposed to (if rice is served and chicken is served, they can’t touch, but if the chicken is in a curry that supposed to go on top of the rice then it’s okay), I eat each food entirely before moving on to the next, and I always eat my protein last and vegetables first. I stopped eating breakfast in grade 6 cuz it was inconvenient and lunch in grade 9 cuz I spent lunch studying in the library where they didn’t allow food anyways. I would basically fast from midnight snack until the next day at 4 when I got home from school and I would binge, didn’t even realize it. Always had a weird relationship with food from my mum constantly labeling and relabeling foods as good or bad, and forcing my sister and I to follow her diets as she did vegan then no carbs then pescatarian then keto then vegetarian then paleo then raw vegan it never ended and they never lasted longer than a month or two. She would eat very little during the day and an entire bag of chips each night and I learned to eat like that because of her too",
      "created_utc": 1603293902.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g43vk47",
      "author": "PixelPower0502",
      "body": "Omg I didn’t even think of that! I used to eat lunchables like one at a time. Crackers then meat then cheese and my food absolutely could not touch other food on my plate",
      "created_utc": 1599302175.0,
      "score": 27,
      "context": [
        {
          "id": "g43vbpq",
          "author": "TheCrazyPsychiatrist",
          "body": "Eating rituals. For example I HAD to eat the crust off my sandwich before I could eat the rest. I also picked meals apart and would eat each component individually... So...super fucking weird",
          "created_utc": 1599302029.0
        }
      ]
    },
    {
      "id": "g447s1u",
      "author": "erinthefatcat",
      "body": "Wait this is like me making sure my “ratio” of every portion of my meal was eaten correctly so I would be able to eat everything if that makes sense",
      "created_utc": 1599309392.0,
      "score": 25,
      "context": [
        {
          "id": "g43vbpq",
          "author": "TheCrazyPsychiatrist",
          "body": "Eating rituals. For example I HAD to eat the crust off my sandwich before I could eat the rest. I also picked meals apart and would eat each component individually... So...super fucking weird",
          "created_utc": 1599302029.0
        }
      ]
    },
    {
      "id": "g449494",
      "author": "Bear2Pants",
      "body": "Same here! I couldn't mix vegetables with mashed potatoes etc. I absolutely hated shepherds pie for this reason.",
      "created_utc": 1599310280.0,
      "score": 8,
      "context": [
        {
          "id": "g43vbpq",
          "author": "TheCrazyPsychiatrist",
          "body": "Eating rituals. For example I HAD to eat the crust off my sandwich before I could eat the rest. I also picked meals apart and would eat each component individually... So...super fucking weird",
          "created_utc": 1599302029.0
        }
      ]
    },
    {
      "id": "g44l0cb",
      "author": "Ironicbanana14",
      "body": "Wait what? This is disordered eating?!\n\nI never could have anything else touching on my plate, and i would eat counterclockwise starting from the vegetables or whatever was the least good.",
      "created_utc": 1599316014.0,
      "score": 5,
      "context": [
        {
          "id": "g43vbpq",
          "author": "TheCrazyPsychiatrist",
          "body": "Eating rituals. For example I HAD to eat the crust off my sandwich before I could eat the rest. I also picked meals apart and would eat each component individually... So...super fucking weird",
          "created_utc": 1599302029.0
        }
      ]
    },
    {
      "id": "g44kvqf",
      "author": "Ironicbanana14",
      "body": "My little cousins are like this, they'll choose ramen noodles, chicken nuggets, hot cheetos, over a home cooked meal i made them. Their parents work so much that they just feed themselves. One time my cousin pulled a hot bowl of ramen from the microwave and spilled it all over her thighs, yeah nice hospital trip with a 8 year old with a huge burn.",
      "created_utc": 1599315952.0,
      "score": 15,
      "context": [
        {
          "id": "g43nqe6",
          "author": "Panic-atthepanic",
          "body": "I was never taught how to eat and so, uhm, I didn't realise most people had set meals. I lived off of chicken nuggets and chocolate bars for years.",
          "created_utc": 1599296336.0
        }
      ]
    },
    {
      "id": "g450mdx",
      "author": "InfernalCoconut",
      "body": "Dude this. My mom was the “anti-Martha-Stewart” and hater cooking. A lot of my meals were cheese dip and crackers or cold scraps of leftovers from where ever she went to dinner that I had to fight my brother for.",
      "created_utc": 1599322853.0,
      "score": 8,
      "context": [
        {
          "id": "g43nqe6",
          "author": "Panic-atthepanic",
          "body": "I was never taught how to eat and so, uhm, I didn't realise most people had set meals. I lived off of chicken nuggets and chocolate bars for years.",
          "created_utc": 1599296336.0
        }
      ]
    },
    {
      "id": "g44heq3",
      "author": "withonlygrace",
      "body": "I was the same way! If food was around, I would eat it. I never learned comfortably satiated, I would just eat and eat and eat until I was stuffed. (I still do this when I’m drunk, I just purge after 😣) when I’m sober I have more self control but in the opposite direction lol.",
      "created_utc": 1599314360.0,
      "score": 13,
      "context": [
        {
          "id": "g43s5mp",
          "author": "shark_robinson",
          "body": "I never had much awareness of hunger or fullness. I always wanted to eat more, and usually only stopped when the food ran out. I also used to hoard food and eat in secret. Don’t really know how or why the switch flipped so drastically from that to restricting but here we are lol",
          "created_utc": 1599300108.0
        }
      ]
    },
    {
      "id": "g45a9wl",
      "author": "None",
      "body": "Are you me? Though personally the switch flipped in 6th or 7th grade when I truly realised how overweight I was, especially with the bullying, and here we are now folks",
      "created_utc": 1599327896.0,
      "score": 7,
      "context": [
        {
          "id": "g43s5mp",
          "author": "shark_robinson",
          "body": "I never had much awareness of hunger or fullness. I always wanted to eat more, and usually only stopped when the food ran out. I also used to hoard food and eat in secret. Don’t really know how or why the switch flipped so drastically from that to restricting but here we are lol",
          "created_utc": 1599300108.0
        }
      ]
    },
    {
      "id": "g45d69s",
      "author": "Panic-atthepanic",
      "body": "Also guilty of this myself....",
      "created_utc": 1599329280.0,
      "score": 6,
      "context": [
        {
          "id": "g43s5mp",
          "author": "shark_robinson",
          "body": "I never had much awareness of hunger or fullness. I always wanted to eat more, and usually only stopped when the food ran out. I also used to hoard food and eat in secret. Don’t really know how or why the switch flipped so drastically from that to restricting but here we are lol",
          "created_utc": 1599300108.0
        }
      ]
    },
    {
      "id": "g44mdq6",
      "author": "None",
      "body": "i lucked out that i never learned about calories until i was a senior in high school. would’ve fucked me over a lot more if i had learned about them much earlier",
      "created_utc": 1599316617.0,
      "score": 10,
      "context": [
        {
          "id": "g43wfxm",
          "author": "None",
          "body": "Calories counting, guilt after eating, distorted body image, constantly comparing myself to others. I’ve done this all since I was 6/7",
          "created_utc": 1599302737.0
        }
      ]
    },
    {
      "id": "g45110b",
      "author": "InfernalCoconut",
      "body": "I started meal replacing with slim fast shakes when I was 9/10 because it was the 90s and my mom did it.",
      "created_utc": 1599323040.0,
      "score": 6,
      "context": [
        {
          "id": "g43wfxm",
          "author": "None",
          "body": "Calories counting, guilt after eating, distorted body image, constantly comparing myself to others. I’ve done this all since I was 6/7",
          "created_utc": 1599302737.0
        }
      ]
    },
    {
      "id": "g449fop",
      "author": "xleabrax",
      "body": "I would say I’ve always been on the ‘larger side’ ever since I went into secondary school/was feeding myself - I did EXACTLY this, I never ate breakfast only when I was doing exams - sometimes I wouldn’t eat all day (this was because I was embarrassed and breaks were very short at my school) until I came home from school, ate my lunch and just raid the cupboards and eat all my dinner sometimes even more! I think this was because I was very stressed about school but also was genuinely happy with my relationship at the time (food does make me happy despite having an ED) but I suppose I was unintentionally intermittent fasting haha I developed an ED this year due to extreme weight loss and my perception of food is more than whack lol",
      "created_utc": 1599310486.0,
      "score": 12,
      "context": [
        {
          "id": "g446tj8",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599308731.0
        }
      ]
    },
    {
      "id": "g4605sw",
      "author": "etuvie27",
      "body": "This timeline is scarily accurate. I literally could not finish my meals and would take forever just eating half. I was super picky and hated the process of chewing and swallowing (?). I would complain about how full I was (more like just bored sitting at the table \"forced\" to eat) and my parents got mad that I was still eating and they had finished the dishes already. I hated eating in front of people and still do. When I was older, I turned to food as a source of comfort. Right now, I'm trying to tune into my natural intuitive behaviour but it's hard.",
      "created_utc": 1599340466.0,
      "score": 4,
      "context": [
        {
          "id": "g444cai",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599307288.0
        }
      ]
    },
    {
      "id": "g47k1ec",
      "author": "Shadowed-Heart",
      "body": "rule 10",
      "created_utc": 1599374130.0,
      "score": 2,
      "context": [
        {
          "id": "g444cai",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599307288.0
        }
      ]
    },
    {
      "id": "g4ikn45",
      "author": "None",
      "body": "Or toothpicks",
      "created_utc": 1599624233.0,
      "score": 1,
      "context": [
        {
          "id": "g445b5o",
          "author": "maybe_nj",
          "body": "I used to, and still do sometimes, chew on random stuff to suppress my hunger. Like I'd keep a spoon in my mouth or chew on some gum that has low sugar",
          "created_utc": 1599307818.0
        }
      ]
    },
    {
      "id": "g45nv1a",
      "author": "PixelPower0502",
      "body": "Oh I feel that. Pasta was my safe food for sooo long. It’s recently shifted over to rice because it’s easier to measure out exactly",
      "created_utc": 1599334525.0,
      "score": 5,
      "context": [
        {
          "id": "g44kn12",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599315841.0
        }
      ]
    },
    {
      "id": "g4ikrlb",
      "author": "None",
      "body": "Pasta and coffee are the shit",
      "created_utc": 1599624318.0,
      "score": 2,
      "context": [
        {
          "id": "g44kn12",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599315841.0
        }
      ]
    },
    {
      "id": "g476x1b",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1599363336.0,
      "score": 1,
      "context": [
        {
          "id": "g44jgad",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599315293.0
        }
      ]
    },
    {
      "id": "g47jzvs",
      "author": "Shadowed-Heart",
      "body": "rule 10",
      "created_utc": 1599374090.0,
      "score": 1,
      "context": [
        {
          "id": "g44zfnm",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599322302.0
        }
      ]
    },
    {
      "id": "g45o7n9",
      "author": "PixelPower0502",
      "body": "Yeah even now I tend to have a rolling “safe food” list. I’ll find one thing that’s okay for me to eat and pretty much only eat that for days/weeks on end and then it’ll slowly shift to something else and rinse, repeat",
      "created_utc": 1599334695.0,
      "score": 4,
      "context": [
        {
          "id": "g4510pw",
          "author": "None",
          "body": "None of my food could be touching each other on the plate and I would eat one thing, in bulk, for days on end.",
          "created_utc": 1599323036.0
        }
      ]
    },
    {
      "id": "g4i08cm",
      "author": "PixelPower0502",
      "body": "I feel like maybe I’m dumb for this...but what is AN-R?",
      "created_utc": 1599612266.0,
      "score": 1,
      "context": [
        {
          "id": "g4ej052",
          "author": "MLQC-Atherosclerosis",
          "body": "Uh idk what part of my life was pre-ED. I kinda went from ARFID to AN-R. So I never ate anything new except for like 10-15 foods and I only liked them a specific way. I never even liked food or eating and I always got in trouble starting preschool all the way to high school for never eating lunch. It was so weird that everyone else was always like can I have your food? And I was like sure",
          "created_utc": 1599531605.0
        }
      ]
    },
    {
      "id": "g44912n",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1599310222.0,
      "score": 11,
      "context": [
        {
          "id": "g43vbpq",
          "author": "TheCrazyPsychiatrist",
          "body": "Eating rituals. For example I HAD to eat the crust off my sandwich before I could eat the rest. I also picked meals apart and would eat each component individually... So...super fucking weird",
          "created_utc": 1599302029.0
        },
        {
          "id": "g447s1u",
          "author": "erinthefatcat",
          "body": "Wait this is like me making sure my “ratio” of every portion of my meal was eaten correctly so I would be able to eat everything if that makes sense",
          "created_utc": 1599309392.0
        }
      ]
    },
    {
      "id": "g455vmr",
      "author": "None",
      "body": "That’s awful, my parents never engaged with diet culture and no one I spent time with did. Mine was purely a societal influences that screwed me",
      "created_utc": 1599325709.0,
      "score": 6,
      "context": [
        {
          "id": "g43wfxm",
          "author": "None",
          "body": "Calories counting, guilt after eating, distorted body image, constantly comparing myself to others. I’ve done this all since I was 6/7",
          "created_utc": 1599302737.0
        },
        {
          "id": "g45110b",
          "author": "InfernalCoconut",
          "body": "I started meal replacing with slim fast shakes when I was 9/10 because it was the 90s and my mom did it.",
          "created_utc": 1599323040.0
        }
      ]
    },
    {
      "id": "g47pba5",
      "author": "None",
      "body": "Completely forgot, I edited my comment, but I think the time numbers are okay??",
      "created_utc": 1599379404.0,
      "score": 1,
      "context": [
        {
          "id": "g444cai",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599307288.0
        },
        {
          "id": "g47k1ec",
          "author": "Shadowed-Heart",
          "body": "rule 10",
          "created_utc": 1599374130.0
        }
      ]
    },
    {
      "id": "g47k0o1",
      "author": "Shadowed-Heart",
      "body": "rule 10",
      "created_utc": 1599374111.0,
      "score": 1,
      "context": [
        {
          "id": "g44jgad",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599315293.0
        },
        {
          "id": "g476x1b",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599363336.0
        }
      ]
    },
    {
      "id": "g488dy9",
      "author": "InfernalCoconut",
      "body": "Edited.",
      "created_utc": 1599398377.0,
      "score": 1,
      "context": [
        {
          "id": "g44zfnm",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599322302.0
        },
        {
          "id": "g47jzvs",
          "author": "Shadowed-Heart",
          "body": "rule 10",
          "created_utc": 1599374090.0
        }
      ]
    },
    {
      "id": "g4495z9",
      "author": "erinthefatcat",
      "body": "Not sure but I’m hella ocd about it",
      "created_utc": 1599310312.0,
      "score": 5,
      "context": [
        {
          "id": "g43vbpq",
          "author": "TheCrazyPsychiatrist",
          "body": "Eating rituals. For example I HAD to eat the crust off my sandwich before I could eat the rest. I also picked meals apart and would eat each component individually... So...super fucking weird",
          "created_utc": 1599302029.0
        },
        {
          "id": "g447s1u",
          "author": "erinthefatcat",
          "body": "Wait this is like me making sure my “ratio” of every portion of my meal was eaten correctly so I would be able to eat everything if that makes sense",
          "created_utc": 1599309392.0
        },
        {
          "id": "g44912n",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599310222.0
        }
      ]
    },
    {
      "id": "g47tp1y",
      "author": "Lismale",
      "body": "sorry. I forgot. I fixed it",
      "created_utc": 1599384147.0,
      "score": 1,
      "context": [
        {
          "id": "g44jgad",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599315293.0
        },
        {
          "id": "g476x1b",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1599363336.0
        },
        {
          "id": "g47k0o1",
          "author": "Shadowed-Heart",
          "body": "rule 10",
          "created_utc": 1599374111.0
        }
      ]
    }
  ]
}