{
  "id": "infc2l",
  "subreddit": "AnorexiaNervosa",
  "author": "fundamentallylikable",
  "created_utc": 1599364511.0,
  "title": "Me",
  "selftext": "",
  "url": "https://i.redd.it/m7v8ltbbagl51.jpg",
  "score": 607,
  "num_comments": 6,
  "comments": [
    {
      "id": "g47lrkd",
      "author": "That1weirdperson",
      "body": "And then my family or bf gets upset >:(",
      "created_utc": 1599375788.0,
      "score": 15,
      "context": []
    },
    {
      "id": "g484bua",
      "author": "None",
      "body": "cue the chorus of “you’re not fat!” from everyone i know.\n\nlike bitch i know i’m not fat but at the same time when i look in a mirror my brain tells me fat",
      "created_utc": 1599395149.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g47rqsc",
      "author": "juniorasparagus13",
      "body": "I also do this when I walk past trash cans...",
      "created_utc": 1599382010.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g47gv58",
      "author": "Electronic_Syrup",
      "body": "its tru (:",
      "created_utc": 1599371144.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g487xdr",
      "author": "fuschiaoctopus",
      "body": "Oh man, I'm not trying to be a jerk cause I get why people do this and it usually stems from low self esteem or mental issues but I find it SO awkward when people do this. I typically am like \"oh uh.. haha..\" and change the subject but some people honestly get really upset if you don't give them what they're going for and adamantly deny that they are fat/ugly/dumb/whatever they're saying they are. \n\nI try not to play along and insist they're not fat etc because I feel it encourages this behavior and it puts the other person in SUCH an awkward position, even worse when they start arguing with you and basically force you to go hard on validating them. If a good friend with known low self esteem does this once I may play along (though if they drag it out by arguing I will change the subject, sorry but it's awkward especially when they are CLEARLY not fat or ugly) but typically people who do this tend to do it a lot and the only way to stop it is to not validate. But often that makes you look like a dick or subconsciously upsets them because they fully expected you to have to argue that they are so skinni and when you don't it's like an insult. But it shouldn't be.",
      "created_utc": 1599398047.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g49g4tm",
      "author": "Slytherian2020",
      "body": "I have been struggling so much with this lately. My Mom is obsessed with her own weight and doesn't see it but as soon as she notices I have lost weight all the sudden I get a three hour lecture about how I'm not fat and I need to eat but at the same time she tells me things like well your metabolism is slowing down so you shouldn't eat a,b,c........ And I feel even worse when she makes me eat something",
      "created_utc": 1599421610.0,
      "score": 1,
      "context": []
    }
  ]
}