{
  "id": "itk9zt",
  "subreddit": "AnorexiaNervosa",
  "author": "rachrachcalero",
  "created_utc": 1600212961.0,
  "title": "I’m so tired",
  "selftext": "I’m just so tired...I don’t want to do anything anymore. I’m tired of sitting through lectures, I’m tired of thinking about money, my weight, my grades, my intake, my gross pudgy looking body, my inability to be who I want to be. I don’t even want to be better. I wish I was worse , I wish I didn’t relapse?? But I’m glad I did...but I know that’s wrong. But I’m just so tired",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/itk9zt/im_so_tired/",
  "score": 109,
  "num_comments": 7,
  "comments": [
    {
      "id": "g5f5492",
      "author": "tssclay",
      "body": "i know. it’s so exhausting to live already and then mental and physical issues just makes it 50x worse. :(",
      "created_utc": 1600215433.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g5ftves",
      "author": "None",
      "body": "I relate to this on a whole new level :( sending you a lot of hugs",
      "created_utc": 1600228988.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g5hcnw6",
      "author": "mama_candy",
      "body": "It's time to silence the noise and be one with the universe. I believe in you. ❤",
      "created_utc": 1600271733.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g5fym3e",
      "author": "Silver_Oakleaf",
      "body": "Can relate, the exhaustion is real :(",
      "created_utc": 1600232219.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g5j95c6",
      "author": "rachrachcalero",
      "body": "Thank you to everyone who commented. I feel less alone where I am, thank you for caring as much as you do. It feels like such a horrid secret and even being able to have this environment makes me feel okayish again. I have to take what I said back, I can’t be happy about my relapse , I know I can’t. \nNo one should feel this way, I hope you all are okay and while I know everyday is a constant internal battle of x y and z, I know you’ve all got this. I know you’re stronger than the things in your head that tell you otherwise. I have so much faith in all of you here. Every step toward recovery is so wonderful and I’m so proud of everyone who’s trying their best even on their worst days. Much love, always <3",
      "created_utc": 1600304562.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g5le50p",
      "author": "col_der",
      "body": "Staying in your ED will just make you more tired.",
      "created_utc": 1600356614.0,
      "score": 1,
      "context": []
    }
  ]
}