{
  "id": "iv2i0c",
  "subreddit": "AnorexiaNervosa",
  "author": "scrumptiousharibo27",
  "created_utc": 1600419016.0,
  "title": "Opinions on timeline photos?",
  "selftext": "i don't want this to come across as rude in any way, but seeing all of these timeline photos is SO DAMN TRIGGERING.\n\ni am beyond happy that you're not as sick and malnourished as you used to be, i'm so glad that you're doing better and you've recovered.\n\nbut is it really necessary to show us a picture of what you looked like at your lowest, sickest weight? no, it's really fucking not.\n\nwhat is it for, to validate yourself? to show others that you got to a super low weight? congrats, you're one of many!! i know anorexia is competitive, but if you're \"recovered\" and still needing to prove that you were ever sick enough then you're not truly recovered. we don't need to compare ourselves, we're all fucking ill over here.\n\ni'm sorry, but i don't want to see it and it's just so negative for me. i don't mean to be rude but i keep seeing them pop up everywhere and it is the most triggering thing ever.\n\nthank you for the awards, kind strangers!! <3",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/iv2i0c/opinions_on_timeline_photos/",
  "score": 172,
  "num_comments": 26,
  "comments": [
    {
      "id": "g5p9azy",
      "author": "None",
      "body": "Oh my GOD I never understood that. “Im recovered heres me at bmi 10 omg so sick” bruh if you had an ED you know that’s not motivation to us it’s fucking thinspo 💀💀💀",
      "created_utc": 1600436846.0,
      "score": 62,
      "context": []
    },
    {
      "id": "g5p7317",
      "author": "empanada_de_queso",
      "body": "Considering the sub we’re in, I totally agree with you. People suffering from anorexia are just going to compare themselves to the pictures. Am I skinnier than this girl? Can I get that skinny? Am I really anorexic if I’m not as skinny as her? And also, people suffering from anorexia look at those before photos and think they look good. We’re not going to think you look healthier now or whatever, the anorexic mind is not a healthy mind. We’re going to think you used to look great and now (that you’re healthy and recovered) you look kind of chubby. I’m not saying it’s right, I’m saying that’s how our minds work sometimes. I see those side by side pictures and I don’t think wow she looks so healthy now, I think damn, I don’t want to recover if it means I’ll get like that. It’s brutal, but that’s how at least my anorexic mind works",
      "created_utc": 1600435553.0,
      "score": 58,
      "context": []
    },
    {
      "id": "g5qa48q",
      "author": "spaghettieggrolls",
      "body": "Yeah I hate those before and after photos. I've seen some people only post an after photo and I really appreciate that.\n\nI really don't understand it. Personally I can hardly bring myself to look at my before pictures because it's really triggering. I have heard some people find it motivating, and that's totally valid, but maybe at least put a NSFW filter and give a TW? I've heard some people say that TWs don't work on people with EDs but that's not entirely true. Since I've been in recovery I definitely make an effort to avoid anything with a TW. Let people decide what they wanna see.",
      "created_utc": 1600454784.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g5rz9ge",
      "author": "Shadowed-Heart",
      "body": "I will be putting up a vote-post. However, understand this: while we don't endourage or condone pro-ed behaviors, and do our best by removing rule 10 breaks, this isn't JUST a recovery subreddit for only those in recovery. We're a support subreddit for most everyone with this eating disorder or similar, and thus I feel that showing the stages of recovery are necessary for some people. \n\nI may implement a clause that says you have to post timeline posts as multiple photos, and with the fully recovered one first while making it OBVIOUS that that is you while recovered, and not a \"before ed\" photo. This way people can still have timeline photos but those that find them triggering have the choice between swiping through or not, and won't see it outright. \n\nWhile I understand that it may be harder not to swipe to the next picture, we try not to baby people on this subreddit. It should ultimately be your own choice and not everything remotely triggering should have to be taken away or completely censored. \n\nSorry if this makes no sense - I guess this is the prelude to the upcoming post.",
      "created_utc": 1600484877.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g5ora6n",
      "author": "Aye_ItsA_Throwaway",
      "body": "I agree 100%. also with those \"my ED story\" videos that include pictures of low weights / bodychecks are so invalidating and triggering",
      "created_utc": 1600422175.0,
      "score": 41,
      "context": []
    },
    {
      "id": "g5pxubo",
      "author": "yedynoinvel",
      "body": "I personally don’t mind seeing them but it would be better if they were marked nsfw or something",
      "created_utc": 1600448769.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g5qltql",
      "author": "fuschiaoctopus",
      "body": "I would not have an issue if the people posting these could be a bit more vigilant about tagging them properly. I have had these posts (some very recently) pop up on my regular feed displaying the picture of somebody's LW. Tag it appropriately please so it does not involuntarily show up on our feeds without the pic hidden/optional. Do not wait for a mod to tag it for you - people have already had to see it by then as its been up for hours. There is no way to not see these pictures except unfollowing the whole sub if you do not tag them.\n\nIt's also really annoying when people post these LW first on instagram (always LW first of course, so we can't have the option to not swipe and not see it) without tagging it or make their LW pics the thumbnail on a YouTube video so people have no choice but to be exposed. Not tactful at all and comes off badly, like you're proud of it and want to make everybody see how UwUuw small you were.",
      "created_utc": 1600460551.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g5ozeo7",
      "author": "_justmaybe",
      "body": "Yes, those damn timeline photos are triggering for me as well, that's why I try not to look at them..",
      "created_utc": 1600430275.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g5poc12",
      "author": "None",
      "body": "I’d prefer it on a recovery sub, because we typically have the tools and resources we need if we do see triggering content-or at least a NSFW TW tag. I’m so proud of those recovering, but personally I could never bring myself to show photos at my worst because I know younger me would’ve been all over that and obsessing on how to get sicker. Be mindful, I guess. This isn’t a strictly recovered sub, it’s a sub full of so many people on so many different paths.",
      "created_utc": 1600444583.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g5qm7oe",
      "author": "None",
      "body": "same :/ i've considered leaving the sub cause seeing them is pretty upsetting to me. i'm taking baby recovery steps and seeing things like that really sets me back",
      "created_utc": 1600460722.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g5r9g7d",
      "author": "21J21W21",
      "body": "I see a person at a healthy weight and think that’s great for them and they look good, but I don’t want to look like that.",
      "created_utc": 1600471980.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g5pqito",
      "author": "SoftDreamer",
      "body": "They give a faint of hope but my ED says:\n\n“You’ll never look like this if you recovered. You’d become morbidly obese”",
      "created_utc": 1600445538.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g5rbk5y",
      "author": "Jayayaje",
      "body": "Omg thank you\n\nThey are so triggering especially when the after pictures are still skinny af and smaller than me :/",
      "created_utc": 1600473148.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g5pb4g4",
      "author": "None",
      "body": "I recently posted a timeline photo. Some people find them helpful because they provide an example of how much progress can be made; everyone interprets them subjectively and not everyone is triggered by seeing comparison pictures.\n\nWhen I was at my worst, seeing timelines was inspiring because it highlighted my own sickness, whilst also motivating me to make positive change. I fully recognise that people frequently find them damaging, but sometimes other mental illnesses can be alleviated by showing a positive timeline.\n\nIf a person had depression, and showed themselves in the worst possible psychological and physical state, then compared that to today, when they were thriving, this may provide huge motivation for other people. It's all about the way that we interpret the photos, and I acknowledge that anorexia massively warps the mind, but sometimes these images are seen in a positive light.",
      "created_utc": 1600437861.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g5owl0z",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1600427874.0,
      "score": -20,
      "context": []
    },
    {
      "id": "g5p2vfj",
      "author": "ihearprettycolors",
      "body": "Then don't watch them?",
      "created_utc": 1600432842.0,
      "score": -10,
      "context": [
        {
          "id": "g5ora6n",
          "author": "Aye_ItsA_Throwaway",
          "body": "I agree 100%. also with those \"my ED story\" videos that include pictures of low weights / bodychecks are so invalidating and triggering",
          "created_utc": 1600422175.0
        }
      ]
    },
    {
      "id": "g5qakzu",
      "author": "spaghettieggrolls",
      "body": "Yeah I'm personally not a fan of them but I can totally understand how someone recovering would find them inspiring. As long as there's a NSFW and a TW then I think it's totally fine to post them and could possibly help them.",
      "created_utc": 1600455023.0,
      "score": 3,
      "context": [
        {
          "id": "g5pb4g4",
          "author": "None",
          "body": "I recently posted a timeline photo. Some people find them helpful because they provide an example of how much progress can be made; everyone interprets them subjectively and not everyone is triggered by seeing comparison pictures.\n\nWhen I was at my worst, seeing timelines was inspiring because it highlighted my own sickness, whilst also motivating me to make positive change. I fully recognise that people frequently find them damaging, but sometimes other mental illnesses can be alleviated by showing a positive timeline.\n\nIf a person had depression, and showed themselves in the worst possible psychological and physical state, then compared that to today, when they were thriving, this may provide huge motivation for other people. It's all about the way that we interpret the photos, and I acknowledge that anorexia massively warps the mind, but sometimes these images are seen in a positive light.",
          "created_utc": 1600437861.0
        }
      ]
    },
    {
      "id": "g5oybtu",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600429391.0,
      "score": 14,
      "context": [
        {
          "id": "g5owl0z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1600427874.0
        }
      ]
    },
    {
      "id": "g5roxcv",
      "author": "peachaleach",
      "body": "OP isn't spreading hate. She expressing frustration that people who are actively posting without regard for the negative impact they know it can have on others, not even showing enough consideration to tag the post in way that allows people to have the choice to avoid something triggering. \n\nBefore/afters and low-weight photos are very common triggers. It's pretty reasonable to ask those in the community - whether in recovery or not - to not post (or at the very least tag correctly) those photos. \n\nRecovery is possible and it's very possible to share your pride in your recovery without sharing a photo of your underweight/sick body (or any picture of your body at all tbh)",
      "created_utc": 1600480060.0,
      "score": 2,
      "context": [
        {
          "id": "g5owl0z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1600427874.0
        }
      ]
    },
    {
      "id": "g5r3f0k",
      "author": "Aye_ItsA_Throwaway",
      "body": "they show up in my recommended consistently no matter how much I try to get them out. I don't watch them but seeing the thumbnail is enough to be triggered",
      "created_utc": 1600468542.0,
      "score": 3,
      "context": [
        {
          "id": "g5ora6n",
          "author": "Aye_ItsA_Throwaway",
          "body": "I agree 100%. also with those \"my ED story\" videos that include pictures of low weights / bodychecks are so invalidating and triggering",
          "created_utc": 1600422175.0
        },
        {
          "id": "g5p2vfj",
          "author": "ihearprettycolors",
          "body": "Then don't watch them?",
          "created_utc": 1600432842.0
        }
      ]
    },
    {
      "id": "g5p2twc",
      "author": "ihearprettycolors",
      "body": "How can someone truly tell their story by erasing the worst part of it? Showing the lowest weight pictures are necessary because they are apart of the person's past and prove how far they've come. If you don't want to see it, don't look.",
      "created_utc": 1600432812.0,
      "score": -7,
      "context": [
        {
          "id": "g5owl0z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1600427874.0
        },
        {
          "id": "g5oybtu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600429391.0
        }
      ]
    },
    {
      "id": "g5p9fre",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1600436920.0,
      "score": 11,
      "context": [
        {
          "id": "g5owl0z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1600427874.0
        },
        {
          "id": "g5oybtu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600429391.0
        },
        {
          "id": "g5p2twc",
          "author": "ihearprettycolors",
          "body": "How can someone truly tell their story by erasing the worst part of it? Showing the lowest weight pictures are necessary because they are apart of the person's past and prove how far they've come. If you don't want to see it, don't look.",
          "created_utc": 1600432812.0
        }
      ]
    },
    {
      "id": "g5rswpa",
      "author": "peachaleach",
      "body": ">How can someone truly tell their story by erasing the worst part of it?\n\nWas the worst part of your story really that you were at a low weight? Or was it the experience associated with that complete and utter hell of being so deep in your ED when you were at that weight? \n\nWhatever your experience, it can be communicated through words rather than using your body (sick or healthy) to communicate that for you.",
      "created_utc": 1600481884.0,
      "score": 2,
      "context": [
        {
          "id": "g5owl0z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1600427874.0
        },
        {
          "id": "g5oybtu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600429391.0
        },
        {
          "id": "g5p2twc",
          "author": "ihearprettycolors",
          "body": "How can someone truly tell their story by erasing the worst part of it? Showing the lowest weight pictures are necessary because they are apart of the person's past and prove how far they've come. If you don't want to see it, don't look.",
          "created_utc": 1600432812.0
        }
      ]
    },
    {
      "id": "g5pg20f",
      "author": "ihearprettycolors",
      "body": "As an anorexic person in an anorexic subreddit, when I see low weight pictures with an after, it makes me want to do better myself and spurs me to success. I'm not calling anyone out, and your path is your own. But how come your response is more valid than mine? Just, think about it for a sec. People respond different to the same pictures.",
      "created_utc": 1600440505.0,
      "score": -5,
      "context": [
        {
          "id": "g5owl0z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1600427874.0
        },
        {
          "id": "g5oybtu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600429391.0
        },
        {
          "id": "g5p2twc",
          "author": "ihearprettycolors",
          "body": "How can someone truly tell their story by erasing the worst part of it? Showing the lowest weight pictures are necessary because they are apart of the person's past and prove how far they've come. If you don't want to see it, don't look.",
          "created_utc": 1600432812.0
        },
        {
          "id": "g5p9fre",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1600436920.0
        }
      ]
    },
    {
      "id": "g5pgprb",
      "author": "None",
      "body": "I’ve been in ED communities a long time and I can say with certainty that a LOT of people would find it triggering. Why cant they only post the after photo, and just say they were at a low weight? I will believe them they dont have to prove it. & theres also 12 year olds on this sub so idk",
      "created_utc": 1600440843.0,
      "score": 8,
      "context": [
        {
          "id": "g5owl0z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1600427874.0
        },
        {
          "id": "g5oybtu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600429391.0
        },
        {
          "id": "g5p2twc",
          "author": "ihearprettycolors",
          "body": "How can someone truly tell their story by erasing the worst part of it? Showing the lowest weight pictures are necessary because they are apart of the person's past and prove how far they've come. If you don't want to see it, don't look.",
          "created_utc": 1600432812.0
        },
        {
          "id": "g5p9fre",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1600436920.0
        },
        {
          "id": "g5pg20f",
          "author": "ihearprettycolors",
          "body": "As an anorexic person in an anorexic subreddit, when I see low weight pictures with an after, it makes me want to do better myself and spurs me to success. I'm not calling anyone out, and your path is your own. But how come your response is more valid than mine? Just, think about it for a sec. People respond different to the same pictures.",
          "created_utc": 1600440505.0
        }
      ]
    },
    {
      "id": "g5pla2i",
      "author": "Wrencer4Endgame",
      "body": "Yeah it's just triggering for me too tbh... I'm happy they recovered but I'd rather not see the lowest weight pic.",
      "created_utc": 1600443124.0,
      "score": 6,
      "context": [
        {
          "id": "g5owl0z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1600427874.0
        },
        {
          "id": "g5oybtu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600429391.0
        },
        {
          "id": "g5p2twc",
          "author": "ihearprettycolors",
          "body": "How can someone truly tell their story by erasing the worst part of it? Showing the lowest weight pictures are necessary because they are apart of the person's past and prove how far they've come. If you don't want to see it, don't look.",
          "created_utc": 1600432812.0
        },
        {
          "id": "g5p9fre",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1600436920.0
        },
        {
          "id": "g5pg20f",
          "author": "ihearprettycolors",
          "body": "As an anorexic person in an anorexic subreddit, when I see low weight pictures with an after, it makes me want to do better myself and spurs me to success. I'm not calling anyone out, and your path is your own. But how come your response is more valid than mine? Just, think about it for a sec. People respond different to the same pictures.",
          "created_utc": 1600440505.0
        },
        {
          "id": "g5pgprb",
          "author": "None",
          "body": "I’ve been in ED communities a long time and I can say with certainty that a LOT of people would find it triggering. Why cant they only post the after photo, and just say they were at a low weight? I will believe them they dont have to prove it. & theres also 12 year olds on this sub so idk",
          "created_utc": 1600440843.0
        }
      ]
    }
  ]
}