{
  "id": "iyxz0t",
  "subreddit": "AnorexiaNervosa",
  "author": "ResilliantWarrior",
  "created_utc": 1600956665.0,
  "title": "My body dysmorphia is different to others",
  "selftext": "You see, I never saw myself really fat, but I always thought I looked a healthy weight, not really knowing how skinny I actually looked. Looking back at photos, if I saw myself like that I would've stopped. I genuinely thought I was healthy weight.  Also I had a virtue to not feel any looseness in my body as I misinterpreted that as fat, not loose skin. As a result I had hospitalised myself. Now as a CrossFit trainee I have realised that I can be healthy without starving myself and healthy is eating more than I was. The changes to my body were incredible. I saw my muscles coming back and I was no longer a young boy to feel sorry for. I was a man. I looked taller, more muscular and ever since CrossFit I am defeatinf anorexia. Who knew? I really wish that you guys take this and be less fearful of gaining weight. Yes some differences are noticeable, but these are good differences that make you look and feel so much better. You won't ever get fat, in fact you'll still look thin. Trust me from experience, don't let anorexia shroud you in fear.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/iyxz0t/my_body_dysmorphia_is_different_to_others/",
  "score": 119,
  "num_comments": 6,
  "comments": [
    {
      "id": "g6gckjd",
      "author": "milkonthestove",
      "body": "SAME HERE and I could also never see it on other people as well. my ex was pretty underweight but he always seemed normal to me, it always happens in my brain that even badly underweight people seem normal and healthy",
      "created_utc": 1600973857.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g6g20ke",
      "author": "annaannaana",
      "body": "This is actually not uncommon and happened to me as well. It’s actually a survival mechanism left over from our ancestors who needed to be able to survive times of famine, their brains prevented them from being able to see how malnourished they were to kind of “keep them going” in a sense and prevent them from panicking until there was more food again. I don’t remember where I read about this but if I find it I’ll link it.",
      "created_utc": 1600968999.0,
      "score": 23,
      "context": []
    },
    {
      "id": "g6ls5j1",
      "author": "Post_Outrageous",
      "body": "same boat",
      "created_utc": 1601088269.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g6hfdhp",
      "author": "ResilliantWarrior",
      "body": "I think the same principle applies to weight gain to a healthy weight. I'm bulking atm to destroy my anorexia and fear of weight gain and unless I saw previous photos of me I wouldn't have noticed much change in lean muscle mass over time",
      "created_utc": 1600992124.0,
      "score": 1,
      "context": [
        {
          "id": "g6gckjd",
          "author": "milkonthestove",
          "body": "SAME HERE and I could also never see it on other people as well. my ex was pretty underweight but he always seemed normal to me, it always happens in my brain that even badly underweight people seem normal and healthy",
          "created_utc": 1600973857.0
        }
      ]
    },
    {
      "id": "g6g8zsq",
      "author": "ResilliantWarrior",
      "body": "Thanks. That helps a lot. Didn't know that. Explains a lot",
      "created_utc": 1600972371.0,
      "score": 14,
      "context": [
        {
          "id": "g6g20ke",
          "author": "annaannaana",
          "body": "This is actually not uncommon and happened to me as well. It’s actually a survival mechanism left over from our ancestors who needed to be able to survive times of famine, their brains prevented them from being able to see how malnourished they were to kind of “keep them going” in a sense and prevent them from panicking until there was more food again. I don’t remember where I read about this but if I find it I’ll link it.",
          "created_utc": 1600968999.0
        }
      ]
    },
    {
      "id": "g6hr2g3",
      "author": "ResilliantWarrior",
      "body": "Also. I just assumed because I have read quite a lot of posts here of people thinking they are obese when they aren't and I kinda felt like the odd one out. Don't get me wrong, when I held a bit of loose skin when I was crunched up, it felt like way more than there actually was but I never considered myself looking really fat nor skinny. Thanks for the verification",
      "created_utc": 1600998902.0,
      "score": 1,
      "context": [
        {
          "id": "g6g20ke",
          "author": "annaannaana",
          "body": "This is actually not uncommon and happened to me as well. It’s actually a survival mechanism left over from our ancestors who needed to be able to survive times of famine, their brains prevented them from being able to see how malnourished they were to kind of “keep them going” in a sense and prevent them from panicking until there was more food again. I don’t remember where I read about this but if I find it I’ll link it.",
          "created_utc": 1600968999.0
        }
      ]
    }
  ]
}