{
  "id": "j18oqg",
  "subreddit": "AnorexiaNervosa",
  "author": "Veshkrisk",
  "created_utc": 1601284119.0,
  "title": "Uh yeah, I'm 'better' now, thanks for asking",
  "selftext": "So I had to go off work sick about a week ago. I had a mental health crisis, spiralled like crazy, and it kicked off the biggest relapse I've had in years. Planning my meals and counting calories and focusing on food is about the only thing keeping me sane right now. \n\nI'm back at work today and of course everyone is asking if I feel better now (they don't know why I went off, or if they do it wasn't because I told them) and it's just...no I'm not all better. I'm still a mess, I'm technically sicker than I was before because now I'm relapsing. I'm just more in control and a bit calmer. That doesn't mean I'm not still sick. \n\nOnly had a couple people ask so far, but I work in a big team and I can't hide from them all day, and I know I'm going to have to lie through my teeth because I can't have them know I'm x number of calories away from mcfreaking losing it any time they ask. It's exhausting just thinking about it.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/j18oqg/uh_yeah_im_better_now_thanks_for_asking/",
  "score": 114,
  "num_comments": 2,
  "comments": [
    {
      "id": "g6xvtj9",
      "author": "None",
      "body": ">I'm technically sicker than I was before because now I'm relapsing. I'm just more in control and a bit calmer.\n\nI wish people understood this...I'm sorry you're struggling.",
      "created_utc": 1601290631.0,
      "score": 37,
      "context": []
    },
    {
      "id": "g6xx407",
      "author": "Veshkrisk",
      "body": "You really can't tell what people are going through from looking at them, which is nice when I feel like I need to hide, but tiring when I feel like I have to keep up the charade. \n\nI'm in therapy and my therapist has been helping to accept my relapse as what it is instead of hating myself constantly for being back here again. So that's helping at least. \n\nThanks for your kind words, I hope you're doing okay as well ❤️",
      "created_utc": 1601291953.0,
      "score": 15,
      "context": [
        {
          "id": "g6xvtj9",
          "author": "None",
          "body": ">I'm technically sicker than I was before because now I'm relapsing. I'm just more in control and a bit calmer.\n\nI wish people understood this...I'm sorry you're struggling.",
          "created_utc": 1601290631.0
        }
      ]
    }
  ]
}