{
  "id": "j399hc",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1601561382.0,
  "title": "sub rules",
  "selftext": "I really don't want to say anything but a lot of people have been posting their weights and calories and stuff and it makes me kind of uncomfortable",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/j399hc/sub_rules/",
  "score": 160,
  "num_comments": 5,
  "comments": [
    {
      "id": "g7at5z0",
      "author": "None",
      "body": "we should agree not to talk specifically about current weights, goal weights and calorie counts",
      "created_utc": 1601569038.0,
      "score": 36,
      "context": []
    },
    {
      "id": "g7al1o2",
      "author": "None",
      "body": "People need to realise that numbers can be quite triggering. If they know this, it feels wrong to post the information anyway. I'm not opposed to some numbers (water intake, supplementation), but the majority can potentially cause people distress.",
      "created_utc": 1601565540.0,
      "score": 40,
      "context": []
    },
    {
      "id": "g7bu9oi",
      "author": "spaghettieggrolls",
      "body": "Honestly numbers are completely unnecessary unless you're talking to therapist/psychiatrist/doctor. There is no need to talk about it in an online or irl support group. It's easy to talk around it by giving a general sense of \"I was a below/above average weight\" or \"I was restricting/binging very heavily\". When I see people talking numbers about how much they lost when restricting it kinda just sounds like they're trying to flex how \"good\" they are at their ED, and that's not what this space should be about. This isn't tumblr ffs.",
      "created_utc": 1601584779.0,
      "score": 18,
      "context": []
    },
    {
      "id": "g7bjilr",
      "author": "alaskanelliot",
      "body": "You should be able to say something though and you’re not the only one who has been feeling uncomfortable lately. There’s a space for everything and when it comes to posting weights and calories, this isn’t a space for that. It can unfortunately hurt or trigger other people who are in this space to specifically not see things like that.",
      "created_utc": 1601580482.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g7bjzjy",
      "author": "None",
      "body": "People seem to have minimal consideration for posting numbers; it also demonstrates the fact that few posters are reading the rules. \n\nEveryone with/did have an ED understands the triggering nature of numbers and comparisons. It's crazy that people continue to post this content anyway.",
      "created_utc": 1601580679.0,
      "score": 15,
      "context": [
        {
          "id": "g7bjilr",
          "author": "alaskanelliot",
          "body": "You should be able to say something though and you’re not the only one who has been feeling uncomfortable lately. There’s a space for everything and when it comes to posting weights and calories, this isn’t a space for that. It can unfortunately hurt or trigger other people who are in this space to specifically not see things like that.",
          "created_utc": 1601580482.0
        }
      ]
    }
  ]
}