{
  "id": "j4h6vp",
  "subreddit": "AnorexiaNervosa",
  "author": "MK_521998",
  "created_utc": 1601739847.0,
  "title": "What the hell even is my life",
  "selftext": "So... since the last time I posted, so much has happened. My parents were in a horrible car wreck, my dad was okay. My mom... she was DOA, but they were able to revive her. He heart stopped multiple times, she has horrible crush injuries to her chest, she needed ten lifesaving surgeries. And after a month in the icu, she came home and I became her primary care giver, nurse, if you will. \n\nPoint being I'm utterly traumatized. When I first went to visit my parents in June, I was XXX lbs, I am now XX lbs. \n\nI came back to florida, bc it was obvious that I was killing myself trying to take care of my mom- working myself to the bone, apparently.\n\nI saw my old therapist yesterday, she was my therapist in my treatment center but recently went into private practice.\n\nEveryone, neighbors, friends, random acquaintances, all see me and ask me if I'm okay. If I've eaten. Should I really be taking my dog on 3 mile walks with my weight like this? \n\nLike... how is it any of your business? No, my mom died multiple times and I then spent months cleaning her wounds, bathing her,  checking her pulse-ox, her heart monitor, watching her cough up blood... SO NO IM NOT OKAY. \n\nMy therapist yesterday put stipulations on us continuing to work with eachothera mainly because two nights ago I ended up in the hospital because I fainted and am severely underweight for my height and I now have a concussion. \n\nHer stipulations are EDA meetings, and scheduling a time everyday to let myself feel- to embrace the flashbacks and the pain and guilt I feel over not being strong enough for my mom to be able to stay. \n\nAnd that's fine... but it's not. Because even though everyone I see tells me they're worried about me, when I look in the mirror I just see fat, I don't see this skin and bones thing everyone's talking about. \n\nIm terrified of gaining weight, but I know I need to do it, but... the thought makes me cry.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/j4h6vp/what_the_hell_even_is_my_life/",
  "score": 119,
  "num_comments": 7,
  "comments": [
    {
      "id": "g7ivau1",
      "author": "breathelikeatree",
      "body": "I can’t believe this happened to you. This is honestly so heartbreaking to read. I love my parents so much and I cannot imagine seeing them in such a defenseless state. You probably don’t want blatant sympathy, because in reality, none of us can fully relate. I get it. You might find no motivation to get better, or even want to, but your mom needs you and imagine your dad if he found how much you were struggling. The last thing they’d want is their daughter in the hospital, or worse... Sometimes sacrifices are hard to make but they are absolutely necessary, even if you end up struggling on the way. People who check  up on you probably don’t understand how to talk to people with an eating disorder and are in fact making a situation worse. I just try and put myself in their shoes for a change, but it can be super annoying. Don’t let it discourage you. If I had let their words get to me, I wouldn’t recovered. You are so important right now to your family and friends. They need you much more than you think. Life is too short, you only get one, why not live it out to its maximum capacity and see what’s in store for you. After all, things can only get better(if you let them!!) trust me, this isn’t a one way road. Good things will happen to you, you just have to give it time and tlc. \n\nIf a stranger on reddit giving you advice is unhelpful, than look at it as advice from an anorexic since 12, fully recovered, whose overcome grief with my siblings death and yet was able to find purpose in life. It’s possible. Please know that. No matter how hard and how long your bad days/months/years are, it will get better. It will. It will. It will.",
      "created_utc": 1601740727.0,
      "score": 20,
      "context": []
    },
    {
      "id": "g7j84w3",
      "author": "taikutsuu",
      "body": "I wouldn't be able to clean my mom's wounds for a single time, let alone like, months. You are much stronger than you realize, I'm tellin ya.",
      "created_utc": 1601747898.0,
      "score": 12,
      "context": []
    },
    {
      "id": "g7jd7ts",
      "author": "LischenVonEngels",
      "body": "You're a brave soul OP, and I can't imagine what it must have been like. My dad went through heart problems and strokes before eventually getting surgery, and those were some of the most frightening moments of my life; it's nowhere near what you have experienced, but I can relate to taking care of a parent. Please keep on fighting, I know it's exhausting, but I have faith in you. I'm proud of you.\n\nI'm sorry if this came off as too wishy-washy or being too overly sympathetic. Not everyone wants sympathy, I'm sorry.",
      "created_utc": 1601750411.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g7lz6s8",
      "author": "None",
      "body": "Ok I’m going to preface this by saying I HATE treatment. \n\nSo I would not normally recommend treatment. \nBut you, my dear, are suffering. You were caring for your loved-one- on no energy/nothing in you to give!! I really think that YOU need to be taken care of.\n\nI think this kind of situation is a situation where some form of inpatient treatment would help. At least a few weeks to a month. I’m no doctor, obviously, so who actually knows.\n\nIn the end it should be about you. Would it really be that bad to gain a bit of weight (even if you end up losing it) so that you can feel better-maybe get some sleep- have some more intensive therapy?\n\nLike I said before though, I’m the champion of quitting treatment. I just think that YOU need some TLC after helping to take care of your beautiful mum/after all that’s happened.",
      "created_utc": 1601782755.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g7k7jzy",
      "author": "MK_521998",
      "body": "Thank you so much. Dealing with this has been so isolating, I feel like no one could possibly understand the pain and the paralyzing fear a scenario like this brings on. \n\nI'm so sorry you've experienced anything close to this, no one should have to. I hope your father recovered well. Thank you for your kind words❤️",
      "created_utc": 1601760889.0,
      "score": 3,
      "context": [
        {
          "id": "g7jd7ts",
          "author": "LischenVonEngels",
          "body": "You're a brave soul OP, and I can't imagine what it must have been like. My dad went through heart problems and strokes before eventually getting surgery, and those were some of the most frightening moments of my life; it's nowhere near what you have experienced, but I can relate to taking care of a parent. Please keep on fighting, I know it's exhausting, but I have faith in you. I'm proud of you.\n\nI'm sorry if this came off as too wishy-washy or being too overly sympathetic. Not everyone wants sympathy, I'm sorry.",
          "created_utc": 1601750411.0
        }
      ]
    },
    {
      "id": "g7khp88",
      "author": "Dipitydoodahdipityay",
      "body": "Have you looked into support groups? I watched the woman who raised me slowly die of cancer and knew her dosages and how to move her feet so she didn’t get sores and I was so alone. I know that everyone I’ve talked to with similar pain has felt so alone with it, but even if every experience is different, finding people who understand at some level can be healing",
      "created_utc": 1601764394.0,
      "score": 2,
      "context": [
        {
          "id": "g7jd7ts",
          "author": "LischenVonEngels",
          "body": "You're a brave soul OP, and I can't imagine what it must have been like. My dad went through heart problems and strokes before eventually getting surgery, and those were some of the most frightening moments of my life; it's nowhere near what you have experienced, but I can relate to taking care of a parent. Please keep on fighting, I know it's exhausting, but I have faith in you. I'm proud of you.\n\nI'm sorry if this came off as too wishy-washy or being too overly sympathetic. Not everyone wants sympathy, I'm sorry.",
          "created_utc": 1601750411.0
        },
        {
          "id": "g7k7jzy",
          "author": "MK_521998",
          "body": "Thank you so much. Dealing with this has been so isolating, I feel like no one could possibly understand the pain and the paralyzing fear a scenario like this brings on. \n\nI'm so sorry you've experienced anything close to this, no one should have to. I hope your father recovered well. Thank you for your kind words❤️",
          "created_utc": 1601760889.0
        }
      ]
    },
    {
      "id": "g7l6jfu",
      "author": "LischenVonEngels",
      "body": "Yeah, he's good right now, thank you! You're right, no one should have to go through something like this, it's just so incredibly isolating and no one understands unless they've been through something similar. You don't have to thank me OP, just know that you're not alone and we're here for you.",
      "created_utc": 1601772761.0,
      "score": 1,
      "context": [
        {
          "id": "g7jd7ts",
          "author": "LischenVonEngels",
          "body": "You're a brave soul OP, and I can't imagine what it must have been like. My dad went through heart problems and strokes before eventually getting surgery, and those were some of the most frightening moments of my life; it's nowhere near what you have experienced, but I can relate to taking care of a parent. Please keep on fighting, I know it's exhausting, but I have faith in you. I'm proud of you.\n\nI'm sorry if this came off as too wishy-washy or being too overly sympathetic. Not everyone wants sympathy, I'm sorry.",
          "created_utc": 1601750411.0
        },
        {
          "id": "g7k7jzy",
          "author": "MK_521998",
          "body": "Thank you so much. Dealing with this has been so isolating, I feel like no one could possibly understand the pain and the paralyzing fear a scenario like this brings on. \n\nI'm so sorry you've experienced anything close to this, no one should have to. I hope your father recovered well. Thank you for your kind words❤️",
          "created_utc": 1601760889.0
        }
      ]
    }
  ]
}