{
  "id": "j9680f",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1602426132.0,
  "title": "does anybody feel really bad when they use somebody as thinspo?",
  "selftext": "i tagged this as a tw just because i didn’t want to accidentally trigger somebody, but it’s really more of a question.\n\nfor me, it’s always been having a flat stomach. i live in england and i’m 15 so i’m in my last year of high school, but anyways we have to wear a uniform. on friday the school wore non uniform for charity and lots of people showed up in low rise jeans, figure hugging dresses and skirts etc. i found myself subconsciously looking at their flat stomachs and telling myself that if i carry on restricting then i can look like that too. but when i realised that i was doing it i always felt really really bad. idk. it’s not really that much of a question but i don’t have anyone i can talk to this kind of stuff about lol",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/j9680f/does_anybody_feel_really_bad_when_they_use/",
  "score": 139,
  "num_comments": 9,
  "comments": [
    {
      "id": "g8htwe4",
      "author": "htesssl",
      "body": "Yes I do. I had followed this one girl for years. Her body was soooo perfect. Literally epitome of perfection. Til one day, she made a long fb post, revealing that she suffered from ED for many years... I could NOT believe it... I reached out to her immediately to tell her and she was SHOCKED someone was even considering her thinspo! I felt so bad, but we connected and she’s the only girl I know that I can talk to about ED struggles",
      "created_utc": 1602430325.0,
      "score": 52,
      "context": []
    },
    {
      "id": "g8i7b2v",
      "author": "None",
      "body": "I feel this about Taylor Swift. I used her as thinspo because I thought she was \"naturally thin\" and then she came out with her Ed. I felt so guilty.",
      "created_utc": 1602437654.0,
      "score": 22,
      "context": []
    },
    {
      "id": "g8ifl5b",
      "author": "shinyxcrab",
      "body": "Yea.. it happens. Sometimes I see someone that just blows me away and I can’t tell if I’m attracted to this person or if I just want to look like them lmao. We idealize a certain shape and features of people. It’s not your fault. Just remember they probably struggle with body image too. There’s not too many people that do not struggle with it in some form. There’s so much pressure on us to be someone other than ourselves. So much pressure to be “perfect” when perfect does not exist.",
      "created_utc": 1602441915.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g8i00iw",
      "author": "jake25456",
      "body": "There was a study done a couple of years ago in Australia about exactly this and they found it was one of the symptoms of ana",
      "created_utc": 1602433758.0,
      "score": 13,
      "context": []
    },
    {
      "id": "g8i6ndu",
      "author": "naisimar",
      "body": "Girl, I’m nearly 20 now but I HATED Non-uniform day for the same exact reasons 😭😭 I’m honestly scared for my children in case they have the same",
      "created_utc": 1602437316.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g8ikme4",
      "author": "skymningwolf",
      "body": "Yeah I usually feel terrible if I follow someone or view their photos just for disordered purposes. I try to not use accounts or people that I think look underage though. I think everyone does it subconsciously though; we’re human :/",
      "created_utc": 1602444080.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g8j6l2e",
      "author": "CozyFall",
      "body": "Yup. All the time and I kick myself for thinking it. It’s hard not to compare yourself to others.",
      "created_utc": 1602453592.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8jd6qr",
      "author": "aetolica",
      "body": "If I see someone in real life and use them for thinspo, I feel bad. Like, they are just out there trying to live their life and I'm fixating on their shape and size!! So guilty.\n\nBut if someone's running an eating disorder accounting sharing body check photos, I'm less guilty, because they're kind of promoting that idea.",
      "created_utc": 1602457184.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8mqxu7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1602538379.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8mra5l",
      "author": "None",
      "body": "i just use everyone as inspiration to be thin lol. whether it’s thin people, i think wow i need to stop eating to look like them, or bigger people, i think wow i need to stop eating so i don’t look like them",
      "created_utc": 1602538562.0,
      "score": 3,
      "context": [
        {
          "id": "g8mqxu7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1602538379.0
        }
      ]
    }
  ]
}