{
  "id": "jkxjbl",
  "subreddit": "AnorexiaNervosa",
  "author": "SoftDreamer",
  "created_utc": 1604067332.0,
  "title": "I feel like a part of my ED isn’t just a fear of being fat but also wanting to feel like I achieved something",
  "selftext": "I’m really tired of being useless enough to not be able to make any accomplishments. Everyone else is smarter than me. Moving in life knowing that I’ll never reach my goals honestly just tells me that I’m walking through a dark forest. I don’t care if my health gets fucked up. \n\nIf I grew up to adulthood, I would be a useless one and probably unemployed due to pathetic nature. I’ll never be successful at anything else than losing weight. I deeply don’t care that my blood pressure is very low now. \n\nJust take me to the fucking grave before my life becomes even worse.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/jkxjbl/i_feel_like_a_part_of_my_ed_isnt_just_a_fear_of/",
  "score": 262,
  "num_comments": 10,
  "comments": [
    {
      "id": "gambmiy",
      "author": "sorkhoktani",
      "body": "It really does feel like that. My situation is a little different, but it feels like what you’re describing. \n\nI’m most likely twice your age, and when I was growing up, this was the 90s. People were making money, everybody was optimistic, and kids whose parents were really invested in them succeeding in life told us all we should be astronauts when we grow up.\n\nI had natural academic talent. My parents imbued me with a fair amount of arrogance, and so for me, when anybody did something better than I could do it, it felt like I was nothing. Like I should just give up. The only reason I didn’t give up was because of that arrogance, even though that’s not healthy either… Not at all.",
      "created_utc": 1604079057.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gam5r58",
      "author": "blindbetty",
      "body": "I felt this way as a teenager & now that I didn’t die I’m behind in life. Am 25 and struggling to rush through college. I had no plans cuz who needs them when your dead? The world doesn’t stop just because we do.",
      "created_utc": 1604076191.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gamv4oe",
      "author": "SadisticGoose",
      "body": "I was telling my friend a couple of days ago about how I feel strangely proud of my record for days in a row not having eaten. Like I know it’s bad, but looking at it in hindsight makes me feel so powerful to know that I ignored basic human instinct for so long.",
      "created_utc": 1604088887.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gamg1mk",
      "author": "jake25456",
      "body": "Good I feel you I just had to quit my job because of stress and it caused me to try and kill myself and now the only thing I have is trying to be skinny",
      "created_utc": 1604081219.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gamed9o",
      "author": "somegenerichandle",
      "body": "Yes, that makes sense. I feel that crafting (i'm a knitter) gives me a sense of accomplishment. It's okay to not be the best at something. You would most likely not judge your friends and family as harshly as you are judging yourself right now. It's okay to just be.",
      "created_utc": 1604080403.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gan0h40",
      "author": "toadlonglegs",
      "body": "I feel the exact same way",
      "created_utc": 1604091699.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ganbglm",
      "author": "wutssarcasm",
      "body": "You're not alone. At the root of most eating disorders is from wanting control, accomplishing something would create a sense of control in your life.",
      "created_utc": 1604097835.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ganeszg",
      "author": "stabbednsoping",
      "body": "I just lost my job when ana was at its highest levels.\nI hope to get some odd job money, than go back to what line of work I was doing before.\nIn the meantime, I gotta stay healthy enough to live life in the now.\nHope recovery goes easy for all of us...",
      "created_utc": 1604099825.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gam6hm8",
      "author": "SoftDreamer",
      "body": "I have dreams but I feel like reality is far from them and I’m destined to becoming like my parents. Just dead walking\n\nEven if I achieve them. No one will be there to appreciate anything",
      "created_utc": 1604076549.0,
      "score": 3,
      "context": [
        {
          "id": "gam5r58",
          "author": "blindbetty",
          "body": "I felt this way as a teenager & now that I didn’t die I’m behind in life. Am 25 and struggling to rush through college. I had no plans cuz who needs them when your dead? The world doesn’t stop just because we do.",
          "created_utc": 1604076191.0
        }
      ]
    },
    {
      "id": "gamlftg",
      "author": "blindbetty",
      "body": "Yes they will. Things change all of the time & nothing is ever set in stone. Quitting the negativity made people like me and I’ve got my mother and boyfriend now instead of alcohol. I am in love with money now instead of dying. Dying made me homeless and that sucks ass. It betrayed me when it never happened.\n\nMy parents are poor. I need to buy a house so my aging sick mother can have a place to live. I can’t be losers like the rest of my family and I need to succeed or she’s going to suffer.",
      "created_utc": 1604083906.0,
      "score": 4,
      "context": [
        {
          "id": "gam5r58",
          "author": "blindbetty",
          "body": "I felt this way as a teenager & now that I didn’t die I’m behind in life. Am 25 and struggling to rush through college. I had no plans cuz who needs them when your dead? The world doesn’t stop just because we do.",
          "created_utc": 1604076191.0
        },
        {
          "id": "gam6hm8",
          "author": "SoftDreamer",
          "body": "I have dreams but I feel like reality is far from them and I’m destined to becoming like my parents. Just dead walking\n\nEven if I achieve them. No one will be there to appreciate anything",
          "created_utc": 1604076549.0
        }
      ]
    }
  ]
}