{
  "id": "jlhipc",
  "subreddit": "AnorexiaNervosa",
  "author": "jinn_ie",
  "created_utc": 1604147250.0,
  "title": "god has favorites.... i'm not one of them",
  "selftext": "DAE also hates when you see a person that's the same height as you but weights a little bit more, AND SOMEHOW they are skinnier than you and look fitter?? like god why do you hate me so much. thinspo doesn't even trigger me anymore but these people with this type of body....... oof",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/jlhipc/god_has_favorites_im_not_one_of_them/",
  "score": 118,
  "num_comments": 5,
  "comments": [
    {
      "id": "gap3kph",
      "author": "asstasticwhitegirl",
      "body": "I feel you on this. Physics means nothing anymore I guess",
      "created_utc": 1604151436.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gapax0a",
      "author": "Bakedpotatoninja",
      "body": "My sister weighs more than me, is shorter than me but SOMEHOW she looks slimmer, tinier and all that good stuff that I want. I try so hard not to envy her but I truly can't :/ it makes me guilty everyday that I feel that way towards her <\\3",
      "created_utc": 1604156150.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gappcg9",
      "author": "Ironicbanana14",
      "body": "I have the apple body, ALL my weight goes to my hips, thighs, and stomach. All of it. My arms and upper body and ankles are skinny, but my middle is huge. I got no boobs. \n\nSo i weigh about the same as a \"thicc\" girl but cuz my weight isnt distributed like that, i get so much hate if i tried to say this in public because lots of people do not understand.\n\nI cant find jeans or cute shirts ever because of it, i end up wearing sweats/joggers and t shirts.\n\nWhen i lose weight, it always starts from my boobs! Even tho theyre already lacking!",
      "created_utc": 1604164357.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gap4vk2",
      "author": "jake25456",
      "body": "The Gras is always greener on the other side",
      "created_utc": 1604152332.0,
      "score": 3,
      "context": []
    }
  ]
}