{
  "id": "jwomxy",
  "subreddit": "AnorexiaNervosa",
  "author": "unsweetenedloser",
  "created_utc": 1605734179.0,
  "title": "Does anyone else think others want you to be like this?",
  "selftext": "A few friends know about my anorexia and to the people who do know I feel this pressure to restrict around them. When I do eat around them I feel like a fake and I feel like they're judging me. I went to a friends house and ate a little which lead me into a binge. I feel so fake and I don't know if this is normal to experience or not?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/jwomxy/does_anyone_else_think_others_want_you_to_be_like/",
  "score": 111,
  "num_comments": 20,
  "comments": [
    {
      "id": "gcrif7a",
      "author": "GaffaGirl",
      "body": "I've told my parents about my terrible relationship with food... But still every time my mum sees me in the kitchen making something to eat, without a second thought, the first thing out of her mouth is \"Eating again!?\" As if I never stop eating.\n\nIt always makes me feel as if I'm eating too much.\n\nSo I avoid the kitchen and eating as much as possible because it reduces the ridicule.\n\nI feel like I could go days without food and my parents wouldn't notice, they'd just be happy that there weren't so many dishes and that they could use the kitchen whenever they wanted.\n\nTldr: Yes. I can relate to this.",
      "created_utc": 1605736650.0,
      "score": 39,
      "context": []
    },
    {
      "id": "gcrglan",
      "author": "None",
      "body": "I feel exactly the same. I feel like when I eat around people who know they're kind of like \"what, she is eating?\", and also that they are generally just more vigilant of every morsel I eat. I feel more pressure to restrict almost as evidence that I do have anorexia. I find it much easier to eat whatever around people who dont know, as I feel they notice less/if at all and are less vigilant of how much I am eating in general. \n\nIts difficult because letting people know can feel so freeing but then it also creates these difficult dynamics, generally with the people who are most important to you (hence why you felt comfortable enough to tell them about your anorexia in the first place).",
      "created_utc": 1605735770.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gcrebmg",
      "author": "JohnnyMyGuy",
      "body": "I really relate to this. Whenever I eat round the people who know they're not proud, they're surprised. It's awful.",
      "created_utc": 1605734698.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gcrm1iy",
      "author": "BoozeyTurtlez",
      "body": "Yes I always feel like that",
      "created_utc": 1605738450.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gcro005",
      "author": "selkieflying",
      "body": "Yes! I feel like I have to “live up” to my ED when I’m with ppl that know abt it",
      "created_utc": 1605739352.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gcrt2ap",
      "author": "sorcerers_apprentice",
      "body": "Yeah, I feel this. I simultaneously feel a pressure to eat more so I seem normal, and a pressure to eat less because I'm ashamed and embarrassed that people won't think my ED is real...",
      "created_utc": 1605741483.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gcruzpa",
      "author": "Old_Kiwi_9400",
      "body": "Eating in front of friends is a harfd thing for me and I completely understand that concern. It is hard becuase people have limited understanding on how anarexia functions and looks. That being said, If your friends are thinking that and they tell you they think your lying, then they are not your friends and you should look for people that will care about you and not question your diagnosis. You deserve more than that!!",
      "created_utc": 1605742317.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gcry5ev",
      "author": "None",
      "body": "Around the time i was at my thinnest, there was a girl in an adjoining department who had also lost an extreme amount of weight and looked anorexic af to me (maybe not to others.) One day we were in a training together and i saw her take a cookie at the break. I was upset! I was like \"so she's thin WITHOUT anorexia? That isn't fair!\"\n\nI do kind of feel like my mother wants me to be like this. She is very competitive with her sisters-in-law and my sister and i weigh about half as much as any of our cousins. \n\nAnother thing, kind of tangentially related: i have noticed a big difference in the amount of general credibility i am granted while thin. When you are skinny, the things you say somehow have more value. People listen and take you seriously even though size has no impact on competence? It is like there is a sense that anyone who has enough discipline to stay thin clearly has ALL OF THE ANSWERS TO LIFE.\n\nThis is because-- in our society-- fatness is the absolute worst sin you can commit. If being fat is the worst thing you can do, that makes being thin the BEST thing you can do. \n\nI am not in recovery and this is not a coincidence",
      "created_utc": 1605743926.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gcs6n6u",
      "author": "Luckypurr",
      "body": "Imposter Syndrome. It's quite common, and absolutely the worst part of being open about an eating disorder. You should read up on it [here](https://en.m.wikipedia.org/wiki/Impostor_syndrome#:~:text=Impostor%20syndrome%20(also%20known%20as,exposed%20as%20a%20%22fraud%22.)",
      "created_utc": 1605748633.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gcs7e2j",
      "author": "flowerscatsandqs",
      "body": "Oooh yeah, for sure. My mom is always scrutinizing what I eat and constantly makes comments about how “healthy” I am and asks for “diet advice” (thinly veiled; like if I researched a type of diet to follow or whatever). It sucks because if I feel like I want to get better I can’t because I would be “letting her down” by ruining this image of this healthy person in her mind.",
      "created_utc": 1605749041.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gcsvhf2",
      "author": "MadisynMoon",
      "body": "This happens to me all the time. Realistically I know my friends love me and want the best for me but eating around them is scary. It really does trick your brain into feeling like you are faking.",
      "created_utc": 1605763132.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gctbk2o",
      "author": "frolicsom_fawn",
      "body": "yeah exactly, it’s like you have to keep up this image you put in their heads",
      "created_utc": 1605777510.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gcv075q",
      "author": "martinigardenSOM",
      "body": "I used to. But then I started talking about it more with them and it got dulled the paranoia. I have three friends who I really talk to &they're all male. I asked them each how they felt about this topic before typing this response and this is what they said:\n\n Friend1. \"Okay we've lived together. I've seen you go weeks eating nothing but diet soda and then heard you have panic attacks and force vomiting all night when you didn't eat. I'd have to be fucking stupid to think you don't have an eating disorder when you eat more. You starve yourself and wind up ravenous. It'd be weird if you never ate some normal meals. I think you're just slowly getting better.\" \n\nFriend2 \"Actually I get more worried when you do eat in front of me cuz I'm f*kng scared you're gonna make yourself throw up later and I don't like the idea of your hurting yourself. I get really angry those nights worried I'm gonna get a call from the hospital that you burst your esophagus.\"\n\nFriend3 \"first of all. I have never seen you eat anything large enough to be considered a normal amount. The fact you think you've binged in front of me scares the living asscrap out of me and I wish I was there to hug you. Second. It doesn't matter to me how much you eat cuz I know you go through phases. When you eat more in front of me I get nervous cuz I know you're gonna stop eating completely soon. I never think you're fake or fixed. I'd say I'm concerned it can never be fixed.",
      "created_utc": 1605814759.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gczbxmx",
      "author": "None",
      "body": "Yes all the time",
      "created_utc": 1605906854.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gcrjc7g",
      "author": "unsweetenedloser",
      "body": "Thank you for responding, I completely relate to the feeling you get when your mom comments, my mom does the same thing and is always in the kitchen and it makes me want to hide and go eat or just throw away the plate of food. She found out about my  bulimia (which I don't do much anymore) a couple years ago but she basically ignores it and hasn't mentioned it once and is always commenting and congratulating me on being \"healthy\" now because I used be overweight, they just don't understand.",
      "created_utc": 1605737098.0,
      "score": 11,
      "context": [
        {
          "id": "gcrif7a",
          "author": "GaffaGirl",
          "body": "I've told my parents about my terrible relationship with food... But still every time my mum sees me in the kitchen making something to eat, without a second thought, the first thing out of her mouth is \"Eating again!?\" As if I never stop eating.\n\nIt always makes me feel as if I'm eating too much.\n\nSo I avoid the kitchen and eating as much as possible because it reduces the ridicule.\n\nI feel like I could go days without food and my parents wouldn't notice, they'd just be happy that there weren't so many dishes and that they could use the kitchen whenever they wanted.\n\nTldr: Yes. I can relate to this.",
          "created_utc": 1605736650.0
        }
      ]
    },
    {
      "id": "gctaxpf",
      "author": "None",
      "body": "completely relate",
      "created_utc": 1605776845.0,
      "score": 1,
      "context": [
        {
          "id": "gcrt2ap",
          "author": "sorcerers_apprentice",
          "body": "Yeah, I feel this. I simultaneously feel a pressure to eat more so I seem normal, and a pressure to eat less because I'm ashamed and embarrassed that people won't think my ED is real...",
          "created_utc": 1605741483.0
        }
      ]
    },
    {
      "id": "gcs8xna",
      "author": "unsweetenedloser",
      "body": "Thank you for this reply. That actually makes a lot of sense and I think that actually helps me rationalize it more.",
      "created_utc": 1605749867.0,
      "score": 3,
      "context": [
        {
          "id": "gcs6n6u",
          "author": "Luckypurr",
          "body": "Imposter Syndrome. It's quite common, and absolutely the worst part of being open about an eating disorder. You should read up on it [here](https://en.m.wikipedia.org/wiki/Impostor_syndrome#:~:text=Impostor%20syndrome%20(also%20known%20as,exposed%20as%20a%20%22fraud%22.)",
          "created_utc": 1605748633.0
        }
      ]
    },
    {
      "id": "gcrk6mo",
      "author": "GaffaGirl",
      "body": "I'm diagnosed bulimic, but no purging.. just binging and restricting.\n\nMy mum is still in the mind of the times where I was overweight, and because she is still overweight she can't understand how I can lose weight and eat like I do... But she assumes I still eat like I did when I was bigger.\n\nI can also relate to the congratulations from those close to you for your weight loss and \"healthy\" eating... Because from what they see, you eat well. I know they don't mean to reinforce my unhealthy habits, but it subconsciously does.\n\nI'm in therapy at the moment on step 1 with the dietitian, regular meals, no matter how big or small. It's hard, especially given the environment I am in. I have always felt judged when I eat.\n\nI'm going to sit down and have a chat to mum about how her comments are making me feel, but I don't know how yet... Probably write a DEAR MAN script.\n\nMy parents are still of the mindset that I am fine, and I should be able to look after myself. So it is rarely talked about.",
      "created_utc": 1605737518.0,
      "score": 10,
      "context": [
        {
          "id": "gcrif7a",
          "author": "GaffaGirl",
          "body": "I've told my parents about my terrible relationship with food... But still every time my mum sees me in the kitchen making something to eat, without a second thought, the first thing out of her mouth is \"Eating again!?\" As if I never stop eating.\n\nIt always makes me feel as if I'm eating too much.\n\nSo I avoid the kitchen and eating as much as possible because it reduces the ridicule.\n\nI feel like I could go days without food and my parents wouldn't notice, they'd just be happy that there weren't so many dishes and that they could use the kitchen whenever they wanted.\n\nTldr: Yes. I can relate to this.",
          "created_utc": 1605736650.0
        },
        {
          "id": "gcrjc7g",
          "author": "unsweetenedloser",
          "body": "Thank you for responding, I completely relate to the feeling you get when your mom comments, my mom does the same thing and is always in the kitchen and it makes me want to hide and go eat or just throw away the plate of food. She found out about my  bulimia (which I don't do much anymore) a couple years ago but she basically ignores it and hasn't mentioned it once and is always commenting and congratulating me on being \"healthy\" now because I used be overweight, they just don't understand.",
          "created_utc": 1605737098.0
        }
      ]
    },
    {
      "id": "gcsdtid",
      "author": "Luckypurr",
      "body": "I'm so glad! I feel like if I can rationalize it like this it helps tremendously. I'm glad you agree!",
      "created_utc": 1605752492.0,
      "score": 3,
      "context": [
        {
          "id": "gcs6n6u",
          "author": "Luckypurr",
          "body": "Imposter Syndrome. It's quite common, and absolutely the worst part of being open about an eating disorder. You should read up on it [here](https://en.m.wikipedia.org/wiki/Impostor_syndrome#:~:text=Impostor%20syndrome%20(also%20known%20as,exposed%20as%20a%20%22fraud%22.)",
          "created_utc": 1605748633.0
        },
        {
          "id": "gcs8xna",
          "author": "unsweetenedloser",
          "body": "Thank you for this reply. That actually makes a lot of sense and I think that actually helps me rationalize it more.",
          "created_utc": 1605749867.0
        }
      ]
    }
  ]
}