{
  "id": "jxbhjn",
  "subreddit": "AnorexiaNervosa",
  "author": "Pizzaisgood_",
  "created_utc": 1605820618.0,
  "title": "(Tw) Don’t want to eat but food obsessed?",
  "selftext": "I have gotten past the point of hungry to where I don’t want to eat anything because it will make my stomach hurt/digestive system uncomfortable so I actually don’t enjoy eating food anymore. Like it almost grosses me out. But at the same i find myself becoming food obsessed, looking at pics of carb-filled foods and dessert. What does this even mean and does this happen to anyone else?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/jxbhjn/tw_dont_want_to_eat_but_food_obsessed/",
  "score": 131,
  "num_comments": 8,
  "comments": [
    {
      "id": "gcvionn",
      "author": "fiberglassdildo",
      "body": "It’s happening because your brain wants/needs you to eat. No matter how your stomach feels your body knows it needs food so it fixates on food so you’ll eat. \nGrossly over simplified but that’s why it’s happening. You’re hungry but your ques are messed up from Ana. \n\nIf it hurts/makes you sick to eat you need to start with broth or easy to digest food. Look up refeeding for more info BUT PLEASE go see a doctor or call one for advice.",
      "created_utc": 1605822750.0,
      "score": 46,
      "context": []
    },
    {
      "id": "gcwb2zd",
      "author": "Noitatsidem",
      "body": "I've spent a lot of time restricting and watching stuff from the food channel. I know this feel.",
      "created_utc": 1605836433.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gcvo3wh",
      "author": "BoozeyTurtlez",
      "body": "Yeah I also find myself obsessing with looking at food",
      "created_utc": 1605824950.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gcvxyen",
      "author": "rats420666",
      "body": "I've been on the same boat. As an anorexic trying to recover but currently relapsing a bit (I've refused snacks and supper on my meal plan, cutting down to about 1300 kcal/day, and trying to do a few more steps but not as much as I used to), I can't stop thinking about food and skimming through online recipes that I'll never be bothered to cook, like homemade vegan hot pockets or marshmallows. I would sometimes starve myself for many wakeful hours or even a day or two, feeling my body cry out for food yet refusing to act on it.",
      "created_utc": 1605829209.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gcwn1bs",
      "author": "clemfandangohere",
      "body": "Oh man. When i was really sick i used to have these dreams where i would eat ALL the food. Then I would wake up and feel so guilty. It’s actually the fkn worst thing.",
      "created_utc": 1605843048.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gcxby7r",
      "author": "None",
      "body": "I keep taking those buzzfeed quizzes about food to satisfy my obsession about food 😂",
      "created_utc": 1605862303.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gcxbt5l",
      "author": "unidentifiable_head",
      "body": "Am pretty much weight restored and I still do this. Its like my body hasnt quite caught up yet. Admittedly, its a lot better than it was but the whole looking at food and recipes thing is still there and is extremely common for people with eating disorders. When I was sick(er), I would also obsess over what friends ate for breakfast/lunch/dinner, and try to subtly ask them about what they usually ate, how often they ate, anything about their eating habits. If food was on tv at all, even if it wasn't relevant to the show, or an ad about a car or something but someone happened to be eating in it.. i would just get tunnel vision on the food and think about every detail surrounding why they chose that food and how the actor ate it and what they thought bout eating it etc. It was exhausting. Made me feel even more greedy/fat etc but it was the STARVATION thoughts. You can only really look back and see just how bad it was once you get better :(",
      "created_utc": 1605862156.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gcvyff8",
      "author": "None",
      "body": "I spend hours looking at recipes too",
      "created_utc": 1605829435.0,
      "score": 7,
      "context": [
        {
          "id": "gcvxyen",
          "author": "rats420666",
          "body": "I've been on the same boat. As an anorexic trying to recover but currently relapsing a bit (I've refused snacks and supper on my meal plan, cutting down to about 1300 kcal/day, and trying to do a few more steps but not as much as I used to), I can't stop thinking about food and skimming through online recipes that I'll never be bothered to cook, like homemade vegan hot pockets or marshmallows. I would sometimes starve myself for many wakeful hours or even a day or two, feeling my body cry out for food yet refusing to act on it.",
          "created_utc": 1605829209.0
        }
      ]
    }
  ]
}