{
  "id": "k23jwg",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1606492195.0,
  "title": "Thanksgiving is always my least fav",
  "selftext": "I was actually excited to eat a little bit yesterday. I’d spent the day before and whole morning prepping 3 vegan items for myself and everyone. They were all healthy, lower calorie sides that I knew everyone would enjoy. When I got to my in laws house the first thing my husbands grandma said to me was that I look so thin and she was so proud of whatever I was doing to lose weight (mind you I’ve never been overweight but now I’m close to an underweight bmi) and she said you can never be too thin or too rich and to keep it up. So yeah it definitely ruined my mood a bit. Stuck to water all day and took 2 bites of the 3 things I’d spent so long making. What a waste.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/k23jwg/thanksgiving_is_always_my_least_fav/",
  "score": 124,
  "num_comments": 3,
  "comments": [
    {
      "id": "gds04vk",
      "author": "None",
      "body": "Ugh I’m so sorry. But don’t be too hard on yourself! At least you were able to make the food, you went into it with a positive mindset. That was a very triggering thing for her to say, so do not beat yourself up. Baby steps, love. You’re doing great!",
      "created_utc": 1606495244.0,
      "score": 26,
      "context": []
    },
    {
      "id": "gds982b",
      "author": "bubbles2360",
      "body": "I’m so sorry your thanksgiving took a sour turn. If your husband’s grandma knows about your eating disorder and still said what she did, that’s very ignorant of her. If she doesn’t know about it, it’s unfortunate that we have to still live in a world that glorifies super thin bodies because all bodies look amazing no matter what size, weight, shape, etc they are\n\nOverall though, try to be kind to yourself these next few days or even weeks. I know whenever my anorexia was triggered, the impact of the triggers lasted weeks to months most of the time and it took a lot of effort and patience to get my mindset back to where it was before the trigger\n\nSo take things slowly and keep working at it. You’ll get there! :)",
      "created_utc": 1606499346.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gds1ivp",
      "author": "None",
      "body": "Thank you! I’m hopeful I’ll get to a positive mindset with food again. It’s always a day by day process with AN!",
      "created_utc": 1606495862.0,
      "score": 10,
      "context": [
        {
          "id": "gds04vk",
          "author": "None",
          "body": "Ugh I’m so sorry. But don’t be too hard on yourself! At least you were able to make the food, you went into it with a positive mindset. That was a very triggering thing for her to say, so do not beat yourself up. Baby steps, love. You’re doing great!",
          "created_utc": 1606495244.0
        }
      ]
    }
  ]
}