{
  "id": "k46fg8",
  "subreddit": "AnorexiaNervosa",
  "author": "Mjaguacate",
  "created_utc": 1606773772.0,
  "title": "A warning to anyone still restricting",
  "selftext": "I’m in the process of recovering. It’s still pretty recent, only about a month, but I’ve been noticing changes in my body since I’ve started eating again. This is normal of course, but as I’m recovering I realized I wasn’t as unaffected by my restrictive diet as I thought I was. I was eating only once a day for about two years before I went through a three month period of barely eating that lead up to my seeking recovery. I hadn’t noticed until recently how much hair I was losing when I was restricting. It never came out in clumps, but I got so used to shedding a significant amount of hair that I assumed it was normal and I was fine. I had noticed that my hair was appearing thinner, but I assumed this was a temporary period of hair loss brought on by stress. It wasn’t until very recently, since eating normally for a few weeks, that I noticed I’m only losing about a quarter of the hair I had been. Furthermore, just the brief three months of heavily restricting my eating has effectively stopped my period and I’m still waiting for it; it has been over two months since my last one. The point of this post is to warn everyone still restricting that you might not be as okay as you think you are. I legitimately thought I was fine because I never became under weight and I’m just realizing that I really did harm my body. Stay safe y’all. ❤️",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/k46fg8/a_warning_to_anyone_still_restricting/",
  "score": 140,
  "num_comments": 2,
  "comments": [
    {
      "id": "ge7tzvz",
      "author": "kindastupidngl",
      "body": "thank you for this. i feel like no one really knows how sick they are until something terrible happens.",
      "created_utc": 1606788758.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ge94pil",
      "author": "petewentz-from-mcr",
      "body": "I’ve been restricting for the past 8 years, so like this is literally all I’ve ever known my body to be (who remembers small things about their body from middle school?). I had no idea how malnourished I was until I started taking a multivitamin. Like seriously, taking just the one pill a day made a huge difference in a lot of things I didn’t know needed improvement.\n\nTw- Self Harm\n\n>!One of the weirdest things I noticed about taking vitamins was how frustrating it made self harm. It was so annoying!! It was like any time I got enough blood flow to be satisfying it’d start clotting. Then I realised it was because I’d been taking a multivitamin... basically I’d just grown accustomed to having very little clotting factor and was annoyed that my body was working properly.!<\n\nAlso, a dentist asking numerous questions about my vitamin intake and stuff was confusing until they asked specifically about vitamin C. I had to live with the realisation that they were trying to figure out if I had *scurvy.* \n\nGranted I am more susceptible to side effects of malnutrition because I grew up malnourished af, but I still was surprised by these things. \n\nYou aren’t alone OP, and thank you for sharing!!",
      "created_utc": 1606826250.0,
      "score": 8,
      "context": []
    }
  ]
}