{
  "id": "k4vxa5",
  "subreddit": "AnorexiaNervosa",
  "author": "boderlineboderline",
  "created_utc": 1606862131.0,
  "title": "please someone relate",
  "selftext": "this is scary to admit, but sometimes i feel like i want my friend to starve herself too. she’s quite a bit overweight and i judge her a lot for it. i DO NOT want her to have to live with the constant pain and struggle of this disorder that i do, and the thought of that makes me really sad cus she’s a good person and doesn’t deserve that. yet she’s trying to lose weight but still eats a ton and eats junk food. whenever she talks about how she’s not losing weight or how much she eats i have to fight the urge not to suggest how much i ate to lose weight, or appetite suppressing tips. i never have said anything, but i always feel like i really really want to. i hate having this disorder and i want to get better but i also am kinda proud of myself for how much weight i’ve lost and just wish i could give that to her so she wouldn’t be so insecure about her body. i just feel really guilty about this and hope other people out there can relate :/",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/k4vxa5/please_someone_relate/",
  "score": 146,
  "num_comments": 22,
  "comments": [
    {
      "id": "gebhy3f",
      "author": "sorcerers_apprentice",
      "body": "I definitely don't want anybody to starve themselves.\n\nBut I do judge others for all the stupid ineffective bullshit they do to try to lose weight.",
      "created_utc": 1606870091.0,
      "score": 77,
      "context": []
    },
    {
      "id": "geban0l",
      "author": "EDanonyaccount",
      "body": "I feel this way a lot too! I never act on it but sometimes I want to ask “ how much do you actually want to loose weight? Cause if you really really want it maybe it should hurt” but that’s my ED brain talking, and I try to keep it to myself.",
      "created_utc": 1606866046.0,
      "score": 58,
      "context": []
    },
    {
      "id": "geb83hk",
      "author": "Anonymous204739",
      "body": "No you’re not the only one! I feel the exact same way sometimes. My parents are really overweight and I’m afraid of the health complications that come with being overweight (close if not obese). I know they are trying to diet but it’s not working. I see how much they eat and sometimes I just want to tell them to stop eating, to take away their piece of cake and tell them that that’s keeping them from losing weight. I never want them to have an ED, but sometimes I feel like an ED would be a quick fix to their problems.",
      "created_utc": 1606864692.0,
      "score": 30,
      "context": []
    },
    {
      "id": "gebnq8o",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1606873307.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gebtqlc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1606876636.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gedhb2g",
      "author": "OpheliaNoctis",
      "body": "It feels so wrong to admit but personally I actually enjoy beeing \"the skinniest friend\" and grudge anybody else this. \nAt the same time I judge people complaining about their weight and think they are just to weak and didn't  want it enough. \nI guess it's the ED talking because I wish nobody this disease but at the same time seeing people/friends on a heavier side I cant stop thinking I dont want to look like this which made recovery hard af.",
      "created_utc": 1606921130.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gecja5r",
      "author": "flowerscatsandqs",
      "body": "I can relate to this to an extent. I don’t *want* her to to develop ED behaviors, but my mom complains all the time about being overweight and wanting to lose. She’s just over the border between OW and NW, so it wouldn’t realistically be too difficult for her to get there. But then I see her eat loads of chips and nuts and cookies and I struggle, just like you, not to comment on it and explain how high calorie some of her eating habits are. It’s tough. It’s the disorder trying to control everything in our lives, at least imo, the people around us included. You aren’t an awful person, but please keep resisting that urge.",
      "created_utc": 1606893983.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gecnh08",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1606897906.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gebm13l",
      "author": "Lacebatty",
      "body": "I relate a bit. In my fucked up brain I want a friend to be my participant and confidant in my unhealthy ways but I want them to have already been in that mentality. I wouldn’t want to drag them down to my level. But I also know I don’t really want that. It helps my loneliness to fantasize about a friend who is “in on it” without judgement because they do it too. Is that weird?",
      "created_utc": 1606872356.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gebcr60",
      "author": "snakejex",
      "body": "My sister was (and has always been) overweight and now she’s obese. I know she wants to lose weight and it fucking hurts seeing her just gaining like I did. I don’t tell her any of my disordered shit but I know she doesn’t fully realize how damaging it is to be overweight not just physically but mentally since I know too well how it was. She just keeps eating.. it doesn’t make sense. You’re not alone :/",
      "created_utc": 1606867200.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gebi202",
      "author": "None",
      "body": "I feel this way towards strangers. Like, you don't fit in an airplane seat... just like don't eat for a while, it's not hard./s",
      "created_utc": 1606870150.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gebu8m7",
      "author": "shinyxcrab",
      "body": "Yea I sort of just roll my eyes when people talk to me about their weight or eating. “What’s your secret?” Idk maybe hating myself so much I want to die a slow painful death? But it is really hard to not just blurt out “devote your life to starving.” And people that say “starving makes you gain weight” really kills me. Like have you ever actually tried? Because if you did you would know that it doesn’t. But you can’t say that because then they would try it and might end up as messed up as you.",
      "created_utc": 1606876906.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gebxw23",
      "author": "shrillbitofnonsense",
      "body": "Relatable ♥️",
      "created_utc": 1606878929.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gec3147",
      "author": "Crafty_Nikki",
      "body": "I actually have Mia and kind of wish someone with Ana would teach me. Is that wrong of me? I know you guys hate living this way, but it works for you and I can't help but be jealous.",
      "created_utc": 1606881973.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gebnlx1",
      "author": "maonue",
      "body": "Yeah I've had that. Like I want to give people tips lol. Drives me crazy seeing people failing diets like... it doesn't have to be that way?",
      "created_utc": 1606873240.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gebh4pl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1606869638.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gebydkv",
      "author": "brookleiaway",
      "body": "i dont think this is an ed thing though, maybe influenced by the ed, but i think anyone would kind of go \"well what do you think would happen\" at someone trying to lose weight but eating abunch of junk food",
      "created_utc": 1606879214.0,
      "score": 22,
      "context": [
        {
          "id": "gebhy3f",
          "author": "sorcerers_apprentice",
          "body": "I definitely don't want anybody to starve themselves.\n\nBut I do judge others for all the stupid ineffective bullshit they do to try to lose weight.",
          "created_utc": 1606870091.0
        }
      ]
    },
    {
      "id": "gedhrad",
      "author": "OpheliaNoctis",
      "body": "This, I cant get myself to pity anyone who complains about not losing weight but at the same time still eating out 3 times a week. I guess this would be the same without a ED but probably less judgemental.",
      "created_utc": 1606921324.0,
      "score": 4,
      "context": [
        {
          "id": "gebhy3f",
          "author": "sorcerers_apprentice",
          "body": "I definitely don't want anybody to starve themselves.\n\nBut I do judge others for all the stupid ineffective bullshit they do to try to lose weight.",
          "created_utc": 1606870091.0
        }
      ]
    },
    {
      "id": "gebnuut",
      "author": "maonue",
      "body": "> how much do you actually want to loose weight? Cause if you really really want it maybe it should hurt\n\nYeah it drives me crazy in general when people \"want\" without being willing to put in the work... weight aside (as I am biased in that arena).",
      "created_utc": 1606873379.0,
      "score": 22,
      "context": [
        {
          "id": "geban0l",
          "author": "EDanonyaccount",
          "body": "I feel this way a lot too! I never act on it but sometimes I want to ask “ how much do you actually want to loose weight? Cause if you really really want it maybe it should hurt” but that’s my ED brain talking, and I try to keep it to myself.",
          "created_utc": 1606866046.0
        }
      ]
    },
    {
      "id": "gecw8oo",
      "author": "SarcasmManifest",
      "body": "This is very “normal” in people with an eating disorder...it’s part of the disease. Don’t beat yourself up for it...💕",
      "created_utc": 1606907324.0,
      "score": 7,
      "context": [
        {
          "id": "gebnq8o",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606873307.0
        }
      ]
    },
    {
      "id": "gecpvm6",
      "author": "boderlineboderline",
      "body": "she doesn’t know about my disorder, but she has made comments like “how do you eat (random junk food) and still stay skinny??” or “i wish i had a fast metabolism like you”. which is obviously uncomfortable for me cus i know it’s not my metabolism but idk how to tell her to stop. do you have any tips on setting boundaries with stuff like this without revealing your disorder? we work together, and most of the conversations like about food and weight happen there, so i can’t just literally walk away from the convo, and i have bad anxiety and have a hard time asking people not to do things. also i definitelyyyyy agree with that whole second part",
      "created_utc": 1606900377.0,
      "score": 2,
      "context": [
        {
          "id": "gecnh08",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1606897906.0
        }
      ]
    },
    {
      "id": "gecimkt",
      "author": "boderlineboderline",
      "body": "i feel the same! i don’t know of anyone who’s been through this irl so it’s very isolating",
      "created_utc": 1606893397.0,
      "score": 3,
      "context": [
        {
          "id": "gebm13l",
          "author": "Lacebatty",
          "body": "I relate a bit. In my fucked up brain I want a friend to be my participant and confidant in my unhealthy ways but I want them to have already been in that mentality. I wouldn’t want to drag them down to my level. But I also know I don’t really want that. It helps my loneliness to fantasize about a friend who is “in on it” without judgement because they do it too. Is that weird?",
          "created_utc": 1606872356.0
        }
      ]
    },
    {
      "id": "gebnidq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1606873185.0,
      "score": 4,
      "context": [
        {
          "id": "gebm13l",
          "author": "Lacebatty",
          "body": "I relate a bit. In my fucked up brain I want a friend to be my participant and confidant in my unhealthy ways but I want them to have already been in that mentality. I wouldn’t want to drag them down to my level. But I also know I don’t really want that. It helps my loneliness to fantasize about a friend who is “in on it” without judgement because they do it too. Is that weird?",
          "created_utc": 1606872356.0
        }
      ]
    },
    {
      "id": "geciy8p",
      "author": "boderlineboderline",
      "body": "no i get it, i felt the exact same way a couple years ago when i had purging disorder. idk how my disorder changed but over time it just kinda did. i don’t feel any happier or better about my body now though, even though i have lost weight. i hate myself just as much, i’m just smaller, and my health is worse.",
      "created_utc": 1606893686.0,
      "score": 3,
      "context": [
        {
          "id": "gec3147",
          "author": "Crafty_Nikki",
          "body": "I actually have Mia and kind of wish someone with Ana would teach me. Is that wrong of me? I know you guys hate living this way, but it works for you and I can't help but be jealous.",
          "created_utc": 1606881973.0
        }
      ]
    },
    {
      "id": "gebm3y9",
      "author": "boderlineboderline",
      "body": "i do want her to eat in moderation and be healthy, but whenever she talks about her weight or food i feel an urge to help her starve because i know it will make her lose weight. then i feel guilty for thinking that and i have both thoughts at the same time, like part of my brain tells me to give her tips to starve because it will help her, but then the other part says it’s wrong. i guess it’s my ED talking when it encourages me to “help” her, but i just feel so guilty every time those thoughts and urges come into my brain. i know its very confusing i don’t know how else to word it i’m sorry :(",
      "created_utc": 1606872401.0,
      "score": 3,
      "context": [
        {
          "id": "gebh4pl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606869638.0
        }
      ]
    },
    {
      "id": "geblk75",
      "author": "Lacebatty",
      "body": "Well to be fair, this is an ana group. We can only hope for what we know. It’s not like we’re experts on healthy eating. She just wants her friend to be healthy and thin in the only way she knows how to help her achieve that.",
      "created_utc": 1606872091.0,
      "score": 1,
      "context": [
        {
          "id": "gebh4pl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606869638.0
        }
      ]
    },
    {
      "id": "gebnn41",
      "author": "Lacebatty",
      "body": "It’s not the same :/  I agree.",
      "created_utc": 1606873258.0,
      "score": 4,
      "context": [
        {
          "id": "gebm13l",
          "author": "Lacebatty",
          "body": "I relate a bit. In my fucked up brain I want a friend to be my participant and confidant in my unhealthy ways but I want them to have already been in that mentality. I wouldn’t want to drag them down to my level. But I also know I don’t really want that. It helps my loneliness to fantasize about a friend who is “in on it” without judgement because they do it too. Is that weird?",
          "created_utc": 1606872356.0
        },
        {
          "id": "gebnidq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606873185.0
        }
      ]
    }
  ]
}