{
  "id": "k828bt",
  "subreddit": "AnorexiaNervosa",
  "author": "misha-poppy",
  "created_utc": 1607289254.0,
  "title": "DAE hate other people for eating?",
  "selftext": "On the one hand, my anorexia gets such a kick out of people eating because “ooo yay they’re consuming more calories than me!” BUT, on the other hand, I absolutely despise, for example, my grandma, because she is CONSTANTLY eating. I think that it stems from jealousy that she just eats freely (and consumes a LOT of calories) and doesn’t care. \n\nSuch a stupid contradictory, illogical illness. Has 2 opposing answers for EVERY situation",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/k828bt/dae_hate_other_people_for_eating/",
  "score": 150,
  "num_comments": 18,
  "comments": [
    {
      "id": "gevkn7k",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1607290459.0,
      "score": 36,
      "context": []
    },
    {
      "id": "gevx3ok",
      "author": "Yola-tilapias",
      "body": "Yes. When I see people eating I'm like they have no self-control and that's why they're fat and I'm not.\n\nSimultaneously how come they get to eat and not me.",
      "created_utc": 1607296799.0,
      "score": 38,
      "context": []
    },
    {
      "id": "gew1yr4",
      "author": "SpaghettiMaggie",
      "body": "Im the other way around. I hate it when people around me don’t eat/ are on a diet.",
      "created_utc": 1607299303.0,
      "score": 23,
      "context": []
    },
    {
      "id": "gevqx34",
      "author": "BoozeyTurtlez",
      "body": "Yes I feel the exact same way",
      "created_utc": 1607293601.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gevtkas",
      "author": "None",
      "body": "Yes..I came back the other day from work and my mum was making herself grilled cheese for dinner. I just thought how dare she and got so angry bc I couldnt have any dinner",
      "created_utc": 1607294979.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gew50lb",
      "author": "Altruistic-Bake8266",
      "body": "i mean i like when i’m eating less than other people but at the same time i get like really intense secondhand anxiety and distress when people are eating a lot of food or i think about how much people i know actually eat in a day. like even when i watch mukbangs sometimes it makes me so stressed out that i’ll cry. it’s like this intense phobia i have where the thought of people overeating is so horrifying to me, honestly it’s probably a lot of where my ed stems from",
      "created_utc": 1607300873.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gewiyzu",
      "author": "purplelilly95",
      "body": "yes all the time. makes me want to cry sometimes how people can just eat and not have a second thought. must be amazing",
      "created_utc": 1607308644.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gewuem8",
      "author": "None",
      "body": "For strangers, I feel a great false sense of superiority when they eat. For my healthy weight family, I feel SO smart when they don't notice I haven't eaten in days. \n\nBUT - my unhealthy family members literally eat every moment from when they wake up to when they fall asleep. It is just constant. They also have tons of health issues and like to pretend it's not their diet. It makes me so upset.",
      "created_utc": 1607315479.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gex2vmp",
      "author": "Ironicbanana14",
      "body": "Yes but for me its disgust. They could be eating normal but in my head it looks like a sloppy pig. Its so digusting to me sometimes i get the urge to gag and i have to look away so they cant see my ugly scowl. I try to contain it *so hard* it makes so so guilty because i know its all my own fault and in my head.\n\nBut god forbid if the person actually is a messy eater, i have to leave the room or walk away. Im kinda glad dine in is closed because sitting next to a table with a family of gross eaters was my personal hell.",
      "created_utc": 1607321740.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gex3kjc",
      "author": "beeplo",
      "body": "My fucking boyfriend! Eats so much! I suspect he might have a binging disorder but I'm on the opposite side of the spectrum, so I'm sitting here, 30+ hrs into my fast, STARVING, with a splitting headache and slight nausea, watching this man eat plate after plate after plate.\n\nI want to cry.",
      "created_utc": 1607322310.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gexdr0i",
      "author": "sewer_mermaid",
      "body": "i count other people’s calories and get upset if they eat less than me lol...",
      "created_utc": 1607332047.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gexehqi",
      "author": "boderlineboderline",
      "body": "i relate to this so much, especially that last line. i feel like my mind is constantly conflicted and it’s always contradicting itself. one day i feel one thing, the next i feel the complete opposite. it’s so exhausting",
      "created_utc": 1607332847.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gex43y2",
      "author": "justonium",
      "body": "Maybe not *hate*, but yes definitely i do sometimes feel very even maybe irrationally annoyed when others just ever-so-casually break out the munchies.\n\nFor me, finally giving in to the food is *ANYTHING*, but casual, and when i see other people seem to do this, i am maybe jealous, but probably more instead, maybe even somehow irrationally offended like that you are treating your fellow human beings even more casually than you are right now treating that food? Totally irrational, I know...",
      "created_utc": 1607322762.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gexmr7f",
      "author": "Wrencer4Endgame",
      "body": "Lmaooo I hate other ppl for consuming more calories than me whereas I put on weight just looking at a croissant",
      "created_utc": 1607341842.0,
      "score": 1,
      "context": []
    },
    {
      "id": "geydftf",
      "author": "averageorganism",
      "body": "Exact opposite. I’m afraid I’m going to give my little sisters binging issues because I constantly tell them to “finish all the food” or “eat it before I wake up” etc",
      "created_utc": 1607358844.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gezd3ou",
      "author": "kaleidoscopickitty94",
      "body": "I don’t know about hate but I have a friend who eats A LOT of food in one sitting and then her stomach gets so bloated likes she’s three months pregnant (she has digestion issues sometimes). I find it really hard not to stare when she eats or at her stomach afterwards. Equal parts shock, awe, and disgust. I never say anything but I know she’s caught me staring, I usually point something harmless out about her body and compliment it so she thinks I’m looking at something else 😓",
      "created_utc": 1607373506.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gewz6w3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1607318830.0,
      "score": 2,
      "context": [
        {
          "id": "gevkn7k",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1607290459.0
        }
      ]
    },
    {
      "id": "gexhsb6",
      "author": "Usual-Job4631",
      "body": "exactly my brain",
      "created_utc": 1607336515.0,
      "score": 3,
      "context": [
        {
          "id": "gevx3ok",
          "author": "Yola-tilapias",
          "body": "Yes. When I see people eating I'm like they have no self-control and that's why they're fat and I'm not.\n\nSimultaneously how come they get to eat and not me.",
          "created_utc": 1607296799.0
        }
      ]
    },
    {
      "id": "gexfs0q",
      "author": "misha-poppy",
      "body": "Me too! Anorexia finds a reason to hate everyone. Ahhhh, such a fun life..",
      "created_utc": 1607334262.0,
      "score": 5,
      "context": [
        {
          "id": "gew1yr4",
          "author": "SpaghettiMaggie",
          "body": "Im the other way around. I hate it when people around me don’t eat/ are on a diet.",
          "created_utc": 1607299303.0
        }
      ]
    },
    {
      "id": "gexfvro",
      "author": "misha-poppy",
      "body": "Haha mood! My grandparents aren’t allowed to eat near me because of the noises and EW",
      "created_utc": 1607334378.0,
      "score": 3,
      "context": [
        {
          "id": "gex2vmp",
          "author": "Ironicbanana14",
          "body": "Yes but for me its disgust. They could be eating normal but in my head it looks like a sloppy pig. Its so digusting to me sometimes i get the urge to gag and i have to look away so they cant see my ugly scowl. I try to contain it *so hard* it makes so so guilty because i know its all my own fault and in my head.\n\nBut god forbid if the person actually is a messy eater, i have to leave the room or walk away. Im kinda glad dine in is closed because sitting next to a table with a family of gross eaters was my personal hell.",
          "created_utc": 1607321740.0
        }
      ]
    }
  ]
}