{
  "id": "k9po5m",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1607510401.0,
  "title": "skinny instagram models can be so fucking annoying tw",
  "selftext": "i was just scrolling through instagram and a tik tok came up of the skinniest model i have ever seen but i’m assuming she was healthy and it was a video and she was like “what people think i eat!” and it was like some lettuce or idk something healthy. and then she went “VS. what i actually eat!” and it was a big slice of chunky cheese pizza. then she turned around and showed how slim her waist was and how she was absolutely tiny while eating the pizza. it literally made me want to die. i know other bodies shouldn’t trigger me but what the fuck? why can’t i have those genetics. or even if she is lying about eating pizza like why would someone do that. i think i’m just mad for no reason. lol. this probably sounds stupid.\n\nedit: thank u for the award! i think i got one. i’m rly new to reddit so idk. that’s rly sweet hehe",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/k9po5m/skinny_instagram_models_can_be_so_fucking/",
  "score": 342,
  "num_comments": 31,
  "comments": [
    {
      "id": "gf69e0s",
      "author": "UnderseaK",
      "body": "It’s absolutely incredibly frustrating! My personal theory is that they are actually deep in restriction/over exercise but want to cover their tracks so people stop calling them out. They either don’t know or don’t care that it is misleading and damaging to their followers. ☹️",
      "created_utc": 1607526937.0,
      "score": 46,
      "context": []
    },
    {
      "id": "gf64yjx",
      "author": "dudecass",
      "body": "totally fuckin agree with ur title, i stopped using all my social media besides reddit abt 2 months ago and honestly its been SOOO much easier for me to try to get better. try taking a break from those apps for a while.",
      "created_utc": 1607524585.0,
      "score": 90,
      "context": []
    },
    {
      "id": "gf64va8",
      "author": "Tajskskskss",
      "body": "Yeah that’s bullshit. In most cases, genetics can’t defeat thermodynamics past childhood. She might eat cheesy pizza sometimes, but she probably does restrict/work out/eat healthy most of the time.",
      "created_utc": 1607524535.0,
      "score": 47,
      "context": []
    },
    {
      "id": "gf5tlah",
      "author": "openbook143",
      "body": "no it doesn’t sound stupid at all actually. if her waist really is as small as u describe it to be then there is no way in hell you can eat just unhealthy junk on a daily basis and be that skinny. ofc there are people with genetics that make them less susceptible to gaining weight but even those people need to exercise at least a little and at least eat normal healthy food to stay fit. it’s just how a human body works. it does get infuriating to look at models pretending to be perfect but we must remember that it is wrong to take out our frustration on them. there are a lot of times where it really isn’t the model’s fault but the brand or company that they work with. they force these models to portray a perfect and happy lifestyle so these companies can feed off of our insecurities and earn money. models themselves are victims to a lot of disorders like us and are under a lot of pain because of the pressure to maintain a “perfect” reputation",
      "created_utc": 1607517000.0,
      "score": 44,
      "context": []
    },
    {
      "id": "gf6t224",
      "author": "ThrowRAboredaff",
      "body": "Just wanted to mention some stuff that you may already be aware of but I wasn’t sure. My opinion on this is that it’s usually bullshit for a few reasons. \n\n1.) People ABSOLUTELY lie about that kind of thing... it’s seen as “quirky” to say things like “lol I love cheeseburgers and eat like sooo much but look how petite I am”... Many high fashion models are guilty of this even. (Bella hadid and Kendal Jenner especially annoy the fuck out of me with how much they talk about how “bad” their diets are)... The issue is that these people want to be seen as naturally beautiful, and tie their identity to their appearance. If they admit to putting effort into their appearance, it shatters the illusion of perfection they are aiming to create. It’s the same reason many models refuse to admit to getting plastic surgery, even if it’s obvious. \n\nAnother reason they could be putting this image up is to avoid criticism or concern. I had a friend that was insanely beautiful growing up, and was literally stick thin. She’s still insanely beautiful and actually has a pretty successful Instagram now. She would constantly say things like “I wish I could gain weight”, and “I love eating soooo much. I literally eat nothing but sweets and pizza lolll”... anyway I knew it was all bullshit. The real reason she was insanely skinny was because she has severe anxiety that made her feel too sick to eat. She also engaged in self harm and other self destructive behaviors. While she wasn’t actively searching to lose weight, she stayed skinny as a result of her mental illness. She would say those things as a way to mask the pain she was experiencing, and to avoid being “looked down on” as she put it. \n\nGenetics only go so far. There are rare occasions that people are naturally thin, but even then, their lifestyle influences it whether they know it or not. \n\nAlso, They simply may be under the impression that they are eating more than they really are because of their hunger cues. \nAnother good friend of mine had no hunger cues, and always talked about how much unhealthy food she ate. She would eat “unhealthy”, but would only eat like 1 slice of pizza a day and not much else. This is because she didn’t get hungry.... This is not normal. In her case this was caused by a medical issue. She ended up having a hormonal disorder that messed with hunger signals. That isn’t healthy, and she had pretty severe vitamin deficiencies without even knowing it. If someone’s baseline is to feel shitty, they aren’t naturally thin. They just don’t know how to be healthy. That’s not something to envy. \n\nI know the urge to be thin often overshadows the care for health, but I bring these things up for a reason. People passing off insane thinness as being effortless, are usually lying to promote an image, or they live unhealthy lifestyles themselves. That’s the majority of people. Yes there are still outliers, but it’s pretty rare. It’s ok that u aren’t an outlier. You are ok the way u are. Your genetics aren’t wrong, you just don’t know the entire story of other people’s lives. Don’t take what they say at face value. Don’t let their “genetics” be a reason to hate on yourself.",
      "created_utc": 1607536121.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gf6d8o2",
      "author": "Shalkic",
      "body": "It’s the absolute worst seeing people like that. I really love tiktok, but for some reason I keep getting some like that. Or just in general a lot of “What I Eat in a Day” where they either restrict a ton or eat healthy, but with tons of calories and still look so skinny and lean. I hate that I feel like I can never achieve what they have; it makes being in recovering absolutely miserable.",
      "created_utc": 1607528831.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gf76qkn",
      "author": "pinkhydroflask1234",
      "body": "When Naya Rivera died they found prescription appetite suppressants in her system. Her insta made it seem that her incredible body was due to healthy eating and exercise...it wasn’t (ik it helped but you know what I mean). This isn’t any shade to Naya, I hate that I have to use her as an example, but it’s the truth. We literally cannot compare ourselves to others because seriously it’s all bs. Took me a while to really stop comparing myself, it’s really shitty to sell a fake idea to impressionable people though, no matter who you are.",
      "created_utc": 1607542402.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gf6rdu0",
      "author": "FayrisDraconis",
      "body": "They think that shit is helping against rumors about EDs but it's so triggering and most of the time it seems like a lie to me, models do this crap all the time but nobody thinks about the fact that exercising until everything you ate is burned off is a way of purging too :|",
      "created_utc": 1607535367.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gf76yu7",
      "author": "MoosieGoose",
      "body": "I have a thinspo image saved of a tiny, modified human dangling a massive peice of pizza in front of them like they're going to eat it. They make eating greasy carbs look sexy. It's a total mind fuck! \n\n&#x200B;\n\nBut I've known someone for decade (most of her family is like this, too) but she's been a model in the past & doesn't work for her body AT ALL. She takes care of herself & looks beautiful, but seeing her you'd be concerned something was wrong...until she breaks out her stash of snacks and candy from her purse <3 Some people do just have that kind of luck it seems!",
      "created_utc": 1607542506.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gf7e8i9",
      "author": "None",
      "body": "why do ppl have to talk about their weight/body and food in general lmfao",
      "created_utc": 1607545883.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gf5z928",
      "author": "ayrisucmak",
      "body": "You are so fucking right those dumbasses has no idea what they can lead to.",
      "created_utc": 1607521164.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gf69i2t",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1607526993.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gf7ro5h",
      "author": "None",
      "body": "I posted a rant on r/diettea about this EXACT thing, sounds like we might have watched the exact same video...\n\nEDs are rampant in the modelling and influencer industry, chances are she is NOT that skinny.",
      "created_utc": 1607552316.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gf88o9g",
      "author": "yayomuse",
      "body": "Nearly all the influencers i follow on insta for fashion insp *constantly* call themselves \"small/smol\" and \"tiny\" when people in their mentions ask for their weight/height. And because their style caters to a certain aesthetic, it makes it seem like you can only embody that look if you have 2 or 3 of your ribs removed. It's almost insulting. They're probably nice people and don't mean any harm but it's still really harmful.",
      "created_utc": 1607561297.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gf8d6g7",
      "author": "Trevor4everdudes",
      "body": "It helps to visit r/instagramreality sometimes",
      "created_utc": 1607563810.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gf8k8km",
      "author": "Petite_Piplup",
      "body": "they probably only take bites for the camera, I doubt they eat like that off camera",
      "created_utc": 1607567703.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gf94sb6",
      "author": "Struudos",
      "body": "For the record, I think you’re justified in your triggering. It’s difficult to see other people have what we aren’t allowed to posses, it’s okay to get mad. Even if your anger wasn’t justified, they are still your emotions, and they are thus valid.\nYou don’t sound stupid, you just sound human :)",
      "created_utc": 1607580999.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gf6umyc",
      "author": "brookleiaway",
      "body": "i feel like when they flex how small their waist is while eating unhealthy and are self aware about it they probably have an ed",
      "created_utc": 1607536836.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gf6zd1k",
      "author": "MK_521998",
      "body": "Who says other bodies shouldn't trigger you?? \n\nThat's bull, IMO. Although I'm active right now, I've been at war with this disease for almost 20 years (and I'm only 26) \n\nDuring those two decades, I've been all over the country seeking therapy and medical intervention, and even in EDA meetings, the men and women who introduce themselves as \"recovered\" share their own battles when it comes to comparing themselves to others, being triggered by someone else's innocuous actions around food, analyzing bodies, etc. \n\nI think something that's really important, as we all try to take steps forward and learn how to cope and start building relationships with ourselves, is to acknowledge that triggers and intrusive thoughts are okay. \n\nYou most definitely aren't mad for no reason, but don't set expectations on yourself based on whatever someone else's recovery might look like. \n\nMaybe one person isn't triggered by the Instagram model eating pizza, but they are triggered by the slim girl in front of them in the fast food line who just ordered a large combo meal? \n\nPlease, u/outofdatepudding, don't invalidate your triggers or write off what impacts you, don't judge your emotions.\n\nIn my experience, judging my emotions is a sure fire way for ED to creep back in and start judging my body. \n\nI'm here for you💕",
      "created_utc": 1607539016.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gf7158w",
      "author": "None",
      "body": "she is fucking lying and she sounds like a purger.",
      "created_utc": 1607539828.0,
      "score": -1,
      "context": []
    },
    {
      "id": "gf8agxt",
      "author": "None",
      "body": "I mean, maybe she saves her BMR calories for junk food? I eat junk food pretty much every third day in a week and I'm fine. Maintaining.",
      "created_utc": 1607562300.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfb2t3z",
      "author": "snooksbk",
      "body": "Uhg I saw this exact video and rolled my eyes so hard. Right there with you.",
      "created_utc": 1607624647.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfhdmes",
      "author": "MackyWacky123",
      "body": "people think it's so quarky to be able to eat a lot and stay thin. grosses me tf out. so \"pick me choose me love me🥺\" ultimate pick me girls.",
      "created_utc": 1607741824.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gf6cvqu",
      "author": "Shalkic",
      "body": "Idk I really do know someone in rl who is like that, and I know for certain she doesn’t restrict or exercise.",
      "created_utc": 1607528660.0,
      "score": 8,
      "context": [
        {
          "id": "gf69e0s",
          "author": "UnderseaK",
          "body": "It’s absolutely incredibly frustrating! My personal theory is that they are actually deep in restriction/over exercise but want to cover their tracks so people stop calling them out. They either don’t know or don’t care that it is misleading and damaging to their followers. ☹️",
          "created_utc": 1607526937.0
        }
      ]
    },
    {
      "id": "gf856me",
      "author": "None",
      "body": "Same!!! The break has honestly been amazing, I didn’t realize how negatively Instagram was affecting me until I quit",
      "created_utc": 1607559405.0,
      "score": 5,
      "context": [
        {
          "id": "gf64yjx",
          "author": "dudecass",
          "body": "totally fuckin agree with ur title, i stopped using all my social media besides reddit abt 2 months ago and honestly its been SOOO much easier for me to try to get better. try taking a break from those apps for a while.",
          "created_utc": 1607524585.0
        }
      ]
    },
    {
      "id": "gf6vvxk",
      "author": "JackStrawBerryfields",
      "body": "Or she purged as soon as they were done filming. #irl isn't nearly as glamorous as IG models and influencers would lead you to believe",
      "created_utc": 1607537415.0,
      "score": 17,
      "context": [
        {
          "id": "gf64va8",
          "author": "Tajskskskss",
          "body": "Yeah that’s bullshit. In most cases, genetics can’t defeat thermodynamics past childhood. She might eat cheesy pizza sometimes, but she probably does restrict/work out/eat healthy most of the time.",
          "created_utc": 1607524535.0
        }
      ]
    },
    {
      "id": "gf6obiw",
      "author": "mothermother_is_cool",
      "body": "you can eat whatever you want as long as it is in your calorie allowance though... like models are tall and very active so their TDEEs can easily be around [redacted highish number of calories] and pizza fits easily into that",
      "created_utc": 1607533987.0,
      "score": 15,
      "context": [
        {
          "id": "gf5tlah",
          "author": "openbook143",
          "body": "no it doesn’t sound stupid at all actually. if her waist really is as small as u describe it to be then there is no way in hell you can eat just unhealthy junk on a daily basis and be that skinny. ofc there are people with genetics that make them less susceptible to gaining weight but even those people need to exercise at least a little and at least eat normal healthy food to stay fit. it’s just how a human body works. it does get infuriating to look at models pretending to be perfect but we must remember that it is wrong to take out our frustration on them. there are a lot of times where it really isn’t the model’s fault but the brand or company that they work with. they force these models to portray a perfect and happy lifestyle so these companies can feed off of our insecurities and earn money. models themselves are victims to a lot of disorders like us and are under a lot of pain because of the pressure to maintain a “perfect” reputation",
          "created_utc": 1607517000.0
        }
      ]
    },
    {
      "id": "gf6zop5",
      "author": "None",
      "body": "You can always choose the \"I don't want to see this\" option. I don't get anything like that on my fyp",
      "created_utc": 1607539163.0,
      "score": 4,
      "context": [
        {
          "id": "gf6d8o2",
          "author": "Shalkic",
          "body": "It’s the absolute worst seeing people like that. I really love tiktok, but for some reason I keep getting some like that. Or just in general a lot of “What I Eat in a Day” where they either restrict a ton or eat healthy, but with tons of calories and still look so skinny and lean. I hate that I feel like I can never achieve what they have; it makes being in recovering absolutely miserable.",
          "created_utc": 1607528831.0
        }
      ]
    },
    {
      "id": "gf69lu5",
      "author": "None",
      "body": "we’ve all experienced this same situation hahahaha",
      "created_utc": 1607527046.0,
      "score": 2,
      "context": [
        {
          "id": "gf69i2t",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1607526993.0
        }
      ]
    },
    {
      "id": "gf6zt0o",
      "author": "None",
      "body": "thank you my love",
      "created_utc": 1607539218.0,
      "score": 2,
      "context": [
        {
          "id": "gf6zd1k",
          "author": "MK_521998",
          "body": "Who says other bodies shouldn't trigger you?? \n\nThat's bull, IMO. Although I'm active right now, I've been at war with this disease for almost 20 years (and I'm only 26) \n\nDuring those two decades, I've been all over the country seeking therapy and medical intervention, and even in EDA meetings, the men and women who introduce themselves as \"recovered\" share their own battles when it comes to comparing themselves to others, being triggered by someone else's innocuous actions around food, analyzing bodies, etc. \n\nI think something that's really important, as we all try to take steps forward and learn how to cope and start building relationships with ourselves, is to acknowledge that triggers and intrusive thoughts are okay. \n\nYou most definitely aren't mad for no reason, but don't set expectations on yourself based on whatever someone else's recovery might look like. \n\nMaybe one person isn't triggered by the Instagram model eating pizza, but they are triggered by the slim girl in front of them in the fast food line who just ordered a large combo meal? \n\nPlease, u/outofdatepudding, don't invalidate your triggers or write off what impacts you, don't judge your emotions.\n\nIn my experience, judging my emotions is a sure fire way for ED to creep back in and start judging my body. \n\nI'm here for you💕",
          "created_utc": 1607539016.0
        }
      ]
    },
    {
      "id": "gf6fdbv",
      "author": "UnderseaK",
      "body": "That’s fair, but I feel like those people are in the (very small) minority. Given the hundreds and hundreds of Instagram models that claim “it’s just fast metabolism”, I’d say that most of them at least aren’t telling the whole story.",
      "created_utc": 1607529849.0,
      "score": 12,
      "context": [
        {
          "id": "gf69e0s",
          "author": "UnderseaK",
          "body": "It’s absolutely incredibly frustrating! My personal theory is that they are actually deep in restriction/over exercise but want to cover their tracks so people stop calling them out. They either don’t know or don’t care that it is misleading and damaging to their followers. ☹️",
          "created_utc": 1607526937.0
        },
        {
          "id": "gf6cvqu",
          "author": "Shalkic",
          "body": "Idk I really do know someone in rl who is like that, and I know for certain she doesn’t restrict or exercise.",
          "created_utc": 1607528660.0
        }
      ]
    },
    {
      "id": "gf77zqp",
      "author": "Tajskskskss",
      "body": "Exactly. I have a feeling that lots of eating videos (including mukbangs) are followed by a purge. Like let’s just be realistic lmao.",
      "created_utc": 1607542980.0,
      "score": 10,
      "context": [
        {
          "id": "gf64va8",
          "author": "Tajskskskss",
          "body": "Yeah that’s bullshit. In most cases, genetics can’t defeat thermodynamics past childhood. She might eat cheesy pizza sometimes, but she probably does restrict/work out/eat healthy most of the time.",
          "created_utc": 1607524535.0
        },
        {
          "id": "gf6vvxk",
          "author": "JackStrawBerryfields",
          "body": "Or she purged as soon as they were done filming. #irl isn't nearly as glamorous as IG models and influencers would lead you to believe",
          "created_utc": 1607537415.0
        }
      ]
    }
  ]
}