{
  "id": "ki1i7n",
  "subreddit": "AnorexiaNervosa",
  "author": "boderlineboderline",
  "created_utc": 1608626269.0,
  "title": "does anyone else compare themselves to *literal* children?",
  "selftext": "i was at the mall today and saw a girl who must have been like 9 or 10, and i was JEALOUS OF HER BODY. i felt so fat and insecure because she was so skinny... and she was literally a child. i am 20 years old. do i really hate my body so much that i’m comparing myself to children?? i hate this disorder so much",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ki1i7n/does_anyone_else_compare_themselves_to_literal/",
  "score": 334,
  "num_comments": 28,
  "comments": [
    {
      "id": "ggojtqw",
      "author": "None",
      "body": "oh i can definitely relate to this :( i was a super skinny kid and sometimes it feels like i want not only my body but like the good memories i had of being a kid back",
      "created_utc": 1608634466.0,
      "score": 71,
      "context": []
    },
    {
      "id": "ggoovx8",
      "author": "None",
      "body": "I’m jealous of myself at 14 years old. Can’t believe I thought I was fat then. I got to the weight I was then this year, but it didn’t look the same. It’s not so much that I want to look like a kid, I just want to be androgynous. I don’t like having the curves of a grown woman, I don’t want to draw attention to myself, I just want to be this skinny genderless being.",
      "created_utc": 1608639515.0,
      "score": 44,
      "context": []
    },
    {
      "id": "ggoorxj",
      "author": "UnusualRedditter",
      "body": "Oh my God I'm not alone. Yes. All the time. \nI feel disgusting for looking at a literal child and thinking that I want her legs because they're so tiny.",
      "created_utc": 1608639415.0,
      "score": 28,
      "context": []
    },
    {
      "id": "ggot3xc",
      "author": "loldoggos",
      "body": "All the time. It makes me feel like a creepy person too.",
      "created_utc": 1608642967.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ggp5lg2",
      "author": "None",
      "body": "I wasn't a small child, I wasn't particularly heavy either, just not really thin. I miss not caring though, I miss feeling like I was gorgeous in my own skin. I had such confidence back then, before someone let me in on the secret that the world would disagree with me and judge me.",
      "created_utc": 1608650747.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ggp0j4q",
      "author": "None",
      "body": "i get jealous of my own body from when i was a child",
      "created_utc": 1608647840.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ggp0y3q",
      "author": "shinyxcrab",
      "body": "I (27F) think for me at least my anorexia involves age regression not just physically but mentally and emotionally as well. I still grieve over losing my child self and I grieve over the things that happened to me as a child that shaped the way I feel about myself now. I look back at pictures of myself as a 6 year old and think I am so beautiful. That is my whole idea of beauty. Just that little carefree 6 year old that I once was. Everything that she represents. AN is a really complex thing. There are lots of reasons why it will manifest, but I can definitely connect the dots between the age thing and my own disorder. It started off as me thinking “I just want to be smaller” and ended up to be “I just want to look like and be a child again”. People say “that’s not attractive.” I’m not trying to be attractive. I don’t want anyone to even touch me. I just want to be a kid again.",
      "created_utc": 1608648091.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ggphd9f",
      "author": "BonnabellB",
      "body": "I work with children and I find myself comparing me to them all the time. Even tho they are literally children and I’m in my early 20’s",
      "created_utc": 1608656894.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ggr61yu",
      "author": "Silver_Oakleaf",
      "body": "Gosh it’s crazy how much I relate to this. I see teenage boys who’ve just had their growth spurt and they’re all tall and super skinny and I’m so irrationally jealous",
      "created_utc": 1608688041.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ggpky33",
      "author": "T_86",
      "body": "34f here, I’m not jealous of children but I still get quite jealous of teenagers who obviously have higher metabolisms then me. My 18 year old niece is a huge trigger for me. I try my best to fight those thoughts because it’s not her fault and I love her so much so I do want to be around her still...it’s just hard.",
      "created_utc": 1608658716.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ggpsg7k",
      "author": "makeupyourworld",
      "body": "yes i used to be a nanny for a 4 year old and he was like 35 pounds and liked to weigh himself on his moms scale for fun and i would genuinely be envying a baby",
      "created_utc": 1608662493.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ggp6zf2",
      "author": "BroccoliAcceptable17",
      "body": "Me",
      "created_utc": 1608651504.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggpbxm0",
      "author": "anonkcthtk",
      "body": "I do and it makes me feel horrible",
      "created_utc": 1608654127.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggq44fh",
      "author": "petewentz-from-mcr",
      "body": "I don’t just envy children, I envy like... unhealthy children. Like when I was a kid I was always underweight and like I feel awful for it but I want my malnourished 12 year old body back and I kinda hate that, and like any time I see those kids who struggle to gain weight to stay on the growth curve I’m like ah yes that’s goals and LITERALLY WHY\n\nSo you’re not alone for sure",
      "created_utc": 1608668427.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggq6geu",
      "author": "fuckedupceiling",
      "body": "Ugh, I always compare myself to my best friend's little sister and I hate it. I don't know how to stop. she's a heavy 5 year old and her clothes fit me so I feel empowered when looking at her. I feel like the worst person ever. Like I'm 21 and still competing against petty stuff in my mind against little children??",
      "created_utc": 1608669497.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggq9nnw",
      "author": "redhead_in_red",
      "body": "Yep! Maybe not 9 or 10 year olds, but I def find myself getting triggered by skinny 13-14 year old girls...\n\nAnd the rational part of me *knows* that the reason they look like that is because they haven't developed into women yet, and that is sick that our society glorifies that type of body etc etc, but the *dumb ED* part of my brain is just like **skinny**",
      "created_utc": 1608671017.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggqchpn",
      "author": "ThaliaGrace3lo",
      "body": "it's about seing someone so pure, that (at least me) are taken aback by all the memories of being this happy. To me it's more then a body. I want to go back. I want to be pure again.",
      "created_utc": 1608672421.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggos4ko",
      "author": "None",
      "body": "when i was 14 i had something catastrophic happen in my life that led me to get fat.\n\nmy anorexia started when i was 16 and i had always worn xl clothes, but 4 years later and i can wear shirts i wore when i was 7.\n\nthey’re tight, and a bit short as i’m tall, but i can wear them. my anorexia is ecstatic about this but it scares me.",
      "created_utc": 1608642219.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ggpunrb",
      "author": "pm_me_free_housing",
      "body": "not so much with other kids tbh but i like to look at old pictures of me from like 10-14 when i was really fuckin skinny and cry over it sometimes lol",
      "created_utc": 1608663610.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggpvxl4",
      "author": "herpes-free-since-14",
      "body": "my girlfriend also does the same thing all the time, and it makes her feel bad afterwards hey it's okay don't worry it wasn't your fault.",
      "created_utc": 1608664258.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggq29lo",
      "author": "j01ene",
      "body": "I am 30 and I still do that",
      "created_utc": 1608667489.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggqoxr7",
      "author": "rats420666",
      "body": "There is this kid my age in my class who still looks like 9, and is really short and skinny. I remember when I mentioned metabolism, I was paranoid mine was slow, and he was like \"I think i have a fast metabolism because I can eat what I want\" and i felt a tad insecure.",
      "created_utc": 1608678683.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggr80jy",
      "author": "AnaRunner262",
      "body": "I completely relate. I'm triggered by my 12yr old niece, because she reminds me so much of myself at that age- lanky and lean and tall. Pre-puberty. \n\nAnd it reminds me of a random conversation on the 7th grade bus where this girl next to me tried wrapping her hand around my arm and wrist, and then commented about how skinny my knees were and how she'd never seen anyone with skinny knees. And now when I see my niece, I'm triggered, and instantly body check my arm and wrist and hear bus-girl's comment about my skinny knees. And I'm 41yrs old now!",
      "created_utc": 1608689142.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggvf0zi",
      "author": "10Tinyacorns",
      "body": "Oh yes. I get irrationally jealous and then angry at my younger cousin who is in literal middle school",
      "created_utc": 1608786256.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggphe99",
      "author": "siriushendrix",
      "body": "I so heavily relate to this and it's part of the reason for my baggy clothes",
      "created_utc": 1608656908.0,
      "score": 9,
      "context": [
        {
          "id": "ggoovx8",
          "author": "None",
          "body": "I’m jealous of myself at 14 years old. Can’t believe I thought I was fat then. I got to the weight I was then this year, but it didn’t look the same. It’s not so much that I want to look like a kid, I just want to be androgynous. I don’t like having the curves of a grown woman, I don’t want to draw attention to myself, I just want to be this skinny genderless being.",
          "created_utc": 1608639515.0
        }
      ]
    },
    {
      "id": "ggpsixs",
      "author": "boderlineboderline",
      "body": "yup me too! i’m so glad so many people can relate because i was scared i was the only one",
      "created_utc": 1608662531.0,
      "score": 4,
      "context": [
        {
          "id": "ggot3xc",
          "author": "loldoggos",
          "body": "All the time. It makes me feel like a creepy person too.",
          "created_utc": 1608642967.0
        }
      ]
    },
    {
      "id": "lopega2",
      "author": "TheOddDyingPotato11",
      "body": "Never related to anything as much as this,, I’m really tall and my whole life I’ve just wanted to be small,, I idealise my child self and I wish I could go back in time I miss my old life so much",
      "created_utc": 1727192248.0,
      "score": 1,
      "context": [
        {
          "id": "ggp0y3q",
          "author": "shinyxcrab",
          "body": "I (27F) think for me at least my anorexia involves age regression not just physically but mentally and emotionally as well. I still grieve over losing my child self and I grieve over the things that happened to me as a child that shaped the way I feel about myself now. I look back at pictures of myself as a 6 year old and think I am so beautiful. That is my whole idea of beauty. Just that little carefree 6 year old that I once was. Everything that she represents. AN is a really complex thing. There are lots of reasons why it will manifest, but I can definitely connect the dots between the age thing and my own disorder. It started off as me thinking “I just want to be smaller” and ended up to be “I just want to look like and be a child again”. People say “that’s not attractive.” I’m not trying to be attractive. I don’t want anyone to even touch me. I just want to be a kid again.",
          "created_utc": 1608648091.0
        }
      ]
    },
    {
      "id": "ggqerul",
      "author": "None",
      "body": "I hate being attracted to men when the closer I get to my ideal, the more I stray from the way they want a woman to look. And I can acknowledge that the popular curvy body type looks good on other women, I simply would hate to see it on myself.",
      "created_utc": 1608673528.0,
      "score": 5,
      "context": [
        {
          "id": "ggoovx8",
          "author": "None",
          "body": "I’m jealous of myself at 14 years old. Can’t believe I thought I was fat then. I got to the weight I was then this year, but it didn’t look the same. It’s not so much that I want to look like a kid, I just want to be androgynous. I don’t like having the curves of a grown woman, I don’t want to draw attention to myself, I just want to be this skinny genderless being.",
          "created_utc": 1608639515.0
        },
        {
          "id": "ggphe99",
          "author": "siriushendrix",
          "body": "I so heavily relate to this and it's part of the reason for my baggy clothes",
          "created_utc": 1608656908.0
        }
      ]
    }
  ]
}