{
  "id": "kj2kwh",
  "subreddit": "AnorexiaNervosa",
  "author": "beautyandthebeach718",
  "created_utc": 1608761727.0,
  "title": "anyone else afraid to start inpatient until they feel that they’re skinny enough?",
  "selftext": "i have this fear that if i go, all the other residents will think i’m a fake bc i’m not extremely underweight. i feel like i need to be a significant amount UNDER my goal weight before actually going bc part of treatment is gaining, right? i want to be healthy & recovered AT my goal weight, if that makes sense. i am all for recovering as far as having a healthy mentality about food, etc. but i don’t believe that being recovered necessarily means i have to weigh more. like i’m okay with gaining a little and recovering as long as i can stay “underweight”. there are people who are naturally skinny but still healthy. that’s what i want. i don’t want this ED mindset, the guilt, the shame, the lying, the constant worrying about if i’m going to eat or not, what i’m going to eat, how much i’m going to eat, how many calories are in it, how im going to get rid of it, etc. i want to get rid of these toxic thoughts and habits. it’s exhausting to do this every single day. i’m sooo tired. literally. i’m so malnourished. i want to be healthier mentally but stay small. does this even make sense or am i not ready for recovery and just making excuses? idk.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/kj2kwh/anyone_else_afraid_to_start_inpatient_until_they/",
  "score": 151,
  "num_comments": 27,
  "comments": [
    {
      "id": "gguam7o",
      "author": "Yola-tilapias",
      "body": "One there are lots of people with different body types in treatment, so if that’s your concern don’t worry. \n\nTwo if you’re under the impression that you’ll be able to only gain a little weight while in treatment, let that go. They won’t let you only gain a little. They will keep feeding you until you gain. Yeah you can try and not eat to get around it but they weigh you too. \n\nAnd if you continue not to gain they’ll ask you to leave. People in my treatment were asked to leave for non compliance. It’s voluntary treatment so they’ll ask you to return when you’re ready. \n\nYou either need to be all in or not. To be honest I gained way more than I wanted to while in treatment because I couldn’t exercise either. \n\nBut after getting out I lost the weight without completely returning to unhealthy patterns. Still struggle, of course. \n\nGood luck.",
      "created_utc": 1608763121.0,
      "score": 34,
      "context": []
    },
    {
      "id": "gguf9kn",
      "author": "None",
      "body": "i hate to break it to you but you won’t get to decide how much weight you gain, and trying to lose more before recovering is just going to make you have to gain more and make recovery, which is already tough, even harder. the amount of weight you gain is up to your set pointwhich is determined by your growth curve, how your body reacts, and your treatment team. i know you want to restrict while you can but that’s just going to make it more drawn out. you are in an energy deficit that you need to make up for. these “naturally skinny” people have either never lost weight to be that way or they’ve lost it very slowly so it is maintainable. that is not the same with EDs. your body needs a bunch of extra energy to heal because when you restrict you lose muscle, organ tissue, brain tissue, etc. you are going to have to gain weight and stop exercise for at least a few months most likely. so the sooner you do this the sooner you will be trusted to take care of your own exercise and meals/snacks without relapse. restricting more now is not going to change anything about where your recovery weight will be, if anything it will just make it more likely to overshoot your set point because you will have a larger energy deficit to make up for. people might disagree with this, but they’re the kind of people who have not experienced true recovery. i can affirm that gaining weight in recovery will immediately make you feel a lot better. not the eating disorder, YOU. i was more suicidal than i have ever been in my life and within two weeks of recovery i stopped crying every day. this was one of the main reasons i kept going with recovery, because even though i despised my new body i couldn’t deny that everything just felt better. my mood increased, i had energy, various physical symptoms improved, and i was able to feel slightly happy. the reality is your eating disorder will kill you if you don’t recover at some point. recovery is not fun, but it is necessary. i know you have the unbearable urge to restrict harder than ever, but you will absolutely thank yourself later if you don’t. wishing you the best of luck, i’m proud of you for taking the steps to recovery! it’s hard not allow the ED to sabotage recovery, but recognize that’s all it is. your ED does not want you to get better so it is going to get louder the more you try to work against it.",
      "created_utc": 1608765549.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ggurw6u",
      "author": "Phantasmortuary",
      "body": "Yes, plus, I felt that way the first/last time I went to treatment. I think one of the only ways I would go would be if I was too sick to take care of myself and others.\n\nMaybe something to consider is how treatment (separately from recovery) doesn't end after leaving a treatment-center. Like with most diseases, even after one is \"stable,\" there's more healing and maintenance after leaving the hospital. Physical therapy but on the interior. \n\nI wish you all the best!",
      "created_utc": 1608772529.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggu93ja",
      "author": "None",
      "body": "YES YES YES YES YES",
      "created_utc": 1608762304.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggu9tt5",
      "author": "jake25456",
      "body": "Im at my lowest weight in 6 years just because I’m about to start impatient treatment",
      "created_utc": 1608762705.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggvgtzh",
      "author": "Educational-Okra-392",
      "body": "this is exactly, completely 100% how i feel. the comments are a rough reality check because i know weight gain is inevitable in treatment but i am so terrified of that. one of my strictest self-imposed rules is never eating breakfast and that obviously wouldn’t fly in inpatient. anyways, i wish you the best. you deserve to recover and live a full and happy life with your daughter. i’m rooting for you :)",
      "created_utc": 1608787529.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggyfnev",
      "author": "zan078",
      "body": "Yes a hundred times over!! I totally can relate to what you’re saying and feeling and I can tell you from experience, there are going to be 100 reasons to walk out the door every day at treatment, you will be complete out of your comfort zone and expected to comply with their schedules and requirements or given the option to willingly leave. At least that was my experience...and the first two I went to like that I walked right out of and never looked back. My best advice is, if you are put on a weight gain plan, the meals will be really hard, but try and eat the food because if you don’t they make you drink meal replacements and those sit like concrete inside of you! I had a full blown anxiety attack and cried with refusal and panic through my entire first meal but all the girls with me completely understood because they all had been through a first meal too which made me feel less awful. \nI can appreciate your need to get better for your daughter and I commend you for that! I have a 4 year old so I get that part of it, but as I saw someone mentioned treatment is of your own doing, they cannot and will not hold you against your will so if you know that you’re going to go there and be unwilling to cooperate then I would think long and hard about what’s more important to you right now, satisfying your ED or truly changing your habits? \nFor me, I only ever went to treatment for the sake of those close to me and mainly as a means to get people off my back, but I knew the entire time that I had no intention of letting this go and only used these programs as part of a ploy to deceive them that I was recovering so that I could get better at manipulation and hiding it. Obviously that only works so many times, people get tired of the battle and after years of fear and torment, eventually friends and family refused to support my situation and enable my ‘slow and painful suicide’ anymore. \nFor me my ED has always mattered more than anyone or anything else, it fuels my decisions my thoughts my day my mood every second of my life. But being a parent, you have a real chance at getting away from the toxicity. Wanting to set a better example for my son helped me change things that no program or doctor could in 15 years of trying. I’m still sick and always will be but I’m not on a hospital bed with tubes and wires trying to keep me alive and my son doesn’t have to worry about “what’s wrong with mommy?” \nThat part feels good, but the sick side of me is furious with myself for not maintaining dangerously low weights and I feel like a weak failure enraged with myself unless I’m actively engaging in triggers, then I feel empowered again. \n\nConsider it honestly with yourself first, better to do now when she is still young then later but I totally get how you feel! I had to leave my son for in house when he was only 4 months old and it was awful! \nGood luck!! Enjoy the holiday morning with your daughter!",
      "created_utc": 1608864561.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggubi3s",
      "author": "beautyandthebeach718",
      "body": "that’s not what i wanted to hear lol but it’s what i NEEDED to hear so thank you for your honesty! i mean it. and seeing that you lost the weight you gained without completely returning to unhealthy patterns gives me hope. you’re so right, i need to be all in. the last thing i want is to spend the money and time in treatment (especially being away from my 2 year old) and NOT get better.",
      "created_utc": 1608763528.0,
      "score": 26,
      "context": [
        {
          "id": "gguam7o",
          "author": "Yola-tilapias",
          "body": "One there are lots of people with different body types in treatment, so if that’s your concern don’t worry. \n\nTwo if you’re under the impression that you’ll be able to only gain a little weight while in treatment, let that go. They won’t let you only gain a little. They will keep feeding you until you gain. Yeah you can try and not eat to get around it but they weigh you too. \n\nAnd if you continue not to gain they’ll ask you to leave. People in my treatment were asked to leave for non compliance. It’s voluntary treatment so they’ll ask you to return when you’re ready. \n\nYou either need to be all in or not. To be honest I gained way more than I wanted to while in treatment because I couldn’t exercise either. \n\nBut after getting out I lost the weight without completely returning to unhealthy patterns. Still struggle, of course. \n\nGood luck.",
          "created_utc": 1608763121.0
        }
      ]
    },
    {
      "id": "ggumtqq",
      "author": "beautyandthebeach718",
      "body": "thank you so much! for all of this! it’s definitely an eye-opener. im starting to think it’s not possible to be recovered and still underweight 😩 boo... 👎🏻 but you telling me all the good things you felt from recovery gives me something to look forward to ❤️ i am so happy you don’t cry every day anymore. i’ve been there and it’s a horrible feeling. i really want to have energy again and feel happy. there’s so much i want to do but i’m always exhausted. and i hate flaking out on plans bc i’m too tired or don’t want to be around food/alcohol. my friends probably think i’m an ass. i’m so sick and tired of being sick & tired. i really hope i can recover and live a normal life. like deep down inside, i know this will eventually kill me but then i hear other people dealing with this for 10+ years and then i have this false belief that i have time. i need to remember everyone’s timeline is different so i might not have as much time as someone else.",
      "created_utc": 1608769735.0,
      "score": 6,
      "context": [
        {
          "id": "gguf9kn",
          "author": "None",
          "body": "i hate to break it to you but you won’t get to decide how much weight you gain, and trying to lose more before recovering is just going to make you have to gain more and make recovery, which is already tough, even harder. the amount of weight you gain is up to your set pointwhich is determined by your growth curve, how your body reacts, and your treatment team. i know you want to restrict while you can but that’s just going to make it more drawn out. you are in an energy deficit that you need to make up for. these “naturally skinny” people have either never lost weight to be that way or they’ve lost it very slowly so it is maintainable. that is not the same with EDs. your body needs a bunch of extra energy to heal because when you restrict you lose muscle, organ tissue, brain tissue, etc. you are going to have to gain weight and stop exercise for at least a few months most likely. so the sooner you do this the sooner you will be trusted to take care of your own exercise and meals/snacks without relapse. restricting more now is not going to change anything about where your recovery weight will be, if anything it will just make it more likely to overshoot your set point because you will have a larger energy deficit to make up for. people might disagree with this, but they’re the kind of people who have not experienced true recovery. i can affirm that gaining weight in recovery will immediately make you feel a lot better. not the eating disorder, YOU. i was more suicidal than i have ever been in my life and within two weeks of recovery i stopped crying every day. this was one of the main reasons i kept going with recovery, because even though i despised my new body i couldn’t deny that everything just felt better. my mood increased, i had energy, various physical symptoms improved, and i was able to feel slightly happy. the reality is your eating disorder will kill you if you don’t recover at some point. recovery is not fun, but it is necessary. i know you have the unbearable urge to restrict harder than ever, but you will absolutely thank yourself later if you don’t. wishing you the best of luck, i’m proud of you for taking the steps to recovery! it’s hard not allow the ED to sabotage recovery, but recognize that’s all it is. your ED does not want you to get better so it is going to get louder the more you try to work against it.",
          "created_utc": 1608765549.0
        }
      ]
    },
    {
      "id": "gguwnyn",
      "author": "beautyandthebeach718",
      "body": "you’re right, i didn’t think of it as a lifelong thing 😬 and thank you, i wish you the best too! ❤️",
      "created_utc": 1608775154.0,
      "score": 3,
      "context": [
        {
          "id": "ggurw6u",
          "author": "Phantasmortuary",
          "body": "Yes, plus, I felt that way the first/last time I went to treatment. I think one of the only ways I would go would be if I was too sick to take care of myself and others.\n\nMaybe something to consider is how treatment (separately from recovery) doesn't end after leaving a treatment-center. Like with most diseases, even after one is \"stable,\" there's more healing and maintenance after leaving the hospital. Physical therapy but on the interior. \n\nI wish you all the best!",
          "created_utc": 1608772529.0
        }
      ]
    },
    {
      "id": "ggu95za",
      "author": "None",
      "body": "THIS IS EXACTLY HOW I FUCKING FEEL",
      "created_utc": 1608762341.0,
      "score": 2,
      "context": [
        {
          "id": "ggu93ja",
          "author": "None",
          "body": "YES YES YES YES YES",
          "created_utc": 1608762304.0
        }
      ]
    },
    {
      "id": "gguahlo",
      "author": "beautyandthebeach718",
      "body": "yea i would have to be at a new low weight if i ever make it to inpatient. it’s kind of like losing a few pounds before thanksgiving... like we gotta make room for the gain 😬 well, good luck to you, brave soul 💪🏻i really hope you get the recovery you want and be happy! ❤️",
      "created_utc": 1608763062.0,
      "score": 2,
      "context": [
        {
          "id": "ggu9tt5",
          "author": "jake25456",
          "body": "Im at my lowest weight in 6 years just because I’m about to start impatient treatment",
          "created_utc": 1608762705.0
        }
      ]
    },
    {
      "id": "ggvipny",
      "author": "beautyandthebeach718",
      "body": "that last line... 🥺 thank you so much! EDs are so lonely sometimes. i really appreciate your support ❤️ i wish you the best too!",
      "created_utc": 1608788908.0,
      "score": 2,
      "context": [
        {
          "id": "ggvgtzh",
          "author": "Educational-Okra-392",
          "body": "this is exactly, completely 100% how i feel. the comments are a rough reality check because i know weight gain is inevitable in treatment but i am so terrified of that. one of my strictest self-imposed rules is never eating breakfast and that obviously wouldn’t fly in inpatient. anyways, i wish you the best. you deserve to recover and live a full and happy life with your daughter. i’m rooting for you :)",
          "created_utc": 1608787529.0
        }
      ]
    },
    {
      "id": "ggyx361",
      "author": "beautyandthebeach718",
      "body": "omg those meal replacement drinks sound absolutely horrible! sitting like concrete inside me 🥴 honestly, i don’t really feel like i’m ready for recovery but i know i need to for my daughter. i want to for her. idk if i’ll ever be truly ready but i just need to pull the trigger. like you, originally, i thought i’d just do it to get everyone off my back. but i know my friends just mean well when they’re pushing me to recover. they have even planned amongst themselves who could watch my daughter on what days to make treatment possible for me 🥺\n\nand i totally get it when you say people eventually get tired of the battle. i’ve been dealing with this for so long, i felt like even my doctor had given up on trying to get me to recover. he knew i didn’t want to so basically he was just doing what’s medically necessary to keep me alive. so that first visit i was talking about recovery was a very emotional one 😅 i was crying, the nurses were crying, my doctor was telling me how proud he was.. \n\nbut wow, everything you’re telling me just makes it seem so much more scary & difficult 😬 but i do appreciate everyone’s comments and their honesty. even though it’s hard to swallow, i know these truths come with good intentions and i am grateful. i’m glad you did it for your son ❤️ i hope you continue on a healthier path",
      "created_utc": 1608877733.0,
      "score": 1,
      "context": [
        {
          "id": "ggyfnev",
          "author": "zan078",
          "body": "Yes a hundred times over!! I totally can relate to what you’re saying and feeling and I can tell you from experience, there are going to be 100 reasons to walk out the door every day at treatment, you will be complete out of your comfort zone and expected to comply with their schedules and requirements or given the option to willingly leave. At least that was my experience...and the first two I went to like that I walked right out of and never looked back. My best advice is, if you are put on a weight gain plan, the meals will be really hard, but try and eat the food because if you don’t they make you drink meal replacements and those sit like concrete inside of you! I had a full blown anxiety attack and cried with refusal and panic through my entire first meal but all the girls with me completely understood because they all had been through a first meal too which made me feel less awful. \nI can appreciate your need to get better for your daughter and I commend you for that! I have a 4 year old so I get that part of it, but as I saw someone mentioned treatment is of your own doing, they cannot and will not hold you against your will so if you know that you’re going to go there and be unwilling to cooperate then I would think long and hard about what’s more important to you right now, satisfying your ED or truly changing your habits? \nFor me, I only ever went to treatment for the sake of those close to me and mainly as a means to get people off my back, but I knew the entire time that I had no intention of letting this go and only used these programs as part of a ploy to deceive them that I was recovering so that I could get better at manipulation and hiding it. Obviously that only works so many times, people get tired of the battle and after years of fear and torment, eventually friends and family refused to support my situation and enable my ‘slow and painful suicide’ anymore. \nFor me my ED has always mattered more than anyone or anything else, it fuels my decisions my thoughts my day my mood every second of my life. But being a parent, you have a real chance at getting away from the toxicity. Wanting to set a better example for my son helped me change things that no program or doctor could in 15 years of trying. I’m still sick and always will be but I’m not on a hospital bed with tubes and wires trying to keep me alive and my son doesn’t have to worry about “what’s wrong with mommy?” \nThat part feels good, but the sick side of me is furious with myself for not maintaining dangerously low weights and I feel like a weak failure enraged with myself unless I’m actively engaging in triggers, then I feel empowered again. \n\nConsider it honestly with yourself first, better to do now when she is still young then later but I totally get how you feel! I had to leave my son for in house when he was only 4 months old and it was awful! \nGood luck!! Enjoy the holiday morning with your daughter!",
          "created_utc": 1608864561.0
        }
      ]
    },
    {
      "id": "gguc43b",
      "author": "Yola-tilapias",
      "body": "I’m not going to lie, I gave up my scale when I entered treatment and the first time I weighed myself after having been in I FREAKED out. \n\nThey blind weigh each week and I unloaded on them saying you lied to me, I never agreed to gain this much weight!! Etc etc. \n\nMeanwhile not one single person on the outside I knew thought I looked bad, but it shows you how strong of a hold it can have on you. \n\nIf you’ve been in any kind of treatment you know it’s a response mechanism to stressors in our lives. So even now when I get stressed out I’ll just stop eating as a means to feel in control. \n\nI know it’ll never completely go away, so I just try to make good choices. \n\nSo when you go just remember there are good days and bad. But ultimately you’re going in (I imagine) because you feel like it has control of you and not the other way around. When you feel upset or like giving up remember that you’re mostly doing better, if not perfectly fine.",
      "created_utc": 1608763815.0,
      "score": 12,
      "context": [
        {
          "id": "gguam7o",
          "author": "Yola-tilapias",
          "body": "One there are lots of people with different body types in treatment, so if that’s your concern don’t worry. \n\nTwo if you’re under the impression that you’ll be able to only gain a little weight while in treatment, let that go. They won’t let you only gain a little. They will keep feeding you until you gain. Yeah you can try and not eat to get around it but they weigh you too. \n\nAnd if you continue not to gain they’ll ask you to leave. People in my treatment were asked to leave for non compliance. It’s voluntary treatment so they’ll ask you to return when you’re ready. \n\nYou either need to be all in or not. To be honest I gained way more than I wanted to while in treatment because I couldn’t exercise either. \n\nBut after getting out I lost the weight without completely returning to unhealthy patterns. Still struggle, of course. \n\nGood luck.",
          "created_utc": 1608763121.0
        },
        {
          "id": "ggubi3s",
          "author": "beautyandthebeach718",
          "body": "that’s not what i wanted to hear lol but it’s what i NEEDED to hear so thank you for your honesty! i mean it. and seeing that you lost the weight you gained without completely returning to unhealthy patterns gives me hope. you’re so right, i need to be all in. the last thing i want is to spend the money and time in treatment (especially being away from my 2 year old) and NOT get better.",
          "created_utc": 1608763528.0
        }
      ]
    },
    {
      "id": "ggup6ab",
      "author": "None",
      "body": "it sounds like you have a really good mindset about it and can recognize how bad it is, which is really good! cling to all of those things. you mentioned in other comments you have a daughter; think about her life too. a lot of my motivation to recover was because of my family. EDs are often passed on from mother to child. i’m sure you already think of all of this, and i don’t want you too feel unreasonably bad or guilty, but it is objectively true that your ED probably has and will continue to interfere with you ability to be a good mother. something i hate about my ED is how it made me act at odds with my values. i was willing to put my family/friends through a lot of distress to continue in my ED. i hate that it made me put being skinny over my loved ones because i don’t think i’m a vain person. that’s not to say that people with EDs are inherently shallow, image-obsessed, selfish people, but my ED made me that way. having an ED is not a choice, but refusing to recover is. i have struggled a lot with body stuff in recovery and am currently struggling with a lot of relapse urges because of it. i always remember though that leaning into my ED isn’t going to make me happy with my body, ever. when i was at my low weight i wanted to keep losing and losing. i had no perception of how small i was. sure i have body image issues now, but i honestly don’t really feel any worse about my body than i did at my low weight, and because i feel physically and emotionally better it is 100% worth it. now that i’ve worked on recovery, i can recognize that using behaviors will always be antithetical to anything i actually enjoy in life. further along in my life i hope to build muscle and focus on getting stronger rather than shrinking and getting weaker. maybe i won’t love my body, but i’d take feeling neutral about it (and not actively waging war against it) over starving and hating myself any day. the fact that you are able to wish recovery for yourself is something to be very proud of. it’s going to be rough but i can assure you that it is so worth it!",
      "created_utc": 1608771050.0,
      "score": 3,
      "context": [
        {
          "id": "gguf9kn",
          "author": "None",
          "body": "i hate to break it to you but you won’t get to decide how much weight you gain, and trying to lose more before recovering is just going to make you have to gain more and make recovery, which is already tough, even harder. the amount of weight you gain is up to your set pointwhich is determined by your growth curve, how your body reacts, and your treatment team. i know you want to restrict while you can but that’s just going to make it more drawn out. you are in an energy deficit that you need to make up for. these “naturally skinny” people have either never lost weight to be that way or they’ve lost it very slowly so it is maintainable. that is not the same with EDs. your body needs a bunch of extra energy to heal because when you restrict you lose muscle, organ tissue, brain tissue, etc. you are going to have to gain weight and stop exercise for at least a few months most likely. so the sooner you do this the sooner you will be trusted to take care of your own exercise and meals/snacks without relapse. restricting more now is not going to change anything about where your recovery weight will be, if anything it will just make it more likely to overshoot your set point because you will have a larger energy deficit to make up for. people might disagree with this, but they’re the kind of people who have not experienced true recovery. i can affirm that gaining weight in recovery will immediately make you feel a lot better. not the eating disorder, YOU. i was more suicidal than i have ever been in my life and within two weeks of recovery i stopped crying every day. this was one of the main reasons i kept going with recovery, because even though i despised my new body i couldn’t deny that everything just felt better. my mood increased, i had energy, various physical symptoms improved, and i was able to feel slightly happy. the reality is your eating disorder will kill you if you don’t recover at some point. recovery is not fun, but it is necessary. i know you have the unbearable urge to restrict harder than ever, but you will absolutely thank yourself later if you don’t. wishing you the best of luck, i’m proud of you for taking the steps to recovery! it’s hard not allow the ED to sabotage recovery, but recognize that’s all it is. your ED does not want you to get better so it is going to get louder the more you try to work against it.",
          "created_utc": 1608765549.0
        },
        {
          "id": "ggumtqq",
          "author": "beautyandthebeach718",
          "body": "thank you so much! for all of this! it’s definitely an eye-opener. im starting to think it’s not possible to be recovered and still underweight 😩 boo... 👎🏻 but you telling me all the good things you felt from recovery gives me something to look forward to ❤️ i am so happy you don’t cry every day anymore. i’ve been there and it’s a horrible feeling. i really want to have energy again and feel happy. there’s so much i want to do but i’m always exhausted. and i hate flaking out on plans bc i’m too tired or don’t want to be around food/alcohol. my friends probably think i’m an ass. i’m so sick and tired of being sick & tired. i really hope i can recover and live a normal life. like deep down inside, i know this will eventually kill me but then i hear other people dealing with this for 10+ years and then i have this false belief that i have time. i need to remember everyone’s timeline is different so i might not have as much time as someone else.",
          "created_utc": 1608769735.0
        }
      ]
    },
    {
      "id": "ggua0j1",
      "author": "beautyandthebeach718",
      "body": "thank you! i’m so glad someone can relate ❤️",
      "created_utc": 1608762810.0,
      "score": 3,
      "context": [
        {
          "id": "ggu93ja",
          "author": "None",
          "body": "YES YES YES YES YES",
          "created_utc": 1608762304.0
        },
        {
          "id": "ggu95za",
          "author": "None",
          "body": "THIS IS EXACTLY HOW I FUCKING FEEL",
          "created_utc": 1608762341.0
        }
      ]
    },
    {
      "id": "ggyyqh3",
      "author": "zan078",
      "body": "don’t let this intimidate you! I am only telling you that because that was the reason I failed the first time, I thought I had outsmarted them and then bam they were like NOPE and I simply couldn’t deal with the feeling after so I never went back. I’m only trying to inform you that recovery itself is uncomfortable and yeah it feels scary but it’s not nearly as bad if you cooperate, resisting makes the default scenarios that result way harder on you and that can easily drive you away so if you’re ready and have such amazing people supporting you, then take advantage of this moment and thank god that you’ve been so blessed and go because it’s never going to feel good or exciting...never not even healthy people would want to relinquish their freedom in that sense. so if you have built momentum and a support system def do it now! especially where you have a daughter think of the impact your health and appearance and relationship with food could have on her. \n\nPlus, you will meet girls that you will grow really close with and that helps a lot! I learned to crochet and knit in my early days of programs! Not all of mine but the intensive ones where I spent significant time I always met at least one or two people who really got it and I felt support from their presence without having to even talk or share. \n\nI am really happy that you’re in such a strong headspace to even talk and share and consider going so give yourself a lot of credit for that! We both know how impossible that point is to even reach at all so kudos to you!!! Try not to compare, you will see girls that may be sicker than you but don’t let make you feel unworthy of being there...I total get the competitive aspect and it’s so hard but just stick with it and take the advice of those who have been there longer they have usually already learned all of the hard ways and can save you a lot of discomfort! \n\nI hope you enjoy tomorrow morning I just got done setting everything up!!! I wish you all the best! You can do this and you will feel so much happier afterwards when you can truly play with your kid and be present for the moment instead of preoccupied with some battle in your head that no one knows is so loud!",
      "created_utc": 1608879261.0,
      "score": 1,
      "context": [
        {
          "id": "ggyfnev",
          "author": "zan078",
          "body": "Yes a hundred times over!! I totally can relate to what you’re saying and feeling and I can tell you from experience, there are going to be 100 reasons to walk out the door every day at treatment, you will be complete out of your comfort zone and expected to comply with their schedules and requirements or given the option to willingly leave. At least that was my experience...and the first two I went to like that I walked right out of and never looked back. My best advice is, if you are put on a weight gain plan, the meals will be really hard, but try and eat the food because if you don’t they make you drink meal replacements and those sit like concrete inside of you! I had a full blown anxiety attack and cried with refusal and panic through my entire first meal but all the girls with me completely understood because they all had been through a first meal too which made me feel less awful. \nI can appreciate your need to get better for your daughter and I commend you for that! I have a 4 year old so I get that part of it, but as I saw someone mentioned treatment is of your own doing, they cannot and will not hold you against your will so if you know that you’re going to go there and be unwilling to cooperate then I would think long and hard about what’s more important to you right now, satisfying your ED or truly changing your habits? \nFor me, I only ever went to treatment for the sake of those close to me and mainly as a means to get people off my back, but I knew the entire time that I had no intention of letting this go and only used these programs as part of a ploy to deceive them that I was recovering so that I could get better at manipulation and hiding it. Obviously that only works so many times, people get tired of the battle and after years of fear and torment, eventually friends and family refused to support my situation and enable my ‘slow and painful suicide’ anymore. \nFor me my ED has always mattered more than anyone or anything else, it fuels my decisions my thoughts my day my mood every second of my life. But being a parent, you have a real chance at getting away from the toxicity. Wanting to set a better example for my son helped me change things that no program or doctor could in 15 years of trying. I’m still sick and always will be but I’m not on a hospital bed with tubes and wires trying to keep me alive and my son doesn’t have to worry about “what’s wrong with mommy?” \nThat part feels good, but the sick side of me is furious with myself for not maintaining dangerously low weights and I feel like a weak failure enraged with myself unless I’m actively engaging in triggers, then I feel empowered again. \n\nConsider it honestly with yourself first, better to do now when she is still young then later but I totally get how you feel! I had to leave my son for in house when he was only 4 months old and it was awful! \nGood luck!! Enjoy the holiday morning with your daughter!",
          "created_utc": 1608864561.0
        },
        {
          "id": "ggyx361",
          "author": "beautyandthebeach718",
          "body": "omg those meal replacement drinks sound absolutely horrible! sitting like concrete inside me 🥴 honestly, i don’t really feel like i’m ready for recovery but i know i need to for my daughter. i want to for her. idk if i’ll ever be truly ready but i just need to pull the trigger. like you, originally, i thought i’d just do it to get everyone off my back. but i know my friends just mean well when they’re pushing me to recover. they have even planned amongst themselves who could watch my daughter on what days to make treatment possible for me 🥺\n\nand i totally get it when you say people eventually get tired of the battle. i’ve been dealing with this for so long, i felt like even my doctor had given up on trying to get me to recover. he knew i didn’t want to so basically he was just doing what’s medically necessary to keep me alive. so that first visit i was talking about recovery was a very emotional one 😅 i was crying, the nurses were crying, my doctor was telling me how proud he was.. \n\nbut wow, everything you’re telling me just makes it seem so much more scary & difficult 😬 but i do appreciate everyone’s comments and their honesty. even though it’s hard to swallow, i know these truths come with good intentions and i am grateful. i’m glad you did it for your son ❤️ i hope you continue on a healthier path",
          "created_utc": 1608877733.0
        }
      ]
    },
    {
      "id": "gguijql",
      "author": "beautyandthebeach718",
      "body": "when my doctor suggested i get rid of my scale, the thought alone gave me so much anxiety. bc idk how i look. like what i see in the mirror and photos and videos are all completely different. and i can’t rely on my clothes bc if i fit something smaller, i just assume i must’ve stretched it out. so i need my scale to know what i look like. \n\nblind weighing sounds terrifying and i don’t blame you for your reaction, i would’ve been the same way! it sucks that you still struggle 😔 i believe the same thing, like it never truly goes away 100%. but you are doing better and i hope you continue to do so! (hugs)\n\nanyone i’ve shared this with usually says “just eat. you’re not fat” and i know i’m not fat but i FEEL fat and out of control if i eat. i feel so unattractive when i eat. like i’m pigging out. i get super mad if someone looks at me when i’m eating 😫 \n\nand yes, this is more about control than my weight bc i have a lot of trauma in my life and currently, some things are just falling apart so my life feels out of control. i feel like i control my body and my weight. but i do see how this ED is actually controlling me. my weight affects my mood for the day and it affects my family/social life especially when it involves gatherings with food/drinks. \n\ni need to find better coping mechanisms. every time i get upset, my first thought is to starve 😬 SIGHHHHH... honestly, recovery sounds so scary but i know i need to get better, especially for my daughter.",
      "created_utc": 1608767366.0,
      "score": 10,
      "context": [
        {
          "id": "gguam7o",
          "author": "Yola-tilapias",
          "body": "One there are lots of people with different body types in treatment, so if that’s your concern don’t worry. \n\nTwo if you’re under the impression that you’ll be able to only gain a little weight while in treatment, let that go. They won’t let you only gain a little. They will keep feeding you until you gain. Yeah you can try and not eat to get around it but they weigh you too. \n\nAnd if you continue not to gain they’ll ask you to leave. People in my treatment were asked to leave for non compliance. It’s voluntary treatment so they’ll ask you to return when you’re ready. \n\nYou either need to be all in or not. To be honest I gained way more than I wanted to while in treatment because I couldn’t exercise either. \n\nBut after getting out I lost the weight without completely returning to unhealthy patterns. Still struggle, of course. \n\nGood luck.",
          "created_utc": 1608763121.0
        },
        {
          "id": "ggubi3s",
          "author": "beautyandthebeach718",
          "body": "that’s not what i wanted to hear lol but it’s what i NEEDED to hear so thank you for your honesty! i mean it. and seeing that you lost the weight you gained without completely returning to unhealthy patterns gives me hope. you’re so right, i need to be all in. the last thing i want is to spend the money and time in treatment (especially being away from my 2 year old) and NOT get better.",
          "created_utc": 1608763528.0
        },
        {
          "id": "gguc43b",
          "author": "Yola-tilapias",
          "body": "I’m not going to lie, I gave up my scale when I entered treatment and the first time I weighed myself after having been in I FREAKED out. \n\nThey blind weigh each week and I unloaded on them saying you lied to me, I never agreed to gain this much weight!! Etc etc. \n\nMeanwhile not one single person on the outside I knew thought I looked bad, but it shows you how strong of a hold it can have on you. \n\nIf you’ve been in any kind of treatment you know it’s a response mechanism to stressors in our lives. So even now when I get stressed out I’ll just stop eating as a means to feel in control. \n\nI know it’ll never completely go away, so I just try to make good choices. \n\nSo when you go just remember there are good days and bad. But ultimately you’re going in (I imagine) because you feel like it has control of you and not the other way around. When you feel upset or like giving up remember that you’re mostly doing better, if not perfectly fine.",
          "created_utc": 1608763815.0
        }
      ]
    },
    {
      "id": "ggus6h4",
      "author": "beautyandthebeach718",
      "body": "aww your comment is one i know i’ll remember for years later. especially when i need to remind myself to stay motivated. thank you! ❤️honestly, i never would have even considered recovery if it weren’t for my daughter. and i never want her to experience any of this but i know she can learn things from watching me. (i learned from my mom unfortunately). i like to think of myself as that “pinterest mom”, going all out and getting super creative when doing lots of activities with my daughter. but i know that between not having enough energy and being distracted with constantly obsessing over ED stuff, it takes away from that. “you can’t pour from an empty cup”. i know i need to take care of myself to make sure she gets the best care. she deserves everything. she’s the reason i’m still alive today. after having been sexually assaulted in the worst way, i just wanted to quit and hoped my eating disorder would just take me out but i could never leave my daughter behind and let her think she wasn’t enough for me to fight and do everything i could to be here for her ❤️",
      "created_utc": 1608772684.0,
      "score": 3,
      "context": [
        {
          "id": "gguf9kn",
          "author": "None",
          "body": "i hate to break it to you but you won’t get to decide how much weight you gain, and trying to lose more before recovering is just going to make you have to gain more and make recovery, which is already tough, even harder. the amount of weight you gain is up to your set pointwhich is determined by your growth curve, how your body reacts, and your treatment team. i know you want to restrict while you can but that’s just going to make it more drawn out. you are in an energy deficit that you need to make up for. these “naturally skinny” people have either never lost weight to be that way or they’ve lost it very slowly so it is maintainable. that is not the same with EDs. your body needs a bunch of extra energy to heal because when you restrict you lose muscle, organ tissue, brain tissue, etc. you are going to have to gain weight and stop exercise for at least a few months most likely. so the sooner you do this the sooner you will be trusted to take care of your own exercise and meals/snacks without relapse. restricting more now is not going to change anything about where your recovery weight will be, if anything it will just make it more likely to overshoot your set point because you will have a larger energy deficit to make up for. people might disagree with this, but they’re the kind of people who have not experienced true recovery. i can affirm that gaining weight in recovery will immediately make you feel a lot better. not the eating disorder, YOU. i was more suicidal than i have ever been in my life and within two weeks of recovery i stopped crying every day. this was one of the main reasons i kept going with recovery, because even though i despised my new body i couldn’t deny that everything just felt better. my mood increased, i had energy, various physical symptoms improved, and i was able to feel slightly happy. the reality is your eating disorder will kill you if you don’t recover at some point. recovery is not fun, but it is necessary. i know you have the unbearable urge to restrict harder than ever, but you will absolutely thank yourself later if you don’t. wishing you the best of luck, i’m proud of you for taking the steps to recovery! it’s hard not allow the ED to sabotage recovery, but recognize that’s all it is. your ED does not want you to get better so it is going to get louder the more you try to work against it.",
          "created_utc": 1608765549.0
        },
        {
          "id": "ggumtqq",
          "author": "beautyandthebeach718",
          "body": "thank you so much! for all of this! it’s definitely an eye-opener. im starting to think it’s not possible to be recovered and still underweight 😩 boo... 👎🏻 but you telling me all the good things you felt from recovery gives me something to look forward to ❤️ i am so happy you don’t cry every day anymore. i’ve been there and it’s a horrible feeling. i really want to have energy again and feel happy. there’s so much i want to do but i’m always exhausted. and i hate flaking out on plans bc i’m too tired or don’t want to be around food/alcohol. my friends probably think i’m an ass. i’m so sick and tired of being sick & tired. i really hope i can recover and live a normal life. like deep down inside, i know this will eventually kill me but then i hear other people dealing with this for 10+ years and then i have this false belief that i have time. i need to remember everyone’s timeline is different so i might not have as much time as someone else.",
          "created_utc": 1608769735.0
        },
        {
          "id": "ggup6ab",
          "author": "None",
          "body": "it sounds like you have a really good mindset about it and can recognize how bad it is, which is really good! cling to all of those things. you mentioned in other comments you have a daughter; think about her life too. a lot of my motivation to recover was because of my family. EDs are often passed on from mother to child. i’m sure you already think of all of this, and i don’t want you too feel unreasonably bad or guilty, but it is objectively true that your ED probably has and will continue to interfere with you ability to be a good mother. something i hate about my ED is how it made me act at odds with my values. i was willing to put my family/friends through a lot of distress to continue in my ED. i hate that it made me put being skinny over my loved ones because i don’t think i’m a vain person. that’s not to say that people with EDs are inherently shallow, image-obsessed, selfish people, but my ED made me that way. having an ED is not a choice, but refusing to recover is. i have struggled a lot with body stuff in recovery and am currently struggling with a lot of relapse urges because of it. i always remember though that leaning into my ED isn’t going to make me happy with my body, ever. when i was at my low weight i wanted to keep losing and losing. i had no perception of how small i was. sure i have body image issues now, but i honestly don’t really feel any worse about my body than i did at my low weight, and because i feel physically and emotionally better it is 100% worth it. now that i’ve worked on recovery, i can recognize that using behaviors will always be antithetical to anything i actually enjoy in life. further along in my life i hope to build muscle and focus on getting stronger rather than shrinking and getting weaker. maybe i won’t love my body, but i’d take feeling neutral about it (and not actively waging war against it) over starving and hating myself any day. the fact that you are able to wish recovery for yourself is something to be very proud of. it’s going to be rough but i can assure you that it is so worth it!",
          "created_utc": 1608771050.0
        }
      ]
    },
    {
      "id": "ggz19rr",
      "author": "beautyandthebeach718",
      "body": "aww can i just hug you? lol no, but seriously, it helps to talk to someone who gets it ❤️ that bit about freedom... you know how many people can tell you EDs have a lot to do with control. i can’t imagine how difficult it’s going to be to let someone else decide what i eat 😨\n\nyears ago, i met some girls who were going through the same thing as me and we grew close sharing our awful habits but then eventually most of them moved on to recovery and i was just like “yea... can’t relate” 😂😭💀 but maybe i’ll find some new people in these programs that get it and that does sound really helpful. \n\nand Merry Christmas! 🤗 thanks for all the info and encouragement!",
      "created_utc": 1608881826.0,
      "score": 1,
      "context": [
        {
          "id": "ggyfnev",
          "author": "zan078",
          "body": "Yes a hundred times over!! I totally can relate to what you’re saying and feeling and I can tell you from experience, there are going to be 100 reasons to walk out the door every day at treatment, you will be complete out of your comfort zone and expected to comply with their schedules and requirements or given the option to willingly leave. At least that was my experience...and the first two I went to like that I walked right out of and never looked back. My best advice is, if you are put on a weight gain plan, the meals will be really hard, but try and eat the food because if you don’t they make you drink meal replacements and those sit like concrete inside of you! I had a full blown anxiety attack and cried with refusal and panic through my entire first meal but all the girls with me completely understood because they all had been through a first meal too which made me feel less awful. \nI can appreciate your need to get better for your daughter and I commend you for that! I have a 4 year old so I get that part of it, but as I saw someone mentioned treatment is of your own doing, they cannot and will not hold you against your will so if you know that you’re going to go there and be unwilling to cooperate then I would think long and hard about what’s more important to you right now, satisfying your ED or truly changing your habits? \nFor me, I only ever went to treatment for the sake of those close to me and mainly as a means to get people off my back, but I knew the entire time that I had no intention of letting this go and only used these programs as part of a ploy to deceive them that I was recovering so that I could get better at manipulation and hiding it. Obviously that only works so many times, people get tired of the battle and after years of fear and torment, eventually friends and family refused to support my situation and enable my ‘slow and painful suicide’ anymore. \nFor me my ED has always mattered more than anyone or anything else, it fuels my decisions my thoughts my day my mood every second of my life. But being a parent, you have a real chance at getting away from the toxicity. Wanting to set a better example for my son helped me change things that no program or doctor could in 15 years of trying. I’m still sick and always will be but I’m not on a hospital bed with tubes and wires trying to keep me alive and my son doesn’t have to worry about “what’s wrong with mommy?” \nThat part feels good, but the sick side of me is furious with myself for not maintaining dangerously low weights and I feel like a weak failure enraged with myself unless I’m actively engaging in triggers, then I feel empowered again. \n\nConsider it honestly with yourself first, better to do now when she is still young then later but I totally get how you feel! I had to leave my son for in house when he was only 4 months old and it was awful! \nGood luck!! Enjoy the holiday morning with your daughter!",
          "created_utc": 1608864561.0
        },
        {
          "id": "ggyx361",
          "author": "beautyandthebeach718",
          "body": "omg those meal replacement drinks sound absolutely horrible! sitting like concrete inside me 🥴 honestly, i don’t really feel like i’m ready for recovery but i know i need to for my daughter. i want to for her. idk if i’ll ever be truly ready but i just need to pull the trigger. like you, originally, i thought i’d just do it to get everyone off my back. but i know my friends just mean well when they’re pushing me to recover. they have even planned amongst themselves who could watch my daughter on what days to make treatment possible for me 🥺\n\nand i totally get it when you say people eventually get tired of the battle. i’ve been dealing with this for so long, i felt like even my doctor had given up on trying to get me to recover. he knew i didn’t want to so basically he was just doing what’s medically necessary to keep me alive. so that first visit i was talking about recovery was a very emotional one 😅 i was crying, the nurses were crying, my doctor was telling me how proud he was.. \n\nbut wow, everything you’re telling me just makes it seem so much more scary & difficult 😬 but i do appreciate everyone’s comments and their honesty. even though it’s hard to swallow, i know these truths come with good intentions and i am grateful. i’m glad you did it for your son ❤️ i hope you continue on a healthier path",
          "created_utc": 1608877733.0
        },
        {
          "id": "ggyyqh3",
          "author": "zan078",
          "body": "don’t let this intimidate you! I am only telling you that because that was the reason I failed the first time, I thought I had outsmarted them and then bam they were like NOPE and I simply couldn’t deal with the feeling after so I never went back. I’m only trying to inform you that recovery itself is uncomfortable and yeah it feels scary but it’s not nearly as bad if you cooperate, resisting makes the default scenarios that result way harder on you and that can easily drive you away so if you’re ready and have such amazing people supporting you, then take advantage of this moment and thank god that you’ve been so blessed and go because it’s never going to feel good or exciting...never not even healthy people would want to relinquish their freedom in that sense. so if you have built momentum and a support system def do it now! especially where you have a daughter think of the impact your health and appearance and relationship with food could have on her. \n\nPlus, you will meet girls that you will grow really close with and that helps a lot! I learned to crochet and knit in my early days of programs! Not all of mine but the intensive ones where I spent significant time I always met at least one or two people who really got it and I felt support from their presence without having to even talk or share. \n\nI am really happy that you’re in such a strong headspace to even talk and share and consider going so give yourself a lot of credit for that! We both know how impossible that point is to even reach at all so kudos to you!!! Try not to compare, you will see girls that may be sicker than you but don’t let make you feel unworthy of being there...I total get the competitive aspect and it’s so hard but just stick with it and take the advice of those who have been there longer they have usually already learned all of the hard ways and can save you a lot of discomfort! \n\nI hope you enjoy tomorrow morning I just got done setting everything up!!! I wish you all the best! You can do this and you will feel so much happier afterwards when you can truly play with your kid and be present for the moment instead of preoccupied with some battle in your head that no one knows is so loud!",
          "created_utc": 1608879261.0
        }
      ]
    },
    {
      "id": "ggur32d",
      "author": "Yola-tilapias",
      "body": "Don’t be too hard on yourself. Most people deal with stress in less than perfect ways (drugs, alcohol, sexual promiscuity, gambling, excessive shopping, etc). So you are not alone in trying to deal with stress in less than perfect ways. \n\nOne thing I said to myself going in was that I was feeling more and more out of control every day, so I’d listen and try whatever they said in the hope that they could do what I couldn’t, which was to loosen the grip this THING had over me. \n\nBut yeah every feeling you have had I have had, people saying “you’re  skinny, eat” and I’m like “what do you know!!”\n\nOr eating a meal and literally afraid to get on the scale, CERTAIN I’ve gained 5-10lbs. Then eventually I get on and I haven’t gained at all. But the fear and anxiety are real, and powerful. \n\nAnother thing about treatment they help give you effective ways to deal with stress. Tools to help you accept the stress that everyone gets, and not let it manifest itself in unhealthy coping mechanisms. \n\nThat may sound simplistic and like yeah right give me a break, but they do help.",
      "created_utc": 1608772093.0,
      "score": 3,
      "context": [
        {
          "id": "gguam7o",
          "author": "Yola-tilapias",
          "body": "One there are lots of people with different body types in treatment, so if that’s your concern don’t worry. \n\nTwo if you’re under the impression that you’ll be able to only gain a little weight while in treatment, let that go. They won’t let you only gain a little. They will keep feeding you until you gain. Yeah you can try and not eat to get around it but they weigh you too. \n\nAnd if you continue not to gain they’ll ask you to leave. People in my treatment were asked to leave for non compliance. It’s voluntary treatment so they’ll ask you to return when you’re ready. \n\nYou either need to be all in or not. To be honest I gained way more than I wanted to while in treatment because I couldn’t exercise either. \n\nBut after getting out I lost the weight without completely returning to unhealthy patterns. Still struggle, of course. \n\nGood luck.",
          "created_utc": 1608763121.0
        },
        {
          "id": "ggubi3s",
          "author": "beautyandthebeach718",
          "body": "that’s not what i wanted to hear lol but it’s what i NEEDED to hear so thank you for your honesty! i mean it. and seeing that you lost the weight you gained without completely returning to unhealthy patterns gives me hope. you’re so right, i need to be all in. the last thing i want is to spend the money and time in treatment (especially being away from my 2 year old) and NOT get better.",
          "created_utc": 1608763528.0
        },
        {
          "id": "gguc43b",
          "author": "Yola-tilapias",
          "body": "I’m not going to lie, I gave up my scale when I entered treatment and the first time I weighed myself after having been in I FREAKED out. \n\nThey blind weigh each week and I unloaded on them saying you lied to me, I never agreed to gain this much weight!! Etc etc. \n\nMeanwhile not one single person on the outside I knew thought I looked bad, but it shows you how strong of a hold it can have on you. \n\nIf you’ve been in any kind of treatment you know it’s a response mechanism to stressors in our lives. So even now when I get stressed out I’ll just stop eating as a means to feel in control. \n\nI know it’ll never completely go away, so I just try to make good choices. \n\nSo when you go just remember there are good days and bad. But ultimately you’re going in (I imagine) because you feel like it has control of you and not the other way around. When you feel upset or like giving up remember that you’re mostly doing better, if not perfectly fine.",
          "created_utc": 1608763815.0
        },
        {
          "id": "gguijql",
          "author": "beautyandthebeach718",
          "body": "when my doctor suggested i get rid of my scale, the thought alone gave me so much anxiety. bc idk how i look. like what i see in the mirror and photos and videos are all completely different. and i can’t rely on my clothes bc if i fit something smaller, i just assume i must’ve stretched it out. so i need my scale to know what i look like. \n\nblind weighing sounds terrifying and i don’t blame you for your reaction, i would’ve been the same way! it sucks that you still struggle 😔 i believe the same thing, like it never truly goes away 100%. but you are doing better and i hope you continue to do so! (hugs)\n\nanyone i’ve shared this with usually says “just eat. you’re not fat” and i know i’m not fat but i FEEL fat and out of control if i eat. i feel so unattractive when i eat. like i’m pigging out. i get super mad if someone looks at me when i’m eating 😫 \n\nand yes, this is more about control than my weight bc i have a lot of trauma in my life and currently, some things are just falling apart so my life feels out of control. i feel like i control my body and my weight. but i do see how this ED is actually controlling me. my weight affects my mood for the day and it affects my family/social life especially when it involves gatherings with food/drinks. \n\ni need to find better coping mechanisms. every time i get upset, my first thought is to starve 😬 SIGHHHHH... honestly, recovery sounds so scary but i know i need to get better, especially for my daughter.",
          "created_utc": 1608767366.0
        }
      ]
    },
    {
      "id": "ggusloq",
      "author": "None",
      "body": "i’m glad i could help even in the slightest, your daughter is lucky to have you <3",
      "created_utc": 1608772914.0,
      "score": 3,
      "context": [
        {
          "id": "gguf9kn",
          "author": "None",
          "body": "i hate to break it to you but you won’t get to decide how much weight you gain, and trying to lose more before recovering is just going to make you have to gain more and make recovery, which is already tough, even harder. the amount of weight you gain is up to your set pointwhich is determined by your growth curve, how your body reacts, and your treatment team. i know you want to restrict while you can but that’s just going to make it more drawn out. you are in an energy deficit that you need to make up for. these “naturally skinny” people have either never lost weight to be that way or they’ve lost it very slowly so it is maintainable. that is not the same with EDs. your body needs a bunch of extra energy to heal because when you restrict you lose muscle, organ tissue, brain tissue, etc. you are going to have to gain weight and stop exercise for at least a few months most likely. so the sooner you do this the sooner you will be trusted to take care of your own exercise and meals/snacks without relapse. restricting more now is not going to change anything about where your recovery weight will be, if anything it will just make it more likely to overshoot your set point because you will have a larger energy deficit to make up for. people might disagree with this, but they’re the kind of people who have not experienced true recovery. i can affirm that gaining weight in recovery will immediately make you feel a lot better. not the eating disorder, YOU. i was more suicidal than i have ever been in my life and within two weeks of recovery i stopped crying every day. this was one of the main reasons i kept going with recovery, because even though i despised my new body i couldn’t deny that everything just felt better. my mood increased, i had energy, various physical symptoms improved, and i was able to feel slightly happy. the reality is your eating disorder will kill you if you don’t recover at some point. recovery is not fun, but it is necessary. i know you have the unbearable urge to restrict harder than ever, but you will absolutely thank yourself later if you don’t. wishing you the best of luck, i’m proud of you for taking the steps to recovery! it’s hard not allow the ED to sabotage recovery, but recognize that’s all it is. your ED does not want you to get better so it is going to get louder the more you try to work against it.",
          "created_utc": 1608765549.0
        },
        {
          "id": "ggumtqq",
          "author": "beautyandthebeach718",
          "body": "thank you so much! for all of this! it’s definitely an eye-opener. im starting to think it’s not possible to be recovered and still underweight 😩 boo... 👎🏻 but you telling me all the good things you felt from recovery gives me something to look forward to ❤️ i am so happy you don’t cry every day anymore. i’ve been there and it’s a horrible feeling. i really want to have energy again and feel happy. there’s so much i want to do but i’m always exhausted. and i hate flaking out on plans bc i’m too tired or don’t want to be around food/alcohol. my friends probably think i’m an ass. i’m so sick and tired of being sick & tired. i really hope i can recover and live a normal life. like deep down inside, i know this will eventually kill me but then i hear other people dealing with this for 10+ years and then i have this false belief that i have time. i need to remember everyone’s timeline is different so i might not have as much time as someone else.",
          "created_utc": 1608769735.0
        },
        {
          "id": "ggup6ab",
          "author": "None",
          "body": "it sounds like you have a really good mindset about it and can recognize how bad it is, which is really good! cling to all of those things. you mentioned in other comments you have a daughter; think about her life too. a lot of my motivation to recover was because of my family. EDs are often passed on from mother to child. i’m sure you already think of all of this, and i don’t want you too feel unreasonably bad or guilty, but it is objectively true that your ED probably has and will continue to interfere with you ability to be a good mother. something i hate about my ED is how it made me act at odds with my values. i was willing to put my family/friends through a lot of distress to continue in my ED. i hate that it made me put being skinny over my loved ones because i don’t think i’m a vain person. that’s not to say that people with EDs are inherently shallow, image-obsessed, selfish people, but my ED made me that way. having an ED is not a choice, but refusing to recover is. i have struggled a lot with body stuff in recovery and am currently struggling with a lot of relapse urges because of it. i always remember though that leaning into my ED isn’t going to make me happy with my body, ever. when i was at my low weight i wanted to keep losing and losing. i had no perception of how small i was. sure i have body image issues now, but i honestly don’t really feel any worse about my body than i did at my low weight, and because i feel physically and emotionally better it is 100% worth it. now that i’ve worked on recovery, i can recognize that using behaviors will always be antithetical to anything i actually enjoy in life. further along in my life i hope to build muscle and focus on getting stronger rather than shrinking and getting weaker. maybe i won’t love my body, but i’d take feeling neutral about it (and not actively waging war against it) over starving and hating myself any day. the fact that you are able to wish recovery for yourself is something to be very proud of. it’s going to be rough but i can assure you that it is so worth it!",
          "created_utc": 1608771050.0
        },
        {
          "id": "ggus6h4",
          "author": "beautyandthebeach718",
          "body": "aww your comment is one i know i’ll remember for years later. especially when i need to remind myself to stay motivated. thank you! ❤️honestly, i never would have even considered recovery if it weren’t for my daughter. and i never want her to experience any of this but i know she can learn things from watching me. (i learned from my mom unfortunately). i like to think of myself as that “pinterest mom”, going all out and getting super creative when doing lots of activities with my daughter. but i know that between not having enough energy and being distracted with constantly obsessing over ED stuff, it takes away from that. “you can’t pour from an empty cup”. i know i need to take care of myself to make sure she gets the best care. she deserves everything. she’s the reason i’m still alive today. after having been sexually assaulted in the worst way, i just wanted to quit and hoped my eating disorder would just take me out but i could never leave my daughter behind and let her think she wasn’t enough for me to fight and do everything i could to be here for her ❤️",
          "created_utc": 1608772684.0
        }
      ]
    },
    {
      "id": "gh01rg3",
      "author": "zan078",
      "body": ":) Merry Christmas!! I hope you are having a great morning with your daughter! And most of the programs that I have done allow you some choice of what to eat, they just specify how many proteins, fats, and carbs that you need to accumulatively have, but they do give you some choice. Thanks for your kind words, it always helps me to talk to people who I know get how I’m feeling! I promise, you will thank yourself for this a hundred times over! When it gets hard try and imagine the harsh realities that not recovering will ultimately cause you, I used to have to imagine my son being taken away from me and how much I would hate myself if that ever happened and for me, the fear of living through that was scarier than the fear of doing what I knew had to happen if I wanted to live. I know you can do this! I’m around if you ever wanna talk! 💙",
      "created_utc": 1608917475.0,
      "score": 1,
      "context": [
        {
          "id": "ggyfnev",
          "author": "zan078",
          "body": "Yes a hundred times over!! I totally can relate to what you’re saying and feeling and I can tell you from experience, there are going to be 100 reasons to walk out the door every day at treatment, you will be complete out of your comfort zone and expected to comply with their schedules and requirements or given the option to willingly leave. At least that was my experience...and the first two I went to like that I walked right out of and never looked back. My best advice is, if you are put on a weight gain plan, the meals will be really hard, but try and eat the food because if you don’t they make you drink meal replacements and those sit like concrete inside of you! I had a full blown anxiety attack and cried with refusal and panic through my entire first meal but all the girls with me completely understood because they all had been through a first meal too which made me feel less awful. \nI can appreciate your need to get better for your daughter and I commend you for that! I have a 4 year old so I get that part of it, but as I saw someone mentioned treatment is of your own doing, they cannot and will not hold you against your will so if you know that you’re going to go there and be unwilling to cooperate then I would think long and hard about what’s more important to you right now, satisfying your ED or truly changing your habits? \nFor me, I only ever went to treatment for the sake of those close to me and mainly as a means to get people off my back, but I knew the entire time that I had no intention of letting this go and only used these programs as part of a ploy to deceive them that I was recovering so that I could get better at manipulation and hiding it. Obviously that only works so many times, people get tired of the battle and after years of fear and torment, eventually friends and family refused to support my situation and enable my ‘slow and painful suicide’ anymore. \nFor me my ED has always mattered more than anyone or anything else, it fuels my decisions my thoughts my day my mood every second of my life. But being a parent, you have a real chance at getting away from the toxicity. Wanting to set a better example for my son helped me change things that no program or doctor could in 15 years of trying. I’m still sick and always will be but I’m not on a hospital bed with tubes and wires trying to keep me alive and my son doesn’t have to worry about “what’s wrong with mommy?” \nThat part feels good, but the sick side of me is furious with myself for not maintaining dangerously low weights and I feel like a weak failure enraged with myself unless I’m actively engaging in triggers, then I feel empowered again. \n\nConsider it honestly with yourself first, better to do now when she is still young then later but I totally get how you feel! I had to leave my son for in house when he was only 4 months old and it was awful! \nGood luck!! Enjoy the holiday morning with your daughter!",
          "created_utc": 1608864561.0
        },
        {
          "id": "ggyx361",
          "author": "beautyandthebeach718",
          "body": "omg those meal replacement drinks sound absolutely horrible! sitting like concrete inside me 🥴 honestly, i don’t really feel like i’m ready for recovery but i know i need to for my daughter. i want to for her. idk if i’ll ever be truly ready but i just need to pull the trigger. like you, originally, i thought i’d just do it to get everyone off my back. but i know my friends just mean well when they’re pushing me to recover. they have even planned amongst themselves who could watch my daughter on what days to make treatment possible for me 🥺\n\nand i totally get it when you say people eventually get tired of the battle. i’ve been dealing with this for so long, i felt like even my doctor had given up on trying to get me to recover. he knew i didn’t want to so basically he was just doing what’s medically necessary to keep me alive. so that first visit i was talking about recovery was a very emotional one 😅 i was crying, the nurses were crying, my doctor was telling me how proud he was.. \n\nbut wow, everything you’re telling me just makes it seem so much more scary & difficult 😬 but i do appreciate everyone’s comments and their honesty. even though it’s hard to swallow, i know these truths come with good intentions and i am grateful. i’m glad you did it for your son ❤️ i hope you continue on a healthier path",
          "created_utc": 1608877733.0
        },
        {
          "id": "ggyyqh3",
          "author": "zan078",
          "body": "don’t let this intimidate you! I am only telling you that because that was the reason I failed the first time, I thought I had outsmarted them and then bam they were like NOPE and I simply couldn’t deal with the feeling after so I never went back. I’m only trying to inform you that recovery itself is uncomfortable and yeah it feels scary but it’s not nearly as bad if you cooperate, resisting makes the default scenarios that result way harder on you and that can easily drive you away so if you’re ready and have such amazing people supporting you, then take advantage of this moment and thank god that you’ve been so blessed and go because it’s never going to feel good or exciting...never not even healthy people would want to relinquish their freedom in that sense. so if you have built momentum and a support system def do it now! especially where you have a daughter think of the impact your health and appearance and relationship with food could have on her. \n\nPlus, you will meet girls that you will grow really close with and that helps a lot! I learned to crochet and knit in my early days of programs! Not all of mine but the intensive ones where I spent significant time I always met at least one or two people who really got it and I felt support from their presence without having to even talk or share. \n\nI am really happy that you’re in such a strong headspace to even talk and share and consider going so give yourself a lot of credit for that! We both know how impossible that point is to even reach at all so kudos to you!!! Try not to compare, you will see girls that may be sicker than you but don’t let make you feel unworthy of being there...I total get the competitive aspect and it’s so hard but just stick with it and take the advice of those who have been there longer they have usually already learned all of the hard ways and can save you a lot of discomfort! \n\nI hope you enjoy tomorrow morning I just got done setting everything up!!! I wish you all the best! You can do this and you will feel so much happier afterwards when you can truly play with your kid and be present for the moment instead of preoccupied with some battle in your head that no one knows is so loud!",
          "created_utc": 1608879261.0
        },
        {
          "id": "ggz19rr",
          "author": "beautyandthebeach718",
          "body": "aww can i just hug you? lol no, but seriously, it helps to talk to someone who gets it ❤️ that bit about freedom... you know how many people can tell you EDs have a lot to do with control. i can’t imagine how difficult it’s going to be to let someone else decide what i eat 😨\n\nyears ago, i met some girls who were going through the same thing as me and we grew close sharing our awful habits but then eventually most of them moved on to recovery and i was just like “yea... can’t relate” 😂😭💀 but maybe i’ll find some new people in these programs that get it and that does sound really helpful. \n\nand Merry Christmas! 🤗 thanks for all the info and encouragement!",
          "created_utc": 1608881826.0
        }
      ]
    },
    {
      "id": "gguzwez",
      "author": "beautyandthebeach718",
      "body": "you’re lucky to not gain after a meal. i always weigh myself before and after i eat anything so that i “get rid of it” until i’m at the before weight or lower. i won’t even drink a cup of water bc it literally makes me 8 oz heavier. i know how ridiculous this is... \n\nand yes, that’s what i need! healthy coping mechanisms. especially when dealing with stress, trauma, flashbacks, etc. one of the coordinators at the facility sent me the schedule and i saw how many meals there were. i hope they don’t expect me to consume that much to start 😦i also saw “art therapy” and “trauma/boundaries” so i’m interested to see if those can help me 🤞🏻",
      "created_utc": 1608776966.0,
      "score": 1,
      "context": [
        {
          "id": "gguam7o",
          "author": "Yola-tilapias",
          "body": "One there are lots of people with different body types in treatment, so if that’s your concern don’t worry. \n\nTwo if you’re under the impression that you’ll be able to only gain a little weight while in treatment, let that go. They won’t let you only gain a little. They will keep feeding you until you gain. Yeah you can try and not eat to get around it but they weigh you too. \n\nAnd if you continue not to gain they’ll ask you to leave. People in my treatment were asked to leave for non compliance. It’s voluntary treatment so they’ll ask you to return when you’re ready. \n\nYou either need to be all in or not. To be honest I gained way more than I wanted to while in treatment because I couldn’t exercise either. \n\nBut after getting out I lost the weight without completely returning to unhealthy patterns. Still struggle, of course. \n\nGood luck.",
          "created_utc": 1608763121.0
        },
        {
          "id": "ggubi3s",
          "author": "beautyandthebeach718",
          "body": "that’s not what i wanted to hear lol but it’s what i NEEDED to hear so thank you for your honesty! i mean it. and seeing that you lost the weight you gained without completely returning to unhealthy patterns gives me hope. you’re so right, i need to be all in. the last thing i want is to spend the money and time in treatment (especially being away from my 2 year old) and NOT get better.",
          "created_utc": 1608763528.0
        },
        {
          "id": "gguc43b",
          "author": "Yola-tilapias",
          "body": "I’m not going to lie, I gave up my scale when I entered treatment and the first time I weighed myself after having been in I FREAKED out. \n\nThey blind weigh each week and I unloaded on them saying you lied to me, I never agreed to gain this much weight!! Etc etc. \n\nMeanwhile not one single person on the outside I knew thought I looked bad, but it shows you how strong of a hold it can have on you. \n\nIf you’ve been in any kind of treatment you know it’s a response mechanism to stressors in our lives. So even now when I get stressed out I’ll just stop eating as a means to feel in control. \n\nI know it’ll never completely go away, so I just try to make good choices. \n\nSo when you go just remember there are good days and bad. But ultimately you’re going in (I imagine) because you feel like it has control of you and not the other way around. When you feel upset or like giving up remember that you’re mostly doing better, if not perfectly fine.",
          "created_utc": 1608763815.0
        },
        {
          "id": "gguijql",
          "author": "beautyandthebeach718",
          "body": "when my doctor suggested i get rid of my scale, the thought alone gave me so much anxiety. bc idk how i look. like what i see in the mirror and photos and videos are all completely different. and i can’t rely on my clothes bc if i fit something smaller, i just assume i must’ve stretched it out. so i need my scale to know what i look like. \n\nblind weighing sounds terrifying and i don’t blame you for your reaction, i would’ve been the same way! it sucks that you still struggle 😔 i believe the same thing, like it never truly goes away 100%. but you are doing better and i hope you continue to do so! (hugs)\n\nanyone i’ve shared this with usually says “just eat. you’re not fat” and i know i’m not fat but i FEEL fat and out of control if i eat. i feel so unattractive when i eat. like i’m pigging out. i get super mad if someone looks at me when i’m eating 😫 \n\nand yes, this is more about control than my weight bc i have a lot of trauma in my life and currently, some things are just falling apart so my life feels out of control. i feel like i control my body and my weight. but i do see how this ED is actually controlling me. my weight affects my mood for the day and it affects my family/social life especially when it involves gatherings with food/drinks. \n\ni need to find better coping mechanisms. every time i get upset, my first thought is to starve 😬 SIGHHHHH... honestly, recovery sounds so scary but i know i need to get better, especially for my daughter.",
          "created_utc": 1608767366.0
        },
        {
          "id": "ggur32d",
          "author": "Yola-tilapias",
          "body": "Don’t be too hard on yourself. Most people deal with stress in less than perfect ways (drugs, alcohol, sexual promiscuity, gambling, excessive shopping, etc). So you are not alone in trying to deal with stress in less than perfect ways. \n\nOne thing I said to myself going in was that I was feeling more and more out of control every day, so I’d listen and try whatever they said in the hope that they could do what I couldn’t, which was to loosen the grip this THING had over me. \n\nBut yeah every feeling you have had I have had, people saying “you’re  skinny, eat” and I’m like “what do you know!!”\n\nOr eating a meal and literally afraid to get on the scale, CERTAIN I’ve gained 5-10lbs. Then eventually I get on and I haven’t gained at all. But the fear and anxiety are real, and powerful. \n\nAnother thing about treatment they help give you effective ways to deal with stress. Tools to help you accept the stress that everyone gets, and not let it manifest itself in unhealthy coping mechanisms. \n\nThat may sound simplistic and like yeah right give me a break, but they do help.",
          "created_utc": 1608772093.0
        }
      ]
    },
    {
      "id": "ggvdhm7",
      "author": "Yola-tilapias",
      "body": "Oh I would weigh myself religiously three tines a day. Now just 3-4 times a week. Nights after hot yoga were the best because it was certain I’d weigh 3-4lbs less from all the sweat. \n\nMy program made me eat all meals immediately even though I felt sooooo full from breakfast. Eventually my hunger cues returned to a more normal point. \n\nJust try and remember that you’re going to have to sit with really unpleasant emotions and feelings that the eating disorder allow you to ignore. \n\nWith your normal coping mechanisms rejected you’re going to experience a lot of pain and unpleasant emotions until you can begin to incorporate healthier and sustainable coping mechanisms.",
      "created_utc": 1608785227.0,
      "score": 1,
      "context": [
        {
          "id": "gguam7o",
          "author": "Yola-tilapias",
          "body": "One there are lots of people with different body types in treatment, so if that’s your concern don’t worry. \n\nTwo if you’re under the impression that you’ll be able to only gain a little weight while in treatment, let that go. They won’t let you only gain a little. They will keep feeding you until you gain. Yeah you can try and not eat to get around it but they weigh you too. \n\nAnd if you continue not to gain they’ll ask you to leave. People in my treatment were asked to leave for non compliance. It’s voluntary treatment so they’ll ask you to return when you’re ready. \n\nYou either need to be all in or not. To be honest I gained way more than I wanted to while in treatment because I couldn’t exercise either. \n\nBut after getting out I lost the weight without completely returning to unhealthy patterns. Still struggle, of course. \n\nGood luck.",
          "created_utc": 1608763121.0
        },
        {
          "id": "ggubi3s",
          "author": "beautyandthebeach718",
          "body": "that’s not what i wanted to hear lol but it’s what i NEEDED to hear so thank you for your honesty! i mean it. and seeing that you lost the weight you gained without completely returning to unhealthy patterns gives me hope. you’re so right, i need to be all in. the last thing i want is to spend the money and time in treatment (especially being away from my 2 year old) and NOT get better.",
          "created_utc": 1608763528.0
        },
        {
          "id": "gguc43b",
          "author": "Yola-tilapias",
          "body": "I’m not going to lie, I gave up my scale when I entered treatment and the first time I weighed myself after having been in I FREAKED out. \n\nThey blind weigh each week and I unloaded on them saying you lied to me, I never agreed to gain this much weight!! Etc etc. \n\nMeanwhile not one single person on the outside I knew thought I looked bad, but it shows you how strong of a hold it can have on you. \n\nIf you’ve been in any kind of treatment you know it’s a response mechanism to stressors in our lives. So even now when I get stressed out I’ll just stop eating as a means to feel in control. \n\nI know it’ll never completely go away, so I just try to make good choices. \n\nSo when you go just remember there are good days and bad. But ultimately you’re going in (I imagine) because you feel like it has control of you and not the other way around. When you feel upset or like giving up remember that you’re mostly doing better, if not perfectly fine.",
          "created_utc": 1608763815.0
        },
        {
          "id": "gguijql",
          "author": "beautyandthebeach718",
          "body": "when my doctor suggested i get rid of my scale, the thought alone gave me so much anxiety. bc idk how i look. like what i see in the mirror and photos and videos are all completely different. and i can’t rely on my clothes bc if i fit something smaller, i just assume i must’ve stretched it out. so i need my scale to know what i look like. \n\nblind weighing sounds terrifying and i don’t blame you for your reaction, i would’ve been the same way! it sucks that you still struggle 😔 i believe the same thing, like it never truly goes away 100%. but you are doing better and i hope you continue to do so! (hugs)\n\nanyone i’ve shared this with usually says “just eat. you’re not fat” and i know i’m not fat but i FEEL fat and out of control if i eat. i feel so unattractive when i eat. like i’m pigging out. i get super mad if someone looks at me when i’m eating 😫 \n\nand yes, this is more about control than my weight bc i have a lot of trauma in my life and currently, some things are just falling apart so my life feels out of control. i feel like i control my body and my weight. but i do see how this ED is actually controlling me. my weight affects my mood for the day and it affects my family/social life especially when it involves gatherings with food/drinks. \n\ni need to find better coping mechanisms. every time i get upset, my first thought is to starve 😬 SIGHHHHH... honestly, recovery sounds so scary but i know i need to get better, especially for my daughter.",
          "created_utc": 1608767366.0
        },
        {
          "id": "ggur32d",
          "author": "Yola-tilapias",
          "body": "Don’t be too hard on yourself. Most people deal with stress in less than perfect ways (drugs, alcohol, sexual promiscuity, gambling, excessive shopping, etc). So you are not alone in trying to deal with stress in less than perfect ways. \n\nOne thing I said to myself going in was that I was feeling more and more out of control every day, so I’d listen and try whatever they said in the hope that they could do what I couldn’t, which was to loosen the grip this THING had over me. \n\nBut yeah every feeling you have had I have had, people saying “you’re  skinny, eat” and I’m like “what do you know!!”\n\nOr eating a meal and literally afraid to get on the scale, CERTAIN I’ve gained 5-10lbs. Then eventually I get on and I haven’t gained at all. But the fear and anxiety are real, and powerful. \n\nAnother thing about treatment they help give you effective ways to deal with stress. Tools to help you accept the stress that everyone gets, and not let it manifest itself in unhealthy coping mechanisms. \n\nThat may sound simplistic and like yeah right give me a break, but they do help.",
          "created_utc": 1608772093.0
        },
        {
          "id": "gguzwez",
          "author": "beautyandthebeach718",
          "body": "you’re lucky to not gain after a meal. i always weigh myself before and after i eat anything so that i “get rid of it” until i’m at the before weight or lower. i won’t even drink a cup of water bc it literally makes me 8 oz heavier. i know how ridiculous this is... \n\nand yes, that’s what i need! healthy coping mechanisms. especially when dealing with stress, trauma, flashbacks, etc. one of the coordinators at the facility sent me the schedule and i saw how many meals there were. i hope they don’t expect me to consume that much to start 😦i also saw “art therapy” and “trauma/boundaries” so i’m interested to see if those can help me 🤞🏻",
          "created_utc": 1608776966.0
        }
      ]
    },
    {
      "id": "ggvjmhj",
      "author": "beautyandthebeach718",
      "body": "not gonna lie, even just the thought of having a single meal sit in me is 🥴 but i’ll try to remember and focus on the positives!",
      "created_utc": 1608789607.0,
      "score": 1,
      "context": [
        {
          "id": "gguam7o",
          "author": "Yola-tilapias",
          "body": "One there are lots of people with different body types in treatment, so if that’s your concern don’t worry. \n\nTwo if you’re under the impression that you’ll be able to only gain a little weight while in treatment, let that go. They won’t let you only gain a little. They will keep feeding you until you gain. Yeah you can try and not eat to get around it but they weigh you too. \n\nAnd if you continue not to gain they’ll ask you to leave. People in my treatment were asked to leave for non compliance. It’s voluntary treatment so they’ll ask you to return when you’re ready. \n\nYou either need to be all in or not. To be honest I gained way more than I wanted to while in treatment because I couldn’t exercise either. \n\nBut after getting out I lost the weight without completely returning to unhealthy patterns. Still struggle, of course. \n\nGood luck.",
          "created_utc": 1608763121.0
        },
        {
          "id": "ggubi3s",
          "author": "beautyandthebeach718",
          "body": "that’s not what i wanted to hear lol but it’s what i NEEDED to hear so thank you for your honesty! i mean it. and seeing that you lost the weight you gained without completely returning to unhealthy patterns gives me hope. you’re so right, i need to be all in. the last thing i want is to spend the money and time in treatment (especially being away from my 2 year old) and NOT get better.",
          "created_utc": 1608763528.0
        },
        {
          "id": "gguc43b",
          "author": "Yola-tilapias",
          "body": "I’m not going to lie, I gave up my scale when I entered treatment and the first time I weighed myself after having been in I FREAKED out. \n\nThey blind weigh each week and I unloaded on them saying you lied to me, I never agreed to gain this much weight!! Etc etc. \n\nMeanwhile not one single person on the outside I knew thought I looked bad, but it shows you how strong of a hold it can have on you. \n\nIf you’ve been in any kind of treatment you know it’s a response mechanism to stressors in our lives. So even now when I get stressed out I’ll just stop eating as a means to feel in control. \n\nI know it’ll never completely go away, so I just try to make good choices. \n\nSo when you go just remember there are good days and bad. But ultimately you’re going in (I imagine) because you feel like it has control of you and not the other way around. When you feel upset or like giving up remember that you’re mostly doing better, if not perfectly fine.",
          "created_utc": 1608763815.0
        },
        {
          "id": "gguijql",
          "author": "beautyandthebeach718",
          "body": "when my doctor suggested i get rid of my scale, the thought alone gave me so much anxiety. bc idk how i look. like what i see in the mirror and photos and videos are all completely different. and i can’t rely on my clothes bc if i fit something smaller, i just assume i must’ve stretched it out. so i need my scale to know what i look like. \n\nblind weighing sounds terrifying and i don’t blame you for your reaction, i would’ve been the same way! it sucks that you still struggle 😔 i believe the same thing, like it never truly goes away 100%. but you are doing better and i hope you continue to do so! (hugs)\n\nanyone i’ve shared this with usually says “just eat. you’re not fat” and i know i’m not fat but i FEEL fat and out of control if i eat. i feel so unattractive when i eat. like i’m pigging out. i get super mad if someone looks at me when i’m eating 😫 \n\nand yes, this is more about control than my weight bc i have a lot of trauma in my life and currently, some things are just falling apart so my life feels out of control. i feel like i control my body and my weight. but i do see how this ED is actually controlling me. my weight affects my mood for the day and it affects my family/social life especially when it involves gatherings with food/drinks. \n\ni need to find better coping mechanisms. every time i get upset, my first thought is to starve 😬 SIGHHHHH... honestly, recovery sounds so scary but i know i need to get better, especially for my daughter.",
          "created_utc": 1608767366.0
        },
        {
          "id": "ggur32d",
          "author": "Yola-tilapias",
          "body": "Don’t be too hard on yourself. Most people deal with stress in less than perfect ways (drugs, alcohol, sexual promiscuity, gambling, excessive shopping, etc). So you are not alone in trying to deal with stress in less than perfect ways. \n\nOne thing I said to myself going in was that I was feeling more and more out of control every day, so I’d listen and try whatever they said in the hope that they could do what I couldn’t, which was to loosen the grip this THING had over me. \n\nBut yeah every feeling you have had I have had, people saying “you’re  skinny, eat” and I’m like “what do you know!!”\n\nOr eating a meal and literally afraid to get on the scale, CERTAIN I’ve gained 5-10lbs. Then eventually I get on and I haven’t gained at all. But the fear and anxiety are real, and powerful. \n\nAnother thing about treatment they help give you effective ways to deal with stress. Tools to help you accept the stress that everyone gets, and not let it manifest itself in unhealthy coping mechanisms. \n\nThat may sound simplistic and like yeah right give me a break, but they do help.",
          "created_utc": 1608772093.0
        },
        {
          "id": "gguzwez",
          "author": "beautyandthebeach718",
          "body": "you’re lucky to not gain after a meal. i always weigh myself before and after i eat anything so that i “get rid of it” until i’m at the before weight or lower. i won’t even drink a cup of water bc it literally makes me 8 oz heavier. i know how ridiculous this is... \n\nand yes, that’s what i need! healthy coping mechanisms. especially when dealing with stress, trauma, flashbacks, etc. one of the coordinators at the facility sent me the schedule and i saw how many meals there were. i hope they don’t expect me to consume that much to start 😦i also saw “art therapy” and “trauma/boundaries” so i’m interested to see if those can help me 🤞🏻",
          "created_utc": 1608776966.0
        },
        {
          "id": "ggvdhm7",
          "author": "Yola-tilapias",
          "body": "Oh I would weigh myself religiously three tines a day. Now just 3-4 times a week. Nights after hot yoga were the best because it was certain I’d weigh 3-4lbs less from all the sweat. \n\nMy program made me eat all meals immediately even though I felt sooooo full from breakfast. Eventually my hunger cues returned to a more normal point. \n\nJust try and remember that you’re going to have to sit with really unpleasant emotions and feelings that the eating disorder allow you to ignore. \n\nWith your normal coping mechanisms rejected you’re going to experience a lot of pain and unpleasant emotions until you can begin to incorporate healthier and sustainable coping mechanisms.",
          "created_utc": 1608785227.0
        }
      ]
    }
  ]
}