{
  "id": "kklsze",
  "subreddit": "AnorexiaNervosa",
  "author": "Awkward_Gxrl",
  "created_utc": 1609002295.0,
  "title": "List of things that push me into recovery",
  "selftext": "I know these times are really hard. Today when I saw I gained weight I felt like I wanted to relapse and not eat anything in weeks. So I'm forcing myself to remember why I want to recover, and share it with you because why not?\n\n1. My hair: I used to have the brightest and healthiest hair and now it is so brittle and bad-looking. I want my hair back.\n\n2. My body hair: This lanugo bs is going to drive me insane. I don't want it anymore.\n\n3. My body shape: I KNOW skinny isn't the answer. I KNOW I don't want to be built like a fucking door. I KNOW I want my tits back. I KNOW I want my ass back. I don't care if some 14 year old with a meanspo blog has written the opposite on Tumblr. Nobody likes bodies that are as severely underweight as mine. And I want to use my old bras again.\n\n4. My mom: I don't want her to suffer anymore because of me.\n\n5. My dad: He likes when I suffer. He laughs when I refuse to eat. When I'm in a bad day, he laughs at my mom because she's suffering. I won't let him win.\n\n6. My future: I want to be an independent adult and if I can't even EAT how the fuck I'm gonna live alone.\n\n7. My social life: I don't want to lose anymore friends because I'm so fucking scared of an ice cream cone that I don't hang out with them.\n\n8. My period: Idgaf if it felt like a knife on my lower back. I miss it. I miss the feeling of \"oh, when I grow up I could have children\" even if I never wanted children.\n\n9. My skin: I have never had porcelain skin. But the mess I have in my face right now is gross. And I have to remember that it was worse when I weighed less.\n\n10. My grades: I still get good grades, but Idk how much I'm gonna be able to keep them high if I need to read 50 times each phrase to fit it in my head because I'm too busy thinking about how could I eat less than xx calories for dinner.\n\nFeel free to share your reasons in the comments! And happy holidays!",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/kklsze/list_of_things_that_push_me_into_recovery/",
  "score": 135,
  "num_comments": 8,
  "comments": [
    {
      "id": "gh3dju1",
      "author": "Ironicbanana14",
      "body": "I will add some!\n\nMy energy: i fucking miss going on walks or playing with my cat without being dead afterward. I need it back.\n\nWaking up and sleeping better: blood sugar affects this too much for me, i always sleep not enough or too much. I need my healthy sleep back too.",
      "created_utc": 1609009136.0,
      "score": 35,
      "context": []
    },
    {
      "id": "gh3lqf8",
      "author": "fishsoap69",
      "body": "Can I just say fuck your dad holy shit",
      "created_utc": 1609013742.0,
      "score": 29,
      "context": []
    },
    {
      "id": "gh3fx7f",
      "author": "pathologicalprotest",
      "body": "All very, very good reasons:)\n\n-Memory! I used to have good long- and short term memory. Now I can’t remember if I even locked my front door or what my friend told me thirty seconds ago.\n\n-Cognition! The brain fog makes me miserable and renders me unable to function in my job.\n\n-Mood and humour! When did I lose my jibe? When did I start existing like a ghoul sent to plague my surroundings like a dark cloud?\n\n-Peace of mind! I’m so jittery and anxious every waking hour, and even when I am able to fall asleep, which is rare, I sleepwalk, and it’s getting dangerous. One morning I had unlocked my front door (fortunately not the security chain). This may not be eating disorder specific, but it’s probably connected to my being angst ridden and miserable.\n\n-For my family! My GP told me the straight facts, and my parents, however much they fucked me up should not have to bury me, nor should my niece and nephew have to know that their aunt died because she didn’t eat.\n\n-I actually know how to cook. So having friends over and making dinner for them without spending the day in complete panic would be nice.\n\n-TMI: actually getting a libido back.\n\n-Also not spending every day in physical pain would be nice.\n\nYou can do it, OP! I believe in you and am rooting for you. Happy holidays:)",
      "created_utc": 1609010415.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gh3dhka",
      "author": "sarathedime",
      "body": "You can do this!! When I was in recovery, my physiology grade shot up to 105% rather than the 80% when I was super sick. I was a good student even in my ED but when I had mental energy I did so much better than I ever thought possible!\n\nAnd my hair was the first thing my husband noticed was healthier during treatment",
      "created_utc": 1609009100.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gh3atzs",
      "author": "ZealousIdealKiwi",
      "body": "I believe in you!!! You’ve got some super good reasons! I feel you on the hair one especially, my hair started to fall out and I hated it. Sending good vibes from me🥰",
      "created_utc": 1609007626.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gh40dkd",
      "author": "zan078",
      "body": "Wow i admire your ability to NOT immediately give in to self-destructive behavior - NOT easy!! I commend you for showing and sharing your positive vibes and determination!!!! Especially in vie of such cruelty! You seem to be an incredibly capable person and I am rooting for you from here! 💙",
      "created_utc": 1609022419.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gh424e3",
      "author": "TheFuckedUpDuck",
      "body": "oh my yes! stand up to your dad!",
      "created_utc": 1609023445.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ghb7q7j",
      "author": "Realmenbrowsememes",
      "body": "My heart: What’s the point of being skinny and liking how I look if I feel like I’ll get a heart failure at any moment.",
      "created_utc": 1609180678.0,
      "score": 2,
      "context": []
    }
  ]
}