{
  "id": "ko69kn",
  "subreddit": "AnorexiaNervosa",
  "author": "xX_EthanKitKat_Xx",
  "created_utc": 1609480997.0,
  "title": "Never EVER force people with anorexia to eat if they don’t want to.",
  "selftext": "I just had a New Years sleepover with my friends... I love them, I really do, but for heavens sake they have no fucking idea what it’s like to be anorexic and be surrounded by foods you don’t even want to think about being around. \n\nThe cherry on top of the cake is being forced/pushed to eat fear foods, people need to understand that if you know someone who is suffering from ANY eating disorder, do not think it’s okay to socially pressure them into eating if they don’t want to, and DO NOT comment on them as a person with things like “She/He/They never eats” \n\nJust back the hell off.\n\nEdit: I would like to change this from the original title to “Never EVER force people to eat if they don’t want to.”",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ko69kn/never_ever_force_people_with_anorexia_to_eat_if/",
  "score": 190,
  "num_comments": 17,
  "comments": [
    {
      "id": "ghomlio",
      "author": "None",
      "body": "Being forced to eat something is really traumatic and will have the opposite affect. I have specific foods that i will never be able to eat again or even look at, because somebody thought they were being “helpful” by shoving them down my mouth",
      "created_utc": 1609483910.0,
      "score": 41,
      "context": []
    },
    {
      "id": "ghomfon",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1609483762.0,
      "score": 49,
      "context": []
    },
    {
      "id": "ghpo7ij",
      "author": "jake25456",
      "body": "While yes forcing people to eat is what is done in an treatment (at least were I live) it is carefuly watched and done by medical professionals forcing people with an ed to eat so they get better is like grabbing a fist full of random anti depressants and shoving them in the face of a suicideal person",
      "created_utc": 1609509550.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ghpz4q5",
      "author": "petewentz-from-mcr",
      "body": "I literally had never purged until my mom forced me to eat as she watched every night at dinner. I couldn’t slip it to the dogs even, I literally mean watched. I’ve had issues with people watching me eat because of this super traumatic thing when I was 7, so even if I didn’t have a restrictive ED it would have fucked me up. I couldn’t even manage to eat at school until the end of high school over that, like forcing me to eat (especially while being watched) was bullshit. \n\nMy sister used to buy me high-calorie snack foods and give me a due date. Like here’s one of those like 2 foot tall tubs of cheese balls, have it gone Friday. I had mixed feelings about that because on one hand she asked if I wanted her help and I said yes, but on the other using guilt from people spending money on me to make me eat sucked. Especially because she gave me such unrealistic deadlines! Like my sister actually has BED, so it was really extra difficult because neither of us had any idea how much humans are supposed to eat",
      "created_utc": 1609514663.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ghp65qp",
      "author": "lalabearie",
      "body": "I have a friend, he cares for me, love to see me eat and always want to bring me out for good food. He is really kind and sweet but the act of “do you want desert?” “Do u want ice cream” “whats your craving today” is getting annoying. \n\nI wasn’t hungry and he kept saying if you want this or that when we pass by food shop when we are just literally window-shopping/ taking a walk is a toll to my mental health as i keep saying no no no i dont need it. And if he asked again if i want any food by the fourth time, i snapped.",
      "created_utc": 1609499696.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ghpyv63",
      "author": "Carrie_Mc",
      "body": "If your friends know about your anorexia then I would tell them the things that are unhelpful.\n\nI know a lot of the time these things can seem obvious but I've learned that these things just don't cross a lot of people's minds as eating disorders are something that's very difficult for anyone who hasn't experienced it to understand.\n\nI've talked to my friends and boyfriend before about things they've said and they've learned from it and understood and never done it again - even apologised for not realising beforehand how it may affect me.\n\nSo if it would be something your comfortable with I'd definitely do that, plus it's nice to educate people on what it's really like :)",
      "created_utc": 1609514540.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghp5rl8",
      "author": "makemeawizard",
      "body": "This is eye-opening for me, as it reminds me how sensitive we must be to the needs of a person with AN, especially if they are in recovery. Sure, being force fed can be beneficial - I believe we all need some kind of pushing force in recovery to keep us accountable - but it’s not the best option, and I believe should be the last resort if possible. As someone who was sick with anorexia before, I also had the experience of being forced to eat, and even force fed. Fortunately, I was desperate enough to recover that I actually complied. But after reading your post, it does bring back awful memories when my mom would just shove food in my mouth. I’d be having a panic attack and she’ll act like nothing’s happening and continue shoving food into me. I think my brain has locked that memory away for good, but your post reminds me that what she did really was insensitive and there could have been a better way to coax me into eating more than just forcing me to eat. I’m lucky enough to not be traumatised and can eat anything I want now. The people around us mean the best for us, but we need our time to recover too.",
      "created_utc": 1609499477.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ghr3c3o",
      "author": "Senioritisidek",
      "body": "also never make people with anorexia gain more weight than they are comfortable with!! it will literally make them relapse",
      "created_utc": 1609530376.0,
      "score": -1,
      "context": []
    },
    {
      "id": "ghp6jan",
      "author": "suggestedusername69",
      "body": "It's trashy and moronic to disregard a pandemic to have a sleepover.",
      "created_utc": 1609499891.0,
      "score": -10,
      "context": []
    },
    {
      "id": "ghrb5ni",
      "author": "None",
      "body": "I remember years ago a guy I was seeing wanted me to go out for food with him and his friends. I really didn’t want to but decided to go and try to have fun. I’m always really awkward and shy around new people and food in general. I ended up ordering one plain pancake and a glass of water. He commented on it in front of everyone over and over again and kept trying to get me to order more, then one of his friends started making comments as well. I wanted to crawl under the table and die.",
      "created_utc": 1609534059.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ghopzzy",
      "author": "anony0419",
      "body": "yup- i have two foods that i can never touch/ think about because of traumatic experiences either being forced to eat them or attempts to force me to eat them due to ED restrictive behaviours. it’s so stupid that people think it works when it just makes it worse",
      "created_utc": 1609487151.0,
      "score": 14,
      "context": [
        {
          "id": "ghomlio",
          "author": "None",
          "body": "Being forced to eat something is really traumatic and will have the opposite affect. I have specific foods that i will never be able to eat again or even look at, because somebody thought they were being “helpful” by shoving them down my mouth",
          "created_utc": 1609483910.0
        }
      ]
    },
    {
      "id": "ghpr992",
      "author": "Wrencer4Endgame",
      "body": "I went from 3 months of heavy restriction to having to eat the same dinner meal as my family has one day because my mum decided that I looked too sick. \nIt really doesn't help with recovery. Just makes you enter another kind of hell where you force yourself to eat to not worry others. Because ofc my ED is just me annoying ppl in the sole purpose of having them worry for me, lol",
      "created_utc": 1609510985.0,
      "score": 6,
      "context": [
        {
          "id": "ghomlio",
          "author": "None",
          "body": "Being forced to eat something is really traumatic and will have the opposite affect. I have specific foods that i will never be able to eat again or even look at, because somebody thought they were being “helpful” by shoving them down my mouth",
          "created_utc": 1609483910.0
        }
      ]
    },
    {
      "id": "ghr6oef",
      "author": "brookleiaway",
      "body": "plus it makes me purge because im so starved that i binge then after they pressure me to eat they are like whyd you eat so much",
      "created_utc": 1609531662.0,
      "score": 3,
      "context": [
        {
          "id": "ghomlio",
          "author": "None",
          "body": "Being forced to eat something is really traumatic and will have the opposite affect. I have specific foods that i will never be able to eat again or even look at, because somebody thought they were being “helpful” by shoving them down my mouth",
          "created_utc": 1609483910.0
        }
      ]
    },
    {
      "id": "ghon8xv",
      "author": "xX_EthanKitKat_Xx",
      "body": "If there was the opinion to edit the title I would change it to your title, I put the new title in the description. 💕",
      "created_utc": 1609484503.0,
      "score": 14,
      "context": [
        {
          "id": "ghomfon",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1609483762.0
        }
      ]
    },
    {
      "id": "ghqbxye",
      "author": "lyar22",
      "body": "This reminds me of a therapist, who refused to talk about eating issues with me and insisted my only option was to work it out on my own or go into hospital and eat being watched by nurses. I remember the moment she said that, my heart sank.\nAll I want to do is have a conversation with someone I trust about this to understand/be understood.. Why is help always zero/nothing to ten/hospital - no help in between?",
      "created_utc": 1609520219.0,
      "score": 3,
      "context": [
        {
          "id": "ghp5rl8",
          "author": "makemeawizard",
          "body": "This is eye-opening for me, as it reminds me how sensitive we must be to the needs of a person with AN, especially if they are in recovery. Sure, being force fed can be beneficial - I believe we all need some kind of pushing force in recovery to keep us accountable - but it’s not the best option, and I believe should be the last resort if possible. As someone who was sick with anorexia before, I also had the experience of being forced to eat, and even force fed. Fortunately, I was desperate enough to recover that I actually complied. But after reading your post, it does bring back awful memories when my mom would just shove food in my mouth. I’d be having a panic attack and she’ll act like nothing’s happening and continue shoving food into me. I think my brain has locked that memory away for good, but your post reminds me that what she did really was insensitive and there could have been a better way to coax me into eating more than just forcing me to eat. I’m lucky enough to not be traumatised and can eat anything I want now. The people around us mean the best for us, but we need our time to recover too.",
          "created_utc": 1609499477.0
        }
      ]
    },
    {
      "id": "ghplndc",
      "author": "xX_EthanKitKat_Xx",
      "body": "I live in AUS where we’re allowed to have sleepovers like that and it was like me and two other people and we slept in seperate rooms lmao",
      "created_utc": 1609508313.0,
      "score": 6,
      "context": [
        {
          "id": "ghp6jan",
          "author": "suggestedusername69",
          "body": "It's trashy and moronic to disregard a pandemic to have a sleepover.",
          "created_utc": 1609499891.0
        }
      ]
    },
    {
      "id": "ghqt209",
      "author": "catsinsunglassess",
      "body": "Yep. Took me years to eat a steak after being forced to eat an entire steak by my dad when he noticed i wasn’t eating. I know he was doing his best, but holy shit. Just not the right way to handle the situation at all.",
      "created_utc": 1609526570.0,
      "score": 5,
      "context": [
        {
          "id": "ghomlio",
          "author": "None",
          "body": "Being forced to eat something is really traumatic and will have the opposite affect. I have specific foods that i will never be able to eat again or even look at, because somebody thought they were being “helpful” by shoving them down my mouth",
          "created_utc": 1609483910.0
        },
        {
          "id": "ghopzzy",
          "author": "anony0419",
          "body": "yup- i have two foods that i can never touch/ think about because of traumatic experiences either being forced to eat them or attempts to force me to eat them due to ED restrictive behaviours. it’s so stupid that people think it works when it just makes it worse",
          "created_utc": 1609487151.0
        }
      ]
    }
  ]
}