{
  "id": "kogzaw",
  "subreddit": "AnorexiaNervosa",
  "author": "lebaneseflagemoji",
  "created_utc": 1609528319.0,
  "title": "Praising my eating disorder",
  "selftext": "At work the other day, I showed one of my co-workers a photo from me at a healthy weight, to show her a cute pair of shoes. She completely ignored the shoes and immediately started asking me how I lost weight. I try to be open about my illness at work, as it often directly affects my work performance. When I told her that I have anorexia; her first response was: “oh wow! I could never do that, I don’t have enough will power. Wish I could lose weight like that.”  I feel super uncomfortable. All my other co-workers have been incredibly kind and understanding, one of them even going so far as to stock the break room fridge with one of my safe foods. I’m really scared that the next time we work together, I’ll have a panic attack or get really triggered. Should I talk to someone about it? Should I talk to my boss, or the co-worker who praised my sick body? Do I just let it go? This has been weighing on me.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/kogzaw/praising_my_eating_disorder/",
  "score": 206,
  "num_comments": 14,
  "comments": [
    {
      "id": "ghrd52v",
      "author": "lesbian_canadian",
      "body": "I think some people just arent educated on proper etiquette when it comes to EDs. Which sucks for us but maybe make this a teaching moment. Tell her those comments aren't helpful for someone with anorexia",
      "created_utc": 1609535117.0,
      "score": 132,
      "context": []
    },
    {
      "id": "ghrvvre",
      "author": "soundandvisions",
      "body": "I talked to my boss who helped me figure out what to do with a coworker who was making comments about my eating. It was very helpful.",
      "created_utc": 1609545237.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ghr29ez",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1609529962.0,
      "score": 29,
      "context": []
    },
    {
      "id": "ght0xp2",
      "author": "annielovesbacon",
      "body": "Reminds me of a celebrity (can’t remember who) who said she “tried to have anorexia” but she wasn’t “strong enough.” It makes me angry but at the same time I know it comes from a lack of understanding, not malice. I’m sorry your coworker said that :( I think it’s really cool that you’re open about it. It shouldn’t be your job to educate her, but if you’re up to it, I wonder if you could say something about it to her and maybe she would understand.",
      "created_utc": 1609569656.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ghsjnnw",
      "author": "fuckyoudeath",
      "body": "I personally would talk to your boss about it. Maybe they can have a meeting about sensitivity towards people's issues to help prevent something like this from happening again. Honestly, all employers should do this, since almost everyone has some sort of issue that deeply affects them like this. \n\nI've been in your shoes, but instead of praising it (1 or 2 people did this), most of them bullied me for it. I know how rough it is, and I, as well as the people of this subreddit, are here for you. I really hope you can work something out between you and your boss and/or coworkers to make it a safer place for everyone.",
      "created_utc": 1609558439.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ghsp0tx",
      "author": "Lilliam00",
      "body": "Hi, if it's going to be triggering for you to work with her i would just have a talk with them so they know how you feel.",
      "created_utc": 1609561478.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ghuemq9",
      "author": "None",
      "body": "I think saying something along the lines of “anorexia isn’t a diet or a fad, it’s a sickness.” often gets the point across for me.",
      "created_utc": 1609609263.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gjvnqe1",
      "author": "elsie14",
      "body": "She probably didn’t know what to say, didn’t expect that from you.  I’ve learned to change what i say depending on the situation.  if i think they will be uncomfortable i will say was “sick” at the time or “not the healthy way.” must get the hint without praising.",
      "created_utc": 1611094354.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gj2d014",
      "author": "doyouwantto69",
      "body": "You probably made her feel uncomfortable too by talking about your personal problems so it seems like you’re even.",
      "created_utc": 1610501070.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ghrebeg",
      "author": "lebaneseflagemoji",
      "body": "That was my exact thought process. She often comments to me that she wants to lose weight and I kind of think I should just have a heart-to-heart with her about body image. She’s a really sweet gal, and I know she didn’t mean to upset me. also, your username is wonderful 💘",
      "created_utc": 1609535764.0,
      "score": 46,
      "context": [
        {
          "id": "ghrd52v",
          "author": "lesbian_canadian",
          "body": "I think some people just arent educated on proper etiquette when it comes to EDs. Which sucks for us but maybe make this a teaching moment. Tell her those comments aren't helpful for someone with anorexia",
          "created_utc": 1609535117.0
        }
      ]
    },
    {
      "id": "ghs4swi",
      "author": "lebaneseflagemoji",
      "body": "Thank you, I’m sorry you went through that",
      "created_utc": 1609550265.0,
      "score": 8,
      "context": [
        {
          "id": "ghrvvre",
          "author": "soundandvisions",
          "body": "I talked to my boss who helped me figure out what to do with a coworker who was making comments about my eating. It was very helpful.",
          "created_utc": 1609545237.0
        }
      ]
    },
    {
      "id": "ghsacly",
      "author": "imsosorryhowever",
      "body": "I don’t think there is any reason to get the boss involved here. \n\nThe coworker might just be uneducated about anorexia. \n\nThis would be a great learning opportunity.",
      "created_utc": 1609553344.0,
      "score": 10,
      "context": [
        {
          "id": "ghr29ez",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1609529962.0
        }
      ]
    },
    {
      "id": "gj2dqz7",
      "author": "lebaneseflagemoji",
      "body": "This is a really bitchy thing to say to someone :/",
      "created_utc": 1610501474.0,
      "score": 1,
      "context": [
        {
          "id": "gj2d014",
          "author": "doyouwantto69",
          "body": "You probably made her feel uncomfortable too by talking about your personal problems so it seems like you’re even.",
          "created_utc": 1610501070.0
        }
      ]
    },
    {
      "id": "ghsc3si",
      "author": "boderlineboderline",
      "body": "yea but if they don’t feel comfortable talking to her them self it’s okay to involve their boss. she’s not going to get fired over it",
      "created_utc": 1609554306.0,
      "score": 8,
      "context": [
        {
          "id": "ghr29ez",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1609529962.0
        },
        {
          "id": "ghsacly",
          "author": "imsosorryhowever",
          "body": "I don’t think there is any reason to get the boss involved here. \n\nThe coworker might just be uneducated about anorexia. \n\nThis would be a great learning opportunity.",
          "created_utc": 1609553344.0
        }
      ]
    }
  ]
}