{
  "id": "kpsgb2",
  "subreddit": "AnorexiaNervosa",
  "author": "franshah",
  "created_utc": 1609706148.0,
  "title": "Waiting for death",
  "selftext": "As many of you have, I've been struggling over the holidays and am now restricting quite heavily. I'm back to my lowest weight and BMI ever.\n\nI have no motivation to recover and have also found o have zero appetite which makes it even easier to listen to the ED voice. \n\nAlongside this I am pretty bored of life, and suffer from depression. I guess I've given up fighting and am now just waiting for the ED to kill me.\n\nJust wondering if anyone else has gotten to this point? How have they dealt with it?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/kpsgb2/waiting_for_death/",
  "score": 121,
  "num_comments": 34,
  "comments": [
    {
      "id": "ghztsy1",
      "author": "ConFectx",
      "body": "Do not wait for the ED to kill you. I cannot say anything else except that you should keep fighting. Do not give in!",
      "created_utc": 1609708297.0,
      "score": 42,
      "context": []
    },
    {
      "id": "ghzu2gj",
      "author": "Tajskskskss",
      "body": "I’m so sorry. I get you. That’s what anorexia is essentially: a rather slow method of self-destruction. It’s no coincidence that most people with the disorder also suffer from extremely low self-confidence and self-harming tendencies. \nI really hope you get better. This must sound superficial from an online stranger, but life is truly worth living, even if we can’t tell yet. I personally like to distract myself by consuming different forms of media, like shows or music. I also like to have daily rituals/parts of the day I’m always looking forward to, even if they seem super small/insignificant to the average person. That ritual is related to eating in my case, since I get very little of that lmao, but if your appetite has vanished, that might not necessarily work for you. Try thinking about all the things you used to enjoy and make sure to re-explore them on a regular basis. That could give you something to look forward to. \n\nAt the end of the day, a therapist would obviously give much more solid advice than I can ever hope to, but if you ever want to talk about anything, feel free to message me. I’ve had suicidal thoughts in the past (though they were decidedly more reactive than my current state of mind lmao), and I’m so grateful that I didn’t listen. \n\nThe gray will fade away eventually, I promise.",
      "created_utc": 1609708413.0,
      "score": 29,
      "context": []
    },
    {
      "id": "gi0b6b6",
      "author": "None",
      "body": "Yep. I was like this for 5 plus years, but I didn’t have to be in there that long. I think what helped me is just increasing even when I didn’t want to, very slowly. I think the discomfort with life became so acute because of malnutrition I had forgotten that normal life didn’t actually feel like that. I also think the malnutrition itself was giving me low motivation and suicidal thoughts, rather than the other way around, and it was a revelation when I started increasing that motivation just came back because I was feeding myself. Please try ABA meetings. There are a lot of zoom meetings atm https://aba12steps.org/aba-meetings/virtual-meetings/",
      "created_utc": 1609716376.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ghzwa1g",
      "author": "Shxnxgamx",
      "body": "I exactly know your situation.\nMy depression is so strong, that I only wait till I’m 18 and move out, so nobody can control me but me (or rather my ed). And then I can die. Alone and nobody can stop me!",
      "created_utc": 1609709411.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gi0nn2u",
      "author": "pathologicalprotest",
      "body": "That's a tough spot, OP. I believe and pray you'll ride it out. \n\nIt took some effort I didn't really have the energy for, but for my psychology finding something I could engage with has helped. For me that was one thing, for others it will be other things. It can really be anything, just something to draw you out and help you find value in living, despite. As simple or complicated as you like. Could be as simple watching birds, or as complex as playing chess. Whatever keeps you engaged and not isolated with depression.",
      "created_utc": 1609722394.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gi0f7zy",
      "author": "None",
      "body": "I'm so sorry. this makes me so upset to read. no one is beyond hope.",
      "created_utc": 1609718278.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gi12qxr",
      "author": "certifiedgroober",
      "body": "I was in this position for a long time, mostly all 2019 and the start of 2020. What really helped me was just being honest with people you can trust. I had a few close people and my psychologist, they wouldn’t force me to eat, but they would encourage me to try, make meals and offer to share with me. But what helped more was finding people to hold hope for you and just distract you, or distracting yourself by anything that gives you even a tiny bit of pleasure. Funny YouTube videos, good shows on Netflix, hot drinks in bed, music, art, writing, anything! Just look for the little things in life to take you away from the magnitude of your pain. It can get better as long as you don’t give up. I wish you all the best and hope your pain eases soon.",
      "created_utc": 1609730191.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gi01nq5",
      "author": "SatisfactionBitter34",
      "body": "i’m in the same area. call me trash but i told my ex that i sexted other girls in the beginning of our relationship during freshman year and i pretty much might just go back to ED and starve to death. i don’t see a point now",
      "created_utc": 1609711889.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gi13edg",
      "author": "soundandvisions",
      "body": "I’m there with you",
      "created_utc": 1609730541.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gi13h2d",
      "author": "Fvneralm0on",
      "body": "Don’t do it!\nI’m in the hospital in critical care, my organs are failing I can’t drink or eat anymore.",
      "created_utc": 1609730582.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gi1fiqx",
      "author": "MilaKsenia",
      "body": "Yeah I was just like that for a long time I actually can’t believe I didn’t commit suicide but I’m grateful I didn’t because one day all of that shit stopped and everything changed for me for the better, my entire perspective on life shifted and I escaped that hell hole. Trust me if I got through it anyone can, I’ve had every disadvantage and struggle you could possibly imagine but I’m okay. It’s 2021 and I’m alive even though there are COUNTLESS times I 100% should’ve died but didn’t, I love myself despite my flaws and past self destructive behavior, I’m happy even though my life is a mess because tomorrow is a new day and the past doesn’t matter the past only exists for us to learn and grow from it. Look inward to find what you’re needing that you don’t have and figure out a way to ask for it or seek it out on your own. Get on the right meds I cannot stress this one enough because antidepressants and anti anxiety meds saved my fucking life no joke. Again, look inward and find the things you love about yourself and write them down. I highly recommend journaling just to organize your thoughts. If you’re religious go to church or get involved with some kind of group, idk what your family situation is but spending time with my family is something that has made me a happier person. I understand these are incredibly dark times for you but please listen when I tell you that tomorrow could be different, it could be better and if you find yourself smiling, laughing, just being happy in general recognize that and hold on to that moment and be grateful for whatever you’re personally grateful for. You deserve to be happy just as much as anyone else but some of us (myself included) really have to work harder to be happy it’s not fair but it means you have to personally work on yourself and your mental health. Take a walk and get fresh air, appreciate the beauty of nature, GET A HOBBY seriously whatever you’re passionate about dive into that! For me back then I didn’t know what I was passionate about I wasn’t passionate about anything I just liked watching tv and movies so film & television became a hobby like writing reviews and searching for the next best thing, I also got REALLY in to psychology because I wanted to understand my own mental health issues and how to fix them and how to help some of my family members who have pretty serious mental problems and it turned into me reading and researching and learning all about it and it ended up being my major in college and I’m now working towards a career in psychology. Shit gets better, it just takes a little work. I really really hope this helps I wouldn’t have typed a novel if I didn’t think that sharing my own personal journey and things that helped me if i didn’t think it would be helpful to you! Trust me, I know what it’s like and I’m so sorry. Positive energy and keeping a positive outlook will take you a long way! Positivity is half the battle here!",
      "created_utc": 1609737276.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gi1j1o0",
      "author": "fishsoap69",
      "body": "Im sorry. me too. I relate. I’m at my lowest and it’s still not enough for me :’) I told myself 2022 I’ll start to recover. But seeing you at this state, you should try to get help now.",
      "created_utc": 1609739668.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gi239m4",
      "author": "0_surge",
      "body": "i’ve been in this state before. got to a point then just stopped eating all together and said i was done.\nwhat got me out of it was someone close to me needing help. we had a meal together and that time has passed now but what i can still say is i would’ve missed out on a lot.\nsome cool things have happened since then that weren’t big but i would’ve missed them.\nalso, it’s really not a fun death. it’s not fading away and casually dying in your sleep.\nit’s organ failure and sleepless nights, ventilators and injections and interventions that you didn’t ask for. it’s people crying and looking you in your dying eyes, its your last trauma and it won’t be how you want it to be",
      "created_utc": 1609758337.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gi1q3vx",
      "author": "franshah",
      "body": "But why? I'm fairly happy with what I've achieved in life and am just ready to call it a day. I'm not sad about it. I just dont want to have to live anymore.",
      "created_utc": 1609745291.0,
      "score": 9,
      "context": [
        {
          "id": "ghztsy1",
          "author": "ConFectx",
          "body": "Do not wait for the ED to kill you. I cannot say anything else except that you should keep fighting. Do not give in!",
          "created_utc": 1609708297.0
        }
      ]
    },
    {
      "id": "gi1yfuq",
      "author": "shadehdheheued",
      "body": "Sorry if I interrupt, but... What's the ED voice?",
      "created_utc": 1609753459.0,
      "score": 1,
      "context": [
        {
          "id": "ghztsy1",
          "author": "ConFectx",
          "body": "Do not wait for the ED to kill you. I cannot say anything else except that you should keep fighting. Do not give in!",
          "created_utc": 1609708297.0
        }
      ]
    },
    {
      "id": "gi1q8dp",
      "author": "franshah",
      "body": "Thanks for the support. I have hobbies e.g. walking, cycling. Unfortunately they are exercise related so feed the ED. Also, I dont really want to engage anymore. My life has been fine. I'm just ready for it to end.",
      "created_utc": 1609745405.0,
      "score": 2,
      "context": [
        {
          "id": "gi0nn2u",
          "author": "pathologicalprotest",
          "body": "That's a tough spot, OP. I believe and pray you'll ride it out. \n\nIt took some effort I didn't really have the energy for, but for my psychology finding something I could engage with has helped. For me that was one thing, for others it will be other things. It can really be anything, just something to draw you out and help you find value in living, despite. As simple or complicated as you like. Could be as simple watching birds, or as complex as playing chess. Whatever keeps you engaged and not isolated with depression.",
          "created_utc": 1609722394.0
        }
      ]
    },
    {
      "id": "gi1qbrk",
      "author": "franshah",
      "body": "Thanks. It's not painful as such.. just boring. I'm fed up of the monotony of life and want to finish now. Like reading a book and not really wanting to continue with it because it's not your cup of tea.",
      "created_utc": 1609745489.0,
      "score": 3,
      "context": [
        {
          "id": "gi12qxr",
          "author": "certifiedgroober",
          "body": "I was in this position for a long time, mostly all 2019 and the start of 2020. What really helped me was just being honest with people you can trust. I had a few close people and my psychologist, they wouldn’t force me to eat, but they would encourage me to try, make meals and offer to share with me. But what helped more was finding people to hold hope for you and just distract you, or distracting yourself by anything that gives you even a tiny bit of pleasure. Funny YouTube videos, good shows on Netflix, hot drinks in bed, music, art, writing, anything! Just look for the little things in life to take you away from the magnitude of your pain. It can get better as long as you don’t give up. I wish you all the best and hope your pain eases soon.",
          "created_utc": 1609730191.0
        }
      ]
    },
    {
      "id": "gi1qe4i",
      "author": "franshah",
      "body": "I'm sorry you are feeling that way. How long have you been in hospital?",
      "created_utc": 1609745548.0,
      "score": 3,
      "context": [
        {
          "id": "gi13h2d",
          "author": "Fvneralm0on",
          "body": "Don’t do it!\nI’m in the hospital in critical care, my organs are failing I can’t drink or eat anymore.",
          "created_utc": 1609730582.0
        }
      ]
    },
    {
      "id": "gi1hisg",
      "author": "None",
      "body": "Wow i really needed this. Read it all. Thank you :)",
      "created_utc": 1609738606.0,
      "score": 3,
      "context": [
        {
          "id": "gi1fiqx",
          "author": "MilaKsenia",
          "body": "Yeah I was just like that for a long time I actually can’t believe I didn’t commit suicide but I’m grateful I didn’t because one day all of that shit stopped and everything changed for me for the better, my entire perspective on life shifted and I escaped that hell hole. Trust me if I got through it anyone can, I’ve had every disadvantage and struggle you could possibly imagine but I’m okay. It’s 2021 and I’m alive even though there are COUNTLESS times I 100% should’ve died but didn’t, I love myself despite my flaws and past self destructive behavior, I’m happy even though my life is a mess because tomorrow is a new day and the past doesn’t matter the past only exists for us to learn and grow from it. Look inward to find what you’re needing that you don’t have and figure out a way to ask for it or seek it out on your own. Get on the right meds I cannot stress this one enough because antidepressants and anti anxiety meds saved my fucking life no joke. Again, look inward and find the things you love about yourself and write them down. I highly recommend journaling just to organize your thoughts. If you’re religious go to church or get involved with some kind of group, idk what your family situation is but spending time with my family is something that has made me a happier person. I understand these are incredibly dark times for you but please listen when I tell you that tomorrow could be different, it could be better and if you find yourself smiling, laughing, just being happy in general recognize that and hold on to that moment and be grateful for whatever you’re personally grateful for. You deserve to be happy just as much as anyone else but some of us (myself included) really have to work harder to be happy it’s not fair but it means you have to personally work on yourself and your mental health. Take a walk and get fresh air, appreciate the beauty of nature, GET A HOBBY seriously whatever you’re passionate about dive into that! For me back then I didn’t know what I was passionate about I wasn’t passionate about anything I just liked watching tv and movies so film & television became a hobby like writing reviews and searching for the next best thing, I also got REALLY in to psychology because I wanted to understand my own mental health issues and how to fix them and how to help some of my family members who have pretty serious mental problems and it turned into me reading and researching and learning all about it and it ended up being my major in college and I’m now working towards a career in psychology. Shit gets better, it just takes a little work. I really really hope this helps I wouldn’t have typed a novel if I didn’t think that sharing my own personal journey and things that helped me if i didn’t think it would be helpful to you! Trust me, I know what it’s like and I’m so sorry. Positive energy and keeping a positive outlook will take you a long way! Positivity is half the battle here!",
          "created_utc": 1609737276.0
        }
      ]
    },
    {
      "id": "gi1qr5d",
      "author": "franshah",
      "body": "Thanks for the support. I have hobbies and keep busy. I'm just bored of life. There is nothing to look forward to anymore. I hgo to work, come home. Rinse and repeat. I'm done. I just dont want this anymore.",
      "created_utc": 1609745873.0,
      "score": 3,
      "context": [
        {
          "id": "gi1fiqx",
          "author": "MilaKsenia",
          "body": "Yeah I was just like that for a long time I actually can’t believe I didn’t commit suicide but I’m grateful I didn’t because one day all of that shit stopped and everything changed for me for the better, my entire perspective on life shifted and I escaped that hell hole. Trust me if I got through it anyone can, I’ve had every disadvantage and struggle you could possibly imagine but I’m okay. It’s 2021 and I’m alive even though there are COUNTLESS times I 100% should’ve died but didn’t, I love myself despite my flaws and past self destructive behavior, I’m happy even though my life is a mess because tomorrow is a new day and the past doesn’t matter the past only exists for us to learn and grow from it. Look inward to find what you’re needing that you don’t have and figure out a way to ask for it or seek it out on your own. Get on the right meds I cannot stress this one enough because antidepressants and anti anxiety meds saved my fucking life no joke. Again, look inward and find the things you love about yourself and write them down. I highly recommend journaling just to organize your thoughts. If you’re religious go to church or get involved with some kind of group, idk what your family situation is but spending time with my family is something that has made me a happier person. I understand these are incredibly dark times for you but please listen when I tell you that tomorrow could be different, it could be better and if you find yourself smiling, laughing, just being happy in general recognize that and hold on to that moment and be grateful for whatever you’re personally grateful for. You deserve to be happy just as much as anyone else but some of us (myself included) really have to work harder to be happy it’s not fair but it means you have to personally work on yourself and your mental health. Take a walk and get fresh air, appreciate the beauty of nature, GET A HOBBY seriously whatever you’re passionate about dive into that! For me back then I didn’t know what I was passionate about I wasn’t passionate about anything I just liked watching tv and movies so film & television became a hobby like writing reviews and searching for the next best thing, I also got REALLY in to psychology because I wanted to understand my own mental health issues and how to fix them and how to help some of my family members who have pretty serious mental problems and it turned into me reading and researching and learning all about it and it ended up being my major in college and I’m now working towards a career in psychology. Shit gets better, it just takes a little work. I really really hope this helps I wouldn’t have typed a novel if I didn’t think that sharing my own personal journey and things that helped me if i didn’t think it would be helpful to you! Trust me, I know what it’s like and I’m so sorry. Positive energy and keeping a positive outlook will take you a long way! Positivity is half the battle here!",
          "created_utc": 1609737276.0
        }
      ]
    },
    {
      "id": "gi26tc9",
      "author": "franshah",
      "body": "The thought of the death being traumatic is the only downside. Though I'm sure if I write a document stating I want no interventions, that would reduce the trauma. I know my SO would respect those wishes...we have talked about that sort of stuff before. If only assisted suicide was legal!",
      "created_utc": 1609761706.0,
      "score": 1,
      "context": [
        {
          "id": "gi239m4",
          "author": "0_surge",
          "body": "i’ve been in this state before. got to a point then just stopped eating all together and said i was done.\nwhat got me out of it was someone close to me needing help. we had a meal together and that time has passed now but what i can still say is i would’ve missed out on a lot.\nsome cool things have happened since then that weren’t big but i would’ve missed them.\nalso, it’s really not a fun death. it’s not fading away and casually dying in your sleep.\nit’s organ failure and sleepless nights, ventilators and injections and interventions that you didn’t ask for. it’s people crying and looking you in your dying eyes, its your last trauma and it won’t be how you want it to be",
          "created_utc": 1609758337.0
        }
      ]
    },
    {
      "id": "gi2mi0v",
      "author": "ApartmentHorror",
      "body": "I had thoughts like that (feeling satisfied and able to just let go) but it was just a particular type of depression. I’d recommend getting on antidepressants, especially a NDRI like Wellbutrin to try to mollify those thoughts then you can work on recovery or whatever else it’s been blocking. It really does help, the not-sad satisfied type of suicidal or apathetic thoughts aren’t your own, they’re just a neurochemical issue that’s fixable.",
      "created_utc": 1609772666.0,
      "score": 3,
      "context": [
        {
          "id": "ghztsy1",
          "author": "ConFectx",
          "body": "Do not wait for the ED to kill you. I cannot say anything else except that you should keep fighting. Do not give in!",
          "created_utc": 1609708297.0
        },
        {
          "id": "gi1q3vx",
          "author": "franshah",
          "body": "But why? I'm fairly happy with what I've achieved in life and am just ready to call it a day. I'm not sad about it. I just dont want to have to live anymore.",
          "created_utc": 1609745291.0
        }
      ]
    },
    {
      "id": "gi2qy8j",
      "author": "HumanoidRapture",
      "body": "It’s the part of you that tells you to eat less, throw up, take laxatives, and lose weight. It’s the ed personified. People like to disassociate themselves from their disorder.",
      "created_utc": 1609775011.0,
      "score": 3,
      "context": [
        {
          "id": "ghztsy1",
          "author": "ConFectx",
          "body": "Do not wait for the ED to kill you. I cannot say anything else except that you should keep fighting. Do not give in!",
          "created_utc": 1609708297.0
        },
        {
          "id": "gi1yfuq",
          "author": "shadehdheheued",
          "body": "Sorry if I interrupt, but... What's the ED voice?",
          "created_utc": 1609753459.0
        }
      ]
    },
    {
      "id": "gi1tg6d",
      "author": "pathologicalprotest",
      "body": "Is that a common occurence for you, or is it new? Maybe it’s time to talk to your GP about the severity of your depression. I know you’re tired, but you don’t always have to feel this way and be this low. Are you able to consume something so complete depletion isn’t aggravating your already fragile state?",
      "created_utc": 1609748378.0,
      "score": 3,
      "context": [
        {
          "id": "gi0nn2u",
          "author": "pathologicalprotest",
          "body": "That's a tough spot, OP. I believe and pray you'll ride it out. \n\nIt took some effort I didn't really have the energy for, but for my psychology finding something I could engage with has helped. For me that was one thing, for others it will be other things. It can really be anything, just something to draw you out and help you find value in living, despite. As simple or complicated as you like. Could be as simple watching birds, or as complex as playing chess. Whatever keeps you engaged and not isolated with depression.",
          "created_utc": 1609722394.0
        },
        {
          "id": "gi1q8dp",
          "author": "franshah",
          "body": "Thanks for the support. I have hobbies e.g. walking, cycling. Unfortunately they are exercise related so feed the ED. Also, I dont really want to engage anymore. My life has been fine. I'm just ready for it to end.",
          "created_utc": 1609745405.0
        }
      ]
    },
    {
      "id": "gi1huln",
      "author": "MilaKsenia",
      "body": "Good!!! Always happy to help❤️",
      "created_utc": 1609738827.0,
      "score": 2,
      "context": [
        {
          "id": "gi1fiqx",
          "author": "MilaKsenia",
          "body": "Yeah I was just like that for a long time I actually can’t believe I didn’t commit suicide but I’m grateful I didn’t because one day all of that shit stopped and everything changed for me for the better, my entire perspective on life shifted and I escaped that hell hole. Trust me if I got through it anyone can, I’ve had every disadvantage and struggle you could possibly imagine but I’m okay. It’s 2021 and I’m alive even though there are COUNTLESS times I 100% should’ve died but didn’t, I love myself despite my flaws and past self destructive behavior, I’m happy even though my life is a mess because tomorrow is a new day and the past doesn’t matter the past only exists for us to learn and grow from it. Look inward to find what you’re needing that you don’t have and figure out a way to ask for it or seek it out on your own. Get on the right meds I cannot stress this one enough because antidepressants and anti anxiety meds saved my fucking life no joke. Again, look inward and find the things you love about yourself and write them down. I highly recommend journaling just to organize your thoughts. If you’re religious go to church or get involved with some kind of group, idk what your family situation is but spending time with my family is something that has made me a happier person. I understand these are incredibly dark times for you but please listen when I tell you that tomorrow could be different, it could be better and if you find yourself smiling, laughing, just being happy in general recognize that and hold on to that moment and be grateful for whatever you’re personally grateful for. You deserve to be happy just as much as anyone else but some of us (myself included) really have to work harder to be happy it’s not fair but it means you have to personally work on yourself and your mental health. Take a walk and get fresh air, appreciate the beauty of nature, GET A HOBBY seriously whatever you’re passionate about dive into that! For me back then I didn’t know what I was passionate about I wasn’t passionate about anything I just liked watching tv and movies so film & television became a hobby like writing reviews and searching for the next best thing, I also got REALLY in to psychology because I wanted to understand my own mental health issues and how to fix them and how to help some of my family members who have pretty serious mental problems and it turned into me reading and researching and learning all about it and it ended up being my major in college and I’m now working towards a career in psychology. Shit gets better, it just takes a little work. I really really hope this helps I wouldn’t have typed a novel if I didn’t think that sharing my own personal journey and things that helped me if i didn’t think it would be helpful to you! Trust me, I know what it’s like and I’m so sorry. Positive energy and keeping a positive outlook will take you a long way! Positivity is half the battle here!",
          "created_utc": 1609737276.0
        },
        {
          "id": "gi1hisg",
          "author": "None",
          "body": "Wow i really needed this. Read it all. Thank you :)",
          "created_utc": 1609738606.0
        }
      ]
    },
    {
      "id": "gi2jaoz",
      "author": "MilaKsenia",
      "body": "I understand. I hope you find something that makes life more fun and exciting for you ❤️",
      "created_utc": 1609770853.0,
      "score": 1,
      "context": [
        {
          "id": "gi1fiqx",
          "author": "MilaKsenia",
          "body": "Yeah I was just like that for a long time I actually can’t believe I didn’t commit suicide but I’m grateful I didn’t because one day all of that shit stopped and everything changed for me for the better, my entire perspective on life shifted and I escaped that hell hole. Trust me if I got through it anyone can, I’ve had every disadvantage and struggle you could possibly imagine but I’m okay. It’s 2021 and I’m alive even though there are COUNTLESS times I 100% should’ve died but didn’t, I love myself despite my flaws and past self destructive behavior, I’m happy even though my life is a mess because tomorrow is a new day and the past doesn’t matter the past only exists for us to learn and grow from it. Look inward to find what you’re needing that you don’t have and figure out a way to ask for it or seek it out on your own. Get on the right meds I cannot stress this one enough because antidepressants and anti anxiety meds saved my fucking life no joke. Again, look inward and find the things you love about yourself and write them down. I highly recommend journaling just to organize your thoughts. If you’re religious go to church or get involved with some kind of group, idk what your family situation is but spending time with my family is something that has made me a happier person. I understand these are incredibly dark times for you but please listen when I tell you that tomorrow could be different, it could be better and if you find yourself smiling, laughing, just being happy in general recognize that and hold on to that moment and be grateful for whatever you’re personally grateful for. You deserve to be happy just as much as anyone else but some of us (myself included) really have to work harder to be happy it’s not fair but it means you have to personally work on yourself and your mental health. Take a walk and get fresh air, appreciate the beauty of nature, GET A HOBBY seriously whatever you’re passionate about dive into that! For me back then I didn’t know what I was passionate about I wasn’t passionate about anything I just liked watching tv and movies so film & television became a hobby like writing reviews and searching for the next best thing, I also got REALLY in to psychology because I wanted to understand my own mental health issues and how to fix them and how to help some of my family members who have pretty serious mental problems and it turned into me reading and researching and learning all about it and it ended up being my major in college and I’m now working towards a career in psychology. Shit gets better, it just takes a little work. I really really hope this helps I wouldn’t have typed a novel if I didn’t think that sharing my own personal journey and things that helped me if i didn’t think it would be helpful to you! Trust me, I know what it’s like and I’m so sorry. Positive energy and keeping a positive outlook will take you a long way! Positivity is half the battle here!",
          "created_utc": 1609737276.0
        },
        {
          "id": "gi1qr5d",
          "author": "franshah",
          "body": "Thanks for the support. I have hobbies and keep busy. I'm just bored of life. There is nothing to look forward to anymore. I hgo to work, come home. Rinse and repeat. I'm done. I just dont want this anymore.",
          "created_utc": 1609745873.0
        }
      ]
    },
    {
      "id": "gi2cvq1",
      "author": "0_surge",
      "body": "personally i understand, i don’t fight people on the idea of suicide because i don’t know their mental state how they do so i respect that.\n\ni do urge you to think about the mental complications of starving including in a way thinking how you wouldn’t commonly think if your mind was healthy. \noften documents wouldn’t pass in terms of your physical heath (at least here) if you aren’t considered mentally sound so it may be also be an issue. i too have thought about assisted suicide and how it should be an option but for most, sadly your physical health is out before your mental heath in any hospital setting",
      "created_utc": 1609766674.0,
      "score": 1,
      "context": [
        {
          "id": "gi239m4",
          "author": "0_surge",
          "body": "i’ve been in this state before. got to a point then just stopped eating all together and said i was done.\nwhat got me out of it was someone close to me needing help. we had a meal together and that time has passed now but what i can still say is i would’ve missed out on a lot.\nsome cool things have happened since then that weren’t big but i would’ve missed them.\nalso, it’s really not a fun death. it’s not fading away and casually dying in your sleep.\nit’s organ failure and sleepless nights, ventilators and injections and interventions that you didn’t ask for. it’s people crying and looking you in your dying eyes, its your last trauma and it won’t be how you want it to be",
          "created_utc": 1609758337.0
        },
        {
          "id": "gi26tc9",
          "author": "franshah",
          "body": "The thought of the death being traumatic is the only downside. Though I'm sure if I write a document stating I want no interventions, that would reduce the trauma. I know my SO would respect those wishes...we have talked about that sort of stuff before. If only assisted suicide was legal!",
          "created_utc": 1609761706.0
        }
      ]
    },
    {
      "id": "gi2rjxg",
      "author": "shadehdheheued",
      "body": "Thank you",
      "created_utc": 1609775315.0,
      "score": 2,
      "context": [
        {
          "id": "ghztsy1",
          "author": "ConFectx",
          "body": "Do not wait for the ED to kill you. I cannot say anything else except that you should keep fighting. Do not give in!",
          "created_utc": 1609708297.0
        },
        {
          "id": "gi1yfuq",
          "author": "shadehdheheued",
          "body": "Sorry if I interrupt, but... What's the ED voice?",
          "created_utc": 1609753459.0
        },
        {
          "id": "gi2qy8j",
          "author": "HumanoidRapture",
          "body": "It’s the part of you that tells you to eat less, throw up, take laxatives, and lose weight. It’s the ed personified. People like to disassociate themselves from their disorder.",
          "created_utc": 1609775011.0
        }
      ]
    },
    {
      "id": "gi1u3da",
      "author": "franshah",
      "body": "I often get bored with life but usually can have things to look forward to. Travelling is a big passion of mine and usually gets me through dark times. However it's been a year with no travel and that looks set to continue for at least another year or so due to covid etc. I could consume something but dont see the point e.g. I could have something for breakfast right now. But I'm not hungry, and why bother? I still have energy to keep occupied today by going on a walk etc. I just want to get further into the bad state I'm in so it ends quicker.",
      "created_utc": 1609749005.0,
      "score": 2,
      "context": [
        {
          "id": "gi0nn2u",
          "author": "pathologicalprotest",
          "body": "That's a tough spot, OP. I believe and pray you'll ride it out. \n\nIt took some effort I didn't really have the energy for, but for my psychology finding something I could engage with has helped. For me that was one thing, for others it will be other things. It can really be anything, just something to draw you out and help you find value in living, despite. As simple or complicated as you like. Could be as simple watching birds, or as complex as playing chess. Whatever keeps you engaged and not isolated with depression.",
          "created_utc": 1609722394.0
        },
        {
          "id": "gi1q8dp",
          "author": "franshah",
          "body": "Thanks for the support. I have hobbies e.g. walking, cycling. Unfortunately they are exercise related so feed the ED. Also, I dont really want to engage anymore. My life has been fine. I'm just ready for it to end.",
          "created_utc": 1609745405.0
        },
        {
          "id": "gi1tg6d",
          "author": "pathologicalprotest",
          "body": "Is that a common occurence for you, or is it new? Maybe it’s time to talk to your GP about the severity of your depression. I know you’re tired, but you don’t always have to feel this way and be this low. Are you able to consume something so complete depletion isn’t aggravating your already fragile state?",
          "created_utc": 1609748378.0
        }
      ]
    },
    {
      "id": "gi2drys",
      "author": "franshah",
      "body": "I do understand the effects of starvation on my mental health. I know this is likely to be worsening the emotions I'm feeling. As I say, I'm just dont want to have to live another 40+ years doing the same old thing. \n\nImagine playing a computer game and you have enjoyed it. You haven't completed it but you no longer want to play. It's like that but with life. I've achieved all I want to. The idea of continuing with the game of life, when it's just doing the same thing over and over, is not appealing. I'd rather just log off.",
      "created_utc": 1609767314.0,
      "score": 1,
      "context": [
        {
          "id": "gi239m4",
          "author": "0_surge",
          "body": "i’ve been in this state before. got to a point then just stopped eating all together and said i was done.\nwhat got me out of it was someone close to me needing help. we had a meal together and that time has passed now but what i can still say is i would’ve missed out on a lot.\nsome cool things have happened since then that weren’t big but i would’ve missed them.\nalso, it’s really not a fun death. it’s not fading away and casually dying in your sleep.\nit’s organ failure and sleepless nights, ventilators and injections and interventions that you didn’t ask for. it’s people crying and looking you in your dying eyes, its your last trauma and it won’t be how you want it to be",
          "created_utc": 1609758337.0
        },
        {
          "id": "gi26tc9",
          "author": "franshah",
          "body": "The thought of the death being traumatic is the only downside. Though I'm sure if I write a document stating I want no interventions, that would reduce the trauma. I know my SO would respect those wishes...we have talked about that sort of stuff before. If only assisted suicide was legal!",
          "created_utc": 1609761706.0
        },
        {
          "id": "gi2cvq1",
          "author": "0_surge",
          "body": "personally i understand, i don’t fight people on the idea of suicide because i don’t know their mental state how they do so i respect that.\n\ni do urge you to think about the mental complications of starving including in a way thinking how you wouldn’t commonly think if your mind was healthy. \noften documents wouldn’t pass in terms of your physical heath (at least here) if you aren’t considered mentally sound so it may be also be an issue. i too have thought about assisted suicide and how it should be an option but for most, sadly your physical health is out before your mental heath in any hospital setting",
          "created_utc": 1609766674.0
        }
      ]
    },
    {
      "id": "gi1ygl3",
      "author": "pathologicalprotest",
      "body": "Jesus you scare the shit out of me. The 'point' of eating something is that restricting fucks up your mood and your outlook as well as your body. Though depression is its own animal, not eating will not help. You should call your physician today, right now. I know you say you're ready for it to end, but then you post here, and I have no choice but to urge you to lift up the phone and ask a professional how to make you more comfortable. Commit to doing today, please commit to asking for help.",
      "created_utc": 1609753480.0,
      "score": 2,
      "context": [
        {
          "id": "gi0nn2u",
          "author": "pathologicalprotest",
          "body": "That's a tough spot, OP. I believe and pray you'll ride it out. \n\nIt took some effort I didn't really have the energy for, but for my psychology finding something I could engage with has helped. For me that was one thing, for others it will be other things. It can really be anything, just something to draw you out and help you find value in living, despite. As simple or complicated as you like. Could be as simple watching birds, or as complex as playing chess. Whatever keeps you engaged and not isolated with depression.",
          "created_utc": 1609722394.0
        },
        {
          "id": "gi1q8dp",
          "author": "franshah",
          "body": "Thanks for the support. I have hobbies e.g. walking, cycling. Unfortunately they are exercise related so feed the ED. Also, I dont really want to engage anymore. My life has been fine. I'm just ready for it to end.",
          "created_utc": 1609745405.0
        },
        {
          "id": "gi1tg6d",
          "author": "pathologicalprotest",
          "body": "Is that a common occurence for you, or is it new? Maybe it’s time to talk to your GP about the severity of your depression. I know you’re tired, but you don’t always have to feel this way and be this low. Are you able to consume something so complete depletion isn’t aggravating your already fragile state?",
          "created_utc": 1609748378.0
        },
        {
          "id": "gi1u3da",
          "author": "franshah",
          "body": "I often get bored with life but usually can have things to look forward to. Travelling is a big passion of mine and usually gets me through dark times. However it's been a year with no travel and that looks set to continue for at least another year or so due to covid etc. I could consume something but dont see the point e.g. I could have something for breakfast right now. But I'm not hungry, and why bother? I still have energy to keep occupied today by going on a walk etc. I just want to get further into the bad state I'm in so it ends quicker.",
          "created_utc": 1609749005.0
        }
      ]
    },
    {
      "id": "gi30u6l",
      "author": "0_surge",
      "body": "i completely understand that. whatever you decide to do with your life i completely respect that",
      "created_utc": 1609779812.0,
      "score": 2,
      "context": [
        {
          "id": "gi239m4",
          "author": "0_surge",
          "body": "i’ve been in this state before. got to a point then just stopped eating all together and said i was done.\nwhat got me out of it was someone close to me needing help. we had a meal together and that time has passed now but what i can still say is i would’ve missed out on a lot.\nsome cool things have happened since then that weren’t big but i would’ve missed them.\nalso, it’s really not a fun death. it’s not fading away and casually dying in your sleep.\nit’s organ failure and sleepless nights, ventilators and injections and interventions that you didn’t ask for. it’s people crying and looking you in your dying eyes, its your last trauma and it won’t be how you want it to be",
          "created_utc": 1609758337.0
        },
        {
          "id": "gi26tc9",
          "author": "franshah",
          "body": "The thought of the death being traumatic is the only downside. Though I'm sure if I write a document stating I want no interventions, that would reduce the trauma. I know my SO would respect those wishes...we have talked about that sort of stuff before. If only assisted suicide was legal!",
          "created_utc": 1609761706.0
        },
        {
          "id": "gi2cvq1",
          "author": "0_surge",
          "body": "personally i understand, i don’t fight people on the idea of suicide because i don’t know their mental state how they do so i respect that.\n\ni do urge you to think about the mental complications of starving including in a way thinking how you wouldn’t commonly think if your mind was healthy. \noften documents wouldn’t pass in terms of your physical heath (at least here) if you aren’t considered mentally sound so it may be also be an issue. i too have thought about assisted suicide and how it should be an option but for most, sadly your physical health is out before your mental heath in any hospital setting",
          "created_utc": 1609766674.0
        },
        {
          "id": "gi2drys",
          "author": "franshah",
          "body": "I do understand the effects of starvation on my mental health. I know this is likely to be worsening the emotions I'm feeling. As I say, I'm just dont want to have to live another 40+ years doing the same old thing. \n\nImagine playing a computer game and you have enjoyed it. You haven't completed it but you no longer want to play. It's like that but with life. I've achieved all I want to. The idea of continuing with the game of life, when it's just doing the same thing over and over, is not appealing. I'd rather just log off.",
          "created_utc": 1609767314.0
        }
      ]
    },
    {
      "id": "gi26zaj",
      "author": "franshah",
      "body": "I've had help before. It hasn't worked. I've been with both the NHS therapists available in my area and neither had success. The GP dismissed me and covid makes getting more than a 2 min phone call appointment impossible. The help out there doesn't work for me. Dont be scared for me. I'm quite content knowing it wont last.",
      "created_utc": 1609761854.0,
      "score": 2,
      "context": [
        {
          "id": "gi0nn2u",
          "author": "pathologicalprotest",
          "body": "That's a tough spot, OP. I believe and pray you'll ride it out. \n\nIt took some effort I didn't really have the energy for, but for my psychology finding something I could engage with has helped. For me that was one thing, for others it will be other things. It can really be anything, just something to draw you out and help you find value in living, despite. As simple or complicated as you like. Could be as simple watching birds, or as complex as playing chess. Whatever keeps you engaged and not isolated with depression.",
          "created_utc": 1609722394.0
        },
        {
          "id": "gi1q8dp",
          "author": "franshah",
          "body": "Thanks for the support. I have hobbies e.g. walking, cycling. Unfortunately they are exercise related so feed the ED. Also, I dont really want to engage anymore. My life has been fine. I'm just ready for it to end.",
          "created_utc": 1609745405.0
        },
        {
          "id": "gi1tg6d",
          "author": "pathologicalprotest",
          "body": "Is that a common occurence for you, or is it new? Maybe it’s time to talk to your GP about the severity of your depression. I know you’re tired, but you don’t always have to feel this way and be this low. Are you able to consume something so complete depletion isn’t aggravating your already fragile state?",
          "created_utc": 1609748378.0
        },
        {
          "id": "gi1u3da",
          "author": "franshah",
          "body": "I often get bored with life but usually can have things to look forward to. Travelling is a big passion of mine and usually gets me through dark times. However it's been a year with no travel and that looks set to continue for at least another year or so due to covid etc. I could consume something but dont see the point e.g. I could have something for breakfast right now. But I'm not hungry, and why bother? I still have energy to keep occupied today by going on a walk etc. I just want to get further into the bad state I'm in so it ends quicker.",
          "created_utc": 1609749005.0
        },
        {
          "id": "gi1ygl3",
          "author": "pathologicalprotest",
          "body": "Jesus you scare the shit out of me. The 'point' of eating something is that restricting fucks up your mood and your outlook as well as your body. Though depression is its own animal, not eating will not help. You should call your physician today, right now. I know you say you're ready for it to end, but then you post here, and I have no choice but to urge you to lift up the phone and ask a professional how to make you more comfortable. Commit to doing today, please commit to asking for help.",
          "created_utc": 1609753480.0
        }
      ]
    },
    {
      "id": "gi361qo",
      "author": "franshah",
      "body": "Thank you.",
      "created_utc": 1609782243.0,
      "score": 2,
      "context": [
        {
          "id": "gi239m4",
          "author": "0_surge",
          "body": "i’ve been in this state before. got to a point then just stopped eating all together and said i was done.\nwhat got me out of it was someone close to me needing help. we had a meal together and that time has passed now but what i can still say is i would’ve missed out on a lot.\nsome cool things have happened since then that weren’t big but i would’ve missed them.\nalso, it’s really not a fun death. it’s not fading away and casually dying in your sleep.\nit’s organ failure and sleepless nights, ventilators and injections and interventions that you didn’t ask for. it’s people crying and looking you in your dying eyes, its your last trauma and it won’t be how you want it to be",
          "created_utc": 1609758337.0
        },
        {
          "id": "gi26tc9",
          "author": "franshah",
          "body": "The thought of the death being traumatic is the only downside. Though I'm sure if I write a document stating I want no interventions, that would reduce the trauma. I know my SO would respect those wishes...we have talked about that sort of stuff before. If only assisted suicide was legal!",
          "created_utc": 1609761706.0
        },
        {
          "id": "gi2cvq1",
          "author": "0_surge",
          "body": "personally i understand, i don’t fight people on the idea of suicide because i don’t know their mental state how they do so i respect that.\n\ni do urge you to think about the mental complications of starving including in a way thinking how you wouldn’t commonly think if your mind was healthy. \noften documents wouldn’t pass in terms of your physical heath (at least here) if you aren’t considered mentally sound so it may be also be an issue. i too have thought about assisted suicide and how it should be an option but for most, sadly your physical health is out before your mental heath in any hospital setting",
          "created_utc": 1609766674.0
        },
        {
          "id": "gi2drys",
          "author": "franshah",
          "body": "I do understand the effects of starvation on my mental health. I know this is likely to be worsening the emotions I'm feeling. As I say, I'm just dont want to have to live another 40+ years doing the same old thing. \n\nImagine playing a computer game and you have enjoyed it. You haven't completed it but you no longer want to play. It's like that but with life. I've achieved all I want to. The idea of continuing with the game of life, when it's just doing the same thing over and over, is not appealing. I'd rather just log off.",
          "created_utc": 1609767314.0
        },
        {
          "id": "gi30u6l",
          "author": "0_surge",
          "body": "i completely understand that. whatever you decide to do with your life i completely respect that",
          "created_utc": 1609779812.0
        }
      ]
    }
  ]
}