{
  "id": "ku45ku",
  "subreddit": "AnorexiaNervosa",
  "author": "waterfallsforstreams",
  "created_utc": 1610241521.0,
  "title": "petition to normalize cashiers not commenting on the food we buy",
  "selftext": "while checking out at the grocery store with my dad the cashier picked up the baby food i picked out and went “how olds the baby?” and my dad pointed to me and said “she’s the baby”... now he knows i eat baby food and that’s so embarrassing to me:|",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ku45ku/petition_to_normalize_cashiers_not_commenting_on/",
  "score": 206,
  "num_comments": 25,
  "comments": [
    {
      "id": "giqgafi",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1610254640.0,
      "score": 66,
      "context": []
    },
    {
      "id": "giq7vf6",
      "author": "None",
      "body": "The cashier totally knew I ate baby food and I did not give a fuck.  I bought it all the time and she knew I didn’t have a baby.  I told her she should try it.  I was pretty open about my anorexia.  I’m in recovery now though.",
      "created_utc": 1610249826.0,
      "score": 41,
      "context": []
    },
    {
      "id": "gipwvgr",
      "author": "None",
      "body": "“how olds the baby” obviously between 0 and 2, lol I dont understand pointless small talk",
      "created_utc": 1610243838.0,
      "score": 81,
      "context": []
    },
    {
      "id": "giq1caz",
      "author": "Tumblweedbtch",
      "body": "Ugh I hate that so much I’m sorry:((",
      "created_utc": 1610246227.0,
      "score": 26,
      "context": []
    },
    {
      "id": "giqaw7u",
      "author": "This-Equivalent",
      "body": "i was at the grocery with my roommate and and front of like 5 people he was like “get your baby food so we can go” \ni was looking at applesauce 😅",
      "created_utc": 1610251510.0,
      "score": 21,
      "context": []
    },
    {
      "id": "giq2j8t",
      "author": "ossaossaossa",
      "body": "I mean if you’re buying baby food in front of your dad I dunno how you expected him not to notice but that sucks to be called out like that",
      "created_utc": 1610246872.0,
      "score": 36,
      "context": []
    },
    {
      "id": "giqfrgg",
      "author": "makeupyourworld",
      "body": "i mean id probably genuinely think you had a baby but at the same time if u told me u eat baby food id be like \"sounds good as hell we love babies so much so i bet theyre food is hella healthy and fresh. luv ur self care vibes 12/10\"",
      "created_utc": 1610254311.0,
      "score": 14,
      "context": []
    },
    {
      "id": "giqgms9",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1610254858.0,
      "score": 12,
      "context": []
    },
    {
      "id": "giqmheb",
      "author": "None",
      "body": "Literally so many times I go grocery shopping the cashiers always comment on how “healthy” everything I’m buying is, because it’s usually just vegetables and fruit. I’ve had comments like “wow good job, you must eat so healthy” and and every time they say something like that I cringe internally because I’m trying SO HARD to recover and challenge my food fears and even a bite of something high calorie literally makes me shake from anxiety. I would love for my cart NOT to look so “healthy” and to be able to eat like a normal person, not just the same boring rotation of too-low calorie fruits and veggies, I wish these cashiers would consider how gut wrenching it can be to be congratulated for something so seemingly “healthy” when in reality my ed literally has taken control of my whole life and recovery is the fucking hardest thing I’ve ever had to do and listening to my dietitian and increasing calories and new foods feels like torture. It just suckssss",
      "created_utc": 1610258908.0,
      "score": 13,
      "context": []
    },
    {
      "id": "giqa569",
      "author": "None",
      "body": "I thought I was the only one who bought baby food!! I feel so validated right now!",
      "created_utc": 1610251094.0,
      "score": 9,
      "context": []
    },
    {
      "id": "giqorw7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1610260650.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gir4gqs",
      "author": "tasha53505",
      "body": "Lolll, in the opposite ends- I was getting ready for a binge and had 5 things in hand (chips, chocolate, candy, Soda) all of which i was planning to eat that night. I got up to the counter and the chick was like “woah, are you having a party tonight?” God. It was embarrassing. I of course lied and said yes.",
      "created_utc": 1610275551.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gir7bsk",
      "author": "perfrctlines",
      "body": "i’m not a cashier anymore (still work at the grocery store just in a different department) and we were trained to engage the customer in any way and that includes talking about the food they were buying and ask questions like ooohh what do you put this on? or telling them how good x product is and what to pair it with. definitely different from asking how old your baby is because thats more of a personal question but could be a reason why they were trying to come up with something to say.",
      "created_utc": 1610278432.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gir6ll8",
      "author": "bc_1411",
      "body": "As someone who has both worked as a cashier in several places, and also has had an ED for half my life--and throughout those jobs- I'm gonna offer a differing view point here.\n\nAs a cashier, we are instructed to give 'service with a smile' every second we're on the floor. It's part of the job description--making the customer feel welcomed, and eager to come back again. Small talk is a big part of this. And what are we going to talk about? The weather, sure, but its so much easier, and comes more naturally, to glance at a product, make a small comment on it, show interest, and bag it up. Do we remember your face, and what you're buying? No. Believe me, there are way too many customers before and after you for us to then see you in the street and go 'OH MY GOD, IT'S BABY FOOD GIRL'. In the nicest possible way, we don't care about you enough to remember. It's a low paying job, and we need to get it done, preferably with good marks, which brings me on to my next subject:\nHow easy it is to get us fired.\nOne complaint from a customer about you being grumpy or hostile could have you on a warning. A few customers making the same complaints could have you out the door. Easiest way to avoid that? Talking to the customers. Smiling. Showing interest as you serve them.\n\nTo put it simply: as the girl who lived on baby food for a good few months two years ago, I understand your embarrassment. I truly do. But as the cashier, please don't take us doing our job personally. A lot of us are underpaid, understaffed, and that small conversation is us doing our jobs, and also making connection with another human being for possibly the first time in a while.",
      "created_utc": 1610277702.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gir5ggl",
      "author": "None",
      "body": "Every grocery shopping day I thank god for self-serve checkouts. Sorry you had to go through that",
      "created_utc": 1610276554.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gircjqe",
      "author": "SyafaChapagetti",
      "body": "Isn't baby like crazy expensive",
      "created_utc": 1610283505.0,
      "score": 2,
      "context": []
    },
    {
      "id": "girfg0a",
      "author": "None",
      "body": "Just order online or use self checkout",
      "created_utc": 1610285909.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gitdnos",
      "author": "Flowy_Aerie_77",
      "body": "Normie here, I ate baby food because healthy and cheap. Yeah, there isn't anything much with it. The fact you have ANA wouldn't ever cross my head, if you told me you eat it. It sounds kind of funny to an outsider. I'd just think you'd be simply trying to be healthy. Nothing to be fussed about, really. Heck, she might even try it.",
      "created_utc": 1610322998.0,
      "score": 2,
      "context": []
    },
    {
      "id": "girr5pb",
      "author": "T_86",
      "body": "Your dad definitely didn’t need to embarrass you like that",
      "created_utc": 1610293704.0,
      "score": 1,
      "context": []
    },
    {
      "id": "giqhnmt",
      "author": "None",
      "body": "I also cashier sometimes at my job, and I will say things like “this is the best flavor!” or something like that, then bag it, but I wouldn’t say anything judgemental.",
      "created_utc": 1610255519.0,
      "score": 36,
      "context": [
        {
          "id": "giqgafi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1610254640.0
        }
      ]
    },
    {
      "id": "gisxg49",
      "author": "i_did_naht_hit_her_",
      "body": "Yes this! I manage a store and train my employees to only say super nice things about people’s purchases.",
      "created_utc": 1610315209.0,
      "score": 2,
      "context": [
        {
          "id": "giqgafi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1610254640.0
        }
      ]
    },
    {
      "id": "giq316e",
      "author": "waterfallsforstreams",
      "body": "it doesn’t explicitly say baby food on the package you have to really look at it to notice it’s baby food",
      "created_utc": 1610247149.0,
      "score": 29,
      "context": [
        {
          "id": "giq2j8t",
          "author": "ossaossaossa",
          "body": "I mean if you’re buying baby food in front of your dad I dunno how you expected him not to notice but that sucks to be called out like that",
          "created_utc": 1610246872.0
        }
      ]
    },
    {
      "id": "giqk3qg",
      "author": "None",
      "body": "Wait i agree. Is that a part of their training or something?? Its the only store where they ALWAYS comment",
      "created_utc": 1610257188.0,
      "score": 6,
      "context": [
        {
          "id": "giqgms9",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1610254858.0
        }
      ]
    },
    {
      "id": "giroxvw",
      "author": "stressbaked",
      "body": "Same! I just liked the crackers bc they melted in ur mouth but they make baby food so damn expensive sometimes :(",
      "created_utc": 1610292431.0,
      "score": 3,
      "context": [
        {
          "id": "giqorw7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1610260650.0
        }
      ]
    },
    {
      "id": "girfi8s",
      "author": "None",
      "body": "banana baby food is the best!!!",
      "created_utc": 1610285959.0,
      "score": 2,
      "context": [
        {
          "id": "giqorw7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1610260650.0
        }
      ]
    },
    {
      "id": "gitgdo1",
      "author": "waterfallsforstreams",
      "body": "thank u sm for this response. i guess my point of view was that everyone who sees someone who’s not a baby eating baby food thinks they’re anorexic.. that’s why i was kinda nervous of my dad realizing i got baby food. but u opened up my perspective and i feel better now",
      "created_utc": 1610324340.0,
      "score": 1,
      "context": [
        {
          "id": "gitdnos",
          "author": "Flowy_Aerie_77",
          "body": "Normie here, I ate baby food because healthy and cheap. Yeah, there isn't anything much with it. The fact you have ANA wouldn't ever cross my head, if you told me you eat it. It sounds kind of funny to an outsider. I'd just think you'd be simply trying to be healthy. Nothing to be fussed about, really. Heck, she might even try it.",
          "created_utc": 1610322998.0
        }
      ]
    },
    {
      "id": "lhbc6w1",
      "author": "Peazlenut",
      "body": "Yea wtf that was not cool",
      "created_utc": 1723227497.0,
      "score": 1,
      "context": [
        {
          "id": "girr5pb",
          "author": "T_86",
          "body": "Your dad definitely didn’t need to embarrass you like that",
          "created_utc": 1610293704.0
        }
      ]
    }
  ]
}