{
  "id": "kxrguw",
  "subreddit": "AnorexiaNervosa",
  "author": "Dry_Junket9686",
  "created_utc": 1610704338.0,
  "title": "I cant fucking do this anymore",
  "selftext": "I just cant i want to cry and tear my hair out, I go between not eating for days and binging my fucking guts out at 3 am. I just cant this is torture, i cant stop, i dont know what to do anymore, i can either starve myself or binge to death, there is no in between and nothing feels like its enough.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/kxrguw/i_cant_fucking_do_this_anymore/",
  "score": 136,
  "num_comments": 7,
  "comments": [
    {
      "id": "gjc635r",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1610714290.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gjcrmc3",
      "author": "Cherryberrybean",
      "body": "Please go watch Tabitha Farrar on YouTube. She suffered for years with anorexia, as have I. I am 44 years old now and only recovered after 25 years w anorexia due to this lady's guidelines.  Its the hardest damn thing I've done in my life. You are not alone, even if just the ppl on here are here for you only, we offer you hope.",
      "created_utc": 1610726498.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gjfbopm",
      "author": "None",
      "body": "I know to feeling.I can cry with you so you're not a lone 🥺❤️",
      "created_utc": 1610773895.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjvnfbe",
      "author": "elsie14",
      "body": "same.",
      "created_utc": 1611094209.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjc8d8h",
      "author": "Dry_Junket9686",
      "body": "thats y am so afraid of food, i alays end up binging",
      "created_utc": 1610716001.0,
      "score": 8,
      "context": [
        {
          "id": "gjc635r",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1610714290.0
        }
      ]
    },
    {
      "id": "gjc8bn9",
      "author": "Dry_Junket9686",
      "body": "if i start eating i cant stop so its literally like a 3 day fast or a 5k calorie binge",
      "created_utc": 1610715971.0,
      "score": 6,
      "context": [
        {
          "id": "gjc635r",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1610714290.0
        }
      ]
    },
    {
      "id": "gjc8th0",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1610716316.0,
      "score": -2,
      "context": [
        {
          "id": "gjc635r",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1610714290.0
        },
        {
          "id": "gjc8d8h",
          "author": "Dry_Junket9686",
          "body": "thats y am so afraid of food, i alays end up binging",
          "created_utc": 1610716001.0
        }
      ]
    },
    {
      "id": "gjdsabk",
      "author": "Adrenalize_me",
      "body": "No. I know you’re trying to help, but this advice only perpetuates the binge/restrict cycle. \n\nMost of us do some form of what you describe, getting rid of the binge food in one way or another, whether it’s throwing it out, eating it all in one go, giving it away, etc... when we’re getting ready to “get back on track.” \nAll this does is reinforce the idea that some foods are bad and that we’re “not allowed” to have them, which increases the likelihood that we’ll crave it later, and buy more when we’re at our lowest, thus continuing the harmful cycle.\n\nThe water trick can be helpful if it’s actually thirst we’re experiencing, but it’s also a commonly suggested appetite suppressant/distraction that goes around ED forums. Binge urges are more mental than physical, so the normal “tricks” to suppress appetite or try to treat potential thirst instead don’t work as well. Unfortunately, the only way to deal with binge eating is to break the binge and restrict cycle. You have to forgive yourself after a binge, NOT RESTRICT, and allow yourself to eat at the next meal time you have.\n\nI know this is so so hard, and it’s uncomfortable, but throwing away your trigger foods doesn’t solve anything, it just prolongs the cycle. We have to learn to exist in the same space as our trigger foods, and every instance of saying “I don’t want that right now” or “maybe I’ll have some later” or “I don’t need to eat the whole thing, it’ll still be here tomorrow” is a SUCCESS that you should be proud of!",
      "created_utc": 1610743502.0,
      "score": 4,
      "context": [
        {
          "id": "gjc635r",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1610714290.0
        },
        {
          "id": "gjc8d8h",
          "author": "Dry_Junket9686",
          "body": "thats y am so afraid of food, i alays end up binging",
          "created_utc": 1610716001.0
        },
        {
          "id": "gjc8th0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1610716316.0
        }
      ]
    }
  ]
}