{
  "id": "l49bw5",
  "subreddit": "AnorexiaNervosa",
  "author": "ELK0_",
  "created_utc": 1611527337.0,
  "title": "I'm recovering. Emphasis on the \"-ing\".",
  "selftext": "",
  "url": "https://i.redd.it/dedrvermwcd61.png",
  "score": 449,
  "num_comments": 9,
  "comments": [
    {
      "id": "gkouvmw",
      "author": "ragsandbones143",
      "body": "god, she told me this today morning. makes me sad because she says she believes in me and is proud of me:/",
      "created_utc": 1611565074.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gkoie7k",
      "author": "memesta_69",
      "body": "Yeh that’s not how anorexia works. \nKiddo! lol",
      "created_utc": 1611553983.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gkplyb3",
      "author": "zestylimevinaigrette",
      "body": "this JUST happened to me. and when i tried to explain that i’m still anorexic, she got mad at me lol.",
      "created_utc": 1611585973.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gkna7tg",
      "author": "chaska479",
      "body": "❤",
      "created_utc": 1611529897.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gkpasbn",
      "author": "None",
      "body": "It’s either ignorance, hope, or denial if you think she loves you and has your best interests at heart.\n\nMy weight has been all over the map in a certain range. The comments I’ve heard. Yes, they don’t get it. But I know who loves me and who doesn’t. That helps frame their comments.",
      "created_utc": 1611579419.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gkqs2pr",
      "author": "caretaker1971",
      "body": "I am a \"trying to recover\" anorexic and a mother of two teenagers.  MY mother was an abusive drug addict/BPD and I had some pretty horrible things said and done to me.  So I can see multiple angles here.  As a mother, I say a lot of stupid shit sometimes.  Sorry about that.  For me, it happens because I so desperately want to help my kid.  I want to be encouraging.  I'm always annoyingly pointing out a silver lining without realizing that I am glossing over the problem.  But I love my kids deeply and only want them to live their own truths and to find happiness while doing it.  Sometimes parental love gets all mixed up with the responsibilities of helping you become happy adults.  We fuck up.  Most of us can't admit it.  Some of us are just terrible parents.  But a few of us are trying in our own fucked up little way.  Maybe, just maybe, your mom is trying to be encouraging and helpful but she lacks the knowledge to do it in this case.  You can't really explain your ED to a non-ED person and have them get it.  Unfortunately, you don't understand it unless you have it.  In the same way, no one can understand what it's like to be a parent until they become one.  So just shake your head, roll your eyes, and know that your mom is trying because she loves you.  And if I am wrong, and she is just a bad parent, then love yourself the way you should have been loved by your mom.  You are worthy.",
      "created_utc": 1611604347.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gkpj0pp",
      "author": "empanada_de_queso",
      "body": "I believe having anorexia is sort of like being an alcoholic. You never truly finish recovering, you’re just in remission, and you have to be watchful your whole life so you don’t relapse.",
      "created_utc": 1611584485.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gkpprky",
      "author": "ELK0_",
      "body": "UPDATE: She just told that I've never known what it's like to be hungry (even when I was starving) or cold (even when I intentionally exposed myself to the elements all the time in winter as a form of SH).",
      "created_utc": 1611587811.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkqn6yn",
      "author": "rezadedude",
      "body": "my psychiatrist told me that...smh...",
      "created_utc": 1611602178.0,
      "score": 1,
      "context": []
    }
  ]
}