{
  "id": "l6znvs",
  "subreddit": "AnorexiaNervosa",
  "author": "han1929393",
  "created_utc": 1611847649.0,
  "title": "Food has to be perfect",
  "selftext": "I feel like my food has to taste perfect and if it doesn’t and it’s not what I truely crave  it’s the biggest deal \nDoes anyone else experience this",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/l6znvs/food_has_to_be_perfect/",
  "score": 178,
  "num_comments": 21,
  "comments": [
    {
      "id": "gl3sr2f",
      "author": "tinari07",
      "body": "Yes I've been in a pretty solid recovery for 1 year now and I still feel like I wasted calories if i have to eat something I don't want or like",
      "created_utc": 1611848849.0,
      "score": 41,
      "context": []
    },
    {
      "id": "gl3tjo7",
      "author": "Psychonaught420_69",
      "body": "I’m not sure if it’s the same thing but for me It’s like if it doesn’t feel fulfilling to my expectations I want nothing to do with it. Like I want it until the first bite.",
      "created_utc": 1611849101.0,
      "score": 33,
      "context": []
    },
    {
      "id": "gl3u3pr",
      "author": "alwaysstressed105",
      "body": "yes yes yes 100% relate!! i get so upset when it's not what i wanted that i tend to just breakdown",
      "created_utc": 1611849282.0,
      "score": 19,
      "context": []
    },
    {
      "id": "gl41f5m",
      "author": "artysharky",
      "body": "I get so upset when food doesn’t taste just right",
      "created_utc": 1611851585.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gl4449c",
      "author": "None",
      "body": "Feels like I waste my calories when it wasn't perfect.",
      "created_utc": 1611852376.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gl44pih",
      "author": "None",
      "body": "yup, i just feel like it’s not deserving of being consumed.",
      "created_utc": 1611852563.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gl45yi2",
      "author": "wornwhole",
      "body": "Absolutely. Also to eat it in the right setting. Alone, no weird smell in the room, same place",
      "created_utc": 1611852954.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gl4mq5d",
      "author": "sarathedime",
      "body": "If it’s disappointing *at all* I have a panic attack because the calories weren’t worth it",
      "created_utc": 1611859518.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gl45tew",
      "author": "BoozeyTurtlez",
      "body": "Yesss 100% relate",
      "created_utc": 1611852910.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gl4xrcv",
      "author": "denahom-chikn",
      "body": "i thought i was the only one. it’s rarely perfect or satisfying either and when it’s not it feels like the calories just weren’t worth it",
      "created_utc": 1611863602.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gl5shnu",
      "author": "None",
      "body": "This is really common if youre restricting food because being underfueled makes it feel like every bite is so important and can't be disappointing. When you're eating enough, there's less worry about it being \"perfect\" because there are more opportunities in the day for food to be enjoyed, e.g., if it's disappointing at one meal or snack it's no big deal because there will be other chances",
      "created_utc": 1611875011.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gl677l1",
      "author": "None",
      "body": "Literally ruins my day when something doesnt taste as good as I wanted/expected it to. For example, I got really excited to see some cherry scones reduced at a supermarket the other day but upon eating one realised it had next to no cherries in it. It was not \"bad\" it just was not perfect/what I wanted it and expected it to be. I also compared it to other cherry scones I last had years ago and recall being much better/more enjoyable. I was honestly so upset and felt like I'd wasted calories which I could have spent on something I would have enjoyed much more. Literally felt to cry haha. ERGH ED LIFE IS HARD LADS.",
      "created_utc": 1611881411.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gl5gl2o",
      "author": "MoosieGoose",
      "body": "Yeah, was starving today, took one bite of something & threw it in the trash.\n\nMakes me feel like a real loser, you know?",
      "created_utc": 1611870320.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gl60b67",
      "author": "fishsoap69",
      "body": "Yes whatever I cook has to be and look perfect otherwise I cry",
      "created_utc": 1611878364.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gl5oozo",
      "author": "kianathebutt",
      "body": "oh god I've always been this way...",
      "created_utc": 1611873424.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gl61gcj",
      "author": "brookleiaway",
      "body": "in the beginning of my ed i was still refusing to say i had one cause i felt like i wasnt bad enough , then i cried in the car an had a panic attack cause my cheat day ice cream didnt taste good and my mom tried to force me to eat it anyway",
      "created_utc": 1611878860.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gl639k9",
      "author": "None",
      "body": "yes I do for sure",
      "created_utc": 1611879654.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gl70hmw",
      "author": "irlbrat",
      "body": "Yess it feels like a waste of calories to me. Probably one of the biggest obstacles I’m still trying to overcome in my recovery.",
      "created_utc": 1611894719.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gl88q4p",
      "author": "ghostofarenegade",
      "body": "Yes omg!!! If I'm taking in calories it has to be worth those calories otherwise I'll just not eat.",
      "created_utc": 1611924290.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gl8d1y2",
      "author": "rats420666",
      "body": "I've always been a picky eater who can only eat overcooked food (white fries are the worst!) and the ketchup is often in a separate container. I don't want it mixing in with sides like salad or baked beans.",
      "created_utc": 1611926703.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glbsoby",
      "author": "Look_better_in_black",
      "body": "Yes! I thought it was just me. Sometimes, I’ll be within my desired calorie count, but my food will taste wrong and it throws of the entire day for me. Sometimes it makes me want to eat more and that’s all I can think about. And I feel super bad.",
      "created_utc": 1611976051.0,
      "score": 1,
      "context": []
    }
  ]
}