{
  "id": "lf8iaa",
  "subreddit": "AnorexiaNervosa",
  "author": "tasha53505",
  "created_utc": 1612777533.0,
  "title": "What to do when struggling?",
  "selftext": "My mind is like “EAT”\nThen it’s like “DONT”\nThen “imagine this nice burger”\nThen “you’ll gain x from this”\n\nAnyone else ? Any strategies ?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/lf8iaa/what_to_do_when_struggling/",
  "score": 112,
  "num_comments": 6,
  "comments": [
    {
      "id": "gmkyrgh",
      "author": "rainundercloud",
      "body": "I try to think about the benefits. Not just nutritional benefits, the satisfaction as well. \n\nFor example if its a food that is full of nutritions then i tell myself that “this will help me gain muscle so i may look fit” or “the vitamins and minerals in it will make me healthy”. \n\nEven if that food is something so sugary or high in carb i motivate myself saying i will exercise and turn that carbs into fuel of my body for that exercise, not fat. \n\nOr if im not planning to exercise then i just think about my satisfaction. Like i say “i want to eat that food rn, if i force myself not to, i will crave it later and may binge on that”. And to prevent it i eat it controllably in the first place. \n\nI hope i made myself clear and it helps. I also had a hard time to adjust that habits but try your best. Good luck",
      "created_utc": 1612793395.0,
      "score": 28,
      "context": []
    },
    {
      "id": "gmkk3aq",
      "author": "Successful_Watch_544",
      "body": "This happens to me all the time honestly happening right now ahahha! But I just try find a healthy thing to eat to try take my mind off it or I try distract myself or go to sleep but honestly your body deserves it! If you want to eat soemthing then do",
      "created_utc": 1612782686.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gmlwoe6",
      "author": "Unique_State_1520",
      "body": "I always like to remind myself that food are made for enjoyment and are not cause pain. Our body needs a balance of everything to function and our body knows when is too much and when isn’t it. Remind yourself that food is not your enemy but the voices in your head. So far with my ED I’ve always tried to go against it when it talks to me about what I can and cannot eat and it’s helped me a lot because I start to realise that even though the voice gets louder I am one step closer to recovery! Don’t satisfy the voice and don’t tell if you will exercise it off because then like me you’ll believe you don’t deserve to eat because you haven’t exercised when YOU WILL ALWAYS DESERVE TO IT!",
      "created_utc": 1612809276.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gmltcrj",
      "author": "christinamatteson",
      "body": "Same, my brain wants all the unhealthy. I just try swapping out the burger for maybe shrimp or boiled chicken breast. It usually fills the nutrients my brain is craving while not giving me full blown anxiety.",
      "created_utc": 1612807810.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmmnpo0",
      "author": "chicadoro16",
      "body": "I'm a pretty keen student and horse rider so I do \"brain needs fat and sugar\" and I don't let myself ride unless I've eaten something - even if its only a bit of porridge.",
      "created_utc": 1612821445.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gml1736",
      "author": "meilz0nwhe3lz",
      "body": "Arrh this is such a seemingly obvious thing to think when you’re eating especially in recovery but thank you this is super helpful I’ve been really trying to figure out how to actually believe that you need food instead of just sort of knowing it because I’ve been told I think this is a really good way of drilling it so thanks 🙏",
      "created_utc": 1612794741.0,
      "score": 10,
      "context": [
        {
          "id": "gmkyrgh",
          "author": "rainundercloud",
          "body": "I try to think about the benefits. Not just nutritional benefits, the satisfaction as well. \n\nFor example if its a food that is full of nutritions then i tell myself that “this will help me gain muscle so i may look fit” or “the vitamins and minerals in it will make me healthy”. \n\nEven if that food is something so sugary or high in carb i motivate myself saying i will exercise and turn that carbs into fuel of my body for that exercise, not fat. \n\nOr if im not planning to exercise then i just think about my satisfaction. Like i say “i want to eat that food rn, if i force myself not to, i will crave it later and may binge on that”. And to prevent it i eat it controllably in the first place. \n\nI hope i made myself clear and it helps. I also had a hard time to adjust that habits but try your best. Good luck",
          "created_utc": 1612793395.0
        }
      ]
    }
  ]
}