{
  "id": "lfksk3",
  "subreddit": "AnorexiaNervosa",
  "author": "ayyojosh",
  "created_utc": 1612815605.0,
  "title": "i’m in that “obsessively comparing myself to influencers” phase again so here’s a reminder that a lot of it is bs ❤️ take care",
  "selftext": "",
  "url": "https://www.reddit.com/gallery/lfa74q",
  "score": 142,
  "num_comments": 9,
  "comments": [
    {
      "id": "gmmrvuv",
      "author": "hummusenthusiasts",
      "body": "You can have a waist that small! You just have to sacrifice your boobs and health and ability to function on the way 😈 influencers also contort themselves into weird poses that only look good from one angle",
      "created_utc": 1612823380.0,
      "score": 38,
      "context": []
    },
    {
      "id": "gmmw7vp",
      "author": "bubbles2360",
      "body": "As someone that is highly involved in the fitness industry, I second this! All those girls you see on insta doing those booty poses that make them look “slim thicc” or “toned” are sucking in their stomach to the point of almost snapping a rib, are popping their hip out ssooo much and using wild camera angles that really highlight the shape of their body that they’re wanting to be shown in a better way. It’s crazy cuz I’ve done it myself just to prove that I can look both like them when I pose and also like my actual real, relaxed self a couple seconds later because reality is nothing similar to posing. It’s why it’s called posing to begin with\n\nSo if you ever compare yourself to a “fit chick” on social media, as harsh as this sounds, remember that it’s all just an illusion to make you think they’re better looking than they really are in terms of meeting the unattainable beauty standards we have today",
      "created_utc": 1612825479.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gmmshhi",
      "author": "MoosieGoose",
      "body": "A lot of it is purposeful posing, 100s of pictures, perfect lighting, etc.\n\nA friend of mine is somewhat of an influencer, and while she is a truly stunning human, she's not 100% perfect like her photos say she is. It's fake, it's work, it's not something to compete with.",
      "created_utc": 1612823662.0,
      "score": 19,
      "context": []
    },
    {
      "id": "gmnmr2o",
      "author": "Syvaere",
      "body": "“What do you do to keep your waist so small” \n\nShe lies, and then she propagates that lie for internet clout. \n\nThis upsets me, but at the same time, I don’t know if we should be super mad at this individual. Even though they participated in it, the fact that there’s a culture and a physical standard that pushes her to do this is the wider problem. She literally made herself into an anime character, the proportions don’t make sense.",
      "created_utc": 1612839155.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gmovkrg",
      "author": "momowizard",
      "body": "I struggle with this too. Sometimes it’s nice to take a social media break and focus on the more important things in life. Could you imagine if we did something productive instead of all the hours we waste looking at our phone!? Easier said than done, I know. But it’s impressive the relationships you can make or the tasks you can accomplish.",
      "created_utc": 1612873695.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmoef0r",
      "author": "None",
      "body": "I never found influencers people I compared myself to as they’re so thick in my eyes usually. Aside from Arielle charnas there are 0 influencers whose bodies I’m jealous of... this tiny waist huge boobs thick thighs look is not at all attractive to me nor is it skinny. Lol. Tbh",
      "created_utc": 1612857797.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gmnurwb",
      "author": "rezadedude",
      "body": "u were more then nice lol",
      "created_utc": 1612843514.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gmp54cx",
      "author": "cakewalkofshame",
      "body": "Man I thought the Tumblr thinspo circa 2011 was bad...I mean...it was, but this stuff is worse? I feel bad for anyone who's like 10-20 nowadays with Tiktok.",
      "created_utc": 1612879749.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gmok1mw",
      "author": "lacroixlite",
      "body": "Not harsh enough tbr. Thank you for this comment!",
      "created_utc": 1612863168.0,
      "score": 1,
      "context": [
        {
          "id": "gmmw7vp",
          "author": "bubbles2360",
          "body": "As someone that is highly involved in the fitness industry, I second this! All those girls you see on insta doing those booty poses that make them look “slim thicc” or “toned” are sucking in their stomach to the point of almost snapping a rib, are popping their hip out ssooo much and using wild camera angles that really highlight the shape of their body that they’re wanting to be shown in a better way. It’s crazy cuz I’ve done it myself just to prove that I can look both like them when I pose and also like my actual real, relaxed self a couple seconds later because reality is nothing similar to posing. It’s why it’s called posing to begin with\n\nSo if you ever compare yourself to a “fit chick” on social media, as harsh as this sounds, remember that it’s all just an illusion to make you think they’re better looking than they really are in terms of meeting the unattainable beauty standards we have today",
          "created_utc": 1612825479.0
        }
      ]
    }
  ]
}