{
  "id": "lg6hft",
  "subreddit": "AnorexiaNervosa",
  "author": "orange_peel2",
  "created_utc": 1612886632.0,
  "title": "does anyone else have “safe clothing”",
  "selftext": "so i have specific clothes i always feel safe in but then i have other clothes that i cannot wear bc they make me feel so fat. like i cannot wear sweatpants with an elastic waist band bc it touches me. and i cannot wear hoodies bc they are weird at the top so they make me feel fat since they touch me in a way i don’t like. i wear the biggest clothes ever. all my jeans are 3 sizes too big and same with shirts. i don’t like when anything is form fitting or touching me. it’s very annoying because i guess i have the body i’ve always wanted but can never “show it off” bc i hate myself more than i did before i lost the weight. it sort of sucks knowing i’ll never feel pretty or skinny enough since that’s how the disorder is :(",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/lg6hft/does_anyone_else_have_safe_clothing/",
  "score": 192,
  "num_comments": 46,
  "comments": [
    {
      "id": "gmpkhof",
      "author": "slug_lady",
      "body": "i am the same. i only feel “safe” in elastic waists when they are loose on me. even if they fit just fine, my brain perceives it as a sausage casing and it is just the worse. oddly, though, i wear leggings just fine? but what goes over them needs to be baggy as all heck.",
      "created_utc": 1612887040.0,
      "score": 30,
      "context": []
    },
    {
      "id": "gmpw2t0",
      "author": "danielleiskindagay",
      "body": "i only feel safe in one pair of sweatpants (usually paired with a crop top.) or really tight high waisted shorts with a large hoodie- my safe clothing isn’t typical i know :/",
      "created_utc": 1612891982.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gmq6kb9",
      "author": "BoozeyTurtlez",
      "body": "Yep, baggy clothes, but only specific baggy clothes",
      "created_utc": 1612896433.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gmq18yl",
      "author": "my-ed-alt",
      "body": "my \"safe\" clothing is warm knee high socks and legging under bell bottom jeans (the cut of those jeans make my thighs look smaller and they're super high waisted to cover the tum), a black long sleeve crop top, and a wooly cardigan so that the crop top is still covered lol. it's a very specific outfit but i like it cuz i can cover my insecurities without looking like i'm trying to cover my insecurities",
      "created_utc": 1612894169.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gmq2ofi",
      "author": "metempsychosis99",
      "body": "Yes. I can't wear jeans because I'm afraid of seeing my legs. It has to be either baggy sweatpants or large pants. I can't wear sleeveless shirts and tight-fitting clothing in general. Everything has to be oversized without looking too bulky. Ugh, so pretentious:))",
      "created_utc": 1612894782.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gmqkw93",
      "author": "unknown9435",
      "body": "We’re on lockdown, and my ED has just recently started creeping up on me, so I have no idea how I’ll react when it’s time to go outside. Currently ranging from oversized sweatpants and hoodies (so big that like 3 of me could fit in them) to tight sports bras and high waisted leggings while working out at home. I haven’t left the house in weeks, so I don’t really know how it’s gonna be when I go back to in person classes and regular contact with my friends, but I’m honestly just dreading it. Sometimes I’m really excited about myself, and anticipating what my body will look like in 2 months, other times I feel so hideous that I wanna crawl under the blankets and just disappear.\nKinda off topic, but I just had to get it out my chest. Stay safe everyone ;)",
      "created_utc": 1612902513.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gmqscp9",
      "author": "Aspenisbi",
      "body": "employ marry amusing trees rock punch spectacular humorous smell unwritten\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1612905685.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gmpjsbe",
      "author": "floofyragdollcat",
      "body": "Same.",
      "created_utc": 1612886728.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gmq61ji",
      "author": "OWENISAGANGSTER",
      "body": "I don’t think I’ve worn anything besides Adidas pants/sweatpants in well over a year",
      "created_utc": 1612896211.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gmq6yqd",
      "author": "ayalalaaa",
      "body": "Every pair of pants I have has to be high waisted and oversized to cover my stomach and I only wear baggy men's sweaters. I have all these pretty and fashionable things I rarely wear because I look bigger to myself and it sucks so much. I want to feel skinny and pretty, too but when I try to I remember all the mean things people said about my body in the past. I've always been underweight but people still find things to pick at....",
      "created_utc": 1612896603.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gmqb2bc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1612898345.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gmq9v9x",
      "author": "Murmelflummi",
      "body": "Yessss i wear mens' sweaters in XL only. My actual size is XS or S womens' wear but i only wear this oversized stuff which makes my body look really weird because the sweaters are so long that it looks like i had really short legs bit this is the only stuff i'm comfy with. I have one top though that is really tight but i like to wear that one too.\nI have this struggle having tons of clothes but not beeing able to wear half of them",
      "created_utc": 1612897835.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmqih6g",
      "author": "Critical_Party_4240",
      "body": "Mine is to always have to hide my thighs somehow. Either by wearing a long sweater that goes at least to mid-thigh, or really baggy sweatpants. I have so many nice tops or sweaters that I will not wear out because they aren’t long enough to cover my thighs.",
      "created_utc": 1612901489.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmqs6qe",
      "author": "Paper182186902",
      "body": "Hoodie and gym leggings are my go-to. Just the way the fabric hugs my legs makes me feel really skinny for some reason, even though skinny jeans make me feel fat.",
      "created_utc": 1612905612.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmqteum",
      "author": "None",
      "body": "For me, I tie my sweatpants a little on the right side. I never untie them. They get washed tied and everything. If they aren’t looser in due time I start to get anxious",
      "created_utc": 1612906131.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmrbldu",
      "author": "piximiqote",
      "body": "Tbh leggings and a huge jumper / hoodie is my default safe clothing no matter my size. Especially if the leggings are patterned to “distract from my legs”. Right now I’m having intense horrific abdominal issues (a big hernia, extreme swelling) and I just about want to never see the light of day again and having a doctor touch my abdomen and hips made me want to die. Urgh sorry went off topic.",
      "created_utc": 1612914793.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmrer9y",
      "author": "mads_grxce",
      "body": "My safe clothing is baggy clothes so that no one can judge my body shape :)",
      "created_utc": 1612916388.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmrs3i7",
      "author": "Phantasmortuary",
      "body": "Oh man, i know what you mean. Sorry you find such frustration in your wardrobe. Personally, I don't think I've worn \"real pants\" since 2019... It seems like some clothes are just never fit-to-wear, despite the weight. :/",
      "created_utc": 1612923369.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmrysch",
      "author": "Ok-Glass826",
      "body": "black turtleneck works everytime yikes",
      "created_utc": 1612926880.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gms72ow",
      "author": "ScrubDaddy5",
      "body": "I really want to wear different clothes, my friends keep sending me gay fits that I’d love to try on, but I just can’t fit them in with all of my boring but safe outfits",
      "created_utc": 1612931484.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gms7cb3",
      "author": "SERDYART",
      "body": "Yes, anything that squeezes my skin and makes a “roll”. I need it to be smooth or I feel puffy",
      "created_utc": 1612931641.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmuey2e",
      "author": "Kaylathedragonx",
      "body": "I have a favourite hoodie it’s the only thing I feel comfortable going out in",
      "created_utc": 1612981700.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmuguy0",
      "author": "Psychonaught420_69",
      "body": "I only feel comfortable in t shirts that are 3x... In high school I was flat chested until senior year when I can back after summer break with DDD and everyone sexualized me and harassed me so I hid in clothes. They got to 34G in 2017 when I got a reduction and now I’m a 32DD even though this horrible ED has taken everything else from me... I still can’t get rid of these damn tits. My boyfriend he’s been trying to get me to wear more fitted girly things but they make me so uncomfortable and insecure 😞 I want to be free of this",
      "created_utc": 1612982478.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmw7c6s",
      "author": "nad4444",
      "body": "I found it helpful to wear baggy sweatpants and roll the waste band down to below your hips. This feels like a less triggering place for it to touch and accommodates the bloooaaatting. But just remember that as soon as you recover you can break free of worrying about this. It is so freeing to live your life without ED rules. Stay strong.",
      "created_utc": 1613011140.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gnm0dr0",
      "author": "inukedmyself",
      "body": "i own so many clothes but only wear such a small selection because i feel huge in the rest ://",
      "created_utc": 1613448298.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gmqijvu",
      "author": "WideAtmosphere",
      "body": "I'm EXTREMELY sensitive to how waistbands touch me. I will wear tight dresses all day long, but they can't press on my waist/abdomen. If they are form fitting all over (and I'm not IBS-bloated) I'm fine. If any waistband is anything other than loose.....it makes my flesh absolutely CRAWL. How things touch my skin/textures, and where they put pressure on my body is extremely important. Leggings have to have the really wide bands at the top. Thin elastic that squeezes is unacceptable. Denim jeans? No. Not ever.",
      "created_utc": 1612901522.0,
      "score": 14,
      "context": [
        {
          "id": "gmpkhof",
          "author": "slug_lady",
          "body": "i am the same. i only feel “safe” in elastic waists when they are loose on me. even if they fit just fine, my brain perceives it as a sausage casing and it is just the worse. oddly, though, i wear leggings just fine? but what goes over them needs to be baggy as all heck.",
          "created_utc": 1612887040.0
        }
      ]
    },
    {
      "id": "gmpq1uo",
      "author": "orange_peel2",
      "body": "exactly! i need my elastic wait sweatpants/pj pants to be big on me and if they aren’t i feel awful. i’ve even cried over this and changed my clothes over this. i also recently put on leggings and didn’t feel terrible in them so that’s strange. interesting how i’m not alone in this",
      "created_utc": 1612889415.0,
      "score": 6,
      "context": [
        {
          "id": "gmpkhof",
          "author": "slug_lady",
          "body": "i am the same. i only feel “safe” in elastic waists when they are loose on me. even if they fit just fine, my brain perceives it as a sausage casing and it is just the worse. oddly, though, i wear leggings just fine? but what goes over them needs to be baggy as all heck.",
          "created_utc": 1612887040.0
        }
      ]
    },
    {
      "id": "gmq0pjg",
      "author": "orange_peel2",
      "body": "yeah everyone’s different!! doesn’t make you any less valid or anything! i was just curious if anyone else did the same thing or if this was something i made up lol. it’s cool to hear other people’s experiences and what they are comfy and uncomfy with :))",
      "created_utc": 1612893935.0,
      "score": 3,
      "context": [
        {
          "id": "gmpw2t0",
          "author": "danielleiskindagay",
          "body": "i only feel safe in one pair of sweatpants (usually paired with a crop top.) or really tight high waisted shorts with a large hoodie- my safe clothing isn’t typical i know :/",
          "created_utc": 1612891982.0
        }
      ]
    },
    {
      "id": "gmqevgi",
      "author": "isglitteracolor",
      "body": "I’m wearing the biggest pair of men’s sweatpants I could find and a crop top rn and I feel a little called out",
      "created_utc": 1612899962.0,
      "score": 2,
      "context": [
        {
          "id": "gmpw2t0",
          "author": "danielleiskindagay",
          "body": "i only feel safe in one pair of sweatpants (usually paired with a crop top.) or really tight high waisted shorts with a large hoodie- my safe clothing isn’t typical i know :/",
          "created_utc": 1612891982.0
        }
      ]
    },
    {
      "id": "gmqccig",
      "author": "orange_peel2",
      "body": "yeah exactly i have baggy clothes that i cannot wear bc they touch me in some weird way or make me feel fat",
      "created_utc": 1612898888.0,
      "score": 2,
      "context": [
        {
          "id": "gmq6kb9",
          "author": "BoozeyTurtlez",
          "body": "Yep, baggy clothes, but only specific baggy clothes",
          "created_utc": 1612896433.0
        }
      ]
    },
    {
      "id": "gmq2wo5",
      "author": "orange_peel2",
      "body": "oo i like it!! i don’t have any cute safe clothes the only ones i have are jeans that are too big with a crop top and then a hoodie or cardigan, so kind of similar! thanks for replying i love hearing all the options!!",
      "created_utc": 1612894879.0,
      "score": 3,
      "context": [
        {
          "id": "gmq18yl",
          "author": "my-ed-alt",
          "body": "my \"safe\" clothing is warm knee high socks and legging under bell bottom jeans (the cut of those jeans make my thighs look smaller and they're super high waisted to cover the tum), a black long sleeve crop top, and a wooly cardigan so that the crop top is still covered lol. it's a very specific outfit but i like it cuz i can cover my insecurities without looking like i'm trying to cover my insecurities",
          "created_utc": 1612894169.0
        }
      ]
    },
    {
      "id": "gmqc9w1",
      "author": "orange_peel2",
      "body": "yes it’s so annoying wearing big clothes because i feel like people think i look bigger than i am and i feel like i look so large but i’m SO much more comfortable in bigger clothes",
      "created_utc": 1612898857.0,
      "score": 2,
      "context": [
        {
          "id": "gmq2ofi",
          "author": "metempsychosis99",
          "body": "Yes. I can't wear jeans because I'm afraid of seeing my legs. It has to be either baggy sweatpants or large pants. I can't wear sleeveless shirts and tight-fitting clothing in general. Everything has to be oversized without looking too bulky. Ugh, so pretentious:))",
          "created_utc": 1612894782.0
        }
      ]
    },
    {
      "id": "gmrdmdc",
      "author": "orange_peel2",
      "body": "yes! baggy clothes all the way. and you can go off topic and get anything off your chest! this is a safe place <3",
      "created_utc": 1612915809.0,
      "score": 3,
      "context": [
        {
          "id": "gmqkw93",
          "author": "unknown9435",
          "body": "We’re on lockdown, and my ED has just recently started creeping up on me, so I have no idea how I’ll react when it’s time to go outside. Currently ranging from oversized sweatpants and hoodies (so big that like 3 of me could fit in them) to tight sports bras and high waisted leggings while working out at home. I haven’t left the house in weeks, so I don’t really know how it’s gonna be when I go back to in person classes and regular contact with my friends, but I’m honestly just dreading it. Sometimes I’m really excited about myself, and anticipating what my body will look like in 2 months, other times I feel so hideous that I wanna crawl under the blankets and just disappear.\nKinda off topic, but I just had to get it out my chest. Stay safe everyone ;)",
          "created_utc": 1612902513.0
        }
      ]
    },
    {
      "id": "gmrdhrp",
      "author": "orange_peel2",
      "body": "oh that’s really interesting!! i wonder how mine will change when i start to recover!!",
      "created_utc": 1612915744.0,
      "score": 1,
      "context": [
        {
          "id": "gmqscp9",
          "author": "Aspenisbi",
          "body": "employ marry amusing trees rock punch spectacular humorous smell unwritten\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1612905685.0
        }
      ]
    },
    {
      "id": "gmqd3qc",
      "author": "orange_peel2",
      "body": "i’m sorry :(( i really feel you on the fashionable things you wish you could wear i have so many clothes from christmas with the tags on them and i just cannot bring myself to put them on since i feel so large in them. and it’s really crazy how i went into this thinking oh well i’ll get skinny and be able to wear all my cute clothes!!! and tbh i was even wearing cute clothes before this got really bad i just thought that i could make myself look “better” by not eating and here we are feeling so much worse than before and not even wearing the cute clothes i intended on wearing",
      "created_utc": 1612899211.0,
      "score": 2,
      "context": [
        {
          "id": "gmq6yqd",
          "author": "ayalalaaa",
          "body": "Every pair of pants I have has to be high waisted and oversized to cover my stomach and I only wear baggy men's sweaters. I have all these pretty and fashionable things I rarely wear because I look bigger to myself and it sucks so much. I want to feel skinny and pretty, too but when I try to I remember all the mean things people said about my body in the past. I've always been underweight but people still find things to pick at....",
          "created_utc": 1612896603.0
        }
      ]
    },
    {
      "id": "gmqc0ho",
      "author": "orange_peel2",
      "body": "i totally agree!! i’m so happy i’m not alone in this i thought i made this up or something!",
      "created_utc": 1612898746.0,
      "score": 2,
      "context": [
        {
          "id": "gmqb2bc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1612898345.0
        }
      ]
    },
    {
      "id": "gmqcovb",
      "author": "orange_peel2",
      "body": "yeah it’s so annoying, i have so many clothes that i used to wear and love but now i can’t even think about putting them on :(. i also am around a women’s small and i hate when people buy me clothes in that size because i know i won’t wear them",
      "created_utc": 1612899036.0,
      "score": 2,
      "context": [
        {
          "id": "gmq9v9x",
          "author": "Murmelflummi",
          "body": "Yessss i wear mens' sweaters in XL only. My actual size is XS or S womens' wear but i only wear this oversized stuff which makes my body look really weird because the sweaters are so long that it looks like i had really short legs bit this is the only stuff i'm comfy with. I have one top though that is really tight but i like to wear that one too.\nI have this struggle having tons of clothes but not beeing able to wear half of them",
          "created_utc": 1612897835.0
        }
      ]
    },
    {
      "id": "gmrdp7o",
      "author": "orange_peel2",
      "body": "yes skinny jeans are a big no for me! i will only do mom or straight jeans",
      "created_utc": 1612915848.0,
      "score": 1,
      "context": [
        {
          "id": "gmqs6qe",
          "author": "Paper182186902",
          "body": "Hoodie and gym leggings are my go-to. Just the way the fabric hugs my legs makes me feel really skinny for some reason, even though skinny jeans make me feel fat.",
          "created_utc": 1612905612.0
        }
      ]
    },
    {
      "id": "gmrdyzs",
      "author": "orange_peel2",
      "body": "i wish i liked hoodies i can only do crew necks because i don’t like the way the triangle at the top feels lol. and you can go off topic!! no worries feels good to get stuff off your chest",
      "created_utc": 1612915986.0,
      "score": 1,
      "context": [
        {
          "id": "gmrbldu",
          "author": "piximiqote",
          "body": "Tbh leggings and a huge jumper / hoodie is my default safe clothing no matter my size. Especially if the leggings are patterned to “distract from my legs”. Right now I’m having intense horrific abdominal issues (a big hernia, extreme swelling) and I just about want to never see the light of day again and having a doctor touch my abdomen and hips made me want to die. Urgh sorry went off topic.",
          "created_utc": 1612914793.0
        }
      ]
    },
    {
      "id": "gmwbt7z",
      "author": "orange_peel2",
      "body": "thank you so much! i actually just started doing the waistband below my hips yesterday bc i got the idea and it worked! i just hate the feeling on my stomach. i cannot wait till one day i don’t constantly think about this or food! <3",
      "created_utc": 1613013414.0,
      "score": 1,
      "context": [
        {
          "id": "gmw7c6s",
          "author": "nad4444",
          "body": "I found it helpful to wear baggy sweatpants and roll the waste band down to below your hips. This feels like a less triggering place for it to touch and accommodates the bloooaaatting. But just remember that as soon as you recover you can break free of worrying about this. It is so freeing to live your life without ED rules. Stay strong.",
          "created_utc": 1613011140.0
        }
      ]
    },
    {
      "id": "gmqj8bj",
      "author": "orange_peel2",
      "body": "yes!! ive cried so many times and have literally ripped things off my body in a panic because of how they touch me. it’s awful. it’s so insane that like you would think with this disorder from an outsiders view we would love to show off our body, but it’s the complete opposite i cannot wear anything unless i deem it safe",
      "created_utc": 1612901807.0,
      "score": 7,
      "context": [
        {
          "id": "gmpkhof",
          "author": "slug_lady",
          "body": "i am the same. i only feel “safe” in elastic waists when they are loose on me. even if they fit just fine, my brain perceives it as a sausage casing and it is just the worse. oddly, though, i wear leggings just fine? but what goes over them needs to be baggy as all heck.",
          "created_utc": 1612887040.0
        },
        {
          "id": "gmqijvu",
          "author": "WideAtmosphere",
          "body": "I'm EXTREMELY sensitive to how waistbands touch me. I will wear tight dresses all day long, but they can't press on my waist/abdomen. If they are form fitting all over (and I'm not IBS-bloated) I'm fine. If any waistband is anything other than loose.....it makes my flesh absolutely CRAWL. How things touch my skin/textures, and where they put pressure on my body is extremely important. Leggings have to have the really wide bands at the top. Thin elastic that squeezes is unacceptable. Denim jeans? No. Not ever.",
          "created_utc": 1612901522.0
        }
      ]
    },
    {
      "id": "gmqk4ol",
      "author": "slug_lady",
      "body": "yes, exactly! i only wear one brand of leggings consistently and even then, sometimes some batches are just... off. any other leggings must either be slightly too large or very high waisted and wide banded. same goes for underwears. jeans are the devil’s work.",
      "created_utc": 1612902186.0,
      "score": 6,
      "context": [
        {
          "id": "gmpkhof",
          "author": "slug_lady",
          "body": "i am the same. i only feel “safe” in elastic waists when they are loose on me. even if they fit just fine, my brain perceives it as a sausage casing and it is just the worse. oddly, though, i wear leggings just fine? but what goes over them needs to be baggy as all heck.",
          "created_utc": 1612887040.0
        },
        {
          "id": "gmqijvu",
          "author": "WideAtmosphere",
          "body": "I'm EXTREMELY sensitive to how waistbands touch me. I will wear tight dresses all day long, but they can't press on my waist/abdomen. If they are form fitting all over (and I'm not IBS-bloated) I'm fine. If any waistband is anything other than loose.....it makes my flesh absolutely CRAWL. How things touch my skin/textures, and where they put pressure on my body is extremely important. Leggings have to have the really wide bands at the top. Thin elastic that squeezes is unacceptable. Denim jeans? No. Not ever.",
          "created_utc": 1612901522.0
        }
      ]
    },
    {
      "id": "gmq9uqb",
      "author": "XeneVyvyan",
      "body": "omg i could never with leggings, no wayyy, there's wayyy too much jiggle in my thighs, and calves too, somehow :((",
      "created_utc": 1612897828.0,
      "score": 5,
      "context": [
        {
          "id": "gmpkhof",
          "author": "slug_lady",
          "body": "i am the same. i only feel “safe” in elastic waists when they are loose on me. even if they fit just fine, my brain perceives it as a sausage casing and it is just the worse. oddly, though, i wear leggings just fine? but what goes over them needs to be baggy as all heck.",
          "created_utc": 1612887040.0
        },
        {
          "id": "gmpq1uo",
          "author": "orange_peel2",
          "body": "exactly! i need my elastic wait sweatpants/pj pants to be big on me and if they aren’t i feel awful. i’ve even cried over this and changed my clothes over this. i also recently put on leggings and didn’t feel terrible in them so that’s strange. interesting how i’m not alone in this",
          "created_utc": 1612889415.0
        }
      ]
    },
    {
      "id": "gmqf0kp",
      "author": "danielleiskindagay",
      "body": "no joke same.. that’s what inspired my comment. crop tops for the win!",
      "created_utc": 1612900022.0,
      "score": 2,
      "context": [
        {
          "id": "gmpw2t0",
          "author": "danielleiskindagay",
          "body": "i only feel safe in one pair of sweatpants (usually paired with a crop top.) or really tight high waisted shorts with a large hoodie- my safe clothing isn’t typical i know :/",
          "created_utc": 1612891982.0
        },
        {
          "id": "gmqevgi",
          "author": "isglitteracolor",
          "body": "I’m wearing the biggest pair of men’s sweatpants I could find and a crop top rn and I feel a little called out",
          "created_utc": 1612899962.0
        }
      ]
    },
    {
      "id": "gmx0mwu",
      "author": "nad4444",
      "body": "Good for you! Remember that you can have two lives : the one you are born into and the one you can get when you realise you only have one. It is so hard ik but you need to want this. Trust me it is so worth it. It’s so liberating to have your world revolve around you and your happiness rather than food. Keep going and you will get there.",
      "created_utc": 1613030160.0,
      "score": 1,
      "context": [
        {
          "id": "gmw7c6s",
          "author": "nad4444",
          "body": "I found it helpful to wear baggy sweatpants and roll the waste band down to below your hips. This feels like a less triggering place for it to touch and accommodates the bloooaaatting. But just remember that as soon as you recover you can break free of worrying about this. It is so freeing to live your life without ED rules. Stay strong.",
          "created_utc": 1613011140.0
        },
        {
          "id": "gmwbt7z",
          "author": "orange_peel2",
          "body": "thank you so much! i actually just started doing the waistband below my hips yesterday bc i got the idea and it worked! i just hate the feeling on my stomach. i cannot wait till one day i don’t constantly think about this or food! <3",
          "created_utc": 1613013414.0
        }
      ]
    },
    {
      "id": "gmqm5vd",
      "author": "WideAtmosphere",
      "body": "I hate any jeans or slacks with no stretch in the waistband. When I sit and it tugs at my abdomen.....rage fuel. I can't stand it. If I'm not bloated at all and I'll just be walking around and not sitting/eating, I can sometimes pull it off if I'm having a 'skinny day'. \n\nI live in stretchy wrap dresses, or any stretchy dresses really. If they are not a rough fabric (hate) and don't bind/pull at me, I can deal. When it's super cold, leggings as pants (wide waistband ONLY EVER) and a stretchy top or tunic.",
      "created_utc": 1612903046.0,
      "score": 3,
      "context": [
        {
          "id": "gmpkhof",
          "author": "slug_lady",
          "body": "i am the same. i only feel “safe” in elastic waists when they are loose on me. even if they fit just fine, my brain perceives it as a sausage casing and it is just the worse. oddly, though, i wear leggings just fine? but what goes over them needs to be baggy as all heck.",
          "created_utc": 1612887040.0
        },
        {
          "id": "gmqijvu",
          "author": "WideAtmosphere",
          "body": "I'm EXTREMELY sensitive to how waistbands touch me. I will wear tight dresses all day long, but they can't press on my waist/abdomen. If they are form fitting all over (and I'm not IBS-bloated) I'm fine. If any waistband is anything other than loose.....it makes my flesh absolutely CRAWL. How things touch my skin/textures, and where they put pressure on my body is extremely important. Leggings have to have the really wide bands at the top. Thin elastic that squeezes is unacceptable. Denim jeans? No. Not ever.",
          "created_utc": 1612901522.0
        },
        {
          "id": "gmqk4ol",
          "author": "slug_lady",
          "body": "yes, exactly! i only wear one brand of leggings consistently and even then, sometimes some batches are just... off. any other leggings must either be slightly too large or very high waisted and wide banded. same goes for underwears. jeans are the devil’s work.",
          "created_utc": 1612902186.0
        }
      ]
    },
    {
      "id": "gmqc4tb",
      "author": "orange_peel2",
      "body": "yeah everyone is different it’s cool to see how other people think and what they like and don’t like :))",
      "created_utc": 1612898797.0,
      "score": 3,
      "context": [
        {
          "id": "gmpkhof",
          "author": "slug_lady",
          "body": "i am the same. i only feel “safe” in elastic waists when they are loose on me. even if they fit just fine, my brain perceives it as a sausage casing and it is just the worse. oddly, though, i wear leggings just fine? but what goes over them needs to be baggy as all heck.",
          "created_utc": 1612887040.0
        },
        {
          "id": "gmpq1uo",
          "author": "orange_peel2",
          "body": "exactly! i need my elastic wait sweatpants/pj pants to be big on me and if they aren’t i feel awful. i’ve even cried over this and changed my clothes over this. i also recently put on leggings and didn’t feel terrible in them so that’s strange. interesting how i’m not alone in this",
          "created_utc": 1612889415.0
        },
        {
          "id": "gmq9uqb",
          "author": "XeneVyvyan",
          "body": "omg i could never with leggings, no wayyy, there's wayyy too much jiggle in my thighs, and calves too, somehow :((",
          "created_utc": 1612897828.0
        }
      ]
    }
  ]
}