{
  "id": "lmijc8",
  "subreddit": "AnorexiaNervosa",
  "author": "fei010817",
  "created_utc": 1613639362.0,
  "title": "imposter syndrome",
  "selftext": "do any of yall feel like your ed is invalidated especially when you meet friends/go out because i personally kinda have an 'ed switch' in my brain where i can pretty easily pull off eating normally and everything in front of people but when im alone i restrict like crazy? well i dont meet people that often anyways so im in ed mode basically everyday but in my head i just keep thinking that im faking my ed...especially since i started out w bulimia but im not sure if what i do now is counted anorexia or some sorta subtype ,,,",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/lmijc8/imposter_syndrome/",
  "score": 160,
  "num_comments": 7,
  "comments": [
    {
      "id": "gnx8ged",
      "author": "lyar22",
      "body": "I read this analogy on another sub (I wish I could credit the user but I can't find it now); a person with a heart condition doesn't stop having a heart condition just because their heart beats normally sometimes.\nThat person still has an issue that impacts upon their quality of life, even if it isn't noticeable 24/7. \n\nBecause you are able to eat around others doesn't negate or diminish anything. Your ED, and what you have gone through and go through because of it, is valid and you are always deserving of recovery.",
      "created_utc": 1613677712.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gnw4cjg",
      "author": "nad4444",
      "body": "I’ve recovered now but I remember that i had a pretty similar mindset. I’m quite a logical, switch on and off thinker so I would do pretty much the same thing as you. You are still completely valid, it’s just different types of brains reacting differently to an eating disorder. In the end I guess it helped me a little because I was able to finally decide and commit to recovery, while before I was fighting it. XX",
      "created_utc": 1613660951.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gnvl2yv",
      "author": "Catherun2",
      "body": "Yeah, I feel this all the time to the point where there are times where I think I've recovered, then I'll restrict. Hope this is normal.",
      "created_utc": 1613649505.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gnwye9z",
      "author": "War_and_Poetry",
      "body": "I can understand this. It is bad enough to suffer from an ED, but to be under the illusion that you are not suffering, that it is all in your head and what you're eating is normal or worse, too much, is carcinogenic.",
      "created_utc": 1613673571.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gnwd9s4",
      "author": "Farfalla_dancerina",
      "body": "I am planning my day all around meals. I am restricting by counting the calories, some numbers are safe but when I eat too much I'll cry. So I am like an imposter, eating in Front of family and friends and restricting the other time. But I live alone, I don't have the pressure of people commenting my eating behaviors I guess.",
      "created_utc": 1613664947.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gnw8q5y",
      "author": "officersmores",
      "body": "I don’t feel like I am to be considered anorexic and I honestly still deny it, but my doctors have diagnosed it. I don’t know, part of me feels like I’m faking it but my health and body appearance apparently tell otherwise.",
      "created_utc": 1613662941.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hwq3ty0",
      "author": "None",
      "body": "The switch thing really makes me feel like my bad eating habits aren't actually bad, I feel you OP. I'll be really stressed about it but if I'm out with people I can definitely switch into \"eat like you're not a crazy person\" mode. I also will stop restricting for a while, still stressing about food but not under eating, gain XX lbs, then go back to a big deficit. It definitely makes it easy for me to conclude that I don't have a problem with food/weight lol.",
      "created_utc": 1644717823.0,
      "score": 1,
      "context": []
    }
  ]
}