{
  "id": "lmyha5",
  "subreddit": "AnorexiaNervosa",
  "author": "h0494",
  "created_utc": 1613685487.0,
  "title": "I hate this disease. Need to vent.",
  "selftext": "I fucking hate this disease. I’m so sick of not being able to find a comfortable position to sleep in because of my bones. I hate that I have to sit on a pillow to be comfortable. I hate that I bruise so easily. I hate that I every time I need to eat it’s a fucking battle. I hate the constant headaches from lack of nutrition. I hate that I faint. I hate having to buy children’s clothes because nothing fits me. I hate that my hair falls out in clumps. I hate that my fingernails stopped growing. I hate the look my partner gives me when I don’t finish all my food. I hate not being able to do things because I’m tired all the time. I finally started to eat enough calories and was gaining weight and then I caught Covid and lost all the weight while sick. I’m so fucking mad that I have to start all over, again, for the umpteentth time. I hate how dark the bags under my eyes are and how sunken my face looks. I miss having energy. I miss liking the food I was eating. I miss my whole life not being revolves around food. I miss being able to hike with my dogs and not feel exhausted. I’m scared for my health. I’m back to my lowest BMI and I’m terrified. I don’t want to fuck up my heart or brain anymore than I have. I’m currently laying on the bathroom floor because showering took so much energy. I have to be to work in an hour and I just.... I feel like giving up. Will it ever get better? I feel so lost and out of hope. And deep down I know I’ll feel better when I start eating again... why can’t I just eat? It’s been *years* ... why can’t I just eat? I fucking hate this disease.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/lmyha5/i_hate_this_disease_need_to_vent/",
  "score": 120,
  "num_comments": 9,
  "comments": [
    {
      "id": "gnydvf4",
      "author": "Iscariiot",
      "body": "For me it's the cold. The bone chilling, exhausting freezing that just never seems to go away no matter how many layers I wear. I can't escape it. \n\nAdmittedly, I'm doing much better on the food front. I eat a fair amount during the day and I'm not as scared of it. But my body needs /refeeding/ and I can't give that to it. All I can do is the minimum.   \n\n\nYou're not alone. You're not alone and we can get through this.",
      "created_utc": 1613696761.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gny2jab",
      "author": "walking2020",
      "body": "Oh know how you feel. 😞\nCan u try eat one more item a meal\nI was eating 1 lettuce leaf now up to 2. An one mushroom cap now up to 2 an I switched equal for sugar in coffee.",
      "created_utc": 1613691033.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gnysoaf",
      "author": "None",
      "body": "I totally relate. I hate how I can’t sit in certain positions/chairs comfortably anymore because my tailbone sticks out too much and hurts, same  knees and so I have to put a pillow in between them when I sleep so they don’t hurt or bruise each other anymore than they already have before. \nI hate constantly finding new bruises and being told by people that I look pale or that my skin looks like it has a sickly yellow tint to it (even in recovery, people tell me this a LOT and get concerned I’m slipping back). \nI hate how I can’t stand up without getting dizzy and a vision blackout, but at the same time if I *don’t* get it then I feel guilty and like I’m eating too much (even though I’m literally in recovery).\nI hate my mind constantly being consumed with thoughts of food and being so hungry all the time but never eating enough/fully meeting my meal plan. I hate the excruciating feeling of hunger that never leaves. I hate being exhausted all the time and being told by people that my face looks “gaunt” and hollow. \nI hate that I’m in college and wasting my early twenties away to a horrible illness that feels like I’ll never escape from. I hate how it makes me so isolated and alone and apathetic in life. I hate that I tie so much worth to my weight. I hate that I’ve been told by multiple guys that being so skinny isn’t attractive and that weight gain would be good and healthy, and still my ed tells me no one will ever love me or want to be around me unless I’m as skinny as I possibly can be without dying. \nI hate being so freezing cold all of the time and losing feeling in my hands and feet all the time. I hate how my fingernails are so brittle and my hair is so thinned out from when it was falling out from malnourishment. I hate that no matter how sick I’ll be, it’ll never be enough and I’ll always want to lose more weight and I’m ruining my life by letting my ed continue to consume me even when I’m in recovery (albeit quasi recovery). \nThis isn’t life, it’s just barely surviving. It sucks.",
      "created_utc": 1613704512.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gny5cb1",
      "author": "brookleiaway",
      "body": "i can tolerate the bones when sleeping, its the every position or movement makes me nausious for me",
      "created_utc": 1613692426.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gnzy22p",
      "author": "drawn_to_the_blood",
      "body": "I also got covid and lost my sense of taste just when I’d started eating again. I hope you can find a way to start eating again. I know how hard it is. I cried through at least one meal a day for 6 months and got my weight to a point where the bones no longer bother me. I hope you can allow yourself to get to a more comfortable weight. The ED will probably still be there but at least you won’t have to suffer so much. I hate anorexia too. It tries to draw me back down into the black hole almost everyday despite how fucking hard I’ve worked. There’s only one option and it’s to keep fighting.",
      "created_utc": 1613736306.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gnyoqyu",
      "author": "h0494",
      "body": "My god I *feel* ya about always being cold. I miss wearing summer clothes in the summer instead of 45 layers.\nThank you for your kind comment ❤️",
      "created_utc": 1613702421.0,
      "score": 7,
      "context": [
        {
          "id": "gnydvf4",
          "author": "Iscariiot",
          "body": "For me it's the cold. The bone chilling, exhausting freezing that just never seems to go away no matter how many layers I wear. I can't escape it. \n\nAdmittedly, I'm doing much better on the food front. I eat a fair amount during the day and I'm not as scared of it. But my body needs /refeeding/ and I can't give that to it. All I can do is the minimum.   \n\n\nYou're not alone. You're not alone and we can get through this.",
          "created_utc": 1613696761.0
        }
      ]
    },
    {
      "id": "gny6j4w",
      "author": "h0494",
      "body": "That’s a good idea. Food can get so overwhelming! I had saltine crackers earlier and now trying deli turkey.",
      "created_utc": 1613693024.0,
      "score": 12,
      "context": [
        {
          "id": "gny2jab",
          "author": "walking2020",
          "body": "Oh know how you feel. 😞\nCan u try eat one more item a meal\nI was eating 1 lettuce leaf now up to 2. An one mushroom cap now up to 2 an I switched equal for sugar in coffee.",
          "created_utc": 1613691033.0
        }
      ]
    },
    {
      "id": "gny6uk2",
      "author": "h0494",
      "body": "Yeah, that is such an horrible feeling. Especially when you feel like you can’t escape it",
      "created_utc": 1613693183.0,
      "score": 10,
      "context": [
        {
          "id": "gny5cb1",
          "author": "brookleiaway",
          "body": "i can tolerate the bones when sleeping, its the every position or movement makes me nausious for me",
          "created_utc": 1613692426.0
        }
      ]
    },
    {
      "id": "gny6sfz",
      "author": "walking2020",
      "body": "Good for u. 🤗 an sample cups an sm saucer helped me to 👍💖💖\nYour not alone do you know 👍🥰",
      "created_utc": 1613693154.0,
      "score": 7,
      "context": [
        {
          "id": "gny2jab",
          "author": "walking2020",
          "body": "Oh know how you feel. 😞\nCan u try eat one more item a meal\nI was eating 1 lettuce leaf now up to 2. An one mushroom cap now up to 2 an I switched equal for sugar in coffee.",
          "created_utc": 1613691033.0
        },
        {
          "id": "gny6j4w",
          "author": "h0494",
          "body": "That’s a good idea. Food can get so overwhelming! I had saltine crackers earlier and now trying deli turkey.",
          "created_utc": 1613693024.0
        }
      ]
    }
  ]
}