{
  "id": "lor13m",
  "subreddit": "AnorexiaNervosa",
  "author": "abbyfromhr",
  "created_utc": 1613889483.0,
  "title": "Everyone talks about me",
  "selftext": "Today i realized that everyone around me talks about my ed. Like i was used to my parents. My dad saying i looked like a crack addict and my mom talking about it to our coworkers and family. I didn’t realize my friends talked about me behind my back about it too. I hate that I look as sick as I feel. Even more than that though i hate that not one single fucking person in the past 10 months i have had anorexia has even asked me if i was okay. Everyone notices it but no one wants to talk about it. This is honestly the most alone i have ever felt.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/lor13m/everyone_talks_about_me/",
  "score": 110,
  "num_comments": 6,
  "comments": [
    {
      "id": "go7j1f1",
      "author": "TheRealGongoozler",
      "body": "Hey OP I’m sorry to hear this.. do you wanna talk?",
      "created_utc": 1613895262.0,
      "score": 20,
      "context": []
    },
    {
      "id": "go7ro9k",
      "author": "Lici_Vi",
      "body": "I know this from a girl in my class...everyone talked about that too because they were worried but they didn’t know how to bring the topic up, so they never asked if she was okay simply because they didn’t know how. Maybe it’s the same with you?",
      "created_utc": 1613903695.0,
      "score": 16,
      "context": []
    },
    {
      "id": "go8j8oj",
      "author": "None",
      "body": "I've had an ED for 15 years... no one wants to deal with it or talk about it. It sucks but I honestly think people just feel uncomfortable or don't even know where to start.",
      "created_utc": 1613923630.0,
      "score": 12,
      "context": []
    },
    {
      "id": "go7tzcc",
      "author": "lalabearie",
      "body": "I don’t know why they feel the need to share with so many different people. However, thinking on a positive note, maybe they wanna talk to you and help you, but they don’t know how to approach; and hence, sharing your eating habits to people they know to find the best way to talk to you. Sending hugs :)",
      "created_utc": 1613906036.0,
      "score": 8,
      "context": []
    },
    {
      "id": "go8hw1u",
      "author": "anonforlong",
      "body": "These people are using your struggles as bait for conversation in their mundane little lives. It’s one thing to talk about someone out of concern, and then approach them in efforts to help them. It’s another thing to only talk about someone behind their back and, in addition, not even reach out a hand for help. You deserve to be genuinely asked how you are doing. You are more than your body, you are a person with emotions and concerns and fears and you deserve to be recognized. Stay strong, you’re not alone",
      "created_utc": 1613922948.0,
      "score": 6,
      "context": []
    },
    {
      "id": "go8l2ul",
      "author": "None",
      "body": "Ive experienced this as well, and is a big reason I ended up falling so deep into the illness. No one noticed or asked, and when someone would \"notice\" it was more along the lines of giving me praise me more for being \"fit\" (visible abs) and looking more attractive (shapes out some definition in my very round face) \n\nInside I was in mental and ED agony, but figured if it's not bothering anyone else there's nothing \"bad\" with what I'm doing. I took peoples silence to just confirm my struggles are unseen and well hidden, and that has always been a big trigger for my disorder to try and fuel itself with. My destruction has always been a private and personal affair, being invisible allows me to be as cruel to myself as I desire. No one will ever tell me I should eat, regardless of it being a missed meal or a week in. It's a blessing and a curse.",
      "created_utc": 1613924559.0,
      "score": 4,
      "context": []
    }
  ]
}