{
  "id": "lwefpd",
  "subreddit": "AnorexiaNervosa",
  "author": "secondbest5",
  "created_utc": 1614724492.0,
  "title": "The Solution",
  "selftext": "The solution to addiction is avoidance. If you're an alcoholic, you avoid alcohol. If you're a drug addict, you avoid drugs. If you're an exercise addict you avoid exercise. Eating disorders are an addiction where you have to face the vice every single day, multiple times a day. It’s like putting an alcoholic in a bar 3 times a day. Offering a drug addict crack 3 times a day. It’s the only one where you don’t get to avoid, you're literally forced to face it constantly. And it fucking blows, but I think I might just hate myself too much to fix it and face the problem head on. Maybe that would sound alarming to other people, but it’s a reality I’ve lived with for so long that it’s almost hard to understand what self-neutrality would look like, nevermind self-love.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/lwefpd/the_solution/",
  "score": 133,
  "num_comments": 7,
  "comments": [
    {
      "id": "gpgz2uw",
      "author": "lilbabybuncakes",
      "body": "never thought of ana like this & i’m a former heroin addict. i always put it more in a “phobia” category in my mind. interesting perspective.",
      "created_utc": 1614726261.0,
      "score": 39,
      "context": []
    },
    {
      "id": "gphpae1",
      "author": "ragsandbones143",
      "body": "this is such a good perspective. it's also so fucking accurate. well written.",
      "created_utc": 1614739730.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gphj96z",
      "author": "ramen___noodles8",
      "body": "it’s interesting, recently there’s been a shift towards viewing eating disorders in their neural mechanisms as addictions! this hit hard",
      "created_utc": 1614736608.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gphuvkr",
      "author": "Ashaliedoll",
      "body": "Did you watch Frenemies today? They were talking about food addiction in this same way.",
      "created_utc": 1614742588.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gpi2tqi",
      "author": "None",
      "body": "I think it’s an addiction to starving with an obsession with food",
      "created_utc": 1614747183.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gphwb7a",
      "author": "secondbest5",
      "body": "No I didn’t! I actually wrote this a few weeks ago but just decided to share it today. I’ll have to watch.",
      "created_utc": 1614743364.0,
      "score": 2,
      "context": [
        {
          "id": "gphuvkr",
          "author": "Ashaliedoll",
          "body": "Did you watch Frenemies today? They were talking about food addiction in this same way.",
          "created_utc": 1614742588.0
        }
      ]
    }
  ]
}