{
  "id": "m2g7h7",
  "subreddit": "AnorexiaNervosa",
  "author": "LaundryListings",
  "created_utc": 1615431329.0,
  "title": "Ate out AND had ice cream AND Im not guilty?",
  "selftext": "For the first time in a long time I don’t feel guilty about going out to eat. \n\nI was planning on just grabbing dinner with a friend tonight and calling that my one meal of the day, but by lunch time I was hungry, so I ate. \n\nThen, after my last class of the day my sister stopped by and picked me up to go get ice cream, her treat. I wanted to say no, but thought “hey I like icecream, let’s do this thing” so I got a big 2 scoops (same as her) and polished of the bowl. \n\nFinally, at around 7 I met my friend for dinner and she said she wanted comfort food so we went and got burritos! I ended up only being able to finish half of mine. But I stopped once I felt full and I was able to shut down the “well I’ve already eaten so much, might as well binge” mentality. \n\nI ate almost like a normal person today and normally I would feel guilty/embarrassed. But I actually feel really proud of myself. Because for once I just enjoyed myself around food and didn’t let this disorder ruin my time with my friends. \n\nI just can’t believe that I don’t feel guilty. \n\nI just feel PROUD, because of FOOD!!!!!\n\nI think I’m finally going in the right direction. I don’t know how I got here because last week I was at one of my lowest points mentally. \n\nBut I’m done being depressed and letting food stop me from living my life. I want to be happy and tonight was proof that I can be.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/m2g7h7/ate_out_and_had_ice_cream_and_im_not_guilty/",
  "score": 181,
  "num_comments": 11,
  "comments": [
    {
      "id": "gqiyaf3",
      "author": "F_unny",
      "body": "I’m so proud of you",
      "created_utc": 1615431442.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gqj3fte",
      "author": "mylaccount",
      "body": "Love this, I’m proud of you too!",
      "created_utc": 1615434298.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gqj878b",
      "author": "ashton_died",
      "body": "Great job, you deserve to be proud of yourself because I know I sure am!!! Remember how you were feeling today and think about it in the future on a day when eating might be more difficult, that usually really helps me:)",
      "created_utc": 1615437318.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gqj9r70",
      "author": "Xthaipe",
      "body": "There's nothing wrong with having a good day with friends and family, you did great and I'm so glad you're happy!",
      "created_utc": 1615438331.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gqjyi39",
      "author": "SquargyBoi",
      "body": "YES!!!! Hell yeah, I'm so proud of you! You've made AMAZING progress 💓",
      "created_utc": 1615454227.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gqk21q9",
      "author": "BoozeyTurtlez",
      "body": "YAYAYAYAYYAYAYAYAY",
      "created_utc": 1615457107.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqk4i1z",
      "author": "chicadoro16",
      "body": "Good work",
      "created_utc": 1615458841.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqklg8y",
      "author": "katkannabis",
      "body": "You *should* feel proud! I’m proud of you ♥️ I love feel-good days like this, and I hope you have plenty more to come! \n\nPs you’re *amazing*",
      "created_utc": 1615470426.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqlbylb",
      "author": "I_hate_me_lol",
      "body": "I'm SO happy for you. you got this!",
      "created_utc": 1615482764.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqmjiuk",
      "author": "River4812",
      "body": "We're so proud of you!",
      "created_utc": 1615501916.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqn0lio",
      "author": "Majestic_Rip_869",
      "body": "CONGRATS YES",
      "created_utc": 1615510689.0,
      "score": 1,
      "context": []
    }
  ]
}