{
  "id": "m4694j",
  "subreddit": "AnorexiaNervosa",
  "author": "m0llywat3r",
  "created_utc": 1615641971.0,
  "title": "Does anyone else have a weird thing with sex",
  "selftext": "Like do any of you guys have this weird ED fueled thing with sex? Like I think one thing that caused my ED was hooking up with so many guys because I was so desperate to be loved my thought process was “if I give them what they want they’ll stay” (spoiler alert- they didn’t) but then that kinda morphed into me hating my body and seeing that guys only wanna use me for my body and they don’t care about how I am as a person but now I’m uncomfortable during sex because I’m embarrassed of my body and I try not to do random one time hookups anymore. Like if I’m hanging out with a guy I’ll tell him I don’t hook up on the first date. Like since my ED started my relationship with sex has changed. Does anyone else have a similar problem?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/m4694j/does_anyone_else_have_a_weird_thing_with_sex/",
  "score": 114,
  "num_comments": 11,
  "comments": [
    {
      "id": "gqtcx6n",
      "author": "None",
      "body": "yeah, my ED makes me not want to have sex or when I do have sex i don’t enjoy it bc i’m just worried about what i look like the whole time",
      "created_utc": 1615655952.0,
      "score": 48,
      "context": []
    },
    {
      "id": "gqtgcwt",
      "author": "Farfalla_dancerina",
      "body": "There was a time I always wanted sex to burn calories. I always wanted to be on top. Today I hate being touched but I guess that is a crossover thing of my ED and my PTSD. I wish I could still use Sex as a calorie burning thing lol",
      "created_utc": 1615657747.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gqtigw3",
      "author": "None",
      "body": "i don’t even enjoy sex anymore bc i’m always worried about self image and my dick doesn’t work half the time. the only thing my ED has really done regarding my sex life is kill my sex drive almost entirely. \n\nsex is overrated anyways. most people are only looking for a quick way to get off or are just trying to show off. and most guys don’t necessarily “only wanna use [you] for [your] body,” it’s just that most guys will go after the first chick that gives them any sort of positive attention and will be the easiest to sleep with. take it from a guy who’s been there many a time over the years. props to you for taking control of your sexual power tho! \n\nregardless, i wish you well and hope you get better!",
      "created_utc": 1615658841.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gquyrti",
      "author": "Defiant_Switch1776",
      "body": "So I have like zero sex drive if I am “normal” weight because to myself I just feel gross as hell. However when I am extremely thin I for some reason feel like some sort of sex kitten and I am all about it. I know it’s super messed up but it’s probably related to all sorts of messed up trauma I have.",
      "created_utc": 1615688019.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gquc4k0",
      "author": "hands_of_sin",
      "body": "Yes definitely.  I also used to sleep with guys because I wanted to be loved and was self destructively people pleasing so I would just give 'em what they wanted.  \nNow I have all kinds of weird issues around sex, and I don't like being touched.  I'm not actively restricting badly right now, but I still have the same self consciousness and my body that makes me feel gross",
      "created_utc": 1615674812.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gqubq4b",
      "author": "boogiepoopphantom",
      "body": "I have trauma related to sex stuff, so similar. I kinda love how anorexia makes me feel “sexless” like horny whatsoever it’s great.",
      "created_utc": 1615674584.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqv298v",
      "author": "katkannabis",
      "body": "Um. Are you me?",
      "created_utc": 1615690114.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqv6lfk",
      "author": "dirtydrugz",
      "body": "never related with nothing more .",
      "created_utc": 1615692834.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqvd9nd",
      "author": "Kitchen-Tax-8338",
      "body": "Yeah I’m a virgin who tells my boyfriend I’m waiting until marriage but really I’m so eager please him. I see myself as an object for him to play with even though I desperately don’t want to be.",
      "created_utc": 1615697316.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gr9p1en",
      "author": "little2n",
      "body": "I get to scared. I feel like I’m too fat and not sex worthy",
      "created_utc": 1616008141.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqtpbh3",
      "author": "loldoggos",
      "body": "Same same saaaammmeee",
      "created_utc": 1615662389.0,
      "score": 12,
      "context": [
        {
          "id": "gqtcx6n",
          "author": "None",
          "body": "yeah, my ED makes me not want to have sex or when I do have sex i don’t enjoy it bc i’m just worried about what i look like the whole time",
          "created_utc": 1615655952.0
        }
      ]
    }
  ]
}