{
  "id": "m4kcb8",
  "subreddit": "AnorexiaNervosa",
  "author": "everydayis_caturday",
  "created_utc": 1615684271.0,
  "title": "Bridesmaid Dress Shopping",
  "selftext": "TW: mention of size/body dysmorphia\n\nToday was the day I have been dreading for months, praying for the lockdown to go on so I wouldn’t have to go dress shopping. But today came anyways, and I’m left with a feeling of both pride and absolute shame. \n\nMy best friend is getting married and I am one of 4 girls in the bridal party, and we are all very different shapes and sizes. We had 5 styles to choose from, and I got left with the spaghetti strap option. \n\nThere are no mirrors in the changing rooms so you have to go out in order to even see what it looks like. So I try on the dress in a sample size, the same size I wore to my sisters wedding last year, I walk out and realize it is about four sizes too big. Our consultant comes over and immediately clips me into it so it doesn’t fall down and proceeds to measure me to find out what size I am....and it ended up being the smallest size they offer. \n\nI tried to joke about needing a bigger push up bra to fill out the dress, but I didn’t feel the rush pride I once would have. Instead I am filled with feelings of shame and embarrassment. Ashamed that I let myself get to this point, embarrassed that I thought I could stop at any time, and now anorexia is controlling my life. \n\nI think I caught a glimpse of myself through someone else’s eyes, just for a second, when I turned around I saw a woman in a child’s body. I could see stares from other bridal parties, and whispers back and forth from mother to daughter. I have become the cautionary tale parents tell their children, “you don’t want to end up like her”.\n\nToday was the day I realized, I am way further down this rabbit hole than I ever thought.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/m4kcb8/bridesmaid_dress_shopping/",
  "score": 122,
  "num_comments": 8,
  "comments": [
    {
      "id": "gqut19g",
      "author": "iwanttocrybutcant",
      "body": "beautifully written\n\nthat honestly scares me too: although I'm nowhere near your level, i don't think I've worn anything other than pants in months tbh. allowing others to judge me is horrific.",
      "created_utc": 1615684594.0,
      "score": 28,
      "context": []
    },
    {
      "id": "gqvaqh1",
      "author": "tearsandcaffeine",
      "body": "can completely relate to this feeling and it’s awful. i’ll go long periods of time without looking at my reflection, then it will inevitably come up, and i’ll feel both shocked and disgusted. seeing that i look thinner than usual used to be something i celebrated, but now it’s just evidence of the fact that i have no control over my body. i really hope you are doing better OP ❤️",
      "created_utc": 1615695542.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqvewox",
      "author": "an-accoridan",
      "body": "I can definitely relate to this, I often don’t know how bad it gets until I go shopping with my friends and my usual size starts falling down on me, and I realize I’ve gone down 2 cup sizes in a few months. It’s an awful feeling, I’m so sorry you’re going through this and I hope you can get past it ❤️",
      "created_utc": 1615698525.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqvmq4e",
      "author": "mylaccount",
      "body": "I’m really really sorry, for what you’re going through and the intense feelings you had today. Every realization is a step towards life though. The hardship of today will pay off in the future if you remember what your own brain finally said today, even though no, none of us should feel shame or embarrassment. If I can tell you one thing, somehow someway try working on that shame, because it’s not yours to carry. \n\nI hope you can still enjoy the wedding. At least you know you’ll have your friends there, and I’m 200% sure you look beautiful regardless ❤️ strength is also beauty",
      "created_utc": 1615704914.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqw92on",
      "author": "Sea-Smoke-9498",
      "body": "I can relate, not dress shopping but looking in the mirror and seeing ribs looking like the Himalayan mountains",
      "created_utc": 1615726833.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqw429o",
      "author": "None",
      "body": "I had the opposite problem. Bridesmaid dress that I thought would fit was three sizes too small.",
      "created_utc": 1615722514.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gqux975",
      "author": "everydayis_caturday",
      "body": "Thank you, I’m sorry you’re also dealing with this monster 💜\n\nI wear very baggy clothing typically, so no one gets a chance to actually see my body, even me. Thanks to my boyfriend, there’s only 1 small mirror in my house, so I didn’t really have an accurate idea of how I looked before today.",
      "created_utc": 1615687089.0,
      "score": 10,
      "context": [
        {
          "id": "gqut19g",
          "author": "iwanttocrybutcant",
          "body": "beautifully written\n\nthat honestly scares me too: although I'm nowhere near your level, i don't think I've worn anything other than pants in months tbh. allowing others to judge me is horrific.",
          "created_utc": 1615684594.0
        }
      ]
    },
    {
      "id": "gqvcbik",
      "author": "chicadoro16",
      "body": "I'm really sorry, its awful when it gets so bad you can't even fool yourself. To be able to \"see\" myself clearly was really heartbreaking. \n\nI had my wedding dress made to measure, I was very open with my designer from the start, so she didn't finish the dress completely until just before the wedding. Also opted to go braless as boobs fluctuate way to much. \n\nSeeing you are stuck with the bridesmaid dress, look up \"huit 8\" bras, they do a push up which has removal air implants. These are great because when I'm not having relapse I just wear it without implants, it's less stressful than having sets of healthy bras and anna bras\n\nEdit: replied in wrong place sorry!",
      "created_utc": 1615696642.0,
      "score": 4,
      "context": [
        {
          "id": "gqut19g",
          "author": "iwanttocrybutcant",
          "body": "beautifully written\n\nthat honestly scares me too: although I'm nowhere near your level, i don't think I've worn anything other than pants in months tbh. allowing others to judge me is horrific.",
          "created_utc": 1615684594.0
        }
      ]
    }
  ]
}