{
  "id": "m55b00",
  "subreddit": "AnorexiaNervosa",
  "author": "-smaller-",
  "created_utc": 1615758906.0,
  "title": "I Ordered Pizza!!! (Shout out to u/freedomofit)",
  "selftext": "I'm not even in recovery. In fact, since COVID hit I've become pretty sick due to the isolation but now, as per my provincial regulations, I'm allowed to have one personal contact for visits because I live alone. \n\n3-ish days ago I saw [this post](https://www.reddit.com/r/AnorexiaNervosa/comments/m2jiqh/ordering_pizza/?utm_source=share&utm_medium=web2x&context=3) by u/freedomofit and was like, \"Hell yeah!\" super excited for them. I hadn't eaten yet that week and pizza is one of those foods I love but my ed has taken away from me. I was feeling pretty inspired, as I love to see people doing stuff in recovery that still really scares me. It gives me hope that I could want it for myself one day. I commented on the post, saying I was inspired by it and in one of their replies they said to me,  \"You gotta have some pizza too 🤗 and thanks for your comment ❤\" and it stuck with me so fucking much 🥺. I continued to not eat until saturday evening, and the logical non-ed part of my brain was panicking that I was just gonna let myself die but then I just thought back to that comment for whatever reason. So I called my best friend and invited them to come over and...\n\n# 🍕🍕🍕LAST NIGHT I ORDERED PIZZA TOO!!!! 🍕🍕🍕\n\nGuys, I ate pizza with my friend. Hawaiian, extra cheese, thick crust. Don't care what ya'll think about pineapple on pizza, I used to love it. I set myself for success by eating with my best friend who knows about my ED and would make sure I couldn't purge it afterwards. We talked, we laughed, I ATE THE PIZZA, I LET MYSELF ENJOY THE PIZZA!! It was delicious! I loved it. It was a beautiful night out so afterwards we went for a walk and we **GOT ICECREAM**! Ice cream has always been my true love. Like, guys, I was eating and laughing like a normal person and it was so nice 😭. \n\nI still don't know if I'm ready for full recovery but this was a huge triumph for me, especially after not eating for almost a whole week and wondering if I was just gonna let myself die. u/freedomofit, if you're reading this I want you to know you really did inspire me, possibly even to save my own life this week. So thank you, I wish you love and pizza! ❤️🍕❤️🍕❤️\n\n\nEDIT: Wow, guys! Thank you to everyone for your support! Admittedly when I wrote this I was feeling equal parts good and guilty about it but reading your responses has really helped me to focus on the good!! ❤️",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/m55b00/i_ordered_pizza_shout_out_to_ufreedomofit/",
  "score": 154,
  "num_comments": 7,
  "comments": [
    {
      "id": "gqyk6ej",
      "author": "chicadoro16",
      "body": "Awesome! That's fabulous, smiled at \"and ice cream\"    what a great success for you to celebrate!",
      "created_utc": 1615765637.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gqyh5tf",
      "author": "None",
      "body": "That’s awesome 😎. You should be proud of yourself 😊",
      "created_utc": 1615763958.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gqz7l78",
      "author": "flowerscatsandqs",
      "body": "My go-to pizza pre-ed relapse was a BBQ Hawaiian: pineapple, red onion, and Canadian bacon with BBQ sauce instead of red sauce god it was absolute 🔥I’m so happy for you!!!",
      "created_utc": 1615779396.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gqz06ta",
      "author": "None",
      "body": "Aww I’m so proud of you 🥺👏🏻",
      "created_utc": 1615774866.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gqzroca",
      "author": "Emptyfulfillment",
      "body": "Dude Yessss yesss live that normal life baby you deserve it after so much struggle! I live alone too and I i Cooked for the first time in ... years and living alone I just was like I AM HUNGRY ... people are supposed to eat and I was so proud \n\nKeep going!",
      "created_utc": 1615796441.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gr0xf6p",
      "author": "KryptonionNipple",
      "body": "To be honest I order pizza a few times. But make one pizza last a week and refrigerate it. Have a slice with a salad",
      "created_utc": 1615824608.0,
      "score": 1,
      "context": []
    }
  ]
}