{
  "id": "mbv7p9",
  "subreddit": "AnorexiaNervosa",
  "author": "berserker99alita",
  "created_utc": 1616552492.0,
  "title": "Successful meal!",
  "selftext": "I took a trip to Mall of America with my friends last week and we found this place called Dough Dough where its like an ice cream shop but just different flavors of cookie doughs (I think without the eggs cuz they sell it meant to be eaten raw IDK i guess its safe lol). My friends who know how bad I've been struggling lately were really surprised when i wanted to go but the logo is do Dodo bird which I thought was hilarious (like come on that is genius) so I had to try it. We got this thing called the half baked with Oreo and Monster cookie dough thats been lol well halfway baked and with ice cream scoop on top. My friends were great and didn't comment (they know praise for eating makes me think I binged) when I ate the whole thing basically by myself and OMG it was delicious! It was warm and a cookie but also soft dough with oreos and peanut butter and M&Ms and the cold ice cream was perfect. I didn't even get mad when they drizzled it with chocolate sauce beforehand. It was just really nice to appreciate food for the flavor/ temperature / texture and I didn't feel the need to use my app to calculate the calories afterwords or purge it. My regular patterns resumed the next day but i keep thinking back to that meal and reliving it when I'm hungry and instead of being ashamed I'm really proud of myself for it. Despite feeling the need to continue my bad habits, it reminds me I can still indulge every now and then and it isn't the end of the world",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/mbv7p9/successful_meal/",
  "score": 115,
  "num_comments": 7,
  "comments": [
    {
      "id": "gs0iqz6",
      "author": "None",
      "body": "Great example of being kind to urself and giving urself permission.",
      "created_utc": 1616559865.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gs0eebm",
      "author": "akiisaperson",
      "body": "what stores are nearby and what floor is it on?? id love to go there the next time i visit the cities!!",
      "created_utc": 1616557056.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gs0x2yz",
      "author": "BakedTaterTits",
      "body": "That sounds delicious. Road trip might be in order...",
      "created_utc": 1616571915.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gs1s38z",
      "author": "Caroline-Online",
      "body": "I’ve been there before! It’s really good.",
      "created_utc": 1616594583.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gs23sc4",
      "author": "Strict-Caramel-8544",
      "body": "I love the mall of america, glad you had fun",
      "created_utc": 1616599669.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gs25o6j",
      "author": "Lici_Vi",
      "body": "This is great! Let’s hope your going on with heading in the right direction!",
      "created_utc": 1616600412.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gs0jltd",
      "author": "berserker99alita",
      "body": "Yaaay totally recommend it! To be honest all i remember was that it was on the second floor I wanna say around the corner of the Vans store maybe?",
      "created_utc": 1616560451.0,
      "score": 8,
      "context": [
        {
          "id": "gs0eebm",
          "author": "akiisaperson",
          "body": "what stores are nearby and what floor is it on?? id love to go there the next time i visit the cities!!",
          "created_utc": 1616557056.0
        }
      ]
    }
  ]
}