{
  "id": "mgrhm3",
  "subreddit": "AnorexiaNervosa",
  "author": "Ga1acticTarantu1a",
  "created_utc": 1617142655.0,
  "title": "Going to inpatient",
  "selftext": "Wow. After struggling for almost a decade I'm finally getting help. I'm going to inpatient treatment in a few days and I'm fucking terrified but also fucking ready as I'll ever be. I gave up doing so much that I loved because of ana - I ended my competitive figure skating career, gave up pole vault and cross country because of health issues, skipped out on countless social events and trips because of the food, and even I dropped out of fucking college because I was too sick to even get to class (planning to return after treatment though). I want to have the power back to live my life how I want to but I've also been sick for so long that I don't even know what parts of me are actually *me* and what is ana. I think I'll be in treatment for a while; most places wouldn't even admit me because my BMI is too low and it'll take weeks just to get medically stable. I also have other pretty severe mental health issues and I'd be going to the psych ward right now if I didn't have an ED. I haven't even told my friends or roommates where I'm going, or that I'm even sick, or that I dropped out of school. They'll come back from spring break and I'll be gone with no explanation and we probably won't see each other for months. So yeah. It's been hard to admit to myself how sick I am and that I deserve to be happy and get help but fucking did it and I'm going to fucking recover and get my degree and figure skate again and live my life how I (and all of you reading this) deserve to fucking live it because (say it with me!) I AM WORTHY OF RECOVERY AND I DESERVE HAPPINESS. Wish me luck I guess :)\n\nUpdate: So I went to treatment. I spent 4 months in inpatient and it was quite the ride. But I made it. And I’m almost 2 years in recovery! I’m back in school acing my classes, got an undergrad research position, and am even thinking about grad school. I have so many amazing friends now and a great support system. I even got a cat last year, and she is absolutely the love of my life. None of these things were even options when I was sick. Going to treatment 100% changed my life. I’m truly living a life I never thought was possible before. Don’t get me wrong, recovery is a rollercoaster and I have my ups and downs to this day. I still hear ana whispering in my head wanting me to be sick again, and I think she will always be there- but she doesn’t control me anymore. If you’re considering going to treatment or getting help in any way, know it will be scary and one of the hardest things you’ll ever do in your life. You’ll step into the hospital and every cell in your body will be begging to leave. But please stay. Treatment truly turned my life around for the better and I am so so thankful to be in recovery.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/mgrhm3/going_to_inpatient/",
  "score": 162,
  "num_comments": 16,
  "comments": [
    {
      "id": "j801ppm",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1676048777.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gsupujc",
      "author": "None",
      "body": "Hitting rock bottom is sometimes necessary to get the kick into action.",
      "created_utc": 1617143896.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gsusgjo",
      "author": "That_Violinist",
      "body": "After nearly a decade I’m getting treatment this summer for the first time! This post makes me feel so hopeful about it because my ed voice is screaming but I know enough is enough and I’m over this horrible illness ruining my life. thank you so much for this and I wish you the best :)",
      "created_utc": 1617145270.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gsuuvmg",
      "author": "anonchicago7",
      "body": "Wish you all the love and strength in the world",
      "created_utc": 1617146533.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gsv3vwe",
      "author": "None",
      "body": "So happy to hear you’re getting help. I did impatient then residential last year and it was the best thing that ever happened to me. Wishing you all the best!",
      "created_utc": 1617151319.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gsvcgwd",
      "author": "-justsleepy",
      "body": "I’m in inpatient right now ! Just got in on Monday, it’s gonna be hard but honestly it feels really good to actually become yourself :)",
      "created_utc": 1617155995.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gsvw5fp",
      "author": "TXP00nTappa",
      "body": "Remember that it’s persistence, not perfection. You’re a champ and I’m rooting for you ❤️",
      "created_utc": 1617168674.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gsvdsio",
      "author": "Carodactyl",
      "body": "Yes bestie!!! We love to see it!! you deserve happiness, recovery, and to have real, good energy that helps you live the incredible life you’re building every moment you spend healing. Even though I’m just a year in, I can tell you that recovery is 100% worth it and college is way better now that I can use my brain. Can’t wait for you to become who you want to be!!!! Wishing you all the love and support in the world, you got this!!!",
      "created_utc": 1617156720.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gsvszj8",
      "author": "DiligentCheesecake44",
      "body": "Great news. I went to inpatient at The Meadows Ranch 3 times. Finally got into recovery. Now I horseback ride!!",
      "created_utc": 1617166212.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gsw8ga0",
      "author": "ray_ana",
      "body": "good luck, you’re strong",
      "created_utc": 1617178622.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gswa5al",
      "author": "axxxxxxxk",
      "body": "You go glen coco",
      "created_utc": 1617180384.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gswgx2v",
      "author": "EsmeSalinger",
      "body": "Best wishes for finding that part of yourself that wants to flourish. My big hope for you is that you meet a gifted therapist with warm immediacy who builds an alliance with you that you trust. Therapy really can work, but there has to be a good fit and good chemistry, along with both sides being willing to cone to the table and repair \"alliance ruptures\", little disagreements that take on painful symbolism or a comment that doesn't sit right or feel good. We become more well in community, in relationship, so the people who you entrust to companion you on your journey to health have to be right for you.",
      "created_utc": 1617187289.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gsxb0x6",
      "author": "mylaccount",
      "body": "You’re worthy of all the happiness in the world! Best of luck ❤️",
      "created_utc": 1617205058.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gsxyoz8",
      "author": "None",
      "body": "I did inpatient 2 years ago and have been in recovery ever since. Keep your head up, there is a light at the end of the tunnel!",
      "created_utc": 1617215723.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gsxxq9w",
      "author": "Ga1acticTarantu1a",
      "body": "That’s great! The meadows was one of the places I considered and might go to later in recovery, how did you like it there?",
      "created_utc": 1617215279.0,
      "score": 1,
      "context": [
        {
          "id": "gsvszj8",
          "author": "DiligentCheesecake44",
          "body": "Great news. I went to inpatient at The Meadows Ranch 3 times. Finally got into recovery. Now I horseback ride!!",
          "created_utc": 1617166212.0
        }
      ]
    },
    {
      "id": "gsya8lh",
      "author": "DiligentCheesecake44",
      "body": "It’s amazing there. Great program.",
      "created_utc": 1617221008.0,
      "score": 1,
      "context": [
        {
          "id": "gsvszj8",
          "author": "DiligentCheesecake44",
          "body": "Great news. I went to inpatient at The Meadows Ranch 3 times. Finally got into recovery. Now I horseback ride!!",
          "created_utc": 1617166212.0
        },
        {
          "id": "gsxxq9w",
          "author": "Ga1acticTarantu1a",
          "body": "That’s great! The meadows was one of the places I considered and might go to later in recovery, how did you like it there?",
          "created_utc": 1617215279.0
        }
      ]
    }
  ]
}