{
  "id": "mto2dy",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1618788181.0,
  "title": "Recovery feels like \"giving up\"",
  "selftext": "\\*\\*\\*Disclaimer: This is NOT a pro-ED post, nor am I trying to discourage anyone from seeking recovery. This is literally just me venting, don't take it too seriously plz lol\n\nSo I know logically that recovery is a good thing and something I should want and feel proud of myself for doing. However, it just feels so opposite to everything my mind has been trained to think for so long. Like I hear people saying that recovery takes so much \"strength\" and \"willpower\" and \"dedication\" and \"discipline\" but... these were always characteristics I associated with my eating disorder. Like... I felt like restricting and losing weight meant i was strong; abstaining from \"junk food\" took willpower; going for a run in the rain was dedication; staying under my calorie limit was disciplined. Because it's hard af to actually do those things!! Now you're telling me that what I always thought was \"weak\" and \"lazy\" and \"self-indulgent\" and \"the easy way out,\" such as eating more calories, gaining weight, not exercising everyday, etc is actually what requires hard work and dedication and strength?? But how?! That feels like giving up and being weak, not being strong.\n\nSometimes this feeling gives me a bit of imposter syndrome about my ED. I tell myself that if I had a \"real\" ED, then I wouldn't feel this way. I feel like a \"fake\" or \"bad\" anorexic. If I was *actually* anorexic, then maybe eating *would* feel more difficult. Idk, I hope this makes any sense :P",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/mto2dy/recovery_feels_like_giving_up/",
  "score": 135,
  "num_comments": 7,
  "comments": [
    {
      "id": "gv1dc2c",
      "author": "None",
      "body": "I am currently feeling the exact same - eating does not feel strong, it is the not eating that feels strong as that is something humans find challenging and difficult etc. I am actually going to bring this up in therapy (CBTE) this week, so I may be back with more on this...",
      "created_utc": 1618799187.0,
      "score": 24,
      "context": []
    },
    {
      "id": "gv1wdlq",
      "author": "whataboutbrie",
      "body": "I think that what people mean about the ‘strength’ or ‘willpower’ to do things in recovery is not about the behaviours. Yes, restricting and over exercising are ‘harder’ than eating a normal sized meal and then not going for a run...but the difficulty in recovery is challenging the thought processes that make you think you are bad, weak or a failure for allowing yourself food or taking it easy. What people are praising is the incredible amount of psychological energy it takes to challenge and resist the self critical thoughts that place judgments on the behaviours. Sure- the physical ACTS of recovery are easy- but managing the negative emotions and distress they cause is not. Recovery is totally about giving up...it’s giving up a set of behaviours that allow you to feel safe and then actually starting the hard work of figuring out why you needed the behaviours in the first place.",
      "created_utc": 1618812094.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gv1tbwv",
      "author": "DiligentCheesecake44",
      "body": "I felt exactly this way when I was first in recovery. And I still feel like strength, discipline and will power was how I was in my ED instead of now.",
      "created_utc": 1618809692.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gv1ulz0",
      "author": "mykindabook",
      "body": "i strongly feel this way too... now in forced treatment, and whenever a nurse compliments me for eating, i just want to scream at them and say no, it was not a good thing that i ate. I’m so weak for not fighting the treatment more. I feel very guilty and bad for eating anything and i don’t fuckin want to do it. :(",
      "created_utc": 1618810689.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gv2ovub",
      "author": "None",
      "body": "OMG. That triggers the hell out of me. Anybody saying something like ‘well done for eating that’. They might even give u a pat like well done doggy. They’ve no idea how close they’ve come to getting the plate in their face!!!",
      "created_utc": 1618835707.0,
      "score": 4,
      "context": [
        {
          "id": "gv1ulz0",
          "author": "mykindabook",
          "body": "i strongly feel this way too... now in forced treatment, and whenever a nurse compliments me for eating, i just want to scream at them and say no, it was not a good thing that i ate. I’m so weak for not fighting the treatment more. I feel very guilty and bad for eating anything and i don’t fuckin want to do it. :(",
          "created_utc": 1618810689.0
        }
      ]
    },
    {
      "id": "gvj8aw1",
      "author": "None",
      "body": "i feel you, but also reading this makes me sad. maybe being strong is overrated... and being weak is underrated. let yourself be \"weak.\" you've been strong for too long; after all, you've more than \"earned\" it by now. \n\ni hate the connotation of \"strong\" and \"weak\" tbh; it's so moralizing",
      "created_utc": 1619154092.0,
      "score": 1,
      "context": [
        {
          "id": "gv1ulz0",
          "author": "mykindabook",
          "body": "i strongly feel this way too... now in forced treatment, and whenever a nurse compliments me for eating, i just want to scream at them and say no, it was not a good thing that i ate. I’m so weak for not fighting the treatment more. I feel very guilty and bad for eating anything and i don’t fuckin want to do it. :(",
          "created_utc": 1618810689.0
        }
      ]
    },
    {
      "id": "gv2tcka",
      "author": "mykindabook",
      "body": "i know right!!! i mean i guess it helps someone but me, noo. i’ve told them that i don’t want any comments on my eating at all.",
      "created_utc": 1618838170.0,
      "score": 2,
      "context": [
        {
          "id": "gv1ulz0",
          "author": "mykindabook",
          "body": "i strongly feel this way too... now in forced treatment, and whenever a nurse compliments me for eating, i just want to scream at them and say no, it was not a good thing that i ate. I’m so weak for not fighting the treatment more. I feel very guilty and bad for eating anything and i don’t fuckin want to do it. :(",
          "created_utc": 1618810689.0
        },
        {
          "id": "gv2ovub",
          "author": "None",
          "body": "OMG. That triggers the hell out of me. Anybody saying something like ‘well done for eating that’. They might even give u a pat like well done doggy. They’ve no idea how close they’ve come to getting the plate in their face!!!",
          "created_utc": 1618835707.0
        }
      ]
    }
  ]
}