{
  "id": "mvbwfc",
  "subreddit": "AnorexiaNervosa",
  "author": "kroklolob",
  "created_utc": 1618997083.0,
  "title": "Had a strong moment guys",
  "selftext": "",
  "url": "https://www.reddit.com/gallery/mvbwfc",
  "score": 203,
  "num_comments": 7,
  "comments": [
    {
      "id": "gvbjs0y",
      "author": "gardenfaiiri",
      "body": "I’m so so proud of you, that last sentence was so powerful, and I hope you know you are too. Keep going! We’re all cheering for you <3",
      "created_utc": 1619011279.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gvb1666",
      "author": "Lici_Vi",
      "body": "I am soooo fucking proud of you omg this realisation is a very big step forward, keep going. Oh my god I can't put in words how proud I am. I am literally crying tears of joy right now because of a complete stranger. I. Am. So. Fucking. Proud. Keep. Going.",
      "created_utc": 1618998026.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gvb6phi",
      "author": "sufficiently_sp00ked",
      "body": "Proud of you 🥺❤️ You've got this!",
      "created_utc": 1619002901.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gvcdr95",
      "author": "celinat0r",
      "body": "I'm so proud of you 💛",
      "created_utc": 1619024616.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvd1l4l",
      "author": "Mjaguacate",
      "body": "This struck a chord with me. I’m at the higher end of my weight again and I feel like shit. I want to start restricting again to get back down because I’ve gained so much during recovery, but I don’t want to relapse. I don’t want to feel faint and lethargic all the time again, but I hate having this extra weight. On top of that, I’m seeing my family again in a few weeks for the first time in two years and I don’t want to be the same weight as when they last saw me. I hate feeling like this; I just want to be able to maintain my goal weight healthily, but I can’t afford to buy a bunch of healthy food on my budget. I also don’t like cooking, so even if I had healthy food I would opt for quick options. I wish it were easier and affordable to be healthy and I could stop feeling like shit about myself.",
      "created_utc": 1619034735.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gvbr1w1",
      "author": "yogathenbeer",
      "body": "Very moving, OP! You've got this!!!!!!! Your strength is beautiful and inspiring. ❤️",
      "created_utc": 1619014871.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvctiox",
      "author": "butterflysheath",
      "body": "i love you so much and i'm so proud of you. you're doing so well and i know it's hard but it's so rewarding and worth it. ❤️❤️❤️❤️",
      "created_utc": 1619031268.0,
      "score": 2,
      "context": []
    }
  ]
}