{
  "id": "mvuhav",
  "subreddit": "AnorexiaNervosa",
  "author": "m4imaimai",
  "created_utc": 1619055355.0,
  "title": "I ate my fear food!",
  "selftext": "Ive been dreading to eat my fear food for a long while now, ever since I started trying to recover.. and i always found a way around it. \nToday I wasn’t planning on eating it but the food item I was planning to eat wasn’t able to succeed, so I had no choice, so I just did it.\n\nI feel like I can do anything now, it’s okay, I didn’t loose control for doing that, I ate what my body needed and I feel fine. I want to start tomorrow happier because I know I can do it, so to anyone out there struggling with fear foods and so on, if you try it you will achieve it, and don’t give up ♡",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/mvuhav/i_ate_my_fear_food/",
  "score": 148,
  "num_comments": 7,
  "comments": [
    {
      "id": "gvexd89",
      "author": "DiligentCheesecake44",
      "body": "Great job!",
      "created_utc": 1619069886.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gvf97d2",
      "author": "wanderer_exe",
      "body": "that's amazing, congrats on you~",
      "created_utc": 1619080403.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gvei101",
      "author": "WideAtmosphere",
      "body": "Yay! ♥️👍",
      "created_utc": 1619059922.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gvfzl2o",
      "author": "T_86",
      "body": "So proud of you!!\n\nI’ve been in recovery for over a year now (on and off). Recently been doing quite well so my fiancé and I purchase my biggest fear food, I was surprisingly okay. We bought it again about a month later and I had a panic attack after eating it. I have to admit I was also quite shakey and sweaty while purchasing it. Reflecting about this, I’ve figured out what I did wrong. The first time I purchased my fear food, it came in a tiny individual snack size package. The second time I bought it, it came in a larger package (party size?). I guess even after all this time I still need to take baby steps. None of this easy!",
      "created_utc": 1619099481.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvg7pmx",
      "author": "Zyklar",
      "body": "god thank you for not including what it was lol cus sometimes it makes me worry like i should be afraid of it too",
      "created_utc": 1619103133.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvfv2wa",
      "author": "Wtfisthis66",
      "body": "I am so proud of you lovie❤️!",
      "created_utc": 1619097228.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gvgesan",
      "author": "m4imaimai",
      "body": "Yeah I thought sometimes we invalidate our safe foods just because they’re others fear foods, plus it’s not really needed to get the message across yay ^^",
      "created_utc": 1619106129.0,
      "score": 2,
      "context": [
        {
          "id": "gvg7pmx",
          "author": "Zyklar",
          "body": "god thank you for not including what it was lol cus sometimes it makes me worry like i should be afraid of it too",
          "created_utc": 1619103133.0
        }
      ]
    }
  ]
}