{
  "id": "mws7y2",
  "subreddit": "AnorexiaNervosa",
  "author": "Kangster1604",
  "created_utc": 1619173543.0,
  "title": "New parent of",
  "selftext": "Hello -  I hope being a parent of someone with Anorexia Nervosa and my question does not violate the intent of this group.  If that is the case please delete my post.\n\nMy 16 y/o daughter was just diagnosed with Anorexia Nervosa.  She is super type A personality, so can be ultra driven when seeking a goal.  \n\nWhat things did your parent(s) say or do that was helpful, and what things should a parent never say or do?  \n\nI was pretty clueless about things leading up to this point, and have been known to speak with a foot in my mouth.  I feel like this is too serious to make a mistake.  Thank you in advance!\n\nEdit:  Thank you for all the thoughtful and informative replies.  Today marks my 5th day of trying to read everyone.  I will try to take everything you say into account.  I already read somethings that I might have said innocently before that I will avoid now.  \n\nI can’t begin to describe how appreciative I am\nfor each one of your comments.   Thank you!",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/mws7y2/new_parent_of/",
  "score": 161,
  "num_comments": 28,
  "comments": [
    {
      "id": "gvjwh5q",
      "author": "ifuckpineapples",
      "body": "things my parents have said that made it worse: jokes about my size, jokes about weight, comments on my food (you ate so much! wow you're still hungry? ANYTHING) punishing me for my disorder, telling other adults about it... there's a lot tbh. it's going to be hard.\n\nthings that would help: being open and available to talk to, helping to schedule doctor/therapist appointments if she asks (don't be \"are you sure you need that? makes us regret it) tbh removing the scale from my house probably would've helped but I had a car and my own money so I just bought my own and hid it.\n\nasking her to come grocery shopping with you may or may not help. it's good to have foods you feel comfortable with well stocked, but it might be an overwhelming experience for her right now. give her time.\n\njust by seeking out help and asking you're already doing more than 90% of parents from what I can tell based on the other ED subs. I wish my mom had cared like you. thank you for looking out for her. it'll be hard, it'll take time. recover us not always a straight shot. she might get better, than worse, than better again. being there for her without judgement it the best you can do.",
      "created_utc": 1619175051.0,
      "score": 109,
      "context": []
    },
    {
      "id": "gvkfnn5",
      "author": "peppermint_snow",
      "body": "For me personally, the absolute worst thing that a parent can do is to force their kid to eat. For me this lead to some bulimic symptoms. Encouraging eating is one thing and can be helpful, but punishing your child for not eating or refusing to let her leave the table until she's finished can cause way more harm than good. I'd also encourage you to look at Ro Mitchell on YouTube. She's recovering from anorexia and the comments her parents give in the videos are incredibly helpful and supportive without being too overbearing.",
      "created_utc": 1619186648.0,
      "score": 59,
      "context": []
    },
    {
      "id": "gvkohzi",
      "author": "Yola-tilapias",
      "body": "OP if you really want to help your daughter you need to understand what you’re dealing with. \n\nThis isn’t an eating disorder per se, it’s a maladaptive coping mechanism for stress and trauma. \n\nPeople feel that there’s so much stress or pressure that they can’t control that their mind carves out an area that they can control, what they eat. \n\nWhen they “master” eating, they’re able to ignore the real stressors and pressure they’re under. \n\nSo if you want to support your daughter you need to get to the bottom of what she’s so stressed out over. \n\n\nIs it internal pressure? \n\nFamily expectations for success?\n\nKeeping up with her friends and their accomplishments?\n\nBecause if you don’t figure out the underlying stressors, and safer ways to handle that stress, it’ll be very hard to beat this.",
      "created_utc": 1619190583.0,
      "score": 53,
      "context": []
    },
    {
      "id": "gvk27w8",
      "author": "m4imaimai",
      "body": "I think the must helpful thing they do are keeping sure I eat, but without forcing me to eat (of course, they would get more serious if I didn’t eat). They are giving me their trust, and I trust them and believe them. \nI think before all communication it’s important, I really want them to know how I feel and how this makes me feel, so listening can go miles. \n\nUnhelpful things? Probably pointing out my weight or making me uncomfortable by asking wether or not I think the portions sizes are too big or too small (don’t know why this triggers me)",
      "created_utc": 1619179292.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gvkbzer",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1619184855.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gvkevj6",
      "author": "decaying-in-my-room",
      "body": "As a teen girl with an eating disorder, the best you can do is be there for her and listen. By coming to this subreddit i can already tell that you must care about her. Be sure to be calm and kind when talking to your daughter about her anorexia. If she’s struggling to open up or lashes out on you, be patient because even if she’s moody now, she’ll thank you for caring so much about her when she’s older and recovered.",
      "created_utc": 1619186274.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gvm1bj9",
      "author": "petewentz-from-mcr",
      "body": "My parents trained me to have anorexia, like I have been obsessed with not gaining weight for as long as I can remember, like years before I learned what calories were in 5th grade health class. That being said, I only have “don’ts” to share.\n\nDon’t force her to eat. After I was diagnosed at 15, my parents would sit and watch me eat and not let me get up until I cleaned my plate. All that did was lead to me throwing it up, and it made me feel more panicked.\n\nDon’t ever comment about anything at all in terms of nutrition facts. Never do it. When I was 22 I bought myself instant breakfast when I was trying to stop losing weight because my brain decided that beverages didn’t count. My dad walked by and went “oh my god, do you have any idea how much sugar is in that?!” It’s been almost 2 years and I haven’t touched it since. The idea of it makes me cry. There are a million examples of this, but it always gets under your skin and you remember it forever. A passing comment for you about food content can easily become an obsessive fear for your child with this illness. \n\nDon’t comment on her body at all. “You look so much healthier!” means “You’re weight gain is super obvious. You look fat and disgusting. You need to stop.” But also, “You’re too thin!” means “Thank fuck, it’s working. I can’t stop now.” Like this is a mental illness and brains will do literally anything to make a comment about weight feed into the disorder. My parents never did this, they said things like “oh good you’ve lost weight. Don’t gain it back.” To be clear, they’d say it when I was underweight. But that one is more obviously bad, so I used examples that people in town have told me instead.\n\nDon’t comment on anyone else’s bodies, not even your own. My dad is fatphobic and would mock random people on the street, and like now I just think everyone thinks those things but like only about me. My mom would grab at her stomach in the mirror and tell me how much she hated it and how disgusting she felt, even when I was like 6. There wasn’t anything wrong with her stomach, at least not to me. If her healthy stomach was disgusting, what did that mean about mine?? I had bad body dysmorphia, and I thought my stomach was much larger than hers. When I was 12 my dad came to me and instructed me to manipulate my mom into running on the treadmill because if she didn’t start losing weight now she’d just keep gaining it. She’d had a baby 3-4 months prior to this convo. He at least tried to pretend to care about her health, so even if we pretend I believed him, telling me he wants me to help her because he loves her told me that nobody loves you if you’re even a little overweight. It’s a mental disorder, your brain makes weird shit up. If you talk about weight, your brain will find a way to make it motivate you to restrict. \n\nDon’t accuse her of throwing up if she’s not. It’s just hurtful and offensive. Then you think oh if they thought I was throwing up it’s because I’m eating too much and should be throwing up, so then you feel like you have to. \n\nDon’t lie to her about her body. People around town like to lie about my body. They’ll comment on it and I’ll say I have anorexia and am Xlbs underweight, and comments about my body make it harder to make healthy choices. Then they’ll try to lie. Obviously telling me I look healthy and just fine when I can see most of my bones is a bad idea. You might want to help her feel better about her appearance, but definitely never lie. If you have body dysmorphia you almost have to believe the people around you, and when they’re lying it can seriously mess with your concept of reality.\n\nDon’t make her feel guilty. My sister used to buy me high-calorie things and give me a deadline I had to eat it by. I felt guilty that she spent money on me and I knew I’d disappoint her if I didn’t eat it, but it just led to me shamefully eating it as fast as I could while I cried. At the time I thought it was nice because it was the only time anyone had ever cared enough to want me to try to do better. I wouldn’t actually wish that on anyone else, though. \n\nDon’t tell anyone. I know you might want to talk to your own parents, but please don’t. When mine did that it made it super uncomfortable to talk to my grandma and aunt who I’d been close with, and it’s taken me nigh on a decade to try to get past that. People treat you different, even when they mean well. You can tell if someone told them. Feeling like everyone knew just made me feel extremely ashamed and exposed. It also felt like my parents betrayed me. \n\n\nSorry for the long comment. I tried to explain why I chose each of the points I made because like they don’t make a ton of sense without the background of what the disorder hears and tells you. I can’t say it’s all universal, but I know at least some of it is. You can also hear about it on YouTube, just search something like what anorexics want their parents to know. I think I’ve seen a few videos listed under that premise",
      "created_utc": 1619212148.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gvkvsvk",
      "author": "LawrenAnne4",
      "body": "The biggest thing my parents did that was unbelievably helpful when I was diagnosed as a teenager was sit in on a few sessions with my dietician and therapist with me. It gave me a chance to vent and get my feelings out in a supported environment, and gave my parents a chance to ask questions without running the risk of triggering me. We were able to get relatively on the same page re my meal plans/treatment and from that point on they had more insight into my disorder and what I was going through. \n\nPsychoeducation is so important, and you’re already doing your part by starting to reach out and ask for resources/support. I’d recommend checking out neda.org or other known ED support resources for information into her diagnosis.\n\nAdditionally, there are support groups online for parents of individuals with eating disorders- being a part of a community of others going through what you are might offer some comfort or insight into what you’re going to be experiencing as a primary supporter of someone with an ED diagnosis. (https://www.feast-ed.org is a great resource for parents and families, albeit with a terrible name lol)\n\nIt may be a rough road ahead but your daughter is fortunate to have a parent who is willing to learn and grow with her.",
      "created_utc": 1619193734.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gvkfokv",
      "author": "OhCrumbs96",
      "body": "Please, I urge you, go onto the FEAST website and join the Around the Dinner Table forum there. It is for parents and caregivers of ED sufferers and they'll be able to offer you far more appropriate support than you're likely to get from us here.  They're an incredibly experienced group of people and they'll be able to empower and support you to help your daughter get through this.",
      "created_utc": 1619186660.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gvkxmu4",
      "author": "funsized_",
      "body": "THIS IS HOW MY FATHER HELPED ME!!!\n\nI was never diagnosed with anorexia, but at one point I was down to eating only 10 foods. (Not good)\n\nThis was at a point in my life when I wanted to change. \n\nMy father never addressed I had an eating problem, but instead he would take me out to dinner and would help me realize that a little bit of something wouldn’t hurt me! He started first taking me to sushi places (because I have always loved sushi and it was deemed “healthy” to me in my head. Even though it was a fear food) \n\nHe would always take the first bite and tell me just try some (he would not push though). He made me realize that I can still enjoy my life and have fun even if I was not “happy” with how my body looked. And he never encouraged me to eat more, he would just be there to try those foods with me and help me realize that they were not scary and that I wasn’t going to get fat from eating them. \n\nBe patient, be there for her, BE KIND TO HER.",
      "created_utc": 1619194528.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gvkqd3v",
      "author": "on_a_downward_spiral",
      "body": "Don’t ever tell her she looks disgusting",
      "created_utc": 1619191389.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gvlejsb",
      "author": "pinti09",
      "body": "An advice I could give you is to have ptience, because you have a long road ahead of you. At the beggining my parents would always said things that made it worse, but I think it was because they did not know what to do in order to help. They would tell me I was crazy in order to think I was fat, thay I looked just fine, thay I was too skinny and needed to eat more. I did start going to therapy and after my therapist talked to them they changed their attitude towards my illness. They never mentioned anything related to my weight anymlre anD instead of getting frustrated because I couldnt bring myself to eat, they would tell me it was ok, that I did not needed to eat if I wasnt comfortable and then they would put my plate back in the fridge just in case. Everytime I had a food related meltdown they would tell me I was strong and thay they knew I would make it through any challenge. They were just amazing. I am not gonna tell you that it made my eating disorder go away, but feeling understood and loved like that did make me love myself a little bit more. And for me that was A LOT.",
      "created_utc": 1619201839.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvliwnh",
      "author": "vicki_toria13",
      "body": "I would advise to be careful about “interventions”. My family did this the day before thanksgiving years ago and my mom had my aunt and uncle ambush me telling me I “looked sick”, they were worried, they demanded to know what was wrong with me etc. It was a very jarring and painful experience and did absolutely nothing to help my disorder. All it did was create distrust. \n\nInterventions may work for some but may also just create distrust. At least it did for me. \n\nStay strong! Wishing you and your daughter the best.",
      "created_utc": 1619203775.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvm79x2",
      "author": "Cherryberrybean",
      "body": "I'm a woman in my 40s that suffered from anorexia and bulimia since I was around 17. I recovered 2 years ago. It has been a long road. Things that are not helpful-talking about how good I look, or how bad. Anything to do with size or weight. Anything to do with how I'm feeling or looking has usually been misconstrued into something bad by my anorexia.\n Things that are good: commenting on her ability to do something  unrelated to food, weight or looks well. For me, I do paint by numbers. It's silly and I enjoy it. My mom used to tell me how creative I was and that she loved the way I used the colours. We also used to play board games like scrabble together, which I usually won. Animals helped. My dog was one of the reasons I kept going in recovery, to make sure I was around long enough to see him grow. I'd strongly recommend watching Tabitha Farrar on YouTube. She also had anorexia for over 10 years and cured herself. Her vids are one of the only reasons I recovered. She speaks in a no bs kind of way, is very relatable and talks about a huge variety of things that most people with anorexia do. It's really amazing that you are looking to help her.",
      "created_utc": 1619215028.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvkd7g8",
      "author": "icedcoffee16",
      "body": "I would recommending reading “Life without Ed” by jenni Schaefer. It really helped my mom understand the two different thought processes that people with eating disorders have. It’s especially beneficial in helping people distinguish between their eating disorder (i.e. Ed) voice and their own voice.",
      "created_utc": 1619185467.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvkq8ma",
      "author": "empanada_de_queso",
      "body": "NEVER comment on anyone’s body. My mom thought she was so good at this, she never said a bad thing about me, super sweet, you’re the most beautiful daughter in the world. But she did comment on everyone else’s bodies, including her own. Right now she’s going on and on about gaining weight because of the pandemic, and it’s so preposterous. She has a normal BMI and *trigger warning: numbers* she maintains that a woman must weigh ten less than her height (metric system). So, I’m 1.60 and I’m supposed to weigh 50 kilos, but I weigh 55, and all my ribs are visible and my BMI is 21. She has such a distorted view of these things and it’s because she never bothered to educate herself on the subject, she just regurgitates dated advice from women’s magazines and, since she never comments about my body, thinks it never had any role in my anorexia. So, stop commenting on anyone’s body, not commenting on your daughter’s isn’t enough.\n\nAnd it’s great that you’re asking these questions, props to you on being a concerned mom the right way.",
      "created_utc": 1619191336.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gvly75h",
      "author": "lleahik",
      "body": "Things my parents have done that made it worse: commenting on their own or other people’s body’s, in any way. It might just be a passing comment but the ED latches onto it and says “they only like people for their body’s and your fat and disgusting so they don’t love you anymore” it’s messed up but EDs really have no logic. Also whenever my mom told me or other people how I had ‘really bad restrictive anorexia’ it would trigger me so much because I felt like I wasn’t as sick as she thought and therefore not sick enough to recover. Also try not to force her to eat particular foods/ a certain way, or always say she’s not recovered enough when she’s trying. It’s a process and it won’t happen right away but if her efforts never seem to be enough it’s feel like there’s no point in trying.\n\nThings that helped: letting me have foods that I like, you can’t only eat the foods that your comfortable with but eating itself can be really stressful so it’s nice if the food isn’t always something new/scary. Also being open to listen and not judging the things she’s struggling with because they probably won’t always make sense, or it will seem like a ridiculous thing to be worried about but the ED makes it very real. I do t know what your home situation is but is more than one parent/guardian is involved in recovery it’s best to have a united approach so it’s less uncertain, which can lead to feeling like you need to control things (eg. Ed behaviors).\n\nI wish my parents would have done this because sometimes the advice you get from real people is way better that what doctors will tell you from their textbooks. Also always remember that she loves you even if she yells at you because so speaking from experience she might get mad at you for ‘forcing’ her to recover but she does love you. I hope this helps and making this effort is honestly already way better than most parents do.",
      "created_utc": 1619210714.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvlyq7u",
      "author": "Glitter_Cunt",
      "body": "Get her into treatment. I’m in my 30s and have been struggling with anorexia since I was at least 11 or 12. My BMI was as low as 12. My parents have never acknowledged it. Early treatment and intervention is key to any kind of recovery. Letting her know that you’re aware of what’s going on and you’re worried about her and making sure she has access to some kind of appropriate treatment team (whether that’s a therapist or inpatient care or whatever is appropriate for her) could make such a difference. It would have made such a difference for me",
      "created_utc": 1619210959.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gvlinri",
      "author": "None",
      "body": "My answers are looking back at my life so they may be useless to you or anyone else, but could have saved me so much pain in my life.\n\nThis comes from a need to tightly control something - are there some things that are very out of her control, but within your control, that are causing her pain?\n\nDoes she play any sports?  A lot of good coaches and programs push and sometimes even require a healthy diet.  (I don’t mean a weight loss program..  I mean a balanced diet)\n\nAlso I would challenge her to research her basal metabolic rate to find out what her body needs to sustain itself, and why. Tell her that if it’s eye opening in any way, she should write what she got from it and share it to tweens and other anorexic teens.  Being involved in the prevention is a great feeling and gets you thinking..\n\nDoes she art?  I art a lot.   If she does, ask her to show you what it feels like.  Listen when she explains it.  Be present and feel what she shows you.\n\nIf she isn’t an artist, or an athlete or a writer, then just tell your daughter than you’re there.  She isn’t alone.  You’ll never judge her, but that you’ll help her make any positive changes she wants to make when she’s ready.  And prepared for a battle with this disorder.  It’s a scary mother fucker.",
      "created_utc": 1619203664.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gvnuffk",
      "author": "match-a-girl",
      "body": "First of all: it is very nice that you want to help. \nLet me tell my story shortly so you can reflect reading it.\nMy genes and my mothers cooking skills suck. When I reached 13-14 years I was a LITTLE fat. Maybe chubby. Still wearing L size pants so not being extremely obese. My parents went insane about how I not should eat another bread, which exercises should I do to lose weight while they were also fatty. We never made sport together we only sat at home eating deep fried meals. \nSo here we are, 3 years later I fell in love with a dude. He was attracted to me too but once he said he can’t be with me because I don’t look good tho I have a beautiful face and a great personality. That’s when it clicked. Months later when I lost 10-15 kgs mother said you are too skinny, you’re a skeleton, no one will ever like you etc. For some reason I went furious and said: nothing is good enough for you! When I was fat you said I’m too fat. Now I’m skinny you can only say I’m too skinny. I can never be good enough for you so I give up, you should decide what tf you want from me” and went out. \nNever talked about this but then she just gave me some space and peace. That was everything she could do to me.\nShe also said “I have a strong mind” and “I do everything I set my mind to” \nYes because I’m sick, it’s a real mental illness, I do NOT want to disgusted by my own body!\nTalk to her, if she wants, and if she not, and she isn’t in danger, just tell her you love her.",
      "created_utc": 1619253383.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gvlfp1m",
      "author": "I_hate_me_lol",
      "body": "don't comment on her weight. please.\n\nor how her body looks.\n\ndon't say, \"just eat\" \n\nit's not easy for us even though it may be for you.\n\nif she wants to eat more than what's on her meal plan, let her. don't comment \"wow that's so much\" \"are you sure you're that hungry?\"\n\netc. that ruined me when my parents said that. \n\njust be supportive and help her through it. good luck!",
      "created_utc": 1619202337.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gvlgt8t",
      "author": "None",
      "body": "I’d say don’t talk negatively about food or body/body image at all, whether it’s her’s or yours or anyone else’s (and actually, don’t mention how her body looks at all... many parents will comment on how much healthier their child looks once they’ve gained weight because that should be a good thing, however, in our minds that just sounds like “oh look how fat you’ve gotten!” The disorder will make every comment into an insult). Definitely don’t talk about dieting/not eating something because it’s “bad” etc. Just supporting her, searching for resources that could help her, scheduling appointments, and being there for her to talk about anything will probably be extremely helpful! Also there will be a point in recovery where she will probably be insatiably hungry (called extreme hunger), when that time comes it may be helpful to reassure her that this is normal and she needs to eat all that she can! Good luck to you and to her<3",
      "created_utc": 1619202839.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gvnyb0f",
      "author": "lunapinksky",
      "body": "Please encourage her to eat and praise her when she eats. My mum doesn’t do this it makes it so much harder and makes me feel so alone when I see other parents helping their children. Also just being patient and even though it can be hard don’t start screaming and calmly express how you feel because I feel like communicating is so important\nGood luck I wish the best for you and your daughter :)",
      "created_utc": 1619257331.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gvz74c2",
      "author": "Hexoplanet",
      "body": "My mom would take me on day trips on Saturdays just to spend time with me. She wouldn’t press me to eat and just loved me hard. My dad would make comments about me being a skeleton and It made things a lot worse. I hope everything gets better with your daughter.",
      "created_utc": 1619472017.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gvlhnpo",
      "author": "BlovesCat",
      "body": "This needs to be higher up.",
      "created_utc": 1619203214.0,
      "score": 9,
      "context": [
        {
          "id": "gvkohzi",
          "author": "Yola-tilapias",
          "body": "OP if you really want to help your daughter you need to understand what you’re dealing with. \n\nThis isn’t an eating disorder per se, it’s a maladaptive coping mechanism for stress and trauma. \n\nPeople feel that there’s so much stress or pressure that they can’t control that their mind carves out an area that they can control, what they eat. \n\nWhen they “master” eating, they’re able to ignore the real stressors and pressure they’re under. \n\nSo if you want to support your daughter you need to get to the bottom of what she’s so stressed out over. \n\n\nIs it internal pressure? \n\nFamily expectations for success?\n\nKeeping up with her friends and their accomplishments?\n\nBecause if you don’t figure out the underlying stressors, and safer ways to handle that stress, it’ll be very hard to beat this.",
          "created_utc": 1619190583.0
        }
      ]
    },
    {
      "id": "gvn91l8",
      "author": "None",
      "body": "Take my poor person's gold 🏅",
      "created_utc": 1619235869.0,
      "score": 2,
      "context": [
        {
          "id": "gvkohzi",
          "author": "Yola-tilapias",
          "body": "OP if you really want to help your daughter you need to understand what you’re dealing with. \n\nThis isn’t an eating disorder per se, it’s a maladaptive coping mechanism for stress and trauma. \n\nPeople feel that there’s so much stress or pressure that they can’t control that their mind carves out an area that they can control, what they eat. \n\nWhen they “master” eating, they’re able to ignore the real stressors and pressure they’re under. \n\nSo if you want to support your daughter you need to get to the bottom of what she’s so stressed out over. \n\n\nIs it internal pressure? \n\nFamily expectations for success?\n\nKeeping up with her friends and their accomplishments?\n\nBecause if you don’t figure out the underlying stressors, and safer ways to handle that stress, it’ll be very hard to beat this.",
          "created_utc": 1619190583.0
        }
      ]
    },
    {
      "id": "gvkd88z",
      "author": "muushugaipan",
      "body": "Seconding this, as another person in their 30s.  Understanding that sometimes AN can become very entwined with identity could also be helpful.\n\nBe prepared for volatile moods once she starts working through the underlying issues that she's managing and masking with behaviors.  This is not only normal, it is necessary for her to address the root cause because ED's of any kind are usually - not always - indicative of a deeper problem: anxiety, trauma, low self-esteem, etc.  Not saying she has all or any of these, just be prepared for the possibility of something more than just wanting to be thin.",
      "created_utc": 1619185478.0,
      "score": 9,
      "context": [
        {
          "id": "gvkbzer",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1619184855.0
        }
      ]
    },
    {
      "id": "gvm7lbm",
      "author": "Cherryberrybean",
      "body": "All of this I so wholeheartedly agree with. Wonderful advice.",
      "created_utc": 1619215180.0,
      "score": 4,
      "context": [
        {
          "id": "gvm1bj9",
          "author": "petewentz-from-mcr",
          "body": "My parents trained me to have anorexia, like I have been obsessed with not gaining weight for as long as I can remember, like years before I learned what calories were in 5th grade health class. That being said, I only have “don’ts” to share.\n\nDon’t force her to eat. After I was diagnosed at 15, my parents would sit and watch me eat and not let me get up until I cleaned my plate. All that did was lead to me throwing it up, and it made me feel more panicked.\n\nDon’t ever comment about anything at all in terms of nutrition facts. Never do it. When I was 22 I bought myself instant breakfast when I was trying to stop losing weight because my brain decided that beverages didn’t count. My dad walked by and went “oh my god, do you have any idea how much sugar is in that?!” It’s been almost 2 years and I haven’t touched it since. The idea of it makes me cry. There are a million examples of this, but it always gets under your skin and you remember it forever. A passing comment for you about food content can easily become an obsessive fear for your child with this illness. \n\nDon’t comment on her body at all. “You look so much healthier!” means “You’re weight gain is super obvious. You look fat and disgusting. You need to stop.” But also, “You’re too thin!” means “Thank fuck, it’s working. I can’t stop now.” Like this is a mental illness and brains will do literally anything to make a comment about weight feed into the disorder. My parents never did this, they said things like “oh good you’ve lost weight. Don’t gain it back.” To be clear, they’d say it when I was underweight. But that one is more obviously bad, so I used examples that people in town have told me instead.\n\nDon’t comment on anyone else’s bodies, not even your own. My dad is fatphobic and would mock random people on the street, and like now I just think everyone thinks those things but like only about me. My mom would grab at her stomach in the mirror and tell me how much she hated it and how disgusting she felt, even when I was like 6. There wasn’t anything wrong with her stomach, at least not to me. If her healthy stomach was disgusting, what did that mean about mine?? I had bad body dysmorphia, and I thought my stomach was much larger than hers. When I was 12 my dad came to me and instructed me to manipulate my mom into running on the treadmill because if she didn’t start losing weight now she’d just keep gaining it. She’d had a baby 3-4 months prior to this convo. He at least tried to pretend to care about her health, so even if we pretend I believed him, telling me he wants me to help her because he loves her told me that nobody loves you if you’re even a little overweight. It’s a mental disorder, your brain makes weird shit up. If you talk about weight, your brain will find a way to make it motivate you to restrict. \n\nDon’t accuse her of throwing up if she’s not. It’s just hurtful and offensive. Then you think oh if they thought I was throwing up it’s because I’m eating too much and should be throwing up, so then you feel like you have to. \n\nDon’t lie to her about her body. People around town like to lie about my body. They’ll comment on it and I’ll say I have anorexia and am Xlbs underweight, and comments about my body make it harder to make healthy choices. Then they’ll try to lie. Obviously telling me I look healthy and just fine when I can see most of my bones is a bad idea. You might want to help her feel better about her appearance, but definitely never lie. If you have body dysmorphia you almost have to believe the people around you, and when they’re lying it can seriously mess with your concept of reality.\n\nDon’t make her feel guilty. My sister used to buy me high-calorie things and give me a deadline I had to eat it by. I felt guilty that she spent money on me and I knew I’d disappoint her if I didn’t eat it, but it just led to me shamefully eating it as fast as I could while I cried. At the time I thought it was nice because it was the only time anyone had ever cared enough to want me to try to do better. I wouldn’t actually wish that on anyone else, though. \n\nDon’t tell anyone. I know you might want to talk to your own parents, but please don’t. When mine did that it made it super uncomfortable to talk to my grandma and aunt who I’d been close with, and it’s taken me nigh on a decade to try to get past that. People treat you different, even when they mean well. You can tell if someone told them. Feeling like everyone knew just made me feel extremely ashamed and exposed. It also felt like my parents betrayed me. \n\n\nSorry for the long comment. I tried to explain why I chose each of the points I made because like they don’t make a ton of sense without the background of what the disorder hears and tells you. I can’t say it’s all universal, but I know at least some of it is. You can also hear about it on YouTube, just search something like what anorexics want their parents to know. I think I’ve seen a few videos listed under that premise",
          "created_utc": 1619212148.0
        }
      ]
    },
    {
      "id": "gvr0qwi",
      "author": "on_a_downward_spiral",
      "body": "I thought this would be common sense and also general decency but a lot of people lack those so :3",
      "created_utc": 1619298698.0,
      "score": 1,
      "context": [
        {
          "id": "gvkqd3v",
          "author": "on_a_downward_spiral",
          "body": "Don’t ever tell her she looks disgusting",
          "created_utc": 1619191389.0
        }
      ]
    }
  ]
}