{
  "id": "mx8gbq",
  "subreddit": "AnorexiaNervosa",
  "author": "LastBreath808",
  "created_utc": 1619222593.0,
  "title": "It’s been a year since I got over the worst of my eating disorder. Recently it hit me that I still bear resentment towards my friends/ family for never noticing (+ my life story I guess)",
  "selftext": "Or perhaps even against humanity in general. Or maybe, I’m just frustrated that emotional pain is reserved to the individual. No one ever knows how you truly feel or how deeply you are hurt. \n\nI’ve been depressed for the majority of my life. Once I got out of it I went straight back in with an eating disorder on top of it, no one ever reached out to me, or comforted me when I needed it the most. I was below essential fat%, looking back on pictures I was visibly very sick.\nAfter I recovered a friend told me they and everyone else noticed but just didn’t say anything. It lasted over a year, and no one ever reached out. \n\nIt felt like it was all in my head, the part of me that still wanted to live thought that surely someone would say something or stop me before I would drop dead. I got worse, and worse. My heartbeat started hitting the lower 30’s, I’d go to sleep every night terrified I wouldn’t wake up. Just laying down on my side would bruise my knees, I had red marks on my inner thighs from repeatedly burning them with a rubber flask filled with hot water to keep myself warm. (Went to the doctor with it, he said I might need laser treatment but luckily it faded) To this day, after making a near full recovery I still throw up randomly sometimes and have chronic hiccups that can get very painful. The worst part of it being the near constant reminder  that I did something my body can’t forgive\n\nI have a history of mental illness, my parents both knew that. My friends all knew that. I simply can’t comprehend why no one reached out, no one attempted to talk some sense into me or show compassion. It was just me. Even looking back now with my life together, it is absurd that there never once was anyone despite me occasionally reaching out myself. \n\nOn a winter day during the bike home from school I simply broke down. Somewhere something in me realized I wasn’t going to be saved by anyone, it was like a survival instinct almost. The next month felt like one big reflex, I started exercising like crazy and eating much more. If only I could tell you I magically regained my senses and got better but sadly not. I went from anorexia to bulimia, both through excessive exercise and puking and lost even more weight. \n\nMy stepdad would mock me for eating so much, \nI would make half a salad bowl full of oatmeal after school and hide in the bathroom to eat it, that went on for weeks. Honestly it felt like the world just wanted me dead. It felt like apart of me wanted me dead. Writing about this feels absurd, I haven’t thought about this for so long. I’m quite disassociated from this entire chapter of my life, it almost doesn’t even feel like my story anymore \n\nAfter half a year of bulimia I became ecstatic about slowly regaining my strength. I did a lot of weight training and track sports, I slowly eased into allowing myself to eat more but would still throw up if I ate anything unhealthy. Over the course of a few months I slowly got better, and eventually got where I am today. \n\nI’ve been running from acknowledging this part of me for awhile now. To this day I haven’t spoken about it with my parents, despite my bond with them having improved significantly. Only 2 of my friends know the gist of it, and I don’t see them often. \n\nIt feels scary now that i could be so horrible to myself, and even endanger my own wellbeing to that extent. I wish someone would have cared, I wish I would’ve had a shoulder to cry on, or someone to slap some sense into me. \nThis could have meant the end for me, it feels horrible that in the end I could only rely on myself, even when I felt I had lost myself, and for that I honestly still hold a grudge. \n\nNot much that can be done there I suppose. I do know that I want to remember this pain in order to be compassionate towards others where others have failed me. No one should have to face a darkness like that by themselves. One act of kindness would have changed my world, I can’t conceal that this experience turnt me bitter, however hopefully it will also lead me to an act of kindness that might change someone else’s world for the better",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/mx8gbq/its_been_a_year_since_i_got_over_the_worst_of_my/",
  "score": 130,
  "num_comments": 9,
  "comments": [
    {
      "id": "gvndhrs",
      "author": "None",
      "body": "Your story is so familiar to my own in some ways. \nIt was a sad comfort seeing someone else has gone through the same sort of thing. It reminds me it wasn't personal, people just have no idea how to reach out to those visibly (or invisibly) hurting, and it causes so much more damage.\n\nYou were sick, you weren't making it up. People are so awkward and would rather avoid until it's far too late. \n\nI'm so sorry you've suffered so much. Sending some love your way.\nThank you for sharing your tale.",
      "created_utc": 1619238777.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gvoowqh",
      "author": "nanitrim",
      "body": "I had the same thing happen and it makes me sad that you had to experience it :( like i lived with people who noticed my eating habits and that i was losing weight and just decided to start referring to me as \"the alien\" and aweing and my lack of eating rather than even just being like \"are you ok?\"\n\nMakes no sense to me..",
      "created_utc": 1619267470.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvxo7e8",
      "author": "None",
      "body": "\"One act of kindness would have changed my world,\"\n\nThanks so much for sharing all of this. I read and relate to a lot of it. That thing you describe in a comment about how the world just kept going so casually is something I've experienced many times, after someone I love has died too. It seems to strange how my world can be in such crushing agony or has been turned upside down but everything and everyone else just goes on. But now it comforts me, that it's consistent like that lol. Life doesn't continue despite us, life continues with us, it's us who feel disconnected from it. \n\nTruly though, all it would've taken when i was younger was one person to take an interest in me and care. It's an awful feeling thinking you're supposed to have people who will help you and realizing you have to be the one to save your own life when you're the one who's sick in the first place. Even in me the survival instincts kept kicking in lol but i definitely pushed it very close to that line of death. I'm still disordered and still no one ever says a word except my therapist. I was never expecting to be saved but neglect is something else entirely. \n\nI became very bitter. Now, my main goal is to dissolve this anger and bitterness. Being as bitter as I am, it feels like holding my breath and I've been holding it so long and now I'm just ready to breathe. Forgiveness really is for us, not anyone else, though i know if i forgive my parents we'll have a better relationship, and i love them so i think it's about time. Its a process anyway.\n\nIt just really shows how much impact even the smallest kindnesses can do for each other. Even you writing this helped me. Thank you. I would like to get to the point where i can spend my life finding ways to help other people or nature in small ways. \n\nI always dissociated from the tough times of my life and now trying to integrate them is strange. Like how do i go on normally knowing these things happened? I think the answer for me is to not try to go on \"normally.\" To acknowledge what they've changed in me good or bad and take the parts i need with me and let the rest go. I have tattoos and they help me, because they're the only thing physically in the world that say, \"yea this happened, u survived, you're still here bro\" lol\n\nSorry i ramble a lot, I'm not even fully sure what i was trying to say. You're really good at writing by the way",
      "created_utc": 1619448551.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvovzwv",
      "author": "LastBreath808",
      "body": "Thank you for this response. Sadly enough I think you’re right when you say people would rather avoid it. Half a year ago my mom told me that she didn’t think I would ever get better. She had given up on me. \n\nWith that she implied that she knew damn well how far gone I was. Did she ever once sit me down to ask what was going on, nope. \n\nI’m glad you could relate to my experience, it made me feel a little less alone and I hope it did the same for you. It’s a sad thing to have in common. It feels weird to even go about my day casually knowing that I carry this past on my shoulders. \n\nIt’s strange that when you feel like every day is your breaking point, to the point you think space will probably collapse in on itself if you are crushed any further. But the days just keep passing, bringing the slur of time with it that makes all of it feel mundane \n\nI’m dissociative and have partial memory loss, This is the first time I vividly felt these emotions since they where inflicted. Wasn’t pleasant remembering this, but I guess it’s about time I face it. I’m just being melancholic right now so sorry about the word vomit \n\nThank you for your message, hopefully things get better for you",
      "created_utc": 1619269559.0,
      "score": 5,
      "context": [
        {
          "id": "gvndhrs",
          "author": "None",
          "body": "Your story is so familiar to my own in some ways. \nIt was a sad comfort seeing someone else has gone through the same sort of thing. It reminds me it wasn't personal, people just have no idea how to reach out to those visibly (or invisibly) hurting, and it causes so much more damage.\n\nYou were sick, you weren't making it up. People are so awkward and would rather avoid until it's far too late. \n\nI'm so sorry you've suffered so much. Sending some love your way.\nThank you for sharing your tale.",
          "created_utc": 1619238777.0
        }
      ]
    },
    {
      "id": "gvoz1ma",
      "author": "LastBreath808",
      "body": "People can be horrible, I’m sorry that you have to deal with that. I read your post on only feeling happy when you lose weight, and I had the same thing. I would go as far as that I tricked myself into believing that it was my purpose, that it would give me everything I wanted. Really just because losing weight is much more straightforward than actually finding a purpose in life (not that you even really need one). \n\nwhat makes you happy isn’t a consistent thing. Even it if currently is losing weight, you aren’t stuck like that forever. It’s similar to diets ironically. If you are used to eating fast food you will enjoy it, if you are used to eating healthy food you are less likely to enjoy it.\n\nYou can change. The way you view life can change, and the way you view yourself can change. If you malnourish yourself you will change the way your brain works for the worse, it makes you mentally weak. You suffer more, you are less resilient. The slightest discomfort can feel agonizing, and maybe you will eventually find yourself not feeling like a person anymore \n\nI wish someone had told me that",
      "created_utc": 1619270400.0,
      "score": 4,
      "context": [
        {
          "id": "gvoowqh",
          "author": "nanitrim",
          "body": "I had the same thing happen and it makes me sad that you had to experience it :( like i lived with people who noticed my eating habits and that i was losing weight and just decided to start referring to me as \"the alien\" and aweing and my lack of eating rather than even just being like \"are you ok?\"\n\nMakes no sense to me..",
          "created_utc": 1619267470.0
        }
      ]
    },
    {
      "id": "gwma8iu",
      "author": "LastBreath808",
      "body": "Sorry it took me awhile to reply \n\nIt is the absolute neutrality of the world. Even we ourselves normalize over time and begin to look at the most twisted things as mundane. It made me understand how easy it is to lose yourself, and perhaps the only way to stay yourself is to change constantly. \n\nIt’s the same for me. I’ve never had the feeling that anyone felt genuinely and intimately concerned with what I was going through.\nI can’t help but envy relationships between people that get emotional when the other is hurting. I’ve done that for others countless times and yet it is never reciprocated, almost like it’s a curse. \n\n‘I was never expecting to be saved but neglected is something else entirely’\n\nI feel exactly the same way. I even went to our school nurse once during the time I was scared I would die in my sleep, I think I even told her about my very low heart rate. She acted dismissive, like she didn’t get what my problem was. She suggested to weigh me and I declined and quickly left. \nI also visited my own doctor when I had my thighs badly burnt, now it seems so strange to me that no one goes like ‘huh, why would you purposely burn your thighs every day’ \nIt is especially that indifference that made me feel like it was all in my head. \n\n‘It feels like I’m holding my breath’ is another brilliant one, that made me pause for a second. It is a very good analogy. I think I consciously forgave my parents, mostly because I didn’t want to rob myself of the good memories I could still make together with them. Though subconsciously I think has changed me in a way I can’t reverse, I can’t go back to the way I used to be. The best I can do is become someone I can respect regardless of the past\nI hope you can patch things up with your parents as well, it is a very difficult thing.\n\nIntegrating them is definitely strange. I’ve been confronting myself quite a lot, I can feel myself resisting. Its overwhelming and exhausting, It makes me feel a stranger to my own body, almost as if I’m a random soul that just stumbled into here like ‘what the f is going on in here’. Like I’m trying to pick up the pieces of something whilst I don’t even know where it shattered.\n\nDon’t apologize for rambling, you’re venting, I’m venting too. I think it’s good for us, It’s a rare occasion for me to feel so many emotions during an interaction. It’s strange how it’s our pain that binds people to each other.  It reminds me of the Hedgehog dilemma if you’ve heard of that.\n\n Thank you for complimenting my writing. I like to write in my free time, I wasn’t expecting to get a comment like that, it means a lot",
      "created_utc": 1619924906.0,
      "score": 2,
      "context": [
        {
          "id": "gvxo7e8",
          "author": "None",
          "body": "\"One act of kindness would have changed my world,\"\n\nThanks so much for sharing all of this. I read and relate to a lot of it. That thing you describe in a comment about how the world just kept going so casually is something I've experienced many times, after someone I love has died too. It seems to strange how my world can be in such crushing agony or has been turned upside down but everything and everyone else just goes on. But now it comforts me, that it's consistent like that lol. Life doesn't continue despite us, life continues with us, it's us who feel disconnected from it. \n\nTruly though, all it would've taken when i was younger was one person to take an interest in me and care. It's an awful feeling thinking you're supposed to have people who will help you and realizing you have to be the one to save your own life when you're the one who's sick in the first place. Even in me the survival instincts kept kicking in lol but i definitely pushed it very close to that line of death. I'm still disordered and still no one ever says a word except my therapist. I was never expecting to be saved but neglect is something else entirely. \n\nI became very bitter. Now, my main goal is to dissolve this anger and bitterness. Being as bitter as I am, it feels like holding my breath and I've been holding it so long and now I'm just ready to breathe. Forgiveness really is for us, not anyone else, though i know if i forgive my parents we'll have a better relationship, and i love them so i think it's about time. Its a process anyway.\n\nIt just really shows how much impact even the smallest kindnesses can do for each other. Even you writing this helped me. Thank you. I would like to get to the point where i can spend my life finding ways to help other people or nature in small ways. \n\nI always dissociated from the tough times of my life and now trying to integrate them is strange. Like how do i go on normally knowing these things happened? I think the answer for me is to not try to go on \"normally.\" To acknowledge what they've changed in me good or bad and take the parts i need with me and let the rest go. I have tattoos and they help me, because they're the only thing physically in the world that say, \"yea this happened, u survived, you're still here bro\" lol\n\nSorry i ramble a lot, I'm not even fully sure what i was trying to say. You're really good at writing by the way",
          "created_utc": 1619448551.0
        }
      ]
    },
    {
      "id": "gvqamax",
      "author": "None",
      "body": "Ah a fellow dissociative! Same (DID/Cptsd). Life really likes to pile on the problems for some folk hey? Sadly it's not as uncommon (dissociative issues, trauma and EDs) as people like to pretend or believe.\n\nI guess in some ways life has gotten better for me.\nI almost ended my life at the start of this year, and the sheer degree of hopelessness I felt gave me the courage to finally admit I was trans and do something about it (Started therapy with a trauma specialist and was approved to start hormones 2 weeks ago 😁 and the waitlist processes for surgery has been started.) I've held myself back from admitting I'm a boy hiding in a girl's body for my entire life. It's like my fear and \"what If I'm just confused / I share my body with women! I can't change it or they'll take on my dysphoria\" excuses and fears lost some of their power and I was able to admit my truth to both myself and people who can help. My system was surprisingly supportive, it's like they were waiting until I could admit this to myself. My worst case scenarios haven't come to pass, it has been strangely better than I could have hoped. I feel love and support from both Inside and Out. I guess I had to finally hit a place where I had nothing left to lose so I could take the risk and made those first appointment(s). \n\nWhile my ED is still there and pretty actively trying to end me, I now have a drive to fight back against it, and stay alive. I get a chance of occupying the right gendered body I should have been born into, now. It's a big help in fighting against the destructive urges when they come up. 😄 I never thought I'd see the day I was approved to start testosterone, and I'm so so greatful I managed to live long enough to have that moment. My road isn't going to be easy, but I've seen more beauty in this world and felt more hope for myself than I think I have in my past 20 years here.",
      "created_utc": 1619285617.0,
      "score": 1,
      "context": [
        {
          "id": "gvndhrs",
          "author": "None",
          "body": "Your story is so familiar to my own in some ways. \nIt was a sad comfort seeing someone else has gone through the same sort of thing. It reminds me it wasn't personal, people just have no idea how to reach out to those visibly (or invisibly) hurting, and it causes so much more damage.\n\nYou were sick, you weren't making it up. People are so awkward and would rather avoid until it's far too late. \n\nI'm so sorry you've suffered so much. Sending some love your way.\nThank you for sharing your tale.",
          "created_utc": 1619238777.0
        },
        {
          "id": "gvovzwv",
          "author": "LastBreath808",
          "body": "Thank you for this response. Sadly enough I think you’re right when you say people would rather avoid it. Half a year ago my mom told me that she didn’t think I would ever get better. She had given up on me. \n\nWith that she implied that she knew damn well how far gone I was. Did she ever once sit me down to ask what was going on, nope. \n\nI’m glad you could relate to my experience, it made me feel a little less alone and I hope it did the same for you. It’s a sad thing to have in common. It feels weird to even go about my day casually knowing that I carry this past on my shoulders. \n\nIt’s strange that when you feel like every day is your breaking point, to the point you think space will probably collapse in on itself if you are crushed any further. But the days just keep passing, bringing the slur of time with it that makes all of it feel mundane \n\nI’m dissociative and have partial memory loss, This is the first time I vividly felt these emotions since they where inflicted. Wasn’t pleasant remembering this, but I guess it’s about time I face it. I’m just being melancholic right now so sorry about the word vomit \n\nThank you for your message, hopefully things get better for you",
          "created_utc": 1619269559.0
        }
      ]
    },
    {
      "id": "gvtjwxy",
      "author": "nanitrim",
      "body": "I appreciate that immensely... thank you <3",
      "created_utc": 1619360970.0,
      "score": 2,
      "context": [
        {
          "id": "gvoowqh",
          "author": "nanitrim",
          "body": "I had the same thing happen and it makes me sad that you had to experience it :( like i lived with people who noticed my eating habits and that i was losing weight and just decided to start referring to me as \"the alien\" and aweing and my lack of eating rather than even just being like \"are you ok?\"\n\nMakes no sense to me..",
          "created_utc": 1619267470.0
        },
        {
          "id": "gvoz1ma",
          "author": "LastBreath808",
          "body": "People can be horrible, I’m sorry that you have to deal with that. I read your post on only feeling happy when you lose weight, and I had the same thing. I would go as far as that I tricked myself into believing that it was my purpose, that it would give me everything I wanted. Really just because losing weight is much more straightforward than actually finding a purpose in life (not that you even really need one). \n\nwhat makes you happy isn’t a consistent thing. Even it if currently is losing weight, you aren’t stuck like that forever. It’s similar to diets ironically. If you are used to eating fast food you will enjoy it, if you are used to eating healthy food you are less likely to enjoy it.\n\nYou can change. The way you view life can change, and the way you view yourself can change. If you malnourish yourself you will change the way your brain works for the worse, it makes you mentally weak. You suffer more, you are less resilient. The slightest discomfort can feel agonizing, and maybe you will eventually find yourself not feeling like a person anymore \n\nI wish someone had told me that",
          "created_utc": 1619270400.0
        }
      ]
    },
    {
      "id": "gwm5gr2",
      "author": "LastBreath808",
      "body": "Sorry it took me awhile to get back to you \n\nI’m not diagnosed with a dissociative disorder, all that I experienced was that my mind would go blank if I tried to recall something from my ED period, about half year worth of time I can still barely recall. It might just be a combination of things since malnutrition of the brain makes it more difficult to create memories. I felt like I should clarify this. \n\nI’m very happy to hear you are taking steps to make your body a home, I hope the transition goes well! I wish for you to see a lifetime of beautiful things and people that will help push you forward",
      "created_utc": 1619922045.0,
      "score": 2,
      "context": [
        {
          "id": "gvndhrs",
          "author": "None",
          "body": "Your story is so familiar to my own in some ways. \nIt was a sad comfort seeing someone else has gone through the same sort of thing. It reminds me it wasn't personal, people just have no idea how to reach out to those visibly (or invisibly) hurting, and it causes so much more damage.\n\nYou were sick, you weren't making it up. People are so awkward and would rather avoid until it's far too late. \n\nI'm so sorry you've suffered so much. Sending some love your way.\nThank you for sharing your tale.",
          "created_utc": 1619238777.0
        },
        {
          "id": "gvovzwv",
          "author": "LastBreath808",
          "body": "Thank you for this response. Sadly enough I think you’re right when you say people would rather avoid it. Half a year ago my mom told me that she didn’t think I would ever get better. She had given up on me. \n\nWith that she implied that she knew damn well how far gone I was. Did she ever once sit me down to ask what was going on, nope. \n\nI’m glad you could relate to my experience, it made me feel a little less alone and I hope it did the same for you. It’s a sad thing to have in common. It feels weird to even go about my day casually knowing that I carry this past on my shoulders. \n\nIt’s strange that when you feel like every day is your breaking point, to the point you think space will probably collapse in on itself if you are crushed any further. But the days just keep passing, bringing the slur of time with it that makes all of it feel mundane \n\nI’m dissociative and have partial memory loss, This is the first time I vividly felt these emotions since they where inflicted. Wasn’t pleasant remembering this, but I guess it’s about time I face it. I’m just being melancholic right now so sorry about the word vomit \n\nThank you for your message, hopefully things get better for you",
          "created_utc": 1619269559.0
        },
        {
          "id": "gvqamax",
          "author": "None",
          "body": "Ah a fellow dissociative! Same (DID/Cptsd). Life really likes to pile on the problems for some folk hey? Sadly it's not as uncommon (dissociative issues, trauma and EDs) as people like to pretend or believe.\n\nI guess in some ways life has gotten better for me.\nI almost ended my life at the start of this year, and the sheer degree of hopelessness I felt gave me the courage to finally admit I was trans and do something about it (Started therapy with a trauma specialist and was approved to start hormones 2 weeks ago 😁 and the waitlist processes for surgery has been started.) I've held myself back from admitting I'm a boy hiding in a girl's body for my entire life. It's like my fear and \"what If I'm just confused / I share my body with women! I can't change it or they'll take on my dysphoria\" excuses and fears lost some of their power and I was able to admit my truth to both myself and people who can help. My system was surprisingly supportive, it's like they were waiting until I could admit this to myself. My worst case scenarios haven't come to pass, it has been strangely better than I could have hoped. I feel love and support from both Inside and Out. I guess I had to finally hit a place where I had nothing left to lose so I could take the risk and made those first appointment(s). \n\nWhile my ED is still there and pretty actively trying to end me, I now have a drive to fight back against it, and stay alive. I get a chance of occupying the right gendered body I should have been born into, now. It's a big help in fighting against the destructive urges when they come up. 😄 I never thought I'd see the day I was approved to start testosterone, and I'm so so greatful I managed to live long enough to have that moment. My road isn't going to be easy, but I've seen more beauty in this world and felt more hope for myself than I think I have in my past 20 years here.",
          "created_utc": 1619285617.0
        }
      ]
    }
  ]
}