{
  "id": "mxp25c",
  "subreddit": "AnorexiaNervosa",
  "author": "sorcerers_apprentice",
  "created_utc": 1619286706.0,
  "title": "I do not have an eating disorder because of \"diet culture.\"",
  "selftext": "I don't think anorexic-me is more attractive. I know nothing in my life will be fixed if I lose more weight, and I don't have any particular goal weight/number that I'm trying to reach. I don't stare at women on Instagram thinking that my life would be better if I had their bodies. *I do not have an eating disorder because of \"diet culture\"* and I'm so fucking tired of that narrative. \n\nIt makes it easy for people to say things like, oh, well, *if you just accepted yourself/your natural body* or *if you just ate intuitively and let yourself enjoy food again* then you could get better. Like I'm killing myself just because I want to ~look hot~ or something. Nothing infuriates me more.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/mxp25c/i_do_not_have_an_eating_disorder_because_of_diet/",
  "score": 197,
  "num_comments": 26,
  "comments": [
    {
      "id": "gvqikl4",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1619289499.0,
      "score": 50,
      "context": []
    },
    {
      "id": "gvqkt3v",
      "author": "caretaker1971",
      "body": "I’m with you. It’s not about body image at all for me. It’s more about control. Started a little over a year ago when a past trauma surfaced out of the blue. My whole body went into lock down. So it makes me feel shallow when people assume it’s about some desire to look like a Victoria’s Secret model. It’s much deeper than that. It’s not some vanity motivated choice.",
      "created_utc": 1619290596.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gvqmph6",
      "author": "annslisaemily",
      "body": "Yes, this makes me so angry. I feel like we hear this more and more lately from people who want to feel important and like they are doing something meaningful, when they are only doing bullshit keyboard warrior stuff. I also feel like it doesn't help that these, frankly, silly explanations and preoccupations easily overshadow the reality behind why most people have eating disorders is because not many of us want to or feel comfortable talking openly in public about it. Like, for one I still don't like most people to know I have an ED much less do I want to talk about using it to cope with the trauma of being physically and sexually abused as a kid. That's the real reason, but I'll sit quiet in the corner while someone makes a first world problem mockery of the whole disease because I don't have the bandwidth to even engage. \n\nBut it makes me mad because I feel like people with no direct knowledge of this then believe that it is inherently vain or frivolous and they don't have much compassion. Also, I feel like some times people think that the experience of having an eating disorder is equivalent to ever having felt bad about your body or struggled with a bad diet. Then they they act like you are *trying* to fail at recovery because you didn't just read about body positivity and decide to change as if it works like that. Like, no.",
      "created_utc": 1619291558.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gvqrgwm",
      "author": "None",
      "body": "I thought it was common knowledge that anorexia etc was about control and not about weight/looks at the end of the day.",
      "created_utc": 1619293999.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gvqui13",
      "author": "icashedin",
      "body": "For me it’s this complex thing, bigger than “looking good for others.” That’s what my boyfriend thinks it is.\nWhen I sit and try to think about it. I hate who I am. I don’t want to “look” a certain way. No.. It is more like I don’t want to look like me. Or be me. I want to disappear. Unless I can be perfect. It’s like if I can maybe just control this one effing thing in my life, I would finally find relief. I would feel that release I have been searching for. Haven’t found it in alcohol. Haven’t found it in pills. But I try to find it in purging, slight binges, and restricting. \nI know I can’t fix what happened in my marriage. I know I can’t change what my father did. But there’s this idea inside me that if I can control what does and doesn’t go into my body...I will be okay. I can try to make myself feel better by getting skinnier and skinnier. I can make myself better by only eating this and not that. I can make myself better by cutting out this many calories for this many days. Because that’s closer to perfect. And if I finally achieve perfection...well the pain will go away.\n\nThat’s what ED means to me.",
      "created_utc": 1619295496.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gvqenm7",
      "author": "ounopooj",
      "body": "Agree completely. Although that’s a factor in a lot of ppls ED’s, it’s not a factor for EVERYONE. Just out of curiosity, what do you think perpetuates your ED? (Ofc don’t answer if personal-all respect).",
      "created_utc": 1619287583.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gvr346u",
      "author": "None",
      "body": "Same. My eating disorder was always about control. I hated myself and didn’t think I deserved food, so I always threw out the lunch my mom packed so that I wouldn’t have anything to eat. There is comfort in shrinking my body. I have never dieted in the real sense of the word. Whenever my depression got worse, my eating disorder would get worse too. Whenever something goes wrong in my life, it’s just a reminder that I am a failure and I hate myself for it and I don’t deserve food. Aside from that, I do believe a skinnier figure is better. I am horrified when I see the weight gain on my mom. I’m horrified that I will end up like her when I become her age. This just makes me restrict more because I want to get ahead of it. When I see fat people, I think to myself “how can you live with yourself? If I looked like you I’d never go out of the house”. I know it’s horrible to think like that but I can’t help it.",
      "created_utc": 1619299909.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gvr6lm6",
      "author": "itsturbulentjuice",
      "body": "Thank you 🙏 \n\nI hate the “diet culture” narrative, it is complete nonsense. I mean I’m sure it applies to someone but I feel like for most of us our complex mental health issues are slightly more nuanced than Barbie dolls and fashion magazines.",
      "created_utc": 1619301705.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gvryun2",
      "author": "pinkie-pie-promise",
      "body": "THANK YOU. I’m SO tired of the “oh I looked at a skinny model once, or someone said that muffins were high in sugar/calories, and now I have a full-blown ED” narrative. Like, it’s not that simple. I don’t want to be skinny to ✨fit into society✨ I want to be skinny bc I was robbed of being taken care of and nurtured as a child. So in my mind, being ridiculously skinny = childlike and therefore someone will care about me and comfort me and be careful and gentle with me.\n\nETA: not to mention I do NOT want to be or feel sexualized. I just want to get rid of every single curve on me and fade into invisibility lol",
      "created_utc": 1619317133.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gvrpctm",
      "author": "None",
      "body": "THANK YOU. I feel like so many people trivialize eds to just disordered eating and general diet culture stuff but like...no...my ed is a constant, overbearing issue in my life and it literally is the only thing I think about every second of every day. It’s hurt my health, taken away relationships with friends and family, taken away my happiness and my ability to study, do active things I used to love because I can’t even stand up without getting dizzy or walk across the room without feeling weak and short of breath. There is nothing *glamorous* about my Ed and it’s certainly not as simple as me being influenced by diet culture and wanting to be skinny. Eds are something we are often genetically predisposed to, they come from deeply rooted issues and it is so damaging to trivialize them to “just diet culture.”",
      "created_utc": 1619311862.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gvrf0b5",
      "author": "AnyoneElse01",
      "body": "Thank you! My restrictive eating habits really have nothing to do with body image (which is in part why I didn't even consider anorexia as a possibility when I was younger, because I thought that I had to care about how I look to actually have an ED), it's really about having something in my life that I can control.",
      "created_utc": 1619306186.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gvrufg3",
      "author": "yogak06",
      "body": "I HAVE BEEN SAYING THIS FOR YEARS!!",
      "created_utc": 1619314611.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gvsrcq3",
      "author": "jjkite",
      "body": "THANK YOU. It pisses me off so much when people insinuate that my problem could be solved if we stopped putting calorie counts on foods and having skinny models in catalogues- my problem will stop when I can cope with my PTSD. Leave the models alone lmao",
      "created_utc": 1619337976.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gvs612c",
      "author": "None",
      "body": "This is the most relatable one I’ve seen on here for me personally, and I’m so sorry you feel this way too. You’re not alone, I care about you.",
      "created_utc": 1619321363.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvsvzca",
      "author": "Wrencer4Endgame",
      "body": "This !! Sometimes my mum is supportive of my struggles, sometimes she's like : \"you just starve to fit into those clothes, you are influenced by the media\" 🙃\n\nOfc we're all, even unconsciously, influenced by the media, but I highly doubt it's that simple. My ED is mostly fueled by my self hatred & a coping mechanism during covid",
      "created_utc": 1619342580.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwvxa00",
      "author": "None",
      "body": "THANK YOU",
      "created_utc": 1620119275.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvqcv5k",
      "author": "hotlinehelpbot",
      "body": "\nIf you or someone you know is contemplating suicide, please reach out. You can find help at a National Suicide Prevention Lifeline\n\nUSA: 18002738255\nUS Crisis textline: 741741 text HOME\n\nUnited Kingdom: 116 123\n\nTrans Lifeline (877-565-8860)\n\nOthers: https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines\n\nhttps://suicidepreventionlifeline.org",
      "created_utc": 1619286719.0,
      "score": -1,
      "context": []
    },
    {
      "id": "gvqpsr9",
      "author": "sorcerers_apprentice",
      "body": "Exactly. I think diet culture creates an environment that makes recovery challenging. And no hate to people who do see it as a major contributor to their ED. But the things I struggle with are so divorced from wanting to look attractive/fit an ideal figure/etc. that it frustrates me when people try to make that point. I'm both glad the post resonated with you and sorry you can relate.",
      "created_utc": 1619293139.0,
      "score": 15,
      "context": [
        {
          "id": "gvqikl4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1619289499.0
        }
      ]
    },
    {
      "id": "gvt22tc",
      "author": "Sea-Smoke-9498",
      "body": "I’d say I agree to, I felt left out. It was like all my family walked out on me and I wanted to see if they care: conclusion is they care when other people are around. At therapy and my meetings it’s all distraught but alone it’s: you ate a lot, keep getting angry, quit wasting everyone’s time, *clothe sizes*..........",
      "created_utc": 1619348415.0,
      "score": 4,
      "context": [
        {
          "id": "gvqikl4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1619289499.0
        }
      ]
    },
    {
      "id": "gvrzwnx",
      "author": "pinkie-pie-promise",
      "body": "Also, it’s SUPER damaging to lead that narrative bc then if somebody comes along who developed an ED due to trauma or to cope with something unrelated to typical beauty standards, they’re either a) gonna think “oh, I don’t have an ed, I’m not starving myself to LOOK good, so I guess I actually DON’T have a problem...” or b) think that nobody will care/believe them about their problem bc it doesn’t follow the “rules” that the media puts on people with EDs.",
      "created_utc": 1619317757.0,
      "score": 5,
      "context": [
        {
          "id": "gvqmph6",
          "author": "annslisaemily",
          "body": "Yes, this makes me so angry. I feel like we hear this more and more lately from people who want to feel important and like they are doing something meaningful, when they are only doing bullshit keyboard warrior stuff. I also feel like it doesn't help that these, frankly, silly explanations and preoccupations easily overshadow the reality behind why most people have eating disorders is because not many of us want to or feel comfortable talking openly in public about it. Like, for one I still don't like most people to know I have an ED much less do I want to talk about using it to cope with the trauma of being physically and sexually abused as a kid. That's the real reason, but I'll sit quiet in the corner while someone makes a first world problem mockery of the whole disease because I don't have the bandwidth to even engage. \n\nBut it makes me mad because I feel like people with no direct knowledge of this then believe that it is inherently vain or frivolous and they don't have much compassion. Also, I feel like some times people think that the experience of having an eating disorder is equivalent to ever having felt bad about your body or struggled with a bad diet. Then they they act like you are *trying* to fail at recovery because you didn't just read about body positivity and decide to change as if it works like that. Like, no.",
          "created_utc": 1619291558.0
        }
      ]
    },
    {
      "id": "gvqrt4c",
      "author": "sorcerers_apprentice",
      "body": "You would think so. But I see so much lately about how recovery is about \"unlearning diet culture\" and \"unpacking internalized fatphobia\" from recovery advocacy groups, influencers, etc. It rubs me the wrong way.",
      "created_utc": 1619294171.0,
      "score": 15,
      "context": [
        {
          "id": "gvqrgwm",
          "author": "None",
          "body": "I thought it was common knowledge that anorexia etc was about control and not about weight/looks at the end of the day.",
          "created_utc": 1619293999.0
        }
      ]
    },
    {
      "id": "gvs0p9u",
      "author": "pinkie-pie-promise",
      "body": "It doesn’t always end up being about control for everyone! I know that can be a common reason, but sometimes people’s EDs do involve weight/looks, HOWEVER. It’s VERY rarely in the “I wanna look pretty like these models :(((( that’s what the boys want :((((((“ way, some people want to change the way they look to DETER them from “typical” beauty standards. I, for one, don’t use my ED as a huge form of control, i feel best when I AM in control, yes, but it’s not the MAIN reason how I developed it. Mine is more of a coping mechanism from unresolved childhood trauma.",
      "created_utc": 1619318222.0,
      "score": 11,
      "context": [
        {
          "id": "gvqrgwm",
          "author": "None",
          "body": "I thought it was common knowledge that anorexia etc was about control and not about weight/looks at the end of the day.",
          "created_utc": 1619293999.0
        }
      ]
    },
    {
      "id": "gvqqoi5",
      "author": "sorcerers_apprentice",
      "body": "Personally: I find that it's first and foremost a coping mechanism. It started when I was younger in response to some chronic physical and mental health issues, then got a lot worse during a time in my life when I was very isolated. Now, it's like my lifeline...a familiar comfort. When I feel shitty about everything else in my life and who I am as a person, I self-soothe by restricting and losing weight. It's also very much a physical thing for me...the hunger high keeps me calm and distracted.",
      "created_utc": 1619293597.0,
      "score": 12,
      "context": [
        {
          "id": "gvqenm7",
          "author": "ounopooj",
          "body": "Agree completely. Although that’s a factor in a lot of ppls ED’s, it’s not a factor for EVERYONE. Just out of curiosity, what do you think perpetuates your ED? (Ofc don’t answer if personal-all respect).",
          "created_utc": 1619287583.0
        }
      ]
    },
    {
      "id": "gvrzwtm",
      "author": "sorcerers_apprentice",
      "body": "> fade into invisibility\n\nYep, this right here.",
      "created_utc": 1619317760.0,
      "score": 4,
      "context": [
        {
          "id": "gvryun2",
          "author": "pinkie-pie-promise",
          "body": "THANK YOU. I’m SO tired of the “oh I looked at a skinny model once, or someone said that muffins were high in sugar/calories, and now I have a full-blown ED” narrative. Like, it’s not that simple. I don’t want to be skinny to ✨fit into society✨ I want to be skinny bc I was robbed of being taken care of and nurtured as a child. So in my mind, being ridiculously skinny = childlike and therefore someone will care about me and comfort me and be careful and gentle with me.\n\nETA: not to mention I do NOT want to be or feel sexualized. I just want to get rid of every single curve on me and fade into invisibility lol",
          "created_utc": 1619317133.0
        }
      ]
    },
    {
      "id": "gvqs4u3",
      "author": "None",
      "body": "Ugh yeah, people who don't actually know much about eds. Not saying that's not helpful for some people with Ed's but most are really rooted in other psychological issues that are representing with a need to control intake/weight/etc",
      "created_utc": 1619294338.0,
      "score": 7,
      "context": [
        {
          "id": "gvqrgwm",
          "author": "None",
          "body": "I thought it was common knowledge that anorexia etc was about control and not about weight/looks at the end of the day.",
          "created_utc": 1619293999.0
        },
        {
          "id": "gvqrt4c",
          "author": "sorcerers_apprentice",
          "body": "You would think so. But I see so much lately about how recovery is about \"unlearning diet culture\" and \"unpacking internalized fatphobia\" from recovery advocacy groups, influencers, etc. It rubs me the wrong way.",
          "created_utc": 1619294171.0
        }
      ]
    },
    {
      "id": "gvs0wkn",
      "author": "None",
      "body": "Oh yes sorry in my other reply to the same person I clarified that no reason is everyone's reasons. But I definitely should have said that above as well!",
      "created_utc": 1619318342.0,
      "score": 5,
      "context": [
        {
          "id": "gvqrgwm",
          "author": "None",
          "body": "I thought it was common knowledge that anorexia etc was about control and not about weight/looks at the end of the day.",
          "created_utc": 1619293999.0
        },
        {
          "id": "gvs0p9u",
          "author": "pinkie-pie-promise",
          "body": "It doesn’t always end up being about control for everyone! I know that can be a common reason, but sometimes people’s EDs do involve weight/looks, HOWEVER. It’s VERY rarely in the “I wanna look pretty like these models :(((( that’s what the boys want :((((((“ way, some people want to change the way they look to DETER them from “typical” beauty standards. I, for one, don’t use my ED as a huge form of control, i feel best when I AM in control, yes, but it’s not the MAIN reason how I developed it. Mine is more of a coping mechanism from unresolved childhood trauma.",
          "created_utc": 1619318222.0
        }
      ]
    },
    {
      "id": "gx0j6mf",
      "author": "pinkie-pie-promise",
      "body": "Oh it’s no problem!! I’m sorry!",
      "created_utc": 1620214327.0,
      "score": 0,
      "context": [
        {
          "id": "gvqrgwm",
          "author": "None",
          "body": "I thought it was common knowledge that anorexia etc was about control and not about weight/looks at the end of the day.",
          "created_utc": 1619293999.0
        },
        {
          "id": "gvs0p9u",
          "author": "pinkie-pie-promise",
          "body": "It doesn’t always end up being about control for everyone! I know that can be a common reason, but sometimes people’s EDs do involve weight/looks, HOWEVER. It’s VERY rarely in the “I wanna look pretty like these models :(((( that’s what the boys want :((((((“ way, some people want to change the way they look to DETER them from “typical” beauty standards. I, for one, don’t use my ED as a huge form of control, i feel best when I AM in control, yes, but it’s not the MAIN reason how I developed it. Mine is more of a coping mechanism from unresolved childhood trauma.",
          "created_utc": 1619318222.0
        },
        {
          "id": "gvs0wkn",
          "author": "None",
          "body": "Oh yes sorry in my other reply to the same person I clarified that no reason is everyone's reasons. But I definitely should have said that above as well!",
          "created_utc": 1619318342.0
        }
      ]
    }
  ]
}