{
  "id": "mze2q9",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1619489324.0,
  "title": "my anorexia feels different",
  "selftext": "I'm kind of sick of seeing this one certain stereotypical picture of anorexia, because it makes me feel so invalidated. sometimes, I will look at my body in the mirror and think \"yeah ok I've lost x amount of pounds this month and I see the change, that's awesome\". I still hate my body, and I never want to stop losing weight, but I see a visible difference and that's what keeps me motivated. it feels like the stereotype of anorexia tells us that people who struggle with it never see a difference or never recognize their weight loss. maybe this post is stupid because I'm sure it's not just me, but idk. it invalidates me. it makes me second guess my disorder.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/mze2q9/my_anorexia_feels_different/",
  "score": 169,
  "num_comments": 17,
  "comments": [
    {
      "id": "gw0bvp8",
      "author": "SLaurent132",
      "body": "This is so valid! the way I view myself changes daily and sometimes hourly! I woke up this morning and felt bloated and awful, but then I changed my clothes and went to do a workout and when I saw myself in the gym mirror I could see some of the progress I’ve been making via workouts and felt really good about it :) feeling good about it didn’t stop me from feeling guilty when I ate today, ignoring hunger cues, and knowing that I wouldn’t be happy unless I forced myself to be hungry, all of which make my ED completely real and valid, even if it looks different from other people. I second guess my disorder too, but I also know that it occupies my mind 99% of the time, even if I’m ok with my body. I saw a comment a while ago that said it’s called an eating disorder and not a body disorder for a reason and that resonated with me so I hope that helps",
      "created_utc": 1619492401.0,
      "score": 37,
      "context": []
    },
    {
      "id": "gw0ln7f",
      "author": "bone-daze",
      "body": "So, the way I describe this to others is that I know I am not fat, and I can see that I am not fat, however, I do see fat on my body that can go away. Because yeah, I don’t think I see myself that wrongly, I know I’m skinny and I can see where others are like “ya too skinny” but like my brain also is like “damn get it” - but yeah, I have a lot of different “quirks” than the stereotypical anorexic so it makes connecting with others a little harder because they do things I don’t. Like counting calories, I don’t do that, never have and that’s like one of the biggest anorexia things, apparently.",
      "created_utc": 1619498505.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gw0q7xn",
      "author": "sorcerers_apprentice",
      "body": "I can see my weight loss at first, but it's like I get desensitized to it. I feel thinner when I first drop to a lower weight, and then I start to feel like it's not enough and I'm actually fat at the same weight that previously felt thin. And then I play all sorts of mind games, like: what if I gained body fat? what if I'm actually gaining weight but I can't tell because I'm dehydrated? what if I'm getting flabby because I've been less active lately? etc. So I lose more \"just to be safe.\"",
      "created_utc": 1619501940.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gw0im76",
      "author": "mylaccount",
      "body": "This makes so much sense. Thoughts really can change minute by minute. I bet a decent amount of us have had moments in the mirror, even if it’s just a certain pose, where we think “damn I’m hot shit”, but that moment doesn’t last at all. \n\nAt the same time I’m sure some haven’t had those moments, that’s why a stereotype is just soooo pointless. We are different but the same in the name of the disorder.",
      "created_utc": 1619496470.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gw0qdep",
      "author": "I_hate_me_lol",
      "body": "I agree. when I was losing really fast, I saw changes in my body sometimes where I went \"wow, I look good\"\n\nand there are a few pictures where I'm like \"damn I actually look hot here\"\n\nI still think I'm fat (I actually am) and I hate my body but that doesn't mean I've never seen progress or liked how my body looked at some point.\n\nsocial media portrayal frustrates me in so many ways.",
      "created_utc": 1619502060.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gw0gnjv",
      "author": "weedmassacre",
      "body": "I really, really hear you, OP. I have had very similar thoughts, especially throughout recovery when I was harmfully comparing myself. Labels aren’t always perfect, especially when it comes to mental health. Everyone has a unique brain and unique strengths, weaknesses, dilemmas. Your experience is still valid, it is different from others experiences- you don’t need every symptom, it really is a spectrum. I think imposter syndrome is often in part with EDs, because of how it skews our perceptions. You’re not alone <3",
      "created_utc": 1619495228.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gw33e62",
      "author": "petewentz-from-mcr",
      "body": "This is such a thing! Like I do have body dysmorphia, and there was still a moment where I was standing in the mirror and noticing all of my visible bones and thought “wait, aren’t I not supposed to be able to tell?” Like I can see all the places that are too thin, I take body checking photos that look thin and make me feel accomplished, but I still see fat places. My tummy is still fat and my thighs are still fat. I know they’re not, like I can logically understand that and I know that I’ve had body dysmorphia my whole life and can acknowledge that what I’m seeing isn’t accurate. It just doesn’t stop me from seeing it the way I do. I can absolutely see the difference though when I lose, like when I’m even typing this now I can look at my thumbs and wrists and see that it’s different, and I still do have body dysmorphia. Not all people with anorexia even do have body dysmorphia, the things are not mutually exclusive.\n\nI do think we should talk about this more, because I felt really invalid too. If we’re all out here feeling invalid over a stereotype it’s an issue. But I promise you are valid!",
      "created_utc": 1619551111.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gw14din",
      "author": "KingBeastMaster",
      "body": "I have the same views of myself. I have grown more increasingly like \"eh I see I made progress but I could've done better\" but I completely understand. The stereotypes of anorexia completely suck. But hey your ED is valid, and it is completely ok to be able to notice your sickness. I struggle with the feeling of faking it all the time since I don't fit the stereotypes. But we are valid, and if you ever feel you need help, you are always deserving of getting help. Ily and I'm here for you if you ever need a stranger. Stay safe!",
      "created_utc": 1619514398.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gw2xtcg",
      "author": "AnyoneElse01",
      "body": "Exactly! I don't think everyone experiences body dysmorphia. Like I look at myself in the mirror and I notice how skinny I've gotten, I don't see (and have never seen) myself as fat at all. I even find it scary, but at the same time it's satisfying to see the numbers drop on the scale. Idk this is just so messed up.",
      "created_utc": 1619548776.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gw2z0nc",
      "author": "None",
      "body": "“I look good...   I could look better.”",
      "created_utc": 1619549289.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gw37vcz",
      "author": "Mjaguacate",
      "body": "It was the same for me. I do have times when I see more weight than I maybe have, but when I was restricting I never thought I was heavier than I was.",
      "created_utc": 1619552990.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gw3sf1y",
      "author": "NotStupidJustDaft",
      "body": "Mine has always been a 'I've lost weight, but it's not enough'. I recognise the change, but it doesn't do anything for me.",
      "created_utc": 1619562088.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gw1o65b",
      "author": "None",
      "body": "that is truly so helpful, thank you",
      "created_utc": 1619528924.0,
      "score": 5,
      "context": [
        {
          "id": "gw0bvp8",
          "author": "SLaurent132",
          "body": "This is so valid! the way I view myself changes daily and sometimes hourly! I woke up this morning and felt bloated and awful, but then I changed my clothes and went to do a workout and when I saw myself in the gym mirror I could see some of the progress I’ve been making via workouts and felt really good about it :) feeling good about it didn’t stop me from feeling guilty when I ate today, ignoring hunger cues, and knowing that I wouldn’t be happy unless I forced myself to be hungry, all of which make my ED completely real and valid, even if it looks different from other people. I second guess my disorder too, but I also know that it occupies my mind 99% of the time, even if I’m ok with my body. I saw a comment a while ago that said it’s called an eating disorder and not a body disorder for a reason and that resonated with me so I hope that helps",
          "created_utc": 1619492401.0
        }
      ]
    },
    {
      "id": "gw1oa1r",
      "author": "None",
      "body": "yes!!!!!! this is me too!!!!!!!",
      "created_utc": 1619528983.0,
      "score": 1,
      "context": [
        {
          "id": "gw0q7xn",
          "author": "sorcerers_apprentice",
          "body": "I can see my weight loss at first, but it's like I get desensitized to it. I feel thinner when I first drop to a lower weight, and then I start to feel like it's not enough and I'm actually fat at the same weight that previously felt thin. And then I play all sorts of mind games, like: what if I gained body fat? what if I'm actually gaining weight but I can't tell because I'm dehydrated? what if I'm getting flabby because I've been less active lately? etc. So I lose more \"just to be safe.\"",
          "created_utc": 1619501940.0
        }
      ]
    },
    {
      "id": "gw1obog",
      "author": "None",
      "body": "thank you :)",
      "created_utc": 1619529007.0,
      "score": 2,
      "context": [
        {
          "id": "gw0gnjv",
          "author": "weedmassacre",
          "body": "I really, really hear you, OP. I have had very similar thoughts, especially throughout recovery when I was harmfully comparing myself. Labels aren’t always perfect, especially when it comes to mental health. Everyone has a unique brain and unique strengths, weaknesses, dilemmas. Your experience is still valid, it is different from others experiences- you don’t need every symptom, it really is a spectrum. I think imposter syndrome is often in part with EDs, because of how it skews our perceptions. You’re not alone <3",
          "created_utc": 1619495228.0
        }
      ]
    },
    {
      "id": "gw1oerm",
      "author": "None",
      "body": "thank you so much <3",
      "created_utc": 1619529052.0,
      "score": 2,
      "context": [
        {
          "id": "gw14din",
          "author": "KingBeastMaster",
          "body": "I have the same views of myself. I have grown more increasingly like \"eh I see I made progress but I could've done better\" but I completely understand. The stereotypes of anorexia completely suck. But hey your ED is valid, and it is completely ok to be able to notice your sickness. I struggle with the feeling of faking it all the time since I don't fit the stereotypes. But we are valid, and if you ever feel you need help, you are always deserving of getting help. Ily and I'm here for you if you ever need a stranger. Stay safe!",
          "created_utc": 1619514398.0
        }
      ]
    },
    {
      "id": "gw1ondd",
      "author": "KingBeastMaster",
      "body": "No probablem!! 💜",
      "created_utc": 1619529178.0,
      "score": 1,
      "context": [
        {
          "id": "gw14din",
          "author": "KingBeastMaster",
          "body": "I have the same views of myself. I have grown more increasingly like \"eh I see I made progress but I could've done better\" but I completely understand. The stereotypes of anorexia completely suck. But hey your ED is valid, and it is completely ok to be able to notice your sickness. I struggle with the feeling of faking it all the time since I don't fit the stereotypes. But we are valid, and if you ever feel you need help, you are always deserving of getting help. Ily and I'm here for you if you ever need a stranger. Stay safe!",
          "created_utc": 1619514398.0
        },
        {
          "id": "gw1oerm",
          "author": "None",
          "body": "thank you so much <3",
          "created_utc": 1619529052.0
        }
      ]
    }
  ]
}