{
  "id": "n1vr4j",
  "subreddit": "AnorexiaNervosa",
  "author": "ThankYourMedic",
  "created_utc": 1619795012.0,
  "title": "I just got my first “you look healthy” comment and I’m so angry",
  "selftext": "One of the staff members at my school hasn’t seen me since I was at my lowest a couple months ago. I’ve been recovering for about 5 months and he saw me today and said\n“You look healthy! You look so much better”\n\n\nI know he meant well but all I hear is “you’ve gained weight” “everyone can see you’ve gained weight” “you’re fat now and it’s obvious”\n\nI’m so angry.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/n1vr4j/i_just_got_my_first_you_look_healthy_comment_and/",
  "score": 226,
  "num_comments": 19,
  "comments": [
    {
      "id": "gwfr160",
      "author": "FayrisDraconis",
      "body": "That's a common fuck up.\n\nBut looking healthy doesn't automatically focus on weight, maybe he meant you're more energetic, have a healthier color in your face, fuller hair, anything.\n\nAnyways I'm proud of you, 5 months is a lot of hard work and I always appreciate reading about that.",
      "created_utc": 1619797527.0,
      "score": 131,
      "context": []
    },
    {
      "id": "gwfrci6",
      "author": "eat-soup",
      "body": "Im so proud you are recovering! 5 months is a long time!",
      "created_utc": 1619797660.0,
      "score": 36,
      "context": []
    },
    {
      "id": "gwg09tw",
      "author": "noemmty483",
      "body": "I hate when people tell me that too! \n\nThey don't realize that to some people it means \"you are not skinny enough\"",
      "created_utc": 1619801422.0,
      "score": 25,
      "context": []
    },
    {
      "id": "gwgf9q3",
      "author": "yellowposy2",
      "body": "Like another commenter said, healthy can refer to a lot more than weight. I’ve been told I look dramatically healthier in the summer because I get a tan, literally no other difference lmao. \n\n\nEd recovery comes with so many physical benefits. Less exhausted which often translates to higher energy or more “pep in your step”, less stress which means a happier mood, I make more eye contact and interact more with people when I’m not restricting, less shakey from overconsumption of caffeine, healthier hair/skin/nails, etc, and people notice those things more than they notice weight many times.\n\n\nSo so proud of you for choosing recovery. Join us over in r/AnorexiaRecovery if you’re not already there. Super supportive community! Sending you lots of love and support ❤️",
      "created_utc": 1619807909.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gwhl7rz",
      "author": "somegenerichandle",
      "body": "Yeah. I got one from a prof when i returned from medical leave. She didn't know why i was on it. It feels like i was making it up, and it ignores invisible disabilities. I know she has her own invisible health issues so i am sure it was meant well. I've said some stupid things too over the years.",
      "created_utc": 1619828197.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gwi6x28",
      "author": "sarefulranger",
      "body": "I was once told during recovery, after not seeing someone for about a year, “wow! Looks like you’ve been eating good.” Absolutely and completely horrible.",
      "created_utc": 1619840159.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwjem5y",
      "author": "None",
      "body": "People do that to me too, and it sends me into IMMEDIATE relapse every time. Without fail.",
      "created_utc": 1619876104.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwgg0c4",
      "author": "MoosieGoose",
      "body": "Damn, this is always rough.\n\nKnow that they meant the best. They may have even struggled themselves, or knew that you struggled. Comments like this are not meant to harm, but instead are meant to break the ice so to speak.\n\nYou're aware that you look different, and so are the people you work with. This person was aware of that & wanted to make it a positive moment, a \"welcome back\" in a way.\n\n& like others have said before, healthy can mean a lot of things. Brighter eyes, shiny hair, clear vibrant skin, energy, a smile, etc. It could literally be that you styled your hair differently & they noticed.\n\nEither way, keep up the great work of recovery! I got my first \"you look so healthy, that must not be a problem for you anymore\" when I was about 6 months into my first honest recovery attempt...it also came from my ex.\n\nDust off the bullshit & keep living your life!",
      "created_utc": 1619808237.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gwgnpps",
      "author": "Carky-43",
      "body": "Uuuuuggggghhhhhhhhhhhhh they might as well punch you in the face, because that’s how it feels. They say “you look healthy” I hear “you look fat again”. I got this repeatedly a few months ago and all it did was push me into a relapse. Stay strong babe, you are a beautiful human.",
      "created_utc": 1619811801.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gwgxvui",
      "author": "WideAtmosphere",
      "body": "I've had this happen too. People are trying to be nice but my brain immediately distorts it. My gastroenterologist told me I looked 'really healthy'. I felt like a hippo. >:(",
      "created_utc": 1619816594.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwh05kr",
      "author": "icashedin",
      "body": "The comment must have stung. I wish it sounded different in my head also. But you know what? 5 months into recovery is amazing. I’m proud of you. 🖤👏",
      "created_utc": 1619817670.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gyu7otw",
      "author": "jrthirteen",
      "body": "Someone told me they were “so proud of the progress I’ve made in such a short time” and they were “so glad I was becoming more healthy” and I feel like I would sound so rude if I told them that they were so triggering so I don’t. I don’t understand how people don’t think about how people with EDs sometimes don’t want to recover and if they are recovering they don’t want other people to notice they are. It made me feel so shitty about how I had started eating more and I feel so bad that I couldn’t just like accept the nice thing they were saying idk",
      "created_utc": 1621527885.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwh6yeg",
      "author": "theworldismadeofcorn",
      "body": "I wish that more people realized that it isn't helpful to comment on people's appearance like that.",
      "created_utc": 1619820932.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gwhdx3k",
      "author": "OtherwiseApricot3603",
      "body": "I do get you I hate it when people say oh your checks look so healthy it’s like thanks but I don’t want to hear anything positive or negative...people shouldn’t say anything really..the worst is overhearing people saying it as well",
      "created_utc": 1619824459.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gwgtb8y",
      "author": "beaudebonair",
      "body": "I hate when they would do that at AA meetings to me, when I had an addiction to alcohol, not necessarily drugs, and people saying \"oh you look healthy\"...and ya don't say that at Gay AA meetings, you're gonna have guys in front of the bathroom mirror thinking you called them fat, no it's true, it seriously happens. From my understanding, they mean well, because in their eyes \"we\" looked \"sickly\", and it's not for them to point out other than, \"you look great\", who are they to say what is healthy while they are on their 2nd pack of cigs for the week.",
      "created_utc": 1619814409.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gwfrwsu",
      "author": "ThankYourMedic",
      "body": "Thank you :)",
      "created_utc": 1619797896.0,
      "score": 14,
      "context": [
        {
          "id": "gwfrci6",
          "author": "eat-soup",
          "body": "Im so proud you are recovering! 5 months is a long time!",
          "created_utc": 1619797660.0
        }
      ]
    },
    {
      "id": "gwgy0fn",
      "author": "WideAtmosphere",
      "body": "They really are just being kind, and they're so happy and pleased to see us doing better. They are praising our positive progress...but you know how we do. :-/",
      "created_utc": 1619816654.0,
      "score": 16,
      "context": [
        {
          "id": "gwg09tw",
          "author": "noemmty483",
          "body": "I hate when people tell me that too! \n\nThey don't realize that to some people it means \"you are not skinny enough\"",
          "created_utc": 1619801422.0
        }
      ]
    },
    {
      "id": "gwheskg",
      "author": "noemmty483",
      "body": "I wish I could go back to the times when weight didn't matter to me :(",
      "created_utc": 1619824918.0,
      "score": 9,
      "context": [
        {
          "id": "gwg09tw",
          "author": "noemmty483",
          "body": "I hate when people tell me that too! \n\nThey don't realize that to some people it means \"you are not skinny enough\"",
          "created_utc": 1619801422.0
        },
        {
          "id": "gwgy0fn",
          "author": "WideAtmosphere",
          "body": "They really are just being kind, and they're so happy and pleased to see us doing better. They are praising our positive progress...but you know how we do. :-/",
          "created_utc": 1619816654.0
        }
      ]
    },
    {
      "id": "gwhzry1",
      "author": "WideAtmosphere",
      "body": "Me too. It consumes my life. I’ve wasted so much time.",
      "created_utc": 1619835963.0,
      "score": 4,
      "context": [
        {
          "id": "gwg09tw",
          "author": "noemmty483",
          "body": "I hate when people tell me that too! \n\nThey don't realize that to some people it means \"you are not skinny enough\"",
          "created_utc": 1619801422.0
        },
        {
          "id": "gwgy0fn",
          "author": "WideAtmosphere",
          "body": "They really are just being kind, and they're so happy and pleased to see us doing better. They are praising our positive progress...but you know how we do. :-/",
          "created_utc": 1619816654.0
        },
        {
          "id": "gwheskg",
          "author": "noemmty483",
          "body": "I wish I could go back to the times when weight didn't matter to me :(",
          "created_utc": 1619824918.0
        }
      ]
    }
  ]
}