{
  "id": "n2b5ft",
  "subreddit": "AnorexiaNervosa",
  "author": "Carky-43",
  "created_utc": 1619843285.0,
  "title": "A slap in the face from an unexpected source",
  "selftext": "So, I went to rehab last year for a substance abuse disorder. I’ve suffered from co-occurring disorders for years (ED, drug abuse, major anxiety & depression, etc.), so I’ve encountered my fair share of therapists and psychiatrists. I’ve never felt dismissed or shamed by any of my providers... until I went to rehab. Because cocaine is a stimulant and appetite suppressant, it can be extremely harmful when abused by a person struggling with an eating disorder (i.e me). To me, it’s a very obvious correlation and when my psychiatrist diagnosed me with anorexia it was not a surprise. Anyway, fast forward to the first day in my drug rehabilitation counselor’s office. We’re discussing triggers, why I couldn’t stop using, so my ana diagnosis comes up. “Oh” she said, “that’s not right, you’re not anorexic... people suffering from anorexia are much thinner than you.” My jaw hit the FLOOR as I sat there in disbelief. All I could do was choke back the tears and anger that this woman, a LICENSED PROFESSIONAL, was not only inaccurate about what the definition of anorexia is, but also brought my biggest fears to life. It’s so sad when people don’t recognize that their assumptions and words can seriously affect others. This happened last August and I still think about it all the time.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/n2b5ft/a_slap_in_the_face_from_an_unexpected_source/",
  "score": 166,
  "num_comments": 13,
  "comments": [
    {
      "id": "gwicybk",
      "author": "None",
      "body": "My jaw also hit the floor. Oh. My. God. \n\nDid you file a complaint? Idk what I would even do",
      "created_utc": 1619844237.0,
      "score": 59,
      "context": []
    },
    {
      "id": "gwixvp5",
      "author": "hnr-2000",
      "body": "About 4/5 years ago I had a therapist tell me they weren’t worried about my ED because I ‘don’t look like a skeleton’. This was before I was at my lowest weight, but I was still underweight at that point. I hadn’t eaten in days when she said it. Some people just need a completely different career because mental health careers are clearly not the right one. I still think about this all the time too. Especially when I’m experiencing a relapse.",
      "created_utc": 1619862963.0,
      "score": 47,
      "context": []
    },
    {
      "id": "gwk4dx3",
      "author": "maonue",
      "body": "People get very confused, they think \"anorexia = just stumbled out of a concentration camp\" when we can look relatively well put-together, e.g. makeup + grooming even if we are thin. \n\nThat's quite awful from a professional though. So much just plain misunderstanding out there and it creeps back to the clinicians.",
      "created_utc": 1619887661.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gwjdryi",
      "author": "TooManyTongues",
      "body": "While I was a couple years into recovery and feeling triggered by my recent weight gain and wanted to relapse, i sought out therapy to prevent it. I was linked with a medi-cal therapist who I made aware of my ED history. She told me that she didn’t understand why I “couldn’t just lose 5-10 pounds if I was so insecure about it”, “what’s wrong with dieting?” and that I “should lose the weight as soon as possible before i gain anymore” and “before my bf begins to notice and dumps me”. She also told me that I could get some non invasive surgeries to correct my facial insecurities and to “take control back! It will feel so good to be skinny again and in control of your life”\nI was so taken aback by this, and understood how untrained and insensitive she was, but still it was the push I needed to hear to finally relapse again.\nI’m sorry this also happened to you. Therapists are supposed to be trusted with these delicate matters.",
      "created_utc": 1619875588.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gwjypa4",
      "author": "RIpronouncedREE",
      "body": "MY jaw just hit the floor. I am in utter disbelief that an actual professional said this to you. Absolutely disgusting. I am so so sorry that you had to hear something like that.",
      "created_utc": 1619885290.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwklh6i",
      "author": "None",
      "body": "What the fuckkkk that is so wrong. I’m so sorry. Anorexia is an illness of the mind, not the body. Would you be able to switch to a new therapist? It sounds like she doesn’t know what she’s doing and is uneducated in her own field.",
      "created_utc": 1619894841.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwiok1m",
      "author": "mylaccount",
      "body": "Holy crap. I feel like trying to comfort you is almost pointless because this is so obviously inappropriate and just wrong. Full stop WRONG. I’m so sorry you had to deal with that. I hope you’re feeling a little better now. Honestly, with her as a professional, it sounds like that woman gets a kick out of making people feel bad. I had a nurse in drug detox and it was quite obvious she was purposely trying to make people quit the program and relapse. We couldn’t do anything because the nurses union. It’s unfortunate people like that exist.",
      "created_utc": 1619853817.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gwl9bcs",
      "author": "I_hate_me_lol",
      "body": "oh. my. god.\n\nI am so sorry.",
      "created_utc": 1619905174.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gwjs8me",
      "author": "6april6",
      "body": "W H A T",
      "created_utc": 1619882552.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gwp6kvu",
      "author": "MmmAioli",
      "body": "What the actual fuck. How was this person able to work with mentally ill people? I would have lost my shit. I also use cocaine sometimes to avoid eating scary foods at restaurants but usually 1-2 bumps per week. Definitely not proud of that....",
      "created_utc": 1619982664.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h13kpbc",
      "author": "Blibbity_Bloosits",
      "body": "Facilities made to help the mentally ill feel very poorly staffed more often than not. When I tried to check into a mental facility for my depression, they denied me entry, quoting my assessment interview where, when asked about suicidal tendencies, I said: \"I'm too depressed to be suicidal anymore,\" completely waving me off because I'm \"not a danger to myself\" except I was a danger to myself because instead of falling back on manual self-harm I fell hard onto the cushion that was Adderall\n\nIn any sense, I'm saying I feel for you",
      "created_utc": 1623201223.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwjyig1",
      "author": "None",
      "body": "100%\n\nI had a DIETITIAN tell me that I wasn't sick when I was actively restricting. Some people just shouldn't be practicing and I wish they realized how harmful their words are.",
      "created_utc": 1619885208.0,
      "score": 9,
      "context": [
        {
          "id": "gwixvp5",
          "author": "hnr-2000",
          "body": "About 4/5 years ago I had a therapist tell me they weren’t worried about my ED because I ‘don’t look like a skeleton’. This was before I was at my lowest weight, but I was still underweight at that point. I hadn’t eaten in days when she said it. Some people just need a completely different career because mental health careers are clearly not the right one. I still think about this all the time too. Especially when I’m experiencing a relapse.",
          "created_utc": 1619862963.0
        }
      ]
    },
    {
      "id": "gz589sp",
      "author": "moonexotica",
      "body": "How awful! She sounds like she’s projecting/struggling with anorexia herself tbh... I hope you’re doing better ❤️ I remember going to a therapist when I was younger and she clearly looked anorexic when I went into her office and had my initial appt with her and she told me that I would be struggling and dealing with anorexia my whole life and there is no cure, I noped the fuck out of there and recognized it as her own sickness projecting out onto the world. It’s truly sad how many healthcare professionals really should not be practicing...",
      "created_utc": 1621761818.0,
      "score": 1,
      "context": [
        {
          "id": "gwjdryi",
          "author": "TooManyTongues",
          "body": "While I was a couple years into recovery and feeling triggered by my recent weight gain and wanted to relapse, i sought out therapy to prevent it. I was linked with a medi-cal therapist who I made aware of my ED history. She told me that she didn’t understand why I “couldn’t just lose 5-10 pounds if I was so insecure about it”, “what’s wrong with dieting?” and that I “should lose the weight as soon as possible before i gain anymore” and “before my bf begins to notice and dumps me”. She also told me that I could get some non invasive surgeries to correct my facial insecurities and to “take control back! It will feel so good to be skinny again and in control of your life”\nI was so taken aback by this, and understood how untrained and insensitive she was, but still it was the push I needed to hear to finally relapse again.\nI’m sorry this also happened to you. Therapists are supposed to be trusted with these delicate matters.",
          "created_utc": 1619875588.0
        }
      ]
    }
  ]
}