{
  "id": "n2sze7",
  "subreddit": "AnorexiaNervosa",
  "author": "ThankYourMedic",
  "created_utc": 1619907603.0,
  "title": "Having a fat face has finally broken me",
  "selftext": "I don’t understand, I’m still underweight, I workout almost every day and yet SOMEHOW my face looks like a chipmunk.\nMy cheeks are so fat I sometimes stand for HOURS in the mirror pulling my skin back and imagining how much better I looked before I recovered.\n\nMy jawline is non existent nowadays, my face blends into my neck and it honestly makes me physically sick to look at.\nI’ve stopped showering, brushing my teeth/hair...\n\nI finally relapsed this week and lost a pretty large amount and I hate that I’m actually pleased about it. It drives me INSANE how I see people who have recovered fully every day and they STILL HAVE THIN FACES!!!! UGHHH.\n\nI want to go back to how I used to look, I’m looking into buccal fat removal surgery when I’m 18 but it costs so so much, it would be so much easier and less expensive to just relapse completely.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/n2sze7/having_a_fat_face_has_finally_broken_me/",
  "score": 128,
  "num_comments": 18,
  "comments": [
    {
      "id": "gwlhlsz",
      "author": "sorcerers_apprentice",
      "body": "I know this struggle and how miserable it is (trust me). However, I want to point out that until you’ve been weight restored for at least 6 months to a year, *you do not know how your healthy body will actually look when the weight redistributes*. When you first gain weight, it usually goes to your trunk/midsection and (you guessed it) your face. This is NOT necessarily permanent! Your body is in a state of flux. Weight redistribution is an honest-to-God real thing, and often you will look thinner at a higher weight after recovering than you looked at a lower weight while recovering. I know it sucks and is super uncomfortable...please try to be patient though.",
      "created_utc": 1619908812.0,
      "score": 49,
      "context": []
    },
    {
      "id": "gwlkyg3",
      "author": "NotSkinney",
      "body": "If you’re under 18 your face is not fully grown yet!! It’s completely normal for teens to have chubby cheeks, but they have a visible jawline in their 20s.",
      "created_utc": 1619910622.0,
      "score": 43,
      "context": []
    },
    {
      "id": "gwm04ez",
      "author": "funsized_",
      "body": "Ohmygosh I was about to ask immediately how old you were but then at the end you mentioned you aren’t even 18 yet!\n\nHoney!! You haven’t fully matured! \n\nI had horrible chipmunk cheeks/puffy arms/legs etc through ages 14-17(ish) my face started thinning at 18 and I still looked very very young at 19(like people would ask if I was 16 because of my round face) but the baby fat has finally started to go away at 20 (like I actually look around my age now lol) \n\nPLEASE do not worry at all! You will grow out of it!",
      "created_utc": 1619918982.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gwlmqp4",
      "author": "waywardraptor",
      "body": "Hey i have always had a round face especially in my teens. And now I'm about to be 25 in 2 months and my face has a more thin shape except when i smile and I'm about the highest I've ever been in weight in my life. The baby fat started to leave my face around the time i was 21-22 and if course i don't look like a model with the high cheek bones and all that but it definitely is less round than when i was in highschool despite me weighing more. It's ok! And a lot of people find it cute or tell me it makes me look younger. So i understand hating it but i wouldn't relapse over it. Your health comes first. And you may not mind the look later down the line :).",
      "created_utc": 1619911588.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gwllpd3",
      "author": "AlexGRNorth",
      "body": "Oh same. I relapsed during the pandemic when I gained weight. Still underweight, but my chin is not slim anymore. I started to train and tried not to relapse, but failed and with my studies, it \"helped\" relapse. Still have the double chin.",
      "created_utc": 1619911026.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwm58lt",
      "author": "itssdarkinhere",
      "body": "i relate hard. these comments are making me feel better though. reminded me that my mom grew out of it so hopefully i will too.",
      "created_utc": 1619921913.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gwm66l0",
      "author": "kingkurtiss",
      "body": "girl same. I remember when i was at my lowest weight, looking at old photos of myself and feeling physically sick by my face. it’s the one thing i’ve always been self-conscious about. like i’m happy putting on a bit of weight anywhere but the face argh!!! i’m 18 too, so hopefully all these comments are right and we still have hope for the future!!! take care of yourself xxx",
      "created_utc": 1619922470.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gwn2miy",
      "author": "None",
      "body": "As others said, wait until you are older before seriously considering surgery. I have nothing against it and myself had a nosejob (at 16), however you have to do it for you, not because of your ED. \n\nAlso, this baby fat which you despise at the moment could make you age more gracefully. Many +30yo wish they had fuller cheeks for a youthful look :)",
      "created_utc": 1619947934.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwm3d8x",
      "author": "OtherwiseApricot3603",
      "body": "Do you eat lots of salt cause that makes my face bloat?",
      "created_utc": 1619920811.0,
      "score": -3,
      "context": []
    },
    {
      "id": "gwlwdm2",
      "author": "sheprosesgarden",
      "body": "Buccal fat removal!",
      "created_utc": 1619916881.0,
      "score": -4,
      "context": []
    },
    {
      "id": "gwlwaq4",
      "author": "sheprosesgarden",
      "body": "Have you tried buccal fat removal? I am goin thru the same issue. Dm me",
      "created_utc": 1619916835.0,
      "score": -6,
      "context": []
    },
    {
      "id": "gwm6fie",
      "author": "mentally_a_table",
      "body": "you are getting better which comes with added weight, it just goes different places for some people but it is completely normal and doesn't change their worth, if it has bothered you to the point of considering fat removal surgery, may i recommend trying out a gua shua/jade roller/ice roller? the results vary and may take a while but it keeps to debloat/puff your face :) i love you and wish you the best day <33",
      "created_utc": 1619922617.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwmkjj8",
      "author": "orzodurham",
      "body": "I grew out of it!!! You very well might too. No need to consider surgery until you REALLY know what you even look like!",
      "created_utc": 1619931618.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwn1qky",
      "author": "None",
      "body": "Buccal fat removal is an awful surgery.  Your face will become more defined with time.  My face changed a lot from 18-19.",
      "created_utc": 1619947060.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwnyzxd",
      "author": "LastBreath808",
      "body": "I can confirm this. I stopped weighing myself and just making sure my body is healthy, I was surprised at how heavy I was, despite still looking slim",
      "created_utc": 1619965927.0,
      "score": 6,
      "context": [
        {
          "id": "gwlhlsz",
          "author": "sorcerers_apprentice",
          "body": "I know this struggle and how miserable it is (trust me). However, I want to point out that until you’ve been weight restored for at least 6 months to a year, *you do not know how your healthy body will actually look when the weight redistributes*. When you first gain weight, it usually goes to your trunk/midsection and (you guessed it) your face. This is NOT necessarily permanent! Your body is in a state of flux. Weight redistribution is an honest-to-God real thing, and often you will look thinner at a higher weight after recovering than you looked at a lower weight while recovering. I know it sucks and is super uncomfortable...please try to be patient though.",
          "created_utc": 1619908812.0
        }
      ]
    },
    {
      "id": "gwmpilm",
      "author": "danceswithroses",
      "body": "Absolutely this! Your face will naturally slim itself into your 20s and then more with age. It is also a known thing with ED for your cheeks to swell, depending on what you do. The term ‘bulimia cheeks’ (I don’t like the term, don’t shoot the messenger) is a thing and will go away with recovery. Please reach out if you need help",
      "created_utc": 1619935636.0,
      "score": 18,
      "context": [
        {
          "id": "gwlkyg3",
          "author": "NotSkinney",
          "body": "If you’re under 18 your face is not fully grown yet!! It’s completely normal for teens to have chubby cheeks, but they have a visible jawline in their 20s.",
          "created_utc": 1619910622.0
        }
      ]
    },
    {
      "id": "gwm678l",
      "author": "I-AM-PIRATE",
      "body": "Ahoy kingkurtiss! Nay bad but me wasn't convinced. Give this a sail:\n\nlass same. me remember when me be at me lowest weight, looking at barnacle-covered photos o' myself n' feeling physically sick by me face. it’s thar one thing me’ve always been self-conscious about. like me’m grog-filled putting on a bit o' weight anywhere but thar face argh!!! me’m 18 too, so hopefully all these yer words be starboard n' our jolly crew still have hope fer thar future!!! take care o' yourself xxx",
      "created_utc": 1619922481.0,
      "score": 3,
      "context": [
        {
          "id": "gwm66l0",
          "author": "kingkurtiss",
          "body": "girl same. I remember when i was at my lowest weight, looking at old photos of myself and feeling physically sick by my face. it’s the one thing i’ve always been self-conscious about. like i’m happy putting on a bit of weight anywhere but the face argh!!! i’m 18 too, so hopefully all these comments are right and we still have hope for the future!!! take care of yourself xxx",
          "created_utc": 1619922470.0
        }
      ]
    },
    {
      "id": "gyowqv5",
      "author": "One-Influence9883",
      "body": "I’m 20 and my face is still fatty though 😭😭",
      "created_utc": 1621429367.0,
      "score": 1,
      "context": [
        {
          "id": "gwn1qky",
          "author": "None",
          "body": "Buccal fat removal is an awful surgery.  Your face will become more defined with time.  My face changed a lot from 18-19.",
          "created_utc": 1619947060.0
        }
      ]
    }
  ]
}