{
  "id": "n3ovr7",
  "subreddit": "AnorexiaNervosa",
  "author": "untitled-biscut",
  "created_utc": 1620020331.0,
  "title": "I think my boyfriend is breaking up with me because of my eating disorder",
  "selftext": "we’ve been together for 2 years, friends for longer. it’s always been our understanding that we want to spend our lives together and he’s my closest friend but we have had our rough patches. i’m at an all time low with my anorexia and he finally confessed that he doesn’t want to be around me if i’m not getting help because it’s too much for him to handle. i feel absolutely broken but also i don’t blame him. had a self harm relapse tonight after almost a year of not cutting. i’m not ready for help but also i don’t want to be alone and i don’t want to keep hurting people. thanks for listening",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/n3ovr7/i_think_my_boyfriend_is_breaking_up_with_me/",
  "score": 119,
  "num_comments": 11,
  "comments": [
    {
      "id": "gwr7w03",
      "author": "somegenerichandle",
      "body": "Maybe this is too tough of love, but you know AN has a high mortality rate. If it's such a great relationship, get help so you can have a long life together or with any other partner/friend. I'm sorry about the self harm too. There are some replacements that therapists recommend like using ice cubes or another sensory experience that is less harmful you can replace it with.",
      "created_utc": 1620025408.0,
      "score": 58,
      "context": []
    },
    {
      "id": "gwrcbzg",
      "author": "RedAppll",
      "body": "i’m scared of the exact same thing honestly. i hope you’ll be okay 💙",
      "created_utc": 1620029539.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gwr6m7z",
      "author": "AccurateGas1145",
      "body": "I am going through this exactly right now... We've been friends since childhood and I can't see myself with anyone else. I'm completely devastated but I know it is killing him and he deserves a life less stressful than this",
      "created_utc": 1620024261.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gwsf82u",
      "author": "StarrD0501",
      "body": "Pls get help babe. It’s tough love , he doesn’t want to see you do this to yourself. It took me several partners doing the same thing for me to finally get on meds and get clean from cutting. Good luck  you can do this even though it will be hard !!!",
      "created_utc": 1620053685.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gws2l7c",
      "author": "peppermint_snow",
      "body": "I've been going through a similar thing where my bf of a little over a year has made it clear that if I continue to get worse it will end the relationship down the road. It was actually what pushed me to go see a doctor and set an appointment with a therapist. I'm terrified and its overwhelming, but I know I'd rather have my life with him than with this disorder no matter how hard it is. That being said, I'm still tempted to cancel my appointments and just stop. I will say though that the recovery aspect seems a lot easier with the right supports and I'd again rather do this now while he's still willing to support me than try to recover down the road when I'm alone. It will always be hard and I wish you the best!",
      "created_utc": 1620047866.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwt09xj",
      "author": "berserker99alita",
      "body": "facing this situation too: ive been an absolute bitch to be around and he didn't know I relapsed until we got in a huge fight and almost broke up. I stormed out of the house and ended up calling 1800-273-8255 and they told me i need to be honest with him and tell him whats really going on. He was so supportive and let me set a bunch of rules like no talking about amount/healthiness/timing of when i eat and hiding the scale to help avoid triggers. But that was literally yesterday so i also know i need to get professional help but i'm also not really ready or sure where to start. I'm scared of being put back on antidepressants because last time it made me feel worse. Basically I had bad experience with trial and error of meds and just quit them all together. I need to get TALK therapy but its expensive man idk where to go",
      "created_utc": 1620062580.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gwrrmch",
      "author": "danslips",
      "body": "I was really close to this situation as well. Actually, my boyfriend basically acknowledging my behavior was what helped me get through 70% of it. Hopefully, you'll figure it out as well. Getting help is never an easy road but I can assure you that it will be a happy road. Good luck with everything!",
      "created_utc": 1620041756.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gwr8s5g",
      "author": "untitled-biscut",
      "body": "i do want help but it’s just too overwhelm and scary to even begin to think about",
      "created_utc": 1620026227.0,
      "score": 17,
      "context": [
        {
          "id": "gwr7w03",
          "author": "somegenerichandle",
          "body": "Maybe this is too tough of love, but you know AN has a high mortality rate. If it's such a great relationship, get help so you can have a long life together or with any other partner/friend. I'm sorry about the self harm too. There are some replacements that therapists recommend like using ice cubes or another sensory experience that is less harmful you can replace it with.",
          "created_utc": 1620025408.0
        }
      ]
    },
    {
      "id": "gwr7c6p",
      "author": "untitled-biscut",
      "body": "i’m so sorry to hear that. he’s made it clear that he’s always here for me on the other side but it’s just hard for him to be with me 24/7 when i’m not in recovery",
      "created_utc": 1620024906.0,
      "score": 12,
      "context": [
        {
          "id": "gwr6m7z",
          "author": "AccurateGas1145",
          "body": "I am going through this exactly right now... We've been friends since childhood and I can't see myself with anyone else. I'm completely devastated but I know it is killing him and he deserves a life less stressful than this",
          "created_utc": 1620024261.0
        }
      ]
    },
    {
      "id": "gwra8o6",
      "author": "somegenerichandle",
      "body": "yeah, it certainly can be. My nutritionist started slowly and we'd focus on improving one meal per day each week. Have you told a doctor yet? You could mention it at a physical with your GP that you believe you are restricting and you're not sure what to do. That's the first step i took, but it wasn't for another year i got into a program. Although, i was in denial, and only told him i was having issues gaining weight.",
      "created_utc": 1620027580.0,
      "score": 24,
      "context": [
        {
          "id": "gwr7w03",
          "author": "somegenerichandle",
          "body": "Maybe this is too tough of love, but you know AN has a high mortality rate. If it's such a great relationship, get help so you can have a long life together or with any other partner/friend. I'm sorry about the self harm too. There are some replacements that therapists recommend like using ice cubes or another sensory experience that is less harmful you can replace it with.",
          "created_utc": 1620025408.0
        },
        {
          "id": "gwr8s5g",
          "author": "untitled-biscut",
          "body": "i do want help but it’s just too overwhelm and scary to even begin to think about",
          "created_utc": 1620026227.0
        }
      ]
    },
    {
      "id": "gwrxo9b",
      "author": "katkannabis",
      "body": "Maybe you have to decide what’s more overwhelming & scary — getting help, or losing your love. It’s not an easy decision by any means, but it seems like that’s the reality you need to face.",
      "created_utc": 1620045335.0,
      "score": 14,
      "context": [
        {
          "id": "gwr7w03",
          "author": "somegenerichandle",
          "body": "Maybe this is too tough of love, but you know AN has a high mortality rate. If it's such a great relationship, get help so you can have a long life together or with any other partner/friend. I'm sorry about the self harm too. There are some replacements that therapists recommend like using ice cubes or another sensory experience that is less harmful you can replace it with.",
          "created_utc": 1620025408.0
        },
        {
          "id": "gwr8s5g",
          "author": "untitled-biscut",
          "body": "i do want help but it’s just too overwhelm and scary to even begin to think about",
          "created_utc": 1620026227.0
        }
      ]
    }
  ]
}