{
  "id": "n4957b",
  "subreddit": "AnorexiaNervosa",
  "author": "ThankYourMedic",
  "created_utc": 1620080657.0,
  "title": "Stupider after my ED",
  "selftext": "Does anyone else feel like their ED has made them stupider?? Like I used to be a grade A student but after my ED, I am failing all my subjects even though I’m working twice as hard???\n\nI was only dangerously underweight for about 4 months but I feel like it’s taken such a huge toll on my intelligence already??\nI’ve also noticed my interests are more childish than they used to be (mlp, stuffed animals etc...) it’s as if my brain is regressing from the starvation???\n\nWill I ever be smart or even average again or am I doomed to be a dumbass forever because of what I did to myself last year??",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/n4957b/stupider_after_my_ed/",
  "score": 185,
  "num_comments": 25,
  "comments": [
    {
      "id": "gwu7jh3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620081396.0,
      "score": 54,
      "context": []
    },
    {
      "id": "gwucezv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620083683.0,
      "score": 41,
      "context": []
    },
    {
      "id": "gwuilzl",
      "author": "rileyyj001",
      "body": "Yes. I literally cannot retain information anymore and it not only pisses me off, but scares me, as well. I will watch tv, listen to a podcast, watch a YouTube video, have a whole conversation with someone and then realize, whoa, I have absolutely no idea whatsoever what is being said/going on. I have to rewatch things, or ask people to stop talking and repeat themselves so I can focus word-for-word",
      "created_utc": 1620086639.0,
      "score": 35,
      "context": []
    },
    {
      "id": "gwud8ud",
      "author": "skonarios",
      "body": "I have such poor memory and brain fog bc of my ED, I stutter sometimes now too. Only thing that’s making me eat is bc I have to do exams and I don’t want to do mediocre on them like last year when I was heavily restricting",
      "created_utc": 1620084070.0,
      "score": 30,
      "context": []
    },
    {
      "id": "gwvutn5",
      "author": "Rainbow-Pickel-Squid",
      "body": "I feel my self get stupid by the day.\nI used to excel in English, but am making more and more spelling mistakes. Have to Google a lot etc.\n\nI used be able to recite a lot of info, but now it feels like it's there.. but I can't get it out. Need little helps on topics and doubt myself all the time.",
      "created_utc": 1620117027.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gwuwcht",
      "author": "abbeyxhalfaxa",
      "body": "This exactly",
      "created_utc": 1620093297.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gwvt3gd",
      "author": "SquargyBoi",
      "body": "I know this response isn't appropriate but when I saw the title I giggled but that's *exact how I feel*\n\nI understand its not a laughing matter but my god it's good to see people talking about this. My memory is utter trash, I'm back at uni and qualify for a disability allowance so I've got programmes on my computer to do voice annotations / record lectures. Never in my life have I had to do that, all because my ED became bad.",
      "created_utc": 1620115465.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gww6xpv",
      "author": "tarynjo2",
      "body": "Yeah.. I barely got through senior year of college. My motivation and energy practically disappeared too. It feels like constant brain fog..",
      "created_utc": 1620127269.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gwvsvh8",
      "author": "BoozeyTurtlez",
      "body": "I don’t know anything medically but thought I’d let you know you’re not the only one! Used to be grade A student and top dancer, can’t remember shit anymore",
      "created_utc": 1620115261.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gwvc01i",
      "author": "gainsforagirl",
      "body": "Not sure on the accuracy but I’ve heard EDs make you literally lose brain mass on top of fucking your memory up :/ lol so I feel this heavy",
      "created_utc": 1620101917.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gwvnu3j",
      "author": "tinyseitan",
      "body": "Yeah I started to shutter, it was impossible to speak normal anymore when I was at my first and it took some time (I don't remember how long time ago it was, we are still talking about years ago) to get my brain function to this level what it is now and it is still not as good that it was. Partly because I never recover, I just freak out totally because I could not talk, I could not learn or understand anything new, I told everything like 5 times to my friend when she was over visiting me. All my energy went to make food, the tiny amount I was having and that was fucking scary. I desided I needed to start eating more or i would end up hospitalized as an adult which is a thing I don't want. Now I weight more, hate it, I am probably going to do same mistakes again 🤡",
      "created_utc": 1620110705.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gwx208s",
      "author": "Lalooskee",
      "body": "Yep. Fucks with memory horribly too. I’m sure it will be a terrible bout of Alzheimers or Dementia when you get older. That’s why recovery needs to be pushed on here like crazy this disorder, to starve a human of nutrients essentially, will fuck you up in more ways than one.",
      "created_utc": 1620142485.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gwx3qy6",
      "author": "barasadilova",
      "body": "Yeah, definately! When I was still on a low weight, I was really.. well, stupid:))\nI really just cared about my performance in sports and calories, so not only had my intelligence gone downhill, but emotional intelligence too. No empathy, I was just really unhappy - which is totally against my nature, I laugh all the time now.. but being on healthy weight and not excercising all the time (recovered for year and a half, with some ups and downs) has helped me - I feel bit more bright again, so don’t give up on yourself. It should get better, and of course your brain is a muscle too, so not sure if you’re a student now, but learning languages and such could help you get back at it again... and helps building up your confidence through smth else than your body:)\nBest of luck! And Im proud of you for being so self aware! Lotsa love:*",
      "created_utc": 1620143206.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gwwbnuq",
      "author": "None",
      "body": "Yes. I feel like my brain takes forever to process things at times. I constantly feel exhausted. Part of me worries this is permanent",
      "created_utc": 1620130320.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gwwq7le",
      "author": "Wrencer4Endgame",
      "body": "Lmao I used to be an honor student and stuff and now I wonder if my crippling obsession about food will ever allow me to finish my degree",
      "created_utc": 1620137611.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gwvdgsu",
      "author": "rauzwaiz",
      "body": "Naah I was always a dumbfuck, before & after ED. Which is also why I don't care about recovery & there's nothing I miss from my past life. Others may say I'm smart at certain things but I don't feel that. Have always had  learning difficulties  & needed special attention.",
      "created_utc": 1620102848.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gwwigln",
      "author": "pulk_pull252",
      "body": "when I was severely underweight  (in recovery now)  my cognitive abilities really did not appear to be affected, i now have a stutter and it doesn't seem to be going away anytime soon, but I think it probably will just take time :) also liking mlp or stuffed animals doesn't make you dumb, enjoy what you like :)",
      "created_utc": 1620134031.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwwla01",
      "author": "bc_1411",
      "body": "It can improve for sure-but only if you're eating enough. And I don't mean a restricted amount of calories, I mean really eating enough. Your brain needs approximately shit tons of calories to function as it should. This is one of the reasons my weight has been stable and maintained in the mid healthy range for months now-I was sick of being so slow all the time",
      "created_utc": 1620135420.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwxa03i",
      "author": "lesbian_canadian",
      "body": "You need food for your body to function. This includes your brain. You absolutely arent functioning up to your full potential",
      "created_utc": 1620145703.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwy5e87",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620162230.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwv5q7k",
      "author": "None",
      "body": "YEARS?!😟",
      "created_utc": 1620098184.0,
      "score": 19,
      "context": [
        {
          "id": "gwu7jh3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620081396.0
        }
      ]
    },
    {
      "id": "gwudyf3",
      "author": "ThankYourMedic",
      "body": "OMG YEA the stuttering is SO ANNOYING, the cashier at the supermarket asked me question yesterday and I literally went “y-y-yea w-what ok ummmmmmmmm” IDK WHY",
      "created_utc": 1620084409.0,
      "score": 34,
      "context": [
        {
          "id": "gwucezv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620083683.0
        }
      ]
    },
    {
      "id": "gwvztgz",
      "author": "ThankYourMedic",
      "body": "EXACTLY!! Like I’ll be studying for hours and then my parents will ask “what are you studying?” And I’ll just be like “uhhhh....I don’t know?????” ITS SO ANNOYING",
      "created_utc": 1620121585.0,
      "score": 9,
      "context": [
        {
          "id": "gwuilzl",
          "author": "rileyyj001",
          "body": "Yes. I literally cannot retain information anymore and it not only pisses me off, but scares me, as well. I will watch tv, listen to a podcast, watch a YouTube video, have a whole conversation with someone and then realize, whoa, I have absolutely no idea whatsoever what is being said/going on. I have to rewatch things, or ask people to stop talking and repeat themselves so I can focus word-for-word",
          "created_utc": 1620086639.0
        }
      ]
    },
    {
      "id": "gwz64vp",
      "author": "schow2406",
      "body": "Oh god I thought it was only me. My brain has just decided to stop functioning. I literally can’t remember ANYTHING. Like I’d start watching a tv show or reading a book and by the time I reach the end, I will have already forgotten what happened at the beginning 😭",
      "created_utc": 1620179208.0,
      "score": 3,
      "context": [
        {
          "id": "gwuilzl",
          "author": "rileyyj001",
          "body": "Yes. I literally cannot retain information anymore and it not only pisses me off, but scares me, as well. I will watch tv, listen to a podcast, watch a YouTube video, have a whole conversation with someone and then realize, whoa, I have absolutely no idea whatsoever what is being said/going on. I have to rewatch things, or ask people to stop talking and repeat themselves so I can focus word-for-word",
          "created_utc": 1620086639.0
        }
      ]
    },
    {
      "id": "gwxojs3",
      "author": "emoboy696969",
      "body": "brain melts because no protein afaik",
      "created_utc": 1620154917.0,
      "score": 2,
      "context": [
        {
          "id": "gwvc01i",
          "author": "gainsforagirl",
          "body": "Not sure on the accuracy but I’ve heard EDs make you literally lose brain mass on top of fucking your memory up :/ lol so I feel this heavy",
          "created_utc": 1620101917.0
        }
      ]
    },
    {
      "id": "gwzexod",
      "author": "WashingtonSt1",
      "body": "Have you got any tips for studying?",
      "created_utc": 1620183622.0,
      "score": 2,
      "context": [
        {
          "id": "gwy5e87",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620162230.0
        }
      ]
    },
    {
      "id": "gwv64mx",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620098406.0,
      "score": 24,
      "context": [
        {
          "id": "gwu7jh3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620081396.0
        },
        {
          "id": "gwv5q7k",
          "author": "None",
          "body": "YEARS?!😟",
          "created_utc": 1620098184.0
        }
      ]
    },
    {
      "id": "gwxsgz3",
      "author": "None",
      "body": "melts😭 rip to my brain I guess",
      "created_utc": 1620156634.0,
      "score": 3,
      "context": [
        {
          "id": "gwvc01i",
          "author": "gainsforagirl",
          "body": "Not sure on the accuracy but I’ve heard EDs make you literally lose brain mass on top of fucking your memory up :/ lol so I feel this heavy",
          "created_utc": 1620101917.0
        },
        {
          "id": "gwxojs3",
          "author": "emoboy696969",
          "body": "brain melts because no protein afaik",
          "created_utc": 1620154917.0
        }
      ]
    },
    {
      "id": "gwv6gvy",
      "author": "None",
      "body": "Fuck. I already feel like my brain is rotting half the time.",
      "created_utc": 1620098598.0,
      "score": 11,
      "context": [
        {
          "id": "gwu7jh3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620081396.0
        },
        {
          "id": "gwv5q7k",
          "author": "None",
          "body": "YEARS?!😟",
          "created_utc": 1620098184.0
        },
        {
          "id": "gwv64mx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620098406.0
        }
      ]
    }
  ]
}