{
  "id": "nmjyfs",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1622156293.0,
  "title": "I hate seeing other people eat less than me",
  "selftext": "It feels so discouraging when I'm trying to gauge more realistic portion sizes and they're serving themselves even less than what I would've done. It makes me feel like \"well fuck, am I even disordered if this is how much a normal person would take?\" \n\nOr when they don't eat all day (not even touching on the people who brag about it) and it confuses me because like, oh, so skipping meals is okay then? If normal people can do it, then why shouldn't I be allowed to? Because I \"took it too far\" but how can that be the case if it's a normal, everyday behavior? What makes it a disorder when I do it? Do I even have a problem? Because it's hard to see anything wrong with what I'm doing when it's everywhere all the time, it's downright inescapable. \n\nrecovery feels impossible in a world where it seems like not a single soul is actually healthy",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/nmjyfs/i_hate_seeing_other_people_eat_less_than_me/",
  "score": 278,
  "num_comments": 16,
  "comments": [
    {
      "id": "gzpopfb",
      "author": "None",
      "body": "something I learned:\n\nI was eating pizza with friends for my boyf's birthday about a year ago. I was in hardcore-ish recovery treatment and were pretty strictly following their rules. I remember vividly when I was partially impatient and they served us pizza as a challenge food and my group was told not to pat it down. but then at this friend dinner thing, I see my friend pat her pizza down. red, flashing signals go off in my brain. should she be doing that? that's a disordered thing, right? should I tell her that? wait, can I do that? \n\nbut then she says \"I don't like the taste- it's so greasy I genuinely dislike it.\"\n\nthis girl is the most brutally honest Latina girl I've ever met. I would believe every single word that comes out of her mouth. if she told me my parents were government spies I'd believe her barely any questions asked. so I know she is being completely and utterly genuine about disliking the pizza grease. \n\nit kinda dawned on me that I can't pat down my pizza cause my brain does it for the disordered reasons and I can't tell if I ACTUALLY dislike grease or not. her though? she just genuinely dislikes it.\n\nI'm not sure how to explain this but I think skipping a few meals on accident or messing with portion sizes is normal if it doesn't overtake a person. y'know? I dunno, this story of mine just reminded me of how I felt then.",
      "created_utc": 1622169121.0,
      "score": 76,
      "context": []
    },
    {
      "id": "gzpdjgr",
      "author": "jolieannn",
      "body": "Ikr?! When someone else skips a meal it’s cause they “forgot” and it’s indicative of how hard they work? It’s frustrating. Especially bc it makes me just want to not eat more and then people berate me for that. It’s like a lose lose situation.",
      "created_utc": 1622163235.0,
      "score": 33,
      "context": []
    },
    {
      "id": "gzpup8h",
      "author": "frolliza",
      "body": "I do it a lot, but I’m far from being underweight (higher range normal BMI). I don’t know why it’s normal for me and not for you, but I have a theory. \n\nThink about it this way: there’s a difference between an alcoholic and a normal person when having one too many. A normal person is not likely to go on a bender and ruin their life after one fun night with friends. An alcoholic, on another hand, might spiral out and lose themselves entirely.\n\nIt’s about being in control.",
      "created_utc": 1622172434.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gzpngn0",
      "author": "Newwavesupport3657",
      "body": "Disordered eating and dieting is normalized that doesn’t make it healthy. Most of society is sick. You’re not sick for seeking recovery.",
      "created_utc": 1622168463.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gzpuarj",
      "author": "sorcerers_apprentice",
      "body": "This, so completely. I get so jealous when other people are \"allowed\" to be disordered and I'm not, as stupid as it sounds...",
      "created_utc": 1622172205.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gzp1woq",
      "author": "LilacBloom32",
      "body": "Felt this. 🙃",
      "created_utc": 1622157204.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gzqqzpl",
      "author": "None",
      "body": "i feel the exact same way! then i start feeling sort of... competitive? like i don't actually think its a competition or something, but i start thinking \"well if they aren't eating/they're eating less then i cant eat/i have to eat even less then them\" if that makes sense. its not something i can really control either. i hate it. you know, its not like i wanna win something or whatever but its just something i feel and cant control... i'm not sure if what i said makes sense but i tried to explain it as well as i could.",
      "created_utc": 1622197115.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gzqgapx",
      "author": "Prof_Cecily",
      "body": ">What makes it a disorder when I do it? \n\nHave you consulted a physician?",
      "created_utc": 1622187317.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gzqk0oq",
      "author": "DiligentCheesecake44",
      "body": "Don’t pay attention to others. It’s better that way.",
      "created_utc": 1622190699.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gzs0fcw",
      "author": "AutocorrectJesus",
      "body": "It's the whole relationship with food. For some people it's like, \"meh, not hungry I guess I'll just push lunch back until I feel it,\" whereas the disordered bit comes in when you're obsessing over it, thinking \"oh but why DON'T I get to to do this\" like it's something to be envious of. It views skipping a meal out to be a goal/prize whereas \"normal people\" with \"normal eating habits\" may not think twice about it (I use quotations because what even is normal).",
      "created_utc": 1622220637.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lit6yxy",
      "author": "MuscleFirm2018",
      "body": "I feel the same!!!\n\nmy mom encourages me to skip meals sometime... she recently got into the idea that people should have one full meal where they are 7-8/10 full and the rest are small snack like meals. and everytime i get upset she goes on about how i need to lose weight and how i have no willpower.\n\n  \nthis morning, i ate half a sandwhich-didnt eat breakfast-(finished around 12). By around 3:30 i was pretty hungry so I told her i was 'pretty hungry' and she started mocking me and saying how i have a big appetite and stuff. And she sounded kinda mad about it and stuff. Its painful because I dont know how I can control my appetite because shes been trying to get me to do that for years and its so annoying. Because for the past few days, dinner has been a protein shake(only one scoop protein powder so like hald a serving) or a watery soup with mushrooms.\n\n  \nShe makes me feel like being hungry early or not being full after a small portion is a crime or something and it makes me feel ugly, fat, and hungry.\n\n  \nI dont want to develop a eating disorder but I feel myself stuffing myself at certain meals when I am alone so if, JUST IN CASE I dont get a proper dinner, I wont have to go hungry.\n\n\n\nbut tbh, everyone seems to eat less than me and idk why. Like im just actually hungry. everyone else seems to eat smaller portions and IDK why i just feel hungrier than them. its been like this since im little and my mom has always shamed me for it...\n\n  \nlet say i dont eat all day and only have dinner, instead of getting mad, my mom praises me.\n\n\n\nps. im 60 kg and 167cm tall so im not overweight but my mom keeps saying I am.",
      "created_utc": 1724032484.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzrtkfm",
      "author": "Newwavesupport3657",
      "body": "I always found Patting down the pizza weird. My friends all did that. I would ask them why and they said it was because they didn’t like the grease. I remember feeling irrationally annoyed (I’m not gonna tell anyone what to do,) but I always found it irrational to pat down pizza. I thought if you don’t want to eat pizza don’t eat pizza, like why Pat it down like that sounds like they’re trying to not feel bad about eating pizza by making themselves believe it’s somehow healthier after they Pat it down.",
      "created_utc": 1622217743.0,
      "score": 10,
      "context": [
        {
          "id": "gzpopfb",
          "author": "None",
          "body": "something I learned:\n\nI was eating pizza with friends for my boyf's birthday about a year ago. I was in hardcore-ish recovery treatment and were pretty strictly following their rules. I remember vividly when I was partially impatient and they served us pizza as a challenge food and my group was told not to pat it down. but then at this friend dinner thing, I see my friend pat her pizza down. red, flashing signals go off in my brain. should she be doing that? that's a disordered thing, right? should I tell her that? wait, can I do that? \n\nbut then she says \"I don't like the taste- it's so greasy I genuinely dislike it.\"\n\nthis girl is the most brutally honest Latina girl I've ever met. I would believe every single word that comes out of her mouth. if she told me my parents were government spies I'd believe her barely any questions asked. so I know she is being completely and utterly genuine about disliking the pizza grease. \n\nit kinda dawned on me that I can't pat down my pizza cause my brain does it for the disordered reasons and I can't tell if I ACTUALLY dislike grease or not. her though? she just genuinely dislikes it.\n\nI'm not sure how to explain this but I think skipping a few meals on accident or messing with portion sizes is normal if it doesn't overtake a person. y'know? I dunno, this story of mine just reminded me of how I felt then.",
          "created_utc": 1622169121.0
        }
      ]
    },
    {
      "id": "gzqub0l",
      "author": "Uplanapepsihole",
      "body": "I’m the same.  It’s frustrating cause I don’t understand it in the “normal” way they do",
      "created_utc": 1622199772.0,
      "score": 4,
      "context": [
        {
          "id": "gzpdjgr",
          "author": "jolieannn",
          "body": "Ikr?! When someone else skips a meal it’s cause they “forgot” and it’s indicative of how hard they work? It’s frustrating. Especially bc it makes me just want to not eat more and then people berate me for that. It’s like a lose lose situation.",
          "created_utc": 1622163235.0
        }
      ]
    },
    {
      "id": "gzs2kzi",
      "author": "SpottedRocks",
      "body": "Similar example: \nWashing your hands is a good, normal thing to do, but when you scrub your hands for hours until they are bloody because you have a mental illness it’s not so great. \nNow take a mechanic that has very dirty hands due to their work, they wash them more than normal people do, but that doesn’t make it a mental illness.\n\nSame goes for eating habits. When a normal person forgets to eat because they’re stressed they’ll just eat more later, someone with a restrictive eating disorder will intentionally not do that.",
      "created_utc": 1622221563.0,
      "score": 5,
      "context": [
        {
          "id": "gzpup8h",
          "author": "frolliza",
          "body": "I do it a lot, but I’m far from being underweight (higher range normal BMI). I don’t know why it’s normal for me and not for you, but I have a theory. \n\nThink about it this way: there’s a difference between an alcoholic and a normal person when having one too many. A normal person is not likely to go on a bender and ruin their life after one fun night with friends. An alcoholic, on another hand, might spiral out and lose themselves entirely.\n\nIt’s about being in control.",
          "created_utc": 1622172434.0
        }
      ]
    },
    {
      "id": "gzqrva5",
      "author": "That1weirdperson",
      "body": "Ikr how come their parents won’t patrol/watch them?",
      "created_utc": 1622197847.0,
      "score": 6,
      "context": [
        {
          "id": "gzpuarj",
          "author": "sorcerers_apprentice",
          "body": "This, so completely. I get so jealous when other people are \"allowed\" to be disordered and I'm not, as stupid as it sounds...",
          "created_utc": 1622172205.0
        }
      ]
    },
    {
      "id": "gzsce6f",
      "author": "frolliza",
      "body": "Exactly. I love food and will 100% replenish what I’ve might have skipped on earlier.",
      "created_utc": 1622225916.0,
      "score": 2,
      "context": [
        {
          "id": "gzpup8h",
          "author": "frolliza",
          "body": "I do it a lot, but I’m far from being underweight (higher range normal BMI). I don’t know why it’s normal for me and not for you, but I have a theory. \n\nThink about it this way: there’s a difference between an alcoholic and a normal person when having one too many. A normal person is not likely to go on a bender and ruin their life after one fun night with friends. An alcoholic, on another hand, might spiral out and lose themselves entirely.\n\nIt’s about being in control.",
          "created_utc": 1622172434.0
        },
        {
          "id": "gzs2kzi",
          "author": "SpottedRocks",
          "body": "Similar example: \nWashing your hands is a good, normal thing to do, but when you scrub your hands for hours until they are bloody because you have a mental illness it’s not so great. \nNow take a mechanic that has very dirty hands due to their work, they wash them more than normal people do, but that doesn’t make it a mental illness.\n\nSame goes for eating habits. When a normal person forgets to eat because they’re stressed they’ll just eat more later, someone with a restrictive eating disorder will intentionally not do that.",
          "created_utc": 1622221563.0
        }
      ]
    }
  ]
}