{
  "id": "nulair",
  "subreddit": "AnorexiaNervosa",
  "author": "NotSkinney",
  "created_utc": 1623094289.0,
  "title": "Why are EDs so irrational?",
  "selftext": "Genuine question, I don’t understand. Normally, I have opinions, points of views, ways of thinkings etc that I have arguments to support and that I’m usually open to debate. I have a brain.\n\nWhy does my ED go straight AGAINST those opinions, without any logical or rational arguments? I’m not talking about the behavior of fearing food etc, but the motivations and opinions tied to it. \n\nFor example, why can I write two whole paragraphs about « women shouldn’t weigh more than xx kilos », and think every word of it, even though I don’t actually believe it in the slightest? Like, I actually have arguments that my ED sees as valid, but that I would see as sexist and senseless, but I still agree with them, but I don’t... What’s the deal here?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/nulair/why_are_eds_so_irrational/",
  "score": 129,
  "num_comments": 15,
  "comments": [
    {
      "id": "h0y1ji5",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1623094289.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0y2aej",
      "author": "ManiaSky",
      "body": "In my experience all mental illnesses share that problem. I am an extremely logic-driven person, but the shit I think and do because of my ED/anxiety/OCD can just be ridiculous. I think it just comes with the territory.",
      "created_utc": 1623094606.0,
      "score": 63,
      "context": []
    },
    {
      "id": "h0yafqy",
      "author": "MentallyFuckedBerry",
      "body": "It’s super ironic because I’ve been told I’m a very logical and analytical person. When it comes to my ED I’m delusional, point blank. There’s no correlation between what does and does not make sense. My brain says I can’t eat this before this time but can have this before that time for NO reason",
      "created_utc": 1623098055.0,
      "score": 30,
      "context": []
    },
    {
      "id": "h0y6xia",
      "author": "None",
      "body": "I logically know all of the dangerous things that can happen to me because of my eating disorder, yet I can’t stop myself from acting on the behaviors and I don’t even know why",
      "created_utc": 1623096560.0,
      "score": 29,
      "context": []
    },
    {
      "id": "h0ych0v",
      "author": "MoosieGoose",
      "body": "What has helped me in the past is visualizing my ED as a physical being. \n\nThat being is not me. That being, for whatever reason, wants to see me suffer. So, when I hear the ED voices, I process it almost as a comment from someone else in the room.\n\nBefore I did this, it felt like the ED thoughts were my own, and that I was more or less fighting myself every time. Seeing the illness as something separate from me helped me understand how to respond to it. It takes time, but I found this technique very useful.\n\nEDs are terrible, but realizing how irrational they are is part of the healing process.",
      "created_utc": 1623098927.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h0ys8kk",
      "author": "KryptonionNipple",
      "body": "It's the same with any mental illness really. I have a bachelor's in Human Biology, currently due to start a master's in Stem Cells and Regenerative Medicine. So I have an understanding of the body and how it works to the cellular level.\n\nI know how our cells die in starvation.\n\nBut I just want it to happen, it's how I want to die. Because my mind is clouded with poor mental health. \n\nIt's unfortunate that I've sort of accepted it as who I am since therapy just doesn't seem to work for me.",
      "created_utc": 1623106077.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h0yfhp8",
      "author": "None",
      "body": "YES! thank you!!!",
      "created_utc": 1623100248.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h0ypsjn",
      "author": "maonue",
      "body": "Yeah, it does seem to be specific to AN, belief-without-reason maybe? Like I wholeheartedly believe it even though if you go through the steps I'd get to the exact opposite conclusion.\n\nOCD might have some overlap when it's extreme.",
      "created_utc": 1623104925.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h0ya038",
      "author": "tenshi0o",
      "body": "This. Just this.",
      "created_utc": 1623097866.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h124ccw",
      "author": "BananaOk5659",
      "body": "Was just thinking this today",
      "created_utc": 1623176926.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0yto5v",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1623106774.0,
      "score": 14,
      "context": [
        {
          "id": "h0yafqy",
          "author": "MentallyFuckedBerry",
          "body": "It’s super ironic because I’ve been told I’m a very logical and analytical person. When it comes to my ED I’m delusional, point blank. There’s no correlation between what does and does not make sense. My brain says I can’t eat this before this time but can have this before that time for NO reason",
          "created_utc": 1623098055.0
        }
      ]
    },
    {
      "id": "h13bzvh",
      "author": "selkieflying",
      "body": "Seriously. I have autism, I’m very logical and generally fit into that stupid emotionless autistic stereotype lol. But when it comes to food? I’m Absolutely bonkers fucking yonkers . ED says I can’t make this shrimp recipe I want to try on Wednesday because the recipe uses a bit of lemon, and I’m making a *different* recipe using lemon on Tuesday and I can’t have too many ~similar flavors~ in a week. Despite the fact that  tuesdays recipe is lemon basil, and the shrimp recipe I want to try is spicy, it just uses a bit of lemon to enhance the shrimp, so they’re not really similar? And I’m not allowed to make rice Wednesday either because I’m having rice on Thursday - despite the fact that I often meal prep, and therefor *often* eat a meal with rice three or four days in a row, but I can’t make it fresh two nights running? For reasons. And God Forbid I don’t weigh out my bowl of strawberries to the gram - but if I eat a handful of grapes from the display while grocery shopping it’s fine, don’t need to count them. Oh, and I can’t waste x calories on a tablespoon of low cal soy sauce, BUT I can drink a x calorie Gatorade Zero and don’t even need to log it!! Make it make sense!!!!\n\n(Reposted without numbers)",
      "created_utc": 1623196741.0,
      "score": 2,
      "context": [
        {
          "id": "h0yafqy",
          "author": "MentallyFuckedBerry",
          "body": "It’s super ironic because I’ve been told I’m a very logical and analytical person. When it comes to my ED I’m delusional, point blank. There’s no correlation between what does and does not make sense. My brain says I can’t eat this before this time but can have this before that time for NO reason",
          "created_utc": 1623098055.0
        }
      ]
    },
    {
      "id": "h0yvkyf",
      "author": "MentallyFuckedBerry",
      "body": "YESYESYES! THIS.\n\nI have ADHD and OCD, and typically I’m pretty chill and laid back. My OCD hardly presents itself outside of my ED, and when it does it’s not too bad.\n\nBut, with my ED I just go fucking apeshit all the time over EVERYTHING. I will eat the same safe meals for days on end and then freak out when I have to change them. I also can’t eat more than 3 slices of bread a day, because clearly that’s too much bread but I also need some way to get my grains but I’m scared of practically all other grains. Any change to my schedule will just absolutely destroy me. I have to go to dinner? Alright I’ll order the same safe meal I always get. BUT WAIT! I know it’s just chicken and veg, which I eat at home, but this time it’s different and my routine is no longer the same and now I must commence meltdown(TM). My rules all conflict each other and make no sense to anyone else. I have no clue what being neurological is like, and I sure as hell don’t know what it would be like without this disorder. Oh, and of course I can’t have pink lemonade because it makes my teeth itchy?? But normal lemonade doesn’t ofc. Like at this point I have no clue if my sensory food issues are ED related or just my brain being funky again",
      "created_utc": 1623107717.0,
      "score": 6,
      "context": [
        {
          "id": "h0yafqy",
          "author": "MentallyFuckedBerry",
          "body": "It’s super ironic because I’ve been told I’m a very logical and analytical person. When it comes to my ED I’m delusional, point blank. There’s no correlation between what does and does not make sense. My brain says I can’t eat this before this time but can have this before that time for NO reason",
          "created_utc": 1623098055.0
        },
        {
          "id": "h0yto5v",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1623106774.0
        }
      ]
    },
    {
      "id": "h11ud3o",
      "author": "Shadowed-Heart",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1623172759.0,
      "score": 1,
      "context": [
        {
          "id": "h0yafqy",
          "author": "MentallyFuckedBerry",
          "body": "It’s super ironic because I’ve been told I’m a very logical and analytical person. When it comes to my ED I’m delusional, point blank. There’s no correlation between what does and does not make sense. My brain says I can’t eat this before this time but can have this before that time for NO reason",
          "created_utc": 1623098055.0
        },
        {
          "id": "h0yto5v",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1623106774.0
        }
      ]
    },
    {
      "id": "h0ywa6x",
      "author": "selkieflying",
      "body": "God it’s so fucking exhausting. Especially changing the schedule- I’ve gotten into a REALLY bad habit of logging my entire intake 2/3 weeks in advance on Loseit.... which is OBVIOUSLY unrealistic and unsustainable, because the grocery store might be out of veggie sausages on Tuesday but that’s What Is Logged for Wednesday so now what do I do? Or god forbid I’m asked to work late - what am I supposed to say, no I can’t my Loseit App says I must eat a potato tonight??? Like @myself what the FUCK",
      "created_utc": 1623108063.0,
      "score": 5,
      "context": [
        {
          "id": "h0yafqy",
          "author": "MentallyFuckedBerry",
          "body": "It’s super ironic because I’ve been told I’m a very logical and analytical person. When it comes to my ED I’m delusional, point blank. There’s no correlation between what does and does not make sense. My brain says I can’t eat this before this time but can have this before that time for NO reason",
          "created_utc": 1623098055.0
        },
        {
          "id": "h0yto5v",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1623106774.0
        },
        {
          "id": "h0yvkyf",
          "author": "MentallyFuckedBerry",
          "body": "YESYESYES! THIS.\n\nI have ADHD and OCD, and typically I’m pretty chill and laid back. My OCD hardly presents itself outside of my ED, and when it does it’s not too bad.\n\nBut, with my ED I just go fucking apeshit all the time over EVERYTHING. I will eat the same safe meals for days on end and then freak out when I have to change them. I also can’t eat more than 3 slices of bread a day, because clearly that’s too much bread but I also need some way to get my grains but I’m scared of practically all other grains. Any change to my schedule will just absolutely destroy me. I have to go to dinner? Alright I’ll order the same safe meal I always get. BUT WAIT! I know it’s just chicken and veg, which I eat at home, but this time it’s different and my routine is no longer the same and now I must commence meltdown(TM). My rules all conflict each other and make no sense to anyone else. I have no clue what being neurological is like, and I sure as hell don’t know what it would be like without this disorder. Oh, and of course I can’t have pink lemonade because it makes my teeth itchy?? But normal lemonade doesn’t ofc. Like at this point I have no clue if my sensory food issues are ED related or just my brain being funky again",
          "created_utc": 1623107717.0
        }
      ]
    }
  ]
}