{
  "id": "nys98j",
  "subreddit": "AnorexiaNervosa",
  "author": "livv3ss",
  "created_utc": 1623574484.0,
  "title": "I want to recover but I also want more people to notice before I do.",
  "selftext": "I’m desperately in need of some way to fix my thinking and relationship with food. My relationship with myself and my boyfriend is struggling because I’m not eating or purging all the time, and I’m getting dizzy and almost blacking out from lack of food or low blood sugar or something I’m not sure 100%, but that’s beside the point. I know I need to get better but at the same time I want to lose more weight and be thinner so more people notice before I recover. I know how messed up that sounds but that’s really how I think n honestly idk what to do anymore. I wish my boyfriend would somehow find this post so he would just know how I felt but I also know that won’t happen.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/nys98j/i_want_to_recover_but_i_also_want_more_people_to/",
  "score": 111,
  "num_comments": 18,
  "comments": [
    {
      "id": "h1lr7h0",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1623574484.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1ltfcp",
      "author": "hlarrais",
      "body": "I thought the same way for so long until one day I ended up in hospital with severe heart problems being told I was so close to losing my life. I actually ended up finding out that a lot of people close to me suspected I struggled with an ED but didn’t know how to approach me about it which was unfortunate since I always assumed no one noticed or cared. I know it’s hard but you just need to fully decide that recovery is worth it and that it needs to happen. Stay strong and I hope everything works out :)",
      "created_utc": 1623576643.0,
      "score": 35,
      "context": []
    },
    {
      "id": "h1lzu1q",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1623582542.0,
      "score": 21,
      "context": []
    },
    {
      "id": "h1mbdq5",
      "author": "Skybluewaves",
      "body": "Getting that dizzy could be a sign of low electrolytes. Electrolytes ate so important. When going without food for a while (and if you’re purging), you absolutely need at least potassium, magnesium, and sodium, every day. \n\nAdding electrolyte powder (there are no sugar and no calorie options) and salt to some water can help with this. Magnesium in particular can also be taken as a capsule.",
      "created_utc": 1623590581.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h1nfjuh",
      "author": "sorcerers_apprentice",
      "body": "Hey, I hear you, and I’ve been there. But I also want to offer another perspective, in case it helps a little: *being seen as “the anorexic” seems like it would feel validating, but in actuality, it is mortifying*. People look at you with pity. They think you’re pathetic…it’s your biggest problem, plastered for the world to see. They’re afraid to say something because they don’t want to set you off and make you worse. People treat you with kiddie gloves, and with it comes a total lack of respect and dignity…",
      "created_utc": 1623611128.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h1m283g",
      "author": "maonue",
      "body": "Unfortunately, a lot of people don't notice and eating disorders are taboo so people are reluctant to bring them up.\n\nMany anorexics will not look like they stumbled out of a POW camp, as we will stay well-groomed (maybe with makeup etc.)",
      "created_utc": 1623584413.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h1mgjnh",
      "author": "marsmango5",
      "body": "i’m in the same position. i want people around me to care, to notice... even if it’s a little messed up. but honestly i bet someone around you knows, i found out recently that my friend knows and is also struggling (i knew ittttt).",
      "created_utc": 1623593534.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h1ltrcc",
      "author": "cjmmdg",
      "body": "Omg same 😓😓 I really want some more people to notice.",
      "created_utc": 1623576954.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h1n4ak9",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1623605642.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h1oa8u7",
      "author": "MelancholicMelody5",
      "body": "I drink Perrier when I have dizzy spells on days where I don’t eat or don’t eat as much. For me, it helps quite a bit.",
      "created_utc": 1623626826.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1ntwtp",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1623618106.0,
      "score": -2,
      "context": []
    },
    {
      "id": "h1mnp9e",
      "author": "maonue",
      "body": "> I actually ended up finding out that a lot of people close to me suspected I struggled with an ED but didn’t know how to approach me\n\nIt's taboo, especially among adults, so people really don't like to talk about it.",
      "created_utc": 1623597373.0,
      "score": 8,
      "context": [
        {
          "id": "h1ltfcp",
          "author": "hlarrais",
          "body": "I thought the same way for so long until one day I ended up in hospital with severe heart problems being told I was so close to losing my life. I actually ended up finding out that a lot of people close to me suspected I struggled with an ED but didn’t know how to approach me about it which was unfortunate since I always assumed no one noticed or cared. I know it’s hard but you just need to fully decide that recovery is worth it and that it needs to happen. Stay strong and I hope everything works out :)",
          "created_utc": 1623576643.0
        }
      ]
    },
    {
      "id": "h1ob5hi",
      "author": "livv3ss",
      "body": "Thank you, focusing on my health is hard when I have messed up thoughts like these :( maybe it’s time for treatment. Thank u tho ❤️",
      "created_utc": 1623627345.0,
      "score": 2,
      "context": [
        {
          "id": "h1lzu1q",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1623582542.0
        }
      ]
    },
    {
      "id": "h1nw3td",
      "author": "livv3ss",
      "body": "Right I know it’s messed up but I can’t stop the way I think 😢",
      "created_utc": 1623619215.0,
      "score": 1,
      "context": [
        {
          "id": "h1mgjnh",
          "author": "marsmango5",
          "body": "i’m in the same position. i want people around me to care, to notice... even if it’s a little messed up. but honestly i bet someone around you knows, i found out recently that my friend knows and is also struggling (i knew ittttt).",
          "created_utc": 1623593534.0
        }
      ]
    },
    {
      "id": "h1nw0iv",
      "author": "livv3ss",
      "body": "Thank you for sharing your story as well, I also find weed helps with a lot but I think therapy might be an option considering I feel like I can’t talk or rely on anybody in my family to talk to",
      "created_utc": 1623619168.0,
      "score": 1,
      "context": [
        {
          "id": "h1n4ak9",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623605642.0
        }
      ]
    },
    {
      "id": "h1nvtog",
      "author": "livv3ss",
      "body": "It’s not like it’s based around attention, I do it because of control and want to feel better in my own fucked up way but for some reason people noticing is Super validating. Thank you tho as I do wanna try n recover ❤️",
      "created_utc": 1623619071.0,
      "score": 2,
      "context": [
        {
          "id": "h1ntwtp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1623618106.0
        }
      ]
    },
    {
      "id": "h1rb22k",
      "author": "Shadowed-Heart",
      "body": "Your post has been removed for rule 3: Anyone is welcome here. \n\nIt is likely that the post has been removed because you were telling someone that they do not belong in r/AnorexiaNervosa or a similar offense. This includes being rude or threatening, et cetera. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1623695112.0,
      "score": 1,
      "context": [
        {
          "id": "h1ntwtp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1623618106.0
        }
      ]
    },
    {
      "id": "h1rb6d9",
      "author": "Shadowed-Heart",
      "body": "I'm sorry the commenter was rude in the first part of their comment OP :( don't listen to them. I hope you start recovery soon <3 good luck!",
      "created_utc": 1623695167.0,
      "score": 2,
      "context": [
        {
          "id": "h1ntwtp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1623618106.0
        },
        {
          "id": "h1nvtog",
          "author": "livv3ss",
          "body": "It’s not like it’s based around attention, I do it because of control and want to feel better in my own fucked up way but for some reason people noticing is Super validating. Thank you tho as I do wanna try n recover ❤️",
          "created_utc": 1623619071.0
        }
      ]
    },
    {
      "id": "h1t9x3r",
      "author": "livv3ss",
      "body": "Thank you ❤️",
      "created_utc": 1623730144.0,
      "score": 1,
      "context": [
        {
          "id": "h1ntwtp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1623618106.0
        },
        {
          "id": "h1nvtog",
          "author": "livv3ss",
          "body": "It’s not like it’s based around attention, I do it because of control and want to feel better in my own fucked up way but for some reason people noticing is Super validating. Thank you tho as I do wanna try n recover ❤️",
          "created_utc": 1623619071.0
        },
        {
          "id": "h1rb6d9",
          "author": "Shadowed-Heart",
          "body": "I'm sorry the commenter was rude in the first part of their comment OP :( don't listen to them. I hope you start recovery soon <3 good luck!",
          "created_utc": 1623695167.0
        }
      ]
    }
  ]
}