{
  "id": "o1oa8z",
  "subreddit": "AnorexiaNervosa",
  "author": "midnight863",
  "created_utc": 1623903605.0,
  "title": "Am I the only one?",
  "selftext": "Does anyone else sometimes use their ED as, like, self harm? I really do hate my body and most of it is about my weight and how I look, but sometimes if I’m angry at myself for something or just in a bad mood I’m general I tell myself that I don’t deserve to eat or I don’t deserve to be healthy or I don’t deserve to have food and then it becomes really self destructive… I used to self harm in other ways but I’ve been clean for a while but this feels almost like a new way to do that that I’ve adopted.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/o1oa8z/am_i_the_only_one/",
  "score": 129,
  "num_comments": 15,
  "comments": [
    {
      "id": "h21wi6v",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1623903605.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h225f6g",
      "author": "chillin_in_my_onesie",
      "body": "Oh my gosh, yes. This is exactly how I operate. I'm  constantly debating if I earned or didn't earn food. It's tough. Stay strong.",
      "created_utc": 1623909708.0,
      "score": 25,
      "context": []
    },
    {
      "id": "h227cmz",
      "author": "glitterandgore",
      "body": "Yep! I think this is extremely common.",
      "created_utc": 1623911239.0,
      "score": 13,
      "context": []
    },
    {
      "id": "h228m4v",
      "author": "idrankthetapwater",
      "body": "I do, but partly also because I know when I'm emotional I fail. It's a way fro my brain to punish myself twice, which usually leads to cutting. It blows.",
      "created_utc": 1623912267.0,
      "score": 11,
      "context": []
    },
    {
      "id": "h22ma9m",
      "author": "angelshalfdead",
      "body": "I stopped self harming around the time I relapsed into restriction… for some reason I think those two things are linked 🤔",
      "created_utc": 1623924157.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h22jxf2",
      "author": "Vast_Satisfaction_80",
      "body": "I completely understand where you're coming from, while I was in the recovery of self harm I repeatedly found myself feeding my addiction by starving myself to a point that it physically pained me more than normal. To be honest I still do it to this day even after giving in to my addiction of both self-harming and anorexia.\n\nLong story short, I completely relate to what you're going through!",
      "created_utc": 1623921908.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h23i34o",
      "author": "None",
      "body": "I do this all the time. If something goes ‘wrong’ or I didn’t do something well enough, I take it out on myself.",
      "created_utc": 1623942364.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h23bykz",
      "author": "maonue",
      "body": "It was for me at one point. Too shameful to eat, want to look frail enough to justify myself?",
      "created_utc": 1623939834.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h22jrtl",
      "author": "Twigsintheforest",
      "body": "I do kinda the opposite? When I get stressy or angry I'll eat stuff that I know full well will make me feel guilty and gross, something about me being gross and not deserving to be skinny maybe? Idk but I feel u, in the end it's about self destruction either way and it sucks",
      "created_utc": 1623921756.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h23ss9k",
      "author": "quuerthotthrowaway",
      "body": "All the time :(",
      "created_utc": 1623946938.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h248jse",
      "author": "None",
      "body": "Yup. Has very little to do with my appearance or weight aside from wanting to appear as masculine as possible (ftm). Its much more self destruction, giving me a focus/goal, self torment, whatever  \n\nIt can go the opposite direction too- eat a lot of things that I know will hurt my stomach just to make myself sick.",
      "created_utc": 1623953564.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h229srv",
      "author": "marsmango5",
      "body": "me",
      "created_utc": 1623913245.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h2yjrml",
      "author": "None",
      "body": "massive TW btw\nI don’t want to have scars on my body because I scar super easily TW. but I hit myself to give bruises, bang my head, slap myself rlly hard and starve for self harm instead of cutting.",
      "created_utc": 1624594069.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h24a4ci",
      "author": "chillin_in_my_onesie",
      "body": "A lot of my eating disorder started from wanting to appear lean and fit instead of curvy and feminine. I can relate.",
      "created_utc": 1623954236.0,
      "score": 1,
      "context": [
        {
          "id": "h248jse",
          "author": "None",
          "body": "Yup. Has very little to do with my appearance or weight aside from wanting to appear as masculine as possible (ftm). Its much more self destruction, giving me a focus/goal, self torment, whatever  \n\nIt can go the opposite direction too- eat a lot of things that I know will hurt my stomach just to make myself sick.",
          "created_utc": 1623953564.0
        }
      ]
    },
    {
      "id": "h24aa1o",
      "author": "None",
      "body": "Ah yeah I get that. I'm ftm so a huge part of it was losing my chest and cycle, wanting to pass, etc.",
      "created_utc": 1623954303.0,
      "score": 2,
      "context": [
        {
          "id": "h248jse",
          "author": "None",
          "body": "Yup. Has very little to do with my appearance or weight aside from wanting to appear as masculine as possible (ftm). Its much more self destruction, giving me a focus/goal, self torment, whatever  \n\nIt can go the opposite direction too- eat a lot of things that I know will hurt my stomach just to make myself sick.",
          "created_utc": 1623953564.0
        },
        {
          "id": "h24a4ci",
          "author": "chillin_in_my_onesie",
          "body": "A lot of my eating disorder started from wanting to appear lean and fit instead of curvy and feminine. I can relate.",
          "created_utc": 1623954236.0
        }
      ]
    }
  ]
}