{
  "id": "o1wytu",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1623935679.0,
  "title": "DAE get told they eat \"healthy\"?",
  "selftext": "This is SO frustrating. I live off ready meals, fig newtons, and carb-ridden cereal. I never eat 5 a day. Yet I frequently receive comments like \"I should order yoghurt for dessert because I wanna be healthy like YOU\" or \"here's a recipe I found that I think you might like, it's really healthy but also delicious\". I am 15 years old, not 50 with a slowing metabolism.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/o1wytu/dae_get_told_they_eat_healthy/",
  "score": 110,
  "num_comments": 8,
  "comments": [
    {
      "id": "h233dih",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1623935679.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h23x36c",
      "author": "jake25456",
      "body": "My family that eats like shitt told me I eat healthy during my recovery and it actually made me feel good about myself",
      "created_utc": 1623948762.0,
      "score": 18,
      "context": []
    },
    {
      "id": "h23v9iz",
      "author": "thecrystalwitch",
      "body": "Omg YES. Everyone thinks I eat sooo healthy, because when I do eat it’s usually a Lean Cuisine, fruit, or when I go eat with my family I get a salad. I know they mean well, but I am so, so far from healthy.",
      "created_utc": 1623947998.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h2464at",
      "author": "sorcerers_apprentice",
      "body": "Yes, lol. I guess I do eat \"healthy\" foods but I restrict so I'm definitely missing out on a lot of nutrients... even though, proportionally, everything is ~balanced~, I simply don't get enough of what I need. It's not healthy at all, lol.",
      "created_utc": 1623952541.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h24h739",
      "author": "WideAtmosphere",
      "body": "Oh all the time. \"Oh you eat so healthy! You're so GOOD all the time! I wish I had your willpower! That's why you're so SLIM! I wish I could be more like that!\"   \nHoney, no. Nooooo you don't. Maybe you want to be 'lean' or 'slim', but you sure as HELL don't want it like this. Be careful what you wish for...",
      "created_utc": 1623957227.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h24w9g8",
      "author": "Various-List",
      "body": "Yep! I get asked for diet tips all the time. It makes me super uncomfortable! I do try to give them the best advice I have even though I am not exactly on that plan myself..",
      "created_utc": 1623963631.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h264xaf",
      "author": "None",
      "body": "Anyone else a vodka for dinner person? No? Just me?",
      "created_utc": 1623986691.0,
      "score": 0,
      "context": []
    },
    {
      "id": "h242t0r",
      "author": "rosesilverblue",
      "body": "That’s so great☺️",
      "created_utc": 1623951161.0,
      "score": 2,
      "context": [
        {
          "id": "h23x36c",
          "author": "jake25456",
          "body": "My family that eats like shitt told me I eat healthy during my recovery and it actually made me feel good about myself",
          "created_utc": 1623948762.0
        }
      ]
    }
  ]
}