{
  "id": "o4seau",
  "subreddit": "AnorexiaNervosa",
  "author": "steidl_vittaa",
  "created_utc": 1624272603.0,
  "title": "I wore shorts and tank top for the first time in five years",
  "selftext": "I am very insecure and i usually dont show any part of my body, but due to heat wave that is currently in my country I wore my shorts and tanktop outside and i actually felt really good, im super proud of myself) thank you guys for hearing me out!",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/o4seau/i_wore_shorts_and_tank_top_for_the_first_time_in/",
  "score": 133,
  "num_comments": 5,
  "comments": [
    {
      "id": "h2ivkuu",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1624272603.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2jgd5l",
      "author": "None",
      "body": "Ugh I'm so proud of you this is amazing ❤️ I similarly wore shorts and a tank top for the first time in years last week and ended up with SEVEN mosquito bites after three hours even though I sprayed myself three times 😭 and I was weirdly proud of myself that my failure was due to mosquitos and not my own lack of confidence 😅",
      "created_utc": 1624285771.0,
      "score": 16,
      "context": []
    },
    {
      "id": "h2k0srr",
      "author": "Mindless-Soil1999",
      "body": "I wore shorts to work the other day for the first time ever and I feel really proud of myself too. So just wanted to say that you're amazing and good job!! We're worth it.",
      "created_utc": 1624295105.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h2kkvva",
      "author": "steidl_vittaa",
      "body": "haha i guess wrapping whole body with clothes in the hot summer has its benefits after all, just wanted to say im so glad for you, its a huge step and im sure you looked great)",
      "created_utc": 1624304116.0,
      "score": 3,
      "context": [
        {
          "id": "h2jgd5l",
          "author": "None",
          "body": "Ugh I'm so proud of you this is amazing ❤️ I similarly wore shorts and a tank top for the first time in years last week and ended up with SEVEN mosquito bites after three hours even though I sprayed myself three times 😭 and I was weirdly proud of myself that my failure was due to mosquitos and not my own lack of confidence 😅",
          "created_utc": 1624285771.0
        }
      ]
    },
    {
      "id": "h2kl5g2",
      "author": "steidl_vittaa",
      "body": "thank you so so much) you are right we are worth it, hope you had a great day at work))",
      "created_utc": 1624304238.0,
      "score": 4,
      "context": [
        {
          "id": "h2k0srr",
          "author": "Mindless-Soil1999",
          "body": "I wore shorts to work the other day for the first time ever and I feel really proud of myself too. So just wanted to say that you're amazing and good job!! We're worth it.",
          "created_utc": 1624295105.0
        }
      ]
    }
  ]
}