{
  "id": "o53hhy",
  "subreddit": "AnorexiaNervosa",
  "author": "raspberry-enthusiast",
  "created_utc": 1624304234.0,
  "title": "are you particular about how you look WHILE eating?",
  "selftext": "anytime I'm eating with people outside my immediate family, I feel like my brain is screaming at me. \"don't hold your fork like that, sit straight, that's too big of a bite!! don't look sloppy!!\". I avoid certain foods in public because I know I'll look dumb or gross eating them.\n\nand this isn't like a constant thing when I'm around people, it's specifically when eating. I have terrible posture and don't really care unless I'm eating, I don't care how I'm holding stuff unless I'm eating.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/o53hhy/are_you_particular_about_how_you_look_while_eating/",
  "score": 145,
  "num_comments": 15,
  "comments": [
    {
      "id": "h2kl53z",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1624304234.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2laubm",
      "author": "None",
      "body": "Whoa I didn’t realise there were people who didn’t do that. I agree with everything you said, even down to avoiding certain foods bc of it.",
      "created_utc": 1624316493.0,
      "score": 27,
      "context": []
    },
    {
      "id": "h2lbtge",
      "author": "None",
      "body": "The only thing I have anymore really are \"oh shit, can they see me bouncing my leg? Am I staring too intensely at my food? Am I eating at the same pace? Can they tell my head is screaming?\"",
      "created_utc": 1624317007.0,
      "score": 12,
      "context": []
    },
    {
      "id": "h2l1es5",
      "author": "busted3000",
      "body": "I absolutely feel the same",
      "created_utc": 1624311729.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h2lpazq",
      "author": "Elllliiiizzzaabeth",
      "body": "The best part of covid for me was never having to eat with or around other people. Idek what to do now that I don’t have that as an excuse 😅",
      "created_utc": 1624324256.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h2lbc0k",
      "author": "None",
      "body": "same.",
      "created_utc": 1624316750.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h2lxe7k",
      "author": "midnight863",
      "body": "I just realized, while reading this, that I feel like this too. As pathetic as it is, I used to eat in the school bathroom by myself at lunch, so that I didn’t have to eat around anyone else. I just hate eating around other people or being watched eating and that began even before I knew I had an ED. I don’t know why.",
      "created_utc": 1624328738.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h2m41em",
      "author": "Lalooskee",
      "body": "Same. And people have made fun of me and say I eat like a bird lol.I don’t like people looking at me eating anyway. So I avoid social situations with food.",
      "created_utc": 1624332630.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2nt4ru",
      "author": "None",
      "body": "yes this is part of why residential treatment was so triggering for me",
      "created_utc": 1624375798.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2nouig",
      "author": "Successful_Self_1827",
      "body": "I literally did not eat anything larger than a small order of fries until 1.5 months into my most recent relationship and when I finally did I just pretended to be full and save it for later or finish it in distributed increments while he left the room… he always said “you eat so fast” or “you hardly eat anything!” Or “why do you eat and drink like you’re in a food competition” like baby I only eat like a human when you take a piss.",
      "created_utc": 1624373823.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2lb360",
      "author": "raspberry-enthusiast",
      "body": "i think everyone does it to an extent, but i don't think others have it as extreme as i/do. like its all i can focus on during a meal, and i don't think a lot of people chose their food based on how they'll look eating it",
      "created_utc": 1624316620.0,
      "score": 9,
      "context": [
        {
          "id": "h2laubm",
          "author": "None",
          "body": "Whoa I didn’t realise there were people who didn’t do that. I agree with everything you said, even down to avoiding certain foods bc of it.",
          "created_utc": 1624316493.0
        }
      ]
    },
    {
      "id": "h2m42bz",
      "author": "Lalooskee",
      "body": "exactly",
      "created_utc": 1624332645.0,
      "score": 1,
      "context": [
        {
          "id": "h2lpazq",
          "author": "Elllliiiizzzaabeth",
          "body": "The best part of covid for me was never having to eat with or around other people. Idek what to do now that I don’t have that as an excuse 😅",
          "created_utc": 1624324256.0
        }
      ]
    },
    {
      "id": "h2m8cg2",
      "author": "bfasttoastcornflakes",
      "body": "Oh, I used to do this too. We couldn't eat in the library of course, so I'd take my lunch and sit outside against the wall. If it was snowing, I'd sit in a little alcove to avoid the snow. Thankfully I think as the years went by I also was able to have lunch in the band room but yeah we weren't allowed in the halls at lunchtime during middle school, so I would sit in the bathroom alone...",
      "created_utc": 1624335382.0,
      "score": 2,
      "context": [
        {
          "id": "h2lxe7k",
          "author": "midnight863",
          "body": "I just realized, while reading this, that I feel like this too. As pathetic as it is, I used to eat in the school bathroom by myself at lunch, so that I didn’t have to eat around anyone else. I just hate eating around other people or being watched eating and that began even before I knew I had an ED. I don’t know why.",
          "created_utc": 1624328738.0
        }
      ]
    },
    {
      "id": "h2nu1na",
      "author": "raspberry-enthusiast",
      "body": "yeah, i guess they *have* *to* watch you eat so that seems stressful",
      "created_utc": 1624376211.0,
      "score": 1,
      "context": [
        {
          "id": "h2nt4ru",
          "author": "None",
          "body": "yes this is part of why residential treatment was so triggering for me",
          "created_utc": 1624375798.0
        }
      ]
    },
    {
      "id": "h2pofkb",
      "author": "None",
      "body": "yup and they are so nitpicky like if they give you 15 minutes for snack and you finish in less than half the time they redirect you for eating too fast",
      "created_utc": 1624407551.0,
      "score": 1,
      "context": [
        {
          "id": "h2nt4ru",
          "author": "None",
          "body": "yes this is part of why residential treatment was so triggering for me",
          "created_utc": 1624375798.0
        },
        {
          "id": "h2nu1na",
          "author": "raspberry-enthusiast",
          "body": "yeah, i guess they *have* *to* watch you eat so that seems stressful",
          "created_utc": 1624376211.0
        }
      ]
    }
  ]
}