{
  "id": "o9ryuo",
  "subreddit": "AnorexiaNervosa",
  "author": "Hot_Ad1238",
  "created_utc": 1624909945.0,
  "title": "does anyone else experience jealousy?",
  "selftext": "to elaborate, i mean does anyone else grow really envious of others that can eat normally? in my mind, i get angry that i cant eat certain things that others can enjoy. i don’t know what im trying to say lmao.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/o9ryuo/does_anyone_else_experience_jealousy/",
  "score": 137,
  "num_comments": 17,
  "comments": [
    {
      "id": "h3cw1vp",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1624909945.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h3cwzde",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1624910348.0,
      "score": 28,
      "context": []
    },
    {
      "id": "h3dry6y",
      "author": "Reversephoenix77",
      "body": "Yes! I've always thought it would be so amazing to just be able to eat normally without the obsessive planning and thoughts. I developed anorexia at 11 and I'm now almost freaking 40 years old and I still haven't figured out how to eat normal despite majoring in health science and working as a meal planner and fitness coach. Like I can plan \"normal\" meals for others based on their individual needs yet I can't seem to implement a \"normal\" eating pattern for myself regardless of anything I've tried. I always end up either bingeing (and sometimes purging) or end up severely restricting. I have a million restrictions and only a very small window that I allow myself to eat each day and even with a few stints in treatment, I can't seem to break away. \n\nI see people on tv just eating and ordering what they are in the mood for at restaurants and it just blows my mind. I wish I knew what that was like. I either eat too much or not enough, there has never been an in between.",
      "created_utc": 1624924705.0,
      "score": 13,
      "context": []
    },
    {
      "id": "h3ejr1c",
      "author": "catsinsunglassess",
      "body": "Yes. When i see posts of girls on Instagram about what they’re eating and they’re thin and have perfect skin and nice clothes i admittedly get way more jealous than i feel comfortable admitting :(",
      "created_utc": 1624939510.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h3epbua",
      "author": "GAY_spaghettimonster",
      "body": "Yeah I totally understand that. The same things that seem forbidden for me are so easily enjoyed by everyone else and it’s just hard to watch people not even seem to care about what their eating when that’s 95% of my day so idk",
      "created_utc": 1624943225.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h3d8ud2",
      "author": "None",
      "body": "Mood ;~;",
      "created_utc": 1624915432.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h3flfwu",
      "author": "busted3000",
      "body": "Yes! Food seems so easy to other people, an occasion for joy even. It’s so stressful to me. I want to eat without a care in the world.",
      "created_utc": 1624970284.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3goc75",
      "author": "WideAtmosphere",
      "body": "OH absolutely! I have been jealous of 'normal eaters' since I was a teenager. I'm in my 40s! \"Why can't I just not be a huge fucking WEIRDO!?!?! WHY!!!\" I tell myself. But I know even if I ever recover....I never will be normal. This is something you control. You don't cure it.",
      "created_utc": 1624988350.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3hfhgp",
      "author": "midnight863",
      "body": "Yes! I remember before my ED when I was a little kid I would eat as much as everyone around me, especially at frequent family gatherings where me and my cousins would drink cup after cup of soda or eat a bunch of dessert or ice cream and eat all the burgers we’d want with no guilt. I miss that because even now that I’m trying to recover from my ED, I still feel slightly repulsed by the idea of eating large amounts of food and I’m just really not interested sometimes. I have to force myself to eat enough to gain weight. I don’t know if I’m going to be able to get to a place of truly loving food again. It makes me kinda sad. I miss who I used to be and I’m jealous of my cousins who thankfully never thought too much about food or developed EDs. I would do anything to go back to who I used to be and not worry. 😔",
      "created_utc": 1625000168.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3euprc",
      "author": "Newwavesupport3657",
      "body": "Yes:/ I am jealous they don’t count and over think “am I eating too much?” Or “am I possibly restricting?”",
      "created_utc": 1624947381.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3fj6lw",
      "author": "None",
      "body": "All the time.",
      "created_utc": 1624968854.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3gnorm",
      "author": "None",
      "body": "I think I’m bulimic but I’m jealous of anorexics because they don’t go through the binge/purge cycle every day…\n\nI used to have more anorexic tendencies, but now I’m more bulimic and I hate it because I wanna go back to when I didn’t do this bullshit every day.\n\nBut I am somewhat tired of having an eating disorder at all",
      "created_utc": 1624988072.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3h6dll",
      "author": "savexmexfromxmyxself",
      "body": "Yes all the time",
      "created_utc": 1624996156.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3ytuk6",
      "author": "None",
      "body": "I actually get really insecure even by the thought of that. So not jealous, just insecure.",
      "created_utc": 1625352857.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3edygk",
      "author": "None",
      "body": "Me too. I want to eat without worrying about calories, but want to have the body of someone with ana. I get it’s twisted, but I can’t help it.",
      "created_utc": 1624936245.0,
      "score": 13,
      "context": [
        {
          "id": "h3cwzde",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1624910348.0
        }
      ]
    },
    {
      "id": "h3goslg",
      "author": "WideAtmosphere",
      "body": "Same. My degree is in psychology and I've taken graduate classes in eating/feeding disorders. Yet here I am. I'm also a gym rat who helps mod an online-coaching business's 500k member group. I can tell someone else exactly how to get their dream body and control their diet. I can teach you to count macros/calories, I can teach you how to do a clean and jerk for God's sake. But I can't teach myself not to weigh my fucking yogurt despite having given myself hypoglycemia, vitamin deficiencies, and infertility. YAY!!!",
      "created_utc": 1624988547.0,
      "score": 3,
      "context": [
        {
          "id": "h3dry6y",
          "author": "Reversephoenix77",
          "body": "Yes! I've always thought it would be so amazing to just be able to eat normally without the obsessive planning and thoughts. I developed anorexia at 11 and I'm now almost freaking 40 years old and I still haven't figured out how to eat normal despite majoring in health science and working as a meal planner and fitness coach. Like I can plan \"normal\" meals for others based on their individual needs yet I can't seem to implement a \"normal\" eating pattern for myself regardless of anything I've tried. I always end up either bingeing (and sometimes purging) or end up severely restricting. I have a million restrictions and only a very small window that I allow myself to eat each day and even with a few stints in treatment, I can't seem to break away. \n\nI see people on tv just eating and ordering what they are in the mood for at restaurants and it just blows my mind. I wish I knew what that was like. I either eat too much or not enough, there has never been an in between.",
          "created_utc": 1624924705.0
        }
      ]
    }
  ]
}