{
  "id": "ojmtvl",
  "subreddit": "AnorexiaNervosa",
  "author": "Fragrant_Window_3730",
  "created_utc": 1626204147.0,
  "title": "wearing shorts",
  "selftext": "right now im on my way to the mall and im wearing jean shorts and a tight shirt that shows off my body. im really scared but i think i can do this. im a bit more confident than i used to be",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ojmtvl/wearing_shorts/",
  "score": 121,
  "num_comments": 19,
  "comments": [
    {
      "id": "h52jycu",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1626204154.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h53icst",
      "author": "antiquetears",
      "body": "You’ve got this! Jean shorts and a fitting shirt always looks good on people.",
      "created_utc": 1626220525.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h539vcn",
      "author": "dozyhaze",
      "body": "woo you got this!!",
      "created_utc": 1626216119.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h552hdx",
      "author": "axxxxxxxk",
      "body": "I always say to myself “someone’s yuck, is somebody else’s yum” when I’m feeling self conscious in a piece of clothing that I really wanted to wear… it’s a little silly I know",
      "created_utc": 1626259579.0,
      "score": 3,
      "context": []
    },
    {
      "id": "la0i3yz",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1719209759.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdck57t",
      "author": "Lafial169",
      "body": "Hey gabbs I'm sorry I failed you. Please don't block this account. I'm just really scared I'm just scared. I'm scared out of my mind all the time. I need your help honey I don't know what to do. I really fucking messed up honey. I really fucked things up honey. Honey I'm really scared. I'm scared. I thought if I made things really difficult for you if I showed you how bad life is without me that you couldn't take it and would give up and just get back. I'm really sorry I didn't know what I was doing I didn't know what would happen or what it would lead to I'm really sorry I didn't know this was going to happen.  I'm not a bad person I promise im not a bad person. I was just scared and didn't want lose everything.  I'm sorry for making this mess. I fucking made this mess I shouldn't have gotten your mum involved I shouldn't have said all the awfull stuff I didn't mean, I shouldn't have called the police or emailed your school. I just didn't wanna loose everything. I just didn't wanna loose everything I just didn't wanna greive I didn't wanna go through all that grief and depression I got so scared and lost my mind I'm sorry I let things get that bad. I'm really drunk and crying in bed but I want you to know I am sorry beyond sorry I'm such a terrible person I'm sorry. I could never hurt yoy I'm sorry you don't trust me anymore I get it I wouldn't trust me either I'm just so fucking sorry. \n\n I wish time travel existed so I could go back in time and punch the fuck out of myself. And tell myself how fucking retarded making things difficult for you was and how it wasn't helping at all and how it just pushes you away. I wish I was smart enough to see it earlier.\n\nIn my mind I wish I never left, in my mind I wish I never left you. I wish I stayed in that apartment with the cats. It's hella illegal and would make me an illegal alien which is kinda funny. In my head that's where home is that's where I feel safe and loved. In my head I'm still their. In my head I never left. \n\nGabby do you think thats what heaven is like? I feel like if I died that's where I'd go and spend eternity, that's where I wanna spend eternity. In that place I wish I never left. I wanna go to heaven, I wanna be in that place gain forever  happy forever. I wanna go to heaven.",
      "created_utc": 1739839431.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mecgv3u",
      "author": "Lafial169",
      "body": "Thank you so much for not blocking me. I did fail you in every way. I was such a bad boyfriend. With the cheating with how I spoke to you, how I neglected your needs. How I minimised how I was treating you. I don't know why I thought you'd never leave I don't know why I was so delusional I don't know what's wrong with me. I seriously don't know what's wrong with me why was I that delusional why did I think you'd never leave no matter how badly I treat you. Its not how people work and its not real life why did I think like that. Somethings actually wrong with me. \n\nLook none of this is your fault. And I'm sorry if I made you feel like if any of this was your fault. Cutting someone off for not being good for you is normal and the healtiest thing you can do you weren't wrong to do that. I didn't understand I wasn't good for you and I was still in that trance where I thought idk you know what I'm talking about where your still in love with someone and it makes you blind to common sense and normal behaviour. I'm sorry I didn't understand you were doing it because I'm bad for you I'm a bad influence and I can't treat you how you deserve to be treated. How we showed our love for eachother was so messed up like isolating eachother and the other stuff we did. Ik it's toxic and not good but I miss it sometimes because I've never been so intensly close with someone and I'll never be that close again with someone like that because it's toxic.\n\nAnd I'm sorry for the stuff I did after you broke up you being immature and lashing out at me is no excuse for any of it i was so hurt i thought it was okay but it isnt . I'm sorry I went so far. Ik your scared of me and you don't trust me at all. It hurts me so much that that's how you see me now. I'm sorry I made you scared I  could never hurt you or do anything bad to you like that I just lashed out without thinking. I realise my actions have consequences and things will never be the same between us because of what I've said and done. I wish I had the foresight and maturity not to have done that stuff. Please please no mater what please remember I never wanted to hurt you I was just hurt and I didn't know how to show how bad I was hurt. I was hurt and grieving so badly. And in the moment it genuinely felt like I was dying. I'm sorry for ever threatening you. I have no idea why I thought it was okay or why I did it? I wanted nothing more than for us to go back to talking and watching movies, how was threatening you helping? How was threatening you going to achieve that?.\n\nI wanna atone for all the wrong I've done so badly. I want you to trust me again and feel safe around me again. Most importantly I want you to love me again and treat me how you used to. Please gabby how do I do that? I've messed up so much and I keep messing up nothing I do helps it just makes things worse. I keep fucking up. I really need your help please tell me what to do. Please I keep fucking things up.  How do I get your trust back? How do I fix things between us? How?. Ik I still love you and ik despite what I've done and how I treated you ik what I feel for yoy isn't fake it's the deepest I've ever felt for anyone. I just wanna be in your arms. I want you to nuzzle me. I wanna wrap my legs around yours. I wanna hold your arm and wear your cloths. I wanna play with your hair. I want you to feel safe and loved and happy. I wanna make you happy. I'm really lost like in life and just everything but ik when I go through life I won't be able to do it without you. Your really important to me I can't do it without you. I messed up were in this situation because of me. I deserve this ik I do. I just wanna be happy and loved. That's it I'll be obedient ill do anything change anything sacrifice anything give anything up do whatever it takes go he'll and back please please just love me. I just wanna be loved by you it can't be anyone else it isn't the same. Your my person your the only person for me. Ik ill never be happy in life without you. I'll never be anything in life without you. I will never be loved, love from anyone else except you dosen't feel like love at all. I'll love you forever. Thats never gonna change. Its not a phase or just a moment or something.  We haven't been on good terms for a year and I still love you as much as I did 2 years ago ik I can't stop loving you. Please tell me how to fix all this. I don't wanna be alone, I don't wanna die alone gabby.",
      "created_utc": 1740321437.0,
      "score": 1,
      "context": []
    },
    {
      "id": "meckwk5",
      "author": "Lafial169",
      "body": "I hate myself for what I put you through, I hate myself for digging this whole. Making things 10 times worse than they ever had to be. I hate myself for escalating things so far. For being so volatile.  I don't know how to get out of this hole. I don't know how to show you I'm incapable of hurting you how to show you I will never lay a finger on you. I should have been better. You deserved so much better you didn't deserve to be scared for months, you didn't deserve to fear for your life. I'm beyond sorry, sorry isn't strong enough. I wanna kill myself so someone like me dosnet exist on this planet. Its awfull what I put you through. I was so blind so selfish I didn't see I couldn't even tell wrong from right. You were right gabby. You were right to leave you were right to block me and go no contact. I should've been understanding and given you space. I just wanna atone. I wanna be deserving again I wanna work to be deserving of your love. I wanna become someone you can love and feel safe I wanna be someone that you can see a future with. I wanna be the person you thought I was.",
      "created_utc": 1740322788.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h52l65d",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1626204666.0,
      "score": -1,
      "context": []
    },
    {
      "id": "h55ca9s",
      "author": "kiaraleee14",
      "body": "I believe in you! I know that you would be just stunning, and I'm so proud of you to go out of your safety zone and try something new! Sending my love 💕💕",
      "created_utc": 1626266465.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h55f9a6",
      "author": "murderousmacbeth",
      "body": "I remember how i wore low waisted jean shorts and a top for the first time after ive started to recover. The scariest part was to actually go out of the house but after that I distracted myself with all other chores i had to do and almost forgot i was wearing something that was revealing my body shape",
      "created_utc": 1626268172.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h56x9xz",
      "author": "hidinginthedark1704",
      "body": "U got this🥰 I’m sure you look amazing x",
      "created_utc": 1626292627.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6vlk3w",
      "author": "Dependent_Tadpole_37",
      "body": "I love high cut shorts",
      "created_utc": 1627506102.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6vlm13",
      "author": "Dependent_Tadpole_37",
      "body": "Half shirts",
      "created_utc": 1627506125.0,
      "score": 1,
      "context": [
        {
          "id": "h53icst",
          "author": "antiquetears",
          "body": "You’ve got this! Jean shorts and a fitting shirt always looks good on people.",
          "created_utc": 1626220525.0
        }
      ]
    },
    {
      "id": "h6vujum",
      "author": "Dependent_Tadpole_37",
      "body": "Half shirt high cut jean shorts",
      "created_utc": 1627510061.0,
      "score": 1,
      "context": [
        {
          "id": "h53icst",
          "author": "antiquetears",
          "body": "You’ve got this! Jean shorts and a fitting shirt always looks good on people.",
          "created_utc": 1626220525.0
        }
      ]
    },
    {
      "id": "h6vuqef",
      "author": "Dependent_Tadpole_37",
      "body": "I love to show off myong legs",
      "created_utc": 1627510145.0,
      "score": 1,
      "context": [
        {
          "id": "h53icst",
          "author": "antiquetears",
          "body": "You’ve got this! Jean shorts and a fitting shirt always looks good on people.",
          "created_utc": 1626220525.0
        }
      ]
    },
    {
      "id": "la3zbdf",
      "author": "Fragrant_Window_3730",
      "body": "i’m sorry i miss you so much i’m sorry",
      "created_utc": 1719263802.0,
      "score": 1,
      "context": [
        {
          "id": "la0i3yz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1719209759.0
        }
      ]
    },
    {
      "id": "h52pla4",
      "author": "bc_1411",
      "body": "*as long as you like your outfit, you're golden. Cuts, fit, other people's opinions on whether it looks nice-they're irrelevant.",
      "created_utc": 1626206646.0,
      "score": 6,
      "context": [
        {
          "id": "h52l65d",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1626204666.0
        }
      ]
    },
    {
      "id": "mpyee3r",
      "author": "Downtown_Anybody680",
      "body": "I'm sorry too you have no idea how sorry I am. I miss you so much. \n\nLife's not been good honey I've been so depressed and isolated and I kinda got better for a bit but then dad died and now I'm more depressed than ever and full of guilt and every complicated emotion. I just miss you and I miss my dad I miss you both. The guilts been killing me and everything in-between. I haven't done anything for uni either, I haven't done my dissertation at all everyone's submitted it the deadline was a week ago I have 4 other assignments I haven't done just missed a deadline this Monday. I'm failing more than you can fail. I'm not passing my final year, 3 years down the drain. I just don't wanna be alive tbh. Messed up everything.  I just wanna be happy, I just wanna be happy I just wanna be happy for once. Why is it so hard impossible to be happy. \n\nI thought happiness meant you, I thought the only thing that could makes me happy is you. I thought without you I wouldn't ever find happiness and when you said you didnt want me it feels like as if hapiness itself told me she dosnet want me, how can I ever find happiness when even happiness dosnet even want me. I don't even know if I was wrong for feeling like that I haven't found happiness like that since. I can't find happiness can't find it drinking, I can't find it in friends, video games, not even in god. I lost my happiness with you and my strength with my father. I wanna be happy again I wanna go back to when I was happy when I had a future planned out when I had happiness when I had my dad and you I had everything. I wanna go back to that.\n\n I wanna be loved again, I wanna go back to when I was understood and loved. Not just feared I hate being feared I hate being a bad person that's volatile and makes threats I hate that so much I wanna go back to when I wasn't like that. I wanna be understood again I wanna be seen as the person I am again I want my sadness to be understood my loss my pain my depression my loneliness I want you to see what's under my skin again I want you to see how scared I am how alone all the time I am I want you to see and feel how empty and numb I am how much I've lost my enjoyment.  I want you to see how I'm just like you I'm a human I'm a hurt human with feeling I'm a scared human who just wants to be loved who only just wants to be loved.",
      "created_utc": 1746067402.0,
      "score": 1,
      "context": [
        {
          "id": "la0i3yz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1719209759.0
        },
        {
          "id": "la3zbdf",
          "author": "Fragrant_Window_3730",
          "body": "i’m sorry i miss you so much i’m sorry",
          "created_utc": 1719263802.0
        }
      ]
    },
    {
      "id": "mw9t2is",
      "author": "RaspberryWeekly1603",
      "body": "What you did no matter how immature  isnt as bad as what i put you through, the 7 months of hell and shit i put your through. 7 months of broken trust. 7 months of paranoia. 7 months of betrayal. 7 months of heart ache. 7 months of brokwn dreams. 7 months of broken trust. 7 months of neglect. 7 months of cold love. 7 months of constant dread. Im not afraid to admit that i did that to you, i did that to you while telling you i loved you like no one else. I'm sorry it took you doing something drastic that affects me to finally experience what you went through and felt for so long, its the worst imaginable thing and I did that to you. How can a person treat somone they love like that? Yet i treated you like that. Im ashamed the oceon couldnt hold the shame i feel.  The only reason you've ever done anything to me is because I did it first i taught you how to do it. What you inflict onto me i did first. I see I was wrong. It's not your fault for hurting me I taught you how to hurt like that.\n\nYou weren't wrong for being scared to talk to me you weren't wrong for running away. I hate the person I was. I hate that I was such a repulsive and disgusting person that you had to run that you couldn't talk to me about something so important. Whenever you act like you don't love me it's because I act like that first your pointing the mirror back at me showing me, making me feel the lack of lobe you felt. I still love you to this day ill never act like I don't love you.thats a msutake ill never make. If I do not love you you cannot love me.\n\nGabby I genuinely hate the person I was. I genuinely hate how I treated you like filth like you dont matter like your disposable. I treated you like a stupid powerless helpless woman. I hate myself for cheating and being sneaky. I hate that I didnt put you first. I hate that I betrayed you. I hate how I made you feel unsafe. I hate that I didn't love you. I hate myself for not being able to say more than 2 words. I hate what I put you through. I hate what I did to you. I despise myself for how much pain and agony I gave you. I hate the empty I love you I gave you. I want to chnage gabby.\n\nGabby I want to change. I want to repent. I want to be absolved of my sins. I want to be a better man. I want to be what you deserve. I want to love you I want to cherish you. I want to support you. I want to make you feel beautiful I want to prop you up. I want to make you feel good about yourself. I want to was away your depression. I want to give you a home. I never want to be the person I was. I never want to cheat again I never wanna be that bipolar or un-understanding. In the day of my judgment when God asks me why I treated you like shit why I put so much hardship on you why I failed to love you, when god asks me i gave this gift to you to protect to nuture to give all the love you have , i gave you this wonderful woman to love more than anyone has ever loved, to treat as your equal to be your companion, i gave you this gift, why did you tramatise her why did you destroy her why did you abuse her why did you put her through hardship why did you hurt my child why did you put my child through that why did you make my child cry and vommit why did you give my child suffering. I will tell God I was an evil man I was a disgusting man i was a corrupt man and all mighty God I want to chnage I don't want to be like that anymore. Almight god I wanna love this woman. Almighty god this is the only woman I will ever love. Almighty god I want to be a good person. Almighty god I want to be cured. Almighty god I want to treat your child the way she deserves. Almighty god I am sin, I want to be good.\n\nI am melancholy I miss my home. please let me back home gabby.\nPlease let me back home.",
      "created_utc": 1749190208.0,
      "score": 1,
      "context": [
        {
          "id": "la0i3yz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1719209759.0
        },
        {
          "id": "la3zbdf",
          "author": "Fragrant_Window_3730",
          "body": "i’m sorry i miss you so much i’m sorry",
          "created_utc": 1719263802.0
        }
      ]
    }
  ]
}