{
  "id": "oo460d",
  "subreddit": "AnorexiaNervosa",
  "author": "SkullyPoet24",
  "created_utc": 1626794529.0,
  "title": "After so much meanspo from the hospital..",
  "selftext": "If the same doctors who want me to get help for my atypical anorexia nervosa are calling me fat and triggering me, why should I recover? I don’t see the point. The doctors say that I am malnourished, have probable brain damage from the lack of nutrients, low blood pressure, and that I am just as severely ill as someone with typical anorexia nervosa, yet, they called me fat. Atypical anorexia nervosa is a cage.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/oo460d/after_so_much_meanspo_from_the_hospital/",
  "score": 144,
  "num_comments": 13,
  "comments": [
    {
      "id": "h5vubol",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1626794529.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h5wc3pw",
      "author": "LiliumTheCrevette",
      "body": "Maybe it's because they think that with atypical anorexia it is okay because... It has 'atypical' in front of 'anorexia'. Maybe they are just insensible. \nEither way, they are horrible doctors if they say stuff like that. \n\nI have atypical AN too, and if I am honest, no one ever really told me what the exact difference is, in the clinic I went to they treated me no different from the other patients. \n\nWhat I can tell you: it doesn't matter what these doctors say. I think it is your decision what you do with your body; not theirs. They are only giving advice, and in a pretty bad way if I may say so. \nWhat matters is what you think. \nSo no, I am not saying you should not recover, because that's most probably not what you really want to live your life like. \nIt is the ED that makes people want to 'stay sick'. \n\nI'd recommend to you to try and recover from Ana. This does not necessarily involve weight gain. It's about coming to terms with food and your body. \n(It is still possible to lose weight in a healthy way afterwards if you feel the need to.) \n\nSo, why should you recover? To answer your question: You should recover for yourself, in order to be a happy, healthy person. Not because anyone forced you to. Recovery may be hard, but I believe it is worth the fight. It may have put you down, but even though the doctors were mean and super insensible, recovery is better than Anorexia. In the end, it's up to you what you will do with your life, and there's a lot of nice things in life to do. It's worth it if you really want to. \nStay strong, I believe in you. Hope you get better❤",
      "created_utc": 1626801886.0,
      "score": 37,
      "context": []
    },
    {
      "id": "h5ykbu7",
      "author": "SkullyPoet24",
      "body": "Instead of downvoting me, why don’t you tell me why the voice in my head is wrong when it says: “See! I told you you are fat!”? I am very sick. I’m willing to admit that but, I am reluctant to recover because of the all of the horrible words and negativity in this hideously twisted world. I see so many ads on television on food and weight loss pills. I have had too many people make remarks on my size—for all these reasons, I feel invalidated, I feel let down, I feel hurt, I feel like recovery would not work. I am a tall woman. I come from a long line of curvy women. I have a genetic condition that affects the muscle tone in my abdomen. Atypical anorexia nervosa is pretty much all I have known for myself mentally and medically since I was eleven years old. I’m in my mid—late twenties now. I have received no treatment that has worked. I was tube-fed once—which was absolutely disastrous. Please understand, I’m severely mentally ill—that is why I consider my mind to be sick.",
      "created_utc": 1626838506.0,
      "score": 11,
      "context": []
    },
    {
      "id": "h5x4t0d",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1626814005.0,
      "score": 18,
      "context": []
    },
    {
      "id": "h5xovzm",
      "author": "None",
      "body": "aw man, im so sorry, i cannot even begin to imagine how invalidated and upset you must be feeling...unfortunately not many doctors are well educated on the field of eds.. they see it as \"oh ur skinny = anorexia,,, oh you puke = bulimia\". its so outdated.. eds are a brain issue not a weight issue, i hope you know that ur loved here and valid and we all understand this horrible thing ur suffering through, you are definitely deserving of a healthy relationship with food and a good self esteem, recovery is always worth it even though at times its difficult for us to see why, especially if our surroundings isnt understanding. all i can wish you is luck and i hope you find it in you to love yourself and heal",
      "created_utc": 1626823119.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h9wzn56",
      "author": "haumea_jouhikko",
      "body": "I think you are NOT fat, BFF!! If they are triggering you, then they are wrong!! You've got a perfecct body shape, beauty girl!! I think you are not fat and you know my opinion is more valid than a stranger's!!",
      "created_utc": 1629644567.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h5x5xkx",
      "author": "quuerthotthrowaway",
      "body": "A shitty one, lots of medical workers get away with being verbally abusive to patients actually. And I think OP knows the difference between medical terminology and literally being called fat, even if they’re both triggering to be referred to as.",
      "created_utc": 1626814479.0,
      "score": 16,
      "context": [
        {
          "id": "h5x4t0d",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1626814005.0
        }
      ]
    },
    {
      "id": "h5xc14b",
      "author": "lesbian_canadian",
      "body": "My thoughts too",
      "created_utc": 1626817154.0,
      "score": 8,
      "context": [
        {
          "id": "h5x4t0d",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1626814005.0
        }
      ]
    },
    {
      "id": "h5xxtp4",
      "author": "SkullyPoet24",
      "body": "“Obese” and “overweight” translate to “fat” in my sick mind.",
      "created_utc": 1626827480.0,
      "score": -5,
      "context": [
        {
          "id": "h5x4t0d",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1626814005.0
        }
      ]
    },
    {
      "id": "h5xy1k9",
      "author": "SkullyPoet24",
      "body": "I wish I could think positively right now but, atypical anorexia nervosa owns my brain right now.",
      "created_utc": 1626827589.0,
      "score": 4,
      "context": [
        {
          "id": "h5xovzm",
          "author": "None",
          "body": "aw man, im so sorry, i cannot even begin to imagine how invalidated and upset you must be feeling...unfortunately not many doctors are well educated on the field of eds.. they see it as \"oh ur skinny = anorexia,,, oh you puke = bulimia\". its so outdated.. eds are a brain issue not a weight issue, i hope you know that ur loved here and valid and we all understand this horrible thing ur suffering through, you are definitely deserving of a healthy relationship with food and a good self esteem, recovery is always worth it even though at times its difficult for us to see why, especially if our surroundings isnt understanding. all i can wish you is luck and i hope you find it in you to love yourself and heal",
          "created_utc": 1626823119.0
        }
      ]
    },
    {
      "id": "h5xzlnv",
      "author": "sorcerers_apprentice",
      "body": "Yeah, regardless of how they said it, it’s grossly inappropriate to bring up when someone is in the hospital for medical complications of a restrictive ED. Sorry you had to go through that.",
      "created_utc": 1626828362.0,
      "score": 8,
      "context": [
        {
          "id": "h5x4t0d",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1626814005.0
        },
        {
          "id": "h5xxtp4",
          "author": "SkullyPoet24",
          "body": "“Obese” and “overweight” translate to “fat” in my sick mind.",
          "created_utc": 1626827480.0
        }
      ]
    },
    {
      "id": "h5y5c2p",
      "author": "smorespoptart420",
      "body": "True that makes sense I’m sorry:(",
      "created_utc": 1626831153.0,
      "score": 4,
      "context": [
        {
          "id": "h5x4t0d",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1626814005.0
        },
        {
          "id": "h5xxtp4",
          "author": "SkullyPoet24",
          "body": "“Obese” and “overweight” translate to “fat” in my sick mind.",
          "created_utc": 1626827480.0
        }
      ]
    },
    {
      "id": "h5xzrgk",
      "author": "SkullyPoet24",
      "body": "I feel terrible. I barely eat anything as it is.",
      "created_utc": 1626828444.0,
      "score": -3,
      "context": [
        {
          "id": "h5x4t0d",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1626814005.0
        },
        {
          "id": "h5xxtp4",
          "author": "SkullyPoet24",
          "body": "“Obese” and “overweight” translate to “fat” in my sick mind.",
          "created_utc": 1626827480.0
        },
        {
          "id": "h5xzlnv",
          "author": "sorcerers_apprentice",
          "body": "Yeah, regardless of how they said it, it’s grossly inappropriate to bring up when someone is in the hospital for medical complications of a restrictive ED. Sorry you had to go through that.",
          "created_utc": 1626828362.0
        }
      ]
    }
  ]
}