{
  "id": "opk9j1",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1626979546.0,
  "title": "Anyone else afraid of being warm?",
  "selftext": "When I was a fat kid, everyone in my class would complain about being cold and I’d say “Why are yall cold? It ain’t cold at all!”\n\nAnd now that I’ve restricted and purged myself to this point, I’m almost always either cold or okay. I haven’t been hot without being in the bath in a while… \n\nSo whenever I feel warm in a T-shirt, I think “why do you feel warm? You shouldn’t feel warm unless you’re getting fat or working out. You aren’t working out and you’d better not be getting fat!”",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/opk9j1/anyone_else_afraid_of_being_warm/",
  "score": 202,
  "num_comments": 19,
  "comments": [
    {
      "id": "h65pggf",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1626979547.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h664kdt",
      "author": "pretti3rjesus",
      "body": "literally me. i used to be a fat kid too. if i feel warm in situations where i’m not exercising, it directly sends me into panic mode.",
      "created_utc": 1626986189.0,
      "score": 61,
      "context": []
    },
    {
      "id": "h66j3n9",
      "author": "derpyfreed",
      "body": "i’ve never been scared of it but i like it when i freeze because in my mind it means thin.",
      "created_utc": 1626992723.0,
      "score": 23,
      "context": []
    },
    {
      "id": "h66xf21",
      "author": "rileyyj001",
      "body": "Me. Every. Single. Day. \n\nSometimes, I’ll notice that I’ve gone a little while (an hour or two) and haven’t felt cold and the internal freak outs are next-level. \n\nAs I write this, I’m at peace because I’m wrapped up in my bed in sweatpants and a sweatshirt and I’m still cold. I hate this f-ing life.",
      "created_utc": 1627000182.0,
      "score": 15,
      "context": []
    },
    {
      "id": "h66rmcu",
      "author": "XXBATNT",
      "body": "I don't know if this'd help you but to me it feels like a blessing. I was bigger as a kid and still always cold (cold country) - so I HATE being cold and warmth is like the best thing ever, I behave like a lizard. As much as I'd like to move back or visit the country I'm from, where the healthcare and social conditions are better... my body temp and mental health are too afraid to do it.",
      "created_utc": 1626996933.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h67d5vm",
      "author": "kilgore---trout",
      "body": "dude I thought I was just crazy. this has actually been really triggering for me since summer started and is part of what derailed my recovery",
      "created_utc": 1627008122.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h67j3o4",
      "author": "mysticspiracy",
      "body": "this. i was also a fat child; there’s so many things that happened to me back then that if they happen now i attribute them as “failures”",
      "created_utc": 1627011316.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h67grxy",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1627010032.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h68kx8f",
      "author": "raspberry-enthusiast",
      "body": "if i’m not under a blanket and i’m warm, i definitely find it upsetting. my thoughts are similar, and feeling warm makes me feel like i’m faking/“not sick enough”. being cold is such a stereotypical anorexia thing that’s pretty common i think, so my brain just invalidates me a bunch. somehow i seem to forget all the times i’m cold when i absolutely shouldn’t be lmao",
      "created_utc": 1627040686.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h69h88t",
      "author": "licegirl",
      "body": "Oh my god. I thought no one would ever also say this...\n\nI remember when I was really mentally sick and with my two skinnier friends, we were playing outside and running around and suddenly I felt really hot. My two friends said they still felt cold and I felt genuinely offended. Like they called me fat lol.\n\nI still get that way, but when I feel hot I try not to talk about it because I feel like they will think I am fat.",
      "created_utc": 1627056565.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h67leb7",
      "author": "None",
      "body": "Same. Up until I started restricting I was always seen as really warm or overheating and it bothered me.",
      "created_utc": 1627012619.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h68wwwx",
      "author": "Kelloggs_pornflakes",
      "body": "I used to be cold all the time and now I’m not and honestly I don’t like it",
      "created_utc": 1627047563.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hwpxa3f",
      "author": "None",
      "body": "\"WhY iS yUoR sEaT sO wArM?\"\n\nThat use to happen so often in middle/high school and I'd get so self conscious. I also would sweat a lot then since I wore the school's only uniform jacket even when it was 90F out so I probably was very warm lol. Definitely feel you, I'm always wildly self conscious about how warm I get for the same reason you mentioned.",
      "created_utc": 1644714747.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h668q2a",
      "author": "IEatAssWithFork",
      "body": "How do you fight that?",
      "created_utc": 1626988027.0,
      "score": 12,
      "context": [
        {
          "id": "h664kdt",
          "author": "pretti3rjesus",
          "body": "literally me. i used to be a fat kid too. if i feel warm in situations where i’m not exercising, it directly sends me into panic mode.",
          "created_utc": 1626986189.0
        }
      ]
    },
    {
      "id": "h66x3qu",
      "author": "None",
      "body": "Yeah. When I’m warm I think I need to either earn that warmth, or make myself cold.\n\nThe voice is quieter in the cold",
      "created_utc": 1627000020.0,
      "score": 13,
      "context": [
        {
          "id": "h66j3n9",
          "author": "derpyfreed",
          "body": "i’ve never been scared of it but i like it when i freeze because in my mind it means thin.",
          "created_utc": 1626992723.0
        }
      ]
    },
    {
      "id": "h6815z5",
      "author": "None",
      "body": "Summer did that to me too!\n\nIt was warm and I’d think “Bruh wtf why aren’t you shivering? You were doing that 4 months ago!” And now I just can’t wait until winter even though I know I’ll come to hate the cold.",
      "created_utc": 1627023753.0,
      "score": 3,
      "context": [
        {
          "id": "h67d5vm",
          "author": "kilgore---trout",
          "body": "dude I thought I was just crazy. this has actually been really triggering for me since summer started and is part of what derailed my recovery",
          "created_utc": 1627008122.0
        }
      ]
    },
    {
      "id": "h68114e",
      "author": "None",
      "body": "I think afraid was the wrong word for it, but I do avoid it because it just reminds me of how fat I was.",
      "created_utc": 1627023639.0,
      "score": 1,
      "context": [
        {
          "id": "h67grxy",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1627010032.0
        }
      ]
    },
    {
      "id": "h68u02j",
      "author": "None",
      "body": "Yeah, I remember reading someone’s post about crying in the shower and how cold it is, and I’m wondering “But if hot water is against you, it’s fine…” And then I felt like I wasn’t sick enough until I was cold even though water was supposed to keep me warm.\n\nWhen I wanna punish myself for eating or sum I’ll turn the water cold for as long as I can stand, which isn’t very long.\n\nBut getting cold for me is quite common, or being in that temperature sweet-zone while everyone else is sweating their balls off",
      "created_utc": 1627046102.0,
      "score": 2,
      "context": [
        {
          "id": "h68kx8f",
          "author": "raspberry-enthusiast",
          "body": "if i’m not under a blanket and i’m warm, i definitely find it upsetting. my thoughts are similar, and feeling warm makes me feel like i’m faking/“not sick enough”. being cold is such a stereotypical anorexia thing that’s pretty common i think, so my brain just invalidates me a bunch. somehow i seem to forget all the times i’m cold when i absolutely shouldn’t be lmao",
          "created_utc": 1627040686.0
        }
      ]
    },
    {
      "id": "h67ddvm",
      "author": "PotatoesnClouds",
      "body": "Go to therapy. Find a therapist that specializes in ED.",
      "created_utc": 1627008230.0,
      "score": 18,
      "context": [
        {
          "id": "h664kdt",
          "author": "pretti3rjesus",
          "body": "literally me. i used to be a fat kid too. if i feel warm in situations where i’m not exercising, it directly sends me into panic mode.",
          "created_utc": 1626986189.0
        },
        {
          "id": "h668q2a",
          "author": "IEatAssWithFork",
          "body": "How do you fight that?",
          "created_utc": 1626988027.0
        }
      ]
    },
    {
      "id": "h69tuog",
      "author": "MaybeMorality_95",
      "body": "‘That voice is quieter in the cold’ :( true on many different levels",
      "created_utc": 1627061947.0,
      "score": 3,
      "context": [
        {
          "id": "h66j3n9",
          "author": "derpyfreed",
          "body": "i’ve never been scared of it but i like it when i freeze because in my mind it means thin.",
          "created_utc": 1626992723.0
        },
        {
          "id": "h66x3qu",
          "author": "None",
          "body": "Yeah. When I’m warm I think I need to either earn that warmth, or make myself cold.\n\nThe voice is quieter in the cold",
          "created_utc": 1627000020.0
        }
      ]
    }
  ]
}