{
  "id": "ovrazb",
  "subreddit": "AnorexiaNervosa",
  "author": "shiratakimoodles",
  "created_utc": 1627821206.0,
  "title": "I feel like I'm faking my ED fr.",
  "selftext": "I don't know. Some days I get super obsessive over limiting calorie intake, go on fasts, other days I'm like \"Fuck it. I'll eat whatever I want\". Then other days I cry over my weight and ended up punishing myself for gaining weight or not counting calories. Fuck....... I'm so confused. I'm not diagnosed by a professional so this makes me even more nuts. I could be just faking it.. I don't know..... Does anyone ever feel like this? I have no one to talk in real life",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ovrazb/i_feel_like_im_faking_my_ed_fr/",
  "score": 146,
  "num_comments": 16,
  "comments": [
    {
      "id": "h7b2bwx",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1627821206.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7b5v35",
      "author": "None",
      "body": "I feel like that just about constantly. I wasn’t diagnosed when I was younger because I was always told I was too heavy to have an ED. At the time that was a required criteria for diagnosis, and I was actually told to lose more weight. Personally I go through periods of high restriction, then I struggle with trying to control binges. As an adult I’ve learned this is disordered behavior, but it almost feels like being older adds more difficulty to getting diagnosed. \n\nA lot of things make me feel like maybe I’m faking it, but I also can’t stop it on my own. The restriction, the obsession with tracking, the daily weigh-in rituals, the thoughts of fuck it I’m “failing” and binge episodes taking over, being angry at myself for “allowing” myself to gain weight… it’s exhausting.",
      "created_utc": 1627823425.0,
      "score": 27,
      "context": []
    },
    {
      "id": "h7bgyk1",
      "author": "New2ad",
      "body": "My psychiatrist told me that any diagnosis comes down if it is severely impacting your life in a negative way. Your thoughts and suffering is real. No disorder is the same to everyone.",
      "created_utc": 1627829242.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h7b5hi8",
      "author": "420chiefqueeef69",
      "body": "I don’t think you’re faking it. Weight has nothing to do with your ED it’s simply a side effect. It’s the thoughts and the behaviors. You aren’t alone. I’m pretty sure imposter syndrome is very common amongst eds. Edit wanted to say you are not alone",
      "created_utc": 1627823228.0,
      "score": 28,
      "context": []
    },
    {
      "id": "h7bh9gu",
      "author": "CoralineLecter",
      "body": "I can relate with u. I have been diagnosed from an psychotherapist with Anorexia Nervosa tree Years ago, but right now Im at a \"healthy weight\". My mind is also switching from : Oh, lets fast for X days - and ah, i should give up this ed and eat the unhealthy stuff... \nOnly one of my closest friend understands, what is going on, but alot of people think \" Im just eating clean and i love running\" It is very annoying. So, as u can see, alot of people are not understanding what ed's actually are. I think u are not faking it. It is only the part of our brain thinking : I am not sick enough...",
      "created_utc": 1627829390.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h7bv5ml",
      "author": "None",
      "body": "I’ll starve myself to being underweight and then I’ll binge my way back to my starting weight in the timespan of a few months and then be too afraid to go outside and then restrict myself back to underweight all over again. I can’t call myself anything but a fuck up I hate living like this so much and you’re not alone",
      "created_utc": 1627835809.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h7b53n7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1627823018.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7bkep8",
      "author": "fisheggmafia",
      "body": "Yeah, I guess it's like having depression. I'm not depressed every single day but I know I have depression.  I guess it is the same for EDs I go through periods of days with the heck I'll eat what I want and not think about it and I don't let it get to me. Other days I just have extreme guilt over eating and obsess over what I am eating.",
      "created_utc": 1627830864.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h7butws",
      "author": "derpyfreed",
      "body": "SAME i’m not diagnosed so i feel like i’m faking this because some days i eat, some days i don’t",
      "created_utc": 1627835659.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7bjcqi",
      "author": "ningyizhuo",
      "body": "I'm diagnosed and I feel the same way as you do. I think it's normal..",
      "created_utc": 1627830380.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7dgm7e",
      "author": "dspencer79",
      "body": "I relate. I go through periods of restricting, and then I'll go a month or two where I feel perfectly fine and I'm able to eat - and then it starts to creep up on me and I feel uncomfortable with myself again and the cycle repeats. \n\nI don't think you're faking it, and you're not alone in thinking that you are - I often think like that when I'm doing ok, and then it gets me back into my disordered habits because I try to prove that my struggles were valid. I try to remind myself that if it happened it indeed happened, and doing alright doesn't erase what I went through.",
      "created_utc": 1627863874.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7dhvp8",
      "author": "AIiVinci",
      "body": "I don’t know how helpful this can be but this is how I generally deal with these thoughts: analyze the word “ED”.\nIt simply means “eating disorder”.\nIt doesn’t imply that you have to have a specific type of body or weight!!\nIt simply means that your relationship with food is not normal/good! In my opinion, even having an average calorie intake but obsessing all day over it could be considered an eating disorder (even wikipedia describes it as “a mental disorder defined by abnormal that negatively affects a person’s physical or MENTAL health”).\nSending much love to you, have a great day <3",
      "created_utc": 1627864553.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7dtjmt",
      "author": "None",
      "body": "Just because someone else has it worse doesn’t mean your own struggles are any less valid",
      "created_utc": 1627870730.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7ekupu",
      "author": "Media-Time",
      "body": "The only thing that matters is that you’re still struggling. Having an okay day does not mean you’re automatically healed or never had an Ed. Nobody sane wants to be anorexic or have an active ed. It’s torture. If you’re there or wanting to be there you’re in hell. Try not to think about if it’s “ real”’ or not. Think about how your thoughts and actions are affecting your life.",
      "created_utc": 1627888972.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ha2679r",
      "author": "MintFive_Fant",
      "body": "I feel the same.",
      "created_utc": 1629741853.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7cxxlx",
      "author": "None",
      "body": "Me too",
      "created_utc": 1627854241.0,
      "score": 1,
      "context": [
        {
          "id": "h7b53n7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1627823018.0
        }
      ]
    }
  ]
}