{
  "id": "ovrpf9",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1627822893.0,
  "title": "I wish people would stop shaming me for eating",
  "selftext": "Recently, I went to the movies with some friends. We got a huge bucket of popcorn to share, and I ate less than both of my friends did, I hardly had any of the popcorn and then when we went out for dinner a few hours after the movie and I wanted to order a salad wrap, one of them said ‘good choice, you ate like half the popcorn earlier,’ and they both laughed at me. I didn’t end up eating dinner. Then they proceeded to comment on how I wasn’t eating, and said ‘bro why are you starving yourself??’ I don’t even know what to do anymore. I can’t please anyone. \n\nI feel like every time I eat in front of people they make comments about it, despite the fact that all my friends know about my experience with anorexia. The comments just keep coming. Now I can’t eat anywhere except my house, because I’m terrified of what people will say.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ovrpf9/i_wish_people_would_stop_shaming_me_for_eating/",
  "score": 110,
  "num_comments": 9,
  "comments": [
    {
      "id": "h7b4wkr",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1627822896.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7cakne",
      "author": "berserker99alita",
      "body": "Those don’t sound like friends they sound like bullies I’m so so sorry no one deserves to be treated like that",
      "created_utc": 1627843030.0,
      "score": 56,
      "context": []
    },
    {
      "id": "h7bm4c0",
      "author": "wesjag0",
      "body": "Ugh I used to have friends like that. It was horrible, I was at my worst and I'd eat when I was around them so I didn't raise suspicion. They constantly said shit like \"you're eating again, you had more than us, etc. I know I had less, I literally thought of it the entire time. Fuck off",
      "created_utc": 1627831647.0,
      "score": 23,
      "context": []
    },
    {
      "id": "h7c8hzx",
      "author": "NeatAd766",
      "body": "those are some shitty “friends” and maybe they are saying it sarcastically but i know it hurt since the words came from your friends \n\nthey could be jealousy, they could be joking, they are stupid, but maybe try talking to them if you know you can trust them or cut them off",
      "created_utc": 1627842046.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h7cfbk3",
      "author": "supremekimilsung",
      "body": "I know how that feels. My family all the time openly comments about my eating habits, almost on a daily basis. They're well aware of my anorexia too. They also comment so much about dieting, being too chubby, trying to get slimmer, etc.",
      "created_utc": 1627845300.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h7btt0f",
      "author": "todefyodds",
      "body": "Sit them down. Talk to them. It's possible that they think their comments are encouraging, instead of just the opposite.",
      "created_utc": 1627835175.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h7ej1pq",
      "author": "None",
      "body": "I had the same but with family. My mom and grandma would basically sit down and watch me eat (they wouldn’t be eating), then tell me to slow down or what order to take my bites in. They got the hint once I took my plate into the kitchen and hid behind a cupboard to eat alone.\n\nI don’t think theirs was actively malicious though. Your friends sound like they are.",
      "created_utc": 1627887400.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7ephrh",
      "author": "cardigan_bee",
      "body": "They’re making those comments knowing you struggle with anorexia, clearly they have some serious empathy issues. \n\nYou absolutely deserve to eat and nourish yourself at whatever time and in whatever quantity. If they won’t say it I will.",
      "created_utc": 1627893144.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7ev1pd",
      "author": "ipeed_mypants",
      "body": "they are not good friends, or even good people for that matter! to comment on things like that with other people is so rude and harmful, and it is completely unacceptable since they know about your ed. \n\nit can be really awkward to speak up against people, especially those who are ‘friends’ but if what they’re saying is negatively affecting you then that is probably the best thing to do- if you set boundaries and they still don’t respect them, try to distance yourself from hanging out with them in general. it can cause some unnecessary issues just to completely stop being friendly with them, but if hanging out with them is damaging then try to focus on yourself and not hang around them as much. it sounds way easier than it is, but it will be so helpful in the long run! \n\nremember you are loved, i hope things get better for you!! :))",
      "created_utc": 1627898159.0,
      "score": 1,
      "context": []
    }
  ]
}