{
  "id": "owf2mv",
  "subreddit": "AnorexiaNervosa",
  "author": "monsterintheuniverse",
  "created_utc": 1627912707.0,
  "title": "This disorder is so isolating",
  "selftext": "It’s like a cult leader that convinces you to stay faithful by turning down dinner with friends, staying in your room alone when your parents make you food, missing out on networking opportunities bc the work event has appetizers, and even when you do decide to socialize you have this voice screaming in your head the whole time about “don’t eat that”, “you’re a pig, you’re weak if you eat that” and it keeps you from making a genuine connection with anyone.  It fogs up every conversation.  It wants you to be friends with it, and it alone.  It will yell at you until you push everyone away, and are starving , alone.  That’s what it freaking wants\n\nI have been dealing with this all week and I’m just so tired of it that I don’t want to be conscious anymore",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/owf2mv/this_disorder_is_so_isolating/",
  "score": 112,
  "num_comments": 6,
  "comments": [
    {
      "id": "h7fh1i5",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1627912708.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7g141r",
      "author": "asoftyam",
      "body": "I feel this. It destroys everything and yet there’s no escape. It’s toxic.",
      "created_utc": 1627921747.0,
      "score": 19,
      "context": []
    },
    {
      "id": "h7gkl0k",
      "author": "SpiralConsciousness",
      "body": "Agreed. Even when you're eating \"normal\" it still manages to get you to stay away from friends and family only to make you feel guilty for always declining to go out when you finally do go. This shit talker never stops.",
      "created_utc": 1627930141.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h7j97vx",
      "author": "likeafkincoma",
      "body": "I feel you. Its a continuous cycle of not going out with others and feeling bad and going out with others and feeling bad. It feels like you can't win no matter what. BUT, you can win. Recovery is possible and you can recover from an ED. I wish you all the best of luck with this - choosing recovery was the best (but also one of the hardest) decisions I ever had to make, but now I am thriving - I have a life. I can go out with friends and family for food, I can go to that work event, I can sleep in instead of waking up in the middle of the night to exercise, I can actually engage in conversation with others cos my mind isn't so preoccupied with food and simply staying alive.\n\nSaying goodbye to your ED is absolutely terrifying, but is so freeing. You don't have to live with the isolation it demands.\n\nSending lots of love to each and everyone of you, you got dis 💅🏼",
      "created_utc": 1627983510.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7heqq4",
      "author": "Listen_Successful",
      "body": " Mine keeps reminding me that I don’t deserve food, and I have to go through all of these measuring & math, counting macros, type things and put off eating for hours, sometimes say fuck it and go to bed without eating because I want that voice to shut up. Then repeat the next day after 3 hours of sleep 😢",
      "created_utc": 1627943502.0,
      "score": 5,
      "context": [
        {
          "id": "h7g141r",
          "author": "asoftyam",
          "body": "I feel this. It destroys everything and yet there’s no escape. It’s toxic.",
          "created_utc": 1627921747.0
        }
      ]
    },
    {
      "id": "h7hvyn1",
      "author": "monsterintheuniverse",
      "body": "It’s not living.  It’s like you’re already dead and you’re in purgatory",
      "created_utc": 1627951668.0,
      "score": 3,
      "context": [
        {
          "id": "h7gkl0k",
          "author": "SpiralConsciousness",
          "body": "Agreed. Even when you're eating \"normal\" it still manages to get you to stay away from friends and family only to make you feel guilty for always declining to go out when you finally do go. This shit talker never stops.",
          "created_utc": 1627930141.0
        }
      ]
    }
  ]
}