{
  "id": "oxki55",
  "subreddit": "AnorexiaNervosa",
  "author": "Minimum-Cheesecake",
  "created_utc": 1628049651.0,
  "title": "Apparently all I have to do is eat. I'm cured!",
  "selftext": "So, I just read something to my boyfriend, the man who is supposed to love me. It was a blog post I wrote about how scary it is to see physical changes in my body from anorexia and having to accept this could kill me. I poured my fucking heart out. I asked him numerous times if he was sure he wanted me to read it before I hesitantly did.\nWhat I got in return was my boyfriend literally screaming at me, telling me that \"all I need to do is eat!\" Not a gentle prodding, but a screaming at the top of his lungs, \"you're just making excuses\" and \"you're not trying because you think you need professional help to get better when all you need to do is eat!\" When I said I needed support and I had nobody to help me, he proceeded to scream at me more, telling me he's \"tried it my way for months and I've only gotten worse\" and that what I need is to be \"forced to eat, forced to get better.\" Then he threatened to commit me. So, that was awesome. Am I wrong here? I told him he can't fix this. He refuses to believe that. But then when his approach doesn't work, it's my fault. I get that he's scared because he loves me and doesn't want me to die, but this only pushes me away more and makes me want to eat even less. Not to mention, when I eat something that was really hard for me, he doesn't get that. He just says I need to eat more than that. How do I deal with this? Any tips? I've tried telling him to research eating disorders, but that's gone nowhere.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/oxki55/apparently_all_i_have_to_do_is_eat_im_cured/",
  "score": 109,
  "num_comments": 19,
  "comments": [
    {
      "id": "h7n0lps",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1628049651.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7n4bh8",
      "author": "jiyoxa",
      "body": "I can see both of your perspectives. It sounds like he has some maturing to do. I would recommend that you tell him that if he doesn't research eating disorders and learn how to support you correctly, then he may not mention anything about it. No comments on your body or eating habits.",
      "created_utc": 1628051889.0,
      "score": 50,
      "context": []
    },
    {
      "id": "h7n6zai",
      "author": "None",
      "body": "Would you mind sharing the post? I think reading it might resonate with a lot of us.\n\nI can’t give much in terms of relationship advice since I’m not in one myself, but the strain my Ed has put on friendships is quite similar. One of my very close friends stopped talking to me for a while because of how bad my health got and they were mad I wasn’t “trying harder” by “just eating.” It hurt a lot, and felt like he was giving up on me. But I realized it’s not fair for people like them to worry about me and my ed when it *looks* like it’s that easy, to “just eat” and be cured. They don’t have the experience so they can’t understand what it’s like in our shoes. I also want to ask, *are* you in recovery or trying to make recovery-oriented choices? Because if not, then your boyfriend does have a right to be worried and upset; after all, you’re hurting in front of his eyes and he can’t do anything to save you. It’s scary and sad. I think you should refer him to some informational websites/info graphics/resources on eds.",
      "created_utc": 1628053606.0,
      "score": 22,
      "context": []
    },
    {
      "id": "h7nart4",
      "author": "DiligentCheesecake44",
      "body": "Our loved ones are hurt just as much because of our ED. It sounds like all the emotions, anger and frustration he’s had just boiled over. Give him some grace this one time. Often, our family doesn’t understand the sickness either and to them we are cured by eating the food.",
      "created_utc": 1628056249.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h7nzq5r",
      "author": "theeveninggloam",
      "body": "I have been in this exact situation; my bf did not understand how his mere presence did not cure me of all my mental health problems and he threatened to have me committed.\nI kicked his ass to the curb (this was a 5 year relationship with plans for marriage, the works) and told him exactly where he could shove it.\n\nYou do NOT need someone who is making your struggles all about themselves. People don’t realise how hard it is to ‘just fucking eat’ and you deserve to be supported through your struggles and your achievements. He has refused to research this, and he has refused to acknowledge your request for help. This is not a person who is supportive.\n\nI’m so sorry that this is happening to you and that the one person that is supposed to support you is letting you down in such a major way. ❤️",
      "created_utc": 1628077084.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h7o6023",
      "author": "Black-Liqour",
      "body": "It seems like both of you are overwhelmed and that you guys might need some space. I hope you understand that even though you have to deal with your ED everyday, it’s really hard for some people to handle the ones they love going through it. It’s not your fault he can’t handle it, and it’s most likely that it’s not his fault either. People have a threshold for what they can handle and I’m pretty sure this goes way beyond that if this is how he’s reacting. \n\nSometimes it’s good to understand that the relationship at this point is struggling and it’s up to you guys to make the “right decision” to help you both overcome these difficulties. I’m not saying that you should do anything but whatever your mind thought of when you read the “right decision”, after all it probably is the right decision if that’s what you thought of.",
      "created_utc": 1628080942.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7o9ewp",
      "author": "breakfasttales",
      "body": "honestly as someone who has dealt with an eating disorder and watched someone i loved had one, i see both sides. he doesn’t understand and sees it as easy to “just eat.” he is clearly scared and worried you will die. i know it sucks and i hate to admit it also but the first step to getting better is to get food into your malnourished brain. on the other hand i understand where you are coming from being that you are living with this and want him to support you in a non-forceful way. it sounds like you both need to sit down with a professional and talk about healthier ways he can help you during this and even taking the first step for yourself to professional help. personally i don’t believe committing someone is the first step but that’s what a professional will help you decide. good luck and i hope this is received the way i’m meaning for it to be",
      "created_utc": 1628082757.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7pgylm",
      "author": "theolivedove",
      "body": "If you don't mind me asking, how long have you two been together? Have you had your eating disorder the entirety of your relationship?\n\nI dealt with this with my previous boyfriend. We were together for about four years (broke up a couple times). I loved him so much, but he had difficulty understanding my eating disorder. He reacted the way your boyfriend did quite a few times. We had multiple blow up fights, because he would get so frustrated with me. I wouldn't eat out at restaurants with him, and I had to have my safe foods all the time at specific scheduled times or I'd have a panic attack (I still do these things). He eventually did some research and tried to educate himself, but he still never fully grasped why I was that way. He was such a logical thinker, and I'm extremely emotional. I would explain to him how I was feeling, and he would say, \"it doesn't matter how you feel; these are the facts.\" I don't blame him for leaving me, because I didn't change/get better. Still, I wished he could have stayed. He said I didn't love him anymore, because I didn't TRY to change. I was trying though, and I have been...but it was never enough in his eyes. I don't know. This disease sucks.\n\nI got back to a \"healthy\" weight after being at my lowest, but all of my mental shit is still here and my body image is WAY worse. I was almost admitted to an inpatient facility, and he was gonna break up with me if I did. I was able to move back in with my parents instead, so we stayed together. It was hard though. \n\nI apologize for rambling about my experience, haha. I guess what I'm trying to say is that he has to be willing to put in the time and effort to research eating disorders and at least TRY to support you and understand. And you have to be willing to put in the work on yourself to try to recover. That is the only way your relationship will survive. If he truly loves you, he will try, but he needs to understand that eating disorders are EXTREMELY difficult to treat, and he will need to be patient with you. So so patient.",
      "created_utc": 1628101320.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7n1yph",
      "author": "minnier97",
      "body": "In my opinion, your partner shouting at you like that for sharing how you feel is verbal/emotional abuse and it's in your best interest to get out of that relationship ASAP.",
      "created_utc": 1628050460.0,
      "score": 18,
      "context": []
    },
    {
      "id": "h7orkd3",
      "author": "ZookeepergameNo9524",
      "body": "I feel like he acted like this because he sees how much harm your eating disorder has done to you and that makes him feel worried and stressed, but he doesn't really understand much about eating disorders, so he tried to help you how he thought would be more effective.\n\nBut I don't think you did anything wrong and I think the kind of reaction he had usually encourages people to bottle up their feelings, thoughts and emotions to avoid conflict or something along the lines. I hope soon he'll learn how to be more understanding and how to better help you..\n\nAgain, I think you did nothing wrong! :')",
      "created_utc": 1628090919.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7nlntv",
      "author": "sewcrazy4cats",
      "body": "What he said is toxic. What we do is based on the thoughts we have. Weight,.body changes and bad relationships with food are just outward manifestation of deeper internal pain. I hope you get a good support system,  perhaps a better partner if warranted",
      "created_utc": 1628065385.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7n6145",
      "author": "Majestic_Rip_869",
      "body": "this sounds like the start of a downhill relationship, he's probably going to use your ED as fuel too. get out, as soon as possible",
      "created_utc": 1628052983.0,
      "score": -3,
      "context": []
    },
    {
      "id": "h7rkqr5",
      "author": "Minimum-Cheesecake",
      "body": "It'd a hard thing for most people to understand, which I realize. To other people, it makes no sense to starve when eating is something we need to do to survive, and when food is available. It makes no sense for a person to not be able to eat. I can understand that watching a person you love killing themselves is terrifying and infuriating at the same time. It's just as heartbreaking to realize that no matter how much I may love my boyfriend, I can't get better for him. And no matter how much he may love me, he can't fix my problem. I speak with a therapist once a week, but she isn't experienced in eating disorders. I'm fortunate to have her, though, because I don't have health insurance and I can't afford to pay out of pocket, nor do I qualify for state health insurance based on income. I'm one of the in betweeners; I make too much money for state health insurance, but not enough to get my own. So, I see this therapist through a mental health block grant. She is trying to reach out to ED programs, but hasn't found any. I do what I can on my own, but not having support from anyone other than my therapist makes things harder. It feels impossible doing this alone.",
      "created_utc": 1628136244.0,
      "score": 3,
      "context": [
        {
          "id": "h7n6zai",
          "author": "None",
          "body": "Would you mind sharing the post? I think reading it might resonate with a lot of us.\n\nI can’t give much in terms of relationship advice since I’m not in one myself, but the strain my Ed has put on friendships is quite similar. One of my very close friends stopped talking to me for a while because of how bad my health got and they were mad I wasn’t “trying harder” by “just eating.” It hurt a lot, and felt like he was giving up on me. But I realized it’s not fair for people like them to worry about me and my ed when it *looks* like it’s that easy, to “just eat” and be cured. They don’t have the experience so they can’t understand what it’s like in our shoes. I also want to ask, *are* you in recovery or trying to make recovery-oriented choices? Because if not, then your boyfriend does have a right to be worried and upset; after all, you’re hurting in front of his eyes and he can’t do anything to save you. It’s scary and sad. I think you should refer him to some informational websites/info graphics/resources on eds.",
          "created_utc": 1628053606.0
        }
      ]
    },
    {
      "id": "h7r9vq2",
      "author": "Minimum-Cheesecake",
      "body": "I can put the link here, if anyone wants to take a look. It's triggering, so take care of yourselves. Here's the link: [Cavewoman.](https://souvenirsofmistakes.wordpress.com/2021/08/02/cavewoman/)",
      "created_utc": 1628130432.0,
      "score": 2,
      "context": [
        {
          "id": "h7n6zai",
          "author": "None",
          "body": "Would you mind sharing the post? I think reading it might resonate with a lot of us.\n\nI can’t give much in terms of relationship advice since I’m not in one myself, but the strain my Ed has put on friendships is quite similar. One of my very close friends stopped talking to me for a while because of how bad my health got and they were mad I wasn’t “trying harder” by “just eating.” It hurt a lot, and felt like he was giving up on me. But I realized it’s not fair for people like them to worry about me and my ed when it *looks* like it’s that easy, to “just eat” and be cured. They don’t have the experience so they can’t understand what it’s like in our shoes. I also want to ask, *are* you in recovery or trying to make recovery-oriented choices? Because if not, then your boyfriend does have a right to be worried and upset; after all, you’re hurting in front of his eyes and he can’t do anything to save you. It’s scary and sad. I think you should refer him to some informational websites/info graphics/resources on eds.",
          "created_utc": 1628053606.0
        }
      ]
    },
    {
      "id": "h7rcssy",
      "author": "Minimum-Cheesecake",
      "body": "Hey, I was nodding in agreement reading your response. We have been together almost 5 years. I relapsed into my ED again  in January.  I was diagnosed with anorexia nervosa 14 years ago. This is the worst I've been since then. I should mention that I'm also an addict. I never really recovered from my ED, I just switched to drugs. Drug addiction dominated my life for the next 13 years. Now that I'm not using drugs, I've gone back to full blown anorexia nervosa. \n\nYour ex-boyfriend sounds exactly like my current boyfriend. He's all logic, and I'm all emotion. He has said the \"your feelings don't matter, these are the facts\" line so many times. That's not how I function. That's not how my mind works. My ED doesn't care about the facts. I know the reasons I restrict, the consequences of doing so, and it doesn't help me stop. My boyfriend thinks I'm not trying hard enough, too. I'm sorry yours thought the same about you. I don't believe I don't try, and I'm sure you tried so hard to be different, but couldn't. It just doesn't work that way. This disorder uses me against myself.\n\nI'm sorry you weren't able to get the help you deserved. Nobody should prevent that from happening. My boyfriend thinks I want to be hospitalized and I'm not eating because I think that only IP will work. God, I wish I had that opportunity, but that doesn't mean I'm not trying. I don't have that option, because I don't have Healthcare and I work full time. But that doesn't mean I'm purposely getting worse because of it.\n\nNow look who's rambling lol. I'm proud of you for getting to a healthy weight. I know how hard that is. I feel like you're right about how much patience it will take for this relationship to last through this. I get that my boyfriend is just scared, and he wants to believe he can fix anything because it feels safer. Accepting you are powerless over others and they can and do die, is too terrifying. I get where he's at, but I just wish he could get where I'm at, you know?",
      "created_utc": 1628131928.0,
      "score": 2,
      "context": [
        {
          "id": "h7pgylm",
          "author": "theolivedove",
          "body": "If you don't mind me asking, how long have you two been together? Have you had your eating disorder the entirety of your relationship?\n\nI dealt with this with my previous boyfriend. We were together for about four years (broke up a couple times). I loved him so much, but he had difficulty understanding my eating disorder. He reacted the way your boyfriend did quite a few times. We had multiple blow up fights, because he would get so frustrated with me. I wouldn't eat out at restaurants with him, and I had to have my safe foods all the time at specific scheduled times or I'd have a panic attack (I still do these things). He eventually did some research and tried to educate himself, but he still never fully grasped why I was that way. He was such a logical thinker, and I'm extremely emotional. I would explain to him how I was feeling, and he would say, \"it doesn't matter how you feel; these are the facts.\" I don't blame him for leaving me, because I didn't change/get better. Still, I wished he could have stayed. He said I didn't love him anymore, because I didn't TRY to change. I was trying though, and I have been...but it was never enough in his eyes. I don't know. This disease sucks.\n\nI got back to a \"healthy\" weight after being at my lowest, but all of my mental shit is still here and my body image is WAY worse. I was almost admitted to an inpatient facility, and he was gonna break up with me if I did. I was able to move back in with my parents instead, so we stayed together. It was hard though. \n\nI apologize for rambling about my experience, haha. I guess what I'm trying to say is that he has to be willing to put in the time and effort to research eating disorders and at least TRY to support you and understand. And you have to be willing to put in the work on yourself to try to recover. That is the only way your relationship will survive. If he truly loves you, he will try, but he needs to understand that eating disorders are EXTREMELY difficult to treat, and he will need to be patient with you. So so patient.",
          "created_utc": 1628101320.0
        }
      ]
    },
    {
      "id": "h7nmbvu",
      "author": "cele_zle",
      "body": "It takes hard work to be in a healthy relationship, but essentially, we aren´t healthy. It is hella difficult to understand somebody who has different thinking and even more difficult to understand somebody who has different thinking compared to a person with ED. Not to say we are wrong in wanting something that our SO isn´t able to give us, and not to say that they are wrong for that. But you have to realize, they see somebody hurting the person they love, it hurts them much more than you could expect, will you punish them for trying everything they can think of to stop it?",
      "created_utc": 1628065990.0,
      "score": 4,
      "context": [
        {
          "id": "h7n1yph",
          "author": "minnier97",
          "body": "In my opinion, your partner shouting at you like that for sharing how you feel is verbal/emotional abuse and it's in your best interest to get out of that relationship ASAP.",
          "created_utc": 1628050460.0
        }
      ]
    },
    {
      "id": "h7qpwox",
      "author": "antiquetears",
      "body": "I agree. I’ve been in an abusive relationship and they did the exact same thing. Trust me, it’s not worth sticking around. I finally left after a few years of bullshit and I couldn’t be happier.",
      "created_utc": 1628120918.0,
      "score": 1,
      "context": [
        {
          "id": "h7n1yph",
          "author": "minnier97",
          "body": "In my opinion, your partner shouting at you like that for sharing how you feel is verbal/emotional abuse and it's in your best interest to get out of that relationship ASAP.",
          "created_utc": 1628050460.0
        }
      ]
    },
    {
      "id": "h7rv5j3",
      "author": "None",
      "body": "Oh whoops, it says the site is private right now so no one can see the blog post right now :)\n\nOne big recommendation I have is the Eating Disorder Foundation support groups. They’re over zoom/virtual and completely free, and they are massively helpful to a lot of people. It can be a really meaningful step to recovery to connect with other people who understand your struggle, and it’s so relieving to see you’re *truly not alone*. I also recommend your boyfriend attend one of their support groups for friends and family (again, virtual and completely free). I know it’s not much, but EDF is a really good and completely free resource that is so helpful to a lot of people (especially given the atrocious lack of proper and affordable healthcare in this country).\n\nHere’s the support group schedule link: https://eatingdisorderfoundation.org/get-help/support-groups/support-group-schedule/",
      "created_utc": 1628142794.0,
      "score": 1,
      "context": [
        {
          "id": "h7n6zai",
          "author": "None",
          "body": "Would you mind sharing the post? I think reading it might resonate with a lot of us.\n\nI can’t give much in terms of relationship advice since I’m not in one myself, but the strain my Ed has put on friendships is quite similar. One of my very close friends stopped talking to me for a while because of how bad my health got and they were mad I wasn’t “trying harder” by “just eating.” It hurt a lot, and felt like he was giving up on me. But I realized it’s not fair for people like them to worry about me and my ed when it *looks* like it’s that easy, to “just eat” and be cured. They don’t have the experience so they can’t understand what it’s like in our shoes. I also want to ask, *are* you in recovery or trying to make recovery-oriented choices? Because if not, then your boyfriend does have a right to be worried and upset; after all, you’re hurting in front of his eyes and he can’t do anything to save you. It’s scary and sad. I think you should refer him to some informational websites/info graphics/resources on eds.",
          "created_utc": 1628053606.0
        },
        {
          "id": "h7rkqr5",
          "author": "Minimum-Cheesecake",
          "body": "It'd a hard thing for most people to understand, which I realize. To other people, it makes no sense to starve when eating is something we need to do to survive, and when food is available. It makes no sense for a person to not be able to eat. I can understand that watching a person you love killing themselves is terrifying and infuriating at the same time. It's just as heartbreaking to realize that no matter how much I may love my boyfriend, I can't get better for him. And no matter how much he may love me, he can't fix my problem. I speak with a therapist once a week, but she isn't experienced in eating disorders. I'm fortunate to have her, though, because I don't have health insurance and I can't afford to pay out of pocket, nor do I qualify for state health insurance based on income. I'm one of the in betweeners; I make too much money for state health insurance, but not enough to get my own. So, I see this therapist through a mental health block grant. She is trying to reach out to ED programs, but hasn't found any. I do what I can on my own, but not having support from anyone other than my therapist makes things harder. It feels impossible doing this alone.",
          "created_utc": 1628136244.0
        }
      ]
    },
    {
      "id": "h7vpaco",
      "author": "Minimum-Cheesecake",
      "body": "Oh, whoops. I changed it, so its public now. Thank you for that link. I'm open to any support I can get right now. I'm not sure he is, but I guess I can't control him. I will suggest it, of course.",
      "created_utc": 1628212139.0,
      "score": 2,
      "context": [
        {
          "id": "h7n6zai",
          "author": "None",
          "body": "Would you mind sharing the post? I think reading it might resonate with a lot of us.\n\nI can’t give much in terms of relationship advice since I’m not in one myself, but the strain my Ed has put on friendships is quite similar. One of my very close friends stopped talking to me for a while because of how bad my health got and they were mad I wasn’t “trying harder” by “just eating.” It hurt a lot, and felt like he was giving up on me. But I realized it’s not fair for people like them to worry about me and my ed when it *looks* like it’s that easy, to “just eat” and be cured. They don’t have the experience so they can’t understand what it’s like in our shoes. I also want to ask, *are* you in recovery or trying to make recovery-oriented choices? Because if not, then your boyfriend does have a right to be worried and upset; after all, you’re hurting in front of his eyes and he can’t do anything to save you. It’s scary and sad. I think you should refer him to some informational websites/info graphics/resources on eds.",
          "created_utc": 1628053606.0
        },
        {
          "id": "h7rkqr5",
          "author": "Minimum-Cheesecake",
          "body": "It'd a hard thing for most people to understand, which I realize. To other people, it makes no sense to starve when eating is something we need to do to survive, and when food is available. It makes no sense for a person to not be able to eat. I can understand that watching a person you love killing themselves is terrifying and infuriating at the same time. It's just as heartbreaking to realize that no matter how much I may love my boyfriend, I can't get better for him. And no matter how much he may love me, he can't fix my problem. I speak with a therapist once a week, but she isn't experienced in eating disorders. I'm fortunate to have her, though, because I don't have health insurance and I can't afford to pay out of pocket, nor do I qualify for state health insurance based on income. I'm one of the in betweeners; I make too much money for state health insurance, but not enough to get my own. So, I see this therapist through a mental health block grant. She is trying to reach out to ED programs, but hasn't found any. I do what I can on my own, but not having support from anyone other than my therapist makes things harder. It feels impossible doing this alone.",
          "created_utc": 1628136244.0
        },
        {
          "id": "h7rv5j3",
          "author": "None",
          "body": "Oh whoops, it says the site is private right now so no one can see the blog post right now :)\n\nOne big recommendation I have is the Eating Disorder Foundation support groups. They’re over zoom/virtual and completely free, and they are massively helpful to a lot of people. It can be a really meaningful step to recovery to connect with other people who understand your struggle, and it’s so relieving to see you’re *truly not alone*. I also recommend your boyfriend attend one of their support groups for friends and family (again, virtual and completely free). I know it’s not much, but EDF is a really good and completely free resource that is so helpful to a lot of people (especially given the atrocious lack of proper and affordable healthcare in this country).\n\nHere’s the support group schedule link: https://eatingdisorderfoundation.org/get-help/support-groups/support-group-schedule/",
          "created_utc": 1628142794.0
        }
      ]
    }
  ]
}