{
  "id": "p0fmvm",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1628432926.0,
  "title": "just been given permission to relapse??????",
  "selftext": "literally just been told I’m eating so much it wouldn’t be so bad to slip in to old habits. great! If anything I feel completely encouraged and supported to stop recovery. This is the most backwards my life has ever been",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/p0fmvm/just_been_given_permission_to_relapse/",
  "score": 113,
  "num_comments": 8,
  "comments": [
    {
      "id": "h867u8i",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1628432926.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h869hk6",
      "author": "skinnyfatt12",
      "body": "Straight up explain to the person why what they said was wrong and why it actually hinders your recovery. People need to be called out when they say triggering shit like that. If they get defensive about it, double down, or try to say you're too sensitive, then they are an active threat to your recovery and it'll be harder to heal with them around. Hopefully, they are understanding as to why what they said was fucked up so that it's easier for you to move forward. I genuinely do not understand why people who don't have EDs think this shit is okay to say.",
      "created_utc": 1628433747.0,
      "score": 43,
      "context": []
    },
    {
      "id": "h871nt3",
      "author": "None",
      "body": "No no no! Not okay to say or even give the idea especially to someone who’s recovering. Continue to do what you are doing. Don’t listen to that mouth garbage. They don’t even know what they are talking about. Keep on thriving, friend!",
      "created_utc": 1628446932.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h8721iz",
      "author": "ibettershutupagain",
      "body": "The way I looked at it is even if you were binging everyday that would be it's own eating disorder. Disordered eating can come in many forms. I think the person that said that is ignorant. I think they're a lot more things to be worried about in this life then weight. If someone else is that worried about your weight then they need to get a life. If course it would be okay if someone close to u was expressing concern in a nice way but that is just a horrible thing to say",
      "created_utc": 1628447109.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h87jgjv",
      "author": "livv3ss",
      "body": "People recovering need to eat a lot more to make up for the nutrients that were lost. I’d tell them to fuck themselves. Eat however makes u happy.",
      "created_utc": 1628455234.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h86zgol",
      "author": "None",
      "body": "im sorry op :(",
      "created_utc": 1628445921.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h88gxa3",
      "author": "s8anscumrag",
      "body": "My mom is a lot like that, I'm sorry",
      "created_utc": 1628471687.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h88j01u",
      "author": "Inkyana",
      "body": "I’m sorry you’re dealing with that. My fiancé kinda gave me permission and he regrets it so much. He didn’t really give me permission, but he knew about my ED, and when my dad died I said I didn’t want to eat anymore and idk if he just didn’t realize it but he said “it’s ok you don’t have to eat if you’re upset I understand “ and fast forward a few months to him about crying saying “I let you do this, now I’m watching you wither away and die in front of me this is my fault” it’s not his fault, but he won’t stop blaming himself. I guess my advice is don’t take it too far like I did cuz I hate myself for him blaming himself. Also it’s really hard to know when it’s too far, so try to find someone you trust who can help you slow down if things get crazy, cuz I still don’t feel like I’m sick but he feels like I’m dying EDs are blinding like that",
      "created_utc": 1628472761.0,
      "score": 2,
      "context": []
    }
  ]
}