{
  "id": "pcsdnt",
  "subreddit": "AnorexiaNervosa",
  "author": "dumbledora_explora",
  "created_utc": 1630086690.0,
  "title": "Why do I feel so happy and confident when I'm restricting?",
  "selftext": "It is always like a huge confidence boost. Is it maybe because I feel like I'm for once not failing? Bit also I don't like the feeling of having much food in my body and just prefer that empty feeling. I just wonder if that's a common thing and if someone has an explanation for it?",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/pcsdnt/why_do_i_feel_so_happy_and_confident_when_im/",
  "score": 114,
  "num_comments": 13,
  "comments": [
    {
      "id": "hal16am",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1630086690.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hal2fqr",
      "author": "asoftyam",
      "body": "I feel the same way. It’s strange but my mood plummets when I eat. Maybe has to do with being in pain and all the anxiety that comes with it. There is also the aspect of feeling in control of something when everything else is chaotic. We feel more secure when we can control something especially if there are a lot of things stressing us out. To me it brings comfort too.",
      "created_utc": 1630087203.0,
      "score": 33,
      "context": []
    },
    {
      "id": "hal5yrb",
      "author": "WideAtmosphere",
      "body": "SAME!!! I feel so happy and superior to my Eating Self.\n\nIf I \"feel fat\", I have the worst day. It destroys my mood completely and i'm hateful all day.",
      "created_utc": 1630088661.0,
      "score": 21,
      "context": []
    },
    {
      "id": "halfvdi",
      "author": "Wrencer4Endgame",
      "body": "It's the only thing I feel I'm in control of. I literally hate myself & I'm so depressed when I eat normally...",
      "created_utc": 1630092768.0,
      "score": 14,
      "context": []
    },
    {
      "id": "halqs29",
      "author": "amber-nights",
      "body": "i love the empty feeling, it’s validating for me, same as getting light headed, starry eyes etc etc because i *know* my body is struggling and getting the calories elsewhere",
      "created_utc": 1630097333.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hamlvvs",
      "author": "kittygurl333",
      "body": "No fr I can go out and feel so pretty and nice all day, but the second I put something in my mouth it’s time to go home",
      "created_utc": 1630111822.0,
      "score": 6,
      "context": []
    },
    {
      "id": "han5qt9",
      "author": "777333555",
      "body": "It’s so fucked up but i almost feel like i’m “stronger” than everyone else. Like it’s my superpower. It’s just distorted ego inflation.",
      "created_utc": 1630122222.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hanlhsc",
      "author": "None",
      "body": "Yes it’s a completely common thing! In my experience, restriction is an addiction and restricting gives me a big dopamine hit. Of course dopamine is very moreish, so the more I allow myself to restrict the more I want to restrict and when it gets out of hand that’s a relapse.\nI’ve experienced addiction in other areas too and it’s 100% analogous.",
      "created_utc": 1630133087.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hambauh",
      "author": "Newwavesupport3657",
      "body": "We aren’t afraid to be empty, we are afraid to feel full.",
      "created_utc": 1630106633.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hambx10",
      "author": "Media-Time",
      "body": "I think it’s the control and not having the guilt of eating. Like, it’s not the best thing to do but it feels powerful and almost more natural.",
      "created_utc": 1630106929.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hamb8s9",
      "author": "Newwavesupport3657",
      "body": "Cause it makes you feel in control",
      "created_utc": 1630106606.0,
      "score": 2,
      "context": []
    },
    {
      "id": "halp65a",
      "author": "ranipe",
      "body": "This! The pain def but the anxiety? My anxiety is 10x worse on days i eat. It’s so bad I just never eat on work days anymore because the anxiety attacks at work are already bad.",
      "created_utc": 1630096649.0,
      "score": 9,
      "context": [
        {
          "id": "hal2fqr",
          "author": "asoftyam",
          "body": "I feel the same way. It’s strange but my mood plummets when I eat. Maybe has to do with being in pain and all the anxiety that comes with it. There is also the aspect of feeling in control of something when everything else is chaotic. We feel more secure when we can control something especially if there are a lot of things stressing us out. To me it brings comfort too.",
          "created_utc": 1630087203.0
        }
      ]
    }
  ]
}