{
  "id": "pkoc1e",
  "subreddit": "AnorexiaNervosa",
  "author": "RhinestoneJacket97",
  "created_utc": 1631152882.0,
  "title": "Feeling pretty privilege the more I lose weight",
  "selftext": "People are nicer, they laugh at my jokes, they hold doors, they want to talk to me more. I have people who didn't bother to talk to me before suddenly being the first to talk to me. It's depressing to see and both know that the only reason I'm being accepted is because of my E.D \nIt makes me fearful of ever gaining weight.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/pkoc1e/feeling_pretty_privilege_the_more_i_lose_weight/",
  "score": 113,
  "num_comments": 7,
  "comments": [
    {
      "id": "hc4ucng",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1631152882.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hc503fl",
      "author": "Inevitable_Junket525",
      "body": "Aww.. it can be hard I know to look at it this way, but instead of seeing it as you being “used,” instead that you have a greater spotlight on you. \n\nThis can give you an opportunity to shine the greatest qualities in your heart even for a second to others. It will make you feel so much better. Like in your head your kindness to them will constantly be reminding you “I’m not just pretty.. I’m not just skinny.. I love others, and that’s what makes me special.” \n\nYou may be beautiful on the outside yes…<3 but by making a mark on someone’s life with your qualities or kindness, will not make you feel like you are being used. But that you are living a purpose. They will start to admire you for more than your exterior<3 \n\nThe Rose Song by Olivia Rodrigo talks about this. It heals me every time I go through this. Reminds me to be humble. And thankful to turn it around as a positive. If people are looking at me, you, more, you are being given a role to uplift others in a beautiful way<3",
      "created_utc": 1631155798.0,
      "score": 20,
      "context": []
    },
    {
      "id": "hc5iofl",
      "author": "xedtax",
      "body": "Isn’t that the sad truth \n\nIt’s so easy to charm people when u r skinni LOL\n\nPeople are dumb\n\nBut ditto gotta stay humble n shi 😎",
      "created_utc": 1631167931.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hc5fof5",
      "author": "pipsqueak_pixie",
      "body": "100% my life right now. People in general are so much nicer to me. Also..As sweet as he is don't truly think my bf would like me or have gone for me if I was at the weight I was before this (24kg heavier) which is the weight I've been most of my adult life. I'm considered cute, funnier. Not just in the background. I think I was always somewhat pretty and my weight sat \"well\" (and being thicker is in, or has been?) but yeah.. wow the difference. I totally relate to feeling so wierd about it, in a way I know I should be happy? But I feel the same intense fear that if I ever gain the weight back (or any weight back) that this all goes away.\nAlso it's just kind of sick that this positivity has come from something that's been such a dark place and struggle for me. Plus, when people comment on how much better I look it's fucking painful because all I hear is wow I must have looked a bit shit before then I guess? Ouch",
      "created_utc": 1631165574.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hc5pohf",
      "author": "kiaraleee14",
      "body": "fr. bc i'm so much skinnier now, people actually put effort into listening to me and being my friend.\n\nI've also noticed that they start treating me more like a baby, and it makes me so sad that people make opinions on others based on their size, and the way they look before even getting to know them.",
      "created_utc": 1631174328.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hc655v8",
      "author": "None",
      "body": "I almost didn’t want to share this. But lately now that I’m gaining weight, it really feels like people like me less.  But in reality they probably don’t.  … hopefully.  I’m not saying people don’t treat people differently based on appearance. They totally do. But I also think 70% of it is actually your confidence and comfort in your own body finally. \nAnd it really saddens me that so many of us see starvation as the only way.    \n\nI don’t have a positive takeaway here. Just sending strength and empathy.",
      "created_utc": 1631187741.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hc6aul6",
      "author": "somegenerichandle",
      "body": "Yeah, i feel like people were infantilizing me more when i was underweight. There is also a big difference between people looking/watching and actually listening.",
      "created_utc": 1631191176.0,
      "score": 2,
      "context": [
        {
          "id": "hc5pohf",
          "author": "kiaraleee14",
          "body": "fr. bc i'm so much skinnier now, people actually put effort into listening to me and being my friend.\n\nI've also noticed that they start treating me more like a baby, and it makes me so sad that people make opinions on others based on their size, and the way they look before even getting to know them.",
          "created_utc": 1631174328.0
        }
      ]
    }
  ]
}