{
  "id": "ql6y57",
  "subreddit": "AnorexiaNervosa",
  "author": "Zcorpiotongue",
  "created_utc": 1635867533.0,
  "title": "Can we talk about how toxic doctors are??",
  "selftext": "So I know it’s their job to inform you about health issues, including those around weight. I get it. But they should at least have some compassion right?\n\nSo a few months ago, I found out that if I take too much my thyroid medication, it can cause weight loss. So obviously I started taking more and more each day (I had a reserve because before this I went days without remember to take it.) When I started nearing the end of my stash, I started thinking of lies and ways to get more than my normal dose from my doctor. I realized how terrible I was being and promised myself I would stop and discuss this with my doctor to see what harm I may have done to myself. (It can cause heart issues.) \n\nDuring my next doctors appointment, I admitted to abusing the medication and admitted to starving for days and basically broke down and admitted my eating disorder in full. She nodded a lot, gasped a few times and whatnot. A day later, I received an email from her saying I should continue taking medication but in proper dose. And then she told me… that my cholesterol was high and that I should consider GOING ON A DIET.\n\nAnyways. That fucked me up a bit. Tell me your stories.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ql6y57/can_we_talk_about_how_toxic_doctors_are/",
  "score": 155,
  "num_comments": 37,
  "comments": [
    {
      "id": "hj0twjf",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1635867533.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hj0v38s",
      "author": "fsk1116",
      "body": "Had a new psychiatrist and she scoffed at my PTSD diagnosis (physically abusive ex chased around the house with a loaded gun on multiple occasions as beat the hell out of me)… and then blamed my depression on smoking weed when I was a teen. Super bitch.",
      "created_utc": 1635868025.0,
      "score": 73,
      "context": []
    },
    {
      "id": "hj134o0",
      "author": "EDshamethrowaway",
      "body": "Doctors are so far behind when it comes to weight and nutrition. And they're fucking killing people by being so ignorant and insensitive.\n\nThat's all. I don't have my own story.",
      "created_utc": 1635871280.0,
      "score": 34,
      "context": []
    },
    {
      "id": "hj1l3xt",
      "author": "None",
      "body": "Got diagnosed with anorexia nervosa at an inpatient treatment center, freaked out bc I wasn’t mentally ready to commit to recovery, discharged AMA after a little over a week, started working with an outpatient ed-specializing therapist and dietitian at that time, made an apt with my normal doctor to get bloodwork at their request, and upon talking with said doctor at our appointment, was told by her that I did a good job and didn’t “need” to lose any more weight but that I could just maintain the weight I was at now (which was described as underweight and malnourished by Ed specializing dietitian and just barely at a normal bmi on the edge of underweight) and that if I didn’t want to gain weight I just should eat “the right calories like fruits and vegetables” and shouldn’t eat “empty calories like white rice” (yes. A DOCTOR said that. To someone with a diagnosed ed) and should just eat x # of cal a day (the infamous amount that people say a toddler needs. If you catch my drift. Which was WAY less than the meal plan I’d been on at the treatment center and way less even than the meal plan my outpatient dietitian at the time wanted me on). I left the appointment and cried. My treatment team was furious at the lack of due diligence on my doctor’s part for giving such harmful advice outside of her area of expertise. Doctors really shouldn’t give nutrition advice. Needless to stay I didn’t stick with her, I switched to a PCP who actually used to work at the treatment center I’d gone to and worked at my primary care practice with a specialization in eds. It was so nice to have my doctor be a certified ed specialist after the traumatizing experience of what my old doctor said to me. Doctors that give nutrition advice despite not being dietitians will forever bother me",
      "created_utc": 1635878370.0,
      "score": 22,
      "context": []
    },
    {
      "id": "hj2r5kb",
      "author": "None",
      "body": "My psychiatrist said there’s nothing wrong with 800 calories a day. She also told me although other people like my family may think I’m too skinny (my BMI was even too low for outpatient programs) that if I feel like I look best at this weight I should maintain it. Oh and I told another psychiatrist I had a history of abusing benzos so they shouldn’t give them to me, 25 minutes later I was handed a prescription for lorazepam. Can’t make this stuff up!",
      "created_utc": 1635894766.0,
      "score": 18,
      "context": []
    },
    {
      "id": "hj24aed",
      "author": "katarina-stratford",
      "body": "I had a gynaecologist question why I was thin, told her I have mental health issues, she proceeded to shame me for not exercising..",
      "created_utc": 1635885742.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hj44vht",
      "author": "litzyfritzy",
      "body": "Neurologist prescribed a medication for my migraines. One of the side effects is weight loss, but she looked at me and said “not like you will dislike that side effect” \n\nA prior medication I had been on for mental health reasons made me gain 70+ lbs and still haven’t lost a pound of it.\n\nSo yeah. That fucking hurt. \n\nLike I know I’m overweight. But jesus christ.",
      "created_utc": 1635917568.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hj1utq4",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1635882124.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hj13je5",
      "author": "ParfaitGlittering",
      "body": "When my NP calls me out for my \"tics\" when we talk about my eating disorder\n\nWhen my NP started treating me like an addict after I started ketamine assisted therapy and wouldn't even prescribe me trazodone 😂\n\nWhen my therapist tried to reach out to my NP and got no response over a 7 month period of me refusing my weight \n\nWhen after hassling from my therapist I was finally forced on the scale the MA started treating me like a child \"ohh just step on backwards it'll be fine you won't see\" etc etc and I was just like I'm getting on it's fine I know I'm cornered. And ofc saw the weight printed all over my paperwork at the end anyway!\n\nAfter finding out there were no ED specialists taking new patients therefore she's stuck with monitoring me asked \"are you sure there's no ED Drs taking new patients?? Has your therapist checked??\" My therapist is wonderful and always on the ball and she knows this. \n\nHonestly I could go on and on...",
      "created_utc": 1635871442.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hj4hfoo",
      "author": "ifuckpineapples",
      "body": "I have been told by different PCPs on multiple occasions to \"keep doing what youre doing!\" when I come in borderline or actually underweight, despite having anorexia on my chart, because skinny is good I guess. :v\n\n nurses are the fucking worst too. they always comment on how jealous they are of my weight. once I came in and weighed in as several pounds underweight with winter clothes and boots on, and they just gawked and said they were sooooo jealous! and enjoy that while you're young!\n\nlast time I went in the nurse who did my blood work (super old lady, very small, very nice) said I was \"the smallest thing on two feet\" in there (despite obviously being a half foot taller and several pounds more than her) and said that she was on a diet and exercising every day to lose lockdown weight. she looked frail as fuck, but she's allowed to do that? because doctor???? and then brags about it to patients????\n\nI've literally only once met  a doctor who was great with my Ed and she ghosted me and moved cities after a year without anyone at the office telling me lol. fuck doctors.",
      "created_utc": 1635927656.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hj0zb2f",
      "author": "derpyfreed",
      "body": "that’s why i don’t want to tell my doctor,, i feel like she wouldn’t understand",
      "created_utc": 1635869753.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hj30nrd",
      "author": "None",
      "body": " Omg that is so messed up. She is so out of it",
      "created_utc": 1635898708.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hj4pse6",
      "author": "fxkingthrowaway",
      "body": "I went to the local health department a few years ago to start birth control. The nurse completely out of nowhere said, \"Your BMI is too high and you need to eat healthy and exercise.\" I said nothing back to her but I thought, \"I literally only came here for birth control but thanks for reminding me that I'm a fat piece of shit.\"",
      "created_utc": 1635934962.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hjhp3g4",
      "author": "daisytopia",
      "body": "Doctors have been SO mean/cold to me that I avoid them at all costs now. I’m mousey and over polite in personality and give them zero reason. Seeing everyone else comment they’ve experienced it too pisses me off. They’re so dismissive, get annoyed if you ask a question and generally make you feel like a big annoying burden who needs to shut up and take whatever they prescribe at once.",
      "created_utc": 1636159395.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hj41833",
      "author": "exhaustedemily",
      "body": "yea I can relate. My doctor told me when I was 15 years old, at a healthy bmi of 22, he told me I could afford to lose a few lbs, i was already recovered from an ed and this comment made me relapse",
      "created_utc": 1635915226.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hj4ox4i",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1635934276.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hjmypoi",
      "author": "Schoollow48",
      "body": "it would be reasonable to suggest \"have a diet that's low in cholesterol but still rich in other important nutrients and calories and stuff\". but \"go on a diet\" means something totally different",
      "created_utc": 1636258434.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hj0vb4x",
      "author": "Zcorpiotongue",
      "body": "I don’t get why people with no compassion would go into psychiatry.",
      "created_utc": 1635868116.0,
      "score": 37,
      "context": [
        {
          "id": "hj0v38s",
          "author": "fsk1116",
          "body": "Had a new psychiatrist and she scoffed at my PTSD diagnosis (physically abusive ex chased around the house with a loaded gun on multiple occasions as beat the hell out of me)… and then blamed my depression on smoking weed when I was a teen. Super bitch.",
          "created_utc": 1635868025.0
        }
      ]
    },
    {
      "id": "hjhoqgb",
      "author": "daisytopia",
      "body": "This!",
      "created_utc": 1636159231.0,
      "score": 4,
      "context": [
        {
          "id": "hj134o0",
          "author": "EDshamethrowaway",
          "body": "Doctors are so far behind when it comes to weight and nutrition. And they're fucking killing people by being so ignorant and insensitive.\n\nThat's all. I don't have my own story.",
          "created_utc": 1635871280.0
        }
      ]
    },
    {
      "id": "hj1mran",
      "author": "Zcorpiotongue",
      "body": "Oh my god my doctor gives so much “advice” on what I should and shouldn’t eat and it’s awful. I feel this.",
      "created_utc": 1635879005.0,
      "score": 6,
      "context": [
        {
          "id": "hj1l3xt",
          "author": "None",
          "body": "Got diagnosed with anorexia nervosa at an inpatient treatment center, freaked out bc I wasn’t mentally ready to commit to recovery, discharged AMA after a little over a week, started working with an outpatient ed-specializing therapist and dietitian at that time, made an apt with my normal doctor to get bloodwork at their request, and upon talking with said doctor at our appointment, was told by her that I did a good job and didn’t “need” to lose any more weight but that I could just maintain the weight I was at now (which was described as underweight and malnourished by Ed specializing dietitian and just barely at a normal bmi on the edge of underweight) and that if I didn’t want to gain weight I just should eat “the right calories like fruits and vegetables” and shouldn’t eat “empty calories like white rice” (yes. A DOCTOR said that. To someone with a diagnosed ed) and should just eat x # of cal a day (the infamous amount that people say a toddler needs. If you catch my drift. Which was WAY less than the meal plan I’d been on at the treatment center and way less even than the meal plan my outpatient dietitian at the time wanted me on). I left the appointment and cried. My treatment team was furious at the lack of due diligence on my doctor’s part for giving such harmful advice outside of her area of expertise. Doctors really shouldn’t give nutrition advice. Needless to stay I didn’t stick with her, I switched to a PCP who actually used to work at the treatment center I’d gone to and worked at my primary care practice with a specialization in eds. It was so nice to have my doctor be a certified ed specialist after the traumatizing experience of what my old doctor said to me. Doctors that give nutrition advice despite not being dietitians will forever bother me",
          "created_utc": 1635878370.0
        }
      ]
    },
    {
      "id": "hj2vbyg",
      "author": "Zcorpiotongue",
      "body": "That is absolutely ridiculous. I swear these people don’t actually listen.",
      "created_utc": 1635896484.0,
      "score": 9,
      "context": [
        {
          "id": "hj2r5kb",
          "author": "None",
          "body": "My psychiatrist said there’s nothing wrong with 800 calories a day. She also told me although other people like my family may think I’m too skinny (my BMI was even too low for outpatient programs) that if I feel like I look best at this weight I should maintain it. Oh and I told another psychiatrist I had a history of abusing benzos so they shouldn’t give them to me, 25 minutes later I was handed a prescription for lorazepam. Can’t make this stuff up!",
          "created_utc": 1635894766.0
        }
      ]
    },
    {
      "id": "hj254tz",
      "author": "Zcorpiotongue",
      "body": "A GYNECOLOGIST are you kidding me",
      "created_utc": 1635886062.0,
      "score": 10,
      "context": [
        {
          "id": "hj24aed",
          "author": "katarina-stratford",
          "body": "I had a gynaecologist question why I was thin, told her I have mental health issues, she proceeded to shame me for not exercising..",
          "created_utc": 1635885742.0
        }
      ]
    },
    {
      "id": "hj1vdro",
      "author": "Zcorpiotongue",
      "body": "That’s terrible. I guess we can’t blame her because she didn’t know but I know how damaging that is.",
      "created_utc": 1635882337.0,
      "score": 10,
      "context": [
        {
          "id": "hj1utq4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1635882124.0
        }
      ]
    },
    {
      "id": "hj2xghn",
      "author": "None",
      "body": "I’m confused, did you start out overweight and starve yourself to get to a normal BMI or did you used to be underweight and gained weight",
      "created_utc": 1635897365.0,
      "score": 3,
      "context": [
        {
          "id": "hj1utq4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1635882124.0
        }
      ]
    },
    {
      "id": "hj156so",
      "author": "Zcorpiotongue",
      "body": "That’s awful. I’m so sorry.",
      "created_utc": 1635872103.0,
      "score": 6,
      "context": [
        {
          "id": "hj13je5",
          "author": "ParfaitGlittering",
          "body": "When my NP calls me out for my \"tics\" when we talk about my eating disorder\n\nWhen my NP started treating me like an addict after I started ketamine assisted therapy and wouldn't even prescribe me trazodone 😂\n\nWhen my therapist tried to reach out to my NP and got no response over a 7 month period of me refusing my weight \n\nWhen after hassling from my therapist I was finally forced on the scale the MA started treating me like a child \"ohh just step on backwards it'll be fine you won't see\" etc etc and I was just like I'm getting on it's fine I know I'm cornered. And ofc saw the weight printed all over my paperwork at the end anyway!\n\nAfter finding out there were no ED specialists taking new patients therefore she's stuck with monitoring me asked \"are you sure there's no ED Drs taking new patients?? Has your therapist checked??\" My therapist is wonderful and always on the ball and she knows this. \n\nHonestly I could go on and on...",
          "created_utc": 1635871442.0
        }
      ]
    },
    {
      "id": "hj51r71",
      "author": "Zcorpiotongue",
      "body": "Jesus. Doctors are the worst especially since they are literally the ones supposed to notice things like someone slowly killing themselves.",
      "created_utc": 1635942617.0,
      "score": 3,
      "context": [
        {
          "id": "hj4hfoo",
          "author": "ifuckpineapples",
          "body": "I have been told by different PCPs on multiple occasions to \"keep doing what youre doing!\" when I come in borderline or actually underweight, despite having anorexia on my chart, because skinny is good I guess. :v\n\n nurses are the fucking worst too. they always comment on how jealous they are of my weight. once I came in and weighed in as several pounds underweight with winter clothes and boots on, and they just gawked and said they were sooooo jealous! and enjoy that while you're young!\n\nlast time I went in the nurse who did my blood work (super old lady, very small, very nice) said I was \"the smallest thing on two feet\" in there (despite obviously being a half foot taller and several pounds more than her) and said that she was on a diet and exercising every day to lose lockdown weight. she looked frail as fuck, but she's allowed to do that? because doctor???? and then brags about it to patients????\n\nI've literally only once met  a doctor who was great with my Ed and she ghosted me and moved cities after a year without anyone at the office telling me lol. fuck doctors.",
          "created_utc": 1635927656.0
        }
      ]
    },
    {
      "id": "hj51aqa",
      "author": "Zcorpiotongue",
      "body": "People need to mind their goddamn business.",
      "created_utc": 1635942371.0,
      "score": 3,
      "context": [
        {
          "id": "hj4pse6",
          "author": "fxkingthrowaway",
          "body": "I went to the local health department a few years ago to start birth control. The nurse completely out of nowhere said, \"Your BMI is too high and you need to eat healthy and exercise.\" I said nothing back to her but I thought, \"I literally only came here for birth control but thanks for reminding me that I'm a fat piece of shit.\"",
          "created_utc": 1635934962.0
        }
      ]
    },
    {
      "id": "hjo9qs4",
      "author": "Zcorpiotongue",
      "body": "They’re the worst because they can be really needed, and then people like you and many others literally avoid them because they’re so terrible",
      "created_utc": 1636293733.0,
      "score": 2,
      "context": [
        {
          "id": "hjhp3g4",
          "author": "daisytopia",
          "body": "Doctors have been SO mean/cold to me that I avoid them at all costs now. I’m mousey and over polite in personality and give them zero reason. Seeing everyone else comment they’ve experienced it too pisses me off. They’re so dismissive, get annoyed if you ask a question and generally make you feel like a big annoying burden who needs to shut up and take whatever they prescribe at once.",
          "created_utc": 1636159395.0
        }
      ]
    },
    {
      "id": "hj51xin",
      "author": "Zcorpiotongue",
      "body": "I hate doctors. That’s so horrible.",
      "created_utc": 1635942712.0,
      "score": 5,
      "context": [
        {
          "id": "hj41833",
          "author": "exhaustedemily",
          "body": "yea I can relate. My doctor told me when I was 15 years old, at a healthy bmi of 22, he told me I could afford to lose a few lbs, i was already recovered from an ed and this comment made me relapse",
          "created_utc": 1635915226.0
        }
      ]
    },
    {
      "id": "hj51igi",
      "author": "Zcorpiotongue",
      "body": "“Isn’t that bad.” I would’ve just cried at that point. The fucking nerve.",
      "created_utc": 1635942491.0,
      "score": 1,
      "context": [
        {
          "id": "hj4ox4i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1635934276.0
        }
      ]
    },
    {
      "id": "hjo95x2",
      "author": "Zcorpiotongue",
      "body": "I feel like she could’ve done a lot of things better with that but instead she just decided oh this girl that is literally abusing medication to lose weight clearly has the mental capacity for words that will sound like judgment.",
      "created_utc": 1636293444.0,
      "score": 1,
      "context": [
        {
          "id": "hjmypoi",
          "author": "Schoollow48",
          "body": "it would be reasonable to suggest \"have a diet that's low in cholesterol but still rich in other important nutrients and calories and stuff\". but \"go on a diet\" means something totally different",
          "created_utc": 1636258434.0
        }
      ]
    },
    {
      "id": "hj0z6cl",
      "author": "derpyfreed",
      "body": "all psychiatrists seem to have no compassion or empathy.. they basically just throw medicine at you and expect you to be fine after like ??? and if you tell them you’re problems they cut you off and say “im not your therapist” isn’t your job to be prescribe medication to me? how will you know what to prescribe if you don’t know my issues lol",
      "created_utc": 1635869699.0,
      "score": 31,
      "context": [
        {
          "id": "hj0v38s",
          "author": "fsk1116",
          "body": "Had a new psychiatrist and she scoffed at my PTSD diagnosis (physically abusive ex chased around the house with a loaded gun on multiple occasions as beat the hell out of me)… and then blamed my depression on smoking weed when I was a teen. Super bitch.",
          "created_utc": 1635868025.0
        },
        {
          "id": "hj0vb4x",
          "author": "Zcorpiotongue",
          "body": "I don’t get why people with no compassion would go into psychiatry.",
          "created_utc": 1635868116.0
        }
      ]
    },
    {
      "id": "hj2lec4",
      "author": "None",
      "body": "It’s the WORST. Mine also gave that advice AFTER speaking with my treatment team and them literally telling her I was in treatment for anorexia. “Lower” doctors like family doctors/primary care providers are so naive and ignorant about eating disorders it’s crazy!!",
      "created_utc": 1635892390.0,
      "score": 2,
      "context": [
        {
          "id": "hj1l3xt",
          "author": "None",
          "body": "Got diagnosed with anorexia nervosa at an inpatient treatment center, freaked out bc I wasn’t mentally ready to commit to recovery, discharged AMA after a little over a week, started working with an outpatient ed-specializing therapist and dietitian at that time, made an apt with my normal doctor to get bloodwork at their request, and upon talking with said doctor at our appointment, was told by her that I did a good job and didn’t “need” to lose any more weight but that I could just maintain the weight I was at now (which was described as underweight and malnourished by Ed specializing dietitian and just barely at a normal bmi on the edge of underweight) and that if I didn’t want to gain weight I just should eat “the right calories like fruits and vegetables” and shouldn’t eat “empty calories like white rice” (yes. A DOCTOR said that. To someone with a diagnosed ed) and should just eat x # of cal a day (the infamous amount that people say a toddler needs. If you catch my drift. Which was WAY less than the meal plan I’d been on at the treatment center and way less even than the meal plan my outpatient dietitian at the time wanted me on). I left the appointment and cried. My treatment team was furious at the lack of due diligence on my doctor’s part for giving such harmful advice outside of her area of expertise. Doctors really shouldn’t give nutrition advice. Needless to stay I didn’t stick with her, I switched to a PCP who actually used to work at the treatment center I’d gone to and worked at my primary care practice with a specialization in eds. It was so nice to have my doctor be a certified ed specialist after the traumatizing experience of what my old doctor said to me. Doctors that give nutrition advice despite not being dietitians will forever bother me",
          "created_utc": 1635878370.0
        },
        {
          "id": "hj1mran",
          "author": "Zcorpiotongue",
          "body": "Oh my god my doctor gives so much “advice” on what I should and shouldn’t eat and it’s awful. I feel this.",
          "created_utc": 1635879005.0
        }
      ]
    },
    {
      "id": "hj32oxe",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1635899529.0,
      "score": 4,
      "context": [
        {
          "id": "hj2r5kb",
          "author": "None",
          "body": "My psychiatrist said there’s nothing wrong with 800 calories a day. She also told me although other people like my family may think I’m too skinny (my BMI was even too low for outpatient programs) that if I feel like I look best at this weight I should maintain it. Oh and I told another psychiatrist I had a history of abusing benzos so they shouldn’t give them to me, 25 minutes later I was handed a prescription for lorazepam. Can’t make this stuff up!",
          "created_utc": 1635894766.0
        },
        {
          "id": "hj2vbyg",
          "author": "Zcorpiotongue",
          "body": "That is absolutely ridiculous. I swear these people don’t actually listen.",
          "created_utc": 1635896484.0
        }
      ]
    },
    {
      "id": "hj26g3e",
      "author": "katarina-stratford",
      "body": "I literally had to borrow money to afford the appointment- it really set me back mwntally",
      "created_utc": 1635886553.0,
      "score": 8,
      "context": [
        {
          "id": "hj24aed",
          "author": "katarina-stratford",
          "body": "I had a gynaecologist question why I was thin, told her I have mental health issues, she proceeded to shame me for not exercising..",
          "created_utc": 1635885742.0
        },
        {
          "id": "hj254tz",
          "author": "Zcorpiotongue",
          "body": "A GYNECOLOGIST are you kidding me",
          "created_utc": 1635886062.0
        }
      ]
    },
    {
      "id": "hj2tpbu",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1635895808.0,
      "score": 6,
      "context": [
        {
          "id": "hj1utq4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1635882124.0
        },
        {
          "id": "hj1vdro",
          "author": "Zcorpiotongue",
          "body": "That’s terrible. I guess we can’t blame her because she didn’t know but I know how damaging that is.",
          "created_utc": 1635882337.0
        }
      ]
    },
    {
      "id": "hj3x5hw",
      "author": "unfamiliarplaces",
      "body": "whoa, not ALL psychs are like that. it can be really hard to find a good one but a good one will actually take the time to listen to your issues and your story in order to make the most accurate diagnoses and get you started on a regimen that will help. in fact, the best ones will recommend specific types of therapy that they believe will work with your meds to get you into a better place. it can take a lot of searching to find one like that, but that's *actually how they should be*",
      "created_utc": 1635912919.0,
      "score": 10,
      "context": [
        {
          "id": "hj0v38s",
          "author": "fsk1116",
          "body": "Had a new psychiatrist and she scoffed at my PTSD diagnosis (physically abusive ex chased around the house with a loaded gun on multiple occasions as beat the hell out of me)… and then blamed my depression on smoking weed when I was a teen. Super bitch.",
          "created_utc": 1635868025.0
        },
        {
          "id": "hj0vb4x",
          "author": "Zcorpiotongue",
          "body": "I don’t get why people with no compassion would go into psychiatry.",
          "created_utc": 1635868116.0
        },
        {
          "id": "hj0z6cl",
          "author": "derpyfreed",
          "body": "all psychiatrists seem to have no compassion or empathy.. they basically just throw medicine at you and expect you to be fine after like ??? and if you tell them you’re problems they cut you off and say “im not your therapist” isn’t your job to be prescribe medication to me? how will you know what to prescribe if you don’t know my issues lol",
          "created_utc": 1635869699.0
        }
      ]
    },
    {
      "id": "hj4pzej",
      "author": "hanls",
      "body": "I feel like I got lucky! My psych isn’t like that, super lovely and listens a lot",
      "created_utc": 1635935114.0,
      "score": 6,
      "context": [
        {
          "id": "hj0v38s",
          "author": "fsk1116",
          "body": "Had a new psychiatrist and she scoffed at my PTSD diagnosis (physically abusive ex chased around the house with a loaded gun on multiple occasions as beat the hell out of me)… and then blamed my depression on smoking weed when I was a teen. Super bitch.",
          "created_utc": 1635868025.0
        },
        {
          "id": "hj0vb4x",
          "author": "Zcorpiotongue",
          "body": "I don’t get why people with no compassion would go into psychiatry.",
          "created_utc": 1635868116.0
        },
        {
          "id": "hj0z6cl",
          "author": "derpyfreed",
          "body": "all psychiatrists seem to have no compassion or empathy.. they basically just throw medicine at you and expect you to be fine after like ??? and if you tell them you’re problems they cut you off and say “im not your therapist” isn’t your job to be prescribe medication to me? how will you know what to prescribe if you don’t know my issues lol",
          "created_utc": 1635869699.0
        }
      ]
    },
    {
      "id": "hj33azm",
      "author": "Zcorpiotongue",
      "body": "That’s awful. I truly wish you the best and hope you find help despite it being so difficult to find.",
      "created_utc": 1635899778.0,
      "score": 4,
      "context": [
        {
          "id": "hj2r5kb",
          "author": "None",
          "body": "My psychiatrist said there’s nothing wrong with 800 calories a day. She also told me although other people like my family may think I’m too skinny (my BMI was even too low for outpatient programs) that if I feel like I look best at this weight I should maintain it. Oh and I told another psychiatrist I had a history of abusing benzos so they shouldn’t give them to me, 25 minutes later I was handed a prescription for lorazepam. Can’t make this stuff up!",
          "created_utc": 1635894766.0
        },
        {
          "id": "hj2vbyg",
          "author": "Zcorpiotongue",
          "body": "That is absolutely ridiculous. I swear these people don’t actually listen.",
          "created_utc": 1635896484.0
        },
        {
          "id": "hj32oxe",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1635899529.0
        }
      ]
    },
    {
      "id": "hj26m6p",
      "author": "Zcorpiotongue",
      "body": "I’m sorry you had to go through that",
      "created_utc": 1635886617.0,
      "score": 7,
      "context": [
        {
          "id": "hj24aed",
          "author": "katarina-stratford",
          "body": "I had a gynaecologist question why I was thin, told her I have mental health issues, she proceeded to shame me for not exercising..",
          "created_utc": 1635885742.0
        },
        {
          "id": "hj254tz",
          "author": "Zcorpiotongue",
          "body": "A GYNECOLOGIST are you kidding me",
          "created_utc": 1635886062.0
        },
        {
          "id": "hj26g3e",
          "author": "katarina-stratford",
          "body": "I literally had to borrow money to afford the appointment- it really set me back mwntally",
          "created_utc": 1635886553.0
        }
      ]
    },
    {
      "id": "hj2vzg1",
      "author": "Zcorpiotongue",
      "body": "The thinness equating to health is such a problem. Everyone is so quick to congratulate a thin waist.",
      "created_utc": 1635896751.0,
      "score": 5,
      "context": [
        {
          "id": "hj1utq4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1635882124.0
        },
        {
          "id": "hj1vdro",
          "author": "Zcorpiotongue",
          "body": "That’s terrible. I guess we can’t blame her because she didn’t know but I know how damaging that is.",
          "created_utc": 1635882337.0
        },
        {
          "id": "hj2tpbu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1635895808.0
        }
      ]
    }
  ]
}