{
  "id": "r3aj35",
  "subreddit": "AnorexiaNervosa",
  "author": "doublesidedsince99",
  "created_utc": 1638007421.0,
  "title": "Painted how the depression, hopelessness and loneliness feels like right now. Keep fighting everyone ❤️",
  "selftext": "",
  "url": "https://i.redd.it/jrfexqni34281.jpg",
  "score": 242,
  "num_comments": 10,
  "comments": [
    {
      "id": "hm9cvsh",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1638007421.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hm9fbi9",
      "author": "busted3000",
      "body": "I’m so sorry you’re struggling at the moment, but this painting is truly beautiful, thank you for sharing it with us ❤️",
      "created_utc": 1638009544.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hmawozt",
      "author": "wowmiles27",
      "body": "I’m so sorry you’re going through this. It’s incredible that you can express what’s going on through creativity. This is absolutely stunning. You are amazingly talented. Sending you big hugs.🌸",
      "created_utc": 1638038443.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hmavyk8",
      "author": "1prettyseer",
      "body": "Drowning in Pain😔",
      "created_utc": 1638038137.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hmb44ti",
      "author": "woolooooooooo",
      "body": "This is breathtaking but I’m so sorry for the pain you are experiencing. ❤️",
      "created_utc": 1638041557.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hmew1in",
      "author": "Traditional-Ad-1172",
      "body": "How much for a copy of that print?",
      "created_utc": 1638115915.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hmc8crn",
      "author": "somegenerichandle",
      "body": "This is beautiful art. I studied watercolor for a while, it's a fascinating medium and not highly forgiving. Looks like a mask, one crying and taken off. But, also the veins as if the crying an blood are linked. And the glazed over eyes. It conveys a lot.",
      "created_utc": 1638059066.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hmd0shz",
      "author": "Loose-Swimming6210",
      "body": "You are so talented wow. Please take care of yourself so you can do more of this 🥺",
      "created_utc": 1638072896.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hmj0mlm",
      "author": "museofwildflowers",
      "body": "This is gorgeous! You’re so talented ❤️",
      "created_utc": 1638191967.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hppccs6",
      "author": "Lonnie006",
      "body": "u are not alone, I feel like that too.",
      "created_utc": 1640279891.0,
      "score": 1,
      "context": []
    }
  ]
}