{
  "id": "rim41h",
  "subreddit": "AnorexiaNervosa",
  "author": "wowmiles27",
  "created_utc": 1639761303.0,
  "title": "Can people PLEASE read the sub guidelines before posting???",
  "selftext": "They’re there for a reason….\n\n\nIt seems like there are slowly more and more people on here who are asking if they’re anorexic, posting calorie counts and weight numbers, asking for recommendations on laxatives or supplements, asking about specific safe foods, all of which are clearly stated in the guidelines as not being allowed. Also seeing more people post who make clear that they don’t have anorexia at all nor are posting about a loved one who does but come on here to ask about fasting or non-related health issues. Like if you say in your post “idk if this is the right sub for this” then FIND OUT from the guidelines before posting where they make it really clear? Is that too much to ask?\n\nIdk maybe I’m alone in this. I don’t mean to be excluding at all and I’m so sorry if this isn’t an appropriate post, mods feel free to take down if necessary. I’ll probably delete this soon cus I feel really anxious posting it and nervous that if I’m wrong someone will be mean to me:( I know it’s dumb but anxietyyy\n\nI’m so grateful for this sub and the community we have here is so kind and supportive. I guess I’m just wondering if anyone else has noticed this too? Idk maybe I’m just projecting cus I’m in a really vulnerable place in recovery rn:/",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/rim41h/can_people_please_read_the_sub_guidelines_before/",
  "score": 153,
  "num_comments": 25,
  "comments": [
    {
      "id": "hoyq31p",
      "author": "Shadowed-Heart",
      "body": "\"Head\" mod here. Been having a shit year, which directly affects my activity on this subreddit. \n\nIt's [mostly 90%] my fault that these posts aren't getting taken down as quickly as they should be. I have been relying heavily on the new mods to moderate this place, but while they're doing an amazing job from what I can see, they don't have the 2? years of experience on this sub that I do. (I'm by NO means shitting on them. They are amazing people, and are doing amazing things for this subreddit. I am shit at wording things.) \n\nI'm sorry that these posts are more frequent now. I have a lot to deal with schoolwise, but over break I'm hoping to regain some motivation, kick depression's ass a bit, and try to moderate more and try and do some changes to get this sub back to where it should be. I'm so sorry to anyone who has experienced triggering things here. This should be a safe space. I'm sorry we're not accomplishing that goal right now. \n\nIf you see a post or comment breaking the rules, report it immediately, downvote it so it's less likely to gain traction, and make a *modmail* message to the subreddit asking for it to be taken down. Please don't message me or another mod individually. \n\nThank you for being understanding, and I hope I'm able to pick myself up a bit in the upcoming days/weeks and up my activity a bit, hopefully permanently.",
      "created_utc": 1639773204.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hoy65zn",
      "author": "Lunarmoonbear",
      "body": "I hear you. When I get a free award I will gratefully give it to you. \n\nAs a human who recently relapsed, I thought this was a safe place when needing to vent or just be apart of a group who understood.\n\nI don't know how to fix it but I hear you.",
      "created_utc": 1639765351.0,
      "score": 23,
      "context": []
    },
    {
      "id": "hoy4ykj",
      "author": "arnical",
      "body": "I'm not as active on this sub as i am on others but I've definitely noticed it on other subs. most of them, including this one, have an explicit \"no pro-ED\" and \"no tips\" rule that just get completely ignored sometimes. definitely triggering when I'm looking for commiseration and instead find someone asking for tips on how to be more disordered.",
      "created_utc": 1639764893.0,
      "score": 17,
      "context": []
    },
    {
      "id": "hoyb3i6",
      "author": "Ne3dT0B3Sk1nny55",
      "body": "I don’t see what’s wrong with asking about supplements because I see that as harm reduction. But I agree with everything else. This is a recovery space and If people want to talk about their cal intakes they can go to a proana space",
      "created_utc": 1639767262.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hoxvjtx",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1639761303.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hoz8j5w",
      "author": "milkystarrgirl",
      "body": "It really bugs me too!",
      "created_utc": 1639780740.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hozy3ww",
      "author": "vxmpiria",
      "body": "i definitely get it. i first joined this group (on a different account it got deleted) and joined again for support somewhere to talk (without triggering anyone ofc) and now i see a lot of triggering stuff so now i’ve been avoiding this subreddit more and more which is a shame because i’ve liked the support from this group. so i definitely understand how you feel",
      "created_utc": 1639792263.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hoym5ph",
      "author": "None",
      "body": "I get it, especially about recommending something that could literally make the problem worse and potentially support it in any way.  Though, for myself and others like me, I have wondered before if I could potentially have an ED. A lot of people come here searching for answers when they are too scared to seek professional help. I really struggle with food and don’t know where else to turn 😞 I have never straight up asked if I was anorexic and wouldn’t for a number of reasons, but have questioned whether I might have an ED and have been looking for advice on what to do and reading posts to see if I am having similar problems/symptoms. I feel like I could do so much better if I knew what was wrong with me, but it’s so scary to ask. IMO, there is no one better to ask than those that understand personally. I feel like I need to understand before I embarrass myself and make a huge deal out of my problems by asking for help and moving forward, idk sorry.",
      "created_utc": 1639771619.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hp3dzrj",
      "author": "Bright-Artist-9034",
      "body": "Thank you for writing this. It’s been so triggering.",
      "created_utc": 1639863328.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hoyrwcq",
      "author": "wowmiles27",
      "body": "Thank you so much for your comment!! Oh man, it sounds like life is so intense right now, I’m so sorry you’re going through it😞. I’m wishing you all the support you need and bear hugs. I value and appreciate this sub sooo much - thank you, thank you, thank you for all you do!! And to the other mods too!\n\nI’m so grateful for this loving community and for the people who have responded with their input, joining this subreddit has helped me feel much less alone and I’m continuing to learn a lot. It’s a true gift. I hope you take care of yourself and do what’s best for what you need right now. You are so valued and appreciated🌸",
      "created_utc": 1639773939.0,
      "score": 11,
      "context": [
        {
          "id": "hoyq31p",
          "author": "Shadowed-Heart",
          "body": "\"Head\" mod here. Been having a shit year, which directly affects my activity on this subreddit. \n\nIt's [mostly 90%] my fault that these posts aren't getting taken down as quickly as they should be. I have been relying heavily on the new mods to moderate this place, but while they're doing an amazing job from what I can see, they don't have the 2? years of experience on this sub that I do. (I'm by NO means shitting on them. They are amazing people, and are doing amazing things for this subreddit. I am shit at wording things.) \n\nI'm sorry that these posts are more frequent now. I have a lot to deal with schoolwise, but over break I'm hoping to regain some motivation, kick depression's ass a bit, and try to moderate more and try and do some changes to get this sub back to where it should be. I'm so sorry to anyone who has experienced triggering things here. This should be a safe space. I'm sorry we're not accomplishing that goal right now. \n\nIf you see a post or comment breaking the rules, report it immediately, downvote it so it's less likely to gain traction, and make a *modmail* message to the subreddit asking for it to be taken down. Please don't message me or another mod individually. \n\nThank you for being understanding, and I hope I'm able to pick myself up a bit in the upcoming days/weeks and up my activity a bit, hopefully permanently.",
          "created_utc": 1639773204.0
        }
      ]
    },
    {
      "id": "hoy8mf4",
      "author": "wowmiles27",
      "body": "Exactly!! Thank you so much for your reply. I’m so sorry you’ve been triggered in a space that’s supposed to feel safe to vent and reach out for support especially thru a relapse. I’ve reported like three in the past week that were super triggering and broke several rules. My heart goes out to you, stay safe and keep reaching out, you aren’t alone❤️",
      "created_utc": 1639766320.0,
      "score": 8,
      "context": [
        {
          "id": "hoy65zn",
          "author": "Lunarmoonbear",
          "body": "I hear you. When I get a free award I will gratefully give it to you. \n\nAs a human who recently relapsed, I thought this was a safe place when needing to vent or just be apart of a group who understood.\n\nI don't know how to fix it but I hear you.",
          "created_utc": 1639765351.0
        }
      ]
    },
    {
      "id": "hoy66lk",
      "author": "wowmiles27",
      "body": "Yes exactly! Thank you so much for your reply I’m glad I’m not the only one.",
      "created_utc": 1639765357.0,
      "score": 2,
      "context": [
        {
          "id": "hoy4ykj",
          "author": "arnical",
          "body": "I'm not as active on this sub as i am on others but I've definitely noticed it on other subs. most of them, including this one, have an explicit \"no pro-ED\" and \"no tips\" rule that just get completely ignored sometimes. definitely triggering when I'm looking for commiseration and instead find someone asking for tips on how to be more disordered.",
          "created_utc": 1639764893.0
        }
      ]
    },
    {
      "id": "hoyo6nk",
      "author": "wowmiles27",
      "body": "Thank you for your comment!! I totally see what you’re saying about harm reduction, I didn’t consider that. So appreciate your input🌸",
      "created_utc": 1639772434.0,
      "score": 4,
      "context": [
        {
          "id": "hoyb3i6",
          "author": "Ne3dT0B3Sk1nny55",
          "body": "I don’t see what’s wrong with asking about supplements because I see that as harm reduction. But I agree with everything else. This is a recovery space and If people want to talk about their cal intakes they can go to a proana space",
          "created_utc": 1639767262.0
        }
      ]
    },
    {
      "id": "hp0aoj2",
      "author": "wowmiles27",
      "body": "Thank you for commenting!! I so appreciate knowing I’m not alone in this feeling and I’m so sorry you’ve been experiencing it too. I’m understanding more of how much it takes a village to keep spaces safe and supportive and I want to try my best to do my part and report things when needs be and interact in a compassionate way about the sub guidelines. I hope you continue to reach out, none of us should feel as alone and isolated that this illness tries to get us to be. Sending you hugs❤️",
      "created_utc": 1639798604.0,
      "score": 2,
      "context": [
        {
          "id": "hoz8j5w",
          "author": "milkystarrgirl",
          "body": "It really bugs me too!",
          "created_utc": 1639780740.0
        }
      ]
    },
    {
      "id": "hp0a81o",
      "author": "wowmiles27",
      "body": "Thank you so much for your reply, I really appreciate you sharing that and I’m so sorry that you’ve been feeling this too. It’s such a vulnerable space and I hope you continue to reach out for support and connection, it’s the worst thing to feel alone in this. When I first joined I was really floored by the support and kindness and respect of this group, and I still see that vibe outshining the misguided and more triggering posts. My biggest hope is that people are willing to read the guidelines and consider the importance of them. You deserve support and the opportunity to connect with people who understand what you’re going through especially when real life is such a minefield. You aren’t alone. Big hugs.❤️",
      "created_utc": 1639798362.0,
      "score": 2,
      "context": [
        {
          "id": "hozy3ww",
          "author": "vxmpiria",
          "body": "i definitely get it. i first joined this group (on a different account it got deleted) and joined again for support somewhere to talk (without triggering anyone ofc) and now i see a lot of triggering stuff so now i’ve been avoiding this subreddit more and more which is a shame because i’ve liked the support from this group. so i definitely understand how you feel",
          "created_utc": 1639792263.0
        }
      ]
    },
    {
      "id": "hoynqrl",
      "author": "wowmiles27",
      "body": "I totally get that, thank you so much for your comment. I’m so sorry you’re struggling. I think this sub can be so validating when we’re confused and I appreciate the way you framed that. Getting clarity from people who understand can be really helpful. Thanks again for your perspective, it helps give me more to think about, and please know you’re not alone. Wishing you support and sending hugs🌸",
      "created_utc": 1639772257.0,
      "score": 3,
      "context": [
        {
          "id": "hoym5ph",
          "author": "None",
          "body": "I get it, especially about recommending something that could literally make the problem worse and potentially support it in any way.  Though, for myself and others like me, I have wondered before if I could potentially have an ED. A lot of people come here searching for answers when they are too scared to seek professional help. I really struggle with food and don’t know where else to turn 😞 I have never straight up asked if I was anorexic and wouldn’t for a number of reasons, but have questioned whether I might have an ED and have been looking for advice on what to do and reading posts to see if I am having similar problems/symptoms. I feel like I could do so much better if I knew what was wrong with me, but it’s so scary to ask. IMO, there is no one better to ask than those that understand personally. I feel like I need to understand before I embarrass myself and make a huge deal out of my problems by asking for help and moving forward, idk sorry.",
          "created_utc": 1639771619.0
        }
      ]
    },
    {
      "id": "hpbdcun",
      "author": "wowmiles27",
      "body": "I’m so sorry it’s been triggering for you as well, friend😞 It can be such a minefield over the peaks and valleys of our illness and recovery, all of them so fkn difficult and one triggering comment or post can cause such unexpected wobblies. I hope you continue to reach out for support and community, there are so many of us who are more mindful of language and I’m seeing that folks who unintentionally break the sub rules are usually super receptive to being alerted of the particular guideline they might be breaking. This remains such a gentle and compassionate space and I’m understanding that it takes a village to keep it safe for all of us. Sending you big hugs and all the support you need❤️",
      "created_utc": 1640020605.0,
      "score": 2,
      "context": [
        {
          "id": "hp3dzrj",
          "author": "Bright-Artist-9034",
          "body": "Thank you for writing this. It’s been so triggering.",
          "created_utc": 1639863328.0
        }
      ]
    },
    {
      "id": "hoy6jo8",
      "author": "arnical",
      "body": "of course!! i try to report the posts that break those rules and explain in a comment that it's not the appropriate sub to post those things in, and that also helps remind me to keep on my guard",
      "created_utc": 1639765495.0,
      "score": 2,
      "context": [
        {
          "id": "hoy4ykj",
          "author": "arnical",
          "body": "I'm not as active on this sub as i am on others but I've definitely noticed it on other subs. most of them, including this one, have an explicit \"no pro-ED\" and \"no tips\" rule that just get completely ignored sometimes. definitely triggering when I'm looking for commiseration and instead find someone asking for tips on how to be more disordered.",
          "created_utc": 1639764893.0
        },
        {
          "id": "hoy66lk",
          "author": "wowmiles27",
          "body": "Yes exactly! Thank you so much for your reply I’m glad I’m not the only one.",
          "created_utc": 1639765357.0
        }
      ]
    },
    {
      "id": "hp22tbk",
      "author": "derpyfreed",
      "body": "i don’t see anything wrong with asking for harm reduction, specially safer laxative recommendations, i actually almost did it, but then i didn’t because i felt like someone could find the post and use to to future their own disordered behavior. but then again, if someone is going to abuse laxatives, they should do it and be as safe as possible- but this is just my take one it :)",
      "created_utc": 1639842187.0,
      "score": 2,
      "context": [
        {
          "id": "hoyb3i6",
          "author": "Ne3dT0B3Sk1nny55",
          "body": "I don’t see what’s wrong with asking about supplements because I see that as harm reduction. But I agree with everything else. This is a recovery space and If people want to talk about their cal intakes they can go to a proana space",
          "created_utc": 1639767262.0
        },
        {
          "id": "hoyo6nk",
          "author": "wowmiles27",
          "body": "Thank you for your comment!! I totally see what you’re saying about harm reduction, I didn’t consider that. So appreciate your input🌸",
          "created_utc": 1639772434.0
        }
      ]
    },
    {
      "id": "hp0bvhj",
      "author": "vxmpiria",
      "body": "thank you so much :) like you said, although people do post triggering posts, there’s still so much kind and supportive people here! it’s great. thank you",
      "created_utc": 1639799243.0,
      "score": 2,
      "context": [
        {
          "id": "hozy3ww",
          "author": "vxmpiria",
          "body": "i definitely get it. i first joined this group (on a different account it got deleted) and joined again for support somewhere to talk (without triggering anyone ofc) and now i see a lot of triggering stuff so now i’ve been avoiding this subreddit more and more which is a shame because i’ve liked the support from this group. so i definitely understand how you feel",
          "created_utc": 1639792263.0
        },
        {
          "id": "hp0a81o",
          "author": "wowmiles27",
          "body": "Thank you so much for your reply, I really appreciate you sharing that and I’m so sorry that you’ve been feeling this too. It’s such a vulnerable space and I hope you continue to reach out for support and connection, it’s the worst thing to feel alone in this. When I first joined I was really floored by the support and kindness and respect of this group, and I still see that vibe outshining the misguided and more triggering posts. My biggest hope is that people are willing to read the guidelines and consider the importance of them. You deserve support and the opportunity to connect with people who understand what you’re going through especially when real life is such a minefield. You aren’t alone. Big hugs.❤️",
          "created_utc": 1639798362.0
        }
      ]
    },
    {
      "id": "hoyp5p9",
      "author": "None",
      "body": "No you’re totally fine and I appreciate that ☺️ Just wanted to put it out there. I definitely understand where it can be annoying or insulting even. I also enjoy posts like this because it does help me understand where others are coming from, as well. The last thing I want is to upset anyone that is struggling and needs support here. Thank you thank you thank you and I wish the same to you!",
      "created_utc": 1639772828.0,
      "score": 2,
      "context": [
        {
          "id": "hoym5ph",
          "author": "None",
          "body": "I get it, especially about recommending something that could literally make the problem worse and potentially support it in any way.  Though, for myself and others like me, I have wondered before if I could potentially have an ED. A lot of people come here searching for answers when they are too scared to seek professional help. I really struggle with food and don’t know where else to turn 😞 I have never straight up asked if I was anorexic and wouldn’t for a number of reasons, but have questioned whether I might have an ED and have been looking for advice on what to do and reading posts to see if I am having similar problems/symptoms. I feel like I could do so much better if I knew what was wrong with me, but it’s so scary to ask. IMO, there is no one better to ask than those that understand personally. I feel like I need to understand before I embarrass myself and make a huge deal out of my problems by asking for help and moving forward, idk sorry.",
          "created_utc": 1639771619.0
        },
        {
          "id": "hoynqrl",
          "author": "wowmiles27",
          "body": "I totally get that, thank you so much for your comment. I’m so sorry you’re struggling. I think this sub can be so validating when we’re confused and I appreciate the way you framed that. Getting clarity from people who understand can be really helpful. Thanks again for your perspective, it helps give me more to think about, and please know you’re not alone. Wishing you support and sending hugs🌸",
          "created_utc": 1639772257.0
        }
      ]
    },
    {
      "id": "hpoxa4k",
      "author": "Bright-Artist-9034",
      "body": "Thank you so much. Wishing you a lovely Christmas.",
      "created_utc": 1640273507.0,
      "score": 1,
      "context": [
        {
          "id": "hp3dzrj",
          "author": "Bright-Artist-9034",
          "body": "Thank you for writing this. It’s been so triggering.",
          "created_utc": 1639863328.0
        },
        {
          "id": "hpbdcun",
          "author": "wowmiles27",
          "body": "I’m so sorry it’s been triggering for you as well, friend😞 It can be such a minefield over the peaks and valleys of our illness and recovery, all of them so fkn difficult and one triggering comment or post can cause such unexpected wobblies. I hope you continue to reach out for support and community, there are so many of us who are more mindful of language and I’m seeing that folks who unintentionally break the sub rules are usually super receptive to being alerted of the particular guideline they might be breaking. This remains such a gentle and compassionate space and I’m understanding that it takes a village to keep it safe for all of us. Sending you big hugs and all the support you need❤️",
          "created_utc": 1640020605.0
        }
      ]
    },
    {
      "id": "hoy9dnw",
      "author": "wowmiles27",
      "body": "Yes! I’m glad to hear that, I’ve been reporting them when I see them too, sometimes I’ll want to comment and end up refraining cus I’m nervous, but that’s a good way of putting it, about it just not being an appropriate sub. Thank you🌸",
      "created_utc": 1639766607.0,
      "score": 2,
      "context": [
        {
          "id": "hoy4ykj",
          "author": "arnical",
          "body": "I'm not as active on this sub as i am on others but I've definitely noticed it on other subs. most of them, including this one, have an explicit \"no pro-ED\" and \"no tips\" rule that just get completely ignored sometimes. definitely triggering when I'm looking for commiseration and instead find someone asking for tips on how to be more disordered.",
          "created_utc": 1639764893.0
        },
        {
          "id": "hoy66lk",
          "author": "wowmiles27",
          "body": "Yes exactly! Thank you so much for your reply I’m glad I’m not the only one.",
          "created_utc": 1639765357.0
        },
        {
          "id": "hoy6jo8",
          "author": "arnical",
          "body": "of course!! i try to report the posts that break those rules and explain in a comment that it's not the appropriate sub to post those things in, and that also helps remind me to keep on my guard",
          "created_utc": 1639765495.0
        }
      ]
    },
    {
      "id": "hoys76t",
      "author": "wowmiles27",
      "body": "Thank you so much! And for the award☺️ I feel so grateful for everyone’s authenticity and kindness and the opportunity to keep learning❤️",
      "created_utc": 1639774059.0,
      "score": 1,
      "context": [
        {
          "id": "hoym5ph",
          "author": "None",
          "body": "I get it, especially about recommending something that could literally make the problem worse and potentially support it in any way.  Though, for myself and others like me, I have wondered before if I could potentially have an ED. A lot of people come here searching for answers when they are too scared to seek professional help. I really struggle with food and don’t know where else to turn 😞 I have never straight up asked if I was anorexic and wouldn’t for a number of reasons, but have questioned whether I might have an ED and have been looking for advice on what to do and reading posts to see if I am having similar problems/symptoms. I feel like I could do so much better if I knew what was wrong with me, but it’s so scary to ask. IMO, there is no one better to ask than those that understand personally. I feel like I need to understand before I embarrass myself and make a huge deal out of my problems by asking for help and moving forward, idk sorry.",
          "created_utc": 1639771619.0
        },
        {
          "id": "hoynqrl",
          "author": "wowmiles27",
          "body": "I totally get that, thank you so much for your comment. I’m so sorry you’re struggling. I think this sub can be so validating when we’re confused and I appreciate the way you framed that. Getting clarity from people who understand can be really helpful. Thanks again for your perspective, it helps give me more to think about, and please know you’re not alone. Wishing you support and sending hugs🌸",
          "created_utc": 1639772257.0
        },
        {
          "id": "hoyp5p9",
          "author": "None",
          "body": "No you’re totally fine and I appreciate that ☺️ Just wanted to put it out there. I definitely understand where it can be annoying or insulting even. I also enjoy posts like this because it does help me understand where others are coming from, as well. The last thing I want is to upset anyone that is struggling and needs support here. Thank you thank you thank you and I wish the same to you!",
          "created_utc": 1639772828.0
        }
      ]
    },
    {
      "id": "hoytdp8",
      "author": "None",
      "body": "Of course, that’s why you got it - for being so open and kind!!",
      "created_utc": 1639774530.0,
      "score": 1,
      "context": [
        {
          "id": "hoym5ph",
          "author": "None",
          "body": "I get it, especially about recommending something that could literally make the problem worse and potentially support it in any way.  Though, for myself and others like me, I have wondered before if I could potentially have an ED. A lot of people come here searching for answers when they are too scared to seek professional help. I really struggle with food and don’t know where else to turn 😞 I have never straight up asked if I was anorexic and wouldn’t for a number of reasons, but have questioned whether I might have an ED and have been looking for advice on what to do and reading posts to see if I am having similar problems/symptoms. I feel like I could do so much better if I knew what was wrong with me, but it’s so scary to ask. IMO, there is no one better to ask than those that understand personally. I feel like I need to understand before I embarrass myself and make a huge deal out of my problems by asking for help and moving forward, idk sorry.",
          "created_utc": 1639771619.0
        },
        {
          "id": "hoynqrl",
          "author": "wowmiles27",
          "body": "I totally get that, thank you so much for your comment. I’m so sorry you’re struggling. I think this sub can be so validating when we’re confused and I appreciate the way you framed that. Getting clarity from people who understand can be really helpful. Thanks again for your perspective, it helps give me more to think about, and please know you’re not alone. Wishing you support and sending hugs🌸",
          "created_utc": 1639772257.0
        },
        {
          "id": "hoyp5p9",
          "author": "None",
          "body": "No you’re totally fine and I appreciate that ☺️ Just wanted to put it out there. I definitely understand where it can be annoying or insulting even. I also enjoy posts like this because it does help me understand where others are coming from, as well. The last thing I want is to upset anyone that is struggling and needs support here. Thank you thank you thank you and I wish the same to you!",
          "created_utc": 1639772828.0
        },
        {
          "id": "hoys76t",
          "author": "wowmiles27",
          "body": "Thank you so much! And for the award☺️ I feel so grateful for everyone’s authenticity and kindness and the opportunity to keep learning❤️",
          "created_utc": 1639774059.0
        }
      ]
    }
  ]
}