{
  "id": "rwu1gp",
  "subreddit": "AnorexiaNervosa",
  "author": "bigboofy666",
  "created_utc": 1641408659.0,
  "title": "Faking an ED",
  "selftext": "Does anybody else feel like they’re faking their eating disorder? Even though normal people wouldn’t even think that they have an eating disorder or question it? Or lie all the time about food? Like idk I just feel like a fraud lol and I’m literally in inpatient and feel like I’m taking up space.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/rwu1gp/faking_an_ed/",
  "score": 130,
  "num_comments": 15,
  "comments": [
    {
      "id": "hre0swj",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1641408659.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hre4wy2",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1641410134.0,
      "score": 42,
      "context": []
    },
    {
      "id": "hrerjl7",
      "author": "AKsandfire",
      "body": "It's that imposter syndrome of \"I don't have it to the extreme so I don't count\" kinda thing. \n\nI don't have a binge/purge cycle but I do feel the compulsion to binge. I don't starve myself to the point of passing out or needing hospitalization (yet and I hope not to) but I am triggered by large meals, obcessively calorie count, and will aggressively restrict my caloric intake to try and meet some arbitrary guideline that itself is far below where I should be for someone of my height/weight/physical activity, etc. \n\nI struggle every day to try and eat enough and it really fucks with my head when I do because it feels like too much or whatever. Some days I'm great, other days I'm freaking out because I allowed myself to have a little thing. \n\nJust because the 'wound' isn't mortal doesn't mean the 'wound' isn't damaging.",
      "created_utc": 1641419543.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hre3w0w",
      "author": "LemonTwist28",
      "body": "I think it’s perfectly normal, unfortunately. A distortion of the mind. Have you ever read about opposite thinking/actions? Give yourself a hug and say it’s okay for you to be there. You’re there because you need it ❤️",
      "created_utc": 1641409764.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hrelusi",
      "author": "woahhhhwhat",
      "body": "Absolutelyyyyyy! That’s just the ED hard at work trying to convince you it’s not there as it kills you lol - it’s a sneaky bastard like that. Sometimes It’s even like carbon monoxide poisoning, invisible and pervasive until it kills you all at once in your sleep. How can you get help for your problem when the problem itself argues with you about its existence, right? Eating disorders are especially isolating because of that and it makes it feel so lonely and anxiety inducing to talk about what you’re going through because you’re terrified people will say ‘you don’t look sick’ or will deny your pain and experience because of what they think eating disorders are. But ED’s are a MENTAL disorder, and the mental pain and effect on your life are just a much a part of the disease and the toll it takes as any weight loss or bodily damage, most likely more so for a lot of individuals. I feel like a fraud whenever I eat a normal amount and don’t immediately hate myself. But even reading that back…. It’s just classic ED ammunition. I’m doubting my eating disorder and pain because of a moment where I wasn’t suffering and filled with such self loathing over a sandwich that I need to punish myself ??? That’s just another indication of the disorder. Take care of yourself!!!! There’s no one way an eating disorder looks or manifests or feels , and your pain deserves to be alleviated and you deserve to be healthy and have joy no matter what the sickness or anyone else tells you",
      "created_utc": 1641417204.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hrev33c",
      "author": "Sylvia-Plaths-Oven",
      "body": "One of the most common things I see with people my age with EDs and younger people on twt and such, is that they question the validity.\n\nQuestioning the validity while you are in treatment is classic. I did it back in my early 20's. \n\nI'm not having heart problems or whatever, I told myself. I am still healthy. I'm not bald yet, still healthy. Even when my period stopped, I thought it was because i was too fat. I still think that.\n\nIn my 30's and been diagnosed since middle school. Doesn't ever feel \"sick enough\".",
      "created_utc": 1641420944.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hrggtez",
      "author": "Glitter_Cunt",
      "body": "“Feels like they’re faking their eating disorder” should probably be added to the dsm diagnostic criteria for literally every eating disorder",
      "created_utc": 1641448397.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hrff5uc",
      "author": "marainblue",
      "body": "i'm feeling like this a lot these days because i'm taking a medication that it's a little harsh on your body and it needs fat to dissolve so i'm eating more but it feels like this is recovering even when i don't want to. luckily i haven't gained but i'm not losing anymore either. it feels like i'm lying but i don't know to who exactly.",
      "created_utc": 1641428651.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hrfiaol",
      "author": "None",
      "body": "yes this is very common actually !! a lot of people also think they fool their therapist to diagnose them with an ED, its just how having eating disorders are but you’re definitely not faking it",
      "created_utc": 1641429920.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hrghlye",
      "author": "distractedbyme",
      "body": "you're eating disorder wants to be the sickest one in the room",
      "created_utc": 1641448851.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hrm5q94",
      "author": "EtoileFragile",
      "body": "Oh god same 😂 I always think it's a sign of how twisted my brain gets when I'm restricting and purging and obsessed with food/weight and my mind tries to tell me I'm faking. \n\nI try to remember one thing - if you're questioning whether you're sick enough, you are.",
      "created_utc": 1641546168.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hrgbjm7",
      "author": "JellyCharacter1653",
      "body": "Yea all the time my has fully convinced me of it n I hate it like I’m dying but idk if I’m faking it or not yk",
      "created_utc": 1641445589.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hrhfeke",
      "author": "MoonDancer83",
      "body": "Yes I wonder about the validity of my eating disorder all the time because I have Atypical Anorexia so don't have a low weight (yet, I'm hoping not to get to low just a normal goal) so I look in the mirror and think to myself I don't have an ED I'm all good, even though the rational side of my brain knows I have a problem.",
      "created_utc": 1641472588.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hries8w",
      "author": "SeparateCombination7",
      "body": "I definitely feel that especially since I put on some weight. I was never hospitalized or dying so I feel like I’m being dramatic if I consider it an ED. Yet I still struggle a lot with disliking my body and using that as a reason to restrict excessively.",
      "created_utc": 1641487732.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hrj17tm",
      "author": "None",
      "body": "i've never felt as if i were faking it cuz its very real and horrifying to me but i've felt as if others thought i was faking it.",
      "created_utc": 1641495930.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hrfei6k",
      "author": "AnaMaxine",
      "body": "me with my sandwich 20 minutes ago 😭",
      "created_utc": 1641428391.0,
      "score": 11,
      "context": [
        {
          "id": "hre4wy2",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641410134.0
        }
      ]
    }
  ]
}