{
  "id": "sibw1v",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1643765977.0,
  "title": "does anyone else hate that their only two states are extremely hungry or extremely full",
  "selftext": "It's been so long since I have eaten a meal that both satisfied my hunger and didn't make me feel like I overate.  I really hope one day I'll get to a point where being starved from restriction or insanely full from bingeing episodes are not my only two possible feelings with food.\n\nAnyone else relate?!",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/sibw1v/does_anyone_else_hate_that_their_only_two_states/",
  "score": 162,
  "num_comments": 8,
  "comments": [
    {
      "id": "hv7t8oh",
      "author": "AutoModerator",
      "body": "You are not in trouble. Thank you for posting on r/AnorexiaNervosa. Please make sure you have read the subreddit rules at this time. If a user says something in the comments that break the subreddit rules, please report the comment to the moderators with the report function. If they have said something harmful and it is immediately harmful to you or others, please MOD MAIL the moderators of the subreddit and report the comment. Do not engage with trolls; they want to hurt you and others and engaging will not do any good for anyone. \n\nCommenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease take a look at [this](https://www.reddit.com/r/AnorexiaNervosa/comments/nsb9ci/hi_everyone_a_much_needed_post/) stickied post for information about the rule changes, additions, and how to become a moderator if you are interested. \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1643765977.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hv80q9w",
      "author": "roadkilldolly",
      "body": "it's been the same for me lately!! you are not alone. it's either hunger pangs from the restriction or nausea from the binging at this point and it feels like an endless cycle. my body is constantly in some sort of pain because of my eating habits. i hope it at least brings you some comfort to know you're not alone in having this experience. hang in there <3",
      "created_utc": 1643769075.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hv8ffea",
      "author": "None",
      "body": "I experienced this a lot until recently, but I've made a few changes that help me feel full without guilt and shame. I'm still unwell, and undereating, so I wouldn't say these are necessarily \"healthy\" tips, but they do help me feel more in control around food when I choose to eat.\n\nCurrently, I try to prepare balanced meals that incorporate my fear foods in small ways *and* hit all the major food groups -- carbs, fat, protein, fiber, etc. I used to volume eat because I'd get so ravenous that I felt like I needed a huge portion, but I think this was actually counterintuitive. The unbalanced nutrition (lots of fiber, not much else) didn't keep me satisfied, and eating so much made me feel like I'd \"binged\" even when the food I consumed was low-calorie.\n\nNow, I try to eat small portions of fear foods, like real bread and cheese, with larger (but not massive) portions of vegetables, fruit, or other higher-volume foods. I find that this satisfies me emotionally and physically, as I'm not eating around my cravings, but I'm full enough from higher-volume foods that I don't feel the need to binge on fear foods.\n\nI also try to plate everything nicely and designate time for meals, so I'm not stuffing food into my mouth in the kitchen. This doesn't necessarily mean eating extremely slowly and chewing each bite 300 times or anything, but spacing the meal out over at least a few minutes helps me feel like I'm in control and puts me in tune with my fullness cues. Typically, I'll also watch a podcast or a YouTube video or Netflix show while I eat, so I'm able to enjoy my meal without fixating on the thought that I'm *eating,* which can be triggering in itself. (Since I've portioned out my meal beforehand, there's no worry about accidentally overeating, as I might do if I was eating chips from a bag.)\n\nFinally, I *generally* try to avoid \"fake\" foods if I can help it, unless I actually like them. In my experience, they tend to make me feel weird physically, or they leave a weird aftertaste, or they remind me of the \"non-diet\" version of the food that I'd rather be consuming, or I associate them with restriction and sadness and anorexia rather than pleasure and enjoyment of food, which I'm trying to emphasize.\n\nI think this approach to food is still pretty neurotic and restrictive -- it's definitely not where I want to be -- but I don't constantly feel like shit all the time anymore, and I've even found a lot of pleasure and happiness in meals recently. So, I hope this at least helps as a form of harm reduction.",
      "created_utc": 1643775479.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hv84abx",
      "author": "Current_Kangaroo_936",
      "body": "You are not alone, I promise and we are here to help at least to listen",
      "created_utc": 1643770561.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hv8r4xl",
      "author": "None",
      "body": "Yeah",
      "created_utc": 1643781675.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hv8rua0",
      "author": "ThatIntention1",
      "body": "right. and while both feel uncomfortable, the feeling of fullness is way worse",
      "created_utc": 1643782095.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hv9egdj",
      "author": "StarPremCoord",
      "body": "I feel the same. Since I restrict by massive amounts at times i end up extremely hungry and obviously i ignore that as long as i can but then of course we all have to eat eventually so when that time comes ill eat one low calorie thing but usually since i restricted by massive amounts prior to that, i end up 'binging' a little and since i got a tiny stomach that makes me so full. I really dont get a break  haha. \n\nI put binging in '' mainly because ordinary diet people would probably still say it is too little lmao but i personally think its way too much and i feel so so so so guilty after😩😔",
      "created_utc": 1643798914.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hv9hmjo",
      "author": "bitchontheinternet94",
      "body": "I have been trying to figure out how to find the perfect Middle and incan never balance out the two. even though it is supposed to be a no brainer to know how much and how often to eat if your body is hungry but this is literally such a complicated process for me",
      "created_utc": 1643801210.0,
      "score": 1,
      "context": []
    }
  ]
}