{
  "id": "ssfe50",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1644857961.0,
  "title": "people don’t really talk about the trauma caused by an ED",
  "selftext": "For me, my ED has been relatively traumatic in itself. And even though i’m still suffering and living with it, the flashbacks of worser times is horrible. \n\nI feel like this is not really spoken about. \n\nIf i ever smell anything or listen to any songs i listened to at my worst mental health it causes a whole trauma response. \n\nI started having a panic attack at work the other week because a customer was wearing a perfume my mum sprayed on my hospital bed. \n\nI’m so sorry to anyone else has had traumatic experiences in their eating disorder. I’m sending you love <3",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/ssfe50/people_dont_really_talk_about_the_trauma_caused/",
  "score": 124,
  "num_comments": 13,
  "comments": [
    {
      "id": "hwxejre",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1644857961.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hwxnp6h",
      "author": "ConfidentStrength999",
      "body": "Sending you love as well <3 I wish this was something discussed more.  I've been recovered for years but the trauma of my ED still stays with me. I had some truly horrible experiences with involuntary treatment, and then when my ED was at its worst, that was traumatizing in a different way.  Anyway, just know you're not alone and I'm wishing you healing and recovery.",
      "created_utc": 1644861737.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hwy1m9r",
      "author": "Loose-Swimming6210",
      "body": "Oo this is so real. I know this might not be helpful framing for some people, but I see my ed as having a kind of abusive relationship with myself. Withholding food, not caring if I felt like shit, wearing myself down, etc. treating yourself like that is not only physically detrimental it’s also very emotionally traumatizing. Thanks for mentioning this.",
      "created_utc": 1644867382.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hwyfdva",
      "author": "whataboutbrie",
      "body": "I think calling it an abusive relationship is so apt! Very similar dynamics at play. Also the trauma of becoming isolated…losing friends, jobs, educational opportunities…as well as the trauma of being subjected to involuntary treatment (even though it saves your life, it is physically and emotionally brutal) is 100% a real thing. I had a really good group therapist who got us to explore this aspect of the illness and most of the group members reported having trauma responses like OP to sounds, smells, tastes associated with the treatment they had at their sickest. It’s kind of like “we’ll save your life, but you get to live with a new disease now! *dumps a ton more anxiety on top of the crazy pile*",
      "created_utc": 1644872968.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hwyxxyu",
      "author": "Nuttereater09",
      "body": "I just experienced it last night. It was a mistake looking at some photos (not just of myself) during my worst of times. I broke down and started having a panic attack. I’m recovered now, I’m not sure to what extent because I thought of relapsing, BUT I had to remind myself over and over that I do not ever want to experience or be in that situation again.",
      "created_utc": 1644882574.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hwyy6hf",
      "author": "sunflowerluce",
      "body": "i needed to hear that other people get this too. i really thought i was just so sensitive but the weird horrible sense of nostalgia i get from my ed and how much its traumatised me and ruined my teenage years and childhood is terrifying",
      "created_utc": 1644882689.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hx012t4",
      "author": "runninginbubbles",
      "body": "Oh the smells and the songs, I completely feel this. I actually just talked to my psychologist about this the other day. Mum brought some of these vegetarian sausages home last week, we hadn't had them in the house for years but they were something that I was encouraged to have by my dietitian years ago (like meat alternatives for protein etc). \n\nWhen she cooked them, the smell just send me in a whirl. Everything just came back, it felt like I was standing in the same place I was 10 years ago worrying about these sausages. Sigh. \n\nAny song that was 'big' where I am in 2009-2013 is enough to make me cry. \n\nSuperchick songs like 'Courage' and 'Stand in the Rain' (massive in the ED community - particularly on youtube 'my anorexia story' vids - back in 2009).. the intro music makes my stomach flip.",
      "created_utc": 1644902009.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hwxzfba",
      "author": "thatone111111",
      "body": "too true. sending you love. xx",
      "created_utc": 1644866498.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hwzndtq",
      "author": "xo_softballchick_xo",
      "body": "its never easy when i'm just going about my day and then something accidentally triggers it and just like that i'm dealing with stuff i fought so hard to overcome\n\nsending you love as well <3",
      "created_utc": 1644894788.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hx18huw",
      "author": "retropomme",
      "body": "so true. i also never hear about the trauma of having been severely underweight, feeling my body give out and my brain slowing down more and more each day, until it felt like it was just going to stop eventually. and the fucking cold. i used to be SO cold in the winter (i live in Canada), that now i’m weight recovered and handle the cold much better but it still makes me freak out. i still wear 3 layers of pants to go outside, huge coats when it’s -5°C outside, everyone looks at me like i’m crazy but i just can’t handle low temperatures anymore, and i know it’s more mental than it is physical, since i’m weight recovered.",
      "created_utc": 1644932687.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hx5810a",
      "author": "slut-for-broccoli",
      "body": "I feel this, I have a note in my phone of things that smell like anorexia (the first time, at least). it was hugely traumatic for me. one of the perfumes I wore during that time is still my favourite and it’s so conflicting to smell it and love it but hate it at the same time.",
      "created_utc": 1644995011.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hx65hr1",
      "author": "None",
      "body": "definitely, and the pain of sitting down or lying down on your body and never being able to feel comfortable!",
      "created_utc": 1645018523.0,
      "score": 1,
      "context": [
        {
          "id": "hx18huw",
          "author": "retropomme",
          "body": "so true. i also never hear about the trauma of having been severely underweight, feeling my body give out and my brain slowing down more and more each day, until it felt like it was just going to stop eventually. and the fucking cold. i used to be SO cold in the winter (i live in Canada), that now i’m weight recovered and handle the cold much better but it still makes me freak out. i still wear 3 layers of pants to go outside, huge coats when it’s -5°C outside, everyone looks at me like i’m crazy but i just can’t handle low temperatures anymore, and i know it’s more mental than it is physical, since i’m weight recovered.",
          "created_utc": 1644932687.0
        }
      ]
    },
    {
      "id": "hx18in6",
      "author": "kelvin_bot",
      "body": "2°C is equivalent to 35°F, which is 275K.\n---\n^(I'm a bot that converts temperature between two units humans can understand, then convert it to Kelvin for bots and physicists to understand)",
      "created_utc": 1644932697.0,
      "score": 1,
      "context": [
        {
          "id": "hx18huw",
          "author": "retropomme",
          "body": "so true. i also never hear about the trauma of having been severely underweight, feeling my body give out and my brain slowing down more and more each day, until it felt like it was just going to stop eventually. and the fucking cold. i used to be SO cold in the winter (i live in Canada), that now i’m weight recovered and handle the cold much better but it still makes me freak out. i still wear 3 layers of pants to go outside, huge coats when it’s -5°C outside, everyone looks at me like i’m crazy but i just can’t handle low temperatures anymore, and i know it’s more mental than it is physical, since i’m weight recovered.",
          "created_utc": 1644932687.0
        }
      ]
    }
  ]
}