{
  "id": "tsn5kx",
  "subreddit": "AnorexiaNervosa",
  "author": "lalalaladyy",
  "created_utc": 1648685704.0,
  "title": "Commenting about my food or me eating makes me want to stop eating!!! Shut up!!!!",
  "selftext": "Thank you for killing my appetite 😀😀😀😀😀😀😀😀😀😀😀😀😀😀😀😀😀😀",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/tsn5kx/commenting_about_my_food_or_me_eating_makes_me/",
  "score": 109,
  "num_comments": 15,
  "comments": [
    {
      "id": "i2s9vgg",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1648685704.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i2sh63n",
      "author": "None",
      "body": "I agree. Even if it's jokingly said it still hurts. \"I won't make you a plate, you eat like a bird\". \"Don't worry about rainbow, she won't eat anyways\". There are people who understand. Uncle buys big sandwiches and cuts it up so I don't have to eat it all at once. I hope you have some of those people in your life",
      "created_utc": 1648689007.0,
      "score": 19,
      "context": []
    },
    {
      "id": "i2sy8hw",
      "author": "Fit_Confidence_7606",
      "body": "Exactly. When they’re like “see, you’re eating!” It makes me want to scream",
      "created_utc": 1648697044.0,
      "score": 17,
      "context": []
    },
    {
      "id": "i2tktq1",
      "author": "StarPremCoord",
      "body": "this. THIS.😭",
      "created_utc": 1648712149.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i2uw3rq",
      "author": "None",
      "body": "“Oh wow you actually brought a lunch today” FUCK OFF JANET",
      "created_utc": 1648740252.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i2t5odl",
      "author": "Netvision9",
      "body": "My boyfriends dad announced to the whole house that I ate some chocolates that had my name on them. His grandma brought up the fact I ate the chocolates at my job a few days later so I guess the dad then told her??. Idk how long or why they were paying attention to what I've been eating but never again. It's not a super big deal but now I know that they too are watching what I'm eating 😭😭😭😭",
      "created_utc": 1648701216.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i2txd1h",
      "author": "maryjean0524",
      "body": "Omg I know...at every family get together people are watching what I eat and commenting...like its none of your business im trying here so hard leave me alone 😭",
      "created_utc": 1648722808.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i2v2bsc",
      "author": "bumblebabby",
      "body": "it’s even worse when you finally get the courage to eat something and it’s “id never eat those, they’re so sugary and bad for you” or “i’m so glad to see you eat a salad instead of all that greasy junk food” \nlike oh okay",
      "created_utc": 1648742646.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i2u4vla",
      "author": "None",
      "body": "I feel this so hard. I know people are paying attention but please don’t actually say anything!",
      "created_utc": 1648727846.0,
      "score": 3,
      "context": []
    },
    {
      "id": "linyvpf",
      "author": "UYRDAD",
      "body": "i fucking know right. i was in a mental hospital and barely ate my meals (would just put my head down at the cafeteria or when they brought food) and the times i did the other patients would say \"wow you're actually eating today??\" or theyd ask for my food because they know i wouldnt eat it. like thanks for fueling my disorder in a place ur supposed to get treatment for it😄\n\nEDIT: i just want to clarify that i wasn't in an ED ward and was actually in there for a different reason, BUT STILL. people with EDs still came to that ward and it was wildly obvious i had an unhealthy relationship with food, yet there was absolutely no care in regard to any of that 🫤 i just wish people would be a little more sensitive with these types of comments.. because personally, with my ED ruined brain, the SLIGHTEST most insignificant remark can set off my ED and make me restrict even more like crazy. its insane how anyone can say the smallest thing and id never stop thinking about it and have it fuel my disorder even more... (i know this isnt anyones fault but i just wish people would be more aware in some situations ESPECIALLY in a mental hospital)",
      "created_utc": 1723952047.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i2v2j9x",
      "author": "catye_luna",
      "body": "every time i have dinner with my mom like at family get togethers she watches me eat the whole time i literally hate it",
      "created_utc": 1648742726.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i2ys7bu",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1648808626.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i4jq6y2",
      "author": "Aggressive_Affect_61",
      "body": "Yeah fr triggers me like nothing else ever will",
      "created_utc": 1649845379.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i2uw5og",
      "author": "None",
      "body": "Sorry😅 that got pretty heated",
      "created_utc": 1648740273.0,
      "score": 5,
      "context": [
        {
          "id": "i2uw3rq",
          "author": "None",
          "body": "“Oh wow you actually brought a lunch today” FUCK OFF JANET",
          "created_utc": 1648740252.0
        }
      ]
    },
    {
      "id": "i2t9gsc",
      "author": "None",
      "body": "Why? That's just weird",
      "created_utc": 1648703573.0,
      "score": 4,
      "context": [
        {
          "id": "i2t5odl",
          "author": "Netvision9",
          "body": "My boyfriends dad announced to the whole house that I ate some chocolates that had my name on them. His grandma brought up the fact I ate the chocolates at my job a few days later so I guess the dad then told her??. Idk how long or why they were paying attention to what I've been eating but never again. It's not a super big deal but now I know that they too are watching what I'm eating 😭😭😭😭",
          "created_utc": 1648701216.0
        }
      ]
    },
    {
      "id": "i3551xy",
      "author": "Shadowed-Heart",
      "body": "removed for rule 10",
      "created_utc": 1648928216.0,
      "score": 1,
      "context": [
        {
          "id": "i2ys7bu",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1648808626.0
        }
      ]
    }
  ]
}