{
  "id": "tyhgm4",
  "subreddit": "AnorexiaNervosa",
  "author": "trashh0l0gram",
  "created_utc": 1649350715.0,
  "title": "I don’t suffer with an ED. I am just naturally quite skinny, someone sent me this on Pinterest in response to my outfit posts. How am I supposed to respond to it?",
  "selftext": "",
  "url": "https://i.redd.it/xdxgu8ey05s81.jpg",
  "score": 131,
  "num_comments": 43,
  "comments": [
    {
      "id": "i3s7y1b",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1649350715.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i3s9x5k",
      "author": "Formal_Candle37",
      "body": "That... just seems like poor boundaries on their part. Even if you *were* posting thinspo or body checks or whatever, all they need to do is block your account.",
      "created_utc": 1649351514.0,
      "score": 168,
      "context": []
    },
    {
      "id": "i3s85wa",
      "author": "trashh0l0gram",
      "body": "On one hand I feel like it’s really rude to ask people if they have an ED, but also I don’t want to upset/trigger this girl.",
      "created_utc": 1649350803.0,
      "score": 99,
      "context": []
    },
    {
      "id": "i3s9pjm",
      "author": "BornAgainMisbeliever",
      "body": "“Don’t look.”",
      "created_utc": 1649351429.0,
      "score": 70,
      "context": []
    },
    {
      "id": "i3sd4pv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1649352766.0,
      "score": 40,
      "context": []
    },
    {
      "id": "i3sijhw",
      "author": "None",
      "body": "This is just weird. Please know we're not all like this, and most of us would just block your account.",
      "created_utc": 1649354881.0,
      "score": 39,
      "context": []
    },
    {
      "id": "i3sf3bz",
      "author": "None",
      "body": "Just ignore or write “lol all natural bye”. Seriously. Some people with ED are unbearable and unbelievable, it is not your duty to take care of them and always stand. She crossed plenty boundaries and as she said by herself she is stranger. So, you don’t owe her anything :)",
      "created_utc": 1649353544.0,
      "score": 46,
      "context": []
    },
    {
      "id": "i3sr2z1",
      "author": "catsinsunglassess",
      "body": "Weird. They’re responsible for their own triggers. I wouldn’t engage.",
      "created_utc": 1649358038.0,
      "score": 21,
      "context": []
    },
    {
      "id": "i3smnmb",
      "author": "Various-List",
      "body": "I wouldn’t give any personal info about yourself whether you have an ED or not. Just recommend that she keep herself safe and hide your content if it’s triggering for her because that isn’t your intention.",
      "created_utc": 1649356392.0,
      "score": 19,
      "context": []
    },
    {
      "id": "i3t2j3o",
      "author": "None",
      "body": "Block them. They have no business sending you a message like that, unbelievable. It’s not your fucking job to make sure they aren’t triggered by your *body*. Idek why they messaged you, to tell you about their ED for pity points? \n\nThis person is creepy and way out of line for messaging you something like this. They don’t have any right to ask if you have an ED. If they are triggered by your posts, that is their problem and they can block you or choose not to look at your page.\n\nPlus, blocking them means they can’t be triggered by your posts anymore, so you’d be doing them a favor",
      "created_utc": 1649362379.0,
      "score": 18,
      "context": []
    },
    {
      "id": "i3slwdi",
      "author": "mallgoethe",
      "body": "just block them. they are responsible for moderating their own online experience.",
      "created_utc": 1649356122.0,
      "score": 14,
      "context": []
    },
    {
      "id": "i3st11g",
      "author": "suhwyu",
      "body": "“That sounds like a you problem”",
      "created_utc": 1649358775.0,
      "score": 13,
      "context": []
    },
    {
      "id": "i3sd9jt",
      "author": "throwthishoe420",
      "body": "how rude of that person. if you want to be nice maybe thank them for their concern but tell them that made you uncomfortable. if you don’t tell them to mind their fucking business",
      "created_utc": 1649352817.0,
      "score": 13,
      "context": []
    },
    {
      "id": "i3sl7kt",
      "author": "Eve1Love",
      "body": "That’s weird, the emojis make it even weirder",
      "created_utc": 1649355868.0,
      "score": 12,
      "context": []
    },
    {
      "id": "i3sktv0",
      "author": "That_Silent_Weirdo",
      "body": "Tell them to block you if they're uncomfortable. Why should you bend your back and control your posts if they have the magical block button at the reach of their hand?",
      "created_utc": 1649355728.0,
      "score": 11,
      "context": []
    },
    {
      "id": "i3sopw4",
      "author": "rodrickgf",
      "body": "if your posts are triggering them thats not your responsibility to sort out, they should unfollow",
      "created_utc": 1649357159.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i3t6ydt",
      "author": "None",
      "body": "This seems like such a bizarre thing to ask as an introduction. \"Hey, you make me feel bad about myself, so please tell me you photoshop your images.\"\n\n???",
      "created_utc": 1649364099.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i3sxpzs",
      "author": "FayrisDraconis",
      "body": "You don't owe any kind of response",
      "created_utc": 1649360561.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i3tvfe7",
      "author": "sorcerers_apprentice",
      "body": "I wouldn’t respond, honestly. This is inappropriate of them, especially if they are “recovered.” Your body is not their business.",
      "created_utc": 1649374248.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i3szd47",
      "author": "Sad_Dream_6380",
      "body": "Wow lol. You aren’t to blame for other peoples triggers. It’s called “keep scrolling”. People are so annoying.",
      "created_utc": 1649361186.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i3to6ub",
      "author": "k1ll1ngmys3lfsl0wly",
      "body": "this message gives me the ick\n\nrespond with a block",
      "created_utc": 1649371203.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i3tsyvm",
      "author": "moopmopbop",
      "body": "I think you should block them. You’re doing them a favor by blocking her from seeing your photos if their triggering for her",
      "created_utc": 1649373207.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i3t8bp4",
      "author": "Lopsided-Shallot-124",
      "body": "Jfc that lady is being wildly inappropriate. I see fitness models who make me super curious if they got a bbl when they are peddling work out programs for booty gains... But I know it's none of my darn business... even if I think they are scamming people with unrealistic goals 😅",
      "created_utc": 1649364651.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i3u6tpb",
      "author": "bunni_bear_boom",
      "body": "I'd block them. If you are triggering them then they should know as little as possible about your situation so they can't compare and shouldn't be seeing your pictures. Plus it's a really rude message",
      "created_utc": 1649379244.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i3u7nqo",
      "author": "None",
      "body": "You don’t respond to that. Whoever sent you that is ridiculous for doing so and the battle that they’re fighting within their own mind has *nothing* to do with you.",
      "created_utc": 1649379611.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i3tc3xr",
      "author": "baklavareason",
      "body": "That's shitty that you had to get that message. Block them because I feel like if you try to ask them to block you they'll throw a tantrum.",
      "created_utc": 1649366192.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i3u76td",
      "author": "Mystery-ink",
      "body": "Blocking their account it probably the best way to do it, as they will no longer see your content and you don’t have to deal with them, that way you’re protecting yourself and them.",
      "created_utc": 1649379405.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i3v9a9u",
      "author": "Prof_Cecily",
      "body": "Why do people think that writer was a woman? \n\nIt reads rather like a comment from a male fan of Eugenia Cooney.",
      "created_utc": 1649399119.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i3x03q0",
      "author": "DiligentBee1727",
      "body": "theyre a bitch block em and ignore the message prob just some overly sensitive tik tok hoe",
      "created_utc": 1649433964.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i3x7jzx",
      "author": "veronicatandy",
      "body": "eww tell them to mind their business and go away. wtf is this. you don't owe them an answer!",
      "created_utc": 1649436786.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i439ng1",
      "author": "trashh0l0gram",
      "body": "Thank you for your help guys. I blocked her in the end.",
      "created_utc": 1649543049.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i3trt8x",
      "author": "10Tinyacorns",
      "body": "This is a clear reflection of boundary issues on the part of whomever sent that comment...honestly that's just straight up weird 👀",
      "created_utc": 1649372714.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i3vyhzj",
      "author": "None",
      "body": "Be safe please! it may be someone posing as someone else and trying to get more personal information or pictures off you",
      "created_utc": 1649417819.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i3vyy9m",
      "author": "BittersweetAndi",
      "body": "As someone with anorexia, I can understand that seeing certain things may be triggering to some people. However, the way that this girl perceives your outfit posts isn't really your fault, especially since you're not trying to trigger anyone. Your body type isn't any of this girl's business.\n\nI would respond with something along the lines of: \"Hey, I don't have an eating disorder, but I'm sorry that my posts make you uncomfortable. You can block/unfollow me if my content bothers you. I appreciate your concern, but I'm not responsible for dealing with what you look at online.\"",
      "created_utc": 1649418081.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i3wuspn",
      "author": "None",
      "body": "Ppl are triggered by anything and everything and I already know there’s jealousy with that..I could smell it all over..",
      "created_utc": 1649431948.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i3wvimv",
      "author": "None",
      "body": "Imagine thinking just because someone’s skinny they have an ED 💀",
      "created_utc": 1649432222.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i3ys8mf",
      "author": "s0oah",
      "body": "yeah no this is just weird lol it’s not ur fault ur triggering people with your body",
      "created_utc": 1649459357.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i42y58u",
      "author": "None",
      "body": "👎🏻👎🏻",
      "created_utc": 1649538005.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i3schze",
      "author": "None",
      "body": "Their consumption of social media isn't your responsibility. You should block and ignore. I wouldn't even respond to her.\n\nEdit: You're right that her question is rude.",
      "created_utc": 1649352523.0,
      "score": 147,
      "context": [
        {
          "id": "i3s85wa",
          "author": "trashh0l0gram",
          "body": "On one hand I feel like it’s really rude to ask people if they have an ED, but also I don’t want to upset/trigger this girl.",
          "created_utc": 1649350803.0
        }
      ]
    },
    {
      "id": "i3tzhyj",
      "author": "peachaleach",
      "body": "It is really rude, and I'm sorry she messaged you like that. You've done absolutely nothing wrong. She is responsible for her triggers, not you. \n\nI honestly would not give it a second thought - don't respond and block her. If she's messaging random people on the internet like that, it sounds like she's actively seeking out content to trigger herself. Any response is likely going to be triggering.",
      "created_utc": 1649376010.0,
      "score": 26,
      "context": [
        {
          "id": "i3s85wa",
          "author": "trashh0l0gram",
          "body": "On one hand I feel like it’s really rude to ask people if they have an ED, but also I don’t want to upset/trigger this girl.",
          "created_utc": 1649350803.0
        }
      ]
    },
    {
      "id": "i3twge2",
      "author": "yellowposy2",
      "body": "You’re so kind! But like everyone else said just block her. Mental health makes people do weird shit but it’s not your responsibility- she’s the one who reached out to you in the first place.",
      "created_utc": 1649374688.0,
      "score": 13,
      "context": [
        {
          "id": "i3s85wa",
          "author": "trashh0l0gram",
          "body": "On one hand I feel like it’s really rude to ask people if they have an ED, but also I don’t want to upset/trigger this girl.",
          "created_utc": 1649350803.0
        }
      ]
    },
    {
      "id": "i3u196k",
      "author": "KellyWild",
      "body": "I’m sorry you had to go through that. ❤️",
      "created_utc": 1649376775.0,
      "score": 5,
      "context": [
        {
          "id": "i3sd4pv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1649352766.0
        }
      ]
    },
    {
      "id": "i3v8vwk",
      "author": "Prof_Cecily",
      "body": ">...its one of the reasons I no longer post any pictures of myself online. People think that just because they want to know your personal information they're somehow entitled to it.\n\nThis!",
      "created_utc": 1649398832.0,
      "score": 3,
      "context": [
        {
          "id": "i3sd4pv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1649352766.0
        }
      ]
    },
    {
      "id": "i3t8hyd",
      "author": "Lopsided-Shallot-124",
      "body": "Great response!",
      "created_utc": 1649364721.0,
      "score": 2,
      "context": [
        {
          "id": "i3smnmb",
          "author": "Various-List",
          "body": "I wouldn’t give any personal info about yourself whether you have an ED or not. Just recommend that she keep herself safe and hide your content if it’s triggering for her because that isn’t your intention.",
          "created_utc": 1649356392.0
        }
      ]
    }
  ]
}