{
  "id": "uhmgy6",
  "subreddit": "AnorexiaNervosa",
  "author": "Affectionate-Lie1513",
  "created_utc": 1651602331.0,
  "title": "What Anorexia stereotype do you hate the most? (TW?)",
  "selftext": "Personally, I hate the stereotype that Anorexics only eat healthy foods. That is not true. Sometimes I will only be eating pop tarts or little debbie treats. And the second one I hate, is that it only affects white self-conscious girls. Not true either. At first I just wanted control over my life, but eventually I started caring more about my weight and calories.\n\nShare a stereotype you hate a lot.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/uhmgy6/what_anorexia_stereotype_do_you_hate_the_most_tw/",
  "score": 193,
  "num_comments": 100,
  "comments": [
    {
      "id": "ih2tf7n",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1658425135.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i76yjpy",
      "author": "brewstertm",
      "body": "That anorexics hate food! I LOVE food, just as long as it fits in the calorie deficit lol",
      "created_utc": 1651603192.0,
      "score": 156,
      "context": []
    },
    {
      "id": "i76zm15",
      "author": "Navy-H",
      "body": "That we’re all insecure teenage girls who want to look pretty",
      "created_utc": 1651603668.0,
      "score": 124,
      "context": []
    },
    {
      "id": "i7718uk",
      "author": "Trip_the_light3020",
      "body": "That media and Instagram and societal image pressures are the main reason they start \"dieting\".",
      "created_utc": 1651604365.0,
      "score": 98,
      "context": []
    },
    {
      "id": "i770pkx",
      "author": "Coffeegreysky12",
      "body": "the thing about anorexics only eating healthy food is a popular stereotype. anorexic people don't just eat health food all the time. they can love sugar. When I was severely malnourished,  I was eating sugar and candy and carbs, just not a lot of it. I hate the stereotype that people think anorexic people hate food. it's not true. anorexic people like food, but they have a hard time eating enough of it. If you deny yourself food, you start to become obsessed with it. you will constantly think about when your next meal is, what you will eat. if you starve yourself, it ironically makes you more obsessed with getting whatever foods you can eat. and at the same time, you are afraid of it. anorexia is miserable. it's so serious and I think people who think it is some kind of diet or that it involves willpower are ignorant. anorexia is torture, for the person with it, and the people who love the person",
      "created_utc": 1651604138.0,
      "score": 71,
      "context": []
    },
    {
      "id": "i774u51",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1651605886.0,
      "score": 71,
      "context": []
    },
    {
      "id": "i7797ho",
      "author": "avantgardeanarchist",
      "body": "That those with anorexia don't eat. Like it is in part restriction based whether by time and/or calories. Its frustrating because despite an immense calorie deficit whenever I eat around people who know of my condition, its like \"I am so glad you are better and eating\". It puts too much focus on my actions and what I consume to the extent I am afraid of eating around people. Like please stfu, this is the only time  I am eating today and it is within my allowed intake",
      "created_utc": 1651607678.0,
      "score": 52,
      "context": []
    },
    {
      "id": "i770n4w",
      "author": "nbh679",
      "body": "That we all want to be bony. I fear body fat but I want to be pure muscle. I am way more triggered by Olympic runners than anyone in a hospital gown with a feeding tube. Unfortunately the body dysmorphia leads me to look more like the latter 😂",
      "created_utc": 1651604107.0,
      "score": 44,
      "context": []
    },
    {
      "id": "i776b1x",
      "author": "puppyface21",
      "body": "I hate that people think it’s caused by the media. Yeah, it may trigger people to diet, but that’s very different from anorexia. I didn’t ruin my life because I wanted to look like a celebrity. And regular dieting is very different from anorexia.",
      "created_utc": 1651606503.0,
      "score": 42,
      "context": []
    },
    {
      "id": "i77din2",
      "author": "Netvision9",
      "body": "We are perfectionists. No I'm a serial half asser",
      "created_utc": 1651609466.0,
      "score": 42,
      "context": []
    },
    {
      "id": "i773z0h",
      "author": "None",
      "body": "every single fucking stereotype and that u have to be dealthy thin to be taken seriously oh and when people act like its a joke like its some kind of diet no its a mental illness its debilitating it puts a weight on lives on my life it's literally a real thing just eating a piece of food never will help its a mental thing i feel like i need to be small to be happy i dont wanna look like a model i like the feeling of being clean inside oh and i absolutely love food but i cant fucking eat without crying this is literally what people who are on the outside will never understand but will always make assumptions about. rant over sorry im tipsy and hangry :p",
      "created_utc": 1651605521.0,
      "score": 32,
      "context": []
    },
    {
      "id": "i77al3u",
      "author": "asher_4-20",
      "body": "that you have to be skin and bones and next to death. \n\nthat they hate food, it’s not true",
      "created_utc": 1651608251.0,
      "score": 28,
      "context": []
    },
    {
      "id": "i77on8m",
      "author": "MelanieLouise42",
      "body": "That Ana is a young person's condition. My youth was so long ago, I can't remember it (55F)",
      "created_utc": 1651614047.0,
      "score": 26,
      "context": []
    },
    {
      "id": "i76yu96",
      "author": "ConfidentStrength999",
      "body": "I hate the stereotype that a lot of treatment providers stated as if it was fact over and over: that people with anorexia want to be ~special~.\n\nMeanwhile I just wanted so badly to fit in with people but lots of therapists seemed to think that all anorexics have a desire to be different/special.",
      "created_utc": 1651603312.0,
      "score": 47,
      "context": []
    },
    {
      "id": "i776pyk",
      "author": "None",
      "body": "That we’re all young girls who just want to be skinny. I’m not a girl, and that wasn’t even the trigger. My gender dysphoria was.\n\nAlso, I love food!! It’s not about hating food!",
      "created_utc": 1651606676.0,
      "score": 22,
      "context": []
    },
    {
      "id": "i76zvhx",
      "author": "sorcerers_apprentice",
      "body": "That we’re vain. Apart from my weight, I could not give less of a shit about how I look. And I don’t think being severely underweight looks “good”…being way too thin is something I try to hide, not show off.",
      "created_utc": 1651603778.0,
      "score": 42,
      "context": []
    },
    {
      "id": "i77kybh",
      "author": "Coffeegreysky12",
      "body": "Another stereotype I hate is that people think all anorexic people think they are fat or have a fear of being fat. no. lots of people with anorexia are aware they are thin. they are just obsessed with being thinner or underweight. for these people, it has nothing to do with a distorted body image or a fear of being fat. it's more a control issue or simply being obsessed with being thin. also, being malnourished can make you not think as clearly, so even though other people tell you that your weight is too low, it is hard for you to understand the real danger. because of the brain changes caused by being underweight/malnourished",
      "created_utc": 1651612478.0,
      "score": 22,
      "context": []
    },
    {
      "id": "i788ze9",
      "author": "tinseltesseract",
      "body": "That we all have such bad dysmorphia that we “see a fat person when we look in the mirror”\n\nI know exactly what I look like, I can see how thin I am and I don’t actually actively dislike my physical appearance most of the time, but I do view it very analytically. I see my body as a very, very, dangerous and at this point life-ruining project that I can’t stop working on. The disordered thought that crosses my mind when I look in the mirror is “I could go further. I could take this further than I have. I could hit an even lower weight, there’s nothing stopping me. I’m good at this and I’m winning, so why not?”",
      "created_utc": 1651623278.0,
      "score": 20,
      "context": []
    },
    {
      "id": "i770jkt",
      "author": "Dangerous_Owl_1858",
      "body": "that we care about how we look. it's not for societal standards lol. my brain is broken, I don't do this shit to \"look good\"",
      "created_utc": 1651604065.0,
      "score": 34,
      "context": []
    },
    {
      "id": "i77u0dx",
      "author": "crystaldmb41",
      "body": "That all anorexics are teenagers or in college. I am 43 and have been in this bullshit for almost three decades.",
      "created_utc": 1651616373.0,
      "score": 17,
      "context": []
    },
    {
      "id": "i779i3t",
      "author": "None",
      "body": "That \"anorexic\" is a certain Weight, a measurement  , not a mentally destroying disorder .\n\nAnd not everyone who has a low weight,  is automatically anorexic.",
      "created_utc": 1651607799.0,
      "score": 34,
      "context": []
    },
    {
      "id": "i77f1wz",
      "author": "TheDuckWhoStealsToes",
      "body": "I hate the assumption that it’s all girls. I really hate being seen as feminine for my mental problems - not toxic masculinity, gender dysphoria",
      "created_utc": 1651610088.0,
      "score": 13,
      "context": []
    },
    {
      "id": "i786l5n",
      "author": "vanillyl",
      "body": "The fucking weight criteria.\n\nMy psych gets particularly ragey on this point; anorexia is a serious, devastating psychological disorder. It is the *only* mental illness in which the diagnostic criteria is rooted in physical measures.\n\nI’ve deeply struggled with anorexia for 21 years now, but only met the weight criteria for maybe 5 or 6 of those years. I most certainly still suffered from anorexia for the other 15.\n\nI used to have a severely alcoholic friend with bulimia, and the differences between us was one of the most revealing things to me about my own disorder. She was skinnier than me; when we were both side by side most people would have picked her as the anorexic and me as the bulimic, as we were both underweight but I weighed slightly more, and of course according to the great and wonderful DSM bulimics are more likely to have a low BMI but not be severely underweight.\n\nThe differences in our own individual psychology where it came to each of our disorders were mind blowing. She didn’t really obsess about her body at all. She didn’t look at thinspo, she had much better self esteem, and she didn’t really have body dysmorphia - she’d always point out how extreme mine was. She didn’t hate her body. And she had absolutely no issue with or fear of eating, she wasn’t uncomfortable around food at all. \n\nIt was actually almost clearest by looking at our fridges/pantries. We both lived alone. My fridge, freezer and pantry were overflowing with food; I’m always buying food, promising myself I’ll eat it, and then just not be able to bring myself to. I throw out almost as much food as I buy.\n\nHers were completely empty. There was never any food at her house; like her fridge literally had 3 condiments and bottled water in it. As soon as food entered the threshold, she’d consume it uncontrollably until it was all gone, often throwing up multiple times a night.\n\nFrom an outsiders perspective again, most would assume the skinnier girl with only mustard in the fridge was the anorexic, and the one with food overflowing from every cupboard was the bulimic. But nope, exact opposite. I surround myself with food and gain a perverse sense of pleasure and control from not eating it even though it’s right there. Her measure of control and pleasure was eating whatever she wanted, whenever she felt like it, and immediately purging it.",
      "created_utc": 1651622083.0,
      "score": 13,
      "context": []
    },
    {
      "id": "i78cdmc",
      "author": "None",
      "body": "That anorexic people don’t feel hunger and just never eat unless forced to.",
      "created_utc": 1651624827.0,
      "score": 11,
      "context": []
    },
    {
      "id": "i78j3pl",
      "author": "None",
      "body": "\"Well, you're eating, so that must mean the anorexia is gone!\"\n\nNope. Not even close. Literally the only reason I'm eating right now is because I'm breastfeeding my son. My milk supply will stop if I don't eat enough. My instincts to feed my child, override my eating disorder.\n\nI assure you, I will be back on my bullshit once my son has been weaned from the breastmilk\n\nEdit: spelling",
      "created_utc": 1651627831.0,
      "score": 11,
      "context": []
    },
    {
      "id": "i76wwe1",
      "author": "Ok_Sheepherder_5457",
      "body": "I hate the stereotype that all anorexics must be (extremely) thin. Nope, there’s something called „a-typical anorexia“ and even that isn’t always the case, „normal“ anorexics can be normal weight too.",
      "created_utc": 1651602501.0,
      "score": 20,
      "context": []
    },
    {
      "id": "i77zmrg",
      "author": "lonely-blue-sheep",
      "body": "That it’s only for appearance. I struggle with that, but I started because it was another coping skill to distract me from life and stuff. Used to play fruit ninja on my body but now I do this.",
      "created_utc": 1651618864.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i791ckq",
      "author": "MentalHealthLeftMe",
      "body": "That we start shaking just because there's \"real\" food in front of us. (Have you guys seen those TikTok videos? It makes me feel like I'm super healthy.)",
      "created_utc": 1651636330.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i785jnl",
      "author": "vxmpiria",
      "body": "that we’re teenaged girls. i am one but that doesn’t mean everyone else is a teenager or a girl",
      "created_utc": 1651621568.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i77ezdn",
      "author": "coffee-bat",
      "body": "that we're all thin. the overwhelming majority of anorexics isn't underweight. (which is also why i sorta have a problem with \"atypical anorexia\". it's not atypical at all. i've had my therapist tell me that 'there's nothing to worry about if you're in the healthy bmi range' after i told her about my eating disorder)\n\nthe healthy food thing. i'll eat things i enjoy, just rarely/in small quantities/throw up after. i'm too tired to give half a shit about nutritional value, i just want whatever i eat to be quick, easy and taste good (since i don't get much, i'd rather enjoy the small bit). \n\nthat we're only the product of the fashion/diet industry and starve ourselves for purely aesthetic/societal reasons. sure, that often is a factor, but you need to be much more mentally ill than just \"insecure from media\" to do this to yourself. \n\nthat we're stupid and don't know the risks. of course we fucking do. and most often, we don't care. we're destroying ourselves on purpose.\n\nthat we're fatphobic/unaccepting of other body types. sure, there are always bad eggs, but the majority doesn't judge others for their bodies. the fear of being fat applies only to oneself.",
      "created_utc": 1651610060.0,
      "score": 12,
      "context": []
    },
    {
      "id": "i77kwxg",
      "author": "None",
      "body": "that my reason for developing an ED is purely about my appearance.",
      "created_utc": 1651612462.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i7bljm6",
      "author": "TooManyTongues",
      "body": "That in order to be anorexic you have to fully fast. Like not eat anything for days. \nWhen I have told people that I’ve struggled from an eating disorder since I was 11 and their response is “how long have you ever gone without eating”\nAnd my response is like, “bitch, I eat everyday”\nAnd their like “I’ve gone longer than that. Maybe you don’t have a disorder”\nThen I have to explain calorie science to them.",
      "created_utc": 1651687864.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i784wot",
      "author": "kyxpvz",
      "body": "that we all got influenced from tumblr and all because mine started when i started going to the gym and learning about nutrition",
      "created_utc": 1651621257.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i79biak",
      "author": "Reversephoenix77",
      "body": "I hate the one where they insist we all look in the mirror and think that we are overweight. For me that’s never been true anyways. I see the bones and know I look unhealthy but for me it’s the obsession with maintaining this and fear of gaining anything at all. I don’t care for the belief that we all have body dismorphia. It’s like yeah I’m sure most of us do to some degree but to say none of us realize what we look like is silly.",
      "created_utc": 1651642323.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i7a7n7u",
      "author": "brixtonbaby",
      "body": "that it’s caused by diet culture. it’s not. it can contribute but unless you’re predisposed to an ED in some way like your personality type, trauma, other mental illness etc you’re not going to develop anorexia from seeing skinny influencers",
      "created_utc": 1651666863.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i78fwaq",
      "author": "mceggy_",
      "body": "you OP basically said it all LOL. thank GOD I’m not the only one who likes unhealthy food too, and isn’t white. It’s not just white people that can develop eating disorders even though I thought many people already knew that.",
      "created_utc": 1651626402.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i78tcv8",
      "author": "Lily_Nut",
      "body": "That I do it for the male view",
      "created_utc": 1651632387.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i78td2f",
      "author": "Loose-Swimming6210",
      "body": "that we’re “doing this to ourselves” and we’re “being stupid for not eating” which implies we can just start eating at any time. We are having an intense psychological battle, it’s not so easy. We have agency but we’re also in a crazy fucked up war with ourselves. And also, our internal anorexia logic does not respond to things like “not eating is stupid and bad!” lol obviously",
      "created_utc": 1651632390.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i79fgwq",
      "author": "ThatIntention1",
      "body": "That we don’t eat at all",
      "created_utc": 1651645134.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i79olh2",
      "author": "None",
      "body": "that we all count calories! idk if it’s just me but quantity of food that i’m eating matters more than the calories in it? people with anorexia just don’t eat enough i personally don’t count calories but that doesn’t mean i’m not “anorexic enough” (something i’ve felt before)",
      "created_utc": 1651652650.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i7aqaty",
      "author": "m4imaimai",
      "body": "That we want to look ‘good’ for others, this couldn’t be more wrong, it probably started there sometime but by the time you’re more gone into the illness is just about yourself, I literally developed it on pandemic no one saw me but my family and i was the one being so rough on me",
      "created_utc": 1651675432.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i78i8k2",
      "author": "CuddlyKitty",
      "body": "That we all look extremely emaciated and just don't eat anything. I'm officially diagnosed, I've been underweight but right now I'm a few pounds from underweight. I got my diagnosis while at a \"healthy\" BMI. I've been told \"Well, you don't LOOK anorexic... \" Also, no person frickin photosynthesizes. Everyone eats. \"BuT I SaW yOu AtE tOdAy!\" Listen, if I could get all my energy to not die just from green tea, my vape, and the sun, I would, but I can't, so yeah, I eat 🙄",
      "created_utc": 1651627440.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i78vto1",
      "author": "None",
      "body": "That it’s ONLY an issue women have. Anyone can struggle with this disease.",
      "created_utc": 1651633564.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i78wchi",
      "author": "Dog_N_Pop",
      "body": "That it doesn't happen to guys.",
      "created_utc": 1651633821.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i7915qx",
      "author": "MsKidgie",
      "body": "They we are all under 22. Pushing it saying 25.",
      "created_utc": 1651636233.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i79m8jw",
      "author": "Butterflycrownedrose",
      "body": "That we think we are fat. I knew I was skinny, I just didn’t want to gain",
      "created_utc": 1651650593.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i7ajcrk",
      "author": "Coconutpeachwater",
      "body": "Common one but definitely that it’s a “women’s disorder.” Particularly terrible because a large about of transmasculine people have An. Like I just didn’t want to go through female puberty dude-",
      "created_utc": 1651672514.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i7b03b4",
      "author": "HeadRecord6723",
      "body": "That it’s about “control”. For me it was because I was super depressed. I lost my appetite (I was overweight at the time) and the resultant weight loss was something I was happy about at the time. This was before the Internet was big (back in the late 1990s) so it wasn’t social media to blame either.\nYes, it spiraled, but I’m not a super perfectionist person either- so that stereotype didn’t apply either.",
      "created_utc": 1651679370.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i7fgby9",
      "author": "americanowithoatmilk",
      "body": "I hate that people think anorexics are all extremely thin. that is literally only 6% of the people with EDs.",
      "created_utc": 1651760576.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i98x8re",
      "author": "Tulipsandlevander",
      "body": "The stereotype that anorexics are all deadly skinny and close to death. That’s only last stages of anorexia. Many of us are just normally thin, and may not even cause concern to strangers.\n\nThat anorexics eat very little portions, eat slowly, play with their food to avoid it. I can literally eat 1kg of strawberries in one sitting. I often hit 100g protein a day. And I am still either losing or maintaining while underweight. It’s calories game, my portions are often very big. \n\nThat anorexics only restrict. There are anorexics who eat big amounts and then vomit them out. People do not consider there is purge subtype. Others exercise like crazy to burn their consumed food, or fast for some days. Not everyone restricts daily. Not everyone who purge is bulimic, the person can also be anorexic. \n\nThat anorexics problem is just mere food and wanting to look skinny to fit into some standards. The current beauty standard is slim thick women! Tiny waist, big butt and big breasts. To confirm the standard I should be doing squats with 30kg instead of starving. \n\nIt has very little to do with food, it’s mental issue.",
      "created_utc": 1652993209.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i78n3k8",
      "author": "Immediate-Vehicle-67",
      "body": "The stereotype that every anorexic is underweight and/or skinny bc you starve/over exercise/purge . Like you can do all those thing and plateau or even gain. There’s stereotypes portraying anorexia and then there’s the reality of it , which is that every person with an Ed  has a very different experience from another person who is also anorexic. Second stereotype is that every anorexic cries over every meal. Sometimes Eating breakfast is super hard  and  other times it’s not, but  everyone is different. Final stereotype is prolly the healthy eating one, If I tell you I’m struggling with an ed and it’s anorexia, don’t ask me to tell you my safe foods/ diet as if it will explain and validate my Ed. No I don’t eat salads everyday but that doesn’t make me any less hyper focused on the idea that I’m fat and that being empty helps me think better.  Btw I love chai, matcha, oranges and whipped cream atm ;) your valid",
      "created_utc": 1651629575.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i79fcuk",
      "author": "Cheerndance",
      "body": "That you can only be emaciated to be anorexic. Any weight and all assume you are bulimic. \n\nIt's the mindset difference that differentiates the two.",
      "created_utc": 1651645050.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i79k6gm",
      "author": "Electronic-Nose-4828",
      "body": "That its all about loosing weight and achieving that weight goal. It never was like that for me. I just wanted control over something and the control of loosing weight was to addicting. Turned into an addiction",
      "created_utc": 1651648838.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i79t684",
      "author": "garibinsaan",
      "body": "The fact that you have to be super skinny to be anorexic, the fact that people don't understand it's mostly a brain disorder, our brains are just fucking with us in the worst possible way",
      "created_utc": 1651656751.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i7a3n37",
      "author": "helloug",
      "body": "(Maybe tw) That anorexic people are all girls that see them selves as fat",
      "created_utc": 1651664552.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i7acr52",
      "author": "daniel13lopes",
      "body": "Only girls have",
      "created_utc": 1651669470.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i7becir",
      "author": "Current_Kangaroo_936",
      "body": "Sometimes i only eat crackers, i hate that everyone has this view of what we look like, and im like nope we don’t all look like skeletons we don’t all look like barbie some of us look like moms and aunties and uncles and we eat we just have habits that most dont see, or do. Idk",
      "created_utc": 1651685073.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i7i4tmg",
      "author": "Yup_555",
      "body": "That we are all extremely skinny",
      "created_utc": 1651802118.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i838yyj",
      "author": "--NotaTiger--",
      "body": "Tha we're all skinny. Or teenage girls changing themselves because they wanna be pretty for a boy. Or that we just like don't eat, I'm not skinny. Im a teen girl sure, but also a lesbian and I literally eat because like, I have too. \nStop with the stupid anorexic stereotypes please 💙💙💙",
      "created_utc": 1652211237.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i777yue",
      "author": "hoe00",
      "body": "That anorexia is about wanting to be skinny.",
      "created_utc": 1651607173.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i76wht3",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1651602331.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i76zesa",
      "author": "Coffeegreysky12",
      "body": "the thing about anorexics only eating healthy food is so true. anorexic people don't just eat health food all the time. they can love sugar. literally when I was at my lowest weight and about to die of malnutrition, I was eating sugar and candy and carbs, just not a lot of it. I hate the stereotype that people think anorexic people hate food. it's not true. anorexic people like food, but they have a hard time eating enough of it. If you deny yourself food, you start to become obsessed with it. you will constantly think about when your next meal is, what you will eat. if you starve yourself, it ironically makes you more obsessed with getting whatever foods you can eat. and at the same time, you are afraid of it. anorexia is miserable. it's so serious and I think people who think it is some kind of diet or that it involves willpower are ignorant. anorexia is torture, for the person with it, and the people who love the person",
      "created_utc": 1651603576.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i8pchb0",
      "author": "mango_alt",
      "body": "That only girls have body image problems/eating problems. It makes me dysphoric as a trans guy when even medical journals only discuss female patients or when recovery accounts focus on the female body. Obviously women deserve to celebrate their body but I know I don’t want to recover for big boobs or becoming a mother",
      "created_utc": 1652627665.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i8tub2z",
      "author": "rec2200",
      "body": "That we all have supportive family/friends to help us recover after discharge. Uh nope…got discharged right back into the environment that fosters it (suicide widow, single parent with NO family or support system). The only people that check in are my therapist/treatment team, but if I lose my insurance then that’s that. \nPlus—there are Plenty of facilities that will take my case…nope only 2 places in the entire United States will take my insurance, the rest is self pay",
      "created_utc": 1652714266.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iam5anf",
      "author": "buckyboo101",
      "body": "I hate that people don’t take you seriously if you aren’t deathly skinny. That only makes people with this illness feel like they have to keep going to be valid. \nAnd also that it just affects females.Many males have this illness as well",
      "created_utc": 1653962412.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmyg741",
      "author": "None",
      "body": "100",
      "created_utc": 1685944257.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i775w4m",
      "author": "nbh679",
      "body": "This too!!! My trigger was OCD. If it was triggered by IG I’d be way more concerned I don’t have an ass lol",
      "created_utc": 1651606331.0,
      "score": 52,
      "context": [
        {
          "id": "i7718uk",
          "author": "Trip_the_light3020",
          "body": "That media and Instagram and societal image pressures are the main reason they start \"dieting\".",
          "created_utc": 1651604365.0
        }
      ]
    },
    {
      "id": "i79y4vb",
      "author": "MobileMaleficent1009",
      "body": "SaMe in fact at LW im eating a cookie and chips lol",
      "created_utc": 1651660861.0,
      "score": 8,
      "context": [
        {
          "id": "i770pkx",
          "author": "Coffeegreysky12",
          "body": "the thing about anorexics only eating healthy food is a popular stereotype. anorexic people don't just eat health food all the time. they can love sugar. When I was severely malnourished,  I was eating sugar and candy and carbs, just not a lot of it. I hate the stereotype that people think anorexic people hate food. it's not true. anorexic people like food, but they have a hard time eating enough of it. If you deny yourself food, you start to become obsessed with it. you will constantly think about when your next meal is, what you will eat. if you starve yourself, it ironically makes you more obsessed with getting whatever foods you can eat. and at the same time, you are afraid of it. anorexia is miserable. it's so serious and I think people who think it is some kind of diet or that it involves willpower are ignorant. anorexia is torture, for the person with it, and the people who love the person",
          "created_utc": 1651604138.0
        }
      ]
    },
    {
      "id": "i8wzbyq",
      "author": "None",
      "body": "THIS.\n\n \"If you deny yourself food, you start to become obsessed with it. you will constantly think about when your next meal is, what you will eat. if you starve yourself, it ironically makes you more obsessed with getting whatever foods you can eat\"",
      "created_utc": 1652767405.0,
      "score": 5,
      "context": [
        {
          "id": "i770pkx",
          "author": "Coffeegreysky12",
          "body": "the thing about anorexics only eating healthy food is a popular stereotype. anorexic people don't just eat health food all the time. they can love sugar. When I was severely malnourished,  I was eating sugar and candy and carbs, just not a lot of it. I hate the stereotype that people think anorexic people hate food. it's not true. anorexic people like food, but they have a hard time eating enough of it. If you deny yourself food, you start to become obsessed with it. you will constantly think about when your next meal is, what you will eat. if you starve yourself, it ironically makes you more obsessed with getting whatever foods you can eat. and at the same time, you are afraid of it. anorexia is miserable. it's so serious and I think people who think it is some kind of diet or that it involves willpower are ignorant. anorexia is torture, for the person with it, and the people who love the person",
          "created_utc": 1651604138.0
        }
      ]
    },
    {
      "id": "ietdmgh",
      "author": "minitort",
      "body": "YES. “no food is as harmful as starving yourself”",
      "created_utc": 1656941271.0,
      "score": 2,
      "context": [
        {
          "id": "i770pkx",
          "author": "Coffeegreysky12",
          "body": "the thing about anorexics only eating healthy food is a popular stereotype. anorexic people don't just eat health food all the time. they can love sugar. When I was severely malnourished,  I was eating sugar and candy and carbs, just not a lot of it. I hate the stereotype that people think anorexic people hate food. it's not true. anorexic people like food, but they have a hard time eating enough of it. If you deny yourself food, you start to become obsessed with it. you will constantly think about when your next meal is, what you will eat. if you starve yourself, it ironically makes you more obsessed with getting whatever foods you can eat. and at the same time, you are afraid of it. anorexia is miserable. it's so serious and I think people who think it is some kind of diet or that it involves willpower are ignorant. anorexia is torture, for the person with it, and the people who love the person",
          "created_utc": 1651604138.0
        }
      ]
    },
    {
      "id": "i776yaj",
      "author": "ConfidentStrength999",
      "body": "Hi, I had to remove this for rule 10 but if you’d like the edit the number out, let me know and I’ll go back and approve the comment.",
      "created_utc": 1651606772.0,
      "score": 8,
      "context": [
        {
          "id": "i774u51",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651605886.0
        }
      ]
    },
    {
      "id": "i785si3",
      "author": "AbbreviationsReal755",
      "body": "Wow.. This One Hit A Little Too Close To Home 🏡 lol!",
      "created_utc": 1651621691.0,
      "score": 14,
      "context": [
        {
          "id": "i7797ho",
          "author": "avantgardeanarchist",
          "body": "That those with anorexia don't eat. Like it is in part restriction based whether by time and/or calories. Its frustrating because despite an immense calorie deficit whenever I eat around people who know of my condition, its like \"I am so glad you are better and eating\". It puts too much focus on my actions and what I consume to the extent I am afraid of eating around people. Like please stfu, this is the only time  I am eating today and it is within my allowed intake",
          "created_utc": 1651607678.0
        }
      ]
    },
    {
      "id": "i7a6nsp",
      "author": "Esbesbebsnth_Ennergu",
      "body": "Exactly, Its the expectation to eat/ making it a big deal when i eat that makes me clam up and need to stop 😭",
      "created_utc": 1651666315.0,
      "score": 8,
      "context": [
        {
          "id": "i7797ho",
          "author": "avantgardeanarchist",
          "body": "That those with anorexia don't eat. Like it is in part restriction based whether by time and/or calories. Its frustrating because despite an immense calorie deficit whenever I eat around people who know of my condition, its like \"I am so glad you are better and eating\". It puts too much focus on my actions and what I consume to the extent I am afraid of eating around people. Like please stfu, this is the only time  I am eating today and it is within my allowed intake",
          "created_utc": 1651607678.0
        }
      ]
    },
    {
      "id": "i78kgx0",
      "author": "strollinthrusunsets",
      "body": "THIS!!! i'm way more triggered by fitness influencers and athletes than i am by supermodels",
      "created_utc": 1651628433.0,
      "score": 11,
      "context": [
        {
          "id": "i770n4w",
          "author": "nbh679",
          "body": "That we all want to be bony. I fear body fat but I want to be pure muscle. I am way more triggered by Olympic runners than anyone in a hospital gown with a feeding tube. Unfortunately the body dysmorphia leads me to look more like the latter 😂",
          "created_utc": 1651604107.0
        }
      ]
    },
    {
      "id": "i79eqpc",
      "author": "autumnfire1414",
      "body": "This! So much. People think we all just want to look like runway models.",
      "created_utc": 1651644591.0,
      "score": 8,
      "context": [
        {
          "id": "i776b1x",
          "author": "puppyface21",
          "body": "I hate that people think it’s caused by the media. Yeah, it may trigger people to diet, but that’s very different from anorexia. I didn’t ruin my life because I wanted to look like a celebrity. And regular dieting is very different from anorexia.",
          "created_utc": 1651606503.0
        }
      ]
    },
    {
      "id": "i78gqyz",
      "author": "mceggy_",
      "body": "exactly!!! Thank you for commenting this!!!",
      "created_utc": 1651626783.0,
      "score": 4,
      "context": [
        {
          "id": "i77din2",
          "author": "Netvision9",
          "body": "We are perfectionists. No I'm a serial half asser",
          "created_utc": 1651609466.0
        }
      ]
    },
    {
      "id": "i78gmgo",
      "author": "mceggy_",
      "body": "This is relatable let me tell you.",
      "created_utc": 1651626727.0,
      "score": 10,
      "context": [
        {
          "id": "i773z0h",
          "author": "None",
          "body": "every single fucking stereotype and that u have to be dealthy thin to be taken seriously oh and when people act like its a joke like its some kind of diet no its a mental illness its debilitating it puts a weight on lives on my life it's literally a real thing just eating a piece of food never will help its a mental thing i feel like i need to be small to be happy i dont wanna look like a model i like the feeling of being clean inside oh and i absolutely love food but i cant fucking eat without crying this is literally what people who are on the outside will never understand but will always make assumptions about. rant over sorry im tipsy and hangry :p",
          "created_utc": 1651605521.0
        }
      ]
    },
    {
      "id": "i789ml2",
      "author": "Anfie22",
      "body": "I LOVE food, I just can't bring myself to eat most foods. I would love nothing more than to eat a donut or a vanilla slice rn, but I just can't for no good reason and I resent with every fiber of my being that I've forbidden such a simple pleasure for myself.\n\nAnd yes, we don't have to look like a holodomor victim to be utterly consumed by this horrible condition. I sure as shit don't look anywhere near it.",
      "created_utc": 1651623579.0,
      "score": 10,
      "context": [
        {
          "id": "i77al3u",
          "author": "asher_4-20",
          "body": "that you have to be skin and bones and next to death. \n\nthat they hate food, it’s not true",
          "created_utc": 1651608251.0
        }
      ]
    },
    {
      "id": "i77qrhr",
      "author": "Prestigious-Bug-7641",
      "body": "Yh I'm 43 and even I didn't realise I could lose control of this in my later years.. until this full-blown relapse, every lapse I now know I had, over the years, I was thinking I just had a short cut cheat to \"get back in shape\".. thought I left this shit back in my teen years.. little did I know, till now, that this doesn't discriminate and that I could end up in a complete mess at bloody 43 years old.. it really is such a horrible place to be- Stereotyping just makes it SO much worse, I find..xx",
      "created_utc": 1651614948.0,
      "score": 13,
      "context": [
        {
          "id": "i77on8m",
          "author": "MelanieLouise42",
          "body": "That Ana is a young person's condition. My youth was so long ago, I can't remember it (55F)",
          "created_utc": 1651614047.0
        }
      ]
    },
    {
      "id": "i78krua",
      "author": "UrbanDurga",
      "body": "Yes, thank you. I’m 39, and my anorexia was at its worst while working as a charge nurse in my ICU during the worst of the pandemic. I had no food issues when I was 16. But they really developed as an adult, and aggressively declared themselves in my thirties.",
      "created_utc": 1651628569.0,
      "score": 11,
      "context": [
        {
          "id": "i77on8m",
          "author": "MelanieLouise42",
          "body": "That Ana is a young person's condition. My youth was so long ago, I can't remember it (55F)",
          "created_utc": 1651614047.0
        }
      ]
    },
    {
      "id": "i79195t",
      "author": "MsKidgie",
      "body": "Thank you, and I’m sorry. I’m 52, almost 53. Hugs.",
      "created_utc": 1651636281.0,
      "score": 6,
      "context": [
        {
          "id": "i77on8m",
          "author": "MelanieLouise42",
          "body": "That Ana is a young person's condition. My youth was so long ago, I can't remember it (55F)",
          "created_utc": 1651614047.0
        }
      ]
    },
    {
      "id": "i7d6i5b",
      "author": "tinseltesseract",
      "body": "I thought of another one:\n\nThat any anorexic who’s vegan or vegetarian is doing it for purely restrictive reasons. That is not the case for me. my vegetarianism, now veganism, is for ethical and environmental reasons. I was raised vegetarian as a young child and I went back to it as a teenager and have continued ever since. Not consuming animal products is a value I was taught at a very young age and that I’ve held onto for years. One major thing that scares me about treatment is the high likelihood I that would not be allowed to be vegan or vegetarian there because it would be seen as “restrictive” and that my morals wouldn’t be respected.",
      "created_utc": 1651711173.0,
      "score": 3,
      "context": [
        {
          "id": "i788ze9",
          "author": "tinseltesseract",
          "body": "That we all have such bad dysmorphia that we “see a fat person when we look in the mirror”\n\nI know exactly what I look like, I can see how thin I am and I don’t actually actively dislike my physical appearance most of the time, but I do view it very analytically. I see my body as a very, very, dangerous and at this point life-ruining project that I can’t stop working on. The disordered thought that crosses my mind when I look in the mirror is “I could go further. I could take this further than I have. I could hit an even lower weight, there’s nothing stopping me. I’m good at this and I’m winning, so why not?”",
          "created_utc": 1651623278.0
        }
      ]
    },
    {
      "id": "i78hgdk",
      "author": "mceggy_",
      "body": "Exactly bruh. This is why so many male cases get swept under the rug. It’s disgusting and disheartening how less validated men are when having an eating disorder.",
      "created_utc": 1651627095.0,
      "score": 4,
      "context": [
        {
          "id": "i77f1wz",
          "author": "TheDuckWhoStealsToes",
          "body": "I hate the assumption that it’s all girls. I really hate being seen as feminine for my mental problems - not toxic masculinity, gender dysphoria",
          "created_utc": 1651610088.0
        }
      ]
    },
    {
      "id": "i78i8i8",
      "author": "mceggy_",
      "body": "I’ve done “fruit ninja” too. I’m 20 days clean from it. Not much but it’s something. I would do anything to get my skin to look the way that it did before. It’s so embarrassing. Covering it up all the time at work becomes annoying. :/",
      "created_utc": 1651627440.0,
      "score": 5,
      "context": [
        {
          "id": "i77zmrg",
          "author": "lonely-blue-sheep",
          "body": "That it’s only for appearance. I struggle with that, but I started because it was another coping skill to distract me from life and stuff. Used to play fruit ninja on my body but now I do this.",
          "created_utc": 1651618864.0
        }
      ]
    },
    {
      "id": "i78id6b",
      "author": "mceggy_",
      "body": "Right",
      "created_utc": 1651627500.0,
      "score": 3,
      "context": [
        {
          "id": "i785jnl",
          "author": "vxmpiria",
          "body": "that we’re teenaged girls. i am one but that doesn’t mean everyone else is a teenager or a girl",
          "created_utc": 1651621568.0
        }
      ]
    },
    {
      "id": "i78aps0",
      "author": "Anfie22",
      "body": "Yup! One can be morbidly obese and have even more severe malnutrition than someone who is very underweight. For example if someone eats fries and fries only, they would have vitamin+mineral deficiencies up the wazoo and a blood test result would be akin to a screaming alarm.",
      "created_utc": 1651624075.0,
      "score": 6,
      "context": [
        {
          "id": "i77ezdn",
          "author": "coffee-bat",
          "body": "that we're all thin. the overwhelming majority of anorexics isn't underweight. (which is also why i sorta have a problem with \"atypical anorexia\". it's not atypical at all. i've had my therapist tell me that 'there's nothing to worry about if you're in the healthy bmi range' after i told her about my eating disorder)\n\nthe healthy food thing. i'll eat things i enjoy, just rarely/in small quantities/throw up after. i'm too tired to give half a shit about nutritional value, i just want whatever i eat to be quick, easy and taste good (since i don't get much, i'd rather enjoy the small bit). \n\nthat we're only the product of the fashion/diet industry and starve ourselves for purely aesthetic/societal reasons. sure, that often is a factor, but you need to be much more mentally ill than just \"insecure from media\" to do this to yourself. \n\nthat we're stupid and don't know the risks. of course we fucking do. and most often, we don't care. we're destroying ourselves on purpose.\n\nthat we're fatphobic/unaccepting of other body types. sure, there are always bad eggs, but the majority doesn't judge others for their bodies. the fear of being fat applies only to oneself.",
          "created_utc": 1651610060.0
        }
      ]
    },
    {
      "id": "i78bkd2",
      "author": "Anfie22",
      "body": "Personally it isn't at all, but rather trying to manage how I am perceived by others in terms of raising the baseline degree of respect and courtesy I'm offered by others, not as a stupid vanity aspiration, but as wanting to be treated as a human like everyone else. Basically I fell for the 'thin privilege' myth and learnt the hard way that it is merely a lie, a sociopolitical deception for malicious purposes - divide and conquer, and bringing the masses into obedience of thought and perception. It's a foul ploy which ruined my life.",
      "created_utc": 1651624465.0,
      "score": 3,
      "context": [
        {
          "id": "i77kwxg",
          "author": "None",
          "body": "that my reason for developing an ED is purely about my appearance.",
          "created_utc": 1651612462.0
        }
      ]
    },
    {
      "id": "i7awy08",
      "author": "Coffeegreysky12",
      "body": "Yes. this is so true. this was the same for me as well. I wish more people understood this. it was never about thinking I was fat. I was just terrified of gaining",
      "created_utc": 1651678070.0,
      "score": 3,
      "context": [
        {
          "id": "i79m8jw",
          "author": "Butterflycrownedrose",
          "body": "That we think we are fat. I knew I was skinny, I just didn’t want to gain",
          "created_utc": 1651650593.0
        }
      ]
    },
    {
      "id": "i7am8pi",
      "author": "Coffeegreysky12",
      "body": "me too. I eat cookies and chips as will!",
      "created_utc": 1651673755.0,
      "score": 5,
      "context": [
        {
          "id": "i770pkx",
          "author": "Coffeegreysky12",
          "body": "the thing about anorexics only eating healthy food is a popular stereotype. anorexic people don't just eat health food all the time. they can love sugar. When I was severely malnourished,  I was eating sugar and candy and carbs, just not a lot of it. I hate the stereotype that people think anorexic people hate food. it's not true. anorexic people like food, but they have a hard time eating enough of it. If you deny yourself food, you start to become obsessed with it. you will constantly think about when your next meal is, what you will eat. if you starve yourself, it ironically makes you more obsessed with getting whatever foods you can eat. and at the same time, you are afraid of it. anorexia is miserable. it's so serious and I think people who think it is some kind of diet or that it involves willpower are ignorant. anorexia is torture, for the person with it, and the people who love the person",
          "created_utc": 1651604138.0
        },
        {
          "id": "i79y4vb",
          "author": "MobileMaleficent1009",
          "body": "SaMe in fact at LW im eating a cookie and chips lol",
          "created_utc": 1651660861.0
        }
      ]
    },
    {
      "id": "i777and",
      "author": "sneepsnart",
      "body": "alr i think i fixed it",
      "created_utc": 1651606907.0,
      "score": 8,
      "context": [
        {
          "id": "i774u51",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651605886.0
        },
        {
          "id": "i776yaj",
          "author": "ConfidentStrength999",
          "body": "Hi, I had to remove this for rule 10 but if you’d like the edit the number out, let me know and I’ll go back and approve the comment.",
          "created_utc": 1651606772.0
        }
      ]
    },
    {
      "id": "i7811sp",
      "author": "None",
      "body": "I have been restricting since I was 11, but my worst relapse was when I was 30 to 33. I hate when people are like \"aren't you over this\" or \"your adult you know what starving yourself does\". Body dystopia is a life long struggle, I deal with this daily!",
      "created_utc": 1651619507.0,
      "score": 14,
      "context": [
        {
          "id": "i77on8m",
          "author": "MelanieLouise42",
          "body": "That Ana is a young person's condition. My youth was so long ago, I can't remember it (55F)",
          "created_utc": 1651614047.0
        },
        {
          "id": "i77qrhr",
          "author": "Prestigious-Bug-7641",
          "body": "Yh I'm 43 and even I didn't realise I could lose control of this in my later years.. until this full-blown relapse, every lapse I now know I had, over the years, I was thinking I just had a short cut cheat to \"get back in shape\".. thought I left this shit back in my teen years.. little did I know, till now, that this doesn't discriminate and that I could end up in a complete mess at bloody 43 years old.. it really is such a horrible place to be- Stereotyping just makes it SO much worse, I find..xx",
          "created_utc": 1651614948.0
        }
      ]
    },
    {
      "id": "i78mb2e",
      "author": "nbh679",
      "body": "I am in my 30s too. I looked at Recovery tiktok for about 5 minutes and realized it was not my demographic lol",
      "created_utc": 1651629224.0,
      "score": 6,
      "context": [
        {
          "id": "i77on8m",
          "author": "MelanieLouise42",
          "body": "That Ana is a young person's condition. My youth was so long ago, I can't remember it (55F)",
          "created_utc": 1651614047.0
        },
        {
          "id": "i78krua",
          "author": "UrbanDurga",
          "body": "Yes, thank you. I’m 39, and my anorexia was at its worst while working as a charge nurse in my ICU during the worst of the pandemic. I had no food issues when I was 16. But they really developed as an adult, and aggressively declared themselves in my thirties.",
          "created_utc": 1651628569.0
        }
      ]
    },
    {
      "id": "i78mn70",
      "author": "nbh679",
      "body": "I get that. As weird as this may sound, I'm a straight female and the earliest I can remember struggling with body image was when I realized I couldn't have abs like Usher. Looking feminine was never the goal",
      "created_utc": 1651629373.0,
      "score": 6,
      "context": [
        {
          "id": "i77f1wz",
          "author": "TheDuckWhoStealsToes",
          "body": "I hate the assumption that it’s all girls. I really hate being seen as feminine for my mental problems - not toxic masculinity, gender dysphoria",
          "created_utc": 1651610088.0
        },
        {
          "id": "i78hgdk",
          "author": "mceggy_",
          "body": "Exactly bruh. This is why so many male cases get swept under the rug. It’s disgusting and disheartening how less validated men are when having an eating disorder.",
          "created_utc": 1651627095.0
        }
      ]
    },
    {
      "id": "i78inq1",
      "author": "lonely-blue-sheep",
      "body": "Hey but that’s still good progress dude I’m proud of you. 20 days is still a long time to be clean for. You’re amazing for getting this far. I’m about a month and a half clean from self-fruit ninja. \n\nStay safe and strong\n\nTake care <3",
      "created_utc": 1651627629.0,
      "score": 6,
      "context": [
        {
          "id": "i77zmrg",
          "author": "lonely-blue-sheep",
          "body": "That it’s only for appearance. I struggle with that, but I started because it was another coping skill to distract me from life and stuff. Used to play fruit ninja on my body but now I do this.",
          "created_utc": 1651618864.0
        },
        {
          "id": "i78i8i8",
          "author": "mceggy_",
          "body": "I’ve done “fruit ninja” too. I’m 20 days clean from it. Not much but it’s something. I would do anything to get my skin to look the way that it did before. It’s so embarrassing. Covering it up all the time at work becomes annoying. :/",
          "created_utc": 1651627440.0
        }
      ]
    },
    {
      "id": "i7a8xt0",
      "author": "coffee-bat",
      "body": "yes, exactly! like, also, i'm pretty much circling back and forth around my starting weight (bmi ~23), but i'm malnourished as SHIT. anemia, every possible vitamin deficiency, low blood clotting + blood vessels spilling (spiderweb on legs), on top of thar gall and kidney stones. and i'm not thin in the slightest. and despite all this, i get told i'm \"not anorexic because i'm healthy\".",
      "created_utc": 1651667566.0,
      "score": 5,
      "context": [
        {
          "id": "i77ezdn",
          "author": "coffee-bat",
          "body": "that we're all thin. the overwhelming majority of anorexics isn't underweight. (which is also why i sorta have a problem with \"atypical anorexia\". it's not atypical at all. i've had my therapist tell me that 'there's nothing to worry about if you're in the healthy bmi range' after i told her about my eating disorder)\n\nthe healthy food thing. i'll eat things i enjoy, just rarely/in small quantities/throw up after. i'm too tired to give half a shit about nutritional value, i just want whatever i eat to be quick, easy and taste good (since i don't get much, i'd rather enjoy the small bit). \n\nthat we're only the product of the fashion/diet industry and starve ourselves for purely aesthetic/societal reasons. sure, that often is a factor, but you need to be much more mentally ill than just \"insecure from media\" to do this to yourself. \n\nthat we're stupid and don't know the risks. of course we fucking do. and most often, we don't care. we're destroying ourselves on purpose.\n\nthat we're fatphobic/unaccepting of other body types. sure, there are always bad eggs, but the majority doesn't judge others for their bodies. the fear of being fat applies only to oneself.",
          "created_utc": 1651610060.0
        },
        {
          "id": "i78aps0",
          "author": "Anfie22",
          "body": "Yup! One can be morbidly obese and have even more severe malnutrition than someone who is very underweight. For example if someone eats fries and fries only, they would have vitamin+mineral deficiencies up the wazoo and a blood test result would be akin to a screaming alarm.",
          "created_utc": 1651624075.0
        }
      ]
    },
    {
      "id": "i77atyy",
      "author": "ConfidentStrength999",
      "body": "Thanks! I approved it",
      "created_utc": 1651608354.0,
      "score": 7,
      "context": [
        {
          "id": "i774u51",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1651605886.0
        },
        {
          "id": "i776yaj",
          "author": "ConfidentStrength999",
          "body": "Hi, I had to remove this for rule 10 but if you’d like the edit the number out, let me know and I’ll go back and approve the comment.",
          "created_utc": 1651606772.0
        },
        {
          "id": "i777and",
          "author": "sneepsnart",
          "body": "alr i think i fixed it",
          "created_utc": 1651606907.0
        }
      ]
    },
    {
      "id": "i7b5reg",
      "author": "Prestigious-Bug-7641",
      "body": "Yes same here- It just didn't occur to me until this time round.. I've learned so much from this sub and you tube recovery stuff😊",
      "created_utc": 1651681726.0,
      "score": 1,
      "context": [
        {
          "id": "i77on8m",
          "author": "MelanieLouise42",
          "body": "That Ana is a young person's condition. My youth was so long ago, I can't remember it (55F)",
          "created_utc": 1651614047.0
        },
        {
          "id": "i77qrhr",
          "author": "Prestigious-Bug-7641",
          "body": "Yh I'm 43 and even I didn't realise I could lose control of this in my later years.. until this full-blown relapse, every lapse I now know I had, over the years, I was thinking I just had a short cut cheat to \"get back in shape\".. thought I left this shit back in my teen years.. little did I know, till now, that this doesn't discriminate and that I could end up in a complete mess at bloody 43 years old.. it really is such a horrible place to be- Stereotyping just makes it SO much worse, I find..xx",
          "created_utc": 1651614948.0
        },
        {
          "id": "i7811sp",
          "author": "None",
          "body": "I have been restricting since I was 11, but my worst relapse was when I was 30 to 33. I hate when people are like \"aren't you over this\" or \"your adult you know what starving yourself does\". Body dystopia is a life long struggle, I deal with this daily!",
          "created_utc": 1651619507.0
        }
      ]
    },
    {
      "id": "i78j267",
      "author": "mceggy_",
      "body": "ugh oh my gosh thank you so much. Reading everyone’s relatable comments along with your reply just now make feel like I’m going to cry. I’m so happy for you for staying 1 1/2 months clean you have no idea. you stay safe and strong too. <3",
      "created_utc": 1651627812.0,
      "score": 3,
      "context": [
        {
          "id": "i77zmrg",
          "author": "lonely-blue-sheep",
          "body": "That it’s only for appearance. I struggle with that, but I started because it was another coping skill to distract me from life and stuff. Used to play fruit ninja on my body but now I do this.",
          "created_utc": 1651618864.0
        },
        {
          "id": "i78i8i8",
          "author": "mceggy_",
          "body": "I’ve done “fruit ninja” too. I’m 20 days clean from it. Not much but it’s something. I would do anything to get my skin to look the way that it did before. It’s so embarrassing. Covering it up all the time at work becomes annoying. :/",
          "created_utc": 1651627440.0
        },
        {
          "id": "i78inq1",
          "author": "lonely-blue-sheep",
          "body": "Hey but that’s still good progress dude I’m proud of you. 20 days is still a long time to be clean for. You’re amazing for getting this far. I’m about a month and a half clean from self-fruit ninja. \n\nStay safe and strong\n\nTake care <3",
          "created_utc": 1651627629.0
        }
      ]
    },
    {
      "id": "i7a92pm",
      "author": "Anfie22",
      "body": "Real talk right here",
      "created_utc": 1651667634.0,
      "score": 3,
      "context": [
        {
          "id": "i77ezdn",
          "author": "coffee-bat",
          "body": "that we're all thin. the overwhelming majority of anorexics isn't underweight. (which is also why i sorta have a problem with \"atypical anorexia\". it's not atypical at all. i've had my therapist tell me that 'there's nothing to worry about if you're in the healthy bmi range' after i told her about my eating disorder)\n\nthe healthy food thing. i'll eat things i enjoy, just rarely/in small quantities/throw up after. i'm too tired to give half a shit about nutritional value, i just want whatever i eat to be quick, easy and taste good (since i don't get much, i'd rather enjoy the small bit). \n\nthat we're only the product of the fashion/diet industry and starve ourselves for purely aesthetic/societal reasons. sure, that often is a factor, but you need to be much more mentally ill than just \"insecure from media\" to do this to yourself. \n\nthat we're stupid and don't know the risks. of course we fucking do. and most often, we don't care. we're destroying ourselves on purpose.\n\nthat we're fatphobic/unaccepting of other body types. sure, there are always bad eggs, but the majority doesn't judge others for their bodies. the fear of being fat applies only to oneself.",
          "created_utc": 1651610060.0
        },
        {
          "id": "i78aps0",
          "author": "Anfie22",
          "body": "Yup! One can be morbidly obese and have even more severe malnutrition than someone who is very underweight. For example if someone eats fries and fries only, they would have vitamin+mineral deficiencies up the wazoo and a blood test result would be akin to a screaming alarm.",
          "created_utc": 1651624075.0
        },
        {
          "id": "i7a8xt0",
          "author": "coffee-bat",
          "body": "yes, exactly! like, also, i'm pretty much circling back and forth around my starting weight (bmi ~23), but i'm malnourished as SHIT. anemia, every possible vitamin deficiency, low blood clotting + blood vessels spilling (spiderweb on legs), on top of thar gall and kidney stones. and i'm not thin in the slightest. and despite all this, i get told i'm \"not anorexic because i'm healthy\".",
          "created_utc": 1651667566.0
        }
      ]
    },
    {
      "id": "i7a9yc6",
      "author": "coffee-bat",
      "body": "honestly this rhethoric is what got me to unsub to a channel i'd love to use to trigger/motivate myself. she made a video on tess holiday a few months ago, specifically about her claiming to be anorexic, and her ONLY point in the whole rant was that tess can't have ana because she's obese. like. do i fully believe she actually has it and it's not a publicity stunt? not really, but i'm in no position to claim it's false either. you can't \"disprove\" someone's eating disorder, especially not by using their weight against them. and of course, when i tried to say this in the comments, using actual data and studies, i got laughed at, called fat-related names, and told to do. ekhm. bad things to myself. that's when i realized just how harmful this rhethoric is, especially when it's being spread by people with large platforms. it's disgusting and misinformed.",
      "created_utc": 1651668088.0,
      "score": 6,
      "context": [
        {
          "id": "i77ezdn",
          "author": "coffee-bat",
          "body": "that we're all thin. the overwhelming majority of anorexics isn't underweight. (which is also why i sorta have a problem with \"atypical anorexia\". it's not atypical at all. i've had my therapist tell me that 'there's nothing to worry about if you're in the healthy bmi range' after i told her about my eating disorder)\n\nthe healthy food thing. i'll eat things i enjoy, just rarely/in small quantities/throw up after. i'm too tired to give half a shit about nutritional value, i just want whatever i eat to be quick, easy and taste good (since i don't get much, i'd rather enjoy the small bit). \n\nthat we're only the product of the fashion/diet industry and starve ourselves for purely aesthetic/societal reasons. sure, that often is a factor, but you need to be much more mentally ill than just \"insecure from media\" to do this to yourself. \n\nthat we're stupid and don't know the risks. of course we fucking do. and most often, we don't care. we're destroying ourselves on purpose.\n\nthat we're fatphobic/unaccepting of other body types. sure, there are always bad eggs, but the majority doesn't judge others for their bodies. the fear of being fat applies only to oneself.",
          "created_utc": 1651610060.0
        },
        {
          "id": "i78aps0",
          "author": "Anfie22",
          "body": "Yup! One can be morbidly obese and have even more severe malnutrition than someone who is very underweight. For example if someone eats fries and fries only, they would have vitamin+mineral deficiencies up the wazoo and a blood test result would be akin to a screaming alarm.",
          "created_utc": 1651624075.0
        },
        {
          "id": "i7a8xt0",
          "author": "coffee-bat",
          "body": "yes, exactly! like, also, i'm pretty much circling back and forth around my starting weight (bmi ~23), but i'm malnourished as SHIT. anemia, every possible vitamin deficiency, low blood clotting + blood vessels spilling (spiderweb on legs), on top of thar gall and kidney stones. and i'm not thin in the slightest. and despite all this, i get told i'm \"not anorexic because i'm healthy\".",
          "created_utc": 1651667566.0
        },
        {
          "id": "i7a92pm",
          "author": "Anfie22",
          "body": "Real talk right here",
          "created_utc": 1651667634.0
        }
      ]
    }
  ]
}