{
  "id": "uvnpg3",
  "subreddit": "AnorexiaNervosa",
  "author": "nbh679",
  "created_utc": 1653264465.0,
  "title": "Chronic EDs",
  "selftext": "EDs feel sexy at first- they are forbidden and mysterious, with the promise of some prize if you keep going further into it. Even when you first start recovery, or first relapse, there are a lot of people there helping you fight. But if it becomes chronic, and as you get older, you become frozen in time. People move on, get married, and have kids and families. You are stuck with a debilitating, dangerous disease that is no longer sexy or seductive at all- it's the worst kind of boring, but just as life-threatening. I think this is the least discussed long term consequence- that you just stay stuck in your ED until it is embedded into your personality. I know the people who would benefit most from this post probably will breeze over it in the same way I would have, but god I wish I could take my younger self and shake her sometimes.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/uvnpg3/chronic_eds/",
  "score": 110,
  "num_comments": 25,
  "comments": [
    {
      "id": "i9migvj",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1653264465.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i9mqzxo",
      "author": "recoveryinnyc",
      "body": "F32 here. Agreed. Been struggling since I was 12 with almost every ED diagnosis…it gets worse as you get older. People give up on you faster. I wish I could go back and shake myself into advocating for myself when I was younger.",
      "created_utc": 1653268908.0,
      "score": 31,
      "context": []
    },
    {
      "id": "i9n0v2g",
      "author": "Trip_the_light3020",
      "body": "Yup. 37F. Single, barely holding onto a job. Living a boring quiet life. In residential now, but nothing is sinking in. I'm supposed to be working but I am just desperate and trying to do both. It is all downhill from here. You're right. People move on. As they should.\n \n\nDeath will be a welcome friend.",
      "created_utc": 1653273892.0,
      "score": 27,
      "context": []
    },
    {
      "id": "i9mv4at",
      "author": "None",
      "body": "Yep and I see it all the time in adults, especially older women. They’re constantly browsing the grocery store and checking the calories of all the items. They spend countless hours reading up on the latest diet fad and criticize other people’s lifestyles. I would hate to be like that when I get older, it’s no way to live :/",
      "created_utc": 1653270952.0,
      "score": 22,
      "context": []
    },
    {
      "id": "i9mpdsj",
      "author": "Discoglitter27",
      "body": "Fucking EXACTLY.",
      "created_utc": 1653268084.0,
      "score": 12,
      "context": []
    },
    {
      "id": "i9n5ioe",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1653276381.0,
      "score": 11,
      "context": []
    },
    {
      "id": "i9mvhsp",
      "author": "This_Ticcing_Zebra",
      "body": "I’ve been struggling for about 6 years now   It’s only been know to others that I’ve had it 2 years ago when I got diagnosed. I can’t imagine how hard it’s going to be if I can’t recover. Im not even 20 yet and everyone in my family has given up on me already 🥴",
      "created_utc": 1653271143.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i9oyfsw",
      "author": "None",
      "body": "\n\n\nThis is very true. I’m 35. I have what some people have referred to as “functional anorexia”. I have an amazing life. Wonderful family, perfect boyfriend, great career, beautiful home, I’m very happy- but I’m also very sick. I’ve been very sick for over 20 years. During that time I’ve learned to be so precise and calculated that no one can really tell that there’s anything wrong, especially because I’m only slightly underweight. I don’t stress about food or my weight or exercise anymore because I’ve learned to fit reason into my disorder. I eat absolutely whatever I want, whenever I want, but I just don’t want to eat a lot. It’s just how I am now. My hair will be thin and falling out for the rest of my life, I’ve accepted that. Im always going to be freezing and shaking in less than 80° temperatures, so I never leave the house without a sweater because I can’t even go into an air conditioned store in the summer without shivering and loosing feeling in my fingers. My family knows not to try and make me eat things I’m not comfortable with, because if they do I won’t visit as much. They turn up the heat and set my place at the table with the smallest cutlery they have in the house, and they think it’s just a cute quirk. When picking food, I will always choose the lower calorie one, because it’s what I genuinely prefer to eat, regardless of taste. I can’t eat breakfast, and when I see people eat breakfast Im envious because I wish I could just casually eat in the morning. But I can’t. It’s just not who I am anymore. I’ve been in and out of treatment, I’ve suffered a lot, but over the years I’ve learned to ease that suffering. Ive learned to be flexible with my disorder, because if I didn’t I’d likely be dead or in the hospital. All my ED behaviors are so ingrained in me that it’s a part of me now. I’m different than I was before. I hide my ED behind veganism and running and stress and dental problems. It’s so easy to live this way now, and in general I feel great physically and mentally, so there’s not really any motivation for me to change anything. Even though my life is easy and good now, I would never wish this upon anyone else because the suffering I went through to get here almost killed me multiple times, in multiple ways",
      "created_utc": 1653319563.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i9omf71",
      "author": "None",
      "body": "Afab25, had ana for 10 years now and this is such a brutally honest and accurate take. When this disorder starts, you think that it'll be your best tool and friend. It'll bring comfort and compliments and control when I felt like I was spiraling out of control. But 10yrs later and I can't shake it, it's embedded into my self and identity. But I'm working to take my life back 💜",
      "created_utc": 1653314182.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i9phjfx",
      "author": "_whitenightmare_",
      "body": "Hard agree. I've been struggling with anorexia for 8 years now. I'm finally starting to get better, but it's still a struggle.",
      "created_utc": 1653327580.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i9qexpl",
      "author": "Coffeegreysky12",
      "body": "I think eating disorders are something that the sufferer falls into by accident. and that they are trying to numb painful emotions. and that's about it. eating disorders are about mental pain.  I do not necessarily think people who begin to suffer from eating disorders think there is anything forbidden or mysterious about trying to starve themselves to death. even in the beginning. you have to be deeply unhappy in order to do this to yourself. no happy, well adjusted person would develop anorexia. there is no beauty in an eating disorder.",
      "created_utc": 1653342024.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i9o9q9s",
      "author": "RubIll6548",
      "body": "only in my early 20’s here but dealing with it for 8 years. the worst part of this for me is the friends and my now ex that know just… accept it. at one point i was talking about it a lot to my ex in a very disordered way, telling my goals and shit (toxic, i know) and it sucks when nobody seems to care or fight with me about it anymore.",
      "created_utc": 1653307339.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i9onwtp",
      "author": "None",
      "body": "F35 and I can’t believe this is my life 😣",
      "created_utc": 1653314880.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i9ozixo",
      "author": "CustyHoboRat",
      "body": "Yep. Barely functioning but constantly getting told to ‘just grow up’",
      "created_utc": 1653320025.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i9pcvu4",
      "author": "jennierock",
      "body": "And it’s time consuming as well, time flies, you look back and saw that you didn’t do anything with your life, you are stuck in the same place you were years ago. It makes you give up friends, family, hobbies, education, all for a prize that doesn’t exist.",
      "created_utc": 1653325615.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i9pdo60",
      "author": "None",
      "body": "I’ve been disordered since I can remember, albeit only full-blown anorexia for two years, but it saddens me because I feel like I’ll be living like this for the rest of my life. Whenever I feel a bit better or restrict a little less, I try to make the most of it because I know that eventually I’ll have another horrible relapse. It’s like my entire life is spent trying to obsessively harm reduce as much as possible because I know I can never fully recover. I’ve missed out on so much already in such a short amount of time and I don’t even want to know how much more I’ll miss. I’m starting college in a few months and I know I’ll be lucky to make it through the first semester without having to take medical leave. Everything is uncertain because of this disorder. The control is an illusion. Before I became ill, I could never fathom the idea of my education, health, and career being in such jeopardy. Now, it’s like I’m perpetually staring down the barrel of a gun, waiting for someone or something to pull the trigger and send me spiraling.",
      "created_utc": 1653325952.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i9qtkh4",
      "author": "MobileMaleficent1009",
      "body": "Agree with this so much. Just like other addictions our lives get stuck in the addiction and all other goals go out the window and we become stuck",
      "created_utc": 1653349034.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i9mr5lg",
      "author": "nbh679",
      "body": "Exactly. People know and just get used to you being sick.",
      "created_utc": 1653268989.0,
      "score": 10,
      "context": [
        {
          "id": "i9mqzxo",
          "author": "recoveryinnyc",
          "body": "F32 here. Agreed. Been struggling since I was 12 with almost every ED diagnosis…it gets worse as you get older. People give up on you faster. I wish I could go back and shake myself into advocating for myself when I was younger.",
          "created_utc": 1653268908.0
        }
      ]
    },
    {
      "id": "i9n41bd",
      "author": "None",
      "body": "I appreciate you sharing this unpopular opinion. The long term psychosocial effects of EDs can really drag down quality of life and cause us to just want life to be over, if this is what life is. The honeymoon phase is so nice; everyone is worried, keeps and eye on you, you hate it but it’s hard to deny the hope that others hold for you. They say there’s treatment that can help you. There’s a method to help you get better and you’ll put this all behind you. After a few tries to get better and not sustaining recovery, I have a friend who seems to sort of feel sorry for me bc of my ED. We don’t talk about it much anymore, but when it comes up she seems so genuinely sad and I never know what to say because I’m not a gung-ho recovery fighter. If anything I’m just scraping by as a functional anorexic. I don’t talk about my ED in real life anymore, except to my partner when things get so bad that I can’t hide it. I don’t talk about it because I’ve tried everything that anyone could suggest. People want to fix it and they can’t. It’s easier to let people think you’re fine. But believe you me, I am not afraid of a sudden death. It doesn’t make me reckless but if I die early from some freak accident or a sudden severe medical condition, I would be kind of relieved. To have someone take the choice away from me sounds wonderful. \n\nThey say you can’t choose to have an ED but you can choose recovery. The older I get, the more life experience I have from myself and observing others… I realize some people cannot or will not achieve a lasting state of recovery. Some win the fight, some lose the fight; some choose not to fight and accept the outcomes.",
      "created_utc": 1653275595.0,
      "score": 13,
      "context": [
        {
          "id": "i9n0v2g",
          "author": "Trip_the_light3020",
          "body": "Yup. 37F. Single, barely holding onto a job. Living a boring quiet life. In residential now, but nothing is sinking in. I'm supposed to be working but I am just desperate and trying to do both. It is all downhill from here. You're right. People move on. As they should.\n \n\nDeath will be a welcome friend.",
          "created_utc": 1653273892.0
        }
      ]
    },
    {
      "id": "i9n5vtv",
      "author": "nbh679",
      "body": "I totally know what you mean. It’s so hard not to chase the magic of the honeymoon phase. And I think the anorexia skews how it actually was- when I look back on it my ED has treated me terribly all along.",
      "created_utc": 1653276587.0,
      "score": 3,
      "context": [
        {
          "id": "i9n5ioe",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1653276381.0
        }
      ]
    },
    {
      "id": "i9mvufw",
      "author": "nbh679",
      "body": "That’s so hard. My formative years were tainted with an ED too and it’s so hard to recover when you have never met your recovered self.",
      "created_utc": 1653271319.0,
      "score": 6,
      "context": [
        {
          "id": "i9mvhsp",
          "author": "This_Ticcing_Zebra",
          "body": "I’ve been struggling for about 6 years now   It’s only been know to others that I’ve had it 2 years ago when I got diagnosed. I can’t imagine how hard it’s going to be if I can’t recover. Im not even 20 yet and everyone in my family has given up on me already 🥴",
          "created_utc": 1653271143.0
        }
      ]
    },
    {
      "id": "i9orzj8",
      "author": "nbh679",
      "body": "Me too ❤️ I definitely work hard in recovery, but sometimes it feels like too little too late.",
      "created_utc": 1653316737.0,
      "score": 3,
      "context": [
        {
          "id": "i9omf71",
          "author": "None",
          "body": "Afab25, had ana for 10 years now and this is such a brutally honest and accurate take. When this disorder starts, you think that it'll be your best tool and friend. It'll bring comfort and compliments and control when I felt like I was spiraling out of control. But 10yrs later and I can't shake it, it's embedded into my self and identity. But I'm working to take my life back 💜",
          "created_utc": 1653314182.0
        }
      ]
    },
    {
      "id": "i9odbj5",
      "author": "nbh679",
      "body": "It’s hard because I don’t want people to intervene but it’s also hard to know they won’t because they’re just used to it.",
      "created_utc": 1653309499.0,
      "score": 2,
      "context": [
        {
          "id": "i9o9q9s",
          "author": "RubIll6548",
          "body": "only in my early 20’s here but dealing with it for 8 years. the worst part of this for me is the friends and my now ex that know just… accept it. at one point i was talking about it a lot to my ex in a very disordered way, telling my goals and shit (toxic, i know) and it sucks when nobody seems to care or fight with me about it anymore.",
          "created_utc": 1653307339.0
        }
      ]
    },
    {
      "id": "i9mw8hc",
      "author": "This_Ticcing_Zebra",
      "body": "Especially when all your family is in denial 🙃",
      "created_utc": 1653271511.0,
      "score": 8,
      "context": [
        {
          "id": "i9mvhsp",
          "author": "This_Ticcing_Zebra",
          "body": "I’ve been struggling for about 6 years now   It’s only been know to others that I’ve had it 2 years ago when I got diagnosed. I can’t imagine how hard it’s going to be if I can’t recover. Im not even 20 yet and everyone in my family has given up on me already 🥴",
          "created_utc": 1653271143.0
        },
        {
          "id": "i9mvufw",
          "author": "nbh679",
          "body": "That’s so hard. My formative years were tainted with an ED too and it’s so hard to recover when you have never met your recovered self.",
          "created_utc": 1653271319.0
        }
      ]
    }
  ]
}