{
  "id": "v3bfne",
  "subreddit": "AnorexiaNervosa",
  "author": "homosexualfruitloops",
  "created_utc": 1654183675.0,
  "title": "i'd rather deal with the consequences of anorexia rather than torturous recovery",
  "selftext": "i wish i could recover. i love food, i love cooking. i love having food freedom. i love having spontaneity and miss not feeling severe guilt \n\nbut with all that said, i honest to god don't think i'd be able to deal with the weight gain or lack of control. i feel like it would absolutely crush me \n\ni'd rather deal with all of this stupid an related shit than deal with gaining weight/being weight restored, and honestly i don't think i'll ever fully recover. \n\nsorry for this vent\n\nedit: thank you for the kind words of support and relation. i wish i could reply to all of you but i just do not have the energy",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/v3bfne/id_rather_deal_with_the_consequences_of_anorexia/",
  "score": 135,
  "num_comments": 16,
  "comments": [
    {
      "id": "iax76hq",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1654183675.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iaxrsll",
      "author": "Coffeegreysky12",
      "body": "the consequences of anorexia for people who do not recover are either horrible, painful medical complications that you live with for the rest of your life or death. no one lives with anorexia untreated and just feels fine. it destroys you painfully and horribly in one way or the other, no one escapes these consequences. you die or you recover. I am at the point where I am worried this will eventually kill me. but I tried to recover and I couldn't and now I feel too weak to try. it's a sad reality of eating disorders. recovery may feel like torture for some people, but living with anorexia for years and slowly dying from it is also pure torture.",
      "created_utc": 1654192369.0,
      "score": 46,
      "context": []
    },
    {
      "id": "iayql4r",
      "author": "duckfruits",
      "body": "I can't speak for anyone else's experience but for me, the tortures of recovery were temporary. Significantly more temporary than I would have thought. It gets easier and easier everyday. And looking back, I feel silly that I wasted so much time staying in my disorder because I thought it would be near impossible. \n\nDon't get me wrong, it's not easy. But most of the tortures of recovery are only torturous because your disorder doesn't want the unhealthy coping mechanisms to go away. Your disorder makes you think that staying disordered is less torturous than recovery. Just like a drug addict, the first few days of withdrawal are miserable enough to make you want to give up on getting sober but after the withdrawals are over, it gets easier and easier with every breath you take to not use drugs. Especially if you develop healthy coping mechanisms that you can lean on in times of stress or upset instead of turning back to your addiction. \n\nThe disorder is torturous and the only escape from it is death or recovery. The torture of recovery is temporary and leads you out of long term suffering.",
      "created_utc": 1654207579.0,
      "score": 22,
      "context": []
    },
    {
      "id": "iayh1mk",
      "author": "nbh679",
      "body": "Recovery accounts trigger me. They show a version of recovery I couldn’t handle. I was an athlete before anorexia and I will be an athlete after. But consider a middle ground- staying anorexic is not sustainable and it gets ugly very quickly. You don’t have to be dancing on TikTok as you chow down on cookie filled donuts, but your body will rebel really badly if you stay sick. \n\nI may get flamed for this, but the quasi-recovery so many mock is the lesser of 2 evils for some. At the end of the day, success is first and foremost not physically destroying your body. Maybe you never will be totally recovered and always will watch your weight. But don’t just give up because you think your only choice is anorexia or hating your body.",
      "created_utc": 1654203276.0,
      "score": 24,
      "context": []
    },
    {
      "id": "iaxd4zp",
      "author": "libertybells125",
      "body": "i kind of get this… too much. i’d rather be stuck in the disorder and die from it than recover at this point… but i feel too big",
      "created_utc": 1654186236.0,
      "score": 9,
      "context": []
    },
    {
      "id": "iaxj6ax",
      "author": "hypermobilehannah",
      "body": "I hear you, I really do",
      "created_utc": 1654188787.0,
      "score": 7,
      "context": []
    },
    {
      "id": "iazfrqd",
      "author": "licegirl",
      "body": "I literally do not believe i am capable of not thinking normal bmi on me is fat",
      "created_utc": 1654219585.0,
      "score": 6,
      "context": []
    },
    {
      "id": "iaxn7lc",
      "author": "sunbeamfairy",
      "body": "I weighed my lowest, somehow got into a better mindset and _wanted_ to gain weight because I thought I could handle it. I’m now closest to my heaviest weight, I’m at a terrible mindset and now absolutely struggling with it. I would rather starve and go through this bullshit all over again then step on another scale.",
      "created_utc": 1654190476.0,
      "score": 9,
      "context": []
    },
    {
      "id": "iaz60yf",
      "author": "Queenofwands1212",
      "body": "Right there with you. This is exactly why I choose to just continue my Ed but try to do it in a more healthy way than when I was anorexic in high school",
      "created_utc": 1654214835.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iax90v8",
      "author": "thismindhurts",
      "body": "My dude I totally get this. My AN developed at 8, purely got worse until 12 and from there on I spent years of my life is hospitals and treatment and psych wards and OP etc etc until I took recovery into my own hands at 18. It went epic until this mindset had me chicken out at 20 and now I’m 21 in he most hellish relapse. Idk I guess I needed to vent too but god I wish I just told someone instead of let this happen. I’d you can save yourself please do it sounds like you’re quite ill so please think about your own self and hang in there",
      "created_utc": 1654184471.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iazo5sm",
      "author": "Elfen8",
      "body": "I get you, I love food and miss not feeling guilty for eating. I miss being free but I won’t recover this is all I have and I’m not letting go",
      "created_utc": 1654223535.0,
      "score": 1,
      "context": []
    },
    {
      "id": "id9x6qo",
      "author": "None",
      "body": "This is so important. You body can only last so long. Now that I’m in my 30s and I’m feeling the affects of it on my body I regret it so much. It’s not spoken about enough :(",
      "created_utc": 1655879039.0,
      "score": 5,
      "context": [
        {
          "id": "iaxrsll",
          "author": "Coffeegreysky12",
          "body": "the consequences of anorexia for people who do not recover are either horrible, painful medical complications that you live with for the rest of your life or death. no one lives with anorexia untreated and just feels fine. it destroys you painfully and horribly in one way or the other, no one escapes these consequences. you die or you recover. I am at the point where I am worried this will eventually kill me. but I tried to recover and I couldn't and now I feel too weak to try. it's a sad reality of eating disorders. recovery may feel like torture for some people, but living with anorexia for years and slowly dying from it is also pure torture.",
          "created_utc": 1654192369.0
        }
      ]
    },
    {
      "id": "iaz2oo0",
      "author": "peachaleach",
      "body": "I wholeheartedly agree with you. \n\nHarm reduction is valid, effective and saves lives. This took me a really long time to accept - I went to Monte Nido my first time in treatment like a decade ago,now  and they REALLY pushed that you could be fully recovered. That anyone could be fully recovered.   Cured. There would be a distinct end of the disease.\n\nWhich is is lovely but it's just not the reality. And there are a significant portion of us that just can't seem to break free of it. And I think Harm reduction or encouragement/acknowledgement of the fact thatsome level of recovery is better than none",
      "created_utc": 1654213195.0,
      "score": 14,
      "context": [
        {
          "id": "iayh1mk",
          "author": "nbh679",
          "body": "Recovery accounts trigger me. They show a version of recovery I couldn’t handle. I was an athlete before anorexia and I will be an athlete after. But consider a middle ground- staying anorexic is not sustainable and it gets ugly very quickly. You don’t have to be dancing on TikTok as you chow down on cookie filled donuts, but your body will rebel really badly if you stay sick. \n\nI may get flamed for this, but the quasi-recovery so many mock is the lesser of 2 evils for some. At the end of the day, success is first and foremost not physically destroying your body. Maybe you never will be totally recovered and always will watch your weight. But don’t just give up because you think your only choice is anorexia or hating your body.",
          "created_utc": 1654203276.0
        }
      ]
    },
    {
      "id": "iazh3z5",
      "author": "DowntownCarob",
      "body": "Love this. I honestly think the only way I will ever recover is by continuing to go to the gym and play sport and use that as a motivation to eat more.",
      "created_utc": 1654220200.0,
      "score": 4,
      "context": [
        {
          "id": "iayh1mk",
          "author": "nbh679",
          "body": "Recovery accounts trigger me. They show a version of recovery I couldn’t handle. I was an athlete before anorexia and I will be an athlete after. But consider a middle ground- staying anorexic is not sustainable and it gets ugly very quickly. You don’t have to be dancing on TikTok as you chow down on cookie filled donuts, but your body will rebel really badly if you stay sick. \n\nI may get flamed for this, but the quasi-recovery so many mock is the lesser of 2 evils for some. At the end of the day, success is first and foremost not physically destroying your body. Maybe you never will be totally recovered and always will watch your weight. But don’t just give up because you think your only choice is anorexia or hating your body.",
          "created_utc": 1654203276.0
        }
      ]
    },
    {
      "id": "idaexk1",
      "author": "Coffeegreysky12",
      "body": "So true. a person's body can only take so much. it's truly scary when you start to feel the effects of anorexia. it's really sad. I wish I wasn't anorexic. I wake up every day hoping that I can just snap out of this. it's more difficult than people realize",
      "created_utc": 1655893970.0,
      "score": 6,
      "context": [
        {
          "id": "iaxrsll",
          "author": "Coffeegreysky12",
          "body": "the consequences of anorexia for people who do not recover are either horrible, painful medical complications that you live with for the rest of your life or death. no one lives with anorexia untreated and just feels fine. it destroys you painfully and horribly in one way or the other, no one escapes these consequences. you die or you recover. I am at the point where I am worried this will eventually kill me. but I tried to recover and I couldn't and now I feel too weak to try. it's a sad reality of eating disorders. recovery may feel like torture for some people, but living with anorexia for years and slowly dying from it is also pure torture.",
          "created_utc": 1654192369.0
        },
        {
          "id": "id9x6qo",
          "author": "None",
          "body": "This is so important. You body can only last so long. Now that I’m in my 30s and I’m feeling the affects of it on my body I regret it so much. It’s not spoken about enough :(",
          "created_utc": 1655879039.0
        }
      ]
    },
    {
      "id": "ib1ii9y",
      "author": "timefliesx",
      "body": "I also went to Monte Nido (close to a decade ago as well. jfc when did I get old), and had a hard time with that concept as well.\n\n\n\nI'm also an addict (currently sober from my drugs of choice, but I do not follow any 12step programs, and will smoke weed until the day I die). While I was at Monte Nido they had me go out to AA meetings - I remember coming back from one feeling so frustrated at treatment and meetings, and asking in group - if AA teaches me that I will always be an addict and can never fully recover, how is that so different with my eating disorder? How is it possible for me to be 100% recovered from my obsession and compulsion re: ED but not my obsession and compulsion re: drugs?\n\n\n\nNo one had an answer for me.\n\n\n\n(they also loved my abusive, pedo, much older boyfriend - a biiiig driver of my ED at the time - but that's a whoooole other fucking story lmao)\n\n\n\nin any case: I believe fully in the efficacy of harm reduction. it is a concept that is important to me, and feels near and dear to my heart because of my treatment experiences that left me with an all or nothing attitude about recovery. I can put myself at less risk, even if I engage in \"risky\" behaviors, and I think that is important (certainly let me use heroin IV for over a decade without getting HIV or even HepC, despite using with partners who had it)",
      "created_utc": 1654267261.0,
      "score": 3,
      "context": [
        {
          "id": "iayh1mk",
          "author": "nbh679",
          "body": "Recovery accounts trigger me. They show a version of recovery I couldn’t handle. I was an athlete before anorexia and I will be an athlete after. But consider a middle ground- staying anorexic is not sustainable and it gets ugly very quickly. You don’t have to be dancing on TikTok as you chow down on cookie filled donuts, but your body will rebel really badly if you stay sick. \n\nI may get flamed for this, but the quasi-recovery so many mock is the lesser of 2 evils for some. At the end of the day, success is first and foremost not physically destroying your body. Maybe you never will be totally recovered and always will watch your weight. But don’t just give up because you think your only choice is anorexia or hating your body.",
          "created_utc": 1654203276.0
        },
        {
          "id": "iaz2oo0",
          "author": "peachaleach",
          "body": "I wholeheartedly agree with you. \n\nHarm reduction is valid, effective and saves lives. This took me a really long time to accept - I went to Monte Nido my first time in treatment like a decade ago,now  and they REALLY pushed that you could be fully recovered. That anyone could be fully recovered.   Cured. There would be a distinct end of the disease.\n\nWhich is is lovely but it's just not the reality. And there are a significant portion of us that just can't seem to break free of it. And I think Harm reduction or encouragement/acknowledgement of the fact thatsome level of recovery is better than none",
          "created_utc": 1654213195.0
        }
      ]
    }
  ]
}