{
  "id": "v5fp93",
  "subreddit": "AnorexiaNervosa",
  "author": "bo0ogie",
  "created_utc": 1654442900.0,
  "title": "people 23+ with ana??",
  "selftext": "i’m 24, and all the ED content i consume (reddit, youtube, etc.) is just full of teenagers. and most college age. and i feel so pathetic that i’m an adult with anorexia. is anyone else over 23 in the same boat?? i’m desperate to know i’m not so pathetic that every adult has recovered but me. i know i should have outgrown this by now. i remember thinking when i was a teenager “i can’t wait to grow up because then this won’t be an issue anymore.” and yet here i am. 24. worse than i’ve ever been. flirting the line with forced treatment. and teenager me would be so heartbroken to know that this is how we turned out.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/v5fp93/people_23_with_ana/",
  "score": 150,
  "num_comments": 93,
  "comments": [
    {
      "id": "ib9eo75",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1654442900.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ib9gqqa",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1654443903.0,
      "score": 74,
      "context": []
    },
    {
      "id": "ib9w6xk",
      "author": "bessvix",
      "body": "43 and still struggling",
      "created_utc": 1654451180.0,
      "score": 30,
      "context": []
    },
    {
      "id": "ib9hapn",
      "author": "flowerscatsandqs",
      "body": "You’re not pathetic. I’m 24, this is a mental illness and mental illness knows no age. When I was in residential treatment the vast majority of patients were actually older than I was. I think we see more teens/young 20s on social media talking about their EDs for a few reasons: they have more free time to do so (usually past the age of 23 you have a full time job), it’s trendier for younger generations, and younger generations have less of a stigma surrounding taking about their illness publicly than older generations (especially Gen X/boomers). It’s not that there are less “older” folks (we aren’t old btw we’re in our mid 20s lol) that are struggling w/ EDs, it’s just that the loudest people tend to be younger than us rn, at least in online forums. \n\nBut you aren’t alone, and you certainly aren’t pathetic.",
      "created_utc": 1654444171.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ib9iza3",
      "author": "KenzieValentyne",
      "body": "I’m only 21, but I totally relate. The vast majority of other people with EDs I meet in groups online are 13-16. It makes sense, that’s the group I was in when mine started. I’m just so glad I didn’t seek out these spaces at that age - those poor young kids are so actively pro ED, and I don’t want that. I don’t want to encourage a bunch of young teens to keep doing what they’re doing. I want a place to talk about struggles and share advice to other people *who have already surrendered completely to the disease.* Kids never, ever fall into that category. I want a group that’s not pro ED or pro recovery, just “anything goes in our discussions here” for 18+ only but I really have no luck finding such a thing.",
      "created_utc": 1654444968.0,
      "score": 17,
      "context": []
    },
    {
      "id": "iba4l2r",
      "author": "caretaker1971",
      "body": "51. Developed anorexia for the first time 2 years ago. I feel ridiculous. Can’t believe at my age, I struggle with this. Sometimes I feel like an imposter. My family doesn’t know. They just think I’m too thin. Too ashamed to tell them. Im working on it with my team.",
      "created_utc": 1654455147.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ib9link",
      "author": "Vefreyja",
      "body": "35 here!",
      "created_utc": 1654446173.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ib9h7hm",
      "author": "Either-Place-6240",
      "body": "I’m twenty three, still haven’t recovered from fifteen y/o",
      "created_utc": 1654444129.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ib9xj1x",
      "author": "Independent_Head132",
      "body": "I’m well above 23. I’m in my late 30’s.",
      "created_utc": 1654451800.0,
      "score": 10,
      "context": []
    },
    {
      "id": "iba2tcc",
      "author": "None",
      "body": "Hi! There’s a sub for those of us over 30 😊\n\nr/Eatingdisordersover30",
      "created_utc": 1654454299.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ib9ixdb",
      "author": "MinnieMay9",
      "body": "I definitely agree with you, I'm 38 and still have problems with it.  It makes me feel like I must be faking or something.",
      "created_utc": 1654444943.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ib9rw0g",
      "author": "lovegrace2788",
      "body": "38…feeling ancient over here!",
      "created_utc": 1654449185.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ibaf9ma",
      "author": "None",
      "body": "32, will be 33 in a couple months\n\nYou could try r/EdAnonymousAdults",
      "created_utc": 1654460299.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ibbajti",
      "author": "bo0ogie",
      "body": "wait i want to make a group for us if your interested please let me know!!! i desperately need adult ED friends/community that isn’t this fake forced recovery BS. \nplease lmk!!! idk how we could could group bug i WANT IT",
      "created_utc": 1654475995.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ib9nx8p",
      "author": "lipstickch4teau",
      "body": "23! I struggled really badly with it as a teenager and recovered for a little bit, but the pandemic has brought out old habits 😔 I find myself in a vicious cycle of starve-binge-starve now…",
      "created_utc": 1654447318.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ibb6oz5",
      "author": "Loose-Swimming6210",
      "body": "25 and my life fell apart because of it. Having anorexia really affects you differently depending on what life stage you’re in and I wish this was talked about more.",
      "created_utc": 1654474033.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ib9nl2o",
      "author": "yaegerss",
      "body": "26. i feel you. it's something i've struggled with since i was a teenager as well and i feel like an absolute pathetic mess that i don't have it figured out by now.",
      "created_utc": 1654447157.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ib9ogeb",
      "author": "libertybells125",
      "body": "25 here. sad to see so many younger people and i hope they can recover before it consumes their life the way it has mine. just know you are not pathetic for still struggling. it’s a difficult thing for anyone. 🖤 sending love and support",
      "created_utc": 1654447569.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ibad62q",
      "author": "BedroomImpossible124",
      "body": "58 😞",
      "created_utc": 1654459277.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ibai82e",
      "author": "heedwiig",
      "body": "Well I'm 23 and still in uni and don't feel like an adult in any way (struggling with ADHD and autism too, so many normal adult tasks are really overwhelming, like going to the bank, whoch has been calling me every monday for some weeks now and im not answering, uni too, poat office, etc...) and also because no-one around me treats me like one actually... so I don't feel like an adult either because I feel like I haven't experienced moat the things \"adults\" of my age already have like having a car, a job, a relationship etc... idk. A part of me craves those things but the part that suffers from sever anxiety does not...",
      "created_utc": 1654461716.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ibas2zr",
      "author": "None",
      "body": "24! Mental illness doesn’t discriminate unfortunately. We’re all susceptible at any age, anywhere. 💜",
      "created_utc": 1654466488.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ib9yulm",
      "author": "None",
      "body": "36 and feeling like I wasted my life. I wish I had turned it around in my 20s you still got time :)",
      "created_utc": 1654452411.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iba1vx6",
      "author": "EndlesslyMeh",
      "body": "I’m 40… it’s more common in older people than you’d think x",
      "created_utc": 1654453856.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iba3wt2",
      "author": "None",
      "body": "30 here. ❤️",
      "created_utc": 1654454825.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iba4p12",
      "author": "Advanced-Arm-1735",
      "body": "32 and its still part of my brain.\n\nThe older I get the less I kind of gain from the communities.. Maybe the more nuanced your life experience gets the less you can easily connect? \n\nAlthough you'll always find your people if you look hard enough, the working Ed community, the stay at home parents Ed edition, the off sick permanently Ed community etc etc\n\nYou get the same content for the most part, year after year but with a new generation adding themselves to the groups and because they're just 'learning' what it is to live with an Ed the content get recycled.\n\nI re added myself to Ed twitter in the hopes of having a space to voice all the Ed stuff in my brain.. But equally I'm saying what I always said too. \n\nNumbers, food, feeling lonely, triggered etc etc.",
      "created_utc": 1654455199.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iba52p7",
      "author": "chefertom",
      "body": "You are not alone my wife decided to finally tell me when she was in her late 30’s she is now in her 40’s still recovering but it has not been an easy road for her, the most important thing I can say is healthy supportive people around you will make a big difference, not everyday is a good day but we have way more good ones than bad ones now. Be honest with yourself and your loved ones, I hope and pray you have more good days than bad, one more thing never be ashamed of who you are!",
      "created_utc": 1654455386.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ibajkdk",
      "author": "Coffeegreysky12",
      "body": "people at any age can develop an eating disorder. I have had anorexia for 16 years. it started when I was an adult, not a teenager. it's not just something that happens to teenagers. there are a lot of people who have had anorexia nervosa for many years. it can also develop at any age. do not feel bad for being older and still struggling.",
      "created_utc": 1654462366.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ibbezis",
      "author": "None",
      "body": "I’m 24, going to be 25 next month and struggling now more than ever tbh",
      "created_utc": 1654478250.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ibbjl6z",
      "author": "sorcerers_apprentice",
      "body": "I'm also 24, am in recovery now but hit probably my lowest point with anorexia last year (aged 23) after struggling since my teenaged years and being in and out of treatment many times.\n\nYes, this sucks as an adult. It's embarrassing...I found myself trying to hide my weight much more than when I was younger--not because I didn't want to be \"found out,\" but because I was ashamed of how emaciated I'd become. I was also trying to figure out how to navigate treatment while working a full-time job, and ended up deciding it was not worth it because goddamn is treatment not set up to help adults who have to work. It's depressing, and it's brutal, and it's hard to escape.\n\nI do think recovery is possible though. I'm not \"recovered\" per se, but after getting on the right meds, getting out of an extremely toxic/abusive relationship, and putting effort into surrounding myself with a positive group of people...I'm getting there. Hang in there.",
      "created_utc": 1654480640.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ibburjp",
      "author": "Psycho_Rachel",
      "body": "18 here... I wish I could be as optimistic of outgrowing this as you once were... As sick as it sounds, I know I will be one of you folks, 40+ and anorexia & b/ping still destroying my life. I am just hopeless ig, I have no reason to even care about recovery... I'm sorry if this comment is in some way inappropriate, sometimes stuff just flies over my head and I write/vent without much thinking ... I just needed to get this off my chest and don't feel like making such a depressing post... Anyway, il all of you wonderful, strong people ❤️",
      "created_utc": 1654486787.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ibc0vbx",
      "author": "Loctusofsmorgasbord",
      "body": "41 here",
      "created_utc": 1654490857.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ibbwwk3",
      "author": "Camehereforfun95",
      "body": "Almost 27 yr old here. \n\nI've been dealing with my disorder for almost my whole adult life. Let's say, a decade.",
      "created_utc": 1654488142.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ib9iity",
      "author": "intl-uni-help-please",
      "body": "I am 23 too and I definitely thought that too. Its hard seeing everyone else around me grow up while I stay stagnant",
      "created_utc": 1654444751.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ib9jf9t",
      "author": "p1sc3sg1rl13",
      "body": "im 23 and i’m in the same boat as you",
      "created_utc": 1654445179.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ib9vl93",
      "author": "thesadass",
      "body": "Soon to be 24",
      "created_utc": 1654450900.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ib9y0m2",
      "author": "Musicknowsnobounds",
      "body": "27. Eds don't care about your age, love",
      "created_utc": 1654452030.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iba5ov3",
      "author": "Airanar",
      "body": "26 here, still struggling 🥵",
      "created_utc": 1654455687.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iba6hav",
      "author": "puppy_dog_kisses",
      "body": "Also 24. I feel pathetic. But I can gladly say my ED is better than it was at 16. Probably will stick with me as long as I live- just hopefully less a part in my life.",
      "created_utc": 1654456067.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iba8yrl",
      "author": "PrincessJMarie",
      "body": " I’m 22 and even I have a hard time finding people my age struggling.",
      "created_utc": 1654457247.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibac4gk",
      "author": "KellyWild",
      "body": "Try being 35 enjoy your youth lol",
      "created_utc": 1654458769.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibahskv",
      "author": "None",
      "body": "27 about to turn 28 next month. Hello! :)",
      "created_utc": 1654461505.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibaipix",
      "author": "3catznatrenchcoat",
      "body": "You’re not alone hun, I’m almost 25 and I developed mine at 23",
      "created_utc": 1654461953.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibanc2z",
      "author": "CombinationKey4436",
      "body": "26 here❤️",
      "created_utc": 1654464177.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibans95",
      "author": "None",
      "body": "I’m 24, was anorexic for 2+ years and now I don’t know anymore. I switch between only starving and bingeing so 🤡",
      "created_utc": 1654464395.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibaqqd5",
      "author": "ActionJackson1566",
      "body": "28 and feeling the same way. My dietician said the people she treats are mostly mid 20-30s with her oldest client being 73",
      "created_utc": 1654465827.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibb0l6m",
      "author": "Jenny55n",
      "body": "29 here 🙃",
      "created_utc": 1654470813.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibb5gqd",
      "author": "zeePlanck",
      "body": "36. Relapses still happen. But you get out of them sooner",
      "created_utc": 1654473387.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibbcrpe",
      "author": "Discoglitter27",
      "body": "Hi! I'm a 38 year old female with anorexia. It began when I turned 20, and though I've \"recovered\" it never really goes away. I relapsed a couple years ago, but yep, still dealing with this illness daily. You are not alone 🤍",
      "created_utc": 1654477113.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibbdfev",
      "author": "petewentz-from-mcr",
      "body": "I know exactly how you feel! I’ll be 25 next month and I cry about this a lot. Like this isn’t how I was supposed to be… I mean granted I never thought I’d live this long, but I always thought that if I did I’d be a normal adult but I’m still out here restricting, purging, and SHing like I did when I was 15 and I feel like I was supposed to be better by now",
      "created_utc": 1654477452.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibbdhim",
      "author": "ThatIntention1",
      "body": "23 about to be 24 here",
      "created_utc": 1654477481.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibbekvl",
      "author": "Remarkable_Bear2115",
      "body": "18 with unknown Ed and I do not know what to do. I feel crazy for not even knowing what ed I have.",
      "created_utc": 1654478046.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibbg9u2",
      "author": "ScotlyDex",
      "body": "35 here and it controls my every waking move.",
      "created_utc": 1654478904.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibbw0ci",
      "author": "AlternativeSubject36",
      "body": "36 here.",
      "created_utc": 1654487564.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibbz7uo",
      "author": "popcornrocket",
      "body": "28 :(",
      "created_utc": 1654489696.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibc0tj6",
      "author": "LakeEffectGirl",
      "body": "34 here.",
      "created_utc": 1654490822.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibc2e8w",
      "author": "None",
      "body": "27 and too depressed to participate in social media :) you're not alone though!!",
      "created_utc": 1654491981.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibc46k0",
      "author": "rennmismygirl",
      "body": "I’m 28",
      "created_utc": 1654493361.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibc4ijt",
      "author": "capitalismwitch",
      "body": "I’m 25. The oldest person I’ve ever seen in treatment was in her 80s.",
      "created_utc": 1654493622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibcbtyu",
      "author": "drama_lama_mama",
      "body": "25 and didn’t never had an ED until being diagnosed last year.",
      "created_utc": 1654499963.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibcdxuf",
      "author": "monicafawn",
      "body": "28 but I’ve found that the I just keep getting more relaxed and easy going about it with each year that I age as well as being more motivated to put health as a higher priority",
      "created_utc": 1654501962.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibcijqy",
      "author": "hwworldclass",
      "body": "I finally recovered from anorexia at 24. You’re never too old or young for any disorder, and it’s not too late to recover!",
      "created_utc": 1654506473.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibcp5p9",
      "author": "TheresaTer",
      "body": "27 here! I consume a lot of content but barely publish because I am a teacher and aways terrified to end up interacting with some of my students. There a lot of adults with eds but since there is a lot of stigma around it not many speak.",
      "created_utc": 1654512075.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibcqmvj",
      "author": "NovaVentureLane",
      "body": "ironically i just turned 24 .-.",
      "created_utc": 1654513232.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibctdat",
      "author": "Opposite-Birthday69",
      "body": "I’m almost 24 and having an Ed at work is weird because they’re is so much food bonding and I can’t usually partake even if I wanted to because I also have food allergies",
      "created_utc": 1654515300.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibd8z69",
      "author": "katkannabis",
      "body": "I’m 23. I feel you, girl. It can affect anyone, I think teens are just more susceptible, and adults don’t as often seek help. Don’t beat yourself up, we all have our problems to work through and take the time we need to do so.",
      "created_utc": 1654524336.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibdaz2x",
      "author": "justmitzie",
      "body": "I turn 50 in August. Nuff said.",
      "created_utc": 1654525303.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibdc388",
      "author": "40087812",
      "body": "42 checking in!\n20 years on and off of this bullshit.",
      "created_utc": 1654525841.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibdgeui",
      "author": "AlexGRNorth",
      "body": "Going on 24",
      "created_utc": 1654527852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibev1nb",
      "author": "Mashedpotato94",
      "body": "25 here, struggled with Anorexia/ED for over 15 years and am currently at my worst ever and feel absolutely hopeless about recovering. I also feel like a failure for still struggling, but it’s a societal perception that EDs only affect teenagers - that isn’t the truth at all, in fact I think most severe ED patients are usually adults who have been in and out of treatment. I hope these comments have made you feel like you’re not alone, so many of us are struggling, recovery isn’t linear and that’s okay.",
      "created_utc": 1654549749.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibfvd5y",
      "author": "mtngoat92",
      "body": "I'm turning 30 this year and I'm still struggling. You are not alone in this!",
      "created_utc": 1654567577.0,
      "score": 1,
      "context": []
    },
    {
      "id": "idihlji",
      "author": "EchidnaSubstantial60",
      "body": "30 and relapsing hard.",
      "created_utc": 1656038891.0,
      "score": 1,
      "context": []
    },
    {
      "id": "idnhsso",
      "author": "Pinkyashmountain",
      "body": "I’m 24 and starting to develop one and i feel even worse because I feel at 24 I should “be over “ mental and eating disorders. I see it more in the younger girls and i feel I’m “too old” but I don’t know what to do about it",
      "created_utc": 1656131758.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iea0ri8",
      "author": "Dangerous_Cellist328",
      "body": "I’m 33. ED was locked quietly away in a back corner of my brain for the last 15 years, not causing too much trouble, but now postpartum depression has unleashed it in full force. And yes, I feel ridiculous going through this now when I’m trying to juggle kids/house/marriage/career.",
      "created_utc": 1656562106.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jh8vjr8",
      "author": "PerfectSteak1604",
      "body": "33.",
      "created_utc": 1682148843.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ib9hlaq",
      "author": "bo0ogie",
      "body": "this makes my heart so happy. \nreddit is the ONLY media place i talk about my ED. but like all social media ED presence seems (to me) like it’s mostly 15-20 year olds. which is fine, im happy they have a place to vent, but wow does it make me spiral lol",
      "created_utc": 1654444310.0,
      "score": 25,
      "context": [
        {
          "id": "ib9gqqa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1654443903.0
        }
      ]
    },
    {
      "id": "ib9i6nq",
      "author": "puppyface21",
      "body": "Also 29!",
      "created_utc": 1654444591.0,
      "score": 3,
      "context": [
        {
          "id": "ib9gqqa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1654443903.0
        }
      ]
    },
    {
      "id": "ibac81q",
      "author": "Penya23",
      "body": "Hello from another 43 year old who is still struggling, too.",
      "created_utc": 1654458819.0,
      "score": 15,
      "context": [
        {
          "id": "ib9w6xk",
          "author": "bessvix",
          "body": "43 and still struggling",
          "created_utc": 1654451180.0
        }
      ]
    },
    {
      "id": "ibc2ls4",
      "author": "missamethyst1",
      "body": "40 and right there with ya.",
      "created_utc": 1654492140.0,
      "score": 5,
      "context": [
        {
          "id": "ib9w6xk",
          "author": "bessvix",
          "body": "43 and still struggling",
          "created_utc": 1654451180.0
        }
      ]
    },
    {
      "id": "iba5tdt",
      "author": "bo0ogie",
      "body": "EXACTLY!!!! like i want to talk, unfiltered, raw, without sugar coating it all with fake “pro-recovery” bullshit. but like i don’t want some 15 year old seeing me do that and it give them ideas, etc. bc i definitely looked for triggers when i was young",
      "created_utc": 1654455746.0,
      "score": 12,
      "context": [
        {
          "id": "ib9iza3",
          "author": "KenzieValentyne",
          "body": "I’m only 21, but I totally relate. The vast majority of other people with EDs I meet in groups online are 13-16. It makes sense, that’s the group I was in when mine started. I’m just so glad I didn’t seek out these spaces at that age - those poor young kids are so actively pro ED, and I don’t want that. I don’t want to encourage a bunch of young teens to keep doing what they’re doing. I want a place to talk about struggles and share advice to other people *who have already surrendered completely to the disease.* Kids never, ever fall into that category. I want a group that’s not pro ED or pro recovery, just “anything goes in our discussions here” for 18+ only but I really have no luck finding such a thing.",
          "created_utc": 1654444968.0
        }
      ]
    },
    {
      "id": "ibaabzs",
      "author": "runninginbubbles",
      "body": "Aw thats so sad.. can I ask what triggered it??",
      "created_utc": 1654457906.0,
      "score": 6,
      "context": [
        {
          "id": "iba4l2r",
          "author": "caretaker1971",
          "body": "51. Developed anorexia for the first time 2 years ago. I feel ridiculous. Can’t believe at my age, I struggle with this. Sometimes I feel like an imposter. My family doesn’t know. They just think I’m too thin. Too ashamed to tell them. Im working on it with my team.",
          "created_utc": 1654455147.0
        }
      ]
    },
    {
      "id": "ibd4c8l",
      "author": "bo0ogie",
      "body": "thank you for sharing, and i’m so sorry this has happened. but know that you have a community, you are not an imposter. all of us with EDs feel like we’re “faking it” “not sick enough” “an imposter” but know you’re not. and if you need reminders, there are so many great communities here on reddit!",
      "created_utc": 1654521986.0,
      "score": 3,
      "context": [
        {
          "id": "iba4l2r",
          "author": "caretaker1971",
          "body": "51. Developed anorexia for the first time 2 years ago. I feel ridiculous. Can’t believe at my age, I struggle with this. Sometimes I feel like an imposter. My family doesn’t know. They just think I’m too thin. Too ashamed to tell them. Im working on it with my team.",
          "created_utc": 1654455147.0
        }
      ]
    },
    {
      "id": "ibd995r",
      "author": "katkannabis",
      "body": "Oh I just want to hug you 🥺 I am happy to hear you are working on it with help, I know it is so hard to admit to loved ones. Please don’t beat yourself up, you’re doing the best you can and I’m proud of you for that, I’m sure many others are too.",
      "created_utc": 1654524471.0,
      "score": 2,
      "context": [
        {
          "id": "iba4l2r",
          "author": "caretaker1971",
          "body": "51. Developed anorexia for the first time 2 years ago. I feel ridiculous. Can’t believe at my age, I struggle with this. Sometimes I feel like an imposter. My family doesn’t know. They just think I’m too thin. Too ashamed to tell them. Im working on it with my team.",
          "created_utc": 1654455147.0
        }
      ]
    },
    {
      "id": "ibdbgrp",
      "author": "justmitzie",
      "body": "[r/Eatingdisordersover30](https://www.reddit.com/r/Eatingdisordersover30/)\n\n[r/EdAnonymousAdults](https://www.reddit.com/r/EdAnonymousAdults/)",
      "created_utc": 1654525538.0,
      "score": 2,
      "context": [
        {
          "id": "ibbajti",
          "author": "bo0ogie",
          "body": "wait i want to make a group for us if your interested please let me know!!! i desperately need adult ED friends/community that isn’t this fake forced recovery BS. \nplease lmk!!! idk how we could could group bug i WANT IT",
          "created_utc": 1654475995.0
        }
      ]
    },
    {
      "id": "idnhx75",
      "author": "Pinkyashmountain",
      "body": "Me too ! This is where I am and I feel it makes me feel worse about myself and how I look",
      "created_utc": 1656131834.0,
      "score": 2,
      "context": [
        {
          "id": "ib9nx8p",
          "author": "lipstickch4teau",
          "body": "23! I struggled really badly with it as a teenager and recovered for a little bit, but the pandemic has brought out old habits 😔 I find myself in a vicious cycle of starve-binge-starve now…",
          "created_utc": 1654447318.0
        }
      ]
    },
    {
      "id": "ib9yyf0",
      "author": "None",
      "body": "You’re still young! Take this from someone who is older. I wish I had turned it around at 25 it’s never too late - even for me",
      "created_utc": 1654452462.0,
      "score": 2,
      "context": [
        {
          "id": "ib9ogeb",
          "author": "libertybells125",
          "body": "25 here. sad to see so many younger people and i hope they can recover before it consumes their life the way it has mine. just know you are not pathetic for still struggling. it’s a difficult thing for anyone. 🖤 sending love and support",
          "created_utc": 1654447569.0
        }
      ]
    },
    {
      "id": "ibdbz4q",
      "author": "justmitzie",
      "body": "Turning 50. I feel your pain.",
      "created_utc": 1654525786.0,
      "score": 1,
      "context": [
        {
          "id": "ibad62q",
          "author": "BedroomImpossible124",
          "body": "58 😞",
          "created_utc": 1654459277.0
        }
      ]
    },
    {
      "id": "ibffx1v",
      "author": "Coffeegreysky12",
      "body": "your life has so much value and meaning, no matter how old you are. you didn't waste your life. you are here and continuing to fight. I think people who are older and still fighting their illness are strong people.",
      "created_utc": 1654559773.0,
      "score": 2,
      "context": [
        {
          "id": "ib9yulm",
          "author": "None",
          "body": "36 and feeling like I wasted my life. I wish I had turned it around in my 20s you still got time :)",
          "created_utc": 1654452411.0
        }
      ]
    },
    {
      "id": "ibacg6f",
      "author": "bessvix",
      "body": "Hello! Doesn’t it feel like we are getting too old for this shit but recovery just seems more and more unreachable after so many years entrenched in ED behaviours",
      "created_utc": 1654458929.0,
      "score": 8,
      "context": [
        {
          "id": "ib9w6xk",
          "author": "bessvix",
          "body": "43 and still struggling",
          "created_utc": 1654451180.0
        },
        {
          "id": "ibac81q",
          "author": "Penya23",
          "body": "Hello from another 43 year old who is still struggling, too.",
          "created_utc": 1654458819.0
        }
      ]
    },
    {
      "id": "ibabymg",
      "author": "caretaker1971",
      "body": "I grew up in a very abusive home. I have cptsd from years of mental, physical, and sexual abuse. Things I had pushed down and managed to forget. Until something happened that triggered them. I started therapy and the more I talked about my past, the more my emotions and anxiety shut down my body and I couldn’t eat. At first the weight loss made me feel strong. But once this disorder gets it’s hooks in you, it’s takes over. And now I am in a battle between what I know I need to do and what this disorder tells me I want to do. It’s really hard to overcome. I can’t imagine struggling with this as a teenager. Before you really even know who you are. I so admire the sheer courage and strength that it takes for anyone to beat it. For those in recovery, I am in awe of you.",
      "created_utc": 1654458690.0,
      "score": 12,
      "context": [
        {
          "id": "iba4l2r",
          "author": "caretaker1971",
          "body": "51. Developed anorexia for the first time 2 years ago. I feel ridiculous. Can’t believe at my age, I struggle with this. Sometimes I feel like an imposter. My family doesn’t know. They just think I’m too thin. Too ashamed to tell them. Im working on it with my team.",
          "created_utc": 1654455147.0
        },
        {
          "id": "ibaabzs",
          "author": "runninginbubbles",
          "body": "Aw thats so sad.. can I ask what triggered it??",
          "created_utc": 1654457906.0
        }
      ]
    },
    {
      "id": "ibhkuc7",
      "author": "None",
      "body": "Yes you’re right. Sorry this wasn’t meant in a disrespectful at all! I’m still trying to recover. I’m just in a bad headspace where I feel like I wasted my life but that’s completely coming from my own stuff and I didn’t meant it to come across as judgemental to anyone at all. Sorry if it did xx",
      "created_utc": 1654610368.0,
      "score": 1,
      "context": [
        {
          "id": "ib9yulm",
          "author": "None",
          "body": "36 and feeling like I wasted my life. I wish I had turned it around in my 20s you still got time :)",
          "created_utc": 1654452411.0
        },
        {
          "id": "ibffx1v",
          "author": "Coffeegreysky12",
          "body": "your life has so much value and meaning, no matter how old you are. you didn't waste your life. you are here and continuing to fight. I think people who are older and still fighting their illness are strong people.",
          "created_utc": 1654559773.0
        }
      ]
    },
    {
      "id": "ibaif6l",
      "author": "Penya23",
      "body": "One day I'm queen of the world, no issues, no eerie thoughts, no worries...the next day I'm a fucking mess with my hand down my throat.\n\nI like to think of it as balance lol.\n\nAll kidding aside, I am *so* too old for this shit lol",
      "created_utc": 1654461813.0,
      "score": 4,
      "context": [
        {
          "id": "ib9w6xk",
          "author": "bessvix",
          "body": "43 and still struggling",
          "created_utc": 1654451180.0
        },
        {
          "id": "ibac81q",
          "author": "Penya23",
          "body": "Hello from another 43 year old who is still struggling, too.",
          "created_utc": 1654458819.0
        },
        {
          "id": "ibacg6f",
          "author": "bessvix",
          "body": "Hello! Doesn’t it feel like we are getting too old for this shit but recovery just seems more and more unreachable after so many years entrenched in ED behaviours",
          "created_utc": 1654458929.0
        }
      ]
    },
    {
      "id": "ibhtwub",
      "author": "Coffeegreysky12",
      "body": "No need to apologize. your comment made me feel bad for you and I was trying to be supportive in my comment. there is no shame in not being recovered yet. I am not recovered yet either. and I can relate to the struggle of having an eating disorder for a long time and feeling like you can't get better",
      "created_utc": 1654614517.0,
      "score": 2,
      "context": [
        {
          "id": "ib9yulm",
          "author": "None",
          "body": "36 and feeling like I wasted my life. I wish I had turned it around in my 20s you still got time :)",
          "created_utc": 1654452411.0
        },
        {
          "id": "ibffx1v",
          "author": "Coffeegreysky12",
          "body": "your life has so much value and meaning, no matter how old you are. you didn't waste your life. you are here and continuing to fight. I think people who are older and still fighting their illness are strong people.",
          "created_utc": 1654559773.0
        },
        {
          "id": "ibhkuc7",
          "author": "None",
          "body": "Yes you’re right. Sorry this wasn’t meant in a disrespectful at all! I’m still trying to recover. I’m just in a bad headspace where I feel like I wasted my life but that’s completely coming from my own stuff and I didn’t meant it to come across as judgemental to anyone at all. Sorry if it did xx",
          "created_utc": 1654610368.0
        }
      ]
    },
    {
      "id": "ibic5o0",
      "author": "None",
      "body": "Thank you I appreciate it :) yes it definitely can be hard when it’s been so long. But you’re right we are strong and trying to get through it :)",
      "created_utc": 1654622342.0,
      "score": 2,
      "context": [
        {
          "id": "ib9yulm",
          "author": "None",
          "body": "36 and feeling like I wasted my life. I wish I had turned it around in my 20s you still got time :)",
          "created_utc": 1654452411.0
        },
        {
          "id": "ibffx1v",
          "author": "Coffeegreysky12",
          "body": "your life has so much value and meaning, no matter how old you are. you didn't waste your life. you are here and continuing to fight. I think people who are older and still fighting their illness are strong people.",
          "created_utc": 1654559773.0
        },
        {
          "id": "ibhkuc7",
          "author": "None",
          "body": "Yes you’re right. Sorry this wasn’t meant in a disrespectful at all! I’m still trying to recover. I’m just in a bad headspace where I feel like I wasted my life but that’s completely coming from my own stuff and I didn’t meant it to come across as judgemental to anyone at all. Sorry if it did xx",
          "created_utc": 1654610368.0
        },
        {
          "id": "ibhtwub",
          "author": "Coffeegreysky12",
          "body": "No need to apologize. your comment made me feel bad for you and I was trying to be supportive in my comment. there is no shame in not being recovered yet. I am not recovered yet either. and I can relate to the struggle of having an eating disorder for a long time and feeling like you can't get better",
          "created_utc": 1654614517.0
        }
      ]
    }
  ]
}