{
  "id": "vlipjy",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1656290358.0,
  "title": "something that’s been really irritating me lately",
  "selftext": "",
  "url": "https://i.redd.it/ew1u09tlp3891.jpg",
  "score": 269,
  "num_comments": 6,
  "comments": [
    {
      "id": "idvehla",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1656290358.0,
      "score": 1,
      "context": []
    },
    {
      "id": "idvs5aq",
      "author": "Musicknowsnobounds",
      "body": "For reaaaaal!!",
      "created_utc": 1656297051.0,
      "score": 9,
      "context": []
    },
    {
      "id": "idwdljv",
      "author": "None",
      "body": "YEAHHH exactly….. glad somebody pointed this out",
      "created_utc": 1656309798.0,
      "score": 6,
      "context": []
    },
    {
      "id": "idwvy65",
      "author": "highacidcontent",
      "body": "I don't get it, can someone explain?",
      "created_utc": 1656325302.0,
      "score": 2,
      "context": []
    },
    {
      "id": "idwy2x1",
      "author": "None",
      "body": "I actually don’t get the second frame, either. But other than reddit I’m not really interactive with other forms of media/social media. Is this an internet thing? Like people who shun beauty standards also make fun of us, even though they acknowledge the toxicity of beauty standards?",
      "created_utc": 1656326985.0,
      "score": 3,
      "context": [
        {
          "id": "idwvy65",
          "author": "highacidcontent",
          "body": "I don't get it, can someone explain?",
          "created_utc": 1656325302.0
        }
      ]
    },
    {
      "id": "idxrx41",
      "author": "None",
      "body": "the same people that claim to care that beauty standards have awful effects on people will often treat people with anorexia terribly! they act like it’s the fault of ppl with eating disorders that eating disorders exist. as if people with eds talking about their eds online are the villains “convincing” others to become anorexic and not our society. it happens most often on twitter and tiktok. they say they only hate those who glamorize it or are fatphobic but it’s incredibly obvious that they just want a safe group to sink their teeth into, that nobody is going to stand up for. :/",
      "created_utc": 1656342817.0,
      "score": 4,
      "context": [
        {
          "id": "idwvy65",
          "author": "highacidcontent",
          "body": "I don't get it, can someone explain?",
          "created_utc": 1656325302.0
        }
      ]
    }
  ]
}