{
  "id": "vqzrn7",
  "subreddit": "AnorexiaNervosa",
  "author": "Economy_Table_5912",
  "created_utc": 1656911320.0,
  "title": "Jealousy 🥲",
  "selftext": "this might sound really messed up but does anyone else get kind of ig jealous when their are people yk who also suffer from an ED. for example today my best friend was talking abt this boy she knows and she wont stop talking abt how he is “ so skinny” and it triggers me sm because i hate it when ik other people that suffer from an ED because anorexia is like “ my special thing” that has been with me for so long and ig the more i hear people talk abt it the more “ normalised “ it gets and i dont feel special anymore :( \n\n( its messed up ik but it is what it is )",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/vqzrn7/jealousy/",
  "score": 129,
  "num_comments": 16,
  "comments": [
    {
      "id": "ies8xwp",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1656911320.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iesfh5s",
      "author": "None",
      "body": "Yes I understand I have felt like this when I was younger. But now I just feel sad that someone is struggling so much as I know how it feels.",
      "created_utc": 1656915928.0,
      "score": 27,
      "context": []
    },
    {
      "id": "iesp57w",
      "author": "None",
      "body": "Yes i feel like this right now too. It’s because your ED can turn into your identity. I basically traded in my health for social validation but considering losing weight was never the solution, i feel really mad when someone else DOES appear to get the validation i was always chasing.",
      "created_utc": 1656923761.0,
      "score": 25,
      "context": []
    },
    {
      "id": "iesst2u",
      "author": "butterfly2507",
      "body": "i understand,, im like this when anyone in my fam shows sign\n\nactually, off ED topid but THIIISS, this is a big problem of me as a kpop fan. ive been a fan since 2018 and i feel extremely uncomfy when some irls just vibe with it, idk its so freaking weird of mine but i cant teach my brain to stop gatekeeping what isnt mine in the first place\n\nanyway sending hugs to you, i hope your okay. and yes, i hope ed doess not get normalize in the near future. if only normal ppl know.",
      "created_utc": 1656926909.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ietaxg6",
      "author": "Asleep-Letterhead-16",
      "body": "kind of. i also get super competitive (?? i guess?) when j hear that someone else has an ed. my friend said she fasted for three days with no problem and she lost so much weight so fast over that weekend. i should’ve told someone or something but instead i was like ‘wow how did you skip your meals?’ and that was so fucked up of me. i guess i wasn’t sure if she wanted help but nobody with anorexia really wants any help do they?",
      "created_utc": 1656939841.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iev4ymo",
      "author": "boopydoopy2102",
      "body": "no im the same.  its my entire identity at this point, im the \"gay anorexic boy\".  i need to be the thinnest and when i feel im being challenged in that i get really competitive and restrict even harder.  my friend is a recovered anorexic and the anount of pure jealousy i had for them cos they were \"better\" at it than me is honestly embarrassing",
      "created_utc": 1656968704.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ietm9qf",
      "author": "ardel_721",
      "body": "im in the same boat as you. although, it doesn't even feel like \"my thing\" anymore. more like, \"my identity\".",
      "created_utc": 1656945404.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iew7ofr",
      "author": "UnsafeBones",
      "body": "I get it. It’s my identity and it almost feels like someone is trying to be me even when they don’t even know.",
      "created_utc": 1656987619.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ietq6h3",
      "author": "Opposite-Birthday69",
      "body": "I only get jealous because people who don’t have food allergies lose weight faster than me. If I didn’t have an Ed I would be the odd one out in my house. My doctor thinks I’m developing type one diabetes and all I can think of is when it develops further I’ll be the smallest by far in the house bwahhahaha. Side note on that note maybe my mom will believe me when I say I need my A1C tested again because she thinks I’m exaggerating what my doctor said to me. But then again she may be jealous about the initial weight loss. \n\nI guess from my rambling I do get jealous inside my household more but someone has to be very sick outside my home to get jealous over",
      "created_utc": 1656947118.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iesdt7s",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1656914706.0,
      "score": -26,
      "context": []
    },
    {
      "id": "iessssk",
      "author": "Economy_Table_5912",
      "body": "THIS.. except even thought its my personality i shy away from talking abt it or bringing it up its almost internalised",
      "created_utc": 1656926902.0,
      "score": 4,
      "context": [
        {
          "id": "iesp57w",
          "author": "None",
          "body": "Yes i feel like this right now too. It’s because your ED can turn into your identity. I basically traded in my health for social validation but considering losing weight was never the solution, i feel really mad when someone else DOES appear to get the validation i was always chasing.",
          "created_utc": 1656923761.0
        }
      ]
    },
    {
      "id": "iesswd8",
      "author": "Economy_Table_5912",
      "body": "thank u. hopefully ur hanging in their too",
      "created_utc": 1656926987.0,
      "score": 4,
      "context": [
        {
          "id": "iesst2u",
          "author": "butterfly2507",
          "body": "i understand,, im like this when anyone in my fam shows sign\n\nactually, off ED topid but THIIISS, this is a big problem of me as a kpop fan. ive been a fan since 2018 and i feel extremely uncomfy when some irls just vibe with it, idk its so freaking weird of mine but i cant teach my brain to stop gatekeeping what isnt mine in the first place\n\nanyway sending hugs to you, i hope your okay. and yes, i hope ed doess not get normalize in the near future. if only normal ppl know.",
          "created_utc": 1656926909.0
        }
      ]
    },
    {
      "id": "iesip4z",
      "author": "ny33nyaw",
      "body": "OP is venting, there's no need to say this",
      "created_utc": 1656918419.0,
      "score": 23,
      "context": [
        {
          "id": "iesdt7s",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1656914706.0
        }
      ]
    },
    {
      "id": "iesjrgv",
      "author": "Economy_Table_5912",
      "body": "ik it is and trust me i hate myself for it",
      "created_utc": 1656919276.0,
      "score": 11,
      "context": [
        {
          "id": "iesdt7s",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1656914706.0
        }
      ]
    },
    {
      "id": "iesjs3j",
      "author": "Economy_Table_5912",
      "body": "❤️❤️",
      "created_utc": 1656919290.0,
      "score": 13,
      "context": [
        {
          "id": "iesdt7s",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1656914706.0
        },
        {
          "id": "iesip4z",
          "author": "ny33nyaw",
          "body": "OP is venting, there's no need to say this",
          "created_utc": 1656918419.0
        }
      ]
    },
    {
      "id": "iestbqh",
      "author": "busted3000",
      "body": "Please don’t hate yourself for it. It’s part of a disease you didn’t ask to have. You recognise it, and that’s a great thing, you’re not doing this intentionally.",
      "created_utc": 1656927357.0,
      "score": 10,
      "context": [
        {
          "id": "iesdt7s",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1656914706.0
        },
        {
          "id": "iesjrgv",
          "author": "Economy_Table_5912",
          "body": "ik it is and trust me i hate myself for it",
          "created_utc": 1656919276.0
        }
      ]
    }
  ]
}