{
  "id": "wgiym1",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1659665136.0,
  "title": "Do people really ‘forget’ to eat?",
  "selftext": "I’ve don’t think I’ve ever forgotten to eat, only intentionally avoided eating.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/wgiym1/do_people_really_forget_to_eat/",
  "score": 114,
  "num_comments": 56,
  "comments": [
    {
      "id": "ij01616",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1659665137.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij06y8n",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1659667810.0,
      "score": 44,
      "context": []
    },
    {
      "id": "ij0aiyn",
      "author": "eddiemomentos",
      "body": "I understand this completely- I think about food almost 100% of the day and obsess over the times of day I’m “allowed” to eat and such- forgetting without intentionally skipping it isn’t something I can comprehend",
      "created_utc": 1659669588.0,
      "score": 63,
      "context": []
    },
    {
      "id": "ij0aflt",
      "author": "Sulkk3n",
      "body": "My ADHD makes me forget sometimes, but not often",
      "created_utc": 1659669541.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ij0lmfx",
      "author": "isakyaki002",
      "body": "i was always fixated on food at the worst of my anorexia - i would definitely never forget to eat. now i’m like 2 years in recovery and it happens semi-often, if i’m doing something that needs focus etc.",
      "created_utc": 1659675775.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ij0uszb",
      "author": "Allison-Ghost",
      "body": "I have ADHD which is part of what fuels my continuation down this path despite my want to recover... I both intentionally do not eat, forget to eat, and purposely distract myself with something until hours have passed and I realize that I didn't end up eating",
      "created_utc": 1659682081.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ij0z6q5",
      "author": "Brave_Education_9279",
      "body": "I used to forget to eat all day when I had a mentally demandig job. I was hyperfocusing on doing my job right and not fucking up, and i was so stressed about it. The stress made me forget to eat very often. Not fun times.\n\nOr sometimes when i'm caught up in something i enjoy, like playing my favourite video game etc, the hours just pass by without me noticing i'm hungry. But when i got nothing to occupy my mind, i think about food 24/7",
      "created_utc": 1659685470.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij0bl25",
      "author": "dropshotftw",
      "body": "stress has 100% led me to forget to eat one day, and then the next day saying I'll get to it but then running out of time so yeah its easy to forget especially when you have no appetite at all.",
      "created_utc": 1659670125.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ij08lz7",
      "author": "None",
      "body": "Sometimes. Mainly on days when I have alot to do",
      "created_utc": 1659668615.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ij0ezdq",
      "author": "SubtleVegan",
      "body": "I more tend to not have time BC I don't really get breaks at either of my jobs but don't usually forget to at least have dinner so I can function for the next day without too many issues lol",
      "created_utc": 1659671923.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ij349ib",
      "author": "bollysdead",
      "body": "i told my partner i have anorexia and don’t eat a lot and he said “oh yeah i forget to eat sometimes too!” i love that man but that was the single most infuriating thing i’ve ever heard. i do not forget to eat. food is on my mind all day: how many calories it has, when am i allowed to eat, am i gonna faint from not eating, i wonder how much weight i’ve lost from not eating, etc. im not saying people with anorexia don’t forget to eat but that’s not the case with me.",
      "created_utc": 1659724016.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ij0n5kg",
      "author": "sneepsnart",
      "body": "yea, whether its stress or general forgetfulness, its pretty normal among people with lots of stress n stuff",
      "created_utc": 1659676756.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij18xo8",
      "author": "Iliketoread05",
      "body": "I definitely forget to eat eating has always been a chore to me and is not something I think about daily while I do intentionally not eat i also forget to eat",
      "created_utc": 1659693336.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij19vwi",
      "author": "boots4004",
      "body": "99% of the time it's all I think about, but because I'm autistic I have special interests and I can easily sit at my computer researching them for hours and days on end without leaving my room to eat",
      "created_utc": 1659694073.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij1d44v",
      "author": "throw_away22348",
      "body": "Yes people really do i used to before my ed and I've known plenty of people who can get busy or into something and just forget. Some people do and some don't either is normal",
      "created_utc": 1659696450.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij1g4q5",
      "author": "None",
      "body": "Sometimes when I'm really really busy I'll keep thinking \"I'm hungy. I should eat soon\" and I get caught up and forget. This repeats for hours until it's the next day and \"shit when did I last eat?\"",
      "created_utc": 1659698448.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij1hg33",
      "author": "NavissEtpmocia",
      "body": "I do, because I don’t have meals any longer. Like, I have amounts of food for the day. Just like my cats. So when I actually try to reschedule meals and recover, it happens often that I forgot, because I don’t have a clock for meals any longer",
      "created_utc": 1659699256.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij2lw4r",
      "author": "busted3000",
      "body": "I think for people with EDs it’s almost always impossible to forget to eat, but there are some people who genuinely forget, if they’re fixated on other things, have ADHD, don’t have much appetite etc.",
      "created_utc": 1659716995.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij2yaj8",
      "author": "vicki_toria13",
      "body": "I had anorexia for 2 years and I lost my hunger signals so most of the time I never know when I am hungry. Even when I recovered they still were not the same. I still to this day forget to eat because my hunger signals never returned completely. I know I’m hungry when I start feeling bad or really faint and I’m like “oh I guess I’m hungry”. I will usually forget to eat if I drink coffee first thing in the morning and then hours later realize I never ate lunch or breakfast. I have other stomach issues that contribute to this but it stinks because you’ll feel fine and then the next moment you feel like you’re going to blackout and there may not be food around.",
      "created_utc": 1659721722.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij3n3ym",
      "author": "FLYINGDOGS89",
      "body": "I have adhd and can go all day without eating simply cuz I forget. My ed only came into play real bad once I became conscious of it— like if I kept myself busy I would just continue to not even think about it",
      "created_utc": 1659731317.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij4tv6v",
      "author": "junibeeee",
      "body": "i often forget to eat. i have severe adhd and will go the entire day without eating since I don’t feel the physical signs of hunger and executive dysfunction is kicking my ass. i do want to eat since I want my ED to get better, but i just forget all the time :/",
      "created_utc": 1659750312.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij5gdj4",
      "author": "None",
      "body": "I used to feel the same way. The only times I’ve ‘forgotten’ to eat was when I was so stressed my mind could not think about anything else but what was stressing me and I had loads of things to do. Even when I was super stressed, I still thought about eating but I had no appetite and felt sick In my stomach",
      "created_utc": 1659762426.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij0szou",
      "author": "Negative_Truck_4209",
      "body": "I have ADHD, and I forget to all the time (only on my medication though, or unless I’m really hyper focused on something).",
      "created_utc": 1659680731.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ij08dh6",
      "author": "iluvemos69",
      "body": "sometimes",
      "created_utc": 1659668497.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij0d4dx",
      "author": "None",
      "body": "Yes, I do",
      "created_utc": 1659670918.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij1242h",
      "author": "coffee--beans",
      "body": "I forget when I'm not hungry enough to realise",
      "created_utc": 1659687808.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij12czr",
      "author": "dontsummondemons",
      "body": "yes, people really do forget to eat",
      "created_utc": 1659688006.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij25h3s",
      "author": "None",
      "body": "ADHD crew stand up lmao",
      "created_utc": 1659710609.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij2zfxv",
      "author": "thatone111111",
      "body": "yes I’ve legitimately forgotten.",
      "created_utc": 1659722160.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij32wgy",
      "author": "None",
      "body": "Sometimes if I'm so caught up in a project I'll forget to eat, especially around lunch time, but 9 times out of ten I'd say it's intentional starving on my part.",
      "created_utc": 1659723492.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij36xz0",
      "author": "Fuck-being-Alive",
      "body": "Ironically, before my ed, yes.",
      "created_utc": 1659725046.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij37x98",
      "author": "kyxpvz",
      "body": "i mean i tell ppl i “forgot” but i very much didn’t",
      "created_utc": 1659725422.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij389an",
      "author": "BDDventaccount",
      "body": "i’ve never forgotten to eat",
      "created_utc": 1659725550.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij3zs3c",
      "author": "jiyoxa",
      "body": "If you're doing nothing, or actively trying to starve yourself, you'll be obsessed with food. But if you are putting your energy and passion into something else, work, a project, then you may forget to eat. But the thing is, as long as you WANT to forget to eat, you never will.",
      "created_utc": 1659736456.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij474bm",
      "author": "t3quiila",
      "body": "as someone who’s autistic and has struggles deciphering/experiencing hunger cues, yes.",
      "created_utc": 1659739608.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij4ca45",
      "author": "aids-lizard",
      "body": "if i’m busy or really absorbed in something, then yeah i’ll probs just forget. doesn’t happen that often tho.",
      "created_utc": 1659741960.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij4jndi",
      "author": "marainblue",
      "body": "when i used to be in a stressful job i forgot about it but also when i was playing some game in my laptop time just passed and i didn't realize til it was way too late for it",
      "created_utc": 1659745409.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij4mejv",
      "author": "homgerygorl",
      "body": "since i started smoking regularly if i do the combo of caffeine + nicotine + weed + not having eaten before hand it always ends up equaling no food response\n\nand then im always like damn why is this hitting me so hard",
      "created_utc": 1659746729.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij4qabp",
      "author": "raccoonsaff",
      "body": "When I've been really underweight, I'm a lot more focused on food, and wouldn't be able to forget unless I was super super busy. When I'm at a healthier weight, I often forget because - and I think this relates to my autism - I get very engrossed in projects and research.",
      "created_utc": 1659748588.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij5nmm8",
      "author": "CurlyTalk",
      "body": "i dunno. but i’ve sure as hell used this excuse many a time",
      "created_utc": 1659767415.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij8pf2r",
      "author": "Neat-Appointment-979",
      "body": "Yes I definitely do, my hunger cues aren’t the best so that can make me forget to eat. But on the other hand eating to me feels like a chore just food in general, I don’t like it. So sometimes when I do feel hunger the effort it takes to make something isn’t enough and I usually forget about it after a bit.",
      "created_utc": 1659825686.0,
      "score": 1,
      "context": []
    },
    {
      "id": "il6777g",
      "author": "LVUPSLT",
      "body": "Constantly. \n\nSo, I just realized working night shifts have caused me to have anorexia. I didn’t even realize I had a problem until my doctor suggested ai see a nutritionist. Then everything clicked. \n\nI would work nights, eat a big meal sometimes or snacks and end up sleeping the day away…",
      "created_utc": 1661071709.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ij0kzxx",
      "author": "None",
      "body": "That makes sense. I feel like when I was in the depths of my ED I was thinking about food a lot more. So maybe forgetting about food is a sign of recovery in a way :).",
      "created_utc": 1659675386.0,
      "score": 9,
      "context": [
        {
          "id": "ij06y8n",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1659667810.0
        }
      ]
    },
    {
      "id": "ij0kjc8",
      "author": "None",
      "body": "Me too! I love food so much and wish I didn’t.",
      "created_utc": 1659675098.0,
      "score": 14,
      "context": [
        {
          "id": "ij0aiyn",
          "author": "eddiemomentos",
          "body": "I understand this completely- I think about food almost 100% of the day and obsess over the times of day I’m “allowed” to eat and such- forgetting without intentionally skipping it isn’t something I can comprehend",
          "created_utc": 1659669588.0
        }
      ]
    },
    {
      "id": "ij1isfi",
      "author": "xXKungFuSwagMasterXx",
      "body": "I also have ADHD and your experience is almost identical to mine lol",
      "created_utc": 1659700050.0,
      "score": 3,
      "context": [
        {
          "id": "ij0uszb",
          "author": "Allison-Ghost",
          "body": "I have ADHD which is part of what fuels my continuation down this path despite my want to recover... I both intentionally do not eat, forget to eat, and purposely distract myself with something until hours have passed and I realize that I didn't end up eating",
          "created_utc": 1659682081.0
        }
      ]
    },
    {
      "id": "ij3qorf",
      "author": "cieu-2",
      "body": "Also have ADHD and i do this 😭😭",
      "created_utc": 1659732734.0,
      "score": 1,
      "context": [
        {
          "id": "ij0uszb",
          "author": "Allison-Ghost",
          "body": "I have ADHD which is part of what fuels my continuation down this path despite my want to recover... I both intentionally do not eat, forget to eat, and purposely distract myself with something until hours have passed and I realize that I didn't end up eating",
          "created_utc": 1659682081.0
        }
      ]
    },
    {
      "id": "ij2nk67",
      "author": "None",
      "body": "Understandable. I’m sorry your job was like that for you :(. Hopefully things are better for you at your job now",
      "created_utc": 1659717633.0,
      "score": 2,
      "context": [
        {
          "id": "ij0z6q5",
          "author": "Brave_Education_9279",
          "body": "I used to forget to eat all day when I had a mentally demandig job. I was hyperfocusing on doing my job right and not fucking up, and i was so stressed about it. The stress made me forget to eat very often. Not fun times.\n\nOr sometimes when i'm caught up in something i enjoy, like playing my favourite video game etc, the hours just pass by without me noticing i'm hungry. But when i got nothing to occupy my mind, i think about food 24/7",
          "created_utc": 1659685470.0
        }
      ]
    },
    {
      "id": "ij3582l",
      "author": "None",
      "body": "I told someone the other day that I “struggle with my relationship with food” , hoping they would catch my drift but they just responded with “yeah sometimes I forget to have dinner and don’t eat until midnight”. I wasn’t mad but we definitely weren’t on the same plane lol.",
      "created_utc": 1659724386.0,
      "score": 2,
      "context": [
        {
          "id": "ij349ib",
          "author": "bollysdead",
          "body": "i told my partner i have anorexia and don’t eat a lot and he said “oh yeah i forget to eat sometimes too!” i love that man but that was the single most infuriating thing i’ve ever heard. i do not forget to eat. food is on my mind all day: how many calories it has, when am i allowed to eat, am i gonna faint from not eating, i wonder how much weight i’ve lost from not eating, etc. im not saying people with anorexia don’t forget to eat but that’s not the case with me.",
          "created_utc": 1659724016.0
        }
      ]
    },
    {
      "id": "ij2nt2p",
      "author": "None",
      "body": "Wait so you don’t genuinely enjoy food? That’s interesting because I love eating and I wish I didn’t :/",
      "created_utc": 1659717728.0,
      "score": 2,
      "context": [
        {
          "id": "ij18xo8",
          "author": "Iliketoread05",
          "body": "I definitely forget to eat eating has always been a chore to me and is not something I think about daily while I do intentionally not eat i also forget to eat",
          "created_utc": 1659693336.0
        }
      ]
    },
    {
      "id": "ij2o543",
      "author": "None",
      "body": "So when you do eat do you eat a lot because you haven’t eaten in a while? Or do you just eat a normal amount?",
      "created_utc": 1659717856.0,
      "score": 1,
      "context": [
        {
          "id": "ij1g4q5",
          "author": "None",
          "body": "Sometimes when I'm really really busy I'll keep thinking \"I'm hungy. I should eat soon\" and I get caught up and forget. This repeats for hours until it's the next day and \"shit when did I last eat?\"",
          "created_utc": 1659698448.0
        }
      ]
    },
    {
      "id": "ij2ofka",
      "author": "None",
      "body": "I think my problem is I want to be that person even though I know it’s not healthy :(",
      "created_utc": 1659717965.0,
      "score": 1,
      "context": [
        {
          "id": "ij2lw4r",
          "author": "busted3000",
          "body": "I think for people with EDs it’s almost always impossible to forget to eat, but there are some people who genuinely forget, if they’re fixated on other things, have ADHD, don’t have much appetite etc.",
          "created_utc": 1659716995.0
        }
      ]
    },
    {
      "id": "ij35m76",
      "author": "None",
      "body": "Yeah I heard about people losing their hunger signals. I don’t think I ever really lost mine, just got really good at gaslighting myself into believing it wasn’t really there.",
      "created_utc": 1659724535.0,
      "score": 2,
      "context": [
        {
          "id": "ij2yaj8",
          "author": "vicki_toria13",
          "body": "I had anorexia for 2 years and I lost my hunger signals so most of the time I never know when I am hungry. Even when I recovered they still were not the same. I still to this day forget to eat because my hunger signals never returned completely. I know I’m hungry when I start feeling bad or really faint and I’m like “oh I guess I’m hungry”. I will usually forget to eat if I drink coffee first thing in the morning and then hours later realize I never ate lunch or breakfast. I have other stomach issues that contribute to this but it stinks because you’ll feel fine and then the next moment you feel like you’re going to blackout and there may not be food around.",
          "created_utc": 1659721722.0
        }
      ]
    },
    {
      "id": "ij475jp",
      "author": "t3quiila",
      "body": "Also my schedule is insanely busy",
      "created_utc": 1659739624.0,
      "score": 1,
      "context": [
        {
          "id": "ij474bm",
          "author": "t3quiila",
          "body": "as someone who’s autistic and has struggles deciphering/experiencing hunger cues, yes.",
          "created_utc": 1659739608.0
        }
      ]
    },
    {
      "id": "ij36xo8",
      "author": "bollysdead",
      "body": "exactly! my partner is a workaholic and goes like 6 hours before he realizes he hasn’t eaten all day. in the past, before my anorexia, i have forgotten to eat when i’m really wrapped up on a task. now that i do have anorexia, i intentionally do not eat. forgetting to eat is nothing compared to hating yourself so much that you intentionally deprive your body of a basic necessity.",
      "created_utc": 1659725043.0,
      "score": 2,
      "context": [
        {
          "id": "ij349ib",
          "author": "bollysdead",
          "body": "i told my partner i have anorexia and don’t eat a lot and he said “oh yeah i forget to eat sometimes too!” i love that man but that was the single most infuriating thing i’ve ever heard. i do not forget to eat. food is on my mind all day: how many calories it has, when am i allowed to eat, am i gonna faint from not eating, i wonder how much weight i’ve lost from not eating, etc. im not saying people with anorexia don’t forget to eat but that’s not the case with me.",
          "created_utc": 1659724016.0
        },
        {
          "id": "ij3582l",
          "author": "None",
          "body": "I told someone the other day that I “struggle with my relationship with food” , hoping they would catch my drift but they just responded with “yeah sometimes I forget to have dinner and don’t eat until midnight”. I wasn’t mad but we definitely weren’t on the same plane lol.",
          "created_utc": 1659724386.0
        }
      ]
    },
    {
      "id": "ij4d7ud",
      "author": "Iliketoread05",
      "body": "yes i honestly hate it if i could live without ever having to eat I would probably never eat",
      "created_utc": 1659742394.0,
      "score": 2,
      "context": [
        {
          "id": "ij18xo8",
          "author": "Iliketoread05",
          "body": "I definitely forget to eat eating has always been a chore to me and is not something I think about daily while I do intentionally not eat i also forget to eat",
          "created_utc": 1659693336.0
        },
        {
          "id": "ij2nt2p",
          "author": "None",
          "body": "Wait so you don’t genuinely enjoy food? That’s interesting because I love eating and I wish I didn’t :/",
          "created_utc": 1659717728.0
        }
      ]
    },
    {
      "id": "ij44q2j",
      "author": "None",
      "body": "Depends. If I'm hungry? Probably a normal amount. If I'm not I just don't bother. Don't see a point to eat if I'm not hungry.",
      "created_utc": 1659738569.0,
      "score": 2,
      "context": [
        {
          "id": "ij1g4q5",
          "author": "None",
          "body": "Sometimes when I'm really really busy I'll keep thinking \"I'm hungy. I should eat soon\" and I get caught up and forget. This repeats for hours until it's the next day and \"shit when did I last eat?\"",
          "created_utc": 1659698448.0
        },
        {
          "id": "ij2o543",
          "author": "None",
          "body": "So when you do eat do you eat a lot because you haven’t eaten in a while? Or do you just eat a normal amount?",
          "created_utc": 1659717856.0
        }
      ]
    }
  ]
}