{
  "id": "wxi64o",
  "subreddit": "AnorexiaNervosa",
  "author": "hypermobilehannah",
  "created_utc": 1661443658.0,
  "title": "Why are there so many calories in everything?",
  "selftext": "Nothing feels safe to me right now. \n\nNot fruit, not vegetables, nothing. \n\nI find myself feeling angry about this. \n\nI look at the food and tin packets and the nutritional info and just get so **annoyed**. \n\nLike, WHY must there be so many calories in everything? \n\nWhy has no one invented a super low calorie food that I could eat without feeling absolutely disgusting to my core for eating? \n\n/endrant",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/wxi64o/why_are_there_so_many_calories_in_everything/",
  "score": 156,
  "num_comments": 8,
  "comments": [
    {
      "id": "ilqzqiv",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1661443659.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ilry6lj",
      "author": "actualkiwiin88land",
      "body": "I feel you girl.Sometimes I wish humans didn't have to eat",
      "created_utc": 1661456772.0,
      "score": 35,
      "context": []
    },
    {
      "id": "ilr6dsf",
      "author": "cherryvelvetwitch",
      "body": "i’m sorry you’re feeling like this :( it must be really hard right now, i can definitely relate to this. \ni think the goal though would be not for there to be really low calorie foods but for you to not have this guilt or to think about the exact energy in a food. to be able to enjoy your life and not feel disgusting doing something you literally have to do to survive.\n\ni hope one day we can get there to feel like that.\n\nsending you so much love <3",
      "created_utc": 1661446126.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ilra0gx",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1661447470.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ils4yyn",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1661459400.0,
      "score": -1,
      "context": []
    },
    {
      "id": "imp0ust",
      "author": "Accomplished-Today99",
      "body": "Ugh yeah, that i know, because i love chickpeas and hummus, crispy chickpeas and omg...i fear i would get fat again if i ate as many chickpeas as i wanted lol. But as others have mentioned, calories aren't black and white. Take corn for example. You eat it, you can count it as calories, but if you don't really chew ut especially, it pretty much comes out whole, due to the fiber in it. So honestly just try to eat healthy, lots of fiber, and you'll be fine. (My personal opinion, also, in full understanding of why do humans have to have to eat, i'd rather photosynthesize tbh)...",
      "created_utc": 1662057995.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ilx9t0a",
      "author": "None",
      "body": "same i wish we didn't need food",
      "created_utc": 1661549745.0,
      "score": 1,
      "context": [
        {
          "id": "ilry6lj",
          "author": "actualkiwiin88land",
          "body": "I feel you girl.Sometimes I wish humans didn't have to eat",
          "created_utc": 1661456772.0
        }
      ]
    },
    {
      "id": "ils8ezd",
      "author": "Shadowed-Heart",
      "body": "Your post has been removed for rule 10: Do not use any none-time related numbers. \n\nNumbers such as weights and heights may be harmful for the mentality of the users in r/AnorexiaNervosa. Posts violating this rule will not be tolerated. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1661460744.0,
      "score": 1,
      "context": [
        {
          "id": "ilra0gx",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1661447470.0
        }
      ]
    },
    {
      "id": "ils8dzg",
      "author": "Shadowed-Heart",
      "body": "Your post has been removed for rule 1: Do not participate in pro-ed behaviors. \n\nAs doing things like asking for \"ana buddies\" is harmful for members of the r/AnorexiaNervosa community, it is not allowed. Please do not do things like this in the future. \n\nIf you believe there has been a mistake, please MOD MAIL the moderators of r/AnorexiaNervosa with your concerns. \n\nWe suggest that you reread the rules of r/AnorexiaNervosa before posting in the future. Thank you.",
      "created_utc": 1661460734.0,
      "score": 0,
      "context": [
        {
          "id": "ils4yyn",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1661459400.0
        }
      ]
    }
  ]
}