{
  "id": "xz956s",
  "subreddit": "AnorexiaNervosa",
  "author": "TRKevinSpacey",
  "created_utc": 1665278950.0,
  "title": "Husband told me im less attractive to him now",
  "selftext": "I asked him how he felt about my body and that was a mistake. Im at my LW and it hurt so much. He has gained weight recently and I don’t see him any differently. Im still very attracted to him and my attraction towards him has never changed. Weight on others has never bothered me. Im having a hard time. Weirdly enough it makes me want to get worse. Im mad he doesn’t find me attractive. It makes me mad I can’t see myself as unwell. I feel like an ugly bag of bones now. I feel like im some ugly girl with an ugly body and I just want to go die in some cave far away where my appearance doesn’t bother anyone and weight doesn’t matter. Where attractiveness doesn’t matter. Where I don’t matter just me alone where my sickness no longer matters, to anyone.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/xz956s/husband_told_me_im_less_attractive_to_him_now/",
  "score": 114,
  "num_comments": 49,
  "comments": [
    {
      "id": "irkyehh",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1665278950.0,
      "score": 1,
      "context": []
    },
    {
      "id": "irlaajd",
      "author": "None",
      "body": "i find this very strange when someone is focused on appearance when u have an illness. its like someone's partner having cancer and thinking they're unattractive after loosing their hair to chemo. its an illness. and ur body is not ugly either im so sorry </3",
      "created_utc": 1665284907.0,
      "score": 74,
      "context": []
    },
    {
      "id": "irm2r78",
      "author": "venomchylde",
      "body": "Devils advocate here.... it could have been something he said (perhaps not being truthful while saying it) to encourage you to recover? To weight restore? As he may very well be worried and this could be an opportunity in his head for a motivation for you to recover.",
      "created_utc": 1665304376.0,
      "score": 30,
      "context": []
    },
    {
      "id": "irlsoav",
      "author": "MsKidgie",
      "body": "As a restrictive person myself, may I, gently, ask why you asked him this?",
      "created_utc": 1665296493.0,
      "score": 21,
      "context": []
    },
    {
      "id": "irlszr7",
      "author": "sommerniks",
      "body": "I understand this is hurtful. \nOn the other hand: sick people generally are less attractive physically, it's probably some kind of evolutionary protective thing. But the real important question is: does he still love you as a person? \n\nIt sounds like he would be supportive of recovery. But I don't know the whole situation. \n\nMy husband felt I was really unattractive at my high weight... not much higher than the anorexia recovery goal weight they set for me at the centre at some point. I did not reach it then but this was post partum. It hurts to have them not find you attractive and tbh I think the love thing is more important. (And yeah in my case it is a problem)",
      "created_utc": 1665296738.0,
      "score": 19,
      "context": []
    },
    {
      "id": "irm2qsz",
      "author": "hypokondritt",
      "body": "Would you like him to find your sick body hot? Or maybe your healthy body?",
      "created_utc": 1665304368.0,
      "score": 15,
      "context": []
    },
    {
      "id": "irmb2xa",
      "author": "hypokondritt",
      "body": "Would you find your husbands sick, starved body sexually attractive?",
      "created_utc": 1665311546.0,
      "score": 12,
      "context": []
    },
    {
      "id": "irl6puk",
      "author": "thequeeniris",
      "body": "This makes me sad /: your partner should love you unconditionally",
      "created_utc": 1665283102.0,
      "score": 16,
      "context": []
    },
    {
      "id": "irmpvxr",
      "author": "blancheVernon",
      "body": "I know this sounds a little twisted, but consider this:  He may be telling you he’s not attracted to you because he does love you and wants to shake you up into getting healthier.  I’m not saying this is a good idea on his part. It’s a pretty bad idea. But that may be what’s going on in his head.",
      "created_utc": 1665321470.0,
      "score": 3,
      "context": []
    },
    {
      "id": "irot3h8",
      "author": "cincuentaanos",
      "body": "Male perspective: my partner of 30 years has struggled with AN since her teenage years. She's quite healthy now at 54 years old, but I have absolutely seen her at her worst. Most of this happened about 10 years into our relationship, when certain events in her life and family triggered a downward spiral for her.\n\nNo, I didn't find her \"attractive\" at the time. Always loved her for who she was. But the physical attraction wasn't present during this time when, frankly, she looked like near death. Actually in my opinion it would take a very twisted mind to find attraction in that. More than anything I was just worried sick for her. Only wanted her to get better.\n\nEven during those horrible few years she was always beautiful, not ugly. Beautiful<->ugly is a different dimension than (physically/sexually) attractive<->repulsive. You shouldn't conflate the two.",
      "created_utc": 1665352678.0,
      "score": 2,
      "context": []
    },
    {
      "id": "irmzfjl",
      "author": "thequeeniris",
      "body": "As someone who has been at a very HW bc of pregnancy and weight gain, to a very LW bc of mental health and Ana, my husband has made me feel beautiful through it all. I do not support these comments condoning the husbands actions or behaviors. There are ways to get your partner help without admitting that they are less attractive to you.",
      "created_utc": 1665326073.0,
      "score": 1,
      "context": []
    },
    {
      "id": "irlmnzq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1665292238.0,
      "score": 0,
      "context": []
    },
    {
      "id": "irllydh",
      "author": "LoisLaneEl",
      "body": "I’m so sorry. This is horrible. It sounds a bit abusive to me, like he’s trying to make you worse so that you rely more on him. Very toxic. Protect yourself! You are beautiful!",
      "created_utc": 1665291769.0,
      "score": -17,
      "context": []
    },
    {
      "id": "iro2xdh",
      "author": "ExternalSad6169",
      "body": "People’s responses on this thread really worry me. Victim blaming mentality, defending the husband. People should love unconditionally and certainly the husband should not be tearing down the self esteem of an already very sick person. People go through tough times, she doesn’t judge him for gaining wait but has the audacity to call her unattractive when she is clearly unwell. Yeah, that’ll definitely help a seriously vulnerable person to get better 🙄",
      "created_utc": 1665341999.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iroyboo",
      "author": "adraya",
      "body": "Been there! My husband once told me (at my lowest weight) he was not attracted to me.",
      "created_utc": 1665355096.0,
      "score": 1,
      "context": []
    },
    {
      "id": "irxsrna",
      "author": "theantsinyourpants",
      "body": "Either he’s jealous or with you for the wrong reasons",
      "created_utc": 1665521401.0,
      "score": 1,
      "context": []
    },
    {
      "id": "is4ncgd",
      "author": "ClaireVDB",
      "body": "I think he was trying to respect you by telling you something you did not want to hear. I would have found it awful if he said he is more attracted to you now that you are at you LW. That would have kept you from getting better. I know how horrible it is when your brain convinces everyone hates you in some way. You deserve to get better 💖",
      "created_utc": 1665646764.0,
      "score": 1,
      "context": []
    },
    {
      "id": "irnfnch",
      "author": "TRKevinSpacey",
      "body": "It did honestly make me wonder if I did have another type of illness would he just see the illness or the person behind it. Sometimes when he says things like that it makes me feel like all he sees is the illness not his partner. I know people mean well by worrying about my health but they don’t understand the more people focus on my ED the more I think that’s all they care about. I hate being a bother",
      "created_utc": 1665332857.0,
      "score": 5,
      "context": [
        {
          "id": "irlaajd",
          "author": "None",
          "body": "i find this very strange when someone is focused on appearance when u have an illness. its like someone's partner having cancer and thinking they're unattractive after loosing their hair to chemo. its an illness. and ur body is not ugly either im so sorry </3",
          "created_utc": 1665284907.0
        }
      ]
    },
    {
      "id": "irnd0o0",
      "author": "TRKevinSpacey",
      "body": "I think that was his intention but also he was trying to be honest at the same time. He tells me I’m beautiful no matter what but it doesn’t help me feel better because I know I’m beautiful to him and I probably always will be in his eyes no matter what. I know he’s trying to push me to get better but this was not the way lol",
      "created_utc": 1665331814.0,
      "score": 1,
      "context": [
        {
          "id": "irm2r78",
          "author": "venomchylde",
          "body": "Devils advocate here.... it could have been something he said (perhaps not being truthful while saying it) to encourage you to recover? To weight restore? As he may very well be worried and this could be an opportunity in his head for a motivation for you to recover.",
          "created_utc": 1665304376.0
        }
      ]
    },
    {
      "id": "irlt9dw",
      "author": "Dangerous_Owl_1858",
      "body": "I do this with my partner too. he is my partner, so I want to know his opinion on my changing body. and also it can be validating to know if I'm skinnier honestly..",
      "created_utc": 1665296941.0,
      "score": 12,
      "context": [
        {
          "id": "irlsoav",
          "author": "MsKidgie",
          "body": "As a restrictive person myself, may I, gently, ask why you asked him this?",
          "created_utc": 1665296493.0
        }
      ]
    },
    {
      "id": "irnenyn",
      "author": "TRKevinSpacey",
      "body": "I guess like you said why you did it before I was setting him and me up. I have mental health issues (obviously) and sometimes I get delusional and think the best way to get the truth is by getting him in a corner and tbh to hear him tell me how sick I am to validate me then I get upset and then I just restrict more to punish myself. I admit it was wrong and I should’ve asked him how he felt about my ED but I just went for the one I felt was easier to get a ride out of both me and him. Feels bad when you look at it that way tho",
      "created_utc": 1665332484.0,
      "score": 3,
      "context": [
        {
          "id": "irlsoav",
          "author": "MsKidgie",
          "body": "As a restrictive person myself, may I, gently, ask why you asked him this?",
          "created_utc": 1665296493.0
        }
      ]
    },
    {
      "id": "irndweu",
      "author": "TRKevinSpacey",
      "body": "He would definitely be supportive and is encouraging me to stick to my meal plans and fulfill my meal  goals. It just hurts to hear that the one person that you put make up on for or wear that cute bra for or spend your morning doing your hair for doesn’t find you as attractive. It’s shallow and stupid but it’s been on my mind all week. I keep thinking maybe if I do my hair differently or wear cuter clothes he’ll think I look great but it’s not about that it’s about my weight",
      "created_utc": 1665332172.0,
      "score": 4,
      "context": [
        {
          "id": "irlszr7",
          "author": "sommerniks",
          "body": "I understand this is hurtful. \nOn the other hand: sick people generally are less attractive physically, it's probably some kind of evolutionary protective thing. But the real important question is: does he still love you as a person? \n\nIt sounds like he would be supportive of recovery. But I don't know the whole situation. \n\nMy husband felt I was really unattractive at my high weight... not much higher than the anorexia recovery goal weight they set for me at the centre at some point. I did not reach it then but this was post partum. It hurts to have them not find you attractive and tbh I think the love thing is more important. (And yeah in my case it is a problem)",
          "created_utc": 1665296738.0
        }
      ]
    },
    {
      "id": "irnh390",
      "author": "TRKevinSpacey",
      "body": "As much as I’d like to say “of course not!” I’d be a liar if I did. Part of me wants him to like my body and be my biggest cheerleader into getting me sicker and sicker. It’s fucked up but of course I’d rather be okay with a healthy body he finds attractive but my mind doesn’t think my healthy body is attractive.",
      "created_utc": 1665333428.0,
      "score": 3,
      "context": [
        {
          "id": "irm2qsz",
          "author": "hypokondritt",
          "body": "Would you like him to find your sick body hot? Or maybe your healthy body?",
          "created_utc": 1665304368.0
        }
      ]
    },
    {
      "id": "irm5579",
      "author": "LiliumTheCrevette",
      "body": "Well, just because you aren't feeling as attracted to somebody's - or rather your partner's - physique any more or at least not as much as you once did, doesn't mean you're not able to love that person anymore.\nHe shouldn't have stopped loving OP because of their weight, why should he? I suppose he just answered the question honestly and I think that is a good sign. At least he isn't lying to them. \nI'd encourage OP to try and seek help from a therapist if they don't have one yet, and talk to their husband too on the matter. If he knows the problem, it's easier for both of you to cope and tackle the respective problem zones. \nHope I could help you, OP!",
      "created_utc": 1665306366.0,
      "score": 15,
      "context": [
        {
          "id": "irl6puk",
          "author": "thequeeniris",
          "body": "This makes me sad /: your partner should love you unconditionally",
          "created_utc": 1665283102.0
        }
      ]
    },
    {
      "id": "irnif6y",
      "author": "TRKevinSpacey",
      "body": "I think this is definitely it. I’m his second relationship ever so sometimes he doesn’t know how to treat me because he’s never had experience. He will sometimes say the wrong thing and I let it slide but this was different. Having someone look me in the eye and tell me I’m less attractive to them now can really be a blow to my self esteem which is already very low",
      "created_utc": 1665333960.0,
      "score": 3,
      "context": [
        {
          "id": "irmpvxr",
          "author": "blancheVernon",
          "body": "I know this sounds a little twisted, but consider this:  He may be telling you he’s not attracted to you because he does love you and wants to shake you up into getting healthier.  I’m not saying this is a good idea on his part. It’s a pretty bad idea. But that may be what’s going on in his head.",
          "created_utc": 1665321470.0
        }
      ]
    },
    {
      "id": "irniqjf",
      "author": "TRKevinSpacey",
      "body": "Some fucking sanity thank you. I get what he means but that doesn’t make it okay and it’s not going to suddenly push me into getting help. Like wtf is wrong with some people ugh! Sorry didn’t mean to go off on you I’m still mad my bones aren’t ✨cute✨",
      "created_utc": 1665334086.0,
      "score": 1,
      "context": [
        {
          "id": "irmzfjl",
          "author": "thequeeniris",
          "body": "As someone who has been at a very HW bc of pregnancy and weight gain, to a very LW bc of mental health and Ana, my husband has made me feel beautiful through it all. I do not support these comments condoning the husbands actions or behaviors. There are ways to get your partner help without admitting that they are less attractive to you.",
          "created_utc": 1665326073.0
        }
      ]
    },
    {
      "id": "irls88s",
      "author": "sommerniks",
      "body": "She asked him.",
      "created_utc": 1665296174.0,
      "score": 14,
      "context": [
        {
          "id": "irlmnzq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1665292238.0
        }
      ]
    },
    {
      "id": "irnhfpd",
      "author": "TRKevinSpacey",
      "body": "He didn’t really think twice about it and when he saw me crying he didn’t know what to say either. He’s having a hard time deal with my ED too and honestly it’s been tearing us apart. I can see his perspective of trying to make me want to get help but I don’t know how to explain to people that’s not helpful it’s just hurtful",
      "created_utc": 1665333565.0,
      "score": 1,
      "context": [
        {
          "id": "irlmnzq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1665292238.0
        }
      ]
    },
    {
      "id": "irlzjbi",
      "author": "Oxiiana",
      "body": "How is it abuse though? ED affects those around the sufferer too. Of course it hurts to see your loved one wither in front of you. It hurts to be the one with the ED. I experience both sides of this. Sometimes people say things out of frustration, fear, love. Attraction can be an integral part for a lot of people. I hear many say “but should find me attractive at any weight, dress etc”. But not everyone does. \nLabelling this as abuse without any further information is just as damaging. People love to throw that word around, and whilst yes hearing what he said can be hurtful. It’s not just the person with the ED in this.",
      "created_utc": 1665301867.0,
      "score": 17,
      "context": [
        {
          "id": "irllydh",
          "author": "LoisLaneEl",
          "body": "I’m so sorry. This is horrible. It sounds a bit abusive to me, like he’s trying to make you worse so that you rely more on him. Very toxic. Protect yourself! You are beautiful!",
          "created_utc": 1665291769.0
        }
      ]
    },
    {
      "id": "irnhz4y",
      "author": "TRKevinSpacey",
      "body": "Things are quite toxic atm. Sometimes I feel like he wants me around just to have a partner but now that he has one he wants me to be okay and happy and healthy but I just can’t be that for him. He shouldn’t rely on me to be the perfect wife",
      "created_utc": 1665333783.0,
      "score": 1,
      "context": [
        {
          "id": "irllydh",
          "author": "LoisLaneEl",
          "body": "I’m so sorry. This is horrible. It sounds a bit abusive to me, like he’s trying to make you worse so that you rely more on him. Very toxic. Protect yourself! You are beautiful!",
          "created_utc": 1665291769.0
        }
      ]
    },
    {
      "id": "iroj7sl",
      "author": "MsKidgie",
      "body": "Loved unconditionally is pretty damned difficult (are you being literal? No matter what your partner does, you’ll love them? Anything? That’s unconditional, no less), but that wasn’t the question. It wasn’t “do you still love me at this weight?”",
      "created_utc": 1665348416.0,
      "score": 4,
      "context": [
        {
          "id": "iro2xdh",
          "author": "ExternalSad6169",
          "body": "People’s responses on this thread really worry me. Victim blaming mentality, defending the husband. People should love unconditionally and certainly the husband should not be tearing down the self esteem of an already very sick person. People go through tough times, she doesn’t judge him for gaining wait but has the audacity to call her unattractive when she is clearly unwell. Yeah, that’ll definitely help a seriously vulnerable person to get better 🙄",
          "created_utc": 1665341999.0
        }
      ]
    },
    {
      "id": "iro3prw",
      "author": "TRKevinSpacey",
      "body": "Thank you finally someone who gets it. He told me he only said it because he wants me to be healthy and it’s like what the actual fuck? How can telling me I’m less attractive make me feel like getting better? I already hate what I see in the mirror now I know he doesn’t like it either its humiliating in a sense",
      "created_utc": 1665342309.0,
      "score": 0,
      "context": [
        {
          "id": "iro2xdh",
          "author": "ExternalSad6169",
          "body": "People’s responses on this thread really worry me. Victim blaming mentality, defending the husband. People should love unconditionally and certainly the husband should not be tearing down the self esteem of an already very sick person. People go through tough times, she doesn’t judge him for gaining wait but has the audacity to call her unattractive when she is clearly unwell. Yeah, that’ll definitely help a seriously vulnerable person to get better 🙄",
          "created_utc": 1665341999.0
        }
      ]
    },
    {
      "id": "iro6fkc",
      "author": "venomchylde",
      "body": "I think with him sharing how beautiful you are in every way that you are, then this was a frantic effort to see a way to help you recover. I know it's not the way but as long as you can see the intention.... it's all from love and caring.",
      "created_utc": 1665343382.0,
      "score": 4,
      "context": [
        {
          "id": "irm2r78",
          "author": "venomchylde",
          "body": "Devils advocate here.... it could have been something he said (perhaps not being truthful while saying it) to encourage you to recover? To weight restore? As he may very well be worried and this could be an opportunity in his head for a motivation for you to recover.",
          "created_utc": 1665304376.0
        },
        {
          "id": "irnd0o0",
          "author": "TRKevinSpacey",
          "body": "I think that was his intention but also he was trying to be honest at the same time. He tells me I’m beautiful no matter what but it doesn’t help me feel better because I know I’m beautiful to him and I probably always will be in his eyes no matter what. I know he’s trying to push me to get better but this was not the way lol",
          "created_utc": 1665331814.0
        }
      ]
    },
    {
      "id": "irltipc",
      "author": "MsKidgie",
      "body": "For me, I’m setting both of us up when I do this. I’m learning to focus on actions that tell me and show me, vs putting him on the spot.",
      "created_utc": 1665297123.0,
      "score": 15,
      "context": [
        {
          "id": "irlsoav",
          "author": "MsKidgie",
          "body": "As a restrictive person myself, may I, gently, ask why you asked him this?",
          "created_utc": 1665296493.0
        },
        {
          "id": "irlt9dw",
          "author": "Dangerous_Owl_1858",
          "body": "I do this with my partner too. he is my partner, so I want to know his opinion on my changing body. and also it can be validating to know if I'm skinnier honestly..",
          "created_utc": 1665296941.0
        }
      ]
    },
    {
      "id": "iroi7nu",
      "author": "MsKidgie",
      "body": "Honest action is uncomfortable. Oh, do I know that firsthand. I hear you and I understand. Overall, though, it’s been better to acknowledge it and work with it. Not that I like it…struggling a good bit here. Hugs.",
      "created_utc": 1665348003.0,
      "score": 2,
      "context": [
        {
          "id": "irlsoav",
          "author": "MsKidgie",
          "body": "As a restrictive person myself, may I, gently, ask why you asked him this?",
          "created_utc": 1665296493.0
        },
        {
          "id": "irnenyn",
          "author": "TRKevinSpacey",
          "body": "I guess like you said why you did it before I was setting him and me up. I have mental health issues (obviously) and sometimes I get delusional and think the best way to get the truth is by getting him in a corner and tbh to hear him tell me how sick I am to validate me then I get upset and then I just restrict more to punish myself. I admit it was wrong and I should’ve asked him how he felt about my ED but I just went for the one I felt was easier to get a ride out of both me and him. Feels bad when you look at it that way tho",
          "created_utc": 1665332484.0
        }
      ]
    },
    {
      "id": "irng6rj",
      "author": "h0lycowabunga",
      "body": "I’ve been through this as well. I remember feeling stuck and worthless, which just made it all worse, of course! I would try to remember: he still thinks you’re beautiful, he just doesn’t think you restricting yourself is beautiful. He still loves you, he just wants you to love yourself too. It can be really difficult for a partner to navigate these waters, there’s no manual, so they’re gonna inevitably say or do the wrong thing sometimes. Help him out by letting him know, and try your best to help yourself along the way.",
      "created_utc": 1665333074.0,
      "score": 4,
      "context": [
        {
          "id": "irlszr7",
          "author": "sommerniks",
          "body": "I understand this is hurtful. \nOn the other hand: sick people generally are less attractive physically, it's probably some kind of evolutionary protective thing. But the real important question is: does he still love you as a person? \n\nIt sounds like he would be supportive of recovery. But I don't know the whole situation. \n\nMy husband felt I was really unattractive at my high weight... not much higher than the anorexia recovery goal weight they set for me at the centre at some point. I did not reach it then but this was post partum. It hurts to have them not find you attractive and tbh I think the love thing is more important. (And yeah in my case it is a problem)",
          "created_utc": 1665296738.0
        },
        {
          "id": "irndweu",
          "author": "TRKevinSpacey",
          "body": "He would definitely be supportive and is encouraging me to stick to my meal plans and fulfill my meal  goals. It just hurts to hear that the one person that you put make up on for or wear that cute bra for or spend your morning doing your hair for doesn’t find you as attractive. It’s shallow and stupid but it’s been on my mind all week. I keep thinking maybe if I do my hair differently or wear cuter clothes he’ll think I look great but it’s not about that it’s about my weight",
          "created_utc": 1665332172.0
        }
      ]
    },
    {
      "id": "irnt79g",
      "author": "sommerniks",
      "body": "Oh but I do make up and hair and nice clothes for me not for him. His opinion is less relevant if I enjoy what I am wearing.",
      "created_utc": 1665338220.0,
      "score": 2,
      "context": [
        {
          "id": "irlszr7",
          "author": "sommerniks",
          "body": "I understand this is hurtful. \nOn the other hand: sick people generally are less attractive physically, it's probably some kind of evolutionary protective thing. But the real important question is: does he still love you as a person? \n\nIt sounds like he would be supportive of recovery. But I don't know the whole situation. \n\nMy husband felt I was really unattractive at my high weight... not much higher than the anorexia recovery goal weight they set for me at the centre at some point. I did not reach it then but this was post partum. It hurts to have them not find you attractive and tbh I think the love thing is more important. (And yeah in my case it is a problem)",
          "created_utc": 1665296738.0
        },
        {
          "id": "irndweu",
          "author": "TRKevinSpacey",
          "body": "He would definitely be supportive and is encouraging me to stick to my meal plans and fulfill my meal  goals. It just hurts to hear that the one person that you put make up on for or wear that cute bra for or spend your morning doing your hair for doesn’t find you as attractive. It’s shallow and stupid but it’s been on my mind all week. I keep thinking maybe if I do my hair differently or wear cuter clothes he’ll think I look great but it’s not about that it’s about my weight",
          "created_utc": 1665332172.0
        }
      ]
    },
    {
      "id": "irmy3mj",
      "author": "thequeeniris",
      "body": "I don’t agree. My partner still told me he thought I was beautiful and made me feel attractive at my LW through my HW. I think it’s a bad sign he would say that. What happens if someone’s pregnant and at their HW? Or if your partner gets cancer and is bald, on chemo, and at their LW? Or at their LW bc of a disease from Ana or Mia? Your partner should make you feel attractive in all of your forms and worship your body no matter what state it’s in. Period.",
      "created_utc": 1665325486.0,
      "score": 1,
      "context": [
        {
          "id": "irl6puk",
          "author": "thequeeniris",
          "body": "This makes me sad /: your partner should love you unconditionally",
          "created_utc": 1665283102.0
        },
        {
          "id": "irm5579",
          "author": "LiliumTheCrevette",
          "body": "Well, just because you aren't feeling as attracted to somebody's - or rather your partner's - physique any more or at least not as much as you once did, doesn't mean you're not able to love that person anymore.\nHe shouldn't have stopped loving OP because of their weight, why should he? I suppose he just answered the question honestly and I think that is a good sign. At least he isn't lying to them. \nI'd encourage OP to try and seek help from a therapist if they don't have one yet, and talk to their husband too on the matter. If he knows the problem, it's easier for both of you to cope and tackle the respective problem zones. \nHope I could help you, OP!",
          "created_utc": 1665306366.0
        }
      ]
    },
    {
      "id": "iro030t",
      "author": "LoisLaneEl",
      "body": "I apologize. I guess I’m coming from the view of other mental health issues where someone prefers the person be unstable so they are in control of the relationship and can have the upper hand at any time by saying “you’re sick” or “you’re not in your right mind” or something similar.",
      "created_utc": 1665340883.0,
      "score": 1,
      "context": [
        {
          "id": "irllydh",
          "author": "LoisLaneEl",
          "body": "I’m so sorry. This is horrible. It sounds a bit abusive to me, like he’s trying to make you worse so that you rely more on him. Very toxic. Protect yourself! You are beautiful!",
          "created_utc": 1665291769.0
        },
        {
          "id": "irlzjbi",
          "author": "Oxiiana",
          "body": "How is it abuse though? ED affects those around the sufferer too. Of course it hurts to see your loved one wither in front of you. It hurts to be the one with the ED. I experience both sides of this. Sometimes people say things out of frustration, fear, love. Attraction can be an integral part for a lot of people. I hear many say “but should find me attractive at any weight, dress etc”. But not everyone does. \nLabelling this as abuse without any further information is just as damaging. People love to throw that word around, and whilst yes hearing what he said can be hurtful. It’s not just the person with the ED in this.",
          "created_utc": 1665301867.0
        }
      ]
    },
    {
      "id": "iroxg2i",
      "author": "ExternalSad6169",
      "body": "Obviously I mean with respect to aesthetics, you should hardly love somebody abusive/seriously problematic, but you’re missing the point. People grow old, people get sick, get pregnant, people gain/lose weight, shit happens - nobody is beautiful forever. I find it very hard to believe that someone acting in the best interest of their suffering SO would willingly tell them that they find them unattractive even if they ask. Thinking they look unhealthy and worrying for them maybe, but unattractive? I could think of nothing more crushing and insensitive to tell someone suffering from an ED, especially someone you supposedly love. Sometimes crude honesty is not always the best policy imo.",
      "created_utc": 1665354683.0,
      "score": 2,
      "context": [
        {
          "id": "iro2xdh",
          "author": "ExternalSad6169",
          "body": "People’s responses on this thread really worry me. Victim blaming mentality, defending the husband. People should love unconditionally and certainly the husband should not be tearing down the self esteem of an already very sick person. People go through tough times, she doesn’t judge him for gaining wait but has the audacity to call her unattractive when she is clearly unwell. Yeah, that’ll definitely help a seriously vulnerable person to get better 🙄",
          "created_utc": 1665341999.0
        },
        {
          "id": "iroj7sl",
          "author": "MsKidgie",
          "body": "Loved unconditionally is pretty damned difficult (are you being literal? No matter what your partner does, you’ll love them? Anything? That’s unconditional, no less), but that wasn’t the question. It wasn’t “do you still love me at this weight?”",
          "created_utc": 1665348416.0
        }
      ]
    },
    {
      "id": "irogt9i",
      "author": "TRKevinSpacey",
      "body": "Yeah and I guess it’s hard to see it that way when it feels like everyone hates you for one reason or another. It’s like in my brain I can see how he’s trying but I just take it as I’m gross and that’s all I feel",
      "created_utc": 1665347425.0,
      "score": 1,
      "context": [
        {
          "id": "irm2r78",
          "author": "venomchylde",
          "body": "Devils advocate here.... it could have been something he said (perhaps not being truthful while saying it) to encourage you to recover? To weight restore? As he may very well be worried and this could be an opportunity in his head for a motivation for you to recover.",
          "created_utc": 1665304376.0
        },
        {
          "id": "irnd0o0",
          "author": "TRKevinSpacey",
          "body": "I think that was his intention but also he was trying to be honest at the same time. He tells me I’m beautiful no matter what but it doesn’t help me feel better because I know I’m beautiful to him and I probably always will be in his eyes no matter what. I know he’s trying to push me to get better but this was not the way lol",
          "created_utc": 1665331814.0
        },
        {
          "id": "iro6fkc",
          "author": "venomchylde",
          "body": "I think with him sharing how beautiful you are in every way that you are, then this was a frantic effort to see a way to help you recover. I know it's not the way but as long as you can see the intention.... it's all from love and caring.",
          "created_utc": 1665343382.0
        }
      ]
    },
    {
      "id": "irltrxq",
      "author": "Dangerous_Owl_1858",
      "body": "\"setting both of us up\" is also a part of my mental illness sadly. but I understand what you mean.",
      "created_utc": 1665297314.0,
      "score": 8,
      "context": [
        {
          "id": "irlsoav",
          "author": "MsKidgie",
          "body": "As a restrictive person myself, may I, gently, ask why you asked him this?",
          "created_utc": 1665296493.0
        },
        {
          "id": "irlt9dw",
          "author": "Dangerous_Owl_1858",
          "body": "I do this with my partner too. he is my partner, so I want to know his opinion on my changing body. and also it can be validating to know if I'm skinnier honestly..",
          "created_utc": 1665296941.0
        },
        {
          "id": "irltipc",
          "author": "MsKidgie",
          "body": "For me, I’m setting both of us up when I do this. I’m learning to focus on actions that tell me and show me, vs putting him on the spot.",
          "created_utc": 1665297123.0
        }
      ]
    },
    {
      "id": "irnt9bn",
      "author": "sommerniks",
      "body": "This is well said.",
      "created_utc": 1665338242.0,
      "score": 3,
      "context": [
        {
          "id": "irlszr7",
          "author": "sommerniks",
          "body": "I understand this is hurtful. \nOn the other hand: sick people generally are less attractive physically, it's probably some kind of evolutionary protective thing. But the real important question is: does he still love you as a person? \n\nIt sounds like he would be supportive of recovery. But I don't know the whole situation. \n\nMy husband felt I was really unattractive at my high weight... not much higher than the anorexia recovery goal weight they set for me at the centre at some point. I did not reach it then but this was post partum. It hurts to have them not find you attractive and tbh I think the love thing is more important. (And yeah in my case it is a problem)",
          "created_utc": 1665296738.0
        },
        {
          "id": "irndweu",
          "author": "TRKevinSpacey",
          "body": "He would definitely be supportive and is encouraging me to stick to my meal plans and fulfill my meal  goals. It just hurts to hear that the one person that you put make up on for or wear that cute bra for or spend your morning doing your hair for doesn’t find you as attractive. It’s shallow and stupid but it’s been on my mind all week. I keep thinking maybe if I do my hair differently or wear cuter clothes he’ll think I look great but it’s not about that it’s about my weight",
          "created_utc": 1665332172.0
        },
        {
          "id": "irng6rj",
          "author": "h0lycowabunga",
          "body": "I’ve been through this as well. I remember feeling stuck and worthless, which just made it all worse, of course! I would try to remember: he still thinks you’re beautiful, he just doesn’t think you restricting yourself is beautiful. He still loves you, he just wants you to love yourself too. It can be really difficult for a partner to navigate these waters, there’s no manual, so they’re gonna inevitably say or do the wrong thing sometimes. Help him out by letting him know, and try your best to help yourself along the way.",
          "created_utc": 1665333074.0
        }
      ]
    },
    {
      "id": "irn4y90",
      "author": "LiliumTheCrevette",
      "body": "Well, I just think it is reasonable if somebody states what he truly thinks about one's appearance after being asked and if OP's husband does not find that certain weight on them to be attractive to him, then it's his (honest) opinion. It doesn't mean he cannot appreciate their body anymore. \nIt is great to hear that your partner supports/supported you so much! But bear in mind that a partner has no obligation to find you attractive at all times - they're an individual human being and as such I don't think anyone has to worship anyone's body unconditionally. People - as well as their perception of the world and everyone around them - often change over time. It is completely normal. And similarly, that means that just because you find a certain person attractive at a healthy weight it may be that at an unhealthy one - extremely low or high - the attraction fades. There's nothing wrong with it.",
      "created_utc": 1665328480.0,
      "score": 5,
      "context": [
        {
          "id": "irl6puk",
          "author": "thequeeniris",
          "body": "This makes me sad /: your partner should love you unconditionally",
          "created_utc": 1665283102.0
        },
        {
          "id": "irm5579",
          "author": "LiliumTheCrevette",
          "body": "Well, just because you aren't feeling as attracted to somebody's - or rather your partner's - physique any more or at least not as much as you once did, doesn't mean you're not able to love that person anymore.\nHe shouldn't have stopped loving OP because of their weight, why should he? I suppose he just answered the question honestly and I think that is a good sign. At least he isn't lying to them. \nI'd encourage OP to try and seek help from a therapist if they don't have one yet, and talk to their husband too on the matter. If he knows the problem, it's easier for both of you to cope and tackle the respective problem zones. \nHope I could help you, OP!",
          "created_utc": 1665306366.0
        },
        {
          "id": "irmy3mj",
          "author": "thequeeniris",
          "body": "I don’t agree. My partner still told me he thought I was beautiful and made me feel attractive at my LW through my HW. I think it’s a bad sign he would say that. What happens if someone’s pregnant and at their HW? Or if your partner gets cancer and is bald, on chemo, and at their LW? Or at their LW bc of a disease from Ana or Mia? Your partner should make you feel attractive in all of your forms and worship your body no matter what state it’s in. Period.",
          "created_utc": 1665325486.0
        }
      ]
    },
    {
      "id": "irphnry",
      "author": "MsKidgie",
      "body": "Love and attraction are different.",
      "created_utc": 1665364365.0,
      "score": 3,
      "context": [
        {
          "id": "iro2xdh",
          "author": "ExternalSad6169",
          "body": "People’s responses on this thread really worry me. Victim blaming mentality, defending the husband. People should love unconditionally and certainly the husband should not be tearing down the self esteem of an already very sick person. People go through tough times, she doesn’t judge him for gaining wait but has the audacity to call her unattractive when she is clearly unwell. Yeah, that’ll definitely help a seriously vulnerable person to get better 🙄",
          "created_utc": 1665341999.0
        },
        {
          "id": "iroj7sl",
          "author": "MsKidgie",
          "body": "Loved unconditionally is pretty damned difficult (are you being literal? No matter what your partner does, you’ll love them? Anything? That’s unconditional, no less), but that wasn’t the question. It wasn’t “do you still love me at this weight?”",
          "created_utc": 1665348416.0
        },
        {
          "id": "iroxg2i",
          "author": "ExternalSad6169",
          "body": "Obviously I mean with respect to aesthetics, you should hardly love somebody abusive/seriously problematic, but you’re missing the point. People grow old, people get sick, get pregnant, people gain/lose weight, shit happens - nobody is beautiful forever. I find it very hard to believe that someone acting in the best interest of their suffering SO would willingly tell them that they find them unattractive even if they ask. Thinking they look unhealthy and worrying for them maybe, but unattractive? I could think of nothing more crushing and insensitive to tell someone suffering from an ED, especially someone you supposedly love. Sometimes crude honesty is not always the best policy imo.",
          "created_utc": 1665354683.0
        }
      ]
    },
    {
      "id": "irqkneu",
      "author": "venomchylde",
      "body": "I definitely understand that's how you feel and yes he went about this the wrong way. I do understand having a brain that thinks every action, word, look even, is fueled by disgust and hatred. He knows you best, knows you are beautiful. I feel like this was his last ditch (and not well thought out) effort to motivate you to weight restore. I do know it's hurtful and harmful all the same... but hey, you're beautiful every single way you are and he shares that with you :)",
      "created_utc": 1665389005.0,
      "score": 1,
      "context": [
        {
          "id": "irm2r78",
          "author": "venomchylde",
          "body": "Devils advocate here.... it could have been something he said (perhaps not being truthful while saying it) to encourage you to recover? To weight restore? As he may very well be worried and this could be an opportunity in his head for a motivation for you to recover.",
          "created_utc": 1665304376.0
        },
        {
          "id": "irnd0o0",
          "author": "TRKevinSpacey",
          "body": "I think that was his intention but also he was trying to be honest at the same time. He tells me I’m beautiful no matter what but it doesn’t help me feel better because I know I’m beautiful to him and I probably always will be in his eyes no matter what. I know he’s trying to push me to get better but this was not the way lol",
          "created_utc": 1665331814.0
        },
        {
          "id": "iro6fkc",
          "author": "venomchylde",
          "body": "I think with him sharing how beautiful you are in every way that you are, then this was a frantic effort to see a way to help you recover. I know it's not the way but as long as you can see the intention.... it's all from love and caring.",
          "created_utc": 1665343382.0
        },
        {
          "id": "irogt9i",
          "author": "TRKevinSpacey",
          "body": "Yeah and I guess it’s hard to see it that way when it feels like everyone hates you for one reason or another. It’s like in my brain I can see how he’s trying but I just take it as I’m gross and that’s all I feel",
          "created_utc": 1665347425.0
        }
      ]
    },
    {
      "id": "irltx2k",
      "author": "MsKidgie",
      "body": "Oh, yes, exactly. That’s part of my stuff too. That’s why I was asking. It’s not healthy for me to ask, so I was wondering what OP might be thinking about why she’s asking.",
      "created_utc": 1665297421.0,
      "score": 2,
      "context": [
        {
          "id": "irlsoav",
          "author": "MsKidgie",
          "body": "As a restrictive person myself, may I, gently, ask why you asked him this?",
          "created_utc": 1665296493.0
        },
        {
          "id": "irlt9dw",
          "author": "Dangerous_Owl_1858",
          "body": "I do this with my partner too. he is my partner, so I want to know his opinion on my changing body. and also it can be validating to know if I'm skinnier honestly..",
          "created_utc": 1665296941.0
        },
        {
          "id": "irltipc",
          "author": "MsKidgie",
          "body": "For me, I’m setting both of us up when I do this. I’m learning to focus on actions that tell me and show me, vs putting him on the spot.",
          "created_utc": 1665297123.0
        },
        {
          "id": "irltrxq",
          "author": "Dangerous_Owl_1858",
          "body": "\"setting both of us up\" is also a part of my mental illness sadly. but I understand what you mean.",
          "created_utc": 1665297314.0
        }
      ]
    },
    {
      "id": "irn8u1l",
      "author": "thequeeniris",
      "body": "Maybe I take “for better or worse, through sickness and health” a little too literally",
      "created_utc": 1665330127.0,
      "score": 1,
      "context": [
        {
          "id": "irl6puk",
          "author": "thequeeniris",
          "body": "This makes me sad /: your partner should love you unconditionally",
          "created_utc": 1665283102.0
        },
        {
          "id": "irm5579",
          "author": "LiliumTheCrevette",
          "body": "Well, just because you aren't feeling as attracted to somebody's - or rather your partner's - physique any more or at least not as much as you once did, doesn't mean you're not able to love that person anymore.\nHe shouldn't have stopped loving OP because of their weight, why should he? I suppose he just answered the question honestly and I think that is a good sign. At least he isn't lying to them. \nI'd encourage OP to try and seek help from a therapist if they don't have one yet, and talk to their husband too on the matter. If he knows the problem, it's easier for both of you to cope and tackle the respective problem zones. \nHope I could help you, OP!",
          "created_utc": 1665306366.0
        },
        {
          "id": "irmy3mj",
          "author": "thequeeniris",
          "body": "I don’t agree. My partner still told me he thought I was beautiful and made me feel attractive at my LW through my HW. I think it’s a bad sign he would say that. What happens if someone’s pregnant and at their HW? Or if your partner gets cancer and is bald, on chemo, and at their LW? Or at their LW bc of a disease from Ana or Mia? Your partner should make you feel attractive in all of your forms and worship your body no matter what state it’s in. Period.",
          "created_utc": 1665325486.0
        },
        {
          "id": "irn4y90",
          "author": "LiliumTheCrevette",
          "body": "Well, I just think it is reasonable if somebody states what he truly thinks about one's appearance after being asked and if OP's husband does not find that certain weight on them to be attractive to him, then it's his (honest) opinion. It doesn't mean he cannot appreciate their body anymore. \nIt is great to hear that your partner supports/supported you so much! But bear in mind that a partner has no obligation to find you attractive at all times - they're an individual human being and as such I don't think anyone has to worship anyone's body unconditionally. People - as well as their perception of the world and everyone around them - often change over time. It is completely normal. And similarly, that means that just because you find a certain person attractive at a healthy weight it may be that at an unhealthy one - extremely low or high - the attraction fades. There's nothing wrong with it.",
          "created_utc": 1665328480.0
        }
      ]
    },
    {
      "id": "irng8qg",
      "author": "TRKevinSpacey",
      "body": "I definitely did. I think he loves me unconditionally but sometimes I feel like it’s a friendship love. Lately he’s been treating me like a roommate. No touching or intimacy unless I ask for it. It’s a dead bedroom situation now and every time I see my figure in  the mirror I feel like I look like a concentration camp survivor and I feel ugly. I’d rather be ugly tho than have men leering at me.               \nEta: a word",
      "created_utc": 1665333096.0,
      "score": 3,
      "context": [
        {
          "id": "irl6puk",
          "author": "thequeeniris",
          "body": "This makes me sad /: your partner should love you unconditionally",
          "created_utc": 1665283102.0
        },
        {
          "id": "irm5579",
          "author": "LiliumTheCrevette",
          "body": "Well, just because you aren't feeling as attracted to somebody's - or rather your partner's - physique any more or at least not as much as you once did, doesn't mean you're not able to love that person anymore.\nHe shouldn't have stopped loving OP because of their weight, why should he? I suppose he just answered the question honestly and I think that is a good sign. At least he isn't lying to them. \nI'd encourage OP to try and seek help from a therapist if they don't have one yet, and talk to their husband too on the matter. If he knows the problem, it's easier for both of you to cope and tackle the respective problem zones. \nHope I could help you, OP!",
          "created_utc": 1665306366.0
        },
        {
          "id": "irmy3mj",
          "author": "thequeeniris",
          "body": "I don’t agree. My partner still told me he thought I was beautiful and made me feel attractive at my LW through my HW. I think it’s a bad sign he would say that. What happens if someone’s pregnant and at their HW? Or if your partner gets cancer and is bald, on chemo, and at their LW? Or at their LW bc of a disease from Ana or Mia? Your partner should make you feel attractive in all of your forms and worship your body no matter what state it’s in. Period.",
          "created_utc": 1665325486.0
        },
        {
          "id": "irn4y90",
          "author": "LiliumTheCrevette",
          "body": "Well, I just think it is reasonable if somebody states what he truly thinks about one's appearance after being asked and if OP's husband does not find that certain weight on them to be attractive to him, then it's his (honest) opinion. It doesn't mean he cannot appreciate their body anymore. \nIt is great to hear that your partner supports/supported you so much! But bear in mind that a partner has no obligation to find you attractive at all times - they're an individual human being and as such I don't think anyone has to worship anyone's body unconditionally. People - as well as their perception of the world and everyone around them - often change over time. It is completely normal. And similarly, that means that just because you find a certain person attractive at a healthy weight it may be that at an unhealthy one - extremely low or high - the attraction fades. There's nothing wrong with it.",
          "created_utc": 1665328480.0
        },
        {
          "id": "irn8u1l",
          "author": "thequeeniris",
          "body": "Maybe I take “for better or worse, through sickness and health” a little too literally",
          "created_utc": 1665330127.0
        }
      ]
    },
    {
      "id": "irw26wz",
      "author": "LiliumTheCrevette",
      "body": "Maybe that'll help you try and fight back against the ED. Find something to live for, something to heal for, and set your goal. If you have something that is important to you, it is easier to work towards that or at least against whatever is stopping you from reaching your goal.\nYou know what? Seeing your own body in the mirror and thinking you're ugly could be a sign that you have the will and possibility to recover. And it will probably also ameliorate your love life too. You don't have to rush anything of course, but I guess sitting down with your hubbie and talking to him about the problem could help a lot.\nSending you love! You will manage this. ❤️",
      "created_utc": 1665496794.0,
      "score": 1,
      "context": [
        {
          "id": "irl6puk",
          "author": "thequeeniris",
          "body": "This makes me sad /: your partner should love you unconditionally",
          "created_utc": 1665283102.0
        },
        {
          "id": "irm5579",
          "author": "LiliumTheCrevette",
          "body": "Well, just because you aren't feeling as attracted to somebody's - or rather your partner's - physique any more or at least not as much as you once did, doesn't mean you're not able to love that person anymore.\nHe shouldn't have stopped loving OP because of their weight, why should he? I suppose he just answered the question honestly and I think that is a good sign. At least he isn't lying to them. \nI'd encourage OP to try and seek help from a therapist if they don't have one yet, and talk to their husband too on the matter. If he knows the problem, it's easier for both of you to cope and tackle the respective problem zones. \nHope I could help you, OP!",
          "created_utc": 1665306366.0
        },
        {
          "id": "irmy3mj",
          "author": "thequeeniris",
          "body": "I don’t agree. My partner still told me he thought I was beautiful and made me feel attractive at my LW through my HW. I think it’s a bad sign he would say that. What happens if someone’s pregnant and at their HW? Or if your partner gets cancer and is bald, on chemo, and at their LW? Or at their LW bc of a disease from Ana or Mia? Your partner should make you feel attractive in all of your forms and worship your body no matter what state it’s in. Period.",
          "created_utc": 1665325486.0
        },
        {
          "id": "irn4y90",
          "author": "LiliumTheCrevette",
          "body": "Well, I just think it is reasonable if somebody states what he truly thinks about one's appearance after being asked and if OP's husband does not find that certain weight on them to be attractive to him, then it's his (honest) opinion. It doesn't mean he cannot appreciate their body anymore. \nIt is great to hear that your partner supports/supported you so much! But bear in mind that a partner has no obligation to find you attractive at all times - they're an individual human being and as such I don't think anyone has to worship anyone's body unconditionally. People - as well as their perception of the world and everyone around them - often change over time. It is completely normal. And similarly, that means that just because you find a certain person attractive at a healthy weight it may be that at an unhealthy one - extremely low or high - the attraction fades. There's nothing wrong with it.",
          "created_utc": 1665328480.0
        },
        {
          "id": "irn8u1l",
          "author": "thequeeniris",
          "body": "Maybe I take “for better or worse, through sickness and health” a little too literally",
          "created_utc": 1665330127.0
        },
        {
          "id": "irng8qg",
          "author": "TRKevinSpacey",
          "body": "I definitely did. I think he loves me unconditionally but sometimes I feel like it’s a friendship love. Lately he’s been treating me like a roommate. No touching or intimacy unless I ask for it. It’s a dead bedroom situation now and every time I see my figure in  the mirror I feel like I look like a concentration camp survivor and I feel ugly. I’d rather be ugly tho than have men leering at me.               \nEta: a word",
          "created_utc": 1665333096.0
        }
      ]
    }
  ]
}