{
  "id": "y75peb",
  "subreddit": "AnorexiaNervosa",
  "author": "Coconutpeachwater",
  "created_utc": 1666096034.0,
  "title": "Throwing away food made me cry today.",
  "selftext": "My nan made these lovely little scone/sugar roll things earlier today. They’re fresh, and so I know they’re really nice- she used to make them when I was young and I loved them, so my mum put one in my lunch for tomorrow and I panicked and threw it away. To make it worse I basically destroyed the thing and made it inedible, and then I shoved it in the bottom of the trash. \n\nI’m no stranger to that sort of thing, (honestly I waste a lot of food and I do feel terrible about it) but this seriously ignited something in me. I cried. I went and hugged her and my mum and now here we are. I’m not sure why it scared me like it did, but I really needed to get this off my chest, I’m sorry.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/y75peb/throwing_away_food_made_me_cry_today/",
  "score": 107,
  "num_comments": 10,
  "comments": [
    {
      "id": "issmg2w",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1666096034.0,
      "score": 1,
      "context": []
    },
    {
      "id": "issxl6b",
      "author": "softybaby",
      "body": "I really relate with you on the guilt you fell after you throw away food. It sucks I throw away my lunch my mom or grandma made for me int he mornings cuz I can't seem to be able to eat them and they would be very worried if they found out that I didn't eat my lunch",
      "created_utc": 1666101425.0,
      "score": 33,
      "context": []
    },
    {
      "id": "isu0spt",
      "author": "fruitdick1",
      "body": "I relate to this. the first time I purged was bc I felt too bad to waste dinner my mom made, so I ate it. but i was so deep in it back then I felt like I HAD to get rid of it at any cost. compounded by the fact I was so hungry eating 3/4 of it physically made me feel sick, at the time it just made sense\nsomehow that wasn't wasting it, ig in my super messed up logic I tasted it so it wasn't wasted. so glad I'm not that bad anymore.",
      "created_utc": 1666117145.0,
      "score": 15,
      "context": []
    },
    {
      "id": "isu1gxc",
      "author": "Plastic-Bid-1036",
      "body": "I have done this with nice food someone made for me that I loved and wished I could eat, and felt awful for destroying/ binning it. I'm sorry this happened. Destroying the scone / sugar roll does not make you a bad person though, and it doesn't mean you love your nan any less. I hope tomorrow is better.",
      "created_utc": 1666117406.0,
      "score": 11,
      "context": []
    },
    {
      "id": "isv76iu",
      "author": "Life-Space-361",
      "body": "give it to a friend next time maybe",
      "created_utc": 1666133919.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l8kdqkv",
      "author": "Miserable_Thought933",
      "body": "I am the same. My husband brings my favourite food which I can't have anymore because of my eating disorder. So I say to him I'm gonna eat it later and then when he's out of the house, I put it in a plastic bag and destroy then put it in the bottom of the bin and then when he comes, I pretend I've eaten and I feel very sluggish I hate wasting food, but I just can't help how i feel when someone Offers me food to eat am scared of eating because afterwards the next day I feel so sluggish sick my body feels like as if a bus ran over me",
      "created_utc": 1718365090.0,
      "score": 3,
      "context": []
    },
    {
      "id": "isxdd5g",
      "author": "hoe00",
      "body": "i relate to this. i waste a lot of food too and it’s rlly horrible. it hits you i think especially when a close family member has made you food because they just want you to eat but then you can’t handle it and throw it away. it reminds you how powerful eds are that you feel better if you just get rid of the food. i hope you can come through this, it sounds like deep down you know it’s too painful to live like that",
      "created_utc": 1666181357.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iswm9zg",
      "author": "Coconutpeachwater",
      "body": "Gosh yeah I usually do that too- different type of food guilt but it can still be just as painful I suppose :(",
      "created_utc": 1666159929.0,
      "score": 3,
      "context": [
        {
          "id": "issxl6b",
          "author": "softybaby",
          "body": "I really relate with you on the guilt you fell after you throw away food. It sucks I throw away my lunch my mom or grandma made for me int he mornings cuz I can't seem to be able to eat them and they would be very worried if they found out that I didn't eat my lunch",
          "created_utc": 1666101425.0
        }
      ]
    },
    {
      "id": "iswmib8",
      "author": "Coconutpeachwater",
      "body": "Thank you, that’s really reassuring <3",
      "created_utc": 1666160106.0,
      "score": 2,
      "context": [
        {
          "id": "isu1gxc",
          "author": "Plastic-Bid-1036",
          "body": "I have done this with nice food someone made for me that I loved and wished I could eat, and felt awful for destroying/ binning it. I'm sorry this happened. Destroying the scone / sugar roll does not make you a bad person though, and it doesn't mean you love your nan any less. I hope tomorrow is better.",
          "created_utc": 1666117406.0
        }
      ]
    },
    {
      "id": "iswmfed",
      "author": "Coconutpeachwater",
      "body": "I’ve tried, they don’t take it very often",
      "created_utc": 1666160044.0,
      "score": 1,
      "context": [
        {
          "id": "isv76iu",
          "author": "Life-Space-361",
          "body": "give it to a friend next time maybe",
          "created_utc": 1666133919.0
        }
      ]
    }
  ]
}