{
  "id": "yjb11r",
  "subreddit": "AnorexiaNervosa",
  "author": "None",
  "created_utc": 1667315117.0,
  "title": "Does anyone else here struggle with binge-eating and anorexia?",
  "selftext": "Apologies if this triggers anyone.\n\nMy therapist of 2 years required me to take a verbal assessment to pinpoint what my ED is and found it to be a combination of the two. Was wondering if anyone else has experienced this?\n\nThere will be weeks where I go without eating, or intentionally eating little, but then experience a massive binging episode where I eat everything in my kitchen, and can't physically stop. And the cycle repeats. I hate this relationship with food.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/yjb11r/does_anyone_else_here_struggle_with_bingeeating/",
  "score": 112,
  "num_comments": 31,
  "comments": [
    {
      "id": "iumsukv",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1667315118.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iup2pgg",
      "author": "Fitkratomgirl",
      "body": "yes restriction almost inevitably results in binging at some point",
      "created_utc": 1667347179.0,
      "score": 22,
      "context": []
    },
    {
      "id": "iuncg2f",
      "author": "None",
      "body": "I have occasional issues with binging, but I would say it's relatively rare. Maybe I'll binge once or twice a month. I have noticed that when I do, I can't stop eating lots of food. It's almost like I lose my ability to experience fullness in that session. I feel regret afterwards, and my stomach feels horrible. I feel bloated and in pain until the next day. I do go back to restricting lower to compensate for the excess calories.",
      "created_utc": 1667322811.0,
      "score": 17,
      "context": []
    },
    {
      "id": "iup0vub",
      "author": "Rainy_Sisson",
      "body": "I've never been diagnosed but I deffinatly have this",
      "created_utc": 1667346398.0,
      "score": 11,
      "context": []
    },
    {
      "id": "iumx9yt",
      "author": "mymelodythefelon",
      "body": "Probably a vast majority",
      "created_utc": 1667316917.0,
      "score": 19,
      "context": []
    },
    {
      "id": "iup4ie5",
      "author": "Fairyprincessmimi",
      "body": "Me too! I'm too black or white, used to starve/restrict on the week and binge on the weekend, then went in a period of pure restriction until I got hospitilized and las month I went through a binging period, binging almost everyday. Now I'm slowly going back to restricting with the usual cheat day but in a more controlled way, even though I still don't fibd the balance",
      "created_utc": 1667347942.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iuoema3",
      "author": "Easy-Opposite-5431",
      "body": "Absolutely. This is my ED",
      "created_utc": 1667337209.0,
      "score": 9,
      "context": []
    },
    {
      "id": "iumx25z",
      "author": "rileyyj001",
      "body": "💁🏼‍♂️",
      "created_utc": 1667316829.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iuokhwk",
      "author": "Key-Temperature31",
      "body": "Yep",
      "created_utc": 1667339538.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iuplkax",
      "author": "Familiar_Ostrich5952",
      "body": "My official dx is anorexia binge / purge type. I haven’t binged in 2 years. I’ve vomited once in the last 2 years but I use exercise to purge. It’s really common to have overlaps and for our disorders to evolve into other types. It is extremely common for most people with ED to binge. Binging is often a symptom of restricting.",
      "created_utc": 1667355299.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iurg2qo",
      "author": "jdsr9",
      "body": "it's called reactive eating, happens with anyone who drops a lot of weight too quickly",
      "created_utc": 1667398366.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iunkt95",
      "author": "None",
      "body": "Most people who have an ED experience symptoms that are from different diagnoses. However, the way the DSM is written, people wouldn’t be diagnosed with both BED and AN. I have mixed feelings about mental health diagnoses in general, I hope whatever your therapist decides will help you access help to recover, and not make you feel ‘wrong’ or ‘invalid’.",
      "created_utc": 1667325950.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iumxoug",
      "author": "deepsea3714",
      "body": "I’m exactly like this. And nowadays overeating has been a habit that I lost my ability to restrict. I think intermittent fasting led me to binge during my allowed eating period. It will start off from safe food- like clear broth soup and lettuce to cheese, then muffin, then it will evolve into shoving fistful of cereals. \nThis way I easily consume half of my tdee in one sitting…",
      "created_utc": 1667317082.0,
      "score": 6,
      "context": []
    },
    {
      "id": "iunpt36",
      "author": "le_bateau_ivre",
      "body": "i do and i'm the restrictive subtype; every other month i experience hyperphagia.",
      "created_utc": 1667327831.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ivamxlb",
      "author": "Sn0wF0x44",
      "body": "Yeah omg, I feel like am about to cry for finding someone else like me, actually I have been binging for the past week like crazy almost every single day I feel like I have lost control over my body",
      "created_utc": 1667750193.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iuq56dn",
      "author": "Superb-Ad-5803",
      "body": "When I considered myself anorexic, I had 3 binge episodes. They were nothing compared to how I ate when I was recovering. I thought a binge was 120 calories of broccoli. I’m telling you, they aren’t as bad as you think they are.",
      "created_utc": 1667365989.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iunei84",
      "author": "Jael_01",
      "body": "Ednos?",
      "created_utc": 1667323584.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iupo1c7",
      "author": "None",
      "body": "Yes!!  I had anorexia in high school and college.  I then recovered.  Years later, I develop BED.  After I got really upset about my weight, I had a full anorexia relapse.  Now I’m struggling with BED again.  It is a roller coaster from hell that I can’t get off of.",
      "created_utc": 1667356424.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iupoxei",
      "author": "biddybaby",
      "body": "Yes, me. Absolutely.",
      "created_utc": 1667356835.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuqw5ws",
      "author": "RichApprehensive1116",
      "body": "yeah i go few weeks w restricting a lot and then a few weeks of binging a lot which leads to me wanting to restrict again and then when i restrict again i binge cuz that always happens. basically i live in a loop of this shit 🥲🥲",
      "created_utc": 1667388157.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iur3jqs",
      "author": "Human_Toe_9105",
      "body": "I’ll binge eat once and then fast out of guilt",
      "created_utc": 1667392479.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iury8ki",
      "author": "butteryflatlinerxxx",
      "body": "I have \"binge\" moments... but the binge isn't high calorie foods or fatty foods. \nUsually something sweet or a \"safe food\" hummus... things like that. \nI definitely beat myself up for my \"binge\" even though it's litterly only enough to not make me pass out for the next few hours.",
      "created_utc": 1667405698.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iutwrq0",
      "author": "Canskiinheat",
      "body": "Yes I always binge at least once a month but that’s obviously normal if you’re strictly dieting",
      "created_utc": 1667433584.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ivjw333",
      "author": "Vampire_Neko",
      "body": "Yeah I struggle with this to but mainly around holidays if that makes sense",
      "created_utc": 1667918764.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ivsdn81",
      "author": "picklestherealdill",
      "body": "It’s a misconception that anorexia is just below a central body fat percentage and that there’s no binging. Restrictions and binge eating go hand in hand and while the medical definition of Ana is to be under a certain body weight- how the fuck did these ppl get there you know? At my lowest weight technically I wouldn’t be Anorexic because my bmi was still the lowest end of normal,  but my kidneys had acute failure. Currently my diet consists of a bowl of  cucumber tomato feta sometimes baked buff cauliflower that I’ve been measuring and zoodles with shrimp, a truly and coffee besides water. I just bout fiber one brownies and oikos triple zero yogurt to add to the mix by all means I’ve relapsed but I think eating a whole zucchini of noodles and like 5 shrimp is a binge especially if I eat some cauliflower or pickles after but realistically my intake especially if a work out at all is not in the range of a healthy diet at all. But I mean true binges can also happen which I’ve also experienced where I’ve eaten half of a xl calzone and could still eat or eating cold fries from the fridge while heating up food in the microwave while the ovens preheating then feeling guilty about it and not eat for a couple days then going on a crazy restriction episode. It’s not always as ppl think",
      "created_utc": 1668062728.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iw0rg3t",
      "author": "mentallyillangel",
      "body": "my anorexia started in 3rd grade, i’d sleep to avoid eating and i remember physically starving myself to the point where the only time i’d physically eat was in my sleep, i’d wake up eating and feel like a failure. now i’m 20 and the binge-eating has kicked in. i’ll barely eat and have no appetite for 2-6 months and then spend a month bingeing. i’m looking for people who battle this too bc i’m struggling but want to recover. hope everyone gets better 💛",
      "created_utc": 1668216030.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iw63lik",
      "author": "forensicish",
      "body": "Binging is a part of AN",
      "created_utc": 1668319829.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ix08t9l",
      "author": "ThISisAthrRowAwAYy",
      "body": "I do:) TW I restrict so severely that binging is inevitable. Plus even when I just restrict I throw it all up so the restriction is even more server bc I never keep any food in my system so I’m absolutely starving in a literal sense it’s a miserable existence that I can’t seem to want to leave it’s complicated :’)",
      "created_utc": 1668884794.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iy8o9ry",
      "author": "lostinth3Abyss",
      "body": "Yeah, I would say sometimes I have anorexia and sometimes I have bulimia, RBP cycle is usually consistent so I stay on the bulimia sub mostly. But am currently dealing with anorexia atm since I haven’t B/P in a while",
      "created_utc": 1669738199.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ivse860",
      "author": "picklestherealdill",
      "body": "Fuckin me eating two zucchini’s and a half a head of cauliflower and some shrimp",
      "created_utc": 1668063173.0,
      "score": 1,
      "context": [
        {
          "id": "iuq56dn",
          "author": "Superb-Ad-5803",
          "body": "When I considered myself anorexic, I had 3 binge episodes. They were nothing compared to how I ate when I was recovering. I thought a binge was 120 calories of broccoli. I’m telling you, they aren’t as bad as you think they are.",
          "created_utc": 1667365989.0
        }
      ]
    },
    {
      "id": "iwcrfbs",
      "author": "slimprivilege",
      "body": "*Osfed",
      "created_utc": 1668449089.0,
      "score": 1,
      "context": [
        {
          "id": "iunei84",
          "author": "Jael_01",
          "body": "Ednos?",
          "created_utc": 1667323584.0
        }
      ]
    }
  ]
}