{
  "id": "zcjs8x",
  "subreddit": "AnorexiaNervosa",
  "author": "KC_IsGay",
  "created_utc": 1670183885.0,
  "title": "I keep just having yoghurt bowls because they feel safe to me. What are some other heathy foods I can have?",
  "selftext": "",
  "url": "https://i.redd.it/cjrv1rj6az3a1.jpg",
  "score": 149,
  "num_comments": 40,
  "comments": [
    {
      "id": "iywu5xt",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1670183886.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iyx7lhh",
      "author": "mossballinspace",
      "body": "rice bowls! rice, lettuce, some cooked or fresh veggies (i like tomatoes, corn, black beans, broccoli, peas, usually cut into small pieces), some protein (i’m vegan so i usually do tofu but you could do whatever meat or other protein you like), and whatever dressings or sauces or other seasonings you like. build ur own rice bowl!",
      "created_utc": 1670188942.0,
      "score": 23,
      "context": []
    },
    {
      "id": "iyygt2k",
      "author": "Proper_Crazy670",
      "body": "The funnest fact is that you can have any food! You’re deserving of filling healthy foods but you also deserve fun foods! I know the need for “safe foods” but what’s life without some danger",
      "created_utc": 1670208905.0,
      "score": 22,
      "context": []
    },
    {
      "id": "iywxwzy",
      "author": "PhoebePheebs_",
      "body": "I like to make these salads things and use guacamole cups as dressing :) Usually peeled cucumbers, chicken, cherry tomatoes and the guacamole, shake it up. And some seasoning if i wanna. Protein and healthy things in it but it never bloats me so I don’t spiral after eating it",
      "created_utc": 1670185300.0,
      "score": 22,
      "context": []
    },
    {
      "id": "iywzq7e",
      "author": "Talysha1921",
      "body": "This looks yummy!!",
      "created_utc": 1670185974.0,
      "score": 10,
      "context": []
    },
    {
      "id": "iyxalxp",
      "author": "Swimming_Classic_179",
      "body": "Omg that looks so good!! \n\nMy favorites are: \n\noatmeals (yk boil 1 part oats & 2 parts water (+ salt)) and if I have a good day I serve with either jam or cinnamon and sugar on top\n\nSmoothies with random frozen fruit and Milk + yoghurt (+oats to feel fuller)\n\nBlueberries or other berries as a snack\n\nChicken in all forms (but not fried) chicken salads are so good\n\nMay edit thid and add some more if I can think of some lol",
      "created_utc": 1670190144.0,
      "score": 7,
      "context": []
    },
    {
      "id": "iywvxl2",
      "author": "annieedisonirl",
      "body": "I really like avocado toast on whatever bread I can handle that day. I like to mash up the avocado, top with salt, fresh cracked pepper, and lemon juice, and then sometimes a little hot sauce.",
      "created_utc": 1670184557.0,
      "score": 10,
      "context": []
    },
    {
      "id": "iyxu9v0",
      "author": "Slytherian2020",
      "body": "For me right now it's squash any kind of squash unless it's fried or has cheese/meat on it. Also I'll eat a baked sweet potato with cinnamon no butter or sugar",
      "created_utc": 1670198465.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iyy04f9",
      "author": "cguydish2",
      "body": "I really love oatmeal because it's dense and will keep you full but not too many calories. I'm tentatively trying recovery so I try to add whole milk when I make it and sugar and stuff but if that's too unsafe for you right now, it's just as good with water. I love oatmeal because it's so versatile! I also love to make eggs and cheese or other types of omelettes. It's a safe food for me because it's a low calorie, super versatile protein source! I love these two options because I can make them as high or low calorie as I need and there's no end to flavor varieties and they're so easy.",
      "created_utc": 1670201039.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iyy31zc",
      "author": "None",
      "body": "Homemade soup is my favorite. Use stock or broth as your base and add chicken or rice, broccoli - and if you feel okay with it you can add a little cream or cheese. Homemade soup never bloats me or makes me feel bad cuz I don’t add flour to it lol.",
      "created_utc": 1670202404.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iyxvm27",
      "author": "raccoonsaff",
      "body": "I don't agree with sticking to only 'healthy'/safe foods in recovery, but some stereotypically 'healthy' meals to try might be:\n\nBreakfast - baked oats, overnight oats, porridge, omelette, poached eggs or fried eggs and avocado on toast, egg avocado boats, banana oat pancakes, etc. Shakshuka. \n\nLunches/dinners - rye bread or wholewheat bread with various toppings e.g. avocado and tuna or egg, hummus, nut butters with banana, pesto and chicken, mashed chickpeas, etc. Quinoa/couscous/rice/noodle bowls with protein and lots of different veg. Sweet potato toast. Sweet potato jacket potato. Stir fry. Ramen. Homemade lentil dahl or curry, with rice. \n\nDesserts - have a Google but things like avocado chocolate mousse/pudding, nice cream/banana ice cream, chia coconut pudding, nut butter stuffed dates, heated up protein bars, flapjacks, etc.",
      "created_utc": 1670199047.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iywxyrd",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1670185318.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iyx7m4q",
      "author": "mossballinspace",
      "body": "tomato soup is a go to",
      "created_utc": 1670188950.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iyxnncv",
      "author": "fuckedupceiling",
      "body": "I love rice and veggies/tuna for safe foods, I add a bit of mayonnaise too! Also, a tomato, a bit of bread, some cheese, chicken, olives and a hard boiled egg make an amazing, nourishing salad!",
      "created_utc": 1670195631.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iyydkzw",
      "author": "None",
      "body": "Tofu is something that used to terrify me but which I’m having on the daily. It’s great in smoothies, or I use it instead of yoghurt as dairy is still a challenge.\n\nAlso, cutting things small can help. My sister made me a couple of slices of toast with butter and cut the pieces small. Carbs are my biggest fear food probably. There were eight pieces or so, and I went through them saying ‘ok, I ate one, I can do another piece. Good job, now let’s try for 3’, etc, etc. A lot of the anxiety for me comes from thinking I need to have the whole serving or that things are so big. Breaking it down makes a lot of difference.",
      "created_utc": 1670207346.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iyyhdjs",
      "author": "animalsexchange",
      "body": "Oatmeal, soup",
      "created_utc": 1670209191.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iyytypp",
      "author": "zombeatrice",
      "body": "Chia pudding! I like mine topped with fresh fruit and some granola. 😊",
      "created_utc": 1670215687.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iyxfo2v",
      "author": "Superb-Ad-5803",
      "body": "I used to eat A LOT of protein bars. They’re not cost effective but it was worth it to me bc they seemed healthy and were rlly easy to eat more of.",
      "created_utc": 1670192243.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iyyfjsv",
      "author": "barnesandnobullsh-t",
      "body": "Avocado pudding : )\n• 1 whole avo\n• 4oz coconut milk\n• honey (optional)\nBlend & top with your fav fruit",
      "created_utc": 1670208286.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iyzgkeu",
      "author": "PrettyBoy001",
      "body": "Great start! Something that might be similar that you might find comfortable is smoothie bowls! Protein powder and a frozen banana as a base are what I recommend.",
      "created_utc": 1670233080.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iyzr29q",
      "author": "the_real_tomoko",
      "body": "I have a question...is it bad or what is it when i dont have any safe food, when i stop 4 or 5 day without eating i eat normaly everything, but i have some thoughts that every food makes me ugly",
      "created_utc": 1670241974.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iyzs5e0",
      "author": "taikutsuu",
      "body": "Chia seed pudding, makes for a nice breakfast with a bit of yoghurt and fruit and has a ton of fiber.\n\nQuinoa bowls, lower calorie and keep blood sugar stable. I usually make a tahini dressing (healthy fats) with some sweet potato (or roasted squash), avocado, lettuce and some feta-type cheese and mix it all up with the quinoa. It could have a bit more protein but it covers all the other nutritional areas so it feels like a safe but healthy thing.\n\nAaaaand soups. My favorite is carrot & sweet potato soup, I usually roast in the oven, sautee some aromatics and add the roasted veggies to the pot with some broth and a bit of cream or coconut milk and some spice. The fats are quite calorie dense but they balance out the dish and help with satiation.",
      "created_utc": 1670242732.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iz03tun",
      "author": "Cosma26",
      "body": "Oatmeal, or i do chicken breast marinated in lemon and lime for a few minutes with some chopped rosemary or thyme with roasted veggies on the side. If you eat meat.",
      "created_utc": 1670249535.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iz0abzk",
      "author": "Dadlover360",
      "body": "salmon (or tuna) bowls with a bit of rice and furikake & tofu cooked with spinach are pretty safe food for me",
      "created_utc": 1670252580.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iz1fnnu",
      "author": "None",
      "body": "Clear broth soups with lots of veggies, and chicken veggie soup is my safe food. You can pack them with herbs for more nutrients too. I also will make my own bone broth and load it with herbs for the nutrients. \nRice bowls, steamed veggies, tuna and oatmeal are other options. It’s helpful to flesh out the oats with cauliflower rice or steamed shredded zucchini:)",
      "created_utc": 1670269001.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iz4fzim",
      "author": "Elfen8",
      "body": "Hummus and veg, fruit, tea tends to satisfy me without guilt, porridge, toast, rice",
      "created_utc": 1670328421.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iz5jmbr",
      "author": "Kara_S12",
      "body": "I love using the website delish almost all there recipes are extremely healthy.  My favorite recipe I found on there is a spicy salmon bowl.  It’s super good I make it all the time.",
      "created_utc": 1670347077.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iz62hnd",
      "author": "EmTerreri",
      "body": "Hardboiled eggs are a quick and easy snack that are full of nutrients!",
      "created_utc": 1670354249.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j0c987a",
      "author": "FourBloodyKisses",
      "body": "This looks so good!! Where did you get the granola?!",
      "created_utc": 1671121923.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgqs0ei",
      "author": "lykatot",
      "body": "Se stai cercando opzioni di cibo sano oltre alle ciotole di yogurt, ce ne sono molte disponibili. Potresti provare a fare ciotole di smoothie con una varietà di frutta e verdura, ciotole di avena con noci e semi, o insalate con molta verdura fresca e proteine magre. Altre opzioni includono pane integrale con avocado e uova, trail mix fatto in casa con noci e frutta secca, o verdure arrostite con quinoa. Sperimentare con cibi sani diversi può aiutarti ad espandere il tuo palato e trovare nuovi preferiti che ti fanno sentire sia soddisfatto che nutrito. Il programma Metodo FESPA offre un approccio personalizzato e sostenibile alla perdita di peso che si concentra sulla creazione di cambiamenti salutari dello stile di vita. Il programma si basa sui principi della medicina funzionale ed è adattato alle esigenze uniche di ogni individuo. Concentrandosi sulla creazione di cambiamenti salutari dello stile di vita, il programma non solo aiuta con la perdita di peso ma migliora anche la salute e il benessere generale. Quindi, se stai cercando di perdere peso senza dover passare attraverso la privazione alimentare e la fame, il programma Metodo FESPA potrebbe essere la soluzione per te. Provalo e vedi i risultati da solo. Ricorda, qualunque sia il tuo obiettivo, fa del tuo meglio per rimanere felice e sano.",
      "created_utc": 1681825159.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iyydrui",
      "author": "None",
      "body": "Oh my goodness this sounds AMAZINGGG! I am super scared of rice but will give it a go! Yum!",
      "created_utc": 1670207437.0,
      "score": 4,
      "context": [
        {
          "id": "iyx7lhh",
          "author": "mossballinspace",
          "body": "rice bowls! rice, lettuce, some cooked or fresh veggies (i like tomatoes, corn, black beans, broccoli, peas, usually cut into small pieces), some protein (i’m vegan so i usually do tofu but you could do whatever meat or other protein you like), and whatever dressings or sauces or other seasonings you like. build ur own rice bowl!",
          "created_utc": 1670188942.0
        }
      ]
    },
    {
      "id": "iyyh9ex",
      "author": "Proper_Crazy670",
      "body": "That does look delicious and healthy too! And personally if I want more protein I add eggs to everything, but they’re also just my favourite food! Any dark green and lots of veggies but you need fats in your food or you can’t process vitamins so a bit of butter or oil will help you get all the nutrients so you can get your happy back!",
      "created_utc": 1670209133.0,
      "score": 6,
      "context": [
        {
          "id": "iyygt2k",
          "author": "Proper_Crazy670",
          "body": "The funnest fact is that you can have any food! You’re deserving of filling healthy foods but you also deserve fun foods! I know the need for “safe foods” but what’s life without some danger",
          "created_utc": 1670208905.0
        }
      ]
    },
    {
      "id": "iywwrdb",
      "author": "KC_IsGay",
      "body": "That sounds really good lol. Maybe I’ll try it tomorrow. :)",
      "created_utc": 1670184874.0,
      "score": 5,
      "context": [
        {
          "id": "iywvxl2",
          "author": "annieedisonirl",
          "body": "I really like avocado toast on whatever bread I can handle that day. I like to mash up the avocado, top with salt, fresh cracked pepper, and lemon juice, and then sometimes a little hot sauce.",
          "created_utc": 1670184557.0
        }
      ]
    },
    {
      "id": "iyx7sgq",
      "author": "mossballinspace",
      "body": "i like to do avo toast with everything but the bagel seasoning and tajin in addition to the lemon salt and pepper",
      "created_utc": 1670189018.0,
      "score": 3,
      "context": [
        {
          "id": "iywvxl2",
          "author": "annieedisonirl",
          "body": "I really like avocado toast on whatever bread I can handle that day. I like to mash up the avocado, top with salt, fresh cracked pepper, and lemon juice, and then sometimes a little hot sauce.",
          "created_utc": 1670184557.0
        }
      ]
    },
    {
      "id": "iyzfaej",
      "author": "Venarieldisease",
      "body": "Agreed - these are filling but don’t bloat me so much that I immediately feel guilty & panic about having to restrict in response, which is a major problem for me. But, as many others have said , eating a fruit & veggie-rich diet usually allows me to enjoy my food with less emotional response/stress & is obv great at helping to heal the body & provide much needed nutrients.",
      "created_utc": 1670231874.0,
      "score": 3,
      "context": [
        {
          "id": "iyxu9v0",
          "author": "Slytherian2020",
          "body": "For me right now it's squash any kind of squash unless it's fried or has cheese/meat on it. Also I'll eat a baked sweet potato with cinnamon no butter or sugar",
          "created_utc": 1670198465.0
        }
      ]
    },
    {
      "id": "iyy5ncg",
      "author": "KC_IsGay",
      "body": "Right now I need to get over the action of eating. So eating lots of low calorie foods is a lot better than eating 1-2 high calorie things.",
      "created_utc": 1670203607.0,
      "score": 5,
      "context": [
        {
          "id": "iyxvm27",
          "author": "raccoonsaff",
          "body": "I don't agree with sticking to only 'healthy'/safe foods in recovery, but some stereotypically 'healthy' meals to try might be:\n\nBreakfast - baked oats, overnight oats, porridge, omelette, poached eggs or fried eggs and avocado on toast, egg avocado boats, banana oat pancakes, etc. Shakshuka. \n\nLunches/dinners - rye bread or wholewheat bread with various toppings e.g. avocado and tuna or egg, hummus, nut butters with banana, pesto and chicken, mashed chickpeas, etc. Quinoa/couscous/rice/noodle bowls with protein and lots of different veg. Sweet potato toast. Sweet potato jacket potato. Stir fry. Ramen. Homemade lentil dahl or curry, with rice. \n\nDesserts - have a Google but things like avocado chocolate mousse/pudding, nice cream/banana ice cream, chia coconut pudding, nut butter stuffed dates, heated up protein bars, flapjacks, etc.",
          "created_utc": 1670199047.0
        }
      ]
    },
    {
      "id": "iyzfk7c",
      "author": "Venarieldisease",
      "body": "I second seafood - I make a lot of light white flaky fish like tilapia & use a lot of Asian seasonings to add a LOT of flavor without a ton of extra calories which I sometimes still struggle with. I have a couple amazing miso paste sauces & dressing recipes that are bursting with flavor and are delicious on fish, chicken, tons of veg, salads etc. I’ll try to share the recipes if I can remember!",
      "created_utc": 1670232133.0,
      "score": 1,
      "context": [
        {
          "id": "iywxyrd",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1670185318.0
        }
      ]
    },
    {
      "id": "iyxikor",
      "author": "KC_IsGay",
      "body": "Protein bars are one of my fear foods lmao\n\nMaybe one day 😭",
      "created_utc": 1670193468.0,
      "score": 2,
      "context": [
        {
          "id": "iyxfo2v",
          "author": "Superb-Ad-5803",
          "body": "I used to eat A LOT of protein bars. They’re not cost effective but it was worth it to me bc they seemed healthy and were rlly easy to eat more of.",
          "created_utc": 1670192243.0
        }
      ]
    },
    {
      "id": "j0cmiwi",
      "author": "KC_IsGay",
      "body": "It’s just a chewy granola bar that I broke apart!",
      "created_utc": 1671126969.0,
      "score": 1,
      "context": [
        {
          "id": "j0c987a",
          "author": "FourBloodyKisses",
          "body": "This looks so good!! Where did you get the granola?!",
          "created_utc": 1671121923.0
        }
      ]
    },
    {
      "id": "iyy8ilf",
      "author": "raccoonsaff",
      "body": "That's what I thought, hence giving some suggestions :) all the best x",
      "created_utc": 1670204959.0,
      "score": 3,
      "context": [
        {
          "id": "iyxvm27",
          "author": "raccoonsaff",
          "body": "I don't agree with sticking to only 'healthy'/safe foods in recovery, but some stereotypically 'healthy' meals to try might be:\n\nBreakfast - baked oats, overnight oats, porridge, omelette, poached eggs or fried eggs and avocado on toast, egg avocado boats, banana oat pancakes, etc. Shakshuka. \n\nLunches/dinners - rye bread or wholewheat bread with various toppings e.g. avocado and tuna or egg, hummus, nut butters with banana, pesto and chicken, mashed chickpeas, etc. Quinoa/couscous/rice/noodle bowls with protein and lots of different veg. Sweet potato toast. Sweet potato jacket potato. Stir fry. Ramen. Homemade lentil dahl or curry, with rice. \n\nDesserts - have a Google but things like avocado chocolate mousse/pudding, nice cream/banana ice cream, chia coconut pudding, nut butter stuffed dates, heated up protein bars, flapjacks, etc.",
          "created_utc": 1670199047.0
        },
        {
          "id": "iyy5ncg",
          "author": "KC_IsGay",
          "body": "Right now I need to get over the action of eating. So eating lots of low calorie foods is a lot better than eating 1-2 high calorie things.",
          "created_utc": 1670203607.0
        }
      ]
    },
    {
      "id": "iyyd2bm",
      "author": "None",
      "body": "Also a huge fear food for me but what gets me more comfortable is doing a little bit at a time. Like cutting the bar into four pieces, maybe, and having one piece a day (with other snacks of course). I find it makes it less scary and helps me build up positive thinking.",
      "created_utc": 1670207099.0,
      "score": 3,
      "context": [
        {
          "id": "iyxfo2v",
          "author": "Superb-Ad-5803",
          "body": "I used to eat A LOT of protein bars. They’re not cost effective but it was worth it to me bc they seemed healthy and were rlly easy to eat more of.",
          "created_utc": 1670192243.0
        },
        {
          "id": "iyxikor",
          "author": "KC_IsGay",
          "body": "Protein bars are one of my fear foods lmao\n\nMaybe one day 😭",
          "created_utc": 1670193468.0
        }
      ]
    }
  ]
}