{
  "id": "zj3eda",
  "subreddit": "AnorexiaNervosa",
  "author": "bjosker13",
  "created_utc": 1670784138.0,
  "title": "Daughter starving herself",
  "selftext": "We’re feeling scared and frustrated as we watch our kid not eat. She’s been to the ER three times in a week, no food for 4 days now. She’s been out of treatment since mid November after 4 months of shit treatment at erc.\nThe system is failing her and us. She’s not sick enough for hospitals and she’s too sick for PHP. We’re on waitlist after waitlist and I’m afraid she’s going to die.\nNo reward system has worked. She does not give a shit.\nPlease help.",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/zj3eda/daughter_starving_herself/",
  "score": 137,
  "num_comments": 62,
  "comments": [
    {
      "id": "iztecwu",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1670784138.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iztsnpp",
      "author": "MieraJ",
      "body": "4 days is the most I could go without food too. Warm soup is a good way to add calories as well as it helps to expand the stomach before she is ready to eat with normal portion.\n\nTalk about calories with her and if you're not sure, ask, don't assume. Ask her how much calories is she comfortable with for the time being. If she said lower than 1000 cals, maybe you can add 50 cals more. If she said 500 cals, maybe you can add 100 more. It's really like a bargain, and so much practice in gentle parenting. Little by little, keep on adding the calories, you don't want to rush it, it can be very stressful and depressing. \n\nSome people don't want to talk about calories at all, so asking her what she expect from you as a parent is very important. \n\nLastly, praise her for communicating and tell her you're not forcing her to eat, you're trying to provide her nourishment. Tell her everything about her that you love, but not weight or her appearance.\n\nIf she's a bit stubborn, I'm really sorry, I can't help, but I hope you're patient with her. This is hard for everyone. I hear you, and I understand.",
      "created_utc": 1670789592.0,
      "score": 128,
      "context": []
    },
    {
      "id": "izufaih",
      "author": "None",
      "body": "I remember being her age and having a similar problem, albeit not as severe but from a patient to you, I can tell you what I would've wanted when I was 13 and in that position.\nThere is something causing this, for me it was my hatred of school, there will be something going on that's overwhelming her. There will be a root cause of it, and that's what needs to be looked at. As a patient, I wish my parents had had more compassion in that area and actually sat me down and tried to understand why I was doung it instead of just looking at forcing food at me, that would never have worked for me which is why I'm still battling all these years later. She could be being bullied at school, there might be things at home stressing her out, hormones, choosing GCSE's or whatever your countries equivalent is, anything like that.\nAs I parent, I would've wanted to be understood with why I was doing it, and trying to help the situation instead of 'lets just keep pushing food in front of her and tell her that all these awful things will happen if she doesnt eat it'. She's almost certainly getting that from therapists and dieticians who are there to be harsh and tell her to eat and probably scaring her. As her parent, I suggest you be the compassionate one, you be the one that helps with the emotional side, ask her what she needs, ask her what could improve her mood and her life.\nThe system is so bad, and trust me, I've been in hospital multiple times in the last few weeks and in the doctors, and they keep saying they'll chase up the referral, and everyday I never get the letter. They dont understand even when you're there, I got told off because I said havinf scales in my bedroom would make my problem worse, they just dont get it. I wish my family tried harder to understand instead of getting it in treatment then coming home to it as well.\nEveryone's situation is different, but I have been a teenage girl with anorexia not long ago, I can relate to what she's going through and I wouldn't go back to that for anything, so if you need someone who kind of gets it, I'm here. I can try and help explain things from my own experiences to help you.",
      "created_utc": 1670798752.0,
      "score": 25,
      "context": []
    },
    {
      "id": "izu0xgq",
      "author": "warmcatbellyfuzz",
      "body": "Mom took away my car keys and wouldn’t even let me go to school or do extracurriculares unless I ate and attended appointments. I hated her for it but it kept me alive.",
      "created_utc": 1670792782.0,
      "score": 42,
      "context": []
    },
    {
      "id": "izus5ko",
      "author": "Lillith915",
      "body": "I don’t know exactly what to say about this except I remember doing very similar things and I wish my parents had given this much of a shit. I also remember that the more people called attention to what I was doing the more I dug my heels in. The feeling of hunger was so addicting because it was the only thing I had control over. Maybe if I’d had other responsibilities in my life and felt needed I would not have starved. This is just my personal account and I’m not trying to speak for your daughter but I sincerely hope she can get past this part of her life. It gets better. Again this is totally just my experience but getting a pet helped me immensely because I couldn’t afford to be so sick and away from them because they needed me. Good luck 🍀",
      "created_utc": 1670804315.0,
      "score": 13,
      "context": []
    },
    {
      "id": "izvmdzz",
      "author": "bjosker13",
      "body": "Thanks to all who’ve chimed in and been supportive in one way or another \nWe checked her phone and iPad and laptop and sure as shit she’s been researching all things Ed and starvation \nWe’re shocked but not at all.",
      "created_utc": 1670818674.0,
      "score": 11,
      "context": []
    },
    {
      "id": "izujv25",
      "author": "Future_Appearance_59",
      "body": "Go full inpatient rehab. It may take a few tries if it's that severe but it helps",
      "created_utc": 1670800711.0,
      "score": 7,
      "context": []
    },
    {
      "id": "iztkisa",
      "author": "Asspieburgers",
      "body": "Please excuse me if I'm misreading or making assumptions about her prior treatment \n\nHas she ever had trauma of any kind? My girlfriend (AN-BP) informs me frequently (I have memory issues) that EDs mostly arise from trauma. [See here](https://www.nationaleatingdisorders.org/blog/eating-disorders-trauma-ptsd-recovery). Could there be some trauma that she isn't telling you, or anyone else, about (for whatever reason that may be – and there could be many, including guilt, shame and fear)? Has she explored any of that with a psychologist/psychotherapist?\n\nKeep in mind that public hospital wards may only treat the symptoms (in this case malnourishment) and not the cause(s). To treat the causes she probably needs one-on-one psychological intervention and/or an inpatient stay at a *good* ED clinic (there are too many below average of those, my girlfriend tells me)",
      "created_utc": 1670786502.0,
      "score": 14,
      "context": []
    },
    {
      "id": "izurgz1",
      "author": "Lemon_m1lk",
      "body": "Hi there! I’m reading about your situation and my heart breaks for you and your daughter. Not only is the medical system to blame, but also social media and all the pro-Ana content that is so easy for young people to stumble upon. We need to do better and there needs to be a change. If it is ok with you, I would like to pray for you and your daughter and ask God to give you and your daughter healing and peace of mind <3.",
      "created_utc": 1670804012.0,
      "score": 5,
      "context": []
    },
    {
      "id": "izvnxgx",
      "author": "Chezzyched69",
      "body": "Kay as someone who struggled/struggling with an eating disorder from anorexic to now what I'd call food avoidance. The peice of advice might sound  really strange, but normal things are not getting to her so time to jolt her awake. When it is your Donner time lay out plates, bowls, glasses cutlery and sit at the table for the appropriate time you have Dinner do not serve anything. When she is home offer her a snack and just hang her an empty plate. Do not eat in front of her, I fucking hate this trick, but tell her you will not eat until she eats. (Obviously eat when she's not around) this one is fucking morbid and emotionally painful but drive her to cemeteries and funeral homes ask her to choose her casket so you won't get the wrong one. Get her to volunteer for cancer patients and see how they long to eat but can't. Take her to therapy lunches with her friends. Get ahold of her friends set up a picnic, no one eats until she does and when she does everyone eats the way she does. Always have fruit and veggies kept in odd places like in her bedroom on her bed or whatever, or on the bathroom sink (covered) on the coffee table, by the computer, you get the idea. But it's time to lay it on her. Anorexia is fucking evil and growing up feeling like a corpse is no way to spend days or years. Also, get rid of all your scales and if you must only have mirrors that can see your face. Anorexics love \"progress\" so remove all the ways she gets to see her \"progress\". Start putting parental controls on your wifi and her phone. Ban all social media, tik toc, Tumblr,  Reddit plus many others. Do not allow her to go out for exercise without supervision there are 2 good reasons for this one she won't be able to over-exercise and you know she is safe and hasn't passed out anywhere. Take her to her therapy Apts. DRs. Apts etc etc. \n\nIf she's mad good showing emotions or feelings, in general, it can break down that wall and you're getting somewhere. Or she could just retreat more into herself. But at this point I think she needs a reality check and sometimes that reality check is harsh. But whatever keeps her alive.",
      "created_utc": 1670819487.0,
      "score": 5,
      "context": []
    },
    {
      "id": "izu9fl0",
      "author": "runninginbubbles",
      "body": "Oh my heart goes out for you. I am so sorry I have no solutions. The system is so much bigger than us, it feels impossible to fight. I am so angry on your behalf, and so sad for her. Please keep us updated.\n\nI recommend the Around the Dinner Table Forum - a free service for parents of children with eating disorders. There are some really experienced parents on there x \n\n[https://www.feast-ed.org/forum/](https://www.feast-ed.org/forum/)\n\nYou can browse through some of the recent discussions without joining here [https://www.feast-ed.org/forum/?p=around-the-dinner-table-online-forum-for-parents-and-carers-136439](https://www.feast-ed.org/forum/?p=around-the-dinner-table-online-forum-for-parents-and-carers-136439)",
      "created_utc": 1670796273.0,
      "score": 5,
      "context": []
    },
    {
      "id": "izuvypg",
      "author": "DependentGlum9603",
      "body": "Honestly try finding the root cause of why and as much as shell probably bead about it right now try to figure out what shes looking at online, proana content is so prevalent you dont even have to look for it.",
      "created_utc": 1670806042.0,
      "score": 4,
      "context": []
    },
    {
      "id": "izvv7ln",
      "author": "BraveSpinach",
      "body": "when I was at my worst i would have needed the following things desperately:\n\na stash of safefoods\n\nknowing that my parents love me (not just the feeling of play pretend love, because it would look bad for them if i died)\n\nanything to regain control over myself and my live ( felt  like no matter what i did nothing would change)\n\na change of scenery new school, new people \n\nbeing taken away all the clothes i intentionally bought to small\n\nno mirror non at all!\n\nno scales \n\na journal nobody would read\n\nsupervised water intake, i drank water instead of eating",
      "created_utc": 1670823751.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j016ed4",
      "author": "Sn0wF0x44",
      "body": "I know it is might sound horrible to those who suffer from anorexia (I am diagnosed with anorexia so I suffer from it too) but you should add secretly to her meals whenever she eats calories like healthy fats and such without knowing it literly have everything with food additives add to zero coke  a bunch of liquid vitamins whatever it is, cayse the most I have been able to stahy without food is a day and to me this case sounds really extreme",
      "created_utc": 1670923876.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iztw9fu",
      "author": "recoverybitches",
      "body": "Tell her about ng tubes and how if she doesn't eat shes gonna get one whether she likes it or not",
      "created_utc": 1670790960.0,
      "score": -22,
      "context": []
    },
    {
      "id": "izuxd6z",
      "author": "imatrainchoo",
      "body": "I am a kid and I am currently dealing with this. When I’ve been this sick they put me in Inpatient. It’s traumatized me to go there but guess what, I am alive because I went there",
      "created_utc": 1670806699.0,
      "score": 1,
      "context": []
    },
    {
      "id": "izvibdn",
      "author": "Hypaingeas",
      "body": "We only have this problem because of some sense of deep self hatred. I don’t know her personality. But just do your best to make her feel loved. Genuinely look in your heart and think of things that make you love her, and tell her. Tell her you admire her discipline, and that’s she’s stronger than you. Give her a reason to want to recover. She doesn’t want support. She wants to be humanized.",
      "created_utc": 1670816610.0,
      "score": 1,
      "context": []
    },
    {
      "id": "izvikhp",
      "author": "Evergreenpoppy",
      "body": "ERC causes a lot of trauma (as can many places), but as someone who has been to many many hospitals and treatment centers, center for change helped me the most",
      "created_utc": 1670816735.0,
      "score": 1,
      "context": []
    },
    {
      "id": "izx4bg5",
      "author": "anonymous0271",
      "body": "Take her phone away. When I was struggling I was constantly looking up calories in things such as toothpaste, it was that intense. I had online forums, calorie tracker apps, etc.. it was very very unhealthy and if she’s speaking to people from treatment, there’s a good chance they’re “supporting” her and vice versa to stay on track with the restriction and losing weight. Phones are very very dangerous when it comes to eating disorders, addiction, etc. it’s rarely something that happens with no underlying cause, mine was sexual abuse, everyone is different but try to figure out what is triggering this to happen as well to have it properly addressed.",
      "created_utc": 1670855593.0,
      "score": 1,
      "context": []
    },
    {
      "id": "izy1b0i",
      "author": "maybunniee",
      "body": "I keep hearing words thrown around like stubborn and other words that make me sad. You have to remember that she is a child being exposed to terrible things that to her is bringing her comfort. Why would anyone want to give up something that’s giving them not only comfort but a sense of purpose. EDs are tricky and I wouldn’t so much say she is stubborn but more so that she’s very far down the rabbit whole and needs repeated constant support. I know that you are doing that already but please just be patient with her. This isn’t her fault. This could stem from being suicidal, OCD, trauma, self hatred, or people that are keeping her sick. I would explore other additional diagnoses to maybe find the root of the problem. For me it was trauma, OCD and feeling like I deserved to be sick. Maybe see if she keeps a journal somewhere. Im not saying to break her privacy but you might find out more about what’s really going on in her head. Just remember it’s not her fault and it’s not yours. She is Ill. Her brain is contaminated with dark thoughts. She’s at an age where she’s exploring things and this has stuck with her. Finding something I was passionate about helped me. I found circus arts which required my body be in good shape so that gave me the motivation to fuel my body to allow me to do what I loved.",
      "created_utc": 1670868928.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iztybdn",
      "author": "bjosker13",
      "body": "Thank you for your kind message",
      "created_utc": 1670791754.0,
      "score": 22,
      "context": [
        {
          "id": "iztsnpp",
          "author": "MieraJ",
          "body": "4 days is the most I could go without food too. Warm soup is a good way to add calories as well as it helps to expand the stomach before she is ready to eat with normal portion.\n\nTalk about calories with her and if you're not sure, ask, don't assume. Ask her how much calories is she comfortable with for the time being. If she said lower than 1000 cals, maybe you can add 50 cals more. If she said 500 cals, maybe you can add 100 more. It's really like a bargain, and so much practice in gentle parenting. Little by little, keep on adding the calories, you don't want to rush it, it can be very stressful and depressing. \n\nSome people don't want to talk about calories at all, so asking her what she expect from you as a parent is very important. \n\nLastly, praise her for communicating and tell her you're not forcing her to eat, you're trying to provide her nourishment. Tell her everything about her that you love, but not weight or her appearance.\n\nIf she's a bit stubborn, I'm really sorry, I can't help, but I hope you're patient with her. This is hard for everyone. I hear you, and I understand.",
          "created_utc": 1670789592.0
        }
      ]
    },
    {
      "id": "izugqvp",
      "author": "bjosker13",
      "body": "Thank you for your perspective. We are all exceptionally fortunate in that she has an excellent support system in place - her caregivers and her team. I’m a licensed therapist and have the emotional capacity and understanding BUT she is non communicative and appears to have given up. She sits at the table and stares at nothing. She won’t touch any food and we just sit patiently beside her trying not to freak the hell out. We’ve tried games as distractions and tv and I read to her sometimes. She’s not willing to communicate her inner emotions and I can’t help her if she won’t respond.",
      "created_utc": 1670799375.0,
      "score": 14,
      "context": [
        {
          "id": "izufaih",
          "author": "None",
          "body": "I remember being her age and having a similar problem, albeit not as severe but from a patient to you, I can tell you what I would've wanted when I was 13 and in that position.\nThere is something causing this, for me it was my hatred of school, there will be something going on that's overwhelming her. There will be a root cause of it, and that's what needs to be looked at. As a patient, I wish my parents had had more compassion in that area and actually sat me down and tried to understand why I was doung it instead of just looking at forcing food at me, that would never have worked for me which is why I'm still battling all these years later. She could be being bullied at school, there might be things at home stressing her out, hormones, choosing GCSE's or whatever your countries equivalent is, anything like that.\nAs I parent, I would've wanted to be understood with why I was doing it, and trying to help the situation instead of 'lets just keep pushing food in front of her and tell her that all these awful things will happen if she doesnt eat it'. She's almost certainly getting that from therapists and dieticians who are there to be harsh and tell her to eat and probably scaring her. As her parent, I suggest you be the compassionate one, you be the one that helps with the emotional side, ask her what she needs, ask her what could improve her mood and her life.\nThe system is so bad, and trust me, I've been in hospital multiple times in the last few weeks and in the doctors, and they keep saying they'll chase up the referral, and everyday I never get the letter. They dont understand even when you're there, I got told off because I said havinf scales in my bedroom would make my problem worse, they just dont get it. I wish my family tried harder to understand instead of getting it in treatment then coming home to it as well.\nEveryone's situation is different, but I have been a teenage girl with anorexia not long ago, I can relate to what she's going through and I wouldn't go back to that for anything, so if you need someone who kind of gets it, I'm here. I can try and help explain things from my own experiences to help you.",
          "created_utc": 1670798752.0
        }
      ]
    },
    {
      "id": "izu45qc",
      "author": "bjosker13",
      "body": "Thanks. She’s only 13 and doesn’t want to go anywhere or do anything. It’s awful. We have nothing to incentivize her with.",
      "created_utc": 1670794082.0,
      "score": 21,
      "context": [
        {
          "id": "izu0xgq",
          "author": "warmcatbellyfuzz",
          "body": "Mom took away my car keys and wouldn’t even let me go to school or do extracurriculares unless I ate and attended appointments. I hated her for it but it kept me alive.",
          "created_utc": 1670792782.0
        }
      ]
    },
    {
      "id": "izushv2",
      "author": "bjosker13",
      "body": "This sounds so much like her. Thank you for sharing your experience. We have 4 dogs and got her a bearded dragon as an incentive when she got out of res. She was kicking ass for a week or so and now she’s in the deep end again. She can’t even take care of the lizard anymore because she’s so sick",
      "created_utc": 1670804466.0,
      "score": 7,
      "context": [
        {
          "id": "izus5ko",
          "author": "Lillith915",
          "body": "I don’t know exactly what to say about this except I remember doing very similar things and I wish my parents had given this much of a shit. I also remember that the more people called attention to what I was doing the more I dug my heels in. The feeling of hunger was so addicting because it was the only thing I had control over. Maybe if I’d had other responsibilities in my life and felt needed I would not have starved. This is just my personal account and I’m not trying to speak for your daughter but I sincerely hope she can get past this part of her life. It gets better. Again this is totally just my experience but getting a pet helped me immensely because I couldn’t afford to be so sick and away from them because they needed me. Good luck 🍀",
          "created_utc": 1670804315.0
        }
      ]
    },
    {
      "id": "izvoeun",
      "author": "BotGivesBot",
      "body": "She shouldn’t have access to any of these devices right now. They are reenforcing her ED.",
      "created_utc": 1670819747.0,
      "score": 8,
      "context": [
        {
          "id": "izvmdzz",
          "author": "bjosker13",
          "body": "Thanks to all who’ve chimed in and been supportive in one way or another \nWe checked her phone and iPad and laptop and sure as shit she’s been researching all things Ed and starvation \nWe’re shocked but not at all.",
          "created_utc": 1670818674.0
        }
      ]
    },
    {
      "id": "izum20c",
      "author": "bjosker13",
      "body": "She’s been to full residential care. Ng tube for most of the time. We’re trying to get her into another facility asap. They were successful in weight restoration but NOT mental health",
      "created_utc": 1670801663.0,
      "score": 11,
      "context": [
        {
          "id": "izujv25",
          "author": "Future_Appearance_59",
          "body": "Go full inpatient rehab. It may take a few tries if it's that severe but it helps",
          "created_utc": 1670800711.0
        }
      ]
    },
    {
      "id": "iztl732",
      "author": "bjosker13",
      "body": "Sigh, yes, she’s sensitive and exceptionally bright and has had some smaller t traumas. She has twice weekly therapy and twice weekly dietitian appointments. She’s unable to process much though as she starved herself. I’m terrified of sending her to res again as there was a lot of trauma accumulated there",
      "created_utc": 1670786762.0,
      "score": 8,
      "context": [
        {
          "id": "iztkisa",
          "author": "Asspieburgers",
          "body": "Please excuse me if I'm misreading or making assumptions about her prior treatment \n\nHas she ever had trauma of any kind? My girlfriend (AN-BP) informs me frequently (I have memory issues) that EDs mostly arise from trauma. [See here](https://www.nationaleatingdisorders.org/blog/eating-disorders-trauma-ptsd-recovery). Could there be some trauma that she isn't telling you, or anyone else, about (for whatever reason that may be – and there could be many, including guilt, shame and fear)? Has she explored any of that with a psychologist/psychotherapist?\n\nKeep in mind that public hospital wards may only treat the symptoms (in this case malnourishment) and not the cause(s). To treat the causes she probably needs one-on-one psychological intervention and/or an inpatient stay at a *good* ED clinic (there are too many below average of those, my girlfriend tells me)",
          "created_utc": 1670786502.0
        }
      ]
    },
    {
      "id": "iztzsvv",
      "author": "SnapshotOfACrowd",
      "body": "This is bad advice. And not only because you made an assumption that doesn’t apply.\n\nIf it was supposed to be jokey it wasn’t funny.",
      "created_utc": 1670792333.0,
      "score": 11,
      "context": [
        {
          "id": "iztw9fu",
          "author": "recoverybitches",
          "body": "Tell her about ng tubes and how if she doesn't eat shes gonna get one whether she likes it or not",
          "created_utc": 1670790960.0
        }
      ]
    },
    {
      "id": "izty0vr",
      "author": "bjosker13",
      "body": "She had a tube for 10w",
      "created_utc": 1670791642.0,
      "score": 10,
      "context": [
        {
          "id": "iztw9fu",
          "author": "recoverybitches",
          "body": "Tell her about ng tubes and how if she doesn't eat shes gonna get one whether she likes it or not",
          "created_utc": 1670790960.0
        }
      ]
    },
    {
      "id": "izv62gr",
      "author": "fibonaccihoe",
      "body": "I would really suggest you evaluate her social media use if that’s a possible factor. Anorexia is highly publicized on apps like twitter, tik tok, instagram, tumblr, etc, and it could be making her symptoms more intense by feeding her negative thought patterns and encouraging her behavior. If she’s using those apps, it may be best to restrict/eliminate her use for now. I hope she gets the help she needs and your family finds peace.",
      "created_utc": 1670810753.0,
      "score": 15,
      "context": [
        {
          "id": "izufaih",
          "author": "None",
          "body": "I remember being her age and having a similar problem, albeit not as severe but from a patient to you, I can tell you what I would've wanted when I was 13 and in that position.\nThere is something causing this, for me it was my hatred of school, there will be something going on that's overwhelming her. There will be a root cause of it, and that's what needs to be looked at. As a patient, I wish my parents had had more compassion in that area and actually sat me down and tried to understand why I was doung it instead of just looking at forcing food at me, that would never have worked for me which is why I'm still battling all these years later. She could be being bullied at school, there might be things at home stressing her out, hormones, choosing GCSE's or whatever your countries equivalent is, anything like that.\nAs I parent, I would've wanted to be understood with why I was doing it, and trying to help the situation instead of 'lets just keep pushing food in front of her and tell her that all these awful things will happen if she doesnt eat it'. She's almost certainly getting that from therapists and dieticians who are there to be harsh and tell her to eat and probably scaring her. As her parent, I suggest you be the compassionate one, you be the one that helps with the emotional side, ask her what she needs, ask her what could improve her mood and her life.\nThe system is so bad, and trust me, I've been in hospital multiple times in the last few weeks and in the doctors, and they keep saying they'll chase up the referral, and everyday I never get the letter. They dont understand even when you're there, I got told off because I said havinf scales in my bedroom would make my problem worse, they just dont get it. I wish my family tried harder to understand instead of getting it in treatment then coming home to it as well.\nEveryone's situation is different, but I have been a teenage girl with anorexia not long ago, I can relate to what she's going through and I wouldn't go back to that for anything, so if you need someone who kind of gets it, I'm here. I can try and help explain things from my own experiences to help you.",
          "created_utc": 1670798752.0
        },
        {
          "id": "izugqvp",
          "author": "bjosker13",
          "body": "Thank you for your perspective. We are all exceptionally fortunate in that she has an excellent support system in place - her caregivers and her team. I’m a licensed therapist and have the emotional capacity and understanding BUT she is non communicative and appears to have given up. She sits at the table and stares at nothing. She won’t touch any food and we just sit patiently beside her trying not to freak the hell out. We’ve tried games as distractions and tv and I read to her sometimes. She’s not willing to communicate her inner emotions and I can’t help her if she won’t respond.",
          "created_utc": 1670799375.0
        }
      ]
    },
    {
      "id": "izui3ra",
      "author": "None",
      "body": "Been there, I get what you mean now, I completely understand. I did exactly the same thing. I still sometimes do even now living alone I will do that same thing. My parents would do the same as you in response.\nHere's what was going through my head at that stage:\nI was depressed about school. And in early teens, you feel like parents and adults just cant understand that. It wasnt so much a losing weight thing but a depression thing, I felt like I'd given up because I was in a place that I hated every single day and nothing seemed to make it better, I couldnt see a way out and it getting better. Hell I'm in college now and I'm still counting down the days until the end, I still feel that way sometimes. I wouldn't tell people how I was feeling because to adults it looked like such a petty problem, but to a 13 year old, it's a lot to contend with.\nThat giving up thing I relate to. For me it's because I was in a situatiom that I felt I couldn't explain to people, they couldn't understand. I was embarassed, I didnt want to discuss it with adults. I felt like I was trying so hard and it wasnt enough so I gave up. Have you tried to talk to someone her age, her friends? See if she's spoken to them about anything. Teen girls talk to eachother about problems, and they're at school with her so it makrs sense that they'd be able to tell her things she wouldnt tell you and you might get more of an insight into the underlying problem",
      "created_utc": 1670799948.0,
      "score": 3,
      "context": [
        {
          "id": "izufaih",
          "author": "None",
          "body": "I remember being her age and having a similar problem, albeit not as severe but from a patient to you, I can tell you what I would've wanted when I was 13 and in that position.\nThere is something causing this, for me it was my hatred of school, there will be something going on that's overwhelming her. There will be a root cause of it, and that's what needs to be looked at. As a patient, I wish my parents had had more compassion in that area and actually sat me down and tried to understand why I was doung it instead of just looking at forcing food at me, that would never have worked for me which is why I'm still battling all these years later. She could be being bullied at school, there might be things at home stressing her out, hormones, choosing GCSE's or whatever your countries equivalent is, anything like that.\nAs I parent, I would've wanted to be understood with why I was doing it, and trying to help the situation instead of 'lets just keep pushing food in front of her and tell her that all these awful things will happen if she doesnt eat it'. She's almost certainly getting that from therapists and dieticians who are there to be harsh and tell her to eat and probably scaring her. As her parent, I suggest you be the compassionate one, you be the one that helps with the emotional side, ask her what she needs, ask her what could improve her mood and her life.\nThe system is so bad, and trust me, I've been in hospital multiple times in the last few weeks and in the doctors, and they keep saying they'll chase up the referral, and everyday I never get the letter. They dont understand even when you're there, I got told off because I said havinf scales in my bedroom would make my problem worse, they just dont get it. I wish my family tried harder to understand instead of getting it in treatment then coming home to it as well.\nEveryone's situation is different, but I have been a teenage girl with anorexia not long ago, I can relate to what she's going through and I wouldn't go back to that for anything, so if you need someone who kind of gets it, I'm here. I can try and help explain things from my own experiences to help you.",
          "created_utc": 1670798752.0
        },
        {
          "id": "izugqvp",
          "author": "bjosker13",
          "body": "Thank you for your perspective. We are all exceptionally fortunate in that she has an excellent support system in place - her caregivers and her team. I’m a licensed therapist and have the emotional capacity and understanding BUT she is non communicative and appears to have given up. She sits at the table and stares at nothing. She won’t touch any food and we just sit patiently beside her trying not to freak the hell out. We’ve tried games as distractions and tv and I read to her sometimes. She’s not willing to communicate her inner emotions and I can’t help her if she won’t respond.",
          "created_utc": 1670799375.0
        }
      ]
    },
    {
      "id": "izy67e3",
      "author": "tinyandfurious",
      "body": "Phone/computer. Bet you will get some sort of reaction if you take those away. I’m a mother of a 14 yr old girl who literally doesn’t give a shit about anything else. I’m also a sufferer of an ED and I know for a fact a large contributor for me was my phone/computer. The forums. But like everyone else has said, it’s not about food. Try to connect on another level. For me it started when I felt like everything was out of control. My reaction was control the thing I knew I could…eating. Try to see what’s bothering her. You will have to be creative and patient and as scary as it is DO NOT GET ANGRY AND YELL AND SCREAM AT HER!!!  People tried that with me and all it did was drive me deeper into the hole I was in. My reactions was always, I’ll just not eat. Then everything will be ok. I know….it’s dumb but this is how this thing works. It’s not about the food. It’s all in the mind and emotions. It becomes an addiction.",
      "created_utc": 1670870777.0,
      "score": 3,
      "context": [
        {
          "id": "izu0xgq",
          "author": "warmcatbellyfuzz",
          "body": "Mom took away my car keys and wouldn’t even let me go to school or do extracurriculares unless I ate and attended appointments. I hated her for it but it kept me alive.",
          "created_utc": 1670792782.0
        },
        {
          "id": "izu45qc",
          "author": "bjosker13",
          "body": "Thanks. She’s only 13 and doesn’t want to go anywhere or do anything. It’s awful. We have nothing to incentivize her with.",
          "created_utc": 1670794082.0
        }
      ]
    },
    {
      "id": "izutuuf",
      "author": "Lillith915",
      "body": "Sounds like a pet isn’t her thing then. I’d be curious to know what exactly her goal is by starving herself, that might help you figure out what to do. I assume you’ve asked her about what she is going through though. Ana’s voice is very convincing. I was trying to control my surroundings but that is not the case for everyone. Something else I remember that helped a lot was eating with someone but not a caretaker. Just sit with them and talk and eventually I’d start eating a little bit. If they tried to convince me to eat though I would just leave. I know it’s tempting to talk about the food but offering it without speaking about the food itself might help. Food is the obsession so she’s already thinking about it all the time. I’m glad you aren’t giving up and I wish I could help more.",
      "created_utc": 1670805081.0,
      "score": 8,
      "context": [
        {
          "id": "izus5ko",
          "author": "Lillith915",
          "body": "I don’t know exactly what to say about this except I remember doing very similar things and I wish my parents had given this much of a shit. I also remember that the more people called attention to what I was doing the more I dug my heels in. The feeling of hunger was so addicting because it was the only thing I had control over. Maybe if I’d had other responsibilities in my life and felt needed I would not have starved. This is just my personal account and I’m not trying to speak for your daughter but I sincerely hope she can get past this part of her life. It gets better. Again this is totally just my experience but getting a pet helped me immensely because I couldn’t afford to be so sick and away from them because they needed me. Good luck 🍀",
          "created_utc": 1670804315.0
        },
        {
          "id": "izushv2",
          "author": "bjosker13",
          "body": "This sounds so much like her. Thank you for sharing your experience. We have 4 dogs and got her a bearded dragon as an incentive when she got out of res. She was kicking ass for a week or so and now she’s in the deep end again. She can’t even take care of the lizard anymore because she’s so sick",
          "created_utc": 1670804466.0
        }
      ]
    },
    {
      "id": "izvohjm",
      "author": "bjosker13",
      "body": "We’ve taken them",
      "created_utc": 1670819788.0,
      "score": 8,
      "context": [
        {
          "id": "izvmdzz",
          "author": "bjosker13",
          "body": "Thanks to all who’ve chimed in and been supportive in one way or another \nWe checked her phone and iPad and laptop and sure as shit she’s been researching all things Ed and starvation \nWe’re shocked but not at all.",
          "created_utc": 1670818674.0
        },
        {
          "id": "izvoeun",
          "author": "BotGivesBot",
          "body": "She shouldn’t have access to any of these devices right now. They are reenforcing her ED.",
          "created_utc": 1670819747.0
        }
      ]
    },
    {
      "id": "izuob95",
      "author": "Future_Appearance_59",
      "body": "Try it again, and then continue with a therapist who specializes in eating disorders, you can even continue with outpatient once she has completed in patient. Also, and this is extreme but bc I've been in her shoes I would look through her phone for things like \"meanspo,\" \"nicespo,\" \"pro ana\" \"pro ed\" \"thinspo\" \"ana coach\" \"Mia coach\" \"pro mia\" \" fatspo\" \"eating disorder coach\" \"ED coach\" \"thinspo coach\" \"just skinny things\" and other stuff and BLOCK IT. put a parental block on these searches in all search engines and apps bc they're on social media too.",
      "created_utc": 1670802639.0,
      "score": 8,
      "context": [
        {
          "id": "izujv25",
          "author": "Future_Appearance_59",
          "body": "Go full inpatient rehab. It may take a few tries if it's that severe but it helps",
          "created_utc": 1670800711.0
        },
        {
          "id": "izum20c",
          "author": "bjosker13",
          "body": "She’s been to full residential care. Ng tube for most of the time. We’re trying to get her into another facility asap. They were successful in weight restoration but NOT mental health",
          "created_utc": 1670801663.0
        }
      ]
    },
    {
      "id": "izv5lv6",
      "author": "warmcatbellyfuzz",
      "body": "It almost never sticks the first time. Repeated inpatient and PHP programs are often needed, especially if she was so severe as to need an NG tube. As cruel as it seems, Without nutrition and weight restoration, the mental health aspect of recovery can not progress. Starvation exacerbates the depressive, anxious, and compulsive tendencies of the brain.",
      "created_utc": 1670810544.0,
      "score": 3,
      "context": [
        {
          "id": "izujv25",
          "author": "Future_Appearance_59",
          "body": "Go full inpatient rehab. It may take a few tries if it's that severe but it helps",
          "created_utc": 1670800711.0
        },
        {
          "id": "izum20c",
          "author": "bjosker13",
          "body": "She’s been to full residential care. Ng tube for most of the time. We’re trying to get her into another facility asap. They were successful in weight restoration but NOT mental health",
          "created_utc": 1670801663.0
        }
      ]
    },
    {
      "id": "j00c2ye",
      "author": "Asspieburgers",
      "body": ">she’s sensitive and exceptionally bright\n\nI swear, the more I see it, the more it becomes apparent that it's almost always the bright ones that suffer from it. Sitting in an outpatient program with my girlfriend, it's clear that all of them are *very* intelligent people\n\n>She’s unable to process much though as she starved herself.\n\nDamn, I know what you mean, my girlfriend gets there, too 😞😞 It's frightening as fuck.\n\nI'm actually starting an ED carers' support subreddit for people to come together to help each other through supporting loved ones/friends through recovery. I don't know how helpful it would be, or if it would have enough people to warrant it 🤔 I'm still writing up rules (though I am autistic and I can sometimes be moderately off base 😅).\n\nI'm thinking of asking the moderators here what they think of the rules once I'm done, before I open the subreddit. If you want, I can PM you it once I'm finished creating it",
      "created_utc": 1670903251.0,
      "score": 2,
      "context": [
        {
          "id": "iztkisa",
          "author": "Asspieburgers",
          "body": "Please excuse me if I'm misreading or making assumptions about her prior treatment \n\nHas she ever had trauma of any kind? My girlfriend (AN-BP) informs me frequently (I have memory issues) that EDs mostly arise from trauma. [See here](https://www.nationaleatingdisorders.org/blog/eating-disorders-trauma-ptsd-recovery). Could there be some trauma that she isn't telling you, or anyone else, about (for whatever reason that may be – and there could be many, including guilt, shame and fear)? Has she explored any of that with a psychologist/psychotherapist?\n\nKeep in mind that public hospital wards may only treat the symptoms (in this case malnourishment) and not the cause(s). To treat the causes she probably needs one-on-one psychological intervention and/or an inpatient stay at a *good* ED clinic (there are too many below average of those, my girlfriend tells me)",
          "created_utc": 1670786502.0
        },
        {
          "id": "iztl732",
          "author": "bjosker13",
          "body": "Sigh, yes, she’s sensitive and exceptionally bright and has had some smaller t traumas. She has twice weekly therapy and twice weekly dietitian appointments. She’s unable to process much though as she starved herself. I’m terrified of sending her to res again as there was a lot of trauma accumulated there",
          "created_utc": 1670786762.0
        }
      ]
    },
    {
      "id": "iztt4qt",
      "author": "bjosker13",
      "body": "Thank you for the kind words of support. She’s a stubborn mule.",
      "created_utc": 1670789765.0,
      "score": 5,
      "context": [
        {
          "id": "iztkisa",
          "author": "Asspieburgers",
          "body": "Please excuse me if I'm misreading or making assumptions about her prior treatment \n\nHas she ever had trauma of any kind? My girlfriend (AN-BP) informs me frequently (I have memory issues) that EDs mostly arise from trauma. [See here](https://www.nationaleatingdisorders.org/blog/eating-disorders-trauma-ptsd-recovery). Could there be some trauma that she isn't telling you, or anyone else, about (for whatever reason that may be – and there could be many, including guilt, shame and fear)? Has she explored any of that with a psychologist/psychotherapist?\n\nKeep in mind that public hospital wards may only treat the symptoms (in this case malnourishment) and not the cause(s). To treat the causes she probably needs one-on-one psychological intervention and/or an inpatient stay at a *good* ED clinic (there are too many below average of those, my girlfriend tells me)",
          "created_utc": 1670786502.0
        },
        {
          "id": "iztl732",
          "author": "bjosker13",
          "body": "Sigh, yes, she’s sensitive and exceptionally bright and has had some smaller t traumas. She has twice weekly therapy and twice weekly dietitian appointments. She’s unable to process much though as she starved herself. I’m terrified of sending her to res again as there was a lot of trauma accumulated there",
          "created_utc": 1670786762.0
        }
      ]
    },
    {
      "id": "izubsd5",
      "author": "recoverybitches",
      "body": "Wym assumption I told op something that could help bc most anorexics will do anything to not get the tube",
      "created_utc": 1670797270.0,
      "score": -10,
      "context": [
        {
          "id": "iztw9fu",
          "author": "recoverybitches",
          "body": "Tell her about ng tubes and how if she doesn't eat shes gonna get one whether she likes it or not",
          "created_utc": 1670790960.0
        },
        {
          "id": "iztzsvv",
          "author": "SnapshotOfACrowd",
          "body": "This is bad advice. And not only because you made an assumption that doesn’t apply.\n\nIf it was supposed to be jokey it wasn’t funny.",
          "created_utc": 1670792333.0
        }
      ]
    },
    {
      "id": "izuim2g",
      "author": "bjosker13",
      "body": "She has isolated herself from almost everyone. I think she’s on Snapchat and talks to ppl she met at the residential treatment center (not sure if this is good or bad). She’s always struggled to advocate for herself and this is now an extreme situation of that.",
      "created_utc": 1670800165.0,
      "score": 5,
      "context": [
        {
          "id": "izufaih",
          "author": "None",
          "body": "I remember being her age and having a similar problem, albeit not as severe but from a patient to you, I can tell you what I would've wanted when I was 13 and in that position.\nThere is something causing this, for me it was my hatred of school, there will be something going on that's overwhelming her. There will be a root cause of it, and that's what needs to be looked at. As a patient, I wish my parents had had more compassion in that area and actually sat me down and tried to understand why I was doung it instead of just looking at forcing food at me, that would never have worked for me which is why I'm still battling all these years later. She could be being bullied at school, there might be things at home stressing her out, hormones, choosing GCSE's or whatever your countries equivalent is, anything like that.\nAs I parent, I would've wanted to be understood with why I was doing it, and trying to help the situation instead of 'lets just keep pushing food in front of her and tell her that all these awful things will happen if she doesnt eat it'. She's almost certainly getting that from therapists and dieticians who are there to be harsh and tell her to eat and probably scaring her. As her parent, I suggest you be the compassionate one, you be the one that helps with the emotional side, ask her what she needs, ask her what could improve her mood and her life.\nThe system is so bad, and trust me, I've been in hospital multiple times in the last few weeks and in the doctors, and they keep saying they'll chase up the referral, and everyday I never get the letter. They dont understand even when you're there, I got told off because I said havinf scales in my bedroom would make my problem worse, they just dont get it. I wish my family tried harder to understand instead of getting it in treatment then coming home to it as well.\nEveryone's situation is different, but I have been a teenage girl with anorexia not long ago, I can relate to what she's going through and I wouldn't go back to that for anything, so if you need someone who kind of gets it, I'm here. I can try and help explain things from my own experiences to help you.",
          "created_utc": 1670798752.0
        },
        {
          "id": "izugqvp",
          "author": "bjosker13",
          "body": "Thank you for your perspective. We are all exceptionally fortunate in that she has an excellent support system in place - her caregivers and her team. I’m a licensed therapist and have the emotional capacity and understanding BUT she is non communicative and appears to have given up. She sits at the table and stares at nothing. She won’t touch any food and we just sit patiently beside her trying not to freak the hell out. We’ve tried games as distractions and tv and I read to her sometimes. She’s not willing to communicate her inner emotions and I can’t help her if she won’t respond.",
          "created_utc": 1670799375.0
        },
        {
          "id": "izui3ra",
          "author": "None",
          "body": "Been there, I get what you mean now, I completely understand. I did exactly the same thing. I still sometimes do even now living alone I will do that same thing. My parents would do the same as you in response.\nHere's what was going through my head at that stage:\nI was depressed about school. And in early teens, you feel like parents and adults just cant understand that. It wasnt so much a losing weight thing but a depression thing, I felt like I'd given up because I was in a place that I hated every single day and nothing seemed to make it better, I couldnt see a way out and it getting better. Hell I'm in college now and I'm still counting down the days until the end, I still feel that way sometimes. I wouldn't tell people how I was feeling because to adults it looked like such a petty problem, but to a 13 year old, it's a lot to contend with.\nThat giving up thing I relate to. For me it's because I was in a situatiom that I felt I couldn't explain to people, they couldn't understand. I was embarassed, I didnt want to discuss it with adults. I felt like I was trying so hard and it wasnt enough so I gave up. Have you tried to talk to someone her age, her friends? See if she's spoken to them about anything. Teen girls talk to eachother about problems, and they're at school with her so it makrs sense that they'd be able to tell her things she wouldnt tell you and you might get more of an insight into the underlying problem",
          "created_utc": 1670799948.0
        }
      ]
    },
    {
      "id": "izuptgt",
      "author": "Lemon_m1lk",
      "body": "For me, at the worst of my anorexia, the only thing going through my head was my fear of food and controlling what I ate. I couldn’t even think of school, friends, or anything else. It is very hard to distract in that headspace because it’s not just a lack of appetite, it is ACTIVELY not eating.\n\nThat being said, having a good support system is key because it is VERY hard to overcome anorexia alone. Also, see if you can find a primary care doctor who will have her admitted to hospital. That  kind of all-in treatment was what caused me to recover.",
      "created_utc": 1670803293.0,
      "score": 3,
      "context": [
        {
          "id": "izufaih",
          "author": "None",
          "body": "I remember being her age and having a similar problem, albeit not as severe but from a patient to you, I can tell you what I would've wanted when I was 13 and in that position.\nThere is something causing this, for me it was my hatred of school, there will be something going on that's overwhelming her. There will be a root cause of it, and that's what needs to be looked at. As a patient, I wish my parents had had more compassion in that area and actually sat me down and tried to understand why I was doung it instead of just looking at forcing food at me, that would never have worked for me which is why I'm still battling all these years later. She could be being bullied at school, there might be things at home stressing her out, hormones, choosing GCSE's or whatever your countries equivalent is, anything like that.\nAs I parent, I would've wanted to be understood with why I was doing it, and trying to help the situation instead of 'lets just keep pushing food in front of her and tell her that all these awful things will happen if she doesnt eat it'. She's almost certainly getting that from therapists and dieticians who are there to be harsh and tell her to eat and probably scaring her. As her parent, I suggest you be the compassionate one, you be the one that helps with the emotional side, ask her what she needs, ask her what could improve her mood and her life.\nThe system is so bad, and trust me, I've been in hospital multiple times in the last few weeks and in the doctors, and they keep saying they'll chase up the referral, and everyday I never get the letter. They dont understand even when you're there, I got told off because I said havinf scales in my bedroom would make my problem worse, they just dont get it. I wish my family tried harder to understand instead of getting it in treatment then coming home to it as well.\nEveryone's situation is different, but I have been a teenage girl with anorexia not long ago, I can relate to what she's going through and I wouldn't go back to that for anything, so if you need someone who kind of gets it, I'm here. I can try and help explain things from my own experiences to help you.",
          "created_utc": 1670798752.0
        },
        {
          "id": "izugqvp",
          "author": "bjosker13",
          "body": "Thank you for your perspective. We are all exceptionally fortunate in that she has an excellent support system in place - her caregivers and her team. I’m a licensed therapist and have the emotional capacity and understanding BUT she is non communicative and appears to have given up. She sits at the table and stares at nothing. She won’t touch any food and we just sit patiently beside her trying not to freak the hell out. We’ve tried games as distractions and tv and I read to her sometimes. She’s not willing to communicate her inner emotions and I can’t help her if she won’t respond.",
          "created_utc": 1670799375.0
        },
        {
          "id": "izui3ra",
          "author": "None",
          "body": "Been there, I get what you mean now, I completely understand. I did exactly the same thing. I still sometimes do even now living alone I will do that same thing. My parents would do the same as you in response.\nHere's what was going through my head at that stage:\nI was depressed about school. And in early teens, you feel like parents and adults just cant understand that. It wasnt so much a losing weight thing but a depression thing, I felt like I'd given up because I was in a place that I hated every single day and nothing seemed to make it better, I couldnt see a way out and it getting better. Hell I'm in college now and I'm still counting down the days until the end, I still feel that way sometimes. I wouldn't tell people how I was feeling because to adults it looked like such a petty problem, but to a 13 year old, it's a lot to contend with.\nThat giving up thing I relate to. For me it's because I was in a situatiom that I felt I couldn't explain to people, they couldn't understand. I was embarassed, I didnt want to discuss it with adults. I felt like I was trying so hard and it wasnt enough so I gave up. Have you tried to talk to someone her age, her friends? See if she's spoken to them about anything. Teen girls talk to eachother about problems, and they're at school with her so it makrs sense that they'd be able to tell her things she wouldnt tell you and you might get more of an insight into the underlying problem",
          "created_utc": 1670799948.0
        }
      ]
    },
    {
      "id": "izvq2ph",
      "author": "BotGivesBot",
      "body": "That’s good. The less sources of reenforcement the better. \n\nI hope she’s able to find a treatment provider that can get to the source of the problem. AN is usually a symptom of an unresolved inner conflict or trauma. A need to control or punish oneself for harms done to them (unjustly) to the point of disappearing into nonexistence. It really is a cruel disorder. I wish you all the best.",
      "created_utc": 1670820668.0,
      "score": 5,
      "context": [
        {
          "id": "izvmdzz",
          "author": "bjosker13",
          "body": "Thanks to all who’ve chimed in and been supportive in one way or another \nWe checked her phone and iPad and laptop and sure as shit she’s been researching all things Ed and starvation \nWe’re shocked but not at all.",
          "created_utc": 1670818674.0
        },
        {
          "id": "izvoeun",
          "author": "BotGivesBot",
          "body": "She shouldn’t have access to any of these devices right now. They are reenforcing her ED.",
          "created_utc": 1670819747.0
        },
        {
          "id": "izvohjm",
          "author": "bjosker13",
          "body": "We’ve taken them",
          "created_utc": 1670819788.0
        }
      ]
    },
    {
      "id": "j1w2zde",
      "author": "well-wishess",
      "body": "This is the best thing you could’ve done. I hope you guys are all ok ❤️",
      "created_utc": 1672174569.0,
      "score": 2,
      "context": [
        {
          "id": "izvmdzz",
          "author": "bjosker13",
          "body": "Thanks to all who’ve chimed in and been supportive in one way or another \nWe checked her phone and iPad and laptop and sure as shit she’s been researching all things Ed and starvation \nWe’re shocked but not at all.",
          "created_utc": 1670818674.0
        },
        {
          "id": "izvoeun",
          "author": "BotGivesBot",
          "body": "She shouldn’t have access to any of these devices right now. They are reenforcing her ED.",
          "created_utc": 1670819747.0
        },
        {
          "id": "izvohjm",
          "author": "bjosker13",
          "body": "We’ve taken them",
          "created_utc": 1670819788.0
        }
      ]
    },
    {
      "id": "izuov9a",
      "author": "bjosker13",
      "body": "This is VERY helpful. She has a therapist now who’s a specialist in ED. Plus a dietian and a ceds pediatrician\nWe’re all fighting for her",
      "created_utc": 1670802878.0,
      "score": 9,
      "context": [
        {
          "id": "izujv25",
          "author": "Future_Appearance_59",
          "body": "Go full inpatient rehab. It may take a few tries if it's that severe but it helps",
          "created_utc": 1670800711.0
        },
        {
          "id": "izum20c",
          "author": "bjosker13",
          "body": "She’s been to full residential care. Ng tube for most of the time. We’re trying to get her into another facility asap. They were successful in weight restoration but NOT mental health",
          "created_utc": 1670801663.0
        },
        {
          "id": "izuob95",
          "author": "Future_Appearance_59",
          "body": "Try it again, and then continue with a therapist who specializes in eating disorders, you can even continue with outpatient once she has completed in patient. Also, and this is extreme but bc I've been in her shoes I would look through her phone for things like \"meanspo,\" \"nicespo,\" \"pro ana\" \"pro ed\" \"thinspo\" \"ana coach\" \"Mia coach\" \"pro mia\" \" fatspo\" \"eating disorder coach\" \"ED coach\" \"thinspo coach\" \"just skinny things\" and other stuff and BLOCK IT. put a parental block on these searches in all search engines and apps bc they're on social media too.",
          "created_utc": 1670802639.0
        }
      ]
    },
    {
      "id": "izuoi04",
      "author": "Future_Appearance_59",
      "body": "Also calorie counters, block it. Don't let her weigh herself or even look at what she weighs again.",
      "created_utc": 1670802720.0,
      "score": 3,
      "context": [
        {
          "id": "izujv25",
          "author": "Future_Appearance_59",
          "body": "Go full inpatient rehab. It may take a few tries if it's that severe but it helps",
          "created_utc": 1670800711.0
        },
        {
          "id": "izum20c",
          "author": "bjosker13",
          "body": "She’s been to full residential care. Ng tube for most of the time. We’re trying to get her into another facility asap. They were successful in weight restoration but NOT mental health",
          "created_utc": 1670801663.0
        },
        {
          "id": "izuob95",
          "author": "Future_Appearance_59",
          "body": "Try it again, and then continue with a therapist who specializes in eating disorders, you can even continue with outpatient once she has completed in patient. Also, and this is extreme but bc I've been in her shoes I would look through her phone for things like \"meanspo,\" \"nicespo,\" \"pro ana\" \"pro ed\" \"thinspo\" \"ana coach\" \"Mia coach\" \"pro mia\" \" fatspo\" \"eating disorder coach\" \"ED coach\" \"thinspo coach\" \"just skinny things\" and other stuff and BLOCK IT. put a parental block on these searches in all search engines and apps bc they're on social media too.",
          "created_utc": 1670802639.0
        }
      ]
    },
    {
      "id": "izuon6l",
      "author": "Future_Appearance_59",
      "body": "Go and see a nutrition therapist alongside everything I've mentioned as well. Ik it's a lot but anorexia nervosa is a lot",
      "created_utc": 1670802781.0,
      "score": 1,
      "context": [
        {
          "id": "izujv25",
          "author": "Future_Appearance_59",
          "body": "Go full inpatient rehab. It may take a few tries if it's that severe but it helps",
          "created_utc": 1670800711.0
        },
        {
          "id": "izum20c",
          "author": "bjosker13",
          "body": "She’s been to full residential care. Ng tube for most of the time. We’re trying to get her into another facility asap. They were successful in weight restoration but NOT mental health",
          "created_utc": 1670801663.0
        },
        {
          "id": "izuob95",
          "author": "Future_Appearance_59",
          "body": "Try it again, and then continue with a therapist who specializes in eating disorders, you can even continue with outpatient once she has completed in patient. Also, and this is extreme but bc I've been in her shoes I would look through her phone for things like \"meanspo,\" \"nicespo,\" \"pro ana\" \"pro ed\" \"thinspo\" \"ana coach\" \"Mia coach\" \"pro mia\" \" fatspo\" \"eating disorder coach\" \"ED coach\" \"thinspo coach\" \"just skinny things\" and other stuff and BLOCK IT. put a parental block on these searches in all search engines and apps bc they're on social media too.",
          "created_utc": 1670802639.0
        }
      ]
    },
    {
      "id": "izv8x5f",
      "author": "Conscious_Stretch_58",
      "body": "All of this⬆⬆⬆⬆ and yeah it almost never sticks the first time",
      "created_utc": 1670812057.0,
      "score": 3,
      "context": [
        {
          "id": "izujv25",
          "author": "Future_Appearance_59",
          "body": "Go full inpatient rehab. It may take a few tries if it's that severe but it helps",
          "created_utc": 1670800711.0
        },
        {
          "id": "izum20c",
          "author": "bjosker13",
          "body": "She’s been to full residential care. Ng tube for most of the time. We’re trying to get her into another facility asap. They were successful in weight restoration but NOT mental health",
          "created_utc": 1670801663.0
        },
        {
          "id": "izv5lv6",
          "author": "warmcatbellyfuzz",
          "body": "It almost never sticks the first time. Repeated inpatient and PHP programs are often needed, especially if she was so severe as to need an NG tube. As cruel as it seems, Without nutrition and weight restoration, the mental health aspect of recovery can not progress. Starvation exacerbates the depressive, anxious, and compulsive tendencies of the brain.",
          "created_utc": 1670810544.0
        }
      ]
    },
    {
      "id": "izuce8o",
      "author": "Schneeballschlacht",
      "body": "Her ED is a stubborn mule. She, most likely, is not. \n\nThat said, I wish my parents had shown so much care and love. I wish you and your daughter well.",
      "created_utc": 1670797527.0,
      "score": 15,
      "context": [
        {
          "id": "iztkisa",
          "author": "Asspieburgers",
          "body": "Please excuse me if I'm misreading or making assumptions about her prior treatment \n\nHas she ever had trauma of any kind? My girlfriend (AN-BP) informs me frequently (I have memory issues) that EDs mostly arise from trauma. [See here](https://www.nationaleatingdisorders.org/blog/eating-disorders-trauma-ptsd-recovery). Could there be some trauma that she isn't telling you, or anyone else, about (for whatever reason that may be – and there could be many, including guilt, shame and fear)? Has she explored any of that with a psychologist/psychotherapist?\n\nKeep in mind that public hospital wards may only treat the symptoms (in this case malnourishment) and not the cause(s). To treat the causes she probably needs one-on-one psychological intervention and/or an inpatient stay at a *good* ED clinic (there are too many below average of those, my girlfriend tells me)",
          "created_utc": 1670786502.0
        },
        {
          "id": "iztl732",
          "author": "bjosker13",
          "body": "Sigh, yes, she’s sensitive and exceptionally bright and has had some smaller t traumas. She has twice weekly therapy and twice weekly dietitian appointments. She’s unable to process much though as she starved herself. I’m terrified of sending her to res again as there was a lot of trauma accumulated there",
          "created_utc": 1670786762.0
        },
        {
          "id": "iztt4qt",
          "author": "bjosker13",
          "body": "Thank you for the kind words of support. She’s a stubborn mule.",
          "created_utc": 1670789765.0
        }
      ]
    },
    {
      "id": "izuhthx",
      "author": "ohitsasharkattack",
      "body": "To say she is a stubborn mule sounds so harsh, shes likely in the depths of hell herself",
      "created_utc": 1670799826.0,
      "score": -7,
      "context": [
        {
          "id": "iztkisa",
          "author": "Asspieburgers",
          "body": "Please excuse me if I'm misreading or making assumptions about her prior treatment \n\nHas she ever had trauma of any kind? My girlfriend (AN-BP) informs me frequently (I have memory issues) that EDs mostly arise from trauma. [See here](https://www.nationaleatingdisorders.org/blog/eating-disorders-trauma-ptsd-recovery). Could there be some trauma that she isn't telling you, or anyone else, about (for whatever reason that may be – and there could be many, including guilt, shame and fear)? Has she explored any of that with a psychologist/psychotherapist?\n\nKeep in mind that public hospital wards may only treat the symptoms (in this case malnourishment) and not the cause(s). To treat the causes she probably needs one-on-one psychological intervention and/or an inpatient stay at a *good* ED clinic (there are too many below average of those, my girlfriend tells me)",
          "created_utc": 1670786502.0
        },
        {
          "id": "iztl732",
          "author": "bjosker13",
          "body": "Sigh, yes, she’s sensitive and exceptionally bright and has had some smaller t traumas. She has twice weekly therapy and twice weekly dietitian appointments. She’s unable to process much though as she starved herself. I’m terrified of sending her to res again as there was a lot of trauma accumulated there",
          "created_utc": 1670786762.0
        },
        {
          "id": "iztt4qt",
          "author": "bjosker13",
          "body": "Thank you for the kind words of support. She’s a stubborn mule.",
          "created_utc": 1670789765.0
        }
      ]
    },
    {
      "id": "izx40pr",
      "author": "SnapshotOfACrowd",
      "body": "Your assumptions were that \n\n1. she hasn’t already had that experience and\n\n2. that it would scare her. \n\nAnd there are *plenty* of young girls who see ng/nj/etc tubes as a trophy so just sit down for this thread you seem young and this it’s a father looking for help, not a meme.",
      "created_utc": 1670855453.0,
      "score": 2,
      "context": [
        {
          "id": "iztw9fu",
          "author": "recoverybitches",
          "body": "Tell her about ng tubes and how if she doesn't eat shes gonna get one whether she likes it or not",
          "created_utc": 1670790960.0
        },
        {
          "id": "iztzsvv",
          "author": "SnapshotOfACrowd",
          "body": "This is bad advice. And not only because you made an assumption that doesn’t apply.\n\nIf it was supposed to be jokey it wasn’t funny.",
          "created_utc": 1670792333.0
        },
        {
          "id": "izubsd5",
          "author": "recoverybitches",
          "body": "Wym assumption I told op something that could help bc most anorexics will do anything to not get the tube",
          "created_utc": 1670797270.0
        }
      ]
    },
    {
      "id": "izuxk72",
      "author": "musicotic",
      "body": "It's typically bad, in my experience.",
      "created_utc": 1670806790.0,
      "score": 13,
      "context": [
        {
          "id": "izufaih",
          "author": "None",
          "body": "I remember being her age and having a similar problem, albeit not as severe but from a patient to you, I can tell you what I would've wanted when I was 13 and in that position.\nThere is something causing this, for me it was my hatred of school, there will be something going on that's overwhelming her. There will be a root cause of it, and that's what needs to be looked at. As a patient, I wish my parents had had more compassion in that area and actually sat me down and tried to understand why I was doung it instead of just looking at forcing food at me, that would never have worked for me which is why I'm still battling all these years later. She could be being bullied at school, there might be things at home stressing her out, hormones, choosing GCSE's or whatever your countries equivalent is, anything like that.\nAs I parent, I would've wanted to be understood with why I was doing it, and trying to help the situation instead of 'lets just keep pushing food in front of her and tell her that all these awful things will happen if she doesnt eat it'. She's almost certainly getting that from therapists and dieticians who are there to be harsh and tell her to eat and probably scaring her. As her parent, I suggest you be the compassionate one, you be the one that helps with the emotional side, ask her what she needs, ask her what could improve her mood and her life.\nThe system is so bad, and trust me, I've been in hospital multiple times in the last few weeks and in the doctors, and they keep saying they'll chase up the referral, and everyday I never get the letter. They dont understand even when you're there, I got told off because I said havinf scales in my bedroom would make my problem worse, they just dont get it. I wish my family tried harder to understand instead of getting it in treatment then coming home to it as well.\nEveryone's situation is different, but I have been a teenage girl with anorexia not long ago, I can relate to what she's going through and I wouldn't go back to that for anything, so if you need someone who kind of gets it, I'm here. I can try and help explain things from my own experiences to help you.",
          "created_utc": 1670798752.0
        },
        {
          "id": "izugqvp",
          "author": "bjosker13",
          "body": "Thank you for your perspective. We are all exceptionally fortunate in that she has an excellent support system in place - her caregivers and her team. I’m a licensed therapist and have the emotional capacity and understanding BUT she is non communicative and appears to have given up. She sits at the table and stares at nothing. She won’t touch any food and we just sit patiently beside her trying not to freak the hell out. We’ve tried games as distractions and tv and I read to her sometimes. She’s not willing to communicate her inner emotions and I can’t help her if she won’t respond.",
          "created_utc": 1670799375.0
        },
        {
          "id": "izui3ra",
          "author": "None",
          "body": "Been there, I get what you mean now, I completely understand. I did exactly the same thing. I still sometimes do even now living alone I will do that same thing. My parents would do the same as you in response.\nHere's what was going through my head at that stage:\nI was depressed about school. And in early teens, you feel like parents and adults just cant understand that. It wasnt so much a losing weight thing but a depression thing, I felt like I'd given up because I was in a place that I hated every single day and nothing seemed to make it better, I couldnt see a way out and it getting better. Hell I'm in college now and I'm still counting down the days until the end, I still feel that way sometimes. I wouldn't tell people how I was feeling because to adults it looked like such a petty problem, but to a 13 year old, it's a lot to contend with.\nThat giving up thing I relate to. For me it's because I was in a situatiom that I felt I couldn't explain to people, they couldn't understand. I was embarassed, I didnt want to discuss it with adults. I felt like I was trying so hard and it wasnt enough so I gave up. Have you tried to talk to someone her age, her friends? See if she's spoken to them about anything. Teen girls talk to eachother about problems, and they're at school with her so it makrs sense that they'd be able to tell her things she wouldnt tell you and you might get more of an insight into the underlying problem",
          "created_utc": 1670799948.0
        },
        {
          "id": "izuim2g",
          "author": "bjosker13",
          "body": "She has isolated herself from almost everyone. I think she’s on Snapchat and talks to ppl she met at the residential treatment center (not sure if this is good or bad). She’s always struggled to advocate for herself and this is now an extreme situation of that.",
          "created_utc": 1670800165.0
        }
      ]
    },
    {
      "id": "izvvkwy",
      "author": "unfamiliarplaces",
      "body": "i know this sounds harsh but you might need to take her phone and look through the whole thing. she very well could have secret accounts - tumblr, twitter, instagram and m. p. a. are all sites she could be browsing for pro-ana content - you might not find much, because incognito mode doesn't leave a browser history, but you can try. \n\nsnapchat is not ideal in this situation, because unless she saves her chats, you have no idea what her friends from treatment are saying to her. they very well could be triggering each other as a way to 'stay on track'.",
      "created_utc": 1670823987.0,
      "score": 9,
      "context": [
        {
          "id": "izufaih",
          "author": "None",
          "body": "I remember being her age and having a similar problem, albeit not as severe but from a patient to you, I can tell you what I would've wanted when I was 13 and in that position.\nThere is something causing this, for me it was my hatred of school, there will be something going on that's overwhelming her. There will be a root cause of it, and that's what needs to be looked at. As a patient, I wish my parents had had more compassion in that area and actually sat me down and tried to understand why I was doung it instead of just looking at forcing food at me, that would never have worked for me which is why I'm still battling all these years later. She could be being bullied at school, there might be things at home stressing her out, hormones, choosing GCSE's or whatever your countries equivalent is, anything like that.\nAs I parent, I would've wanted to be understood with why I was doing it, and trying to help the situation instead of 'lets just keep pushing food in front of her and tell her that all these awful things will happen if she doesnt eat it'. She's almost certainly getting that from therapists and dieticians who are there to be harsh and tell her to eat and probably scaring her. As her parent, I suggest you be the compassionate one, you be the one that helps with the emotional side, ask her what she needs, ask her what could improve her mood and her life.\nThe system is so bad, and trust me, I've been in hospital multiple times in the last few weeks and in the doctors, and they keep saying they'll chase up the referral, and everyday I never get the letter. They dont understand even when you're there, I got told off because I said havinf scales in my bedroom would make my problem worse, they just dont get it. I wish my family tried harder to understand instead of getting it in treatment then coming home to it as well.\nEveryone's situation is different, but I have been a teenage girl with anorexia not long ago, I can relate to what she's going through and I wouldn't go back to that for anything, so if you need someone who kind of gets it, I'm here. I can try and help explain things from my own experiences to help you.",
          "created_utc": 1670798752.0
        },
        {
          "id": "izugqvp",
          "author": "bjosker13",
          "body": "Thank you for your perspective. We are all exceptionally fortunate in that she has an excellent support system in place - her caregivers and her team. I’m a licensed therapist and have the emotional capacity and understanding BUT she is non communicative and appears to have given up. She sits at the table and stares at nothing. She won’t touch any food and we just sit patiently beside her trying not to freak the hell out. We’ve tried games as distractions and tv and I read to her sometimes. She’s not willing to communicate her inner emotions and I can’t help her if she won’t respond.",
          "created_utc": 1670799375.0
        },
        {
          "id": "izui3ra",
          "author": "None",
          "body": "Been there, I get what you mean now, I completely understand. I did exactly the same thing. I still sometimes do even now living alone I will do that same thing. My parents would do the same as you in response.\nHere's what was going through my head at that stage:\nI was depressed about school. And in early teens, you feel like parents and adults just cant understand that. It wasnt so much a losing weight thing but a depression thing, I felt like I'd given up because I was in a place that I hated every single day and nothing seemed to make it better, I couldnt see a way out and it getting better. Hell I'm in college now and I'm still counting down the days until the end, I still feel that way sometimes. I wouldn't tell people how I was feeling because to adults it looked like such a petty problem, but to a 13 year old, it's a lot to contend with.\nThat giving up thing I relate to. For me it's because I was in a situatiom that I felt I couldn't explain to people, they couldn't understand. I was embarassed, I didnt want to discuss it with adults. I felt like I was trying so hard and it wasnt enough so I gave up. Have you tried to talk to someone her age, her friends? See if she's spoken to them about anything. Teen girls talk to eachother about problems, and they're at school with her so it makrs sense that they'd be able to tell her things she wouldnt tell you and you might get more of an insight into the underlying problem",
          "created_utc": 1670799948.0
        },
        {
          "id": "izuim2g",
          "author": "bjosker13",
          "body": "She has isolated herself from almost everyone. I think she’s on Snapchat and talks to ppl she met at the residential treatment center (not sure if this is good or bad). She’s always struggled to advocate for herself and this is now an extreme situation of that.",
          "created_utc": 1670800165.0
        }
      ]
    },
    {
      "id": "izv1crd",
      "author": "savannahruns",
      "body": "Almost always very bad.",
      "created_utc": 1670808577.0,
      "score": 6,
      "context": [
        {
          "id": "izufaih",
          "author": "None",
          "body": "I remember being her age and having a similar problem, albeit not as severe but from a patient to you, I can tell you what I would've wanted when I was 13 and in that position.\nThere is something causing this, for me it was my hatred of school, there will be something going on that's overwhelming her. There will be a root cause of it, and that's what needs to be looked at. As a patient, I wish my parents had had more compassion in that area and actually sat me down and tried to understand why I was doung it instead of just looking at forcing food at me, that would never have worked for me which is why I'm still battling all these years later. She could be being bullied at school, there might be things at home stressing her out, hormones, choosing GCSE's or whatever your countries equivalent is, anything like that.\nAs I parent, I would've wanted to be understood with why I was doing it, and trying to help the situation instead of 'lets just keep pushing food in front of her and tell her that all these awful things will happen if she doesnt eat it'. She's almost certainly getting that from therapists and dieticians who are there to be harsh and tell her to eat and probably scaring her. As her parent, I suggest you be the compassionate one, you be the one that helps with the emotional side, ask her what she needs, ask her what could improve her mood and her life.\nThe system is so bad, and trust me, I've been in hospital multiple times in the last few weeks and in the doctors, and they keep saying they'll chase up the referral, and everyday I never get the letter. They dont understand even when you're there, I got told off because I said havinf scales in my bedroom would make my problem worse, they just dont get it. I wish my family tried harder to understand instead of getting it in treatment then coming home to it as well.\nEveryone's situation is different, but I have been a teenage girl with anorexia not long ago, I can relate to what she's going through and I wouldn't go back to that for anything, so if you need someone who kind of gets it, I'm here. I can try and help explain things from my own experiences to help you.",
          "created_utc": 1670798752.0
        },
        {
          "id": "izugqvp",
          "author": "bjosker13",
          "body": "Thank you for your perspective. We are all exceptionally fortunate in that she has an excellent support system in place - her caregivers and her team. I’m a licensed therapist and have the emotional capacity and understanding BUT she is non communicative and appears to have given up. She sits at the table and stares at nothing. She won’t touch any food and we just sit patiently beside her trying not to freak the hell out. We’ve tried games as distractions and tv and I read to her sometimes. She’s not willing to communicate her inner emotions and I can’t help her if she won’t respond.",
          "created_utc": 1670799375.0
        },
        {
          "id": "izui3ra",
          "author": "None",
          "body": "Been there, I get what you mean now, I completely understand. I did exactly the same thing. I still sometimes do even now living alone I will do that same thing. My parents would do the same as you in response.\nHere's what was going through my head at that stage:\nI was depressed about school. And in early teens, you feel like parents and adults just cant understand that. It wasnt so much a losing weight thing but a depression thing, I felt like I'd given up because I was in a place that I hated every single day and nothing seemed to make it better, I couldnt see a way out and it getting better. Hell I'm in college now and I'm still counting down the days until the end, I still feel that way sometimes. I wouldn't tell people how I was feeling because to adults it looked like such a petty problem, but to a 13 year old, it's a lot to contend with.\nThat giving up thing I relate to. For me it's because I was in a situatiom that I felt I couldn't explain to people, they couldn't understand. I was embarassed, I didnt want to discuss it with adults. I felt like I was trying so hard and it wasnt enough so I gave up. Have you tried to talk to someone her age, her friends? See if she's spoken to them about anything. Teen girls talk to eachother about problems, and they're at school with her so it makrs sense that they'd be able to tell her things she wouldnt tell you and you might get more of an insight into the underlying problem",
          "created_utc": 1670799948.0
        },
        {
          "id": "izuim2g",
          "author": "bjosker13",
          "body": "She has isolated herself from almost everyone. I think she’s on Snapchat and talks to ppl she met at the residential treatment center (not sure if this is good or bad). She’s always struggled to advocate for herself and this is now an extreme situation of that.",
          "created_utc": 1670800165.0
        }
      ]
    },
    {
      "id": "izv7rmm",
      "author": "berrybimbap",
      "body": "PLEASE take away her phone i am begging. my ED was at its worst when i was on forums and ed groups and constantly seeing things that inspired me to keep starving. when i was deprived of those things things really improved for me. she is going to hate you for it but you need to take away her phone and anything she can use to be on social media. you should also discipline her to the point where she is forced to eat; keep eyes on her as much to 24/7 as possible, don’t allow her to have access to things until she eats…i hate to say this but this is life or death here. my heart breaks for you and i hope things will get better for your daughter and your family…….",
      "created_utc": 1670811529.0,
      "score": 10,
      "context": [
        {
          "id": "izufaih",
          "author": "None",
          "body": "I remember being her age and having a similar problem, albeit not as severe but from a patient to you, I can tell you what I would've wanted when I was 13 and in that position.\nThere is something causing this, for me it was my hatred of school, there will be something going on that's overwhelming her. There will be a root cause of it, and that's what needs to be looked at. As a patient, I wish my parents had had more compassion in that area and actually sat me down and tried to understand why I was doung it instead of just looking at forcing food at me, that would never have worked for me which is why I'm still battling all these years later. She could be being bullied at school, there might be things at home stressing her out, hormones, choosing GCSE's or whatever your countries equivalent is, anything like that.\nAs I parent, I would've wanted to be understood with why I was doing it, and trying to help the situation instead of 'lets just keep pushing food in front of her and tell her that all these awful things will happen if she doesnt eat it'. She's almost certainly getting that from therapists and dieticians who are there to be harsh and tell her to eat and probably scaring her. As her parent, I suggest you be the compassionate one, you be the one that helps with the emotional side, ask her what she needs, ask her what could improve her mood and her life.\nThe system is so bad, and trust me, I've been in hospital multiple times in the last few weeks and in the doctors, and they keep saying they'll chase up the referral, and everyday I never get the letter. They dont understand even when you're there, I got told off because I said havinf scales in my bedroom would make my problem worse, they just dont get it. I wish my family tried harder to understand instead of getting it in treatment then coming home to it as well.\nEveryone's situation is different, but I have been a teenage girl with anorexia not long ago, I can relate to what she's going through and I wouldn't go back to that for anything, so if you need someone who kind of gets it, I'm here. I can try and help explain things from my own experiences to help you.",
          "created_utc": 1670798752.0
        },
        {
          "id": "izugqvp",
          "author": "bjosker13",
          "body": "Thank you for your perspective. We are all exceptionally fortunate in that she has an excellent support system in place - her caregivers and her team. I’m a licensed therapist and have the emotional capacity and understanding BUT she is non communicative and appears to have given up. She sits at the table and stares at nothing. She won’t touch any food and we just sit patiently beside her trying not to freak the hell out. We’ve tried games as distractions and tv and I read to her sometimes. She’s not willing to communicate her inner emotions and I can’t help her if she won’t respond.",
          "created_utc": 1670799375.0
        },
        {
          "id": "izui3ra",
          "author": "None",
          "body": "Been there, I get what you mean now, I completely understand. I did exactly the same thing. I still sometimes do even now living alone I will do that same thing. My parents would do the same as you in response.\nHere's what was going through my head at that stage:\nI was depressed about school. And in early teens, you feel like parents and adults just cant understand that. It wasnt so much a losing weight thing but a depression thing, I felt like I'd given up because I was in a place that I hated every single day and nothing seemed to make it better, I couldnt see a way out and it getting better. Hell I'm in college now and I'm still counting down the days until the end, I still feel that way sometimes. I wouldn't tell people how I was feeling because to adults it looked like such a petty problem, but to a 13 year old, it's a lot to contend with.\nThat giving up thing I relate to. For me it's because I was in a situatiom that I felt I couldn't explain to people, they couldn't understand. I was embarassed, I didnt want to discuss it with adults. I felt like I was trying so hard and it wasnt enough so I gave up. Have you tried to talk to someone her age, her friends? See if she's spoken to them about anything. Teen girls talk to eachother about problems, and they're at school with her so it makrs sense that they'd be able to tell her things she wouldnt tell you and you might get more of an insight into the underlying problem",
          "created_utc": 1670799948.0
        },
        {
          "id": "izuim2g",
          "author": "bjosker13",
          "body": "She has isolated herself from almost everyone. I think she’s on Snapchat and talks to ppl she met at the residential treatment center (not sure if this is good or bad). She’s always struggled to advocate for herself and this is now an extreme situation of that.",
          "created_utc": 1670800165.0
        }
      ]
    },
    {
      "id": "izupa82",
      "author": "Future_Appearance_59",
      "body": "I hope the best for you and your family, EDs are a bitch.",
      "created_utc": 1670803059.0,
      "score": 1,
      "context": [
        {
          "id": "izujv25",
          "author": "Future_Appearance_59",
          "body": "Go full inpatient rehab. It may take a few tries if it's that severe but it helps",
          "created_utc": 1670800711.0
        },
        {
          "id": "izum20c",
          "author": "bjosker13",
          "body": "She’s been to full residential care. Ng tube for most of the time. We’re trying to get her into another facility asap. They were successful in weight restoration but NOT mental health",
          "created_utc": 1670801663.0
        },
        {
          "id": "izuob95",
          "author": "Future_Appearance_59",
          "body": "Try it again, and then continue with a therapist who specializes in eating disorders, you can even continue with outpatient once she has completed in patient. Also, and this is extreme but bc I've been in her shoes I would look through her phone for things like \"meanspo,\" \"nicespo,\" \"pro ana\" \"pro ed\" \"thinspo\" \"ana coach\" \"Mia coach\" \"pro mia\" \" fatspo\" \"eating disorder coach\" \"ED coach\" \"thinspo coach\" \"just skinny things\" and other stuff and BLOCK IT. put a parental block on these searches in all search engines and apps bc they're on social media too.",
          "created_utc": 1670802639.0
        },
        {
          "id": "izuov9a",
          "author": "bjosker13",
          "body": "This is VERY helpful. She has a therapist now who’s a specialist in ED. Plus a dietian and a ceds pediatrician\nWe’re all fighting for her",
          "created_utc": 1670802878.0
        }
      ]
    },
    {
      "id": "izucyyp",
      "author": "bjosker13",
      "body": "Accurate!! I’m sorry you’ve been here before ❤️",
      "created_utc": 1670797772.0,
      "score": 5,
      "context": [
        {
          "id": "iztkisa",
          "author": "Asspieburgers",
          "body": "Please excuse me if I'm misreading or making assumptions about her prior treatment \n\nHas she ever had trauma of any kind? My girlfriend (AN-BP) informs me frequently (I have memory issues) that EDs mostly arise from trauma. [See here](https://www.nationaleatingdisorders.org/blog/eating-disorders-trauma-ptsd-recovery). Could there be some trauma that she isn't telling you, or anyone else, about (for whatever reason that may be – and there could be many, including guilt, shame and fear)? Has she explored any of that with a psychologist/psychotherapist?\n\nKeep in mind that public hospital wards may only treat the symptoms (in this case malnourishment) and not the cause(s). To treat the causes she probably needs one-on-one psychological intervention and/or an inpatient stay at a *good* ED clinic (there are too many below average of those, my girlfriend tells me)",
          "created_utc": 1670786502.0
        },
        {
          "id": "iztl732",
          "author": "bjosker13",
          "body": "Sigh, yes, she’s sensitive and exceptionally bright and has had some smaller t traumas. She has twice weekly therapy and twice weekly dietitian appointments. She’s unable to process much though as she starved herself. I’m terrified of sending her to res again as there was a lot of trauma accumulated there",
          "created_utc": 1670786762.0
        },
        {
          "id": "iztt4qt",
          "author": "bjosker13",
          "body": "Thank you for the kind words of support. She’s a stubborn mule.",
          "created_utc": 1670789765.0
        },
        {
          "id": "izuce8o",
          "author": "Schneeballschlacht",
          "body": "Her ED is a stubborn mule. She, most likely, is not. \n\nThat said, I wish my parents had shown so much care and love. I wish you and your daughter well.",
          "created_utc": 1670797527.0
        }
      ]
    },
    {
      "id": "izuqf5o",
      "author": "Lemon_m1lk",
      "body": "I don’t think OP meant it in a harsh way though. Clearly she cares for her daughter a lot",
      "created_utc": 1670803555.0,
      "score": 15,
      "context": [
        {
          "id": "iztkisa",
          "author": "Asspieburgers",
          "body": "Please excuse me if I'm misreading or making assumptions about her prior treatment \n\nHas she ever had trauma of any kind? My girlfriend (AN-BP) informs me frequently (I have memory issues) that EDs mostly arise from trauma. [See here](https://www.nationaleatingdisorders.org/blog/eating-disorders-trauma-ptsd-recovery). Could there be some trauma that she isn't telling you, or anyone else, about (for whatever reason that may be – and there could be many, including guilt, shame and fear)? Has she explored any of that with a psychologist/psychotherapist?\n\nKeep in mind that public hospital wards may only treat the symptoms (in this case malnourishment) and not the cause(s). To treat the causes she probably needs one-on-one psychological intervention and/or an inpatient stay at a *good* ED clinic (there are too many below average of those, my girlfriend tells me)",
          "created_utc": 1670786502.0
        },
        {
          "id": "iztl732",
          "author": "bjosker13",
          "body": "Sigh, yes, she’s sensitive and exceptionally bright and has had some smaller t traumas. She has twice weekly therapy and twice weekly dietitian appointments. She’s unable to process much though as she starved herself. I’m terrified of sending her to res again as there was a lot of trauma accumulated there",
          "created_utc": 1670786762.0
        },
        {
          "id": "iztt4qt",
          "author": "bjosker13",
          "body": "Thank you for the kind words of support. She’s a stubborn mule.",
          "created_utc": 1670789765.0
        },
        {
          "id": "izuhthx",
          "author": "ohitsasharkattack",
          "body": "To say she is a stubborn mule sounds so harsh, shes likely in the depths of hell herself",
          "created_utc": 1670799826.0
        }
      ]
    },
    {
      "id": "izui17a",
      "author": "bjosker13",
      "body": "Of course she is. It’s the ED that’s stubborn af. I’ve come here to vent - not to be judged",
      "created_utc": 1670799917.0,
      "score": 20,
      "context": [
        {
          "id": "iztkisa",
          "author": "Asspieburgers",
          "body": "Please excuse me if I'm misreading or making assumptions about her prior treatment \n\nHas she ever had trauma of any kind? My girlfriend (AN-BP) informs me frequently (I have memory issues) that EDs mostly arise from trauma. [See here](https://www.nationaleatingdisorders.org/blog/eating-disorders-trauma-ptsd-recovery). Could there be some trauma that she isn't telling you, or anyone else, about (for whatever reason that may be – and there could be many, including guilt, shame and fear)? Has she explored any of that with a psychologist/psychotherapist?\n\nKeep in mind that public hospital wards may only treat the symptoms (in this case malnourishment) and not the cause(s). To treat the causes she probably needs one-on-one psychological intervention and/or an inpatient stay at a *good* ED clinic (there are too many below average of those, my girlfriend tells me)",
          "created_utc": 1670786502.0
        },
        {
          "id": "iztl732",
          "author": "bjosker13",
          "body": "Sigh, yes, she’s sensitive and exceptionally bright and has had some smaller t traumas. She has twice weekly therapy and twice weekly dietitian appointments. She’s unable to process much though as she starved herself. I’m terrified of sending her to res again as there was a lot of trauma accumulated there",
          "created_utc": 1670786762.0
        },
        {
          "id": "iztt4qt",
          "author": "bjosker13",
          "body": "Thank you for the kind words of support. She’s a stubborn mule.",
          "created_utc": 1670789765.0
        },
        {
          "id": "izuhthx",
          "author": "ohitsasharkattack",
          "body": "To say she is a stubborn mule sounds so harsh, shes likely in the depths of hell herself",
          "created_utc": 1670799826.0
        }
      ]
    },
    {
      "id": "izyuuxq",
      "author": "recoverybitches",
      "body": "Ik it's not a meme I've been struggling with bulimia and anorexia for almost 5 years and I'm 16 and ik but thats what scared into gaining weight so I thought it would help bc for alot of anorexics the ng tubes scare us bc it'll be gaining weight against our will",
      "created_utc": 1670880146.0,
      "score": 1,
      "context": [
        {
          "id": "iztw9fu",
          "author": "recoverybitches",
          "body": "Tell her about ng tubes and how if she doesn't eat shes gonna get one whether she likes it or not",
          "created_utc": 1670790960.0
        },
        {
          "id": "iztzsvv",
          "author": "SnapshotOfACrowd",
          "body": "This is bad advice. And not only because you made an assumption that doesn’t apply.\n\nIf it was supposed to be jokey it wasn’t funny.",
          "created_utc": 1670792333.0
        },
        {
          "id": "izubsd5",
          "author": "recoverybitches",
          "body": "Wym assumption I told op something that could help bc most anorexics will do anything to not get the tube",
          "created_utc": 1670797270.0
        },
        {
          "id": "izx40pr",
          "author": "SnapshotOfACrowd",
          "body": "Your assumptions were that \n\n1. she hasn’t already had that experience and\n\n2. that it would scare her. \n\nAnd there are *plenty* of young girls who see ng/nj/etc tubes as a trophy so just sit down for this thread you seem young and this it’s a father looking for help, not a meme.",
          "created_utc": 1670855453.0
        }
      ]
    },
    {
      "id": "izuec82",
      "author": "Schneeballschlacht",
      "body": "I was 12 when it started- the support of my parents when I was young would have changed my life. 30 years later and still struggling. Don’t give up. There’s some amazing advise in this thread!",
      "created_utc": 1670798351.0,
      "score": 5,
      "context": [
        {
          "id": "iztkisa",
          "author": "Asspieburgers",
          "body": "Please excuse me if I'm misreading or making assumptions about her prior treatment \n\nHas she ever had trauma of any kind? My girlfriend (AN-BP) informs me frequently (I have memory issues) that EDs mostly arise from trauma. [See here](https://www.nationaleatingdisorders.org/blog/eating-disorders-trauma-ptsd-recovery). Could there be some trauma that she isn't telling you, or anyone else, about (for whatever reason that may be – and there could be many, including guilt, shame and fear)? Has she explored any of that with a psychologist/psychotherapist?\n\nKeep in mind that public hospital wards may only treat the symptoms (in this case malnourishment) and not the cause(s). To treat the causes she probably needs one-on-one psychological intervention and/or an inpatient stay at a *good* ED clinic (there are too many below average of those, my girlfriend tells me)",
          "created_utc": 1670786502.0
        },
        {
          "id": "iztl732",
          "author": "bjosker13",
          "body": "Sigh, yes, she’s sensitive and exceptionally bright and has had some smaller t traumas. She has twice weekly therapy and twice weekly dietitian appointments. She’s unable to process much though as she starved herself. I’m terrified of sending her to res again as there was a lot of trauma accumulated there",
          "created_utc": 1670786762.0
        },
        {
          "id": "iztt4qt",
          "author": "bjosker13",
          "body": "Thank you for the kind words of support. She’s a stubborn mule.",
          "created_utc": 1670789765.0
        },
        {
          "id": "izuce8o",
          "author": "Schneeballschlacht",
          "body": "Her ED is a stubborn mule. She, most likely, is not. \n\nThat said, I wish my parents had shown so much care and love. I wish you and your daughter well.",
          "created_utc": 1670797527.0
        },
        {
          "id": "izucyyp",
          "author": "bjosker13",
          "body": "Accurate!! I’m sorry you’ve been here before ❤️",
          "created_utc": 1670797772.0
        }
      ]
    }
  ]
}