{
  "id": "zmzyh2",
  "subreddit": "AnorexiaNervosa",
  "author": "Nia_KR",
  "created_utc": 1671147125.0,
  "title": "So this is what happens when you truly hit your “goal weight”",
  "selftext": "as the title says, a couple months back I hit my gw, I have no desire to lower it and I’ve just been maintaining ever since. I will say I am more comfortable in my skin, but (and this will probably come as a shock to no one) I’m not happy. like at all. nobody treats me differently, in fact people are typically meaner. I hardly recognize myself when I look in the mirror, and not in a good way. It almost makes me feel guilty seeing how thin I am?? I miss my ass but it’s not enough to make me wanna gain bc that’s the only thing I miss. I’ve lost a lot of hair and if I didn’t have a bunch of it to begin with I’d probably be balding. Im still depressed (duh) and the only thing I really got out of it was that I don’t hate my thighs anymore. Idk why I’m posting this, ig just to give some insight on how truly pointless and underwhelming it all is? wanting to know if anyone can relate??",
  "url": "https://www.reddit.com/r/AnorexiaNervosa/comments/zmzyh2/so_this_is_what_happens_when_you_truly_hit_your/",
  "score": 162,
  "num_comments": 34,
  "comments": [
    {
      "id": "j0e1uou",
      "author": "AutoModerator",
      "body": "This is an automated message sent to all posters. We have a new Discord server for the subreddit! You can join it using this link: https://discord.gg/evYUnj4j7r \n\nPlease make sure you have read and understand all the rules of the subreddit, and are aware that rule 10 means that no numbers unrelated to time are allowed here. Rule-breaking posts will be removed. Commenters; If you are here to give advice to OP, please make sure your advice follows subreddit rules and it isn't harmful to OP. If OP doesn't want advice, please be respectful of their wishes. \n\nPlease report any rule-breaking posts and comments that you see. If it is an emergency, please MOD MAIL the subreddit with information about the rule-breaks in question and report them.  \n\nAgain, thank you for posting on r/AnorexiaNervosa. If you think of anything else I can say in this message, please MOD MAIL with your ideas. The mods thank you, and hope you're doing well. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AnorexiaNervosa) if you have any questions or concerns.*",
      "created_utc": 1671147126.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j0e2z00",
      "author": "malice_walk3r",
      "body": "When i hit my goal weight I decided to lose more bc i wasn't satisfied and it became hell. I ended up in the er a couple weeks later",
      "created_utc": 1671147605.0,
      "score": 75,
      "context": []
    },
    {
      "id": "j0ed98u",
      "author": "SpecialistShot5458",
      "body": "real.. My ed got so so much worse after I hit my gw, i convinced myself it would all get better after I seen that stupid number but ofc it doesn’t work that way. it’s more of an addiction than anything atp i don’t even have a goal anymore",
      "created_utc": 1671152035.0,
      "score": 33,
      "context": []
    },
    {
      "id": "j0e96y1",
      "author": "EscapeFabulous6368",
      "body": "i thought that my gw would make me happy, that to lose some weight was all i needed to be and feel complete. when i hit my gw i just like, felt nothing? it's so disappointing, so frustrating",
      "created_utc": 1671150287.0,
      "score": 25,
      "context": []
    },
    {
      "id": "j0eu6tv",
      "author": "None",
      "body": "This is what is scaring me into recovery. The thought of going through all this suffering and permanently fucking up my body just to hit a gw and be like… “Ok, I finally weigh this much. What now?” Because there really is nothing after that. It’s not like getting a million dollars. There’s no genuine value in being underweight and it’s not like it will get me anywhere in life besides six feet underground. Thank you for posting this, I think it’s the reminder a lot of us need.",
      "created_utc": 1671159811.0,
      "score": 20,
      "context": []
    },
    {
      "id": "j0es061",
      "author": "shiratakihater",
      "body": "i definitely relate to the guilt thing. at my lw, i felt like i didn’t “deserve” it because i didn’t achieve it in a sustainable way and i had a feeling that i was naturally larger and masquerading in a thin body instead of actually being thin. the weird thing is i never applied this to other people with eds who were underweight and felt like i was the only fraud.",
      "created_utc": 1671158810.0,
      "score": 13,
      "context": []
    },
    {
      "id": "j0e2e0y",
      "author": "Nia_KR",
      "body": "I’ve had an ed for 7 years and this is the first time I’ve actually gotten my “dream body”, which was the sole reason I developed one, so ig I’m just reflecting on how severely underwhelming it was to fulfill what seemed like my life purpose lmfao",
      "created_utc": 1671147361.0,
      "score": 32,
      "context": []
    },
    {
      "id": "j0e502k",
      "author": "schuylersisters-",
      "body": "same ive been maintaining the whole year and i never felt more miserable or weak, my family calls me ugly… i am only the shell of the girl i was",
      "created_utc": 1671148477.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j0el7v6",
      "author": "givmethatleg",
      "body": "I definitely relate. I'm at my goal weight and I feel more depressed and super restless constantly. More anxiety too. Probably the lack of food. Also now when I work out I gas out so fast. Used to be able to work out 2 hours now like 30 mins and working out was the only thing that made me happy. I like how I look but people around me don't and comment on it.",
      "created_utc": 1671155706.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j0ggtcx",
      "author": "YoullNeverWalkAl0ne",
      "body": "Well it nearly ended up killing me multiple times, rushed to er for emergency surgeries and also nearly went into a coma from low blood sugar. Put weight on now hate myself 🙃",
      "created_utc": 1671198511.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j0h5edm",
      "author": "princessenicotine",
      "body": "true. i’ve hit my ´first’ ugw months ago (i say first because silly me really thought i’d be able to stop after getting there) and now i’ve gotten so deep in my relapse, it’s not even about looking good anymore. i sometimes try to hide my anorexic body because i know people see it, it’s like my secret is unfolded and i hate it.",
      "created_utc": 1671208677.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j0gqhmc",
      "author": "tinyseitan",
      "body": "When I have hit my goal weightS, I always change my goal to lower and lower. I am never satisfied. Or there is like 5-15 min happiness \"I did it!\" then I am adjusting my goal again.",
      "created_utc": 1671202808.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j0hls3b",
      "author": "ycleptKyara",
      "body": "i found out at the drs office this year. i had bought a house and moved away from an abusive mother, and yet I felt like my life was falling apart. i was having panic attacks daily and the brain fog from restricting was terrible.\n\nmy first thought when i saw the number was \"im at my goal weight\" and that was my wake-up call that i needed to get better. i hurt constantly and this was no way to live.\n\ni'm still trying, and every day it gets a little easier in different ways. keep going",
      "created_utc": 1671215021.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j0hno0b",
      "author": "None",
      "body": "i never had a particular GW but once i hit a certain weight, i knew i was far more comfortable in my skin than ever & actually, happy. but the self hatred gets 10x worse when you fluctuate over that weight…",
      "created_utc": 1671215765.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j0hw9j8",
      "author": "Conscious_Stretch_58",
      "body": "There is no gw and i know this is triggering so for that i am terribly sorry.",
      "created_utc": 1671219235.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j0lbycj",
      "author": "Missveexox13",
      "body": "I thought having a flat stomach would make me happy. I bavebt weighed over 100lbs in years now and my life was more happy when I was 115 and had a bit of a belly. It truly doesn’t matter what you look like. It’s how you feel.",
      "created_utc": 1671289849.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j0ittmw",
      "author": "crunchyequivalent",
      "body": "I have lost 45 pounds in the last 6 months and thought I may be more “desirable” to guys, instead I was told that it’s not attractive for my hip bones to show and “I should put some meat on them bones”…. I’ll never be happy with how I look lol",
      "created_utc": 1671233417.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j0g2u9k",
      "author": "Clean_Ad_5282",
      "body": "I wish I could hit my gw",
      "created_utc": 1671190174.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j0g6enf",
      "author": "germsosse",
      "body": "is your diet now different or are you still restricting to maintain your goal weight?",
      "created_utc": 1671192663.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j0ho53a",
      "author": "None",
      "body": "No offense, but there’s a big difference between body image issues, disordered eating and an eating disorder. Take it for what is, but the fact that you’re eating a healthy amount of calories as soon as you lost weight, should tell you a lot. This doesn’t mean your emotions are any less valid but…idk I think you get the point.",
      "created_utc": 1671215952.0,
      "score": -3,
      "context": []
    },
    {
      "id": "j0hjw5c",
      "author": "polaroid1234",
      "body": "hitting your gw can be very hard, when I started gaining weight, I used to think to myselff \"then what? What will change?\" and it was quite hard to look myself in the mirror, as I slowly said goodbye to my old body, but in the end I think it was worth it, when you start to notice the changes like, stronger nails and hair, less sleepiness and etc. you see that what was in the pass, stays there",
      "created_utc": 1671214279.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j0hn3zs",
      "author": "None",
      "body": "nearly all of this is 100% accurate for me too",
      "created_utc": 1671215543.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j0e3hzg",
      "author": "Nia_KR",
      "body": "Oh yeah I’ve hit numerous “goal weights” before my last one and wasn’t satisfied, but I think I’m finally at a point where i more or less like how I look and don’t think I still will if I lose anymore. now I just feel kinda empty bc it’s like,,, if I’m not losing weight wtf do I do lmfao",
      "created_utc": 1671147835.0,
      "score": 27,
      "context": [
        {
          "id": "j0e2z00",
          "author": "malice_walk3r",
          "body": "When i hit my goal weight I decided to lose more bc i wasn't satisfied and it became hell. I ended up in the er a couple weeks later",
          "created_utc": 1671147605.0
        }
      ]
    },
    {
      "id": "j0g2dy2",
      "author": "spicychilipowder",
      "body": "Yeah I have experienced kind of the same. After reaching every \"goal weight\", I wanted to keep going.",
      "created_utc": 1671189830.0,
      "score": 2,
      "context": [
        {
          "id": "j0e2z00",
          "author": "malice_walk3r",
          "body": "When i hit my goal weight I decided to lose more bc i wasn't satisfied and it became hell. I ended up in the er a couple weeks later",
          "created_utc": 1671147605.0
        }
      ]
    },
    {
      "id": "j0eh7tm",
      "author": "schuylersisters-",
      "body": "yes like… what now…. am i supposed to be happy or something",
      "created_utc": 1671153879.0,
      "score": 6,
      "context": [
        {
          "id": "j0e96y1",
          "author": "EscapeFabulous6368",
          "body": "i thought that my gw would make me happy, that to lose some weight was all i needed to be and feel complete. when i hit my gw i just like, felt nothing? it's so disappointing, so frustrating",
          "created_utc": 1671150287.0
        }
      ]
    },
    {
      "id": "j0exlxe",
      "author": "Nia_KR",
      "body": "Please do give recovery a shot, I’m at a place where I’ve been like this for so long that I truly don’t think recovery is possible for me, but if it’s possible for you DO IT!! I would kill to even have a feeling that I could ever fully recover",
      "created_utc": 1671161418.0,
      "score": 7,
      "context": [
        {
          "id": "j0eu6tv",
          "author": "None",
          "body": "This is what is scaring me into recovery. The thought of going through all this suffering and permanently fucking up my body just to hit a gw and be like… “Ok, I finally weigh this much. What now?” Because there really is nothing after that. It’s not like getting a million dollars. There’s no genuine value in being underweight and it’s not like it will get me anywhere in life besides six feet underground. Thank you for posting this, I think it’s the reminder a lot of us need.",
          "created_utc": 1671159811.0
        }
      ]
    },
    {
      "id": "j0hi06a",
      "author": "Nia_KR",
      "body": "For me, I don’t exactly know how to explain it, but it’s like I feel guilty because I know the way I got this body was due to mental illness? Like I don’t deserve to be happy about it because it didn’t just happen naturally?? And (i hope this doesn’t sound conceited) I worry that I’m a walking trigger for other people with ed’s who may see me and be jealous, not knowing the things I did to get this body",
      "created_utc": 1671213544.0,
      "score": 5,
      "context": [
        {
          "id": "j0es061",
          "author": "shiratakihater",
          "body": "i definitely relate to the guilt thing. at my lw, i felt like i didn’t “deserve” it because i didn’t achieve it in a sustainable way and i had a feeling that i was naturally larger and masquerading in a thin body instead of actually being thin. the weird thing is i never applied this to other people with eds who were underweight and felt like i was the only fraud.",
          "created_utc": 1671158810.0
        }
      ]
    },
    {
      "id": "j0ggw3w",
      "author": "YoullNeverWalkAl0ne",
      "body": "Now I just drink myself to sleep most nights",
      "created_utc": 1671198547.0,
      "score": 1,
      "context": [
        {
          "id": "j0ggtcx",
          "author": "YoullNeverWalkAl0ne",
          "body": "Well it nearly ended up killing me multiple times, rushed to er for emergency surgeries and also nearly went into a coma from low blood sugar. Put weight on now hate myself 🙃",
          "created_utc": 1671198511.0
        }
      ]
    },
    {
      "id": "j0gmdxj",
      "author": "Nia_KR",
      "body": "No I eat about >!1500-1600!<cals now",
      "created_utc": 1671201054.0,
      "score": 1,
      "context": [
        {
          "id": "j0g6enf",
          "author": "germsosse",
          "body": "is your diet now different or are you still restricting to maintain your goal weight?",
          "created_utc": 1671192663.0
        }
      ]
    },
    {
      "id": "j0hoesm",
      "author": "Nia_KR",
      "body": "My diagnosed anorexia, constantly thinking about food or my body, compulsive exercise, 2 treatment stays and crying over food would disagree??",
      "created_utc": 1671216059.0,
      "score": 8,
      "context": [
        {
          "id": "j0ho53a",
          "author": "None",
          "body": "No offense, but there’s a big difference between body image issues, disordered eating and an eating disorder. Take it for what is, but the fact that you’re eating a healthy amount of calories as soon as you lost weight, should tell you a lot. This doesn’t mean your emotions are any less valid but…idk I think you get the point.",
          "created_utc": 1671215952.0
        }
      ]
    },
    {
      "id": "j0fwxeh",
      "author": "Thugne",
      "body": "We go Jim",
      "created_utc": 1671185337.0,
      "score": 5,
      "context": [
        {
          "id": "j0e2z00",
          "author": "malice_walk3r",
          "body": "When i hit my goal weight I decided to lose more bc i wasn't satisfied and it became hell. I ended up in the er a couple weeks later",
          "created_utc": 1671147605.0
        },
        {
          "id": "j0e3hzg",
          "author": "Nia_KR",
          "body": "Oh yeah I’ve hit numerous “goal weights” before my last one and wasn’t satisfied, but I think I’m finally at a point where i more or less like how I look and don’t think I still will if I lose anymore. now I just feel kinda empty bc it’s like,,, if I’m not losing weight wtf do I do lmfao",
          "created_utc": 1671147835.0
        }
      ]
    },
    {
      "id": "j0ejm3t",
      "author": "EscapeFabulous6368",
      "body": "i didn't just realised that it wasn't going to make me happy but that if i get lower, i mantain or i gain weight, in any case i would still feel awful",
      "created_utc": 1671154986.0,
      "score": 5,
      "context": [
        {
          "id": "j0e96y1",
          "author": "EscapeFabulous6368",
          "body": "i thought that my gw would make me happy, that to lose some weight was all i needed to be and feel complete. when i hit my gw i just like, felt nothing? it's so disappointing, so frustrating",
          "created_utc": 1671150287.0
        },
        {
          "id": "j0eh7tm",
          "author": "schuylersisters-",
          "body": "yes like… what now…. am i supposed to be happy or something",
          "created_utc": 1671153879.0
        }
      ]
    },
    {
      "id": "j0f1ahk",
      "author": "None",
      "body": "I feel the same way… anorexia has been my norm for so long that I honestly can’t imagine living any other way. But I know I can do it, I know we can do it. I like to believe it’s never too late for us. Thank you for your kind words :)",
      "created_utc": 1671163206.0,
      "score": 2,
      "context": [
        {
          "id": "j0eu6tv",
          "author": "None",
          "body": "This is what is scaring me into recovery. The thought of going through all this suffering and permanently fucking up my body just to hit a gw and be like… “Ok, I finally weigh this much. What now?” Because there really is nothing after that. It’s not like getting a million dollars. There’s no genuine value in being underweight and it’s not like it will get me anywhere in life besides six feet underground. Thank you for posting this, I think it’s the reminder a lot of us need.",
          "created_utc": 1671159811.0
        },
        {
          "id": "j0exlxe",
          "author": "Nia_KR",
          "body": "Please do give recovery a shot, I’m at a place where I’ve been like this for so long that I truly don’t think recovery is possible for me, but if it’s possible for you DO IT!! I would kill to even have a feeling that I could ever fully recover",
          "created_utc": 1671161418.0
        }
      ]
    },
    {
      "id": "j0hilad",
      "author": "shiratakihater",
      "body": "i completely get that!!! before i gained weight in forced recovery, i felt so guilty for my body because of how i got it. it’s so much different now after gaining weight though because i don’t see myself as thin at all, despite being uw.",
      "created_utc": 1671213773.0,
      "score": 3,
      "context": [
        {
          "id": "j0es061",
          "author": "shiratakihater",
          "body": "i definitely relate to the guilt thing. at my lw, i felt like i didn’t “deserve” it because i didn’t achieve it in a sustainable way and i had a feeling that i was naturally larger and masquerading in a thin body instead of actually being thin. the weird thing is i never applied this to other people with eds who were underweight and felt like i was the only fraud.",
          "created_utc": 1671158810.0
        },
        {
          "id": "j0hi06a",
          "author": "Nia_KR",
          "body": "For me, I don’t exactly know how to explain it, but it’s like I feel guilty because I know the way I got this body was due to mental illness? Like I don’t deserve to be happy about it because it didn’t just happen naturally?? And (i hope this doesn’t sound conceited) I worry that I’m a walking trigger for other people with ed’s who may see me and be jealous, not knowing the things I did to get this body",
          "created_utc": 1671213544.0
        }
      ]
    }
  ]
}