{
  "id": "109phig",
  "subreddit": "ARFID",
  "author": "kwink8",
  "created_utc": 1673495530.0,
  "title": "i WiSh I hAd ThAt PrObLeM",
  "selftext": "Y’all if I had a dollar for every time someone told me they wish they had my problems bc they’d be skinny I really think I could retire. At 26 lol. Skinny does not equal healthy!!! I was a really strong athlete in college and I was 30lbs heavier back then! Being skinny as a result of malnutrition fucking sucks- I’m cold all the time, I get out of breath cleaning my apartment, I get dizzy when I stand up. Sometimes I want to respond “I wish I had your appetite bc I know I could actually moderate it and be healthy” but I’m not trying to lose friends lol\n\nJust a rant, I’m sure you all get this all the time, it just seems that if you’re physically thin people assume you’re the picture of perfect health. I’m the least healthy I’ve ever been physically, and it has very much impacted my health mentally. Wish ppl would just mind their own business. You eat a lot, I don’t. Move on.",
  "url": "https://www.reddit.com/r/ARFID/comments/109phig/i_wish_i_had_that_problem/",
  "score": 157,
  "num_comments": 52,
  "comments": [
    {
      "id": "j3zs3ci",
      "author": "charlescatusbottom",
      "body": "It is so frustrating!! Everyone wants to complement the ‘success’ of weight loss but no one wants to hear that you are fighting to even maintain weight and the toll it takes on your body and mind.",
      "created_utc": 1673497387.0,
      "score": 40,
      "context": []
    },
    {
      "id": "j40cop7",
      "author": "TheOriginalCocaCola",
      "body": "Honestly, arfid made my anorexia worse and I might not have even developed anorexia at all if not for my arfid. So yeah, be careful what you wish for. \n\n(Tw eating-disordered thoughts) >!my anorexia brain is actually grateful for my arfid because it *wants* to be malnourished, so I get where people are coming from, but I also recognize that actually legit wanting an eating disorder is a sign of issues. I don't think most people who say that they want it know what they're talking about!<",
      "created_utc": 1673510410.0,
      "score": 19,
      "context": []
    },
    {
      "id": "j40fz5m",
      "author": "BringMeYourBullets",
      "body": "I'd probably tell them, nice and calmly, that what they are saying is actually very inconsiderate talking my eating disorder into consideration.",
      "created_utc": 1673513023.0,
      "score": 15,
      "context": []
    },
    {
      "id": "j41tzej",
      "author": "MxJJ",
      "body": "I've wanted to reply with \"Then you can have my eating disorder and I can have your healthy appetite.\" Next time, I think I will.",
      "created_utc": 1673540746.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j41pc7j",
      "author": "ReverendMothman",
      "body": "I have it and I'm absolutely not skinny.",
      "created_utc": 1673538967.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j4050c6",
      "author": "geekgeek2019",
      "body": "what i get is \"you are missing out blah\". I am happy as I am! don't remind me please T\\_T",
      "created_utc": 1673504872.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j40k6zc",
      "author": "KFields94",
      "body": "I need to remind myself of this sometimes. I’m someone who’s very overweight with ARFID due to a ton of factors and i unfortunately do find myself wishing sometimes that I was losing weight to the point of being skinny. But I know that’s not really what I want. I just want people to treat me like they would someone half my weight. It’s so hard sometimes. I’m sorry that happens to so many people here. We all deserve respect and understanding regardless of our weight. <3",
      "created_utc": 1673516532.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j40nj3c",
      "author": "fml2727",
      "body": "I think you should just be honest. Tell them that you are your size because you are not healthy. If the people in your life stop hanging out with you because of that they were never you friends. Sometimes it’s important to be blunt and this is a case where it’s best to be",
      "created_utc": 1673519276.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j41asxa",
      "author": "FiguringItOut--",
      "body": "I remember dropping like 30lbs due to stress. I was eating a snickers bar a day just to keep my weight up. I was the most miserable I had ever been, but everyone was telling me I looked great. And then when I was fat, I basically became invisible. \n\nI wish people would treat others like people and leave weight out of it.  A girl can dream…",
      "created_utc": 1673533045.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j42eysz",
      "author": "2much-2na",
      "body": "Yeah, my mom said this to me once and it honestly just broke my heart that she couldn't see how much of a toll this eating disorder is having on my physical and mental well-being. I literally burst into to tears and ran out of the room when she said it. We had a heart-to-heart afterward and she apologized and admitted that that comment came from a place of genuine insecurity about her own weight and told me about her past struggles with an eating disorder (not ARFID). Now whenever people make similar dumb comments to me, I do my best to empathize with them because those comments are probably coming from their own insecurities about their weight (even though the comments are incredibly tone deaf and rude). People just say things without thinking them through. It's really hard to be the bigger person sometimes and be empathetic towards someone who isn't doing the same for you but it does make it easier to hear those comments when you know that they have a lot more to do with that person's insecurities than you",
      "created_utc": 1673548467.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j40fz8s",
      "author": "qazwsxedc000999",
      "body": "Hey, not trying to put down your problems at all but I also get dizzy when I stand up. It’s often a lack of iron (I’m sure you knew) but have you tried one of those little iron fish that you put in water? They’re very helpful",
      "created_utc": 1673513026.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j43cbow",
      "author": "None",
      "body": "Your comeback is the exact same thing I feel like saying to people sometimes. There was a point where I could literally only eat a couple bites of food per day before I got put on appetite stimulants, and still had my aunt saying that annoying “Wow I wish I had that problem hahahaha” stuff, like SHUT THE FUCK UPPPPPP. \n\nI was literally suffering because of my lack of appetite. I had no energy, no concentration, was emotionally fraught, was having vision blackouts daily, because that’s what happens when you can’t force any nutrients down your throat. She knew this and she’s still saying shit like that, and it’s like, do you really expect me to find this amusing? How fucking rude would we be considered if we said “wish I had that problem!” when they’re complaining about binge eating or being overweight???",
      "created_utc": 1673560548.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j43e4qd",
      "author": "omargosh69",
      "body": "yeah, the comments about how they wish they would be so skinny and they are jealous makes me super uncomfortable. makes me feel like they value my body when i’m dying. and i work at a convenience store and the amount of comments i get from old men saying “oh if you turned to the side i couldn’t even see you” stuff like that, ive been just straight up saying “yeah i have an eating disorder, don’t make comments on peoples bodies because you don’t know what they are going through” the look of horror on their faces does bring me a little joy ngl.",
      "created_utc": 1673561204.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j43zxzu",
      "author": "Hungry-Primary8158",
      "body": "Throw back to the time I was hospitalized for not eating and the nurse weighing me when I was getting discharged said “Oh my daughter wishes she was that weight.” Wtf is wrong with people",
      "created_utc": 1673569791.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j41fqaz",
      "author": "Living-Celebration57",
      "body": "I hear this all the dam time. Wish I had ur problem then I’d be skinny…. Like dude if I try to eat something I love when I’m just not hungry I feel vomit coming up u really want that?? I spent so many days crying cuz I couldn’t eat the amazing meal my mom cooked for everyone. Or I can’t take the look of worry in my parents eyes when I’d be on my 3rd day of no food. They know I can’t help it but they worry and then I feel terrible. How is that something people want just to be thin? I also work outside and basically exercise for a living so anything I do eat I work off very quickly at work. My saving grace is the lofthouse sugar cookies u get at the store I’ll eat 10 of those in a day without a care!",
      "created_utc": 1673535129.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j43hejo",
      "author": "None",
      "body": "AGREEEEEE",
      "created_utc": 1673562418.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j442fv4",
      "author": "Phlebbie",
      "body": "Dude SAME!! I have heard that so many times. I just wanna be like: Bruh I am malnourished and have chronically low blood sugar. You do NOT want this, friend.",
      "created_utc": 1673570825.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j4en04p",
      "author": "happy_row494",
      "body": "Ugh that’s so frustrating I’m sorry you have to deal with that, my gf has ARFID and she’s had that exact experience. I wish you luck and hope ppl aren’t always so annoying!",
      "created_utc": 1673755743.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j6hgk8b",
      "author": "Agi1233",
      "body": "I want to say something about how my life is 3x harder than the average person and now I have memory loss because of malnutrition. But no, I just go “haha… yeah”",
      "created_utc": 1675074237.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j41fef7",
      "author": "LustUnlust",
      "body": "There’s plenty of overweight people with arfid as well",
      "created_utc": 1673534995.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m2rjx09",
      "author": "snekborg",
      "body": "Never met someone who's arfid got worse in their 20s! I'm the same way",
      "created_utc": 1734576703.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j3ztzng",
      "author": "kwink8",
      "body": "Right!! It’s such a not-empathetic response it’s amazing how insensitive ppl can be. It’s like responding to a friend’s problem with “well at least…”\nJust not nice or helpful or necessary lol",
      "created_utc": 1673498353.0,
      "score": 10,
      "context": [
        {
          "id": "j3zs3ci",
          "author": "charlescatusbottom",
          "body": "It is so frustrating!! Everyone wants to complement the ‘success’ of weight loss but no one wants to hear that you are fighting to even maintain weight and the toll it takes on your body and mind.",
          "created_utc": 1673497387.0
        }
      ]
    },
    {
      "id": "j6qm0z0",
      "author": "PerfectFlaws91",
      "body": "I told the doctor at my psych office that I lost 60 lbs in two months because I became terrified to eat anything, so I stopped eating everything except spoonfuls of peanut butter to keep me from passing out. She told me \"Well, whatever you're doing, keep at it! It's working!\" I'm obese, so I can kinda get it, but dang.",
      "created_utc": 1675226830.0,
      "score": 2,
      "context": [
        {
          "id": "j3zs3ci",
          "author": "charlescatusbottom",
          "body": "It is so frustrating!! Everyone wants to complement the ‘success’ of weight loss but no one wants to hear that you are fighting to even maintain weight and the toll it takes on your body and mind.",
          "created_utc": 1673497387.0
        }
      ]
    },
    {
      "id": "j41rh5o",
      "author": "None",
      "body": "Hey, another afrid-anorexia person! Rip both pf us because I have the exact same thoughts",
      "created_utc": 1673539791.0,
      "score": 8,
      "context": [
        {
          "id": "j40cop7",
          "author": "TheOriginalCocaCola",
          "body": "Honestly, arfid made my anorexia worse and I might not have even developed anorexia at all if not for my arfid. So yeah, be careful what you wish for. \n\n(Tw eating-disordered thoughts) >!my anorexia brain is actually grateful for my arfid because it *wants* to be malnourished, so I get where people are coming from, but I also recognize that actually legit wanting an eating disorder is a sign of issues. I don't think most people who say that they want it know what they're talking about!<",
          "created_utc": 1673510410.0
        }
      ]
    },
    {
      "id": "j41i896",
      "author": "kwink8",
      "body": "I can totally see how that would happen, especially w all the outside commentary praising weight loss at any cost. Sometimes I think my mental health has taken the biggest toll, but then I try to go for a jog and realize my body’s pretty fucked at this point too. I hope you’re able to find or already have a good support system, and arfid/anorexia combo is no joke. You’re very strong!",
      "created_utc": 1673536151.0,
      "score": 5,
      "context": [
        {
          "id": "j40cop7",
          "author": "TheOriginalCocaCola",
          "body": "Honestly, arfid made my anorexia worse and I might not have even developed anorexia at all if not for my arfid. So yeah, be careful what you wish for. \n\n(Tw eating-disordered thoughts) >!my anorexia brain is actually grateful for my arfid because it *wants* to be malnourished, so I get where people are coming from, but I also recognize that actually legit wanting an eating disorder is a sign of issues. I don't think most people who say that they want it know what they're talking about!<",
          "created_utc": 1673510410.0
        }
      ]
    },
    {
      "id": "j41j11y",
      "author": "kwink8",
      "body": "Thank you for this advice! I’m not super confrontational so sometimes I forget that advocating for myself doesn’t actually have to be a “conflict.” I like the idea of a calm, educational approach!",
      "created_utc": 1673536478.0,
      "score": 8,
      "context": [
        {
          "id": "j40fz5m",
          "author": "BringMeYourBullets",
          "body": "I'd probably tell them, nice and calmly, that what they are saying is actually very inconsiderate talking my eating disorder into consideration.",
          "created_utc": 1673513023.0
        }
      ]
    },
    {
      "id": "j41vhxj",
      "author": "kwink8",
      "body": "\nIt’s so hard not to be snarky sometimes, if someone catches me on the wrong day they might get some sass. \nI have had people ask me “how do you stay so skinny??” And my response was a deadpan “I don’t eat.” But that’s probably as harsh as I’ve been haha",
      "created_utc": 1673541322.0,
      "score": 6,
      "context": [
        {
          "id": "j41tzej",
          "author": "MxJJ",
          "body": "I've wanted to reply with \"Then you can have my eating disorder and I can have your healthy appetite.\" Next time, I think I will.",
          "created_utc": 1673540746.0
        }
      ]
    },
    {
      "id": "j41s013",
      "author": "kwink8",
      "body": "I totally understand, I’ve responded to a few people regarding that because I can see that my post was pretty fatphobic and that was not my intent. I’m sorry you’re dealing with ARFID I know it’s exhausting and I never meant to invalidate overweight folks with my post. I wasn’t trying to say who does and does not, or can and cannot have arfid, I was just pointing out the comments I receive that are insensitive. Obviously I was being insensitive myself and need to be more careful with my language, I will work on that!",
      "created_utc": 1673539994.0,
      "score": 3,
      "context": [
        {
          "id": "j41pc7j",
          "author": "ReverendMothman",
          "body": "I have it and I'm absolutely not skinny.",
          "created_utc": 1673538967.0
        }
      ]
    },
    {
      "id": "j41ih9s",
      "author": "kwink8",
      "body": "I get that too, or “you haven’t even taken a bite how do you know-“ let me stop you right there. I know I don’t like it. I know my own tastebuds better than someone else lol",
      "created_utc": 1673536254.0,
      "score": 4,
      "context": [
        {
          "id": "j4050c6",
          "author": "geekgeek2019",
          "body": "what i get is \"you are missing out blah\". I am happy as I am! don't remind me please T\\_T",
          "created_utc": 1673504872.0
        }
      ]
    },
    {
      "id": "j41huso",
      "author": "kwink8",
      "body": "Thank you for your reply! I was ranting last night bc a coworker had made that comment but rereading my post, it definitely comes across as fatphobic. Not that you said that, I’m just not loving the language I used so I wanted to call it out. Absolutely it’s so fucked up the way people genuinely seem to determine a person’s value based so heavily on their weight. You have a really interesting perspective, I wonder how often the desire to be skinny is really the desire to be treated human. Thin privilege is a real thing and I’ve experienced it my whole life. And anecdotally, one of my good friends lost around 100lbs in less than a year (due to illness unfortunately) and she has noticed a major difference in the way people treat her. Even though she was sick! It was still celebrated weight loss. \nThis became a small rant again haha but ARFID fucking sucks and it manifests differently for different people. I’m so sorry people treat you differently based on your weight, I know that would fuck w my mental health. Please know that you’re seen and supported in this community, and I’m going to do a better job keeping in mind how diverse eating disorders can appear on the outside.",
      "created_utc": 1673535999.0,
      "score": 4,
      "context": [
        {
          "id": "j40k6zc",
          "author": "KFields94",
          "body": "I need to remind myself of this sometimes. I’m someone who’s very overweight with ARFID due to a ton of factors and i unfortunately do find myself wishing sometimes that I was losing weight to the point of being skinny. But I know that’s not really what I want. I just want people to treat me like they would someone half my weight. It’s so hard sometimes. I’m sorry that happens to so many people here. We all deserve respect and understanding regardless of our weight. <3",
          "created_utc": 1673516532.0
        }
      ]
    },
    {
      "id": "j41jpi2",
      "author": "kwink8",
      "body": "That’s completely fair honestly and would certainly let me know if any of my friendships are more shallow than I realize. I do believe all my friends would understand and support me, I just haven’t communicated to all of them how much I’m struggling. So thank you for this comment I’m going to try being more transparent with the people in my life about what’s going on :)",
      "created_utc": 1673536749.0,
      "score": 4,
      "context": [
        {
          "id": "j40nj3c",
          "author": "fml2727",
          "body": "I think you should just be honest. Tell them that you are your size because you are not healthy. If the people in your life stop hanging out with you because of that they were never you friends. Sometimes it’s important to be blunt and this is a case where it’s best to be",
          "created_utc": 1673519276.0
        }
      ]
    },
    {
      "id": "j41k8px",
      "author": "kwink8",
      "body": "I feel you, I went to my doctor (literally because I lost a lot of weight unintentionally) and the first thing she said was an excited, “wow have you lost weight??” I was like ya lol that’s why I’m here I don’t have that much weight to lose. Being able to stomach one food item a day is so depressing and exhausting. Food is a huge part of our culture whether we care or not, and being unable to participate in food culture sucks. I’d rather be heavier and get to enjoy dinner parties, but then with our fucking society would I even get invited to dinner parties if I was heavier? Ugh, it’s all fucked. I hope you’re in an at-least-okay place :)",
      "created_utc": 1673536961.0,
      "score": 5,
      "context": [
        {
          "id": "j41asxa",
          "author": "FiguringItOut--",
          "body": "I remember dropping like 30lbs due to stress. I was eating a snickers bar a day just to keep my weight up. I was the most miserable I had ever been, but everyone was telling me I looked great. And then when I was fat, I basically became invisible. \n\nI wish people would treat others like people and leave weight out of it.  A girl can dream…",
          "created_utc": 1673533045.0
        }
      ]
    },
    {
      "id": "j42iakj",
      "author": "kwink8",
      "body": "I’m sorry you had to go through that with your mom, it’s really hurtful when something like this comes from a person you’re supposed to be able to really trust. But I love that it led to deeper understanding for both of you and it sounds like y’all worked through it in a really great way! Thank you for your insight, it makes total sense and I haven’t thought of it that way. If someone was totally secure in themselves they would never make that comment to me in the first place, so I love the idea of approaching with empathy. We’re all just trying to navigate this world and doing the best we can, I think it’s awesome that you’re able to have such grace for people and I’m definitely going to try to incorporate that going forward :)",
      "created_utc": 1673549668.0,
      "score": 3,
      "context": [
        {
          "id": "j42eysz",
          "author": "2much-2na",
          "body": "Yeah, my mom said this to me once and it honestly just broke my heart that she couldn't see how much of a toll this eating disorder is having on my physical and mental well-being. I literally burst into to tears and ran out of the room when she said it. We had a heart-to-heart afterward and she apologized and admitted that that comment came from a place of genuine insecurity about her own weight and told me about her past struggles with an eating disorder (not ARFID). Now whenever people make similar dumb comments to me, I do my best to empathize with them because those comments are probably coming from their own insecurities about their weight (even though the comments are incredibly tone deaf and rude). People just say things without thinking them through. It's really hard to be the bigger person sometimes and be empathetic towards someone who isn't doing the same for you but it does make it easier to hear those comments when you know that they have a lot more to do with that person's insecurities than you",
          "created_utc": 1673548467.0
        }
      ]
    },
    {
      "id": "j41j7y8",
      "author": "kwink8",
      "body": "I haven’t heard of those, do they dissolve in water? I do have iron supplements that I take occasionally bc I was anemic in college, but I’m not on a regimen now, it’s more just when I remember. Thanks for the advice, I think I’m gonna bring iron up to my dietician next time I see her!",
      "created_utc": 1673536555.0,
      "score": 1,
      "context": [
        {
          "id": "j40fz8s",
          "author": "qazwsxedc000999",
          "body": "Hey, not trying to put down your problems at all but I also get dizzy when I stand up. It’s often a lack of iron (I’m sure you knew) but have you tried one of those little iron fish that you put in water? They’re very helpful",
          "created_utc": 1673513026.0
        }
      ]
    },
    {
      "id": "j443a8f",
      "author": "kwink8",
      "body": "Exactly!! It’s such a double standard, sometimes I literally do wish I had to lose weight, bc I feel like I’d be pretty fucking good at it haha. But I would never in a million years say that to someone who just opened up to me about their weight loss struggles. It’s textbook invalidation, not that hard to bite your tongue.",
      "created_utc": 1673571179.0,
      "score": 2,
      "context": [
        {
          "id": "j43cbow",
          "author": "None",
          "body": "Your comeback is the exact same thing I feel like saying to people sometimes. There was a point where I could literally only eat a couple bites of food per day before I got put on appetite stimulants, and still had my aunt saying that annoying “Wow I wish I had that problem hahahaha” stuff, like SHUT THE FUCK UPPPPPP. \n\nI was literally suffering because of my lack of appetite. I had no energy, no concentration, was emotionally fraught, was having vision blackouts daily, because that’s what happens when you can’t force any nutrients down your throat. She knew this and she’s still saying shit like that, and it’s like, do you really expect me to find this amusing? How fucking rude would we be considered if we said “wish I had that problem!” when they’re complaining about binge eating or being overweight???",
          "created_utc": 1673560548.0
        }
      ]
    },
    {
      "id": "j442xvv",
      "author": "kwink8",
      "body": "I hate hate HATE when men make comments like that, or like “a strong wind could blow you over!” \nLike thank you for reminding me how easily you could victimize me right now lol. I love your response, that is amazing. Probably a lifelong lesson for those ppl too!",
      "created_utc": 1673571035.0,
      "score": 2,
      "context": [
        {
          "id": "j43e4qd",
          "author": "omargosh69",
          "body": "yeah, the comments about how they wish they would be so skinny and they are jealous makes me super uncomfortable. makes me feel like they value my body when i’m dying. and i work at a convenience store and the amount of comments i get from old men saying “oh if you turned to the side i couldn’t even see you” stuff like that, ive been just straight up saying “yeah i have an eating disorder, don’t make comments on peoples bodies because you don’t know what they are going through” the look of horror on their faces does bring me a little joy ngl.",
          "created_utc": 1673561204.0
        }
      ]
    },
    {
      "id": "j442mg0",
      "author": "kwink8",
      "body": "🙄🙄🙄 I bet your daughter wishes she had a less ignorant parent too lol",
      "created_utc": 1673570901.0,
      "score": 2,
      "context": [
        {
          "id": "j43zxzu",
          "author": "Hungry-Primary8158",
          "body": "Throw back to the time I was hospitalized for not eating and the nurse weighing me when I was getting discharged said “Oh my daughter wishes she was that weight.” Wtf is wrong with people",
          "created_utc": 1673569791.0
        }
      ]
    },
    {
      "id": "j41ljr2",
      "author": "kwink8",
      "body": "Ugh I completely understand crying bc you can’t eat a meal you WANT to eat with loved ones. I left a NYE party and a birthday party early bc I feel nauseous and bloated within the past month and it just fucking sucks. My mom cried when she visited and she saw how much weight I lost and how little I could eat, and that was heartbreaking for me. I don’t want to worry my family, I’m just trying to keep my head above water. \nThey don’t taste that good but if you’re ever able to stomach boosts/ensures, I found a product very cleverly named “Boost Very High Calorie” lol that definitely pack more nutrition in than regular boosts. Kind of expensive, I only ordered them bc I had an Amazon gift card, but I hope you’re able to find something to sustain that physical outdoor work!",
      "created_utc": 1673537482.0,
      "score": 2,
      "context": [
        {
          "id": "j41fqaz",
          "author": "Living-Celebration57",
          "body": "I hear this all the dam time. Wish I had ur problem then I’d be skinny…. Like dude if I try to eat something I love when I’m just not hungry I feel vomit coming up u really want that?? I spent so many days crying cuz I couldn’t eat the amazing meal my mom cooked for everyone. Or I can’t take the look of worry in my parents eyes when I’d be on my 3rd day of no food. They know I can’t help it but they worry and then I feel terrible. How is that something people want just to be thin? I also work outside and basically exercise for a living so anything I do eat I work off very quickly at work. My saving grace is the lofthouse sugar cookies u get at the store I’ll eat 10 of those in a day without a care!",
          "created_utc": 1673535129.0
        }
      ]
    },
    {
      "id": "j443hyg",
      "author": "kwink8",
      "body": "Exactly!! Like… do you want to trade for a week?? I’m 100% certain a week (probs much less) in our shoes would be all it would take for these ppl to realize how miserable it is and to want their bodies and appetites back.",
      "created_utc": 1673571270.0,
      "score": 3,
      "context": [
        {
          "id": "j442fv4",
          "author": "Phlebbie",
          "body": "Dude SAME!! I have heard that so many times. I just wanna be like: Bruh I am malnourished and have chronically low blood sugar. You do NOT want this, friend.",
          "created_utc": 1673570825.0
        }
      ]
    },
    {
      "id": "j41kyma",
      "author": "kwink8",
      "body": "Thank you for reminding me of that, I just responded to another commenter bc I realized upon waking up and rereading my post that the language I used is super fatphobic. And it was especially insensitive to the overweight folks who have the same problem I do but don’t get as much support because it manifests differently physically.  I don’t want ranting about my own experience to invalidate someone else’s, so I will be more careful with language in the future. Thank you for calling that out!",
      "created_utc": 1673537247.0,
      "score": 2,
      "context": [
        {
          "id": "j41fef7",
          "author": "LustUnlust",
          "body": "There’s plenty of overweight people with arfid as well",
          "created_utc": 1673534995.0
        }
      ]
    },
    {
      "id": "j49sqta",
      "author": "LustUnlust",
      "body": "Hey don’t be so hard on yourself, you were talking about your personal experience. I don’t think you were out of bounds for doing so. It’s just even medically being underweight was a diagnostic criteria used for a long time, it’s pretty new that they are recognizing that weight isn’t a cut and dry part of how this illness presents. So my post was just a friendly reminder, I’m happy you took mine and others responses as a learning experience though, I think you are very kind, so again be easy on yourself living with arfid isn’t easy I know we all get a lot of unwanted comments from people close to us about what and how we eat and it’s often a distressing thing to go through. I hope you find helpful answers here and lots of continued support ::hugs::",
      "created_utc": 1673668675.0,
      "score": 3,
      "context": [
        {
          "id": "j3zs3ci",
          "author": "charlescatusbottom",
          "body": "It is so frustrating!! Everyone wants to complement the ‘success’ of weight loss but no one wants to hear that you are fighting to even maintain weight and the toll it takes on your body and mind.",
          "created_utc": 1673497387.0
        },
        {
          "id": "j3ztzng",
          "author": "kwink8",
          "body": "Right!! It’s such a not-empathetic response it’s amazing how insensitive ppl can be. It’s like responding to a friend’s problem with “well at least…”\nJust not nice or helpful or necessary lol",
          "created_utc": 1673498353.0
        }
      ]
    },
    {
      "id": "j41jbfe",
      "author": "BringMeYourBullets",
      "body": "I am also just getting better at setting up boundaries myself! Good luck 🙂",
      "created_utc": 1673536594.0,
      "score": 4,
      "context": [
        {
          "id": "j40fz5m",
          "author": "BringMeYourBullets",
          "body": "I'd probably tell them, nice and calmly, that what they are saying is actually very inconsiderate talking my eating disorder into consideration.",
          "created_utc": 1673513023.0
        },
        {
          "id": "j41j11y",
          "author": "kwink8",
          "body": "Thank you for this advice! I’m not super confrontational so sometimes I forget that advocating for myself doesn’t actually have to be a “conflict.” I like the idea of a calm, educational approach!",
          "created_utc": 1673536478.0
        }
      ]
    },
    {
      "id": "j41wojy",
      "author": "ReverendMothman",
      "body": "You didn't invalidate anyone at all. My point was just to illustrate that their \"wishing they had our problem\" was another level of stupid because it doesn't guarantee thinness lol.",
      "created_utc": 1673541771.0,
      "score": 8,
      "context": [
        {
          "id": "j41pc7j",
          "author": "ReverendMothman",
          "body": "I have it and I'm absolutely not skinny.",
          "created_utc": 1673538967.0
        },
        {
          "id": "j41s013",
          "author": "kwink8",
          "body": "I totally understand, I’ve responded to a few people regarding that because I can see that my post was pretty fatphobic and that was not my intent. I’m sorry you’re dealing with ARFID I know it’s exhausting and I never meant to invalidate overweight folks with my post. I wasn’t trying to say who does and does not, or can and cannot have arfid, I was just pointing out the comments I receive that are insensitive. Obviously I was being insensitive myself and need to be more careful with my language, I will work on that!",
          "created_utc": 1673539994.0
        }
      ]
    },
    {
      "id": "j41ittr",
      "author": "KFields94",
      "body": "You’re totally allowed to rant! Don’t feel bad about how you feel, but I appreciate your reply and your perspective. Everyone, even with similar conditions, experiences life differently! I hope things get better for you! At the end of the day, everyone just needs to not comment on others’ bodies, whether perceived as big or small. You never know what someone’s going through and so many people don’t get that. Thanks for your kind response!",
      "created_utc": 1673536397.0,
      "score": 2,
      "context": [
        {
          "id": "j40k6zc",
          "author": "KFields94",
          "body": "I need to remind myself of this sometimes. I’m someone who’s very overweight with ARFID due to a ton of factors and i unfortunately do find myself wishing sometimes that I was losing weight to the point of being skinny. But I know that’s not really what I want. I just want people to treat me like they would someone half my weight. It’s so hard sometimes. I’m sorry that happens to so many people here. We all deserve respect and understanding regardless of our weight. <3",
          "created_utc": 1673516532.0
        },
        {
          "id": "j41huso",
          "author": "kwink8",
          "body": "Thank you for your reply! I was ranting last night bc a coworker had made that comment but rereading my post, it definitely comes across as fatphobic. Not that you said that, I’m just not loving the language I used so I wanted to call it out. Absolutely it’s so fucked up the way people genuinely seem to determine a person’s value based so heavily on their weight. You have a really interesting perspective, I wonder how often the desire to be skinny is really the desire to be treated human. Thin privilege is a real thing and I’ve experienced it my whole life. And anecdotally, one of my good friends lost around 100lbs in less than a year (due to illness unfortunately) and she has noticed a major difference in the way people treat her. Even though she was sick! It was still celebrated weight loss. \nThis became a small rant again haha but ARFID fucking sucks and it manifests differently for different people. I’m so sorry people treat you differently based on your weight, I know that would fuck w my mental health. Please know that you’re seen and supported in this community, and I’m going to do a better job keeping in mind how diverse eating disorders can appear on the outside.",
          "created_utc": 1673535999.0
        }
      ]
    },
    {
      "id": "j41rlfr",
      "author": "fml2727",
      "body": " I hope it goes well for you! Once I became more open about my ARFID with others I’ve gotten a LOT less judgment for my eating habits. Many people who had made fun on me for years finally emphasized with my struggle. \n\nOne thing I always try to remind myself is nothing feels better than healthy. I’ve been overweight and underweight and honestly no body weight I had made me feel better than the one I felt most physically healthy at. I hope that mantra can help you as well",
      "created_utc": 1673539838.0,
      "score": 5,
      "context": [
        {
          "id": "j40nj3c",
          "author": "fml2727",
          "body": "I think you should just be honest. Tell them that you are your size because you are not healthy. If the people in your life stop hanging out with you because of that they were never you friends. Sometimes it’s important to be blunt and this is a case where it’s best to be",
          "created_utc": 1673519276.0
        },
        {
          "id": "j41jpi2",
          "author": "kwink8",
          "body": "That’s completely fair honestly and would certainly let me know if any of my friendships are more shallow than I realize. I do believe all my friends would understand and support me, I just haven’t communicated to all of them how much I’m struggling. So thank you for this comment I’m going to try being more transparent with the people in my life about what’s going on :)",
          "created_utc": 1673536749.0
        }
      ]
    },
    {
      "id": "j41oqzs",
      "author": "FiguringItOut--",
      "body": "Thank you <3 I hope things get better for you! Eating disorders are a PITA",
      "created_utc": 1673538741.0,
      "score": 3,
      "context": [
        {
          "id": "j41asxa",
          "author": "FiguringItOut--",
          "body": "I remember dropping like 30lbs due to stress. I was eating a snickers bar a day just to keep my weight up. I was the most miserable I had ever been, but everyone was telling me I looked great. And then when I was fat, I basically became invisible. \n\nI wish people would treat others like people and leave weight out of it.  A girl can dream…",
          "created_utc": 1673533045.0
        },
        {
          "id": "j41k8px",
          "author": "kwink8",
          "body": "I feel you, I went to my doctor (literally because I lost a lot of weight unintentionally) and the first thing she said was an excited, “wow have you lost weight??” I was like ya lol that’s why I’m here I don’t have that much weight to lose. Being able to stomach one food item a day is so depressing and exhausting. Food is a huge part of our culture whether we care or not, and being unable to participate in food culture sucks. I’d rather be heavier and get to enjoy dinner parties, but then with our fucking society would I even get invited to dinner parties if I was heavier? Ugh, it’s all fucked. I hope you’re in an at-least-okay place :)",
          "created_utc": 1673536961.0
        }
      ]
    },
    {
      "id": "j49wd1s",
      "author": "kwink8",
      "body": "Thank you so much for going out of your way to respond! I’m glad people pointed out different experiences and I think talking about all these differences helps us all grow. You’re pretty cool, Reddit stranger! I hope you have success w your arfid journey (and any other journeys) as well, and I also hope the medical field continues to catch up bc I feel like there’s still a long way to go. I wish you luck with everything!",
      "created_utc": 1673670594.0,
      "score": 3,
      "context": [
        {
          "id": "j3zs3ci",
          "author": "charlescatusbottom",
          "body": "It is so frustrating!! Everyone wants to complement the ‘success’ of weight loss but no one wants to hear that you are fighting to even maintain weight and the toll it takes on your body and mind.",
          "created_utc": 1673497387.0
        },
        {
          "id": "j3ztzng",
          "author": "kwink8",
          "body": "Right!! It’s such a not-empathetic response it’s amazing how insensitive ppl can be. It’s like responding to a friend’s problem with “well at least…”\nJust not nice or helpful or necessary lol",
          "created_utc": 1673498353.0
        },
        {
          "id": "j49sqta",
          "author": "LustUnlust",
          "body": "Hey don’t be so hard on yourself, you were talking about your personal experience. I don’t think you were out of bounds for doing so. It’s just even medically being underweight was a diagnostic criteria used for a long time, it’s pretty new that they are recognizing that weight isn’t a cut and dry part of how this illness presents. So my post was just a friendly reminder, I’m happy you took mine and others responses as a learning experience though, I think you are very kind, so again be easy on yourself living with arfid isn’t easy I know we all get a lot of unwanted comments from people close to us about what and how we eat and it’s often a distressing thing to go through. I hope you find helpful answers here and lots of continued support ::hugs::",
          "created_utc": 1673668675.0
        }
      ]
    },
    {
      "id": "j41yzsl",
      "author": "kwink8",
      "body": "Gotcha!! That makes complete sense, I’m sorry I totally misinterpreted. But yes people forget that eating disorders can look very different person to person, and I feel like a lot of folks fall through the cracks with receiving services because they don’t look “sick enough.” So I just want to make sure I’m not contributing to that problem! \nBut you’re totally right, people are so fucking dumb lol, they could have my exact problem and be 100lbs heavier than me. Gotta love diet culture and conventional beauty standards 🙄 \nThank you for your response!!",
      "created_utc": 1673542626.0,
      "score": 5,
      "context": [
        {
          "id": "j41pc7j",
          "author": "ReverendMothman",
          "body": "I have it and I'm absolutely not skinny.",
          "created_utc": 1673538967.0
        },
        {
          "id": "j41s013",
          "author": "kwink8",
          "body": "I totally understand, I’ve responded to a few people regarding that because I can see that my post was pretty fatphobic and that was not my intent. I’m sorry you’re dealing with ARFID I know it’s exhausting and I never meant to invalidate overweight folks with my post. I wasn’t trying to say who does and does not, or can and cannot have arfid, I was just pointing out the comments I receive that are insensitive. Obviously I was being insensitive myself and need to be more careful with my language, I will work on that!",
          "created_utc": 1673539994.0
        },
        {
          "id": "j41wojy",
          "author": "ReverendMothman",
          "body": "You didn't invalidate anyone at all. My point was just to illustrate that their \"wishing they had our problem\" was another level of stupid because it doesn't guarantee thinness lol.",
          "created_utc": 1673541771.0
        }
      ]
    },
    {
      "id": "j41m4zc",
      "author": "kwink8",
      "body": "Thank you! I hope things improve for you as well :) I think time is a construct lol but I hope all of us have an amazing 2023!",
      "created_utc": 1673537719.0,
      "score": 2,
      "context": [
        {
          "id": "j40k6zc",
          "author": "KFields94",
          "body": "I need to remind myself of this sometimes. I’m someone who’s very overweight with ARFID due to a ton of factors and i unfortunately do find myself wishing sometimes that I was losing weight to the point of being skinny. But I know that’s not really what I want. I just want people to treat me like they would someone half my weight. It’s so hard sometimes. I’m sorry that happens to so many people here. We all deserve respect and understanding regardless of our weight. <3",
          "created_utc": 1673516532.0
        },
        {
          "id": "j41huso",
          "author": "kwink8",
          "body": "Thank you for your reply! I was ranting last night bc a coworker had made that comment but rereading my post, it definitely comes across as fatphobic. Not that you said that, I’m just not loving the language I used so I wanted to call it out. Absolutely it’s so fucked up the way people genuinely seem to determine a person’s value based so heavily on their weight. You have a really interesting perspective, I wonder how often the desire to be skinny is really the desire to be treated human. Thin privilege is a real thing and I’ve experienced it my whole life. And anecdotally, one of my good friends lost around 100lbs in less than a year (due to illness unfortunately) and she has noticed a major difference in the way people treat her. Even though she was sick! It was still celebrated weight loss. \nThis became a small rant again haha but ARFID fucking sucks and it manifests differently for different people. I’m so sorry people treat you differently based on your weight, I know that would fuck w my mental health. Please know that you’re seen and supported in this community, and I’m going to do a better job keeping in mind how diverse eating disorders can appear on the outside.",
          "created_utc": 1673535999.0
        },
        {
          "id": "j41ittr",
          "author": "KFields94",
          "body": "You’re totally allowed to rant! Don’t feel bad about how you feel, but I appreciate your reply and your perspective. Everyone, even with similar conditions, experiences life differently! I hope things get better for you! At the end of the day, everyone just needs to not comment on others’ bodies, whether perceived as big or small. You never know what someone’s going through and so many people don’t get that. Thanks for your kind response!",
          "created_utc": 1673536397.0
        }
      ]
    },
    {
      "id": "j41uh1y",
      "author": "kwink8",
      "body": "\nThat’s encouraging to hear, I can think of a couple of friends that I might feel comfortable having more of a heart to heart with. \nI love your second paragraph. I completely agree. I just want to feel good, however that ends up making me look is okay with me. I just miss running and rock climbing, and I can’t do those things at my current intake. I will definitely adopt that mantra bc I’ve been putting pressure on myself to gain weight, when really I just want to gain strength and freedom. Thank you for your insight, you have a really wonderful outlook when it comes to weight!",
      "created_utc": 1673540932.0,
      "score": 3,
      "context": [
        {
          "id": "j40nj3c",
          "author": "fml2727",
          "body": "I think you should just be honest. Tell them that you are your size because you are not healthy. If the people in your life stop hanging out with you because of that they were never you friends. Sometimes it’s important to be blunt and this is a case where it’s best to be",
          "created_utc": 1673519276.0
        },
        {
          "id": "j41jpi2",
          "author": "kwink8",
          "body": "That’s completely fair honestly and would certainly let me know if any of my friendships are more shallow than I realize. I do believe all my friends would understand and support me, I just haven’t communicated to all of them how much I’m struggling. So thank you for this comment I’m going to try being more transparent with the people in my life about what’s going on :)",
          "created_utc": 1673536749.0
        },
        {
          "id": "j41rlfr",
          "author": "fml2727",
          "body": " I hope it goes well for you! Once I became more open about my ARFID with others I’ve gotten a LOT less judgment for my eating habits. Many people who had made fun on me for years finally emphasized with my struggle. \n\nOne thing I always try to remind myself is nothing feels better than healthy. I’ve been overweight and underweight and honestly no body weight I had made me feel better than the one I felt most physically healthy at. I hope that mantra can help you as well",
          "created_utc": 1673539838.0
        }
      ]
    },
    {
      "id": "j41zpec",
      "author": "ReverendMothman",
      "body": "Yeah no problem I was very skinny til my mid 20s and constantly got comments about it. It was obnoxious as hell. \"Gotta put some meat on ur bones\". I think one thing that contributes now is i found more (unhealthy) safe foods and will sometimes bored eat said unhealthy foods plus I have had sedentary jobs for 10 years lol...plus genetics",
      "created_utc": 1673542886.0,
      "score": 5,
      "context": [
        {
          "id": "j41pc7j",
          "author": "ReverendMothman",
          "body": "I have it and I'm absolutely not skinny.",
          "created_utc": 1673538967.0
        },
        {
          "id": "j41s013",
          "author": "kwink8",
          "body": "I totally understand, I’ve responded to a few people regarding that because I can see that my post was pretty fatphobic and that was not my intent. I’m sorry you’re dealing with ARFID I know it’s exhausting and I never meant to invalidate overweight folks with my post. I wasn’t trying to say who does and does not, or can and cannot have arfid, I was just pointing out the comments I receive that are insensitive. Obviously I was being insensitive myself and need to be more careful with my language, I will work on that!",
          "created_utc": 1673539994.0
        },
        {
          "id": "j41wojy",
          "author": "ReverendMothman",
          "body": "You didn't invalidate anyone at all. My point was just to illustrate that their \"wishing they had our problem\" was another level of stupid because it doesn't guarantee thinness lol.",
          "created_utc": 1673541771.0
        },
        {
          "id": "j41yzsl",
          "author": "kwink8",
          "body": "Gotcha!! That makes complete sense, I’m sorry I totally misinterpreted. But yes people forget that eating disorders can look very different person to person, and I feel like a lot of folks fall through the cracks with receiving services because they don’t look “sick enough.” So I just want to make sure I’m not contributing to that problem! \nBut you’re totally right, people are so fucking dumb lol, they could have my exact problem and be 100lbs heavier than me. Gotta love diet culture and conventional beauty standards 🙄 \nThank you for your response!!",
          "created_utc": 1673542626.0
        }
      ]
    },
    {
      "id": "j421ds4",
      "author": "kwink8",
      "body": "Lol my favorite is “eat a burger” as if that’s the end all be all for weight gain. I don’t even like beef so I think the associated vomiting would cancel out the calories lmao\nPeople definitely underestimate genetics. I was one of those ppl who believed for awhile weight was a simple result of diet+exercise and nothing else until I met my girlfriend of 3 years. She’s been overweight since she was a little kid, and obviously diet and exercise has contributed to a degree, but I’ve also seen how hard she has to work to lose any weight. I could eat a whole pizza (if my body let me lol) and would metabolize it fairly quickly, if she did the same she would def put on a few pounds. The little kids in her family are bigger than me or my siblings were as kids, and I feel like a lot of people straight up ignore genetics. As a lesbian couple we both want to carry a baby, it’ll be interesting to see if our “biological” kids turn out differently in that regard!",
      "created_utc": 1673543518.0,
      "score": 2,
      "context": [
        {
          "id": "j41pc7j",
          "author": "ReverendMothman",
          "body": "I have it and I'm absolutely not skinny.",
          "created_utc": 1673538967.0
        },
        {
          "id": "j41s013",
          "author": "kwink8",
          "body": "I totally understand, I’ve responded to a few people regarding that because I can see that my post was pretty fatphobic and that was not my intent. I’m sorry you’re dealing with ARFID I know it’s exhausting and I never meant to invalidate overweight folks with my post. I wasn’t trying to say who does and does not, or can and cannot have arfid, I was just pointing out the comments I receive that are insensitive. Obviously I was being insensitive myself and need to be more careful with my language, I will work on that!",
          "created_utc": 1673539994.0
        },
        {
          "id": "j41wojy",
          "author": "ReverendMothman",
          "body": "You didn't invalidate anyone at all. My point was just to illustrate that their \"wishing they had our problem\" was another level of stupid because it doesn't guarantee thinness lol.",
          "created_utc": 1673541771.0
        },
        {
          "id": "j41yzsl",
          "author": "kwink8",
          "body": "Gotcha!! That makes complete sense, I’m sorry I totally misinterpreted. But yes people forget that eating disorders can look very different person to person, and I feel like a lot of folks fall through the cracks with receiving services because they don’t look “sick enough.” So I just want to make sure I’m not contributing to that problem! \nBut you’re totally right, people are so fucking dumb lol, they could have my exact problem and be 100lbs heavier than me. Gotta love diet culture and conventional beauty standards 🙄 \nThank you for your response!!",
          "created_utc": 1673542626.0
        },
        {
          "id": "j41zpec",
          "author": "ReverendMothman",
          "body": "Yeah no problem I was very skinny til my mid 20s and constantly got comments about it. It was obnoxious as hell. \"Gotta put some meat on ur bones\". I think one thing that contributes now is i found more (unhealthy) safe foods and will sometimes bored eat said unhealthy foods plus I have had sedentary jobs for 10 years lol...plus genetics",
          "created_utc": 1673542886.0
        }
      ]
    }
  ]
}