{
  "id": "10y6ksf",
  "subreddit": "ARFID",
  "author": "KribriQT",
  "created_utc": 1675977665.0,
  "title": "Husbands approach to my ARFID as a parent made me emotional",
  "selftext": "My husband and I are currently expecting our first child, with just under two months left until our little boy makes his appearance. \n\nI’ve had ARFID all my life, and I really thought I would never be able to have a healthy baby because of it. Luckily baby has been doing amazingly(other than an iron deficiency which I’m on supplements for). \n\nWith our due date racing towards us, I’m picturing how the next two decades are going to look for us and I am so scared that our son is going to inherit my issues with food. \n\nI was voicing these concerns to my husband last night. I told him that I didn’t know what to do because I don’t want our son to only see me eating safe foods or anything unhealthy, but at the same time I don’t want him seeing me gag and panic over trying to eat anything that isn’t a safe food. I feel like both of these scenarios could lead to him having a negative relationship with food. I know it’s important to try and have dinner as a family when possible.\n\nMy husbands response to this is that he’ll do his best to make dinners with things I like that are relatively healthy, but also make sure I take a multivitamin with my meal so that we can teach our son why people eat healthy foods. He’ll explain that mama has a condition that makes it hard for me to eat all the healthy things that they can, and that because of that, I have to take a vitamin to stay healthy. He said that if our son has ARFID, he’ll be okay and we will never force him to eat anything(which is what my parents did to me). We will work around it.\n\nWe finished the conversation and I felt so heard and understood by my husband. He loves to cook and food is very much his love language, so I know it’s hard for him being married to someone with ARFID. I hope our son takes after him. Not just with food, but also his compassion and empathy.\n\nI have always been embarrassed about my ARFID, but he has never judged or been unkind. He actively defends me when other people make comments. He’s tried to get me to try new foods, but is always understanding if I can’t. He’s going to be such a good daddy, and we are so lucky to have him.",
  "url": "https://www.reddit.com/r/ARFID/comments/10y6ksf/husbands_approach_to_my_arfid_as_a_parent_made_me/",
  "score": 174,
  "num_comments": 6,
  "comments": [
    {
      "id": "j7wif9d",
      "author": "SuccessPutrid7349",
      "body": "This is lovely to hear. I'm in a very similar position with my husband and our 2 year old boy and honestly, I'm improving (slowly) because of them. Congratulations on your pregnancy and I wish you all the happiness in the world with your little family!",
      "created_utc": 1675980751.0,
      "score": 19,
      "context": []
    },
    {
      "id": "j7wpm0c",
      "author": "MyDogsAreRealCute",
      "body": "I don't have ARFID. I am actually here because my daughter has food-related trauma and this has a narrow range of safe foods, and I like to hear other people's experiences so I know what has helped others. Just a disclaimer. \n\nSomething that has helped my family is seeing a dietician and a speechie. I now have a better understanding of why my daughter does what she does, what I can do to help, and how and when we should talk about food and eating. Could something similar work for you? Not in the sense that you'd be going to have them help with your ARFID, but rather to help you and your husband navigate the best ways to approach your child's eating, regardless of what that might look like? \n\nFor example, in our house there are no bad foods. None. There is no restriction of foods as punishment for anything - e.g. if she doesn't eat her veggies she can still have dessert if I choose to offer it with the meal. There are no rules or conversations about how much my daughter must eat. But I am the person who decides when meal times are, and what foods are offered. She partakes as she sees fit, but she joins us at the table when I say it's meal time. If she doesn't want anything, that's fine. That's her decision.\n\nI also have a play kitchen and food market with toy food, and she helps me with a lot of cooking. We try and make food fun, and understandable, and explore it in a range of contexts, states of cooking, and textures. I lose a lot - there's not many times where she will try things. But I'm consistent, and sometimes she finds a new food. We also talk about what food does (eg it gives energy for playing), what it looks like or feels like (oh look, that food is red. What other foods are red?) or other ways we have tried it (oh, do you remember yesterday we tried the blueberries in pancakes? Today, they're in yoghurt!). \n\nThey're not fail-safe, and it's a lot of effort, but that's as far as I've gotten. Maybe some of it will help, or maybe a dietician or speechie could weigh in with better advice - I am certainly no medical specialist. Good luck!",
      "created_utc": 1675983645.0,
      "score": 11,
      "context": []
    },
    {
      "id": "j7xkdwj",
      "author": "Eyreal",
      "body": "I’m so happy for you. I have a partner like this, too.",
      "created_utc": 1675997271.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j7yzpr7",
      "author": "zyllium",
      "body": "I'm going to cry, oh my gosh. I thought this story was going to go a different direction but it's so sweet! You're a lucky momma and he's definitely going to make a great dad. You guys sound like you'll make excellent parents.",
      "created_utc": 1676031950.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j7zh5bb",
      "author": "lekkermuff",
      "body": "I'm not crying. No, not at all. This is beautiful. You're going to both be great parents",
      "created_utc": 1676040589.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j7ya7q8",
      "author": "Here_for_tea_",
      "body": "That’s lovely.\n\nCould you work with a therapist around how best to address your issues, and the best approach so as not to impact your child’s relationship with food?",
      "created_utc": 1676012026.0,
      "score": 2,
      "context": []
    }
  ]
}