{
  "id": "10zkl1c",
  "subreddit": "ARFID",
  "author": "ilja05",
  "created_utc": 1676114047.0,
  "title": "That goddamn AITA post",
  "selftext": "Reddit is at it again. In case you didn't see, there was a post on AmITheAsshole by someone who is picky and eats a lot of eggs instead of eating what their family eats. Wouldn't you know it, people start calling them an asshole and ranting about how much they hate picky eaters. There was even one person pointing out that they probably have an eating disorder and people arguing back that they were still an asshole because their disorder was a \"burden\" on the family. Even more people said they should get a part time job because apparently kids with eating disorders don't deserve to eat unless they make money to feed themselves. I hate people.",
  "url": "https://www.reddit.com/r/ARFID/comments/10zkl1c/that_goddamn_aita_post/",
  "score": 279,
  "num_comments": 43,
  "comments": [
    {
      "id": "j83lscs",
      "author": "None",
      "body": "I literally just read that one! Made me sooo mad! People always acting like we have a choice in this? Like it's sooo easy to just \"eat something else\"? I'd give anything to be able to, just once, not have a breakdown in the middle of food shopping because they don't have what I need",
      "created_utc": 1676114834.0,
      "score": 140,
      "context": []
    },
    {
      "id": "j83mmj7",
      "author": "Lonely-Efforts",
      "body": "I have massive anxiety over eating with friends and family because of how awful people are about being \"picky\". Would be nice if people let me eat or not eat in peace without insulting me.",
      "created_utc": 1676115504.0,
      "score": 96,
      "context": []
    },
    {
      "id": "j83yldd",
      "author": "Repulsive_Ad2795",
      "body": "This is by far my most hated aspect of having ARFID and caused me so much grief when I was younger. People loooove finding socially acceptable ways to condemn anyone that’s a bit weird and with eating habits it’s always open season. They make up all these convoluted justifications (like by how refusing food you’re actually judging them or looking down at them or some other nonsense). The absolute psychodrama of it, I can’t fucking stand it.",
      "created_utc": 1676123302.0,
      "score": 56,
      "context": []
    },
    {
      "id": "j83p4bf",
      "author": "Sturzkampfflugzeug1",
      "body": "That's largely one of the reasons whenever I was invited to dinner with family/friends when I was younger I would decline. It felt like a Catch-22; if I didn't attend, they would say I've/I'm created/creating an atmosphere by not going; if I did attend, I would be criticised for not eating like everyone else \n\nI really wish it were as simple as choosing to not be \"difficult\". I **have** attempted trying new foods and each time it is my own body which - against my will - has physically rejected the foreign substance, despite my effort \n\nEverything's not all black and white, unfortunately",
      "created_utc": 1676117406.0,
      "score": 31,
      "context": []
    },
    {
      "id": "j856t23",
      "author": "Ok_Advertising_878",
      "body": "Anytime is comes to \"I was afraid to eat this food\" they always get called the asshole. Saw one about a girl not wanting to eat pho at her vietnamese boyfriends home. She wasn't even rude. She was literally just scared to try the food. She tried to deny a bowl but the mom kept insisting and everyone was like \"YTA and a bitch too! Pho is amazing\" like I don't doubt it is but I can't do it. I obviously can't diagnose her but can we normalize literally just not wanting to eat certain food???",
      "created_utc": 1676140745.0,
      "score": 23,
      "context": []
    },
    {
      "id": "j849zl5",
      "author": "Mymothersmokes",
      "body": "In today's age of tolerance, acceptance, and inclusiveness its still 100% socially acceptable to treat people as poorly as you want as long as they are a picky eater and you find it strange.",
      "created_utc": 1676127711.0,
      "score": 19,
      "context": []
    },
    {
      "id": "j83zhov",
      "author": "randomthrow773",
      "body": "Do you know the name of the aita post? I wanna read it. Maybe try and comment to defend that person. \n\nPeople shouldn’t judge others for their eating habits. I hate being judged for mine. It seems everywhere you go you’ll find people who just don’t get it and are straight up rude about it. It sucks",
      "created_utc": 1676123769.0,
      "score": 15,
      "context": []
    },
    {
      "id": "j8647lb",
      "author": "snape17",
      "body": "TBH - even if someone is a picky eater and doesn’t have ARFID, I still don’t think they’re an asshole for being a picky eater. 🤷‍♀️",
      "created_utc": 1676155027.0,
      "score": 17,
      "context": []
    },
    {
      "id": "j849yrl",
      "author": "Mymothersmokes",
      "body": "In today's age of tolerance, acceptance, and inclusiveness its still 100% socially acceptable to treat people as poorly as you want as long as they are a picky eater and you find it strange.",
      "created_utc": 1676127705.0,
      "score": 28,
      "context": []
    },
    {
      "id": "j84gmo5",
      "author": "CozmicOwl16",
      "body": "It’s a common perception.  I cooked and bought all my food during high school and my family thought I was just being elitist. Like their food was below me.  Mom’s cooking isn’t GOOD enough for you. \n\nI’ve always been surprised that anyone cares.  Like why. Is my mouth yours?",
      "created_utc": 1676129895.0,
      "score": 13,
      "context": []
    },
    {
      "id": "j84yngj",
      "author": "Akavinceblack",
      "body": "I can’t believe it looks like I’m the only one to bring up ARFID in that post.  Are people really that…unknowing?",
      "created_utc": 1676137429.0,
      "score": 11,
      "context": []
    },
    {
      "id": "j85d84c",
      "author": "PalmTreeAmethyst",
      "body": "People don’t understand that it isn’t just “picky” or being stuck on certain foods, etc.\n\nI know how it looks from the outside and if I hadn’t lived with my daughter for 16 years, I am sure it would be hard for me to believe. But living with someone who can’t eat, picks apart their food, goes hungry, worries about what food will be somewhere…it’s a whole new perspective.\n\nI wouldn’t wish this on anyone but I wish people would have compassion without having to have a loved one with similar issues.",
      "created_utc": 1676143445.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j84hy48",
      "author": "jizzyjazz2",
      "body": "that entire subreddit is made up of individuals who act like cunts consistently and shred whatever remaining conscience they have by attempting to justify their behavior in some roundabout way that involves some intense mental gymnastics.\n\n\nhonestly, if i were you i would just unsubscribe from it if you haven't already done that.",
      "created_utc": 1676130483.0,
      "score": 15,
      "context": []
    },
    {
      "id": "j86ga33",
      "author": "MMTardis",
      "body": "People are terrible about picky eating.  Honestly don't invite someone if your gonna make food a huge deal. \n\nMy son has sensory issues around food, and his teenage friends prefer hanging out at my house, because no one is forced to eat anything they aren't comfortable with. \n\nI keep easy mac and ramen for the noodle kids, cheese and crackers for the non noodle kids, and sandwiches/cereal ate always available, plus a bunch of snacks.",
      "created_utc": 1676160463.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j84wrhm",
      "author": "killayoon",
      "body": "wish i didn’t search for it. i seriously cant stand these people with their invalidating of other people’s experiences.",
      "created_utc": 1676136660.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j85xgtw",
      "author": "SnooFloofs8295",
      "body": "But eggs is so nutritional. one of the best food to have as a safe food.",
      "created_utc": 1676152006.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j85y6hh",
      "author": "SnooFloofs8295",
      "body": "Yeah. This is why I'm not going to use r/aita for anything other than reading and voting, maybe commenting. I don't feel it's safe for neurodivergent people.",
      "created_utc": 1676152323.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j879inw",
      "author": "amh8011",
      "body": "Its so ridiculous how having ARFID or even picky eating is considered being spoiled or entitled. I don’t choose not to eat things because I’m not in the mood or its not my first choice. I can’t eat things I don’t like. My body literally fights it. I struggle to chew and swallow foods I don’t like and then I struggle to keep that food down. Its not like I’d simply prefer something  else, eating that food is actually painful.\n\nY’all get it though. You guys know. Its not a choice I made to want to eat a very specific set of foods. I want to eat more foods. I want to like them. I want to feel safe trying new foods. I want to be able to eat whatever is served. I want to be able to eat a more balanced diet. Its an inconvenience for me. If it was easy to just eat something I 100% would do that.\n\nJust because you don’t experience the same thing as someone else, doesn’t mean their experience is wrong. It is possible for people to experience the world in a way that is very much unlike your own. People don’t seem to understand that their experience is not universal. They are the entitled ones. They are the selfish ones. They can’t imagine someone might perceive things differently than they do so they see everyone’s actions through the lens of their own experience and wonder why it doesn’t make sense.",
      "created_utc": 1676174803.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j87i0bb",
      "author": "aroaceautistic",
      "body": "That post was so upsetting they were saying they should force them to eat or starve them like what the fuck is wrong with you people",
      "created_utc": 1676179681.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j84iytk",
      "author": "Hawk-2021",
      "body": "I’m so glad I haven’t seen that post yet. I’ll probably avoid it now to try and not get so upset.",
      "created_utc": 1676130929.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j86scso",
      "author": "Telphsm4sh",
      "body": "I've seen maybe over 10 posts like that in the last 2ish years from that subreddit. \n\nI've started to use the insult \"bacon bros\" to describe these people. Like have you ever heard someone freak out that you don't like bacon because bacon is literally the best thing ever and it's a gift from god and bacon is objectively perfect and personal preference does not apply to bacon, because everyone has to live bacon, and they couldn't go on living without bacon, and can't possibly understand how anyone could feel differently about bacon because it's so good?!!?\n\nWhen you start thinking about these type of people this way, it makes it clear that the bacon bros are the ones exhibiting middle school childish behavior, not us.",
      "created_utc": 1676166140.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j84wn0w",
      "author": "None",
      "body": "Oh so we all saw and read that one huh? Yeaaahhh I feel you on that. 🤍",
      "created_utc": 1676136612.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j85bfpm",
      "author": "Nate1n22",
      "body": "Who cares what other people think or say",
      "created_utc": 1676142699.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j87l0s7",
      "author": "chemistrybro",
      "body": "at least the top comment is nuanced and more understanding :/",
      "created_utc": 1676181503.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j896mb9",
      "author": "jenny-thatsnotmyname",
      "body": "I haven’t seen that one, but I actually found this sub from a wedding sub where people are constantly shredding posts about guests asking for accommodations in plated meals being served. They’re ruthless over there too. How dare someone ask for their meal without the sauce that’s added at the end of cooking and easily just skipped when plating it when the host is paying $150/pp. Just “grow up and deal with it.” How awful that someone would ask if they can have the kid’s option instead of a plate full of things they won’t touch, thereby wasting that $150 and going hungry.",
      "created_utc": 1676218976.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j8avgxa",
      "author": "any-day-neau",
      "body": "ooooohghhh if i think about this for longer than 20 seconds im gonna get mad im just here to say fck them and we're valid lol",
      "created_utc": 1676244172.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j8zypbo",
      "author": "Alternative_Demand91",
      "body": "This post led me to learn about AFRID.  I have a (13f) who, since she was two has been a \"picky eater.\"  She only drank chocolate milk and ate a small amount of food.  She eats a little more now but avoids certain foods because of texture.  She doesn't like eating in front of anyone.  I am ok with this.  I get alot of crap from family about my \"picky eater.\"  I just tell them that if she doesn't want to eat certain things she doesn't have to. If she wants to eat away from people that is also fine. I have been yelled at because of it. I certainly yell back. I want my child to eat wherever is most comfortable for her.",
      "created_utc": 1676693793.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j87okcm",
      "author": "transferingtoearth",
      "body": "....eggs are so cheap and versatile though? Like even if the person was a the laziest teenager on the planet they or their parents could whip out some eggs and even find nutritional egg recipes for a growing teen??? Eggs are so easy??? Like that's literally one less mouth to even worry about after you figure out the right combo of nutrients for them?",
      "created_utc": 1676183860.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j87qbef",
      "author": "FunnelCakeGoblin",
      "body": "Yeah I argued with someone on there. People were saying that if they just stop buying eggs then the kids would eat something else, and someone else said no. The person I argued with said that if that didn’t eat then they would starve and end up in the hospital and that OP didn’t seem that clueless. I got mad at them for saying that a person who is struggling and that happens is clueless but they weren’t understanding me.",
      "created_utc": 1676185129.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j881ezp",
      "author": "Kathrette",
      "body": "I haven't read it, but that sounds awful. Poor kid.\nWhen I was a child, my FHI (former human incubator) would cook me my preferred foods if I didn't like what she was making for dinner. So she'd eat a dinner that was just for her while making me something else. Not an ounce of effort to get me to try new foods. This is partly why I have the disorder.\n\nAs a result of that, eating around people with whom I'm not 100% comfortable, is a nightmare. It's why I would order from the kids menu as a teen whenever we were at restaurants, because I didn't want to risk having a reaction in public because people would bully me if I did. But they still bullied me for ordering the same shit every time we ate out.\n\nA little empathy really wouldn't kill people. A lot of the time, commenters on AITA posts will rush to defend someone who is being bullied or abused, but I've seen several posts from people dealing with trauma, that have been unfairly dragged in the comments. It's almost like each post exists in a vacuum with completely different crowds reading them. I don't get the hypocrisy of that sub. It honestly blows my mind sometimes. 🫤",
      "created_utc": 1676194084.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j83mv2q",
      "author": "ilja05",
      "body": "Yess thank you! I hate how people were complaining about the cost especially. Just because your kid has a disorder that makes food more expensive doesn't mean you get to complain about having to feed them. I'd like to see people telling them to get a part time job to feed themselves if they had some sort of physical illness that required a special diet.",
      "created_utc": 1676115687.0,
      "score": 46,
      "context": [
        {
          "id": "j83lscs",
          "author": "None",
          "body": "I literally just read that one! Made me sooo mad! People always acting like we have a choice in this? Like it's sooo easy to just \"eat something else\"? I'd give anything to be able to, just once, not have a breakdown in the middle of food shopping because they don't have what I need",
          "created_utc": 1676114834.0
        }
      ]
    },
    {
      "id": "j83mz4e",
      "author": "ilja05",
      "body": "The worst part of ARFID by far is the constant judgement in my opinion. I'd be perfectly fine eating grilled cheese sandwiches for the rest of my life if people would just leave me alone.",
      "created_utc": 1676115776.0,
      "score": 62,
      "context": [
        {
          "id": "j83mmj7",
          "author": "Lonely-Efforts",
          "body": "I have massive anxiety over eating with friends and family because of how awful people are about being \"picky\". Would be nice if people let me eat or not eat in peace without insulting me.",
          "created_utc": 1676115504.0
        }
      ]
    },
    {
      "id": "j84qzr6",
      "author": "None",
      "body": "Same. I'm at the point now of just avoiding social events that are centered around food.",
      "created_utc": 1676134311.0,
      "score": 8,
      "context": [
        {
          "id": "j83mmj7",
          "author": "Lonely-Efforts",
          "body": "I have massive anxiety over eating with friends and family because of how awful people are about being \"picky\". Would be nice if people let me eat or not eat in peace without insulting me.",
          "created_utc": 1676115504.0
        }
      ]
    },
    {
      "id": "j85xsfy",
      "author": "SnooFloofs8295",
      "body": "You're doing well trying. Good job. /gen",
      "created_utc": 1676152150.0,
      "score": 8,
      "context": [
        {
          "id": "j83p4bf",
          "author": "Sturzkampfflugzeug1",
          "body": "That's largely one of the reasons whenever I was invited to dinner with family/friends when I was younger I would decline. It felt like a Catch-22; if I didn't attend, they would say I've/I'm created/creating an atmosphere by not going; if I did attend, I would be criticised for not eating like everyone else \n\nI really wish it were as simple as choosing to not be \"difficult\". I **have** attempted trying new foods and each time it is my own body which - against my will - has physically rejected the foreign substance, despite my effort \n\nEverything's not all black and white, unfortunately",
          "created_utc": 1676117406.0
        }
      ]
    },
    {
      "id": "j84wy85",
      "author": "killayoon",
      "body": "the title is ‘am i the asshole for refusing to eat my mom’s food?’",
      "created_utc": 1676136736.0,
      "score": 7,
      "context": [
        {
          "id": "j83zhov",
          "author": "randomthrow773",
          "body": "Do you know the name of the aita post? I wanna read it. Maybe try and comment to defend that person. \n\nPeople shouldn’t judge others for their eating habits. I hate being judged for mine. It seems everywhere you go you’ll find people who just don’t get it and are straight up rude about it. It sucks",
          "created_utc": 1676123769.0
        }
      ]
    },
    {
      "id": "j84s4cy",
      "author": "None",
      "body": "I love that sub's relationship advice in particular. Married couple of 15 years has one bad fight? DIVORCE!!! HE'S GASLIGHTING YOU!! \n\nMost of the stories posted there are fake anyway, yet people still believe it and then behave like complete jackasses in the comments.",
      "created_utc": 1676134775.0,
      "score": 10,
      "context": [
        {
          "id": "j84hy48",
          "author": "jizzyjazz2",
          "body": "that entire subreddit is made up of individuals who act like cunts consistently and shred whatever remaining conscience they have by attempting to justify their behavior in some roundabout way that involves some intense mental gymnastics.\n\n\nhonestly, if i were you i would just unsubscribe from it if you haven't already done that.",
          "created_utc": 1676130483.0
        }
      ]
    },
    {
      "id": "j858as6",
      "author": "linx14",
      "body": "Honestly the day I unsubscribed from subs like that my mental health went up slightly. It’s actually wild how indulgence of content like that actually messes with your brain to be more negative.",
      "created_utc": 1676141376.0,
      "score": 3,
      "context": [
        {
          "id": "j84hy48",
          "author": "jizzyjazz2",
          "body": "that entire subreddit is made up of individuals who act like cunts consistently and shred whatever remaining conscience they have by attempting to justify their behavior in some roundabout way that involves some intense mental gymnastics.\n\n\nhonestly, if i were you i would just unsubscribe from it if you haven't already done that.",
          "created_utc": 1676130483.0
        }
      ]
    },
    {
      "id": "j86telz",
      "author": "lindseyjuneee",
      "body": "i saw some of your comments there, and I agree! it’s so exhausting!!",
      "created_utc": 1676166652.0,
      "score": 1,
      "context": [
        {
          "id": "j84wrhm",
          "author": "killayoon",
          "body": "wish i didn’t search for it. i seriously cant stand these people with their invalidating of other people’s experiences.",
          "created_utc": 1676136660.0
        }
      ]
    },
    {
      "id": "j8ab85g",
      "author": "ilja05",
      "body": "Yes exactly! Sometimes I try to explain to people by comparing it to eating bugs. There are lots of bugs that are perfectly eadible but most (western) people would still have significant trouble eating them. Then imagine being called rude and entitled for that. Just eat your crickets and stop acting like a spoiled baby!",
      "created_utc": 1676235469.0,
      "score": 3,
      "context": [
        {
          "id": "j879inw",
          "author": "amh8011",
          "body": "Its so ridiculous how having ARFID or even picky eating is considered being spoiled or entitled. I don’t choose not to eat things because I’m not in the mood or its not my first choice. I can’t eat things I don’t like. My body literally fights it. I struggle to chew and swallow foods I don’t like and then I struggle to keep that food down. Its not like I’d simply prefer something  else, eating that food is actually painful.\n\nY’all get it though. You guys know. Its not a choice I made to want to eat a very specific set of foods. I want to eat more foods. I want to like them. I want to feel safe trying new foods. I want to be able to eat whatever is served. I want to be able to eat a more balanced diet. Its an inconvenience for me. If it was easy to just eat something I 100% would do that.\n\nJust because you don’t experience the same thing as someone else, doesn’t mean their experience is wrong. It is possible for people to experience the world in a way that is very much unlike your own. People don’t seem to understand that their experience is not universal. They are the entitled ones. They are the selfish ones. They can’t imagine someone might perceive things differently than they do so they see everyone’s actions through the lens of their own experience and wonder why it doesn’t make sense.",
          "created_utc": 1676174803.0
        }
      ]
    },
    {
      "id": "j87qhxy",
      "author": "FunnelCakeGoblin",
      "body": "Not really cheap right now, unfortunately. That’s what the part was about. The kid’s mom didn’t want him eating eggs all the time because the prices went up and it was getting expensive. The parole on that sub were still AH though. It made me very sad to see.",
      "created_utc": 1676185267.0,
      "score": 2,
      "context": [
        {
          "id": "j87okcm",
          "author": "transferingtoearth",
          "body": "....eggs are so cheap and versatile though? Like even if the person was a the laziest teenager on the planet they or their parents could whip out some eggs and even find nutritional egg recipes for a growing teen??? Eggs are so easy??? Like that's literally one less mouth to even worry about after you figure out the right combo of nutrients for them?",
          "created_utc": 1676183860.0
        }
      ]
    },
    {
      "id": "j83n8dy",
      "author": "None",
      "body": "I have a kid with sensory issues, I'm starting to suspect ARFID too as he gets older, and he only eats the same things for breakfast/lunch and only has four different meals for dinner. Has to be specific brands, which means bouncing between 3/4 different shops. I've never complained once, neither has his dad. My childhood wasn't great with an eating disorder, but most of my family at least tried to be accommodating. I don't see why it's so hard for people to understand",
      "created_utc": 1676115967.0,
      "score": 32,
      "context": [
        {
          "id": "j83lscs",
          "author": "None",
          "body": "I literally just read that one! Made me sooo mad! People always acting like we have a choice in this? Like it's sooo easy to just \"eat something else\"? I'd give anything to be able to, just once, not have a breakdown in the middle of food shopping because they don't have what I need",
          "created_utc": 1676114834.0
        },
        {
          "id": "j83mv2q",
          "author": "ilja05",
          "body": "Yess thank you! I hate how people were complaining about the cost especially. Just because your kid has a disorder that makes food more expensive doesn't mean you get to complain about having to feed them. I'd like to see people telling them to get a part time job to feed themselves if they had some sort of physical illness that required a special diet.",
          "created_utc": 1676115687.0
        }
      ]
    },
    {
      "id": "j83npjc",
      "author": "Lonely-Efforts",
      "body": "Yes, I also couldn't care less, really. When there's nothing my brain considers edible I'm really fine with not eating. But the judgement hurts so much.",
      "created_utc": 1676116335.0,
      "score": 24,
      "context": [
        {
          "id": "j83mmj7",
          "author": "Lonely-Efforts",
          "body": "I have massive anxiety over eating with friends and family because of how awful people are about being \"picky\". Would be nice if people let me eat or not eat in peace without insulting me.",
          "created_utc": 1676115504.0
        },
        {
          "id": "j83mz4e",
          "author": "ilja05",
          "body": "The worst part of ARFID by far is the constant judgement in my opinion. I'd be perfectly fine eating grilled cheese sandwiches for the rest of my life if people would just leave me alone.",
          "created_utc": 1676115776.0
        }
      ]
    },
    {
      "id": "j83z1pz",
      "author": "Repulsive_Ad2795",
      "body": "You have no idea how hard I relate to this comment and completely agree with it! (well, except for the fact cheese is one of my super unsafe foods and even typing the word out makes me physically recoil a bit)",
      "created_utc": 1676123542.0,
      "score": 14,
      "context": [
        {
          "id": "j83mmj7",
          "author": "Lonely-Efforts",
          "body": "I have massive anxiety over eating with friends and family because of how awful people are about being \"picky\". Would be nice if people let me eat or not eat in peace without insulting me.",
          "created_utc": 1676115504.0
        },
        {
          "id": "j83mz4e",
          "author": "ilja05",
          "body": "The worst part of ARFID by far is the constant judgement in my opinion. I'd be perfectly fine eating grilled cheese sandwiches for the rest of my life if people would just leave me alone.",
          "created_utc": 1676115776.0
        }
      ]
    },
    {
      "id": "j87i3ly",
      "author": "aroaceautistic",
      "body": "I feel so shitty all the time for not being able to eat what everyone else is eating. And the infantilization is agonizing because I’m also autistic and trans so of course i get that shut non fucking stop",
      "created_utc": 1676179741.0,
      "score": 6,
      "context": [
        {
          "id": "j83mmj7",
          "author": "Lonely-Efforts",
          "body": "I have massive anxiety over eating with friends and family because of how awful people are about being \"picky\". Would be nice if people let me eat or not eat in peace without insulting me.",
          "created_utc": 1676115504.0
        },
        {
          "id": "j83mz4e",
          "author": "ilja05",
          "body": "The worst part of ARFID by far is the constant judgement in my opinion. I'd be perfectly fine eating grilled cheese sandwiches for the rest of my life if people would just leave me alone.",
          "created_utc": 1676115776.0
        }
      ]
    },
    {
      "id": "j85ypvn",
      "author": "randomthrow773",
      "body": "Thanks",
      "created_utc": 1676152556.0,
      "score": 3,
      "context": [
        {
          "id": "j83zhov",
          "author": "randomthrow773",
          "body": "Do you know the name of the aita post? I wanna read it. Maybe try and comment to defend that person. \n\nPeople shouldn’t judge others for their eating habits. I hate being judged for mine. It seems everywhere you go you’ll find people who just don’t get it and are straight up rude about it. It sucks",
          "created_utc": 1676123769.0
        },
        {
          "id": "j84wy85",
          "author": "killayoon",
          "body": "the title is ‘am i the asshole for refusing to eat my mom’s food?’",
          "created_utc": 1676136736.0
        }
      ]
    }
  ]
}