{
  "id": "110wypd",
  "subreddit": "ARFID",
  "author": "TheHoveringEye",
  "created_utc": 1676254975.0,
  "title": "Relationships with ARFID",
  "selftext": "Growing up my family would always ask me what I’m gonna do when I get into a relationship and the person wants to take me out to dinner. I was always like, “if they can’t accept me for who I am I shouldn’t be with them.” Which is still true. But in the same breath…it’s so embarrassing the older I get. Ordering off the kids menu or not ordering anything. I got asked on a date to get spaghetti and, I love spaghetti. But with no sauce, just butter and cheese. I feel ridiculous and have anxiety about it and don’t know what to say to him. I briefly explained my picky eating before but haven’t really gotten into it. I realize this is a turn off or even deal breaker for a lot of people, so I’m nervous about rejection I guess.",
  "url": "https://www.reddit.com/r/ARFID/comments/110wypd/relationships_with_arfid/",
  "score": 84,
  "num_comments": 18,
  "comments": [
    {
      "id": "j8c0pdn",
      "author": "chunkeymunkeyandrunt",
      "body": "Very real!! It is so hard to figure out how to broach this topic. I find being upfront is the best even though it’s not easy. It is not easy to be so vulnerable so early on. \n\nUnlike other traumas/disorders/etc that some people can take time to divulge, food is not one you can hide for long. I’m married now, but when I was dating it was such a challenge to figure out how to explain it in a way anyone could understand. \n\n\nBut ultimately I have found using the language of ‘eating disorder’ seems to make people actually listen and take it seriously. As soon as you say ‘picky eater’ they tune out everything else and bring in their assumptions and judgements. I mostly stick to the phrase ‘I have an eating disorder that makes eating a variety of foods a challenge. I’m happy to meet you for food, but I’d be most comfortable going to [x restaurant] as I know their menu well. Thank you for being flexible!’ \n\nNo apologies. No justifications. Just a statement and moving forward.",
      "created_utc": 1676262420.0,
      "score": 42,
      "context": []
    },
    {
      "id": "j8c2ret",
      "author": "Rigga-Goo-Goo",
      "body": "Honestly, there was only one time where I thought, \"Hmm... this might not be a good match,\" because they were/are a major foodie (we never fully dated but we're still friends). \n\nI dated plenty of other guys who weren't into culinary arts, but they liked their food, and it was never an issue. With my first serious relationship, years later when we met up he completely forgot how picky of an eater I was. It simply was never an issue.\n\nThe person I ended up marrying - his dad is a vegetarian, several people in his extended family are vegan, they're all pretty health conscious, but he personally never cared about food. He grew up in a home with a socially acceptable version of \"picky eater\" (meaning his dad). They still need to make sure the restaurants will have something he'll eat, etc. We honestly cater more around him and the other family members than we ever have with me and ARFID.\n\nBeing a little picky whether it's a health issue (celiacs, arfid, allergies, whatever) or because it's a choice (vegan, vegetarian, pescetarian, etc) *really* isn't a big issue once you branch out into the world more. It's only as big of a deal as *you* make it, and if someone else has a problem with it, that's *their* problem. \n\nIf I were you and you're not comfortable laughing it off as just being picky, I'd say open up that you have a health condition that limits your diet. Because.... you do. You're not lying by saying that. You can be clear communicating that you're fine health-wise, but you just have to be careful with what you eat. You can compare it to celiacs (imply you get sick easily from certain foods [I know I personally get nauseated and sick feeling if I have to eat something I can't]).\n\nIt still might be a deal breaker for them... but like.... I also dated a guy who said one of his deal breakers was a girl who didn't like roller coasters. They were a passion that he wanted to share with someone. Everyone has stuff like that, you're never going to avoid it. I definitely think there are things you can compromise on and bottom-lines that you just can't - for some people that's food... for others it's roller coasters. My personal experience has taught me that most people really DGAF.",
      "created_utc": 1676263530.0,
      "score": 21,
      "context": []
    },
    {
      "id": "j8c4dlj",
      "author": "Internal-Review-6618",
      "body": "I feel this 110%. I used to get asked that same question and it always embarrassed me to no end. \n\nMy deal is, the older I got rhe less I cared what other people thought about everything. I basically just started to responding to comments about my food with \"would you prefer I don't eat at all?\" which actually shut it down. Now that I found my circle of people they never question it or judge me for it.\n\nThat being said, food is still an incrediblly anxiety inducing topic. Feeling judged and being scared of rejection for it is completely vaild. This is so much easier said than done but it helps to get into the habit of outright telling people that you're \"really picky\" (define this based on your relationship with that person obviously) right off the bat when restaurants and whatnot are mentioned. It alleviateds some of that anxiety by getting it out of the way before it has the potential to become a problem.",
      "created_utc": 1676264439.0,
      "score": 13,
      "context": []
    },
    {
      "id": "j8ctwwb",
      "author": "Depraysie",
      "body": "I feel you so bad! My ex and his entire family were so mean to me when they found out about my ARFID. They were huge foodies and could eat mud if they were hungry enough. They would constantly invite me to restaurants I couldn’t eat anything at, due to both my ARFID and allergies, just to bully me, gang up on me, laugh at me and be generally nasty. It wasn’t a money issue either, because they went to restaurants they perfectly knew I could eat at and they didn’t call me, they only did it when they knew I couldn’t eat anything. Like why is your great aunt so offended she feels the need to insult me because I can’t eat onions? lmfao\n\nJust letting you know, the right person will love you no matter what conditions or disorders you have, they’ll love you because you’re you. Don’t settle for less and don’t tolerate any bullshit from anybody who refuses to understand it’s something you can’t really control. You’re not ridiculous. If somebody rejects you over your eating habits, maybe they’re the problem. If you like someone you won’t care whether they eat certain foods or not.",
      "created_utc": 1676284376.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j8cmbwf",
      "author": "astramell",
      "body": "Unfortunately, my arfid has caused issues in my relationship. My partner is a foodie who loves to cook and finds my eating habits frustrating. But with patience I have been trying more types of food. I still have my boundaries with certain foods, but over the last 2 years of living together it has gotten better. Its not impossible, but it is a challenge.",
      "created_utc": 1676277645.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j8bsuq0",
      "author": "blastedflames",
      "body": "i don’t have anything i can really say or add but this is so real",
      "created_utc": 1676258681.0,
      "score": 13,
      "context": []
    },
    {
      "id": "j8cmmk0",
      "author": "None",
      "body": "I don't worry too much about going out to eat, but what's hard is someone cooking for me. My partner does all the cooking in our relationship, because I work twice as many hours as him, and I know I'm a very stressful person to cook for. I'm not as restricted as some people in my food choices, but if anything about the meal is slightly off, I feel sick and can't eat it. It makes me feel really guilty when my partner makes a meal for me that I can't bring myself to eat.",
      "created_utc": 1676277905.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j8e50y3",
      "author": "skorletun",
      "body": "I'm here because my partner has arfid and I like just about every food on the planet.\n\nSome things we've implemented:\n\n- Separate food storage for both of us. Him for his safe foods, me in case I want to also eat a food that is considered safe.\n\n- We eat the same dinner maybe 3x a week. I get tired of eating the same stuff every day so the other days we each cook for ourselves.\n\n- When we do eat together, he cooks. That's by his choice btw, that way he has full control over what goes into the food. Sometimes I help, but he prefers doing it alone.\n\nGood luck!",
      "created_utc": 1676308899.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j8gjoci",
      "author": "SachiKaM",
      "body": "Ok so you are absolutely correct about “if they accept me”. However it takes communication. 2/3 serious relationships I’ve been in got this concept. One got angry over and over. Look, regardless of their animosity, you still have ARFID. My current partner understands I only WANT to eat pizza. He doesn’t and has never held this against me. I still enjoy going out to eat. Sometimes I don’t order but most of the time I’ll try something off the menu and take a couple bites and get a Togo box. He will finish the meal later and I’ll have pizza lol. There is no guilt, embarrassment, awkwardness. In return I’ve expanded my preferences tremendously. \n\nThe guy who didn’t.. well I no longer feel the obligation to explain to him what “happened” to us. I’ll never again try to fit a character I was not constructed to play. It is a long miserable road for all parties included.",
      "created_utc": 1676345110.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j8e9cfn",
      "author": "None",
      "body": "I have EDNOS and Sensory issues with food, and in a relationship, the food thing would not happen (you would not take someone an alcoholic to a pub).\n\nResturants sometimes will be kind enough to do these requests. I would wonder if you are talking the same thing I would do, without butter (just put cheese on pasta) it is confusing and my mom could not deal with it, workers have brought me drinks with fruit on it, and I have had my mother tell them about my ASD and they would bring one back without it. Maybe it would be nicer to set dates at home, but gagging from not liking something on the first date (I would not choose a restaurant for your first date) than in your own house, where there is just you and your date will test if this is also someone who can deal with your ARFID. If they walk out, find someone else.",
      "created_utc": 1676310633.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j8efani",
      "author": "MrPureinstinct",
      "body": "I can understand the fear of rejection, we all have that based off both ARFID and just really in general. Being rejected sucks.   \n\n\nBut I will say, you have the right idea that if someone can't accept you they aren't the person for you. My wife LOVES food. Trying new things, eating a lot of places that I can't, and just in general sees food entirely different than I do.   \n\n\nWe've found a balance and compromise that most nights we eat something that is approachable to both of us, but if she's craving something I won't like we both go get our own thing and just eat together on the couch watching TV. We both get to eat food we can eat and still get to spend time together.   \n\n\nFor us the meal is more about being together than it is the food.   \n\n\nOutside of that I even have friends who are kind enough to either make something that will include me or just understand I will likely eat something before I come to the party then just have a few small snacks if they're available.   \n\n\nI'm 30 years old, I'm married, and a lot of my friends have been friends for years so I'm sure all of those factors contribute a lot to me being less embarrassed at this point. All of these people choose to be in my life still even though this is something I struggle with, the same way I choose to be in their lives even though they have their own struggles. We all have our own differences, struggles, and hurdles. For us on this sub, it just happens to be food.   \n\n\nI won't lie, it may suck for awhile but you'll find the right person/people for your life. I promise.",
      "created_utc": 1676312997.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j8g0orz",
      "author": "cthulhukiss",
      "body": "I am married living with ARFID, my husband does not have it.  Plenty of potential partners judged me for it, which hurt of course, but my husband is the sweetest and I've been able to make a lot of progress since I met him. It goes the same for romantic partners and friends, if someone is going to judge me for an eating disorder I've struggled all my life with, they probably wouldn't be a good friend for many reasons. Just because it isn't as widely recognized doesn't mean it isn't just as legitimate and devastating as anorexia or any other eating disorder. \n\nStraight up, no one should judge you for it and if they do they're an asshole. There are kind understanding people out there who will listen. Hope this helps, I previously felt very ashamed and afraid of telling anyone, so I can empathize.",
      "created_utc": 1676336289.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j8es462",
      "author": "nomoreadminspls",
      "body": "We are the same.",
      "created_utc": 1676318001.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j8exd7y",
      "author": "estielouise",
      "body": "I got really lucky and my partner’s sister also has ARFID! They were really familiar with it to begin with and so, so accepting. I say this because the right person will understand and you won’t have to hide. Sending love!",
      "created_utc": 1676320045.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kur2dsh",
      "author": "Badluckstream",
      "body": "As someone with Arfid this is a deal maker for me. Maybe finding someone with the same “strain” (best thing I could think of) of arfid. Also I fucking love buttered spaghetti with cheese",
      "created_utc": 1710370482.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j9seixk",
      "author": "TheHoveringEye",
      "body": "Update. His longtime best friend is a very picky eater and he was very understanding. Made me spaghetti with just butter and cheese :,~)",
      "created_utc": 1677216698.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j8etkfy",
      "author": "nomoreadminspls",
      "body": "Exactly this. Those who matter don't care and those who care don't matter.",
      "created_utc": 1676318567.0,
      "score": 6,
      "context": [
        {
          "id": "j8c2ret",
          "author": "Rigga-Goo-Goo",
          "body": "Honestly, there was only one time where I thought, \"Hmm... this might not be a good match,\" because they were/are a major foodie (we never fully dated but we're still friends). \n\nI dated plenty of other guys who weren't into culinary arts, but they liked their food, and it was never an issue. With my first serious relationship, years later when we met up he completely forgot how picky of an eater I was. It simply was never an issue.\n\nThe person I ended up marrying - his dad is a vegetarian, several people in his extended family are vegan, they're all pretty health conscious, but he personally never cared about food. He grew up in a home with a socially acceptable version of \"picky eater\" (meaning his dad). They still need to make sure the restaurants will have something he'll eat, etc. We honestly cater more around him and the other family members than we ever have with me and ARFID.\n\nBeing a little picky whether it's a health issue (celiacs, arfid, allergies, whatever) or because it's a choice (vegan, vegetarian, pescetarian, etc) *really* isn't a big issue once you branch out into the world more. It's only as big of a deal as *you* make it, and if someone else has a problem with it, that's *their* problem. \n\nIf I were you and you're not comfortable laughing it off as just being picky, I'd say open up that you have a health condition that limits your diet. Because.... you do. You're not lying by saying that. You can be clear communicating that you're fine health-wise, but you just have to be careful with what you eat. You can compare it to celiacs (imply you get sick easily from certain foods [I know I personally get nauseated and sick feeling if I have to eat something I can't]).\n\nIt still might be a deal breaker for them... but like.... I also dated a guy who said one of his deal breakers was a girl who didn't like roller coasters. They were a passion that he wanted to share with someone. Everyone has stuff like that, you're never going to avoid it. I definitely think there are things you can compromise on and bottom-lines that you just can't - for some people that's food... for others it's roller coasters. My personal experience has taught me that most people really DGAF.",
          "created_utc": 1676263530.0
        }
      ]
    },
    {
      "id": "j8gnxw9",
      "author": "None",
      "body": "Roller coasters LMAO 🤣\n\nThank you for the reassuring post. I have a mild case of ARFID and recently found out I had celiac disease which makes everything so much harder.",
      "created_utc": 1676347231.0,
      "score": 1,
      "context": [
        {
          "id": "j8c2ret",
          "author": "Rigga-Goo-Goo",
          "body": "Honestly, there was only one time where I thought, \"Hmm... this might not be a good match,\" because they were/are a major foodie (we never fully dated but we're still friends). \n\nI dated plenty of other guys who weren't into culinary arts, but they liked their food, and it was never an issue. With my first serious relationship, years later when we met up he completely forgot how picky of an eater I was. It simply was never an issue.\n\nThe person I ended up marrying - his dad is a vegetarian, several people in his extended family are vegan, they're all pretty health conscious, but he personally never cared about food. He grew up in a home with a socially acceptable version of \"picky eater\" (meaning his dad). They still need to make sure the restaurants will have something he'll eat, etc. We honestly cater more around him and the other family members than we ever have with me and ARFID.\n\nBeing a little picky whether it's a health issue (celiacs, arfid, allergies, whatever) or because it's a choice (vegan, vegetarian, pescetarian, etc) *really* isn't a big issue once you branch out into the world more. It's only as big of a deal as *you* make it, and if someone else has a problem with it, that's *their* problem. \n\nIf I were you and you're not comfortable laughing it off as just being picky, I'd say open up that you have a health condition that limits your diet. Because.... you do. You're not lying by saying that. You can be clear communicating that you're fine health-wise, but you just have to be careful with what you eat. You can compare it to celiacs (imply you get sick easily from certain foods [I know I personally get nauseated and sick feeling if I have to eat something I can't]).\n\nIt still might be a deal breaker for them... but like.... I also dated a guy who said one of his deal breakers was a girl who didn't like roller coasters. They were a passion that he wanted to share with someone. Everyone has stuff like that, you're never going to avoid it. I definitely think there are things you can compromise on and bottom-lines that you just can't - for some people that's food... for others it's roller coasters. My personal experience has taught me that most people really DGAF.",
          "created_utc": 1676263530.0
        }
      ]
    }
  ]
}