{
  "id": "11bmdtm",
  "subreddit": "ARFID",
  "author": "Arfid_Account1",
  "created_utc": 1677335626.0,
  "title": "Socialization is a nightmare because of ARFID",
  "selftext": "My ARFID is pretty hard. My safe foods don't exist in any kind of restaurant, bar, or anything else, and it's making socialization sometimes impossible. Dating? No food can be involved. Making friends? Same. Workplace events? Can't eat anything. Family gatherings? Please kill me already, as they know and they'll be like \"Oh, you still only eat that while you're 27?\" Well yeah, indeed, and fuck you. I wish I wasn't blamed and I wish it were easier.\n\nRight now I'm fighting myself to go out, to jump out of my comfort zone. I'm a lesbian and wanted to go to the only lesbian bar in my city, because usually drinking is fine (except for most cocktails). They only serve food and cocktails. Like... really? I had gathered the courage, fought my inner fears, to go alone because I don't have friends at the moment, to meet people, to have fun, but I can't. I can't because I can't eat anything, and I can't be sure I'll like the cocktails beforehand. Fuck, fuck, fuck.",
  "url": "https://www.reddit.com/r/ARFID/comments/11bmdtm/socialization_is_a_nightmare_because_of_arfid/",
  "score": 86,
  "num_comments": 20,
  "comments": [
    {
      "id": "j9ywxp1",
      "author": "MagillaGuerillotine",
      "body": "You are a person, like everyone else. You are worthy of respect. There is not anything wrong with you just because you are different, everybody is different. You are allowed to be sad, angry, anxious, scared. The best advice I’ve been given for social situations is this “Accept yourself, and you will see that others do too” I know that is not something that is easy, and it’s okay if it’s hard. It is an idea to work toward, not a goal to reach, and even working toward it is success. \n\nP.S. I have found that I get less questions and suggestions if I tell people that I’m “Working on some sensory issues.” Which really is the truth.",
      "created_utc": 1677341915.0,
      "score": 19,
      "context": []
    },
    {
      "id": "j9ytne8",
      "author": "Queenofwands1212",
      "body": "I’m in the same exact situation. No restaurant will serve my safe foods. Maybe Starbucks or a coffee place but no one finds that to be an actual social outing. I don’t drink anymore so there’s that. Going to a bar sounds like a nightmare for me and would trigger my ptsd. So I’m just stuck going to the grocery store and hoping I meet someone there",
      "created_utc": 1677340547.0,
      "score": 12,
      "context": []
    },
    {
      "id": "j9yob1e",
      "author": "katkatsmack",
      "body": "I feel the same",
      "created_utc": 1677338306.0,
      "score": 11,
      "context": []
    },
    {
      "id": "j9zloa2",
      "author": "None",
      "body": "I’m on an all liquid diet. I can only eat my nutritional shakes, chicken broth, and any other liquids. I can’t have solid foods. Yes at 28, I can’t eat solid foods. I don’t have any friends and I refuse to go in public to eat, because of this. Fml.",
      "created_utc": 1677351668.0,
      "score": 11,
      "context": []
    },
    {
      "id": "j9zeslu",
      "author": "Nervous-Worry6092",
      "body": "Same. Don’t like pho or korean bbq? Goodbye, don’t wanna hear from you. It sucks, forever alone.",
      "created_utc": 1677348973.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ja1kmbn",
      "author": "K0rra_22",
      "body": "Understandable. I’ve found that most friends are pretty understanding, especially when I explain what it’s like. \n\nBut romantic relationships are as foreign and scary as most food to me so 🤷‍♀️ \n\nI like my girls like I like my smoothies. I think I’d like them but am terrified to try",
      "created_utc": 1677383294.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ja0xl47",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1677372143.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ja1g8st",
      "author": "Calm-Syllabub4519",
      "body": "I swear family is the worst about it. Like… I will still be ordering chicken nuggets or a plain quesadilla or whatever when you’re on your death bed, mother. Get the fuck used to it. \n\nI’m really sorry you’re feeling that way though :( I might suggest calling a place (or having another person do it if you get call anxiety like I do) and asking if they’ll allow outside food/drinks due to dietary restrictions but the desire to socialize. No need to tell them the details or about ARFID, but most places understand if somebody has to come to a restaurant with their own food because of dietary needs!",
      "created_utc": 1677381075.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ja1nks8",
      "author": "GentleObsession",
      "body": "I feel for you. Both my last boss and my current boss are huge into food and so they make every event center around food and it's hell for me. Even potlucks are a huge no go as I do not like communal food (who knows how hygienic people are in their own homes 🤷). And don't get me started on dating. I'm pretty afraid of trying to meet a romantic partner online because of having to explain the whole fact that I don't eat much and what I do eat is just not that healthy but it's hard to meet anyone naturally in real life especially when you're gay so I feel like apps are my only chance.",
      "created_utc": 1677384838.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ja2sd7f",
      "author": "Cahyroo",
      "body": "My go to is inviting people to have coffee or tea, in my country this is done very often so it works. And for me if I explain my ARFID in a memey way which makes them feel comfortable laughing about it with me, they tend to be more accomodating in general. I make vampire jokes a lot, say I feed off of the blood of my enemies and whatnot. Labels me as quirky, which is preferable to annoying.",
      "created_utc": 1677414459.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ja32e6y",
      "author": "None",
      "body": "LOTS of people go to bars but do not drink alcohol.  It is not as unusual as you may think. \n\nOne of my favorite ways of handling things when the waitress is taking everyone’s drink orders is to say ‘I am not sure right now, so just a water for the moment.’  Everyone thinks I will be drinking soon enough, and no one notices that I never get a drink.",
      "created_utc": 1677420387.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ja1jhr2",
      "author": "NorthStarMidnightSky",
      "body": "I've learned to be okay with hunger (or eat before going), but I'm with you. I hate the awkwardness and making excuses when I'm asked why I'm not eating.\n\nI also cannot stand alcohol, so I'm a real buzz kill at social events,  especially for work.",
      "created_utc": 1677382715.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ja2ezk1",
      "author": "carolinadawnn",
      "body": "At events with people I probably won't ever see again, my go-to excuse is: the reason I'm not eating is because I'm having a minor surgery in the morning/later that day/whatever, and I'm not supposed to eat anything. Surgery for what? Oh, it's personal. Shameless lie but it gets them off your back 😅\nIn all seriousness, I keep trying to remind myself (with varying success) that you will usually think you're weird way more than other people do. My whole family is used to it by now and it's not even something to point out anymore. I've told coworkers etc \"Oh I'm just really picky, nothing here appeals to me much, I'll have a snack when I get home\" and they pretty much just shrug it off. It's scarier with dating because so much of it revolves around food. I'm a lesbian too, it's hard enough to meet women in the first place. I've only ever dated people I was friends with so they already knew the situation. I've downloaded dating apps but I dread explaining myself over and over. But another thing I remind myself is, someone who would be judgmental about this is not a person I want to date anyway.",
      "created_utc": 1677403998.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jabh2q4",
      "author": "fatbitchonline",
      "body": "i don’t have this much of a problem anymore because my bf and friends are super understanding, and my family is after years of judgement, but omg when i was younger i would be so anxious to hang out with anybody, meet family, go to new restaurants, etc. like it was the first thing i’d think of when i’d get invited somewhere or was told we were going out to eat",
      "created_utc": 1677563078.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j9zv9g8",
      "author": "Arfid_Account1",
      "body": "Well thank you. It is something I am working on. I have sucesffully overcome some other aspects of my life I thought were \"too different to be acceptable\" but ARFID is a big one that I still struggle with. I appreciate your kind words and your advice.",
      "created_utc": 1677355538.0,
      "score": 11,
      "context": [
        {
          "id": "j9ywxp1",
          "author": "MagillaGuerillotine",
          "body": "You are a person, like everyone else. You are worthy of respect. There is not anything wrong with you just because you are different, everybody is different. You are allowed to be sad, angry, anxious, scared. The best advice I’ve been given for social situations is this “Accept yourself, and you will see that others do too” I know that is not something that is easy, and it’s okay if it’s hard. It is an idea to work toward, not a goal to reach, and even working toward it is success. \n\nP.S. I have found that I get less questions and suggestions if I tell people that I’m “Working on some sensory issues.” Which really is the truth.",
          "created_utc": 1677341915.0
        }
      ]
    },
    {
      "id": "j9yxiim",
      "author": "lekkermuff",
      "body": "Get involved in hobbies! They're the best way to meet new people while focusing on the hobby not food.",
      "created_utc": 1677342150.0,
      "score": 7,
      "context": [
        {
          "id": "j9ytne8",
          "author": "Queenofwands1212",
          "body": "I’m in the same exact situation. No restaurant will serve my safe foods. Maybe Starbucks or a coffee place but no one finds that to be an actual social outing. I don’t drink anymore so there’s that. Going to a bar sounds like a nightmare for me and would trigger my ptsd. So I’m just stuck going to the grocery store and hoping I meet someone there",
          "created_utc": 1677340547.0
        }
      ]
    },
    {
      "id": "ja3wcr0",
      "author": "Arfid_Account1",
      "body": "Oh that last sentence spoke directly to my heart lol",
      "created_utc": 1677432953.0,
      "score": 2,
      "context": [
        {
          "id": "ja1kmbn",
          "author": "K0rra_22",
          "body": "Understandable. I’ve found that most friends are pretty understanding, especially when I explain what it’s like. \n\nBut romantic relationships are as foreign and scary as most food to me so 🤷‍♀️ \n\nI like my girls like I like my smoothies. I think I’d like them but am terrified to try",
          "created_utc": 1677383294.0
        }
      ]
    },
    {
      "id": "ja1mjxj",
      "author": "GentleObsession",
      "body": "I feel you. I don't really enjoy alcohol and I don't like caffeinated drinks or tea either so even getting together for coffee doesn't work for me. Having arfid (especially to my degree) is tough.",
      "created_utc": 1677384301.0,
      "score": 6,
      "context": [
        {
          "id": "ja0xl47",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1677372143.0
        }
      ]
    },
    {
      "id": "ja3w3fv",
      "author": "Arfid_Account1",
      "body": "Now that is a smart strategy! The point is I'm going alone, because right now I don't exactly have friends to hang out with... so it wouldn't really work. But I'll keep it in mind",
      "created_utc": 1677432853.0,
      "score": 2,
      "context": [
        {
          "id": "ja32e6y",
          "author": "None",
          "body": "LOTS of people go to bars but do not drink alcohol.  It is not as unusual as you may think. \n\nOne of my favorite ways of handling things when the waitress is taking everyone’s drink orders is to say ‘I am not sure right now, so just a water for the moment.’  Everyone thinks I will be drinking soon enough, and no one notices that I never get a drink.",
          "created_utc": 1677420387.0
        }
      ]
    },
    {
      "id": "ja1kz1b",
      "author": "MagillaGuerillotine",
      "body": "Nice work! I know that it is something a lot of us struggle with. I’m not going to pretend that I don’t also struggle with it. You are doing awesome, hang in there!",
      "created_utc": 1677383477.0,
      "score": 3,
      "context": [
        {
          "id": "j9ywxp1",
          "author": "MagillaGuerillotine",
          "body": "You are a person, like everyone else. You are worthy of respect. There is not anything wrong with you just because you are different, everybody is different. You are allowed to be sad, angry, anxious, scared. The best advice I’ve been given for social situations is this “Accept yourself, and you will see that others do too” I know that is not something that is easy, and it’s okay if it’s hard. It is an idea to work toward, not a goal to reach, and even working toward it is success. \n\nP.S. I have found that I get less questions and suggestions if I tell people that I’m “Working on some sensory issues.” Which really is the truth.",
          "created_utc": 1677341915.0
        },
        {
          "id": "j9zv9g8",
          "author": "Arfid_Account1",
          "body": "Well thank you. It is something I am working on. I have sucesffully overcome some other aspects of my life I thought were \"too different to be acceptable\" but ARFID is a big one that I still struggle with. I appreciate your kind words and your advice.",
          "created_utc": 1677355538.0
        }
      ]
    },
    {
      "id": "ja4eev8",
      "author": "jupiterLILY",
      "body": "If lying feels awkward, you could fat a drink that you want or seem excited by. \n\nOne of the things that sucks around drinking around someone who doesn’t drink, is worrying that they aren’t having a good time or don’t have anything nice to drink. \n\nYou could order a soda water with mint and lime. Or whatever sounds appealing to you. \n\nThat way there’s less risk of coming off as false. Plus you (and everyone else) feels like you’re joining in with the fun a bit more.\n\nFrame it in a positive way as opposed to “I’ll just have a water” or something like that.\n\nMaybe make use of something that you can’t get at home like their syrups. Some bartenders will happily make you a mock tail.",
      "created_utc": 1677440023.0,
      "score": 2,
      "context": [
        {
          "id": "ja32e6y",
          "author": "None",
          "body": "LOTS of people go to bars but do not drink alcohol.  It is not as unusual as you may think. \n\nOne of my favorite ways of handling things when the waitress is taking everyone’s drink orders is to say ‘I am not sure right now, so just a water for the moment.’  Everyone thinks I will be drinking soon enough, and no one notices that I never get a drink.",
          "created_utc": 1677420387.0
        },
        {
          "id": "ja3w3fv",
          "author": "Arfid_Account1",
          "body": "Now that is a smart strategy! The point is I'm going alone, because right now I don't exactly have friends to hang out with... so it wouldn't really work. But I'll keep it in mind",
          "created_utc": 1677432853.0
        }
      ]
    }
  ]
}