{
  "id": "11jis25",
  "subreddit": "ARFID",
  "author": "NOIDEDNalyd",
  "created_utc": 1678062032.0,
  "title": "Disgusted by the smell, sight and sound of food? Check. Having a million-and-one things you don't eat? Check. Overwhelming anxiety when eating at a new restaurant, or god forbid a friend's house? Check. People constantly asking \"Just what exactly DO you eat?\" Check. Oh god, oh no...",
  "selftext": "",
  "url": "https://i.redd.it/cui2oxnch0ma1.gif",
  "score": 470,
  "num_comments": 25,
  "comments": [
    {
      "id": "jb2xsi6",
      "author": "NOIDEDNalyd",
      "body": "Joke's aside, this discovery has been both eye-opening and a gut punch to me for the past week. Moreso because my family has a more *conservative* attitude toward mental disorders.\n\nI've been seeing a therapist about my clusterfuck of a brain for a few months, she diagnosed me with severe ADHD (kinda saw it coming), and during one of the more question/answer style sessions, she asked me about my diet. She was a bit shocked to learn about how I eat basically no fruits or vegetables or much of anything other than the classics (chicken, potatoes, and pasta ftw) for all my 22 years of living.  That one of the things that infuriate/disgusts me the most is whenever I'm indoors and someone starts eating cooked food (couldn't they take that shit outside?!). The fact that I will (and have) literally starved myself instead of eating undesirable food. The list goes on...\n\nAfter a while, she started to tell me about ARFID. Just like my ADHD diagnosis, everything she told me about ARFID and how it works felt like such an illuminating moment. Like all the puzzle pieces of my life up to now just slid into place. In fact, she's said my ADHD also likely ties into ARFID. But right now I don't know what to do about it. She said we'll discuss treatment options at our next session but that's not for another month (finding a time when she's available and I'm not having classes is a pain in the ass).\n\nRight now I'm freaking out wondering what the next step is. It sounds weird saying it out loud (or even typing it), but all my life I've watched people eat whole plates filled with balanced meals, watched them take big spoonfuls without thinking about it, and wished I could *just* do that. I've seen shows and movies of people eating salads and non-white bread and exotic dishes and thought to myself \"That looks good, I wish I could eat that\" even though I know if those meals were magically teleported from the screen as they were right in front of me I would do what I always do. Choke down some bites, get distracted for several minutes, choke down some more, and before I know it the food has gone soggy or dry, and I've eaten less than a quarter of it, I lose my appetite and with full shame put the leftovers in the microwave, say \"I'll finish this later today\" (this is a lie, I *know* this is a goddamn lie) forget about the leftovers, then throw it all away the next morning because it got spoiled. Don't forget another healthy helping of shame I feel when I scoop the food into the garbage.\n\nWith my ADHD diagnosis, I was more relieved than scared. I got this feeling that a lot of my faults are not my own but the result of this mental disorder. I've tried treating it with the typical stuff: yoga, exercise, and meditation. None of it helped. And with the diagnosis, my therapist said she can give me a referral to a psychiatrist to get prescribed Adderal and I'm not afraid to admit I was elated. A possible solution to a lifelong problem that feels doable (hooray for drugs). But ARFID feels different.\n\nI thought, like many of you, that I was just a picky eater and I just had to \"get over\" my hang-ups. That if I choke down enough healthy diets I'll eventually enjoy it. But with this diagnosis, I felt the opposite way than how I felt getting diagnosed with ADHD. I know I haven't spoken to my therapist about treatment options, but doing my own research this feels a lot harder to solve than my ADHD.\n\nI guess what I'm wondering now is:  how do you guys cope? how did you feel getting diagnosed and how did you deal with it? do you brute force your way to a healthy diet or is there a more doable solution (doesn't *have* to be medication, but you know...it helps).\n\nIf you made it through this gargantuan wall of text, thanks for indulging me. It's 3 am, I'm too antsy to sleep, research binging and all, but I'm probably gonna tucker out soon, so if I don't respond to comments right away know that that's what I'm doing. Have a good one!",
      "created_utc": 1678064203.0,
      "score": 28,
      "context": []
    },
    {
      "id": "jb3sayr",
      "author": "PristinePrincess12",
      "body": "Eat what you can, when you can. Doesn't matter what it is - just eat. It's better than starving. I constantly feel guilty about the fact I consume mainly sugar and I'm 6 weeks away from giving birth but then I remember to my first pregnancy when I felt so guilty to the point I didn't eat AT ALL which of course, NOT a good thing when you're growing a human. Then I'm reminded \"hey, at least you're EATING and it's not ALWAYS all sugar. You're gonna birth an average size baby rather than a worryingly small baby\" and it makes me feel better. Food is food! It's good no matter what it is! Body needs food.",
      "created_utc": 1678079871.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jb4a64a",
      "author": "jizzyjazz2",
      "body": "That's pretty much exactly how I felt finding out. It was really not an illuminating experience at all: it just made everything more complicated",
      "created_utc": 1678093551.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jb4b17x",
      "author": "Repulsive_Ad2795",
      "body": "Gang",
      "created_utc": 1678094327.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jb4zff1",
      "author": "fishymcswims",
      "body": "I was told I’m a picky eater all my life, so it just stuck with me.  I work in mental health, and having to read the DSM in class, it didn’t even completely occur to me that I could have ARFID because I thought, “I don’t have an eating disorder.”  I joined this subreddit maybe a year or two ago, but I thought that since I didn’t have as severe of a case as some people I’d read about, maybe it wasn’t ARFID.  So I found several ways to talk myself out of thinking I could have it.  But when I’d talk about my eating habits, I’d tell people that at this point, I know it’s all anxiety-based and in my head.  The more I started to think that way - “that it was all in my head” - the more I started to think about ARFID as an actual diagnosis for me.  I’ve been working with a therapist certified in working with eating disorders for several months now, and it has been the most validating thing.  Lots of tough work already and plenty more to go, but for the first time (in my late 30s), I have some hope.",
      "created_utc": 1678111423.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jb7a69e",
      "author": "Bambi7R21",
      "body": "I told my doctor about this eating disorder last year in February. I found out months before I told her about ARFID. My doctor had to look it up because she didn't know what it was and my doctor agreed with me that I have it. Before I found out about ARFID, I just always thought I was a very extreme picky eater. But when I read about ARFID I was like so relieved that I finally knew what was going on with me.\n\n But at the same time I wasn't because I just want to be able to eat all of the delicious foods. My doctor told me to start taking those ensure drinks/protein drinks and a multivitamin last year, when I told her about it. I tried a couple different drinks but I just couldn't do it. The smell was the same for those drinks I tried, which was a very very strong disgusting smell. And the taste was so so bad as well like I had to spit it out. \n\nLike I really did try my best to like them but I just couldn't do it. Because I know I really do need those drinks to help me but I just can't. Then the same thing with the multivitamin, I tried a couple different kinds of them as well. But the smell and the taste was super strong and I just couldn't do it. Like I forced myself to eat one and I almost got sick and my stomach hated me for doing that.\n\n My doctor still thinks I'm taking the multivitamin because when she asks me about them I say yea that I'm still taking them but I don't. I know I shouldn't lie to her about taking them but if I don't I feel like she would think I'm not trying to help myself. Because she gives me so many options I can try to get better but I turn most of them down like going on a medication to eat more. But I don't have a problem with eating like I know when I'm hungry it's just that I have a very small amount of food I actually like. I'm starting therapy soon for my eating disorder, my first appointment is on March 16th. \n\nI know I won't like it because I will have to try new foods eventually but at the same time I will. Because I can work on getting better and I really need to gain weight. I have always weighed 97 pounds ( I'm 22 and I'm 5 feet 2 inches) but I have been losing weight since last July and I'm currently 92 pounds if I didn't drop more. My doctor told me my weight is getting dangerously low. So I really need to like more foods and also it will give me the vitamins and minerals I need so badly because I get probably none of those.\n\n I saw that a person needs to try a food at least 20 times before their taste buds decides if they like a certain food or not. So the foods that looks good and smell good to you, give them a try multiple times. I know it will be hard but we can do this. I don't know if my therapist will have me eat one bite of a new food or have me eat it all. But which ever one it is, I will be forcing myself to eat that new food because I want to be healthy and get to a healthy weight. \n\nI hope we can both get a little bit better at liking some more foods. Also this might help you but I'm going to be hiding like vegetables and other foods inside of food. Like in cheesy dishes or make the vegetables so tiny hidden in the food where I can't really taste or see them.",
      "created_utc": 1678145885.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jb5aqys",
      "author": "phejster",
      "body": "I'm 51 and am reeling about this discovery.",
      "created_utc": 1678116470.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jb8pxhv",
      "author": "salchicher",
      "body": "So uh. Reddit recommended me this post out of the blue. I think this post just led me to ARFID as the root of all my fucking eating issues??? I just read this subreddit’s top posts inside and out. \n\nDisinterest in eating. Fear of adverse reactions like throat swelling again, food poisoning, choking, ect. Limited number of things I eat. Fear of eating new foods. Fear of new restaurants. Never feeling hungry until my blood sugar crashes. Feeling like my stomach is always full and bloated when stressed. Nausea because I didn’t eat, but nauseous when I do eat. \n\nYou mean to fucking tell me that ALLLLLL of this that I’ve been struggling with for a YEAR could be an eating disorder and that this isn’t just come crazy thing affecting only me??? What the hell!! \n\nI used to be sort of a foodie. I tried new recipes and foods all the time. I would eat whatever I want, damn the consequence. Now I can’t even eat a chocolate bar, because I’ve never tried it before, and obviously, it will give me an allergic reaction. \n\nMan. This sub has given me a lot to think about 😅 thanks for making the post I guess?",
      "created_utc": 1678173124.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l9u8c6q",
      "author": "HillsHaveEyesToo",
      "body": "This is me right now",
      "created_utc": 1719103566.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkrnhhv",
      "author": "DianaPencill",
      "body": "AAAAA I DISCOVERED IT FEW HOURS AGOOO",
      "created_utc": 1743461962.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ju6c80i",
      "author": "castroski7",
      "body": "Lol",
      "created_utc": 1690789562.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jb3g5w4",
      "author": "linx14",
      "body": "The only way I’ve been able to cope was move out of my parents place and starting to feel safe. And using a therapy called neurofeedback. \n\nBut I still have problems with a lot of stuff. But giving myself the time and space not to force myself has been such a blessing. If I don’t want to eat that weird thing. Fuck that weird thing! No pressure to eat. \n\nThen taking control of the things I know I can eat. I meal prep now and only make things I can eat. Then I experiment a little when I’m feeling up to it and only when I feel ready.\n\nI make a shit tone of pasta and make panko chicken nuggets. I even buy Dino nuggets/fries. And even pizzas.\n\n\nJust eating is so much more important then focusing of eating healthy. It’s healthier to eat something then to not eat at all.",
      "created_utc": 1678073147.0,
      "score": 11,
      "context": [
        {
          "id": "jb2xsi6",
          "author": "NOIDEDNalyd",
          "body": "Joke's aside, this discovery has been both eye-opening and a gut punch to me for the past week. Moreso because my family has a more *conservative* attitude toward mental disorders.\n\nI've been seeing a therapist about my clusterfuck of a brain for a few months, she diagnosed me with severe ADHD (kinda saw it coming), and during one of the more question/answer style sessions, she asked me about my diet. She was a bit shocked to learn about how I eat basically no fruits or vegetables or much of anything other than the classics (chicken, potatoes, and pasta ftw) for all my 22 years of living.  That one of the things that infuriate/disgusts me the most is whenever I'm indoors and someone starts eating cooked food (couldn't they take that shit outside?!). The fact that I will (and have) literally starved myself instead of eating undesirable food. The list goes on...\n\nAfter a while, she started to tell me about ARFID. Just like my ADHD diagnosis, everything she told me about ARFID and how it works felt like such an illuminating moment. Like all the puzzle pieces of my life up to now just slid into place. In fact, she's said my ADHD also likely ties into ARFID. But right now I don't know what to do about it. She said we'll discuss treatment options at our next session but that's not for another month (finding a time when she's available and I'm not having classes is a pain in the ass).\n\nRight now I'm freaking out wondering what the next step is. It sounds weird saying it out loud (or even typing it), but all my life I've watched people eat whole plates filled with balanced meals, watched them take big spoonfuls without thinking about it, and wished I could *just* do that. I've seen shows and movies of people eating salads and non-white bread and exotic dishes and thought to myself \"That looks good, I wish I could eat that\" even though I know if those meals were magically teleported from the screen as they were right in front of me I would do what I always do. Choke down some bites, get distracted for several minutes, choke down some more, and before I know it the food has gone soggy or dry, and I've eaten less than a quarter of it, I lose my appetite and with full shame put the leftovers in the microwave, say \"I'll finish this later today\" (this is a lie, I *know* this is a goddamn lie) forget about the leftovers, then throw it all away the next morning because it got spoiled. Don't forget another healthy helping of shame I feel when I scoop the food into the garbage.\n\nWith my ADHD diagnosis, I was more relieved than scared. I got this feeling that a lot of my faults are not my own but the result of this mental disorder. I've tried treating it with the typical stuff: yoga, exercise, and meditation. None of it helped. And with the diagnosis, my therapist said she can give me a referral to a psychiatrist to get prescribed Adderal and I'm not afraid to admit I was elated. A possible solution to a lifelong problem that feels doable (hooray for drugs). But ARFID feels different.\n\nI thought, like many of you, that I was just a picky eater and I just had to \"get over\" my hang-ups. That if I choke down enough healthy diets I'll eventually enjoy it. But with this diagnosis, I felt the opposite way than how I felt getting diagnosed with ADHD. I know I haven't spoken to my therapist about treatment options, but doing my own research this feels a lot harder to solve than my ADHD.\n\nI guess what I'm wondering now is:  how do you guys cope? how did you feel getting diagnosed and how did you deal with it? do you brute force your way to a healthy diet or is there a more doable solution (doesn't *have* to be medication, but you know...it helps).\n\nIf you made it through this gargantuan wall of text, thanks for indulging me. It's 3 am, I'm too antsy to sleep, research binging and all, but I'm probably gonna tucker out soon, so if I don't respond to comments right away know that that's what I'm doing. Have a good one!",
          "created_utc": 1678064203.0
        }
      ]
    },
    {
      "id": "jb45cnm",
      "author": "Dramatic-Growth1335",
      "body": "I'm 36 and brute forced it starting at around 24 years old. I'm still picky and sometimes will revert back to just sandwiches and crisps but my diet and lifestyle has VASTLY improved since I began forcing myself to try new things.\n\n I can eat anything now, doesn't mean I'll necessarily like it, but I won't gag anymore..the worst I do to myself now is psych myself out about not wanting to eat anything we have in the house and then I get all moody as I'm hungry",
      "created_utc": 1678089410.0,
      "score": 3,
      "context": [
        {
          "id": "jb2xsi6",
          "author": "NOIDEDNalyd",
          "body": "Joke's aside, this discovery has been both eye-opening and a gut punch to me for the past week. Moreso because my family has a more *conservative* attitude toward mental disorders.\n\nI've been seeing a therapist about my clusterfuck of a brain for a few months, she diagnosed me with severe ADHD (kinda saw it coming), and during one of the more question/answer style sessions, she asked me about my diet. She was a bit shocked to learn about how I eat basically no fruits or vegetables or much of anything other than the classics (chicken, potatoes, and pasta ftw) for all my 22 years of living.  That one of the things that infuriate/disgusts me the most is whenever I'm indoors and someone starts eating cooked food (couldn't they take that shit outside?!). The fact that I will (and have) literally starved myself instead of eating undesirable food. The list goes on...\n\nAfter a while, she started to tell me about ARFID. Just like my ADHD diagnosis, everything she told me about ARFID and how it works felt like such an illuminating moment. Like all the puzzle pieces of my life up to now just slid into place. In fact, she's said my ADHD also likely ties into ARFID. But right now I don't know what to do about it. She said we'll discuss treatment options at our next session but that's not for another month (finding a time when she's available and I'm not having classes is a pain in the ass).\n\nRight now I'm freaking out wondering what the next step is. It sounds weird saying it out loud (or even typing it), but all my life I've watched people eat whole plates filled with balanced meals, watched them take big spoonfuls without thinking about it, and wished I could *just* do that. I've seen shows and movies of people eating salads and non-white bread and exotic dishes and thought to myself \"That looks good, I wish I could eat that\" even though I know if those meals were magically teleported from the screen as they were right in front of me I would do what I always do. Choke down some bites, get distracted for several minutes, choke down some more, and before I know it the food has gone soggy or dry, and I've eaten less than a quarter of it, I lose my appetite and with full shame put the leftovers in the microwave, say \"I'll finish this later today\" (this is a lie, I *know* this is a goddamn lie) forget about the leftovers, then throw it all away the next morning because it got spoiled. Don't forget another healthy helping of shame I feel when I scoop the food into the garbage.\n\nWith my ADHD diagnosis, I was more relieved than scared. I got this feeling that a lot of my faults are not my own but the result of this mental disorder. I've tried treating it with the typical stuff: yoga, exercise, and meditation. None of it helped. And with the diagnosis, my therapist said she can give me a referral to a psychiatrist to get prescribed Adderal and I'm not afraid to admit I was elated. A possible solution to a lifelong problem that feels doable (hooray for drugs). But ARFID feels different.\n\nI thought, like many of you, that I was just a picky eater and I just had to \"get over\" my hang-ups. That if I choke down enough healthy diets I'll eventually enjoy it. But with this diagnosis, I felt the opposite way than how I felt getting diagnosed with ADHD. I know I haven't spoken to my therapist about treatment options, but doing my own research this feels a lot harder to solve than my ADHD.\n\nI guess what I'm wondering now is:  how do you guys cope? how did you feel getting diagnosed and how did you deal with it? do you brute force your way to a healthy diet or is there a more doable solution (doesn't *have* to be medication, but you know...it helps).\n\nIf you made it through this gargantuan wall of text, thanks for indulging me. It's 3 am, I'm too antsy to sleep, research binging and all, but I'm probably gonna tucker out soon, so if I don't respond to comments right away know that that's what I'm doing. Have a good one!",
          "created_utc": 1678064203.0
        }
      ]
    },
    {
      "id": "jdjec28",
      "author": "SnooFloofs8295",
      "body": "You're so lucky to have a good therapist. \n\nRant: Mine are reducing my dosage based on me not beeing able to keep my weight stable. She says when my weight have been stable for a couple of months and i eat 4 meals a day i can go back on meds. I've tried talking to a psychiatrist who was the one that said does things and a bunch more, psychologist and my gp. I'm not done fighting to be referred to a nutritionist. My gp said she didn't/couldn't and that i had to go private. The ED support chat said that was weird and that i should go in person and tell her how much i struggle.\nI'm 24 btw.",
      "created_utc": 1679690078.0,
      "score": 1,
      "context": [
        {
          "id": "jb2xsi6",
          "author": "NOIDEDNalyd",
          "body": "Joke's aside, this discovery has been both eye-opening and a gut punch to me for the past week. Moreso because my family has a more *conservative* attitude toward mental disorders.\n\nI've been seeing a therapist about my clusterfuck of a brain for a few months, she diagnosed me with severe ADHD (kinda saw it coming), and during one of the more question/answer style sessions, she asked me about my diet. She was a bit shocked to learn about how I eat basically no fruits or vegetables or much of anything other than the classics (chicken, potatoes, and pasta ftw) for all my 22 years of living.  That one of the things that infuriate/disgusts me the most is whenever I'm indoors and someone starts eating cooked food (couldn't they take that shit outside?!). The fact that I will (and have) literally starved myself instead of eating undesirable food. The list goes on...\n\nAfter a while, she started to tell me about ARFID. Just like my ADHD diagnosis, everything she told me about ARFID and how it works felt like such an illuminating moment. Like all the puzzle pieces of my life up to now just slid into place. In fact, she's said my ADHD also likely ties into ARFID. But right now I don't know what to do about it. She said we'll discuss treatment options at our next session but that's not for another month (finding a time when she's available and I'm not having classes is a pain in the ass).\n\nRight now I'm freaking out wondering what the next step is. It sounds weird saying it out loud (or even typing it), but all my life I've watched people eat whole plates filled with balanced meals, watched them take big spoonfuls without thinking about it, and wished I could *just* do that. I've seen shows and movies of people eating salads and non-white bread and exotic dishes and thought to myself \"That looks good, I wish I could eat that\" even though I know if those meals were magically teleported from the screen as they were right in front of me I would do what I always do. Choke down some bites, get distracted for several minutes, choke down some more, and before I know it the food has gone soggy or dry, and I've eaten less than a quarter of it, I lose my appetite and with full shame put the leftovers in the microwave, say \"I'll finish this later today\" (this is a lie, I *know* this is a goddamn lie) forget about the leftovers, then throw it all away the next morning because it got spoiled. Don't forget another healthy helping of shame I feel when I scoop the food into the garbage.\n\nWith my ADHD diagnosis, I was more relieved than scared. I got this feeling that a lot of my faults are not my own but the result of this mental disorder. I've tried treating it with the typical stuff: yoga, exercise, and meditation. None of it helped. And with the diagnosis, my therapist said she can give me a referral to a psychiatrist to get prescribed Adderal and I'm not afraid to admit I was elated. A possible solution to a lifelong problem that feels doable (hooray for drugs). But ARFID feels different.\n\nI thought, like many of you, that I was just a picky eater and I just had to \"get over\" my hang-ups. That if I choke down enough healthy diets I'll eventually enjoy it. But with this diagnosis, I felt the opposite way than how I felt getting diagnosed with ADHD. I know I haven't spoken to my therapist about treatment options, but doing my own research this feels a lot harder to solve than my ADHD.\n\nI guess what I'm wondering now is:  how do you guys cope? how did you feel getting diagnosed and how did you deal with it? do you brute force your way to a healthy diet or is there a more doable solution (doesn't *have* to be medication, but you know...it helps).\n\nIf you made it through this gargantuan wall of text, thanks for indulging me. It's 3 am, I'm too antsy to sleep, research binging and all, but I'm probably gonna tucker out soon, so if I don't respond to comments right away know that that's what I'm doing. Have a good one!",
          "created_utc": 1678064203.0
        }
      ]
    },
    {
      "id": "jb44o8l",
      "author": "NOIDEDNalyd",
      "body": "Oh, man sugar has always been an issue for me. For as long as I can remember I can't drink coffee unless it has milk and an obscene amount of sugar. Hell, I would call it an unreasonable amount of sugar because sometimes I don't stir it thoroughly and by the time I've almost finished the cup there's this thick bed of sugar at the bottom. So I didn't even enjoy most of that sugar or even notice that not all of it is mixed properly.\n\nFirst off, congrats on getting through growing another human in you. I have a hard enough time eating for myself, eating for two sounds like a nightmare and you sound pretty badass in my book for pulling it off.\n\nSecondly, your advice rings true with what I've both read and experienced. The biggest scare about finding out I have ARFID is also finding out I may have scurvy, or if not I'm definitely at high risk for it. I have this \"benign\" rash down my arms shoulders and back that's stuck with me through puberty, always thought it was just me being unlucky in the genetics department since the rash doesn't itch and isn't irritating in any way. Telling this to my therapist she suggests I immediately try to incorporate more fruits and veggies in my diet, as I'm most certainly severely lacking in vitamin c. I asked her if I can't just take vitamin c supplements and she advised against it, claiming it's better to eat foods with vitamin c as that solves several problems at once: \n\nSolves the nutritional deficiency problem.\n\nI'd be eating more food, so I'm no longer needlessly starving myself.\n\nHelps me accustom myself to eating food groups I hate.\n\nI've been trying to eat an orange a day to get that vitamin c (therapist says I should feel the effects of this nutritional intake in 2 weeks, given how long I've gone without it) and it's not been easy. I hate the fleshiness of fruits, and more so their inconsistent texture. Why do orange slices have to have this layer of flesh followed by orange juices and chunks of pulp?! It's horrible. My mom and sister haven't been the most supportive about this, claiming I'm exaggerating and should just \"get over it\" (as if I fucking want to be this way), so finding a community of like-minded individuals with the same struggles has been the best thing to come out of the diagnosis. Thank you for the advice.",
      "created_utc": 1678088851.0,
      "score": 2,
      "context": [
        {
          "id": "jb3sayr",
          "author": "PristinePrincess12",
          "body": "Eat what you can, when you can. Doesn't matter what it is - just eat. It's better than starving. I constantly feel guilty about the fact I consume mainly sugar and I'm 6 weeks away from giving birth but then I remember to my first pregnancy when I felt so guilty to the point I didn't eat AT ALL which of course, NOT a good thing when you're growing a human. Then I'm reminded \"hey, at least you're EATING and it's not ALWAYS all sugar. You're gonna birth an average size baby rather than a worryingly small baby\" and it makes me feel better. Food is food! It's good no matter what it is! Body needs food.",
          "created_utc": 1678079871.0
        }
      ]
    },
    {
      "id": "jb4adar",
      "author": "NOIDEDNalyd",
      "body": "Yeah, perhaps I misused the term \"illuminating\", but I just meant to say that it explained a lot. Though finding this community is the best thing to come out of the diagnosis, so there's that at least",
      "created_utc": 1678093724.0,
      "score": 1,
      "context": [
        {
          "id": "jb4a64a",
          "author": "jizzyjazz2",
          "body": "That's pretty much exactly how I felt finding out. It was really not an illuminating experience at all: it just made everything more complicated",
          "created_utc": 1678093551.0
        }
      ]
    },
    {
      "id": "jb8t7io",
      "author": "NOIDEDNalyd",
      "body": "Hey you're welcome friend,  it's always good to know you're not as alone as you may initially believe",
      "created_utc": 1678175724.0,
      "score": 1,
      "context": [
        {
          "id": "jb8pxhv",
          "author": "salchicher",
          "body": "So uh. Reddit recommended me this post out of the blue. I think this post just led me to ARFID as the root of all my fucking eating issues??? I just read this subreddit’s top posts inside and out. \n\nDisinterest in eating. Fear of adverse reactions like throat swelling again, food poisoning, choking, ect. Limited number of things I eat. Fear of eating new foods. Fear of new restaurants. Never feeling hungry until my blood sugar crashes. Feeling like my stomach is always full and bloated when stressed. Nausea because I didn’t eat, but nauseous when I do eat. \n\nYou mean to fucking tell me that ALLLLLL of this that I’ve been struggling with for a YEAR could be an eating disorder and that this isn’t just come crazy thing affecting only me??? What the hell!! \n\nI used to be sort of a foodie. I tried new recipes and foods all the time. I would eat whatever I want, damn the consequence. Now I can’t even eat a chocolate bar, because I’ve never tried it before, and obviously, it will give me an allergic reaction. \n\nMan. This sub has given me a lot to think about 😅 thanks for making the post I guess?",
          "created_utc": 1678173124.0
        }
      ]
    },
    {
      "id": "jb44y98",
      "author": "NOIDEDNalyd",
      "body": "Yeah, I guess one way I definitely won't get better is by beating myself up for not immediately getting over my condition. Even though I know this, it's always nice to hear a reminder from people. Reminds me of a quote I saw on reddit, under a post about self-improvement. \n\n\"You can't hate your way into loving yourself\".\n\nThank you for the reminder, friend.",
      "created_utc": 1678089082.0,
      "score": 5,
      "context": [
        {
          "id": "jb2xsi6",
          "author": "NOIDEDNalyd",
          "body": "Joke's aside, this discovery has been both eye-opening and a gut punch to me for the past week. Moreso because my family has a more *conservative* attitude toward mental disorders.\n\nI've been seeing a therapist about my clusterfuck of a brain for a few months, she diagnosed me with severe ADHD (kinda saw it coming), and during one of the more question/answer style sessions, she asked me about my diet. She was a bit shocked to learn about how I eat basically no fruits or vegetables or much of anything other than the classics (chicken, potatoes, and pasta ftw) for all my 22 years of living.  That one of the things that infuriate/disgusts me the most is whenever I'm indoors and someone starts eating cooked food (couldn't they take that shit outside?!). The fact that I will (and have) literally starved myself instead of eating undesirable food. The list goes on...\n\nAfter a while, she started to tell me about ARFID. Just like my ADHD diagnosis, everything she told me about ARFID and how it works felt like such an illuminating moment. Like all the puzzle pieces of my life up to now just slid into place. In fact, she's said my ADHD also likely ties into ARFID. But right now I don't know what to do about it. She said we'll discuss treatment options at our next session but that's not for another month (finding a time when she's available and I'm not having classes is a pain in the ass).\n\nRight now I'm freaking out wondering what the next step is. It sounds weird saying it out loud (or even typing it), but all my life I've watched people eat whole plates filled with balanced meals, watched them take big spoonfuls without thinking about it, and wished I could *just* do that. I've seen shows and movies of people eating salads and non-white bread and exotic dishes and thought to myself \"That looks good, I wish I could eat that\" even though I know if those meals were magically teleported from the screen as they were right in front of me I would do what I always do. Choke down some bites, get distracted for several minutes, choke down some more, and before I know it the food has gone soggy or dry, and I've eaten less than a quarter of it, I lose my appetite and with full shame put the leftovers in the microwave, say \"I'll finish this later today\" (this is a lie, I *know* this is a goddamn lie) forget about the leftovers, then throw it all away the next morning because it got spoiled. Don't forget another healthy helping of shame I feel when I scoop the food into the garbage.\n\nWith my ADHD diagnosis, I was more relieved than scared. I got this feeling that a lot of my faults are not my own but the result of this mental disorder. I've tried treating it with the typical stuff: yoga, exercise, and meditation. None of it helped. And with the diagnosis, my therapist said she can give me a referral to a psychiatrist to get prescribed Adderal and I'm not afraid to admit I was elated. A possible solution to a lifelong problem that feels doable (hooray for drugs). But ARFID feels different.\n\nI thought, like many of you, that I was just a picky eater and I just had to \"get over\" my hang-ups. That if I choke down enough healthy diets I'll eventually enjoy it. But with this diagnosis, I felt the opposite way than how I felt getting diagnosed with ADHD. I know I haven't spoken to my therapist about treatment options, but doing my own research this feels a lot harder to solve than my ADHD.\n\nI guess what I'm wondering now is:  how do you guys cope? how did you feel getting diagnosed and how did you deal with it? do you brute force your way to a healthy diet or is there a more doable solution (doesn't *have* to be medication, but you know...it helps).\n\nIf you made it through this gargantuan wall of text, thanks for indulging me. It's 3 am, I'm too antsy to sleep, research binging and all, but I'm probably gonna tucker out soon, so if I don't respond to comments right away know that that's what I'm doing. Have a good one!",
          "created_utc": 1678064203.0
        },
        {
          "id": "jb3g5w4",
          "author": "linx14",
          "body": "The only way I’ve been able to cope was move out of my parents place and starting to feel safe. And using a therapy called neurofeedback. \n\nBut I still have problems with a lot of stuff. But giving myself the time and space not to force myself has been such a blessing. If I don’t want to eat that weird thing. Fuck that weird thing! No pressure to eat. \n\nThen taking control of the things I know I can eat. I meal prep now and only make things I can eat. Then I experiment a little when I’m feeling up to it and only when I feel ready.\n\nI make a shit tone of pasta and make panko chicken nuggets. I even buy Dino nuggets/fries. And even pizzas.\n\n\nJust eating is so much more important then focusing of eating healthy. It’s healthier to eat something then to not eat at all.",
          "created_utc": 1678073147.0
        }
      ]
    },
    {
      "id": "jb464rq",
      "author": "NOIDEDNalyd",
      "body": "I felt scared wondering if this is something that will never get better but just become something I have to deal with. \n\nEat food that I need but hate and be miserable\n\nor\n\nEat mostly nothing but the unbalanced shit I've been eating and be likely even more miserable\n\nLike the Louis CK joke about as he got into his 50s, his ankles got fucked up, and his doctor said he should start doing ankle stretches every morning.\n\nLouis: \"So how long do I have to do this until I get better?\"\n\nDoctor: \"'Get better'!? No, you're on your way out, you don't 'get better', that's just something you do now. You have a shitty ankle and you have to stretch it to make it tolerably shitty. You do this every day until you die, got it?\"\n\nGlad to hear I can eventually become somewhat accustomed to eating healthier, thanks for the comment.",
      "created_utc": 1678090072.0,
      "score": 2,
      "context": [
        {
          "id": "jb2xsi6",
          "author": "NOIDEDNalyd",
          "body": "Joke's aside, this discovery has been both eye-opening and a gut punch to me for the past week. Moreso because my family has a more *conservative* attitude toward mental disorders.\n\nI've been seeing a therapist about my clusterfuck of a brain for a few months, she diagnosed me with severe ADHD (kinda saw it coming), and during one of the more question/answer style sessions, she asked me about my diet. She was a bit shocked to learn about how I eat basically no fruits or vegetables or much of anything other than the classics (chicken, potatoes, and pasta ftw) for all my 22 years of living.  That one of the things that infuriate/disgusts me the most is whenever I'm indoors and someone starts eating cooked food (couldn't they take that shit outside?!). The fact that I will (and have) literally starved myself instead of eating undesirable food. The list goes on...\n\nAfter a while, she started to tell me about ARFID. Just like my ADHD diagnosis, everything she told me about ARFID and how it works felt like such an illuminating moment. Like all the puzzle pieces of my life up to now just slid into place. In fact, she's said my ADHD also likely ties into ARFID. But right now I don't know what to do about it. She said we'll discuss treatment options at our next session but that's not for another month (finding a time when she's available and I'm not having classes is a pain in the ass).\n\nRight now I'm freaking out wondering what the next step is. It sounds weird saying it out loud (or even typing it), but all my life I've watched people eat whole plates filled with balanced meals, watched them take big spoonfuls without thinking about it, and wished I could *just* do that. I've seen shows and movies of people eating salads and non-white bread and exotic dishes and thought to myself \"That looks good, I wish I could eat that\" even though I know if those meals were magically teleported from the screen as they were right in front of me I would do what I always do. Choke down some bites, get distracted for several minutes, choke down some more, and before I know it the food has gone soggy or dry, and I've eaten less than a quarter of it, I lose my appetite and with full shame put the leftovers in the microwave, say \"I'll finish this later today\" (this is a lie, I *know* this is a goddamn lie) forget about the leftovers, then throw it all away the next morning because it got spoiled. Don't forget another healthy helping of shame I feel when I scoop the food into the garbage.\n\nWith my ADHD diagnosis, I was more relieved than scared. I got this feeling that a lot of my faults are not my own but the result of this mental disorder. I've tried treating it with the typical stuff: yoga, exercise, and meditation. None of it helped. And with the diagnosis, my therapist said she can give me a referral to a psychiatrist to get prescribed Adderal and I'm not afraid to admit I was elated. A possible solution to a lifelong problem that feels doable (hooray for drugs). But ARFID feels different.\n\nI thought, like many of you, that I was just a picky eater and I just had to \"get over\" my hang-ups. That if I choke down enough healthy diets I'll eventually enjoy it. But with this diagnosis, I felt the opposite way than how I felt getting diagnosed with ADHD. I know I haven't spoken to my therapist about treatment options, but doing my own research this feels a lot harder to solve than my ADHD.\n\nI guess what I'm wondering now is:  how do you guys cope? how did you feel getting diagnosed and how did you deal with it? do you brute force your way to a healthy diet or is there a more doable solution (doesn't *have* to be medication, but you know...it helps).\n\nIf you made it through this gargantuan wall of text, thanks for indulging me. It's 3 am, I'm too antsy to sleep, research binging and all, but I'm probably gonna tucker out soon, so if I don't respond to comments right away know that that's what I'm doing. Have a good one!",
          "created_utc": 1678064203.0
        },
        {
          "id": "jb45cnm",
          "author": "Dramatic-Growth1335",
          "body": "I'm 36 and brute forced it starting at around 24 years old. I'm still picky and sometimes will revert back to just sandwiches and crisps but my diet and lifestyle has VASTLY improved since I began forcing myself to try new things.\n\n I can eat anything now, doesn't mean I'll necessarily like it, but I won't gag anymore..the worst I do to myself now is psych myself out about not wanting to eat anything we have in the house and then I get all moody as I'm hungry",
          "created_utc": 1678089410.0
        }
      ]
    },
    {
      "id": "jb47grx",
      "author": "PristinePrincess12",
      "body": "Not quite sure I agree with your therapist in the supplements department! Forcing yourself to eat foods you don't like is actually going to set you BACKWARD, not forward. That's like, a key component of ARFID. Take the vitamin C pills! There is nothing wrong with taking supplements and pills! The goal of this sub is encouragement and support - we don't have a \"cure\" mindset, as that can be EXTREMELY detrimental to your mental health. Your therapist sounds great but don't listen too and believe everything they say automatically just BECAUSE they're a therapist. Second and third opinions and of course, your own opinion, are just as important and share different viewpoints.",
      "created_utc": 1678091198.0,
      "score": 6,
      "context": [
        {
          "id": "jb3sayr",
          "author": "PristinePrincess12",
          "body": "Eat what you can, when you can. Doesn't matter what it is - just eat. It's better than starving. I constantly feel guilty about the fact I consume mainly sugar and I'm 6 weeks away from giving birth but then I remember to my first pregnancy when I felt so guilty to the point I didn't eat AT ALL which of course, NOT a good thing when you're growing a human. Then I'm reminded \"hey, at least you're EATING and it's not ALWAYS all sugar. You're gonna birth an average size baby rather than a worryingly small baby\" and it makes me feel better. Food is food! It's good no matter what it is! Body needs food.",
          "created_utc": 1678079871.0
        },
        {
          "id": "jb44o8l",
          "author": "NOIDEDNalyd",
          "body": "Oh, man sugar has always been an issue for me. For as long as I can remember I can't drink coffee unless it has milk and an obscene amount of sugar. Hell, I would call it an unreasonable amount of sugar because sometimes I don't stir it thoroughly and by the time I've almost finished the cup there's this thick bed of sugar at the bottom. So I didn't even enjoy most of that sugar or even notice that not all of it is mixed properly.\n\nFirst off, congrats on getting through growing another human in you. I have a hard enough time eating for myself, eating for two sounds like a nightmare and you sound pretty badass in my book for pulling it off.\n\nSecondly, your advice rings true with what I've both read and experienced. The biggest scare about finding out I have ARFID is also finding out I may have scurvy, or if not I'm definitely at high risk for it. I have this \"benign\" rash down my arms shoulders and back that's stuck with me through puberty, always thought it was just me being unlucky in the genetics department since the rash doesn't itch and isn't irritating in any way. Telling this to my therapist she suggests I immediately try to incorporate more fruits and veggies in my diet, as I'm most certainly severely lacking in vitamin c. I asked her if I can't just take vitamin c supplements and she advised against it, claiming it's better to eat foods with vitamin c as that solves several problems at once: \n\nSolves the nutritional deficiency problem.\n\nI'd be eating more food, so I'm no longer needlessly starving myself.\n\nHelps me accustom myself to eating food groups I hate.\n\nI've been trying to eat an orange a day to get that vitamin c (therapist says I should feel the effects of this nutritional intake in 2 weeks, given how long I've gone without it) and it's not been easy. I hate the fleshiness of fruits, and more so their inconsistent texture. Why do orange slices have to have this layer of flesh followed by orange juices and chunks of pulp?! It's horrible. My mom and sister haven't been the most supportive about this, claiming I'm exaggerating and should just \"get over it\" (as if I fucking want to be this way), so finding a community of like-minded individuals with the same struggles has been the best thing to come out of the diagnosis. Thank you for the advice.",
          "created_utc": 1678088851.0
        }
      ]
    },
    {
      "id": "jb52vyz",
      "author": "linx14",
      "body": "There is no fast pass to self love unfortunately. So be gentle with yourself and start with the baby steps. \n\nBut also remember your road to self love/care and peace is different from everyone else’s. Don’t conform to others standards just because it’s viewed as “normal”. That will do more harm then good.\nYour road is just starting so keep at it! I believe in you!\n\nAlso I’m stealing that quote I needed to hear that!",
      "created_utc": 1678113047.0,
      "score": 3,
      "context": [
        {
          "id": "jb2xsi6",
          "author": "NOIDEDNalyd",
          "body": "Joke's aside, this discovery has been both eye-opening and a gut punch to me for the past week. Moreso because my family has a more *conservative* attitude toward mental disorders.\n\nI've been seeing a therapist about my clusterfuck of a brain for a few months, she diagnosed me with severe ADHD (kinda saw it coming), and during one of the more question/answer style sessions, she asked me about my diet. She was a bit shocked to learn about how I eat basically no fruits or vegetables or much of anything other than the classics (chicken, potatoes, and pasta ftw) for all my 22 years of living.  That one of the things that infuriate/disgusts me the most is whenever I'm indoors and someone starts eating cooked food (couldn't they take that shit outside?!). The fact that I will (and have) literally starved myself instead of eating undesirable food. The list goes on...\n\nAfter a while, she started to tell me about ARFID. Just like my ADHD diagnosis, everything she told me about ARFID and how it works felt like such an illuminating moment. Like all the puzzle pieces of my life up to now just slid into place. In fact, she's said my ADHD also likely ties into ARFID. But right now I don't know what to do about it. She said we'll discuss treatment options at our next session but that's not for another month (finding a time when she's available and I'm not having classes is a pain in the ass).\n\nRight now I'm freaking out wondering what the next step is. It sounds weird saying it out loud (or even typing it), but all my life I've watched people eat whole plates filled with balanced meals, watched them take big spoonfuls without thinking about it, and wished I could *just* do that. I've seen shows and movies of people eating salads and non-white bread and exotic dishes and thought to myself \"That looks good, I wish I could eat that\" even though I know if those meals were magically teleported from the screen as they were right in front of me I would do what I always do. Choke down some bites, get distracted for several minutes, choke down some more, and before I know it the food has gone soggy or dry, and I've eaten less than a quarter of it, I lose my appetite and with full shame put the leftovers in the microwave, say \"I'll finish this later today\" (this is a lie, I *know* this is a goddamn lie) forget about the leftovers, then throw it all away the next morning because it got spoiled. Don't forget another healthy helping of shame I feel when I scoop the food into the garbage.\n\nWith my ADHD diagnosis, I was more relieved than scared. I got this feeling that a lot of my faults are not my own but the result of this mental disorder. I've tried treating it with the typical stuff: yoga, exercise, and meditation. None of it helped. And with the diagnosis, my therapist said she can give me a referral to a psychiatrist to get prescribed Adderal and I'm not afraid to admit I was elated. A possible solution to a lifelong problem that feels doable (hooray for drugs). But ARFID feels different.\n\nI thought, like many of you, that I was just a picky eater and I just had to \"get over\" my hang-ups. That if I choke down enough healthy diets I'll eventually enjoy it. But with this diagnosis, I felt the opposite way than how I felt getting diagnosed with ADHD. I know I haven't spoken to my therapist about treatment options, but doing my own research this feels a lot harder to solve than my ADHD.\n\nI guess what I'm wondering now is:  how do you guys cope? how did you feel getting diagnosed and how did you deal with it? do you brute force your way to a healthy diet or is there a more doable solution (doesn't *have* to be medication, but you know...it helps).\n\nIf you made it through this gargantuan wall of text, thanks for indulging me. It's 3 am, I'm too antsy to sleep, research binging and all, but I'm probably gonna tucker out soon, so if I don't respond to comments right away know that that's what I'm doing. Have a good one!",
          "created_utc": 1678064203.0
        },
        {
          "id": "jb3g5w4",
          "author": "linx14",
          "body": "The only way I’ve been able to cope was move out of my parents place and starting to feel safe. And using a therapy called neurofeedback. \n\nBut I still have problems with a lot of stuff. But giving myself the time and space not to force myself has been such a blessing. If I don’t want to eat that weird thing. Fuck that weird thing! No pressure to eat. \n\nThen taking control of the things I know I can eat. I meal prep now and only make things I can eat. Then I experiment a little when I’m feeling up to it and only when I feel ready.\n\nI make a shit tone of pasta and make panko chicken nuggets. I even buy Dino nuggets/fries. And even pizzas.\n\n\nJust eating is so much more important then focusing of eating healthy. It’s healthier to eat something then to not eat at all.",
          "created_utc": 1678073147.0
        },
        {
          "id": "jb44y98",
          "author": "NOIDEDNalyd",
          "body": "Yeah, I guess one way I definitely won't get better is by beating myself up for not immediately getting over my condition. Even though I know this, it's always nice to hear a reminder from people. Reminds me of a quote I saw on reddit, under a post about self-improvement. \n\n\"You can't hate your way into loving yourself\".\n\nThank you for the reminder, friend.",
          "created_utc": 1678089082.0
        }
      ]
    },
    {
      "id": "jb95kdn",
      "author": "Dramatic-Growth1335",
      "body": "The main benefit is the social inclusion. I can go to a restaurant now and it's likely I'll find something on the menu I'll either like or be willing to try. Whereas at 24 I had actually never even used a knife and fork at the same time 🤣 most people find that hard to believe but why would I use a knife and fork for a sandwich?",
      "created_utc": 1678186349.0,
      "score": 2,
      "context": [
        {
          "id": "jb2xsi6",
          "author": "NOIDEDNalyd",
          "body": "Joke's aside, this discovery has been both eye-opening and a gut punch to me for the past week. Moreso because my family has a more *conservative* attitude toward mental disorders.\n\nI've been seeing a therapist about my clusterfuck of a brain for a few months, she diagnosed me with severe ADHD (kinda saw it coming), and during one of the more question/answer style sessions, she asked me about my diet. She was a bit shocked to learn about how I eat basically no fruits or vegetables or much of anything other than the classics (chicken, potatoes, and pasta ftw) for all my 22 years of living.  That one of the things that infuriate/disgusts me the most is whenever I'm indoors and someone starts eating cooked food (couldn't they take that shit outside?!). The fact that I will (and have) literally starved myself instead of eating undesirable food. The list goes on...\n\nAfter a while, she started to tell me about ARFID. Just like my ADHD diagnosis, everything she told me about ARFID and how it works felt like such an illuminating moment. Like all the puzzle pieces of my life up to now just slid into place. In fact, she's said my ADHD also likely ties into ARFID. But right now I don't know what to do about it. She said we'll discuss treatment options at our next session but that's not for another month (finding a time when she's available and I'm not having classes is a pain in the ass).\n\nRight now I'm freaking out wondering what the next step is. It sounds weird saying it out loud (or even typing it), but all my life I've watched people eat whole plates filled with balanced meals, watched them take big spoonfuls without thinking about it, and wished I could *just* do that. I've seen shows and movies of people eating salads and non-white bread and exotic dishes and thought to myself \"That looks good, I wish I could eat that\" even though I know if those meals were magically teleported from the screen as they were right in front of me I would do what I always do. Choke down some bites, get distracted for several minutes, choke down some more, and before I know it the food has gone soggy or dry, and I've eaten less than a quarter of it, I lose my appetite and with full shame put the leftovers in the microwave, say \"I'll finish this later today\" (this is a lie, I *know* this is a goddamn lie) forget about the leftovers, then throw it all away the next morning because it got spoiled. Don't forget another healthy helping of shame I feel when I scoop the food into the garbage.\n\nWith my ADHD diagnosis, I was more relieved than scared. I got this feeling that a lot of my faults are not my own but the result of this mental disorder. I've tried treating it with the typical stuff: yoga, exercise, and meditation. None of it helped. And with the diagnosis, my therapist said she can give me a referral to a psychiatrist to get prescribed Adderal and I'm not afraid to admit I was elated. A possible solution to a lifelong problem that feels doable (hooray for drugs). But ARFID feels different.\n\nI thought, like many of you, that I was just a picky eater and I just had to \"get over\" my hang-ups. That if I choke down enough healthy diets I'll eventually enjoy it. But with this diagnosis, I felt the opposite way than how I felt getting diagnosed with ADHD. I know I haven't spoken to my therapist about treatment options, but doing my own research this feels a lot harder to solve than my ADHD.\n\nI guess what I'm wondering now is:  how do you guys cope? how did you feel getting diagnosed and how did you deal with it? do you brute force your way to a healthy diet or is there a more doable solution (doesn't *have* to be medication, but you know...it helps).\n\nIf you made it through this gargantuan wall of text, thanks for indulging me. It's 3 am, I'm too antsy to sleep, research binging and all, but I'm probably gonna tucker out soon, so if I don't respond to comments right away know that that's what I'm doing. Have a good one!",
          "created_utc": 1678064203.0
        },
        {
          "id": "jb45cnm",
          "author": "Dramatic-Growth1335",
          "body": "I'm 36 and brute forced it starting at around 24 years old. I'm still picky and sometimes will revert back to just sandwiches and crisps but my diet and lifestyle has VASTLY improved since I began forcing myself to try new things.\n\n I can eat anything now, doesn't mean I'll necessarily like it, but I won't gag anymore..the worst I do to myself now is psych myself out about not wanting to eat anything we have in the house and then I get all moody as I'm hungry",
          "created_utc": 1678089410.0
        },
        {
          "id": "jb464rq",
          "author": "NOIDEDNalyd",
          "body": "I felt scared wondering if this is something that will never get better but just become something I have to deal with. \n\nEat food that I need but hate and be miserable\n\nor\n\nEat mostly nothing but the unbalanced shit I've been eating and be likely even more miserable\n\nLike the Louis CK joke about as he got into his 50s, his ankles got fucked up, and his doctor said he should start doing ankle stretches every morning.\n\nLouis: \"So how long do I have to do this until I get better?\"\n\nDoctor: \"'Get better'!? No, you're on your way out, you don't 'get better', that's just something you do now. You have a shitty ankle and you have to stretch it to make it tolerably shitty. You do this every day until you die, got it?\"\n\nGlad to hear I can eventually become somewhat accustomed to eating healthier, thanks for the comment.",
          "created_utc": 1678090072.0
        }
      ]
    },
    {
      "id": "jb47rln",
      "author": "NOIDEDNalyd",
      "body": "Okay then. I guess I can take the supplements instead, sounds far more tolerable than choking down another fucking orange. I can also bring this up to her at our next session, she's a very open and comfortable person to speak to and she encourages me to do my own research and come back to her to discuss my findings.",
      "created_utc": 1678091457.0,
      "score": 2,
      "context": [
        {
          "id": "jb3sayr",
          "author": "PristinePrincess12",
          "body": "Eat what you can, when you can. Doesn't matter what it is - just eat. It's better than starving. I constantly feel guilty about the fact I consume mainly sugar and I'm 6 weeks away from giving birth but then I remember to my first pregnancy when I felt so guilty to the point I didn't eat AT ALL which of course, NOT a good thing when you're growing a human. Then I'm reminded \"hey, at least you're EATING and it's not ALWAYS all sugar. You're gonna birth an average size baby rather than a worryingly small baby\" and it makes me feel better. Food is food! It's good no matter what it is! Body needs food.",
          "created_utc": 1678079871.0
        },
        {
          "id": "jb44o8l",
          "author": "NOIDEDNalyd",
          "body": "Oh, man sugar has always been an issue for me. For as long as I can remember I can't drink coffee unless it has milk and an obscene amount of sugar. Hell, I would call it an unreasonable amount of sugar because sometimes I don't stir it thoroughly and by the time I've almost finished the cup there's this thick bed of sugar at the bottom. So I didn't even enjoy most of that sugar or even notice that not all of it is mixed properly.\n\nFirst off, congrats on getting through growing another human in you. I have a hard enough time eating for myself, eating for two sounds like a nightmare and you sound pretty badass in my book for pulling it off.\n\nSecondly, your advice rings true with what I've both read and experienced. The biggest scare about finding out I have ARFID is also finding out I may have scurvy, or if not I'm definitely at high risk for it. I have this \"benign\" rash down my arms shoulders and back that's stuck with me through puberty, always thought it was just me being unlucky in the genetics department since the rash doesn't itch and isn't irritating in any way. Telling this to my therapist she suggests I immediately try to incorporate more fruits and veggies in my diet, as I'm most certainly severely lacking in vitamin c. I asked her if I can't just take vitamin c supplements and she advised against it, claiming it's better to eat foods with vitamin c as that solves several problems at once: \n\nSolves the nutritional deficiency problem.\n\nI'd be eating more food, so I'm no longer needlessly starving myself.\n\nHelps me accustom myself to eating food groups I hate.\n\nI've been trying to eat an orange a day to get that vitamin c (therapist says I should feel the effects of this nutritional intake in 2 weeks, given how long I've gone without it) and it's not been easy. I hate the fleshiness of fruits, and more so their inconsistent texture. Why do orange slices have to have this layer of flesh followed by orange juices and chunks of pulp?! It's horrible. My mom and sister haven't been the most supportive about this, claiming I'm exaggerating and should just \"get over it\" (as if I fucking want to be this way), so finding a community of like-minded individuals with the same struggles has been the best thing to come out of the diagnosis. Thank you for the advice.",
          "created_utc": 1678088851.0
        },
        {
          "id": "jb47grx",
          "author": "PristinePrincess12",
          "body": "Not quite sure I agree with your therapist in the supplements department! Forcing yourself to eat foods you don't like is actually going to set you BACKWARD, not forward. That's like, a key component of ARFID. Take the vitamin C pills! There is nothing wrong with taking supplements and pills! The goal of this sub is encouragement and support - we don't have a \"cure\" mindset, as that can be EXTREMELY detrimental to your mental health. Your therapist sounds great but don't listen too and believe everything they say automatically just BECAUSE they're a therapist. Second and third opinions and of course, your own opinion, are just as important and share different viewpoints.",
          "created_utc": 1678091198.0
        }
      ]
    },
    {
      "id": "jb55j1x",
      "author": "NOIDEDNalyd",
      "body": "Aw thanks for the sweet words friend, they mean a great deal.\n\nPs. Steal away, and if you want more badass/insightful internet quotes check out r/StrangeInspiration and r/InternetShakespeares",
      "created_utc": 1678114237.0,
      "score": 2,
      "context": [
        {
          "id": "jb2xsi6",
          "author": "NOIDEDNalyd",
          "body": "Joke's aside, this discovery has been both eye-opening and a gut punch to me for the past week. Moreso because my family has a more *conservative* attitude toward mental disorders.\n\nI've been seeing a therapist about my clusterfuck of a brain for a few months, she diagnosed me with severe ADHD (kinda saw it coming), and during one of the more question/answer style sessions, she asked me about my diet. She was a bit shocked to learn about how I eat basically no fruits or vegetables or much of anything other than the classics (chicken, potatoes, and pasta ftw) for all my 22 years of living.  That one of the things that infuriate/disgusts me the most is whenever I'm indoors and someone starts eating cooked food (couldn't they take that shit outside?!). The fact that I will (and have) literally starved myself instead of eating undesirable food. The list goes on...\n\nAfter a while, she started to tell me about ARFID. Just like my ADHD diagnosis, everything she told me about ARFID and how it works felt like such an illuminating moment. Like all the puzzle pieces of my life up to now just slid into place. In fact, she's said my ADHD also likely ties into ARFID. But right now I don't know what to do about it. She said we'll discuss treatment options at our next session but that's not for another month (finding a time when she's available and I'm not having classes is a pain in the ass).\n\nRight now I'm freaking out wondering what the next step is. It sounds weird saying it out loud (or even typing it), but all my life I've watched people eat whole plates filled with balanced meals, watched them take big spoonfuls without thinking about it, and wished I could *just* do that. I've seen shows and movies of people eating salads and non-white bread and exotic dishes and thought to myself \"That looks good, I wish I could eat that\" even though I know if those meals were magically teleported from the screen as they were right in front of me I would do what I always do. Choke down some bites, get distracted for several minutes, choke down some more, and before I know it the food has gone soggy or dry, and I've eaten less than a quarter of it, I lose my appetite and with full shame put the leftovers in the microwave, say \"I'll finish this later today\" (this is a lie, I *know* this is a goddamn lie) forget about the leftovers, then throw it all away the next morning because it got spoiled. Don't forget another healthy helping of shame I feel when I scoop the food into the garbage.\n\nWith my ADHD diagnosis, I was more relieved than scared. I got this feeling that a lot of my faults are not my own but the result of this mental disorder. I've tried treating it with the typical stuff: yoga, exercise, and meditation. None of it helped. And with the diagnosis, my therapist said she can give me a referral to a psychiatrist to get prescribed Adderal and I'm not afraid to admit I was elated. A possible solution to a lifelong problem that feels doable (hooray for drugs). But ARFID feels different.\n\nI thought, like many of you, that I was just a picky eater and I just had to \"get over\" my hang-ups. That if I choke down enough healthy diets I'll eventually enjoy it. But with this diagnosis, I felt the opposite way than how I felt getting diagnosed with ADHD. I know I haven't spoken to my therapist about treatment options, but doing my own research this feels a lot harder to solve than my ADHD.\n\nI guess what I'm wondering now is:  how do you guys cope? how did you feel getting diagnosed and how did you deal with it? do you brute force your way to a healthy diet or is there a more doable solution (doesn't *have* to be medication, but you know...it helps).\n\nIf you made it through this gargantuan wall of text, thanks for indulging me. It's 3 am, I'm too antsy to sleep, research binging and all, but I'm probably gonna tucker out soon, so if I don't respond to comments right away know that that's what I'm doing. Have a good one!",
          "created_utc": 1678064203.0
        },
        {
          "id": "jb3g5w4",
          "author": "linx14",
          "body": "The only way I’ve been able to cope was move out of my parents place and starting to feel safe. And using a therapy called neurofeedback. \n\nBut I still have problems with a lot of stuff. But giving myself the time and space not to force myself has been such a blessing. If I don’t want to eat that weird thing. Fuck that weird thing! No pressure to eat. \n\nThen taking control of the things I know I can eat. I meal prep now and only make things I can eat. Then I experiment a little when I’m feeling up to it and only when I feel ready.\n\nI make a shit tone of pasta and make panko chicken nuggets. I even buy Dino nuggets/fries. And even pizzas.\n\n\nJust eating is so much more important then focusing of eating healthy. It’s healthier to eat something then to not eat at all.",
          "created_utc": 1678073147.0
        },
        {
          "id": "jb44y98",
          "author": "NOIDEDNalyd",
          "body": "Yeah, I guess one way I definitely won't get better is by beating myself up for not immediately getting over my condition. Even though I know this, it's always nice to hear a reminder from people. Reminds me of a quote I saw on reddit, under a post about self-improvement. \n\n\"You can't hate your way into loving yourself\".\n\nThank you for the reminder, friend.",
          "created_utc": 1678089082.0
        },
        {
          "id": "jb52vyz",
          "author": "linx14",
          "body": "There is no fast pass to self love unfortunately. So be gentle with yourself and start with the baby steps. \n\nBut also remember your road to self love/care and peace is different from everyone else’s. Don’t conform to others standards just because it’s viewed as “normal”. That will do more harm then good.\nYour road is just starting so keep at it! I believe in you!\n\nAlso I’m stealing that quote I needed to hear that!",
          "created_utc": 1678113047.0
        }
      ]
    },
    {
      "id": "jb5a8sy",
      "author": "Ajishly",
      "body": "Yo, as soon as I read your \"I don't eat fruits or vegetables\" with the exception of potatoes, I immediately thought scurvy. Potatoes contain vitamin C, but if it is your only source of vitamin C (depending on how much you eat/how you prepare the potatoes), it probably isn't enough to keep your vitamin C levels high enough that you weren't mildly deficient. \n\nMy diet was the same, also with copious amounts of sugar... I decided to eat healthier because I needed to lose weight, so I cut out potatoes and frozen pizza, aka my only sources of vitamin C. \n\nI ended up developing latent scurvy and then manifest scurvy. Fun fact, the first symptoms of scurvy tend to be neuropsychiatric; depression and kind of hyperchondria/health anxiety. Your body knows something is wrong, but when you're begging for help from your doctor... the depression and hyperchondria put you on the \"psych patient\" pipeline, and the doctor assumes everything is in your head. \n\nSupplement the vitamin C as well as eating what fruits you can, your body needs it, and like... an anorexic patient being given Ensure (nutritional drink) when unable to finish their meal... to ensure they meet their caloric needs, you should be taking vitamin C to ensure you meet your nutritional needs. They wouldn't (shouldn't) deny a patient with an eating disorder (ED) adequate nutrition if that ED was anorexia/bulimia, especially telling them \"ok but like just eat?\", they sure as fuck shouldn't be doing this with ARFID. \n\nSupplementing vitamin C actually helped my obscene sugar cravings too. It gave me energy to function (and make better dietary choices), cleared up the rashes I've had most of my life... the constant joint pain? It's still there after 4 weeks, but I don't need painkillers as much... oh, and wounds are healing again, like properly healing, not just kind of healing and then reopening and then ...repeat for months. Like an ingrown hair I picked out (scurvy messes with hair follicles), it had been trying to heal for 4 months. I wasn't that rough... it has finally healed now.\n\nSorry, I kind of ended up ranting, but tl;dr - Supplement vitamin C, scurvy fucking sucks!",
      "created_utc": 1678116258.0,
      "score": 2,
      "context": [
        {
          "id": "jb3sayr",
          "author": "PristinePrincess12",
          "body": "Eat what you can, when you can. Doesn't matter what it is - just eat. It's better than starving. I constantly feel guilty about the fact I consume mainly sugar and I'm 6 weeks away from giving birth but then I remember to my first pregnancy when I felt so guilty to the point I didn't eat AT ALL which of course, NOT a good thing when you're growing a human. Then I'm reminded \"hey, at least you're EATING and it's not ALWAYS all sugar. You're gonna birth an average size baby rather than a worryingly small baby\" and it makes me feel better. Food is food! It's good no matter what it is! Body needs food.",
          "created_utc": 1678079871.0
        },
        {
          "id": "jb44o8l",
          "author": "NOIDEDNalyd",
          "body": "Oh, man sugar has always been an issue for me. For as long as I can remember I can't drink coffee unless it has milk and an obscene amount of sugar. Hell, I would call it an unreasonable amount of sugar because sometimes I don't stir it thoroughly and by the time I've almost finished the cup there's this thick bed of sugar at the bottom. So I didn't even enjoy most of that sugar or even notice that not all of it is mixed properly.\n\nFirst off, congrats on getting through growing another human in you. I have a hard enough time eating for myself, eating for two sounds like a nightmare and you sound pretty badass in my book for pulling it off.\n\nSecondly, your advice rings true with what I've both read and experienced. The biggest scare about finding out I have ARFID is also finding out I may have scurvy, or if not I'm definitely at high risk for it. I have this \"benign\" rash down my arms shoulders and back that's stuck with me through puberty, always thought it was just me being unlucky in the genetics department since the rash doesn't itch and isn't irritating in any way. Telling this to my therapist she suggests I immediately try to incorporate more fruits and veggies in my diet, as I'm most certainly severely lacking in vitamin c. I asked her if I can't just take vitamin c supplements and she advised against it, claiming it's better to eat foods with vitamin c as that solves several problems at once: \n\nSolves the nutritional deficiency problem.\n\nI'd be eating more food, so I'm no longer needlessly starving myself.\n\nHelps me accustom myself to eating food groups I hate.\n\nI've been trying to eat an orange a day to get that vitamin c (therapist says I should feel the effects of this nutritional intake in 2 weeks, given how long I've gone without it) and it's not been easy. I hate the fleshiness of fruits, and more so their inconsistent texture. Why do orange slices have to have this layer of flesh followed by orange juices and chunks of pulp?! It's horrible. My mom and sister haven't been the most supportive about this, claiming I'm exaggerating and should just \"get over it\" (as if I fucking want to be this way), so finding a community of like-minded individuals with the same struggles has been the best thing to come out of the diagnosis. Thank you for the advice.",
          "created_utc": 1678088851.0
        },
        {
          "id": "jb47grx",
          "author": "PristinePrincess12",
          "body": "Not quite sure I agree with your therapist in the supplements department! Forcing yourself to eat foods you don't like is actually going to set you BACKWARD, not forward. That's like, a key component of ARFID. Take the vitamin C pills! There is nothing wrong with taking supplements and pills! The goal of this sub is encouragement and support - we don't have a \"cure\" mindset, as that can be EXTREMELY detrimental to your mental health. Your therapist sounds great but don't listen too and believe everything they say automatically just BECAUSE they're a therapist. Second and third opinions and of course, your own opinion, are just as important and share different viewpoints.",
          "created_utc": 1678091198.0
        },
        {
          "id": "jb47rln",
          "author": "NOIDEDNalyd",
          "body": "Okay then. I guess I can take the supplements instead, sounds far more tolerable than choking down another fucking orange. I can also bring this up to her at our next session, she's a very open and comfortable person to speak to and she encourages me to do my own research and come back to her to discuss my findings.",
          "created_utc": 1678091457.0
        }
      ]
    }
  ]
}