{
  "id": "11xts91",
  "subreddit": "ARFID",
  "author": "Smorg125",
  "created_utc": 1679431319.0,
  "title": "Does anyone else wish they could just push a button and never need to worry about nutrition and calories again?",
  "selftext": "My (26m) entire life I’ve just lived off of processed junk. I’m like 5’10 and only weigh 140 on a good day. Never had a good relationship with eating, like not only do I eat nothing but shit (cookies, chips, etc.), but I also just hate eating. It feels like a chore and I don’t even really feel hunger anymore, which I’m assuming I am like 24/7.\n\nMy day to day is basically just Oreos and milk a couple times a day, Doritos for lunch, sometimes other salty snacks throughout the day. Occasionally ill drink a mass gainer, but I can never be consistent with it. I fucking hate every bit of it. From going to the grocery store and loading a basket up with this shit every week and people making jokes about it, to going to drive thrus and just ordering fries and having to hear the “that’s all?” I dread going out to eat with people because it feels like everyone’s judging me. I hated being dragged to restaurants when I was younger because I just feel alienated watching everybody eat while the entire fucking menu is unpalatable to me. I at least feel comfortable around friends, but my family just doesn’t get it and never offer anything constructive, and everything they say is criticizing me. \n\n\nI’ve been to four therapists at this point, and it’s helped me the square root of fuck all. Finally found a program that may be able to help, but it’s a 6 month wait and I’m kinda gatekept by needing a primary care physician in their hospital to be eligible for it, which I can do, but it’s an additional step. Did I also mention I’m petrified of hospitals? I can deal with it for a doctors appointment, but this is definitely gonna land me in the hospital at some point at this rate, and that just fuels my anxiety. I’ve never had blood drawn, and I already know if they need to for this program I’m gonna bail. I want to get better and finally feel like I’m gonna have the drive to do it this time, but I feel like there’s always some shit that’s gonna come up. Anxiety has been taking over my life lately.\n\nTrauma dump over, thanks for reading this far.",
  "url": "https://www.reddit.com/r/ARFID/comments/11xts91/does_anyone_else_wish_they_could_just_push_a/",
  "score": 168,
  "num_comments": 18,
  "comments": [
    {
      "id": "jd540wn",
      "author": "None",
      "body": "I relate to it feeling like a chore.",
      "created_utc": 1679436430.0,
      "score": 22,
      "context": []
    },
    {
      "id": "jd5ksga",
      "author": "houinky",
      "body": "100%\nI typically only eat beige/processed foods, it hasnt really affected me until the past few years, i always feel bloated and sluggish, i can only eat peas and broccoli in terms of veg, and i cant eat any fruit at all, i just want to be able to eat normally so i can feel better :(",
      "created_utc": 1679443413.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jd59aty",
      "author": "DeificClusterfuck",
      "body": "Depends \n\n\nIf I think too long about the actual process of consuming food, I get nauseous because to me it's really disgusting.",
      "created_utc": 1679438616.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jd5qzkw",
      "author": "None",
      "body": "Feel that. In those polls they ask which you’d go without: “bathroom, exercise, sleeping, eating…” and I always go for eating, which is usually the least chosen option.  \n\nStill waiting on meal-replacement capsules to be invented so I can rid myself of eating forever",
      "created_utc": 1679446131.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jd6o5zu",
      "author": "None",
      "body": "For years and years and years I’ve fantasized with being able to photosynthesize. I totally feel your post - I also hate everything about eating and find it a really burdensome chore. I’m sorry that you struggle this hard too!",
      "created_utc": 1679463834.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jd54t3m",
      "author": "BringMeYourBullets",
      "body": "I'm on my way to bed now, so I probably won't answer until I wake up, but you're welcome to DM me.\n\nI have been in ED-specialized therapy for more than a year. I'm 27 and I have been feeling a lot like you do, some of it I still battle. I would be happy to share some things.\n\nAnd yes, I would love fore there to be a magical food that contained everything my body needs in a small portion that I can easily overcome.",
      "created_utc": 1679436745.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jd4s3tu",
      "author": "AlphaFoxZankee",
      "body": "That's a complicated situation to be in, power to you",
      "created_utc": 1679431857.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jd5yg3o",
      "author": "Bambi7R21",
      "body": "It would be awesome to just push a button and my body would have everything it needs to function properly. I'm 22 and I too mostly just eat junk food. If you don't really get hungry, you could ask your doctor to prescribe you something. I can only eat grilled cheese and frozen pizzas everyday and I hate it too. Because I really want to be able to eat other foods but I can't. \n\nAt least right now I can't eat new foods but here soon I'm going to be in an intensive outpatient program. Because I need to really gain weight and get the vitamins and minerals my body needs. When someone in my family takes the rest of the family to restaurants I know how you feel. I never eat anything when I'm at a restaurant because I know there is nothing I like. But my sister always tells me to try something. \n\nSo I usually get chicken or pizza but most of the time I don't like, so I feel bad about ordering it. Because it cost them money for me to try it and almost all the time I don't like it. The only restaurants I like are McDonald's, KFC, Papa John's, and Little Caesars. And I only like a few things from each. For McDonald's only fries, ice cream, and their water, it is the only water I can drink.\n\n For Papa John's pizza and Little Caesars bread sticks. And for KFC mashed potatoes and popcorn chicken and I also like their chicken like the big pieces but haven't eaten that in so many years. My family doesn't understand either about my eating disorder. One of my sister's tells me to just try new foods but it's harder then she thinks it is. And I haven't told most of my family because I know they will say the same things my sister does. My mom, dad, and one of my brothers knows I need help and don't really/not at all tell me that I need to try new foods.\n\nThat sounds horrible having to go to 4 different therapists and get like no where. I know somewhat how that feels but not with therapists but with surgeons and my insurance company. It probably feels like you are getting no where after years of trying. Because that's how it feels for me. It's great that you found a program to help you.\n\n But it sounds like you won't be happy in that program because it seems like it is an inpatient program. And you said you don't like hospitals but if it helps then that's awesome. I don't know if this would be better or not for you but have you heard of an intensive outpatient program? That is the kind of program I'm gonna do because it works for me. I don't want to be like locked in a place I don't know and I don't want to be away from home. I hope the program helps you when you can get in it.",
      "created_utc": 1679449434.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jd92sup",
      "author": "None",
      "body": "I feel you 10000%, this is my exact struggle. Eating is an inconvenience to me, especially if its not something I really enjoy like pizza or cake. I found out about an antidepressant called Remeron that supposedly helps increase hunger and my dr let me try it. It has helped me so so much with hunger and bc of that, I feel more inclined to eat things that I’m not as excited about. I also did a residential program which helped me a lot and its not a hospital setting! The only thing is you are living in a home but after residential I did PHP. Its like residential except you dont live there",
      "created_utc": 1679510000.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jd9o01j",
      "author": "samthedeity",
      "body": "I’d just buy the flavourless soylent meal replacer thing and be done with it if it wasn’t so much money. As it is now I’m literally triggering my stomach condition because the only things that are edible to my brain are cookies and puddings and other soft, beige and usually high in fat/carb food. I can only eat certain veggies and only when my brain wants that specific veggie. Like I have a cucumber in the fridge but unless my brain goes ooh we should eat the cucumber for supper, I won’t eat it.",
      "created_utc": 1679518023.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jd9pyhl",
      "author": "SB_Wife",
      "body": "I'm in a similar boat, I eat the few same foods and I just wish I could have a complete nutritional capsule or drink (or kibble to be fun!) because eating is such a chore.\n\nPeople look at me and because I'm fat they assume I love to eat, but I honestly find it such an effort most days. The only time it's not is when I'm high but tbh I still don't enjoy it, it's just easier if that makes sense.",
      "created_utc": 1679518781.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jdafgfj",
      "author": "Dramatic-Growth1335",
      "body": "I used to feel that way and wished for a pill instead. Sounds like you are pretty much rock bottom. I was at a similar age when I had enough of feeling like shit, looking pale and skinny, not being able to take a girl to a restaurant and after watching a UK show called \"freaky eaters\" where the guy had the same name as me and they got him to eat a salad I was like fuck it. Forced myself to nibble on new food and after about 10years I can eat fairly normally now/ no longer really give food a thought or have a general malaise about it.\n\nThe only thing that worked for me was exposure. Repeated exposure. This led to me developing a taste for stuff. It's scary but it's a hurdle in life to overcome \nI asked for help from friends and they would cook me meals. Only a few times tho because when they asked if I liked it I would always say no 🤣",
      "created_utc": 1679529272.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jdav5k4",
      "author": "GentleObsession",
      "body": "When I was in middle school we had a project where we had to come up with a new product or invention. You know what mine was? A pill that would give you all the necessary vitamins/calories because even then I wished I could avoid food and knew I wasn't getting everything I needed to be healthy. I can basically only eat nothing but crap like you and I definitely feel the adverse effects of such a diet now that I am in my 30s.",
      "created_utc": 1679536088.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jdb2dno",
      "author": "Agreeable_Tale1305",
      "body": "If it helps at all, I think they say at the drive-thru \"that all?\" to  everybody. I think they say it to get you to order more and upsell. They say it to me even when I'm ordering for four people.",
      "created_utc": 1679539355.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jigq78c",
      "author": "PatrioticGrandma420",
      "body": "google 'Soylent'",
      "created_utc": 1682966607.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jd9pn40",
      "author": "SB_Wife",
      "body": "I tell everyone I want people kibble to be invented.",
      "created_utc": 1679518658.0,
      "score": 2,
      "context": [
        {
          "id": "jd5qzkw",
          "author": "None",
          "body": "Feel that. In those polls they ask which you’d go without: “bathroom, exercise, sleeping, eating…” and I always go for eating, which is usually the least chosen option.  \n\nStill waiting on meal-replacement capsules to be invented so I can rid myself of eating forever",
          "created_utc": 1679446131.0
        }
      ]
    },
    {
      "id": "jdado8b",
      "author": "Dramatic-Growth1335",
      "body": "My mates dad used to say I must photosynthesize as I didnt eat fuck all",
      "created_utc": 1679528510.0,
      "score": 2,
      "context": [
        {
          "id": "jd6o5zu",
          "author": "None",
          "body": "For years and years and years I’ve fantasized with being able to photosynthesize. I totally feel your post - I also hate everything about eating and find it a really burdensome chore. I’m sorry that you struggle this hard too!",
          "created_utc": 1679463834.0
        }
      ]
    },
    {
      "id": "jdavaeq",
      "author": "GentleObsession",
      "body": "I tried the Soylent thinking I could eat the cost if it made things easier and was healthy but I just couldn't stomach it. They're definitely not for everyone.",
      "created_utc": 1679536148.0,
      "score": 1,
      "context": [
        {
          "id": "jd9o01j",
          "author": "samthedeity",
          "body": "I’d just buy the flavourless soylent meal replacer thing and be done with it if it wasn’t so much money. As it is now I’m literally triggering my stomach condition because the only things that are edible to my brain are cookies and puddings and other soft, beige and usually high in fat/carb food. I can only eat certain veggies and only when my brain wants that specific veggie. Like I have a cucumber in the fridge but unless my brain goes ooh we should eat the cucumber for supper, I won’t eat it.",
          "created_utc": 1679518023.0
        }
      ]
    }
  ]
}