{
  "id": "12aa6fa",
  "subreddit": "ARFID",
  "author": "DzRythen",
  "created_utc": 1680498471.0,
  "title": "Why do people look down on picky eating so much?",
  "selftext": "Just saw a post on AITA asking if it was wrong that they don't take their girlfriend to nice restaurants because of her extremely limited diet. The entire comment section is people saying how immature and rude she's being because of her diet and that he should just dump her because of this issue. Just calling her a child in general and judging her. \n\nWho gives a shit? Why do people care so much about us eating simpler food? It's like someone being a \"picky eater\" as it were suddenly gives people the license to look down on and patronize them. So frustrating, how about they don't judge others when they have no idea what's going on with them?",
  "url": "https://www.reddit.com/r/ARFID/comments/12aa6fa/why_do_people_look_down_on_picky_eating_so_much/",
  "score": 357,
  "num_comments": 62,
  "comments": [
    {
      "id": "jerrbym",
      "author": "None",
      "body": "As soon as I saw that post I was like, “Oh god, I know *exactly* how this comments section is gonna go.” People really take others’ picky eating so personally. It’s frustrating.",
      "created_utc": 1680518536.0,
      "score": 215,
      "context": []
    },
    {
      "id": "jereqvr",
      "author": "Selphie12",
      "body": "I agree, and honestly fuck those commenters. I think it's hard enough living withit without others judging, because I don't thik other people realise how much of human society is built around food. You go to dinner with friends, every major holiday involves specific food, I sometimes worry i might offend someone from a different culture because as much as I'd like to try other foods, I don't eat fish or spices or meat of any kind, and too much of other cultures dishes involve those three things.\n\nI don't know if it's just that people don't recognise it's a proper disorder, but I always dread having to explain to people about my diet. I always circle back to that lady from My Strange Addiction with the French Fries. She was the butt of the joke for so many react channels, and I can recognise that objectively, eating a blue french fry and crying over it is a bit silly, but I knew exactly what she was going through, and it's kinda hard to see that if you haven't lived through it I think.",
      "created_utc": 1680507356.0,
      "score": 121,
      "context": []
    },
    {
      "id": "jermfup",
      "author": "jizzyjazz2",
      "body": "word of advice. the entire AITA subreddit is pretty much exclusively assholes giving advice to mostly non-assholes. it's a pretty crappy subreddit and you shouldn't mind them",
      "created_utc": 1680514435.0,
      "score": 83,
      "context": []
    },
    {
      "id": "jerpcwa",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1680516963.0,
      "score": 60,
      "context": []
    },
    {
      "id": "jers063",
      "author": "mcsnugget",
      "body": "Just saw that one too, immediately sympathized with the GF. I understand how frustrating it can be for the other party, but it’s also frustrating when your body/brain just *will not* allow you to eat and enjoy so many  “normal” things.",
      "created_utc": 1680519043.0,
      "score": 42,
      "context": []
    },
    {
      "id": "jes05eo",
      "author": "grimmistired",
      "body": "Luckily there were some comments pretty high up mentioning ARFID and sticking up for her",
      "created_utc": 1680524360.0,
      "score": 43,
      "context": []
    },
    {
      "id": "jes8w91",
      "author": "BringMeYourBullets",
      "body": "My personal theory is that it's about people having had to go through childhoods with parents that forced them to eat something they slightly disliked and since they managed, anyone can manage too. Problem is that they don't realize there's a big difference between slightly not liking something and having a literal eating disorder.",
      "created_utc": 1680528948.0,
      "score": 32,
      "context": []
    },
    {
      "id": "jes1y2z",
      "author": "gadenmints",
      "body": "I hate how people think that going through poverty should've \"broken\" me of the \"habit\". but in fact it made my picky eating much much worse.",
      "created_utc": 1680525380.0,
      "score": 30,
      "context": []
    },
    {
      "id": "jest80q",
      "author": "giraffemoo",
      "body": "Because to \"normal\" people, food is \\*everything\\*. I literally got the ban hammer from a parenting group because I had the audacity to tell a parent of picky eaters that ARFID was a thing and that it doesn't feel good to be forced to eat things that you don't want to eat. I have a seriously messed up relationship with food as an adult because of the things that were done to me under the guise of \"healthy child rearing\".",
      "created_utc": 1680537664.0,
      "score": 29,
      "context": []
    },
    {
      "id": "jesfzs0",
      "author": "Ananyako",
      "body": "Saw the post too, It really is humiliating seeing what other people think of us.",
      "created_utc": 1680532174.0,
      "score": 21,
      "context": []
    },
    {
      "id": "jet2zu5",
      "author": "beeniecal",
      "body": "People think it’s a choice. That’s the knowledge gap. When I explained to my mother that I could see the fear in my kid’s face and how they burst into tears when faced with some foods she was finally able to begin to understand that this was not a choice and, in fact, was a heavy burden on the kid.",
      "created_utc": 1680541537.0,
      "score": 17,
      "context": []
    },
    {
      "id": "jesiiam",
      "author": "Duke_of_Babble",
      "body": "I find this is true with so many things. If people don't understand whatever the topic is, or haven't gone through it themselves, they have no sympathy or basic human decency.  I see a ridiculous amount of it in conversations about gender, politics, health care issues...the list could go on. There will always be someone out there who looks down on you for something simply because they don't understand, or refuse to learn. Only thing that helps me in those aspects is to limit my social media to pages or groups I know aren't full of trash people. I avoid comment sections on Facebook about issues I know will just made me sad to see the responses.",
      "created_utc": 1680533254.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jesgs9x",
      "author": "angeltay",
      "body": "Here’s the thing- those of us with ARFID, we have an eating disorder. It’s not the same as anorexia or bulimia, but it effects our lives similarly. People without eating disorders will not understand that. People who are not neurodivergent will not understand that. I refuse to feel bad for having an eating disorder, especially because I try to find something I can eat everywhere I’m taken out to eat, and I make my own safe foods at home if everyone is having a meal I don’t want. I will not feel bad for being different. \n\nYou should not feel bad for being different. None of us should. Those commenters do not understand what it’s like to be viscerally disgusted by the taste, texture, look, or smell of certain foods. Lucky them. That’s why we can’t take the shit they say to heart. Because unless they meet someone with ARFID and take the time to understand it, they will never care and always see us as “picky eaters” with the “palate of a toddler,” no matter what we do or don’t eat. I have even replied to AITA posts like that one speaking up about ARFID, and I just get downvoted. So fuck those people. They are in denial that ARFID exists and is a valid medical diagnosis. \n\nWe can’t give a shit about what they say, they’re ignorant. What we struggle with is real, and I know this subreddit, we’re all trying our best. We’re here to have each other’s backs and try to overcome. I see so many posts about y’all trying new foods, or starting treatment, or looking for resources to help yourself. Fuck those people. We got each other here. I love y’all and I’m proud of y’all.",
      "created_utc": 1680532521.0,
      "score": 23,
      "context": []
    },
    {
      "id": "jet83ki",
      "author": "Molikvs",
      "body": "Saw the post too!! One thought I had was regarding how she was excited about a new restaurant… and did no one consider she’s excited for HIM to try it? \n\nI’m a picky eater but my BF loves ALL types of food. Even if they won’t have much for me at some places, I love to go with him and see his face light up trying new foods. I also keep a running list of places with the best and worst chicken tenders. Like come on, we made it fun no matter what!",
      "created_utc": 1680543540.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jesg4pa",
      "author": "AFreshlySkinnedEgg",
      "body": "I saw the exact same post. And while it may be annoying for her to expect him to pay for marked up versions of something they could eat at home he was so aggressive and resentful of her over her limited diet. The language he used to describe her was disgusting comparing her to a child for having a limited diet.",
      "created_utc": 1680532233.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jetz2sc",
      "author": "gillebro",
      "body": "Eugh, mate, I’ve seen posts like that on AITA before and they are disgusting.\n\nHow fucking hypocritical, calling people with limited diets immature and rude. THEY’RE the ones being immature and rude. Why the hell does it MATTER if somebody only eats toast and chips? How does that in any way affect them?\n\nI’m not an ARFID sufferer myself, but my partner is, and it pisses me off to no end when I see shit like that. My partner is an intelligent, hard-working, compassionate and talented woman, and going to restaurants is like torture for her because she knows she’s going to be judged for eating chicken nuggets and chips every time.",
      "created_utc": 1680554099.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jerhfqd",
      "author": "bumbumbooo",
      "body": "I just saw the post and the thing is it’s valid from both sides. Like I have afrid and i wouldn’t want to go to Chinese restaurants if I’m going to just get fries and not their signature food? The OP was right in a way where it didn’t even make sense for him why she would want to even go there in the first place. But she probably just enjoys going out to check new places and going out which is soooo fine and she has every  right to do so. \n\nBut him getting upset with her about her food choices is so weird ? And telling her she eats like a child is super disrespectful and I would dump him if I was the girl tbh. I grew up in a family that never validated or respected my afrid and it honestly hurt me so much. I really feel for the girlfriend and I would hate it if my partner hated me for that. It’s obvious they are not compatible and if he truly loved or cared for her he would do it a a genuine gentle way. He could educate himself about picky eating , talk to her more and try to understand why shes feel this way.  He was getting fed up with for a while until he exploded. He could’ve handled it so much better and actually had a proper conversation with understanding and compassion. Which he doesn’t seem to have any towards her. \n\nHe hasn’t really shown any concern for her health and the fact she might not even get nutritional value or anything. He seems too focused on the fact she’s “wasting “his money by buying food he doesn’t approve at restaurants.\n\nThe girlfriend may have afrid (high possibility) and her boyfriend acting this way is such a red flag. The way he handled the whole situation is wrong. She hasn’t really done anything wrong because he never talked to her about it. He just let it build up. I wouldn’t be surprised if her boyfriend doesn’t like her anymore. i think if he genuinely loved her, I don’t think he would see her that way and say that stuff.\n\nIt lowkey makes me scared and sad if my significant other ever thought of me like that. They really have no idea how difficult it is to be us and what we go through. I went through a lot of pain from family treating me this way, when they truly have no idea how mentally challenging it was to even think about trying new food.\n\nAs for the comments it’s sadly expected , people hate us so much and I just don’t understand why??  \nLike Why does it bother them so much what we eat. I wish they showed genuine concern or questions instead of straight up bullying and belittling. It’s so mean and it speaks so much about their character. And what if someone is just a picky eater?? Why is that a problem I don’t understand…  I guess it is when people make food their personality that behave like this . It’s just rlly not that serious. Ppl r just bullies and like to force ppl to do things they don’t want to do :)\n\nOP and his girlfriend are just not Compatible   or he has lost feelings. Like since he’s a foodie and she’s a picky eater and no honest communication… it was bound to crash.",
      "created_utc": 1680509801.0,
      "score": 24,
      "context": []
    },
    {
      "id": "jet1w3w",
      "author": "emptyhellebore",
      "body": "I don’t get it either.  People can get so bent out of shape over it. And then they wonder why people have eating disorders. What a mystery!",
      "created_utc": 1680541106.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jet6i42",
      "author": "Lemortheureux",
      "body": "To others it's so easy that they don't understand why anyone would not be able to do something. \n\nYou see this a lot when someone is obese with mobility issues, people will assume obesity caused the mobility issues and all they need to do is eat less and work out. Often it's the other way around and pain or illness will reduce mobility and cause weight gain. We don't know people's lives and struggles, it's always best to assume the best out of people. I do think most people genuinely try their best.",
      "created_utc": 1680542919.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jevfepq",
      "author": "FunnelCakeGoblin",
      "body": "Definitely made me sad. I pretty much only eat chicken. Luckily, I can eat more than chicken tenders, but still. Just chicken. I asked my husband if that bothered his that we go out to fancy places or steakhouses and I just get chicken, and he said he loves it because it’s cheaper. 😂 And he doesn’t care as long as I’m happy.",
      "created_utc": 1680576778.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jetxqau",
      "author": "None",
      "body": "That post and its comments really upset me, especially on Autism Appreciation Day/Month. This is exactly the problem.",
      "created_utc": 1680553575.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jeuss4p",
      "author": "_VLW_",
      "body": "I would be devastated to find out if this was my bf posting it….he’s expressed recently how he’s upset that I don’t go out with his friends if they’re eating :/",
      "created_utc": 1680566610.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jetlpsv",
      "author": "MrPureinstinct",
      "body": "I stopped reading posts like this on AITA because almost everyone who comments on the post are assholes themselves.   \n\n\nOutside of stupid internet comments I think some people are just jerks who think everyone should be just like them and some people are too worried about what is dictated as \"normal\" to let people be different than them.   \n\n\nIt always makes me angry when people get down on picky eating but can immediately point out a food they don't like. It's not the exact same, but dude obviously we all have things we like and do not like. For some of us we can't control it.",
      "created_utc": 1680548872.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jeu1nu2",
      "author": "Dizzymo",
      "body": "That post was how I found out about ARFID being a thing. I was like \"haha that's totally me\" and then someone in the comments section mentioned it. Big thank you to that person.",
      "created_utc": 1680555097.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jeuuwsf",
      "author": "lily_fairy",
      "body": "glad im not on that sub. honestly most mainstream subs are filled with ableist assholes so i try to just stick to support groups or super wholesome groups. sadly people in real life can be just as bad. i remember hating parties and family gatherings as a kid because i knew people would tease me or even harass me about whatever i was eating.\n\nit's gotten better for me recently only because i now have celiac disease and can't eat gluten. people seem to respect celiac more than arfid. but it shouldn't be that way. arfid is just as real as celiac. they are both medical issues. people fucking suck.",
      "created_utc": 1680567526.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jeuwk8n",
      "author": "APleasantMartini",
      "body": "It's like job hunting.\n\nIf it's not backbreaking labor, it's not a real job.\n\nIf it's picky eating, it's childish.",
      "created_utc": 1680568235.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jevot4p",
      "author": "Disastrous_Bus1904",
      "body": "posts like that genuinely hurt me. it sucks that people see us as seemingly little spoiled kids. reminds me that arfid really isn’t well known at all",
      "created_utc": 1680581754.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jetcu1i",
      "author": "None",
      "body": "People generally don't mind their own business. I always say - if you can't help or say something nice - do and say nothing.",
      "created_utc": 1680545377.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jeubub5",
      "author": "bobainwonderland",
      "body": "Some guy commented on my post on that thread saying we needed to get over ourselves. Sir, if I could, I would. I would happily not burst into tears for wanting to throw up after one bite of a normally-safe food like I did Saturday night. Super thankful for my partner who understood and tried his hardest to help me through it and offer me alternatives",
      "created_utc": 1680559249.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jetr5cw",
      "author": "_FirstOfHerName_",
      "body": "She was demanding to go to a fancy expensive restaurant and said she was going to order chicken tenders she could have just as easily anywhere else. I think that was the issue more than her restricted diet from the OPs view, most of what they were talking about was valid frustration. I describe my own eating by saying \"I eat like a toddler,\" and literally this minute my SIL is messaging because I'm going to a family meal and her stepmum is worried about catering to me. \n\nBut who here is demanding to be wined and dined like the OPs girlfriend is? It's weird to have a restricted diet and expect to go to a fancy place, that's most of our worst nightmares. I'm in recovery and I still wouldn't dare step foot in a posh eatery.",
      "created_utc": 1680551017.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jeu30qa",
      "author": "Anonymousherelol",
      "body": "It soooo frustrating reading those comments. It’s like people hate nothing more than someone who’s a picky eater",
      "created_utc": 1680555621.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jeu4aau",
      "author": "Anonymousherelol",
      "body": "Just want to say I appreciate everyone who comments on here and is so supportive 🥲 this helpful thread really has made me cry and realize that we all have each others back and those who care will try to understand us vs those who will never attempt to make the effort to know the slightest bit about AFRID. I’m grateful for this subreddit ❤️",
      "created_utc": 1680556127.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jeummyx",
      "author": "bonedevourer",
      "body": "Just saw that! It’s horrible. It’s like people have this superiority complex over us.",
      "created_utc": 1680563930.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l8hlef7",
      "author": "Sorry_Juggernaut1136",
      "body": "Why I take it personally is because we can never just go eat “anywhere”, then there is the whole difficult ordering of the picky eater…while I’m just thinking “grow up, stop eating like a 6 yr old, already”. Sure there are occasional foods that  I don’t care for, I just flick it out of the way. ",
      "created_utc": 1718314144.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jeun9fj",
      "author": "thinkinonsomething",
      "body": "I agree. Like, why are you angry because I eat simple food? If u r not the picky eater, then there's nothing that affects you, so leave me alone, you can eat whatever you want as I can eat whatever you want and it shouldn't be a problem :/",
      "created_utc": 1680564193.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jewt8nk",
      "author": "None",
      "body": "I’ve always heard….”People are starving in other countries or people telling me I’m looking for attention or that I’m dramatic.” None of that makes me any less picky though lol",
      "created_utc": 1680612191.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kctzstr",
      "author": "SaraKatBoulder",
      "body": "I feel they are uneducated and pedestrian",
      "created_utc": 1702251439.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jes32k7",
      "author": "Apprehensive_Suit782",
      "body": "once saw a post about autistic people talking about being picky, one of the comments with the highest like count was talking about how they just can't respect since they find it annoying. incredibly frustrating.",
      "created_utc": 1680525990.0,
      "score": 80,
      "context": [
        {
          "id": "jerrbym",
          "author": "None",
          "body": "As soon as I saw that post I was like, “Oh god, I know *exactly* how this comments section is gonna go.” People really take others’ picky eating so personally. It’s frustrating.",
          "created_utc": 1680518536.0
        }
      ]
    },
    {
      "id": "jesh6ji",
      "author": "angeltay",
      "body": "That’s why I personally did not even click on it from the title. It’d just make me angry and sad.",
      "created_utc": 1680532690.0,
      "score": 30,
      "context": [
        {
          "id": "jerrbym",
          "author": "None",
          "body": "As soon as I saw that post I was like, “Oh god, I know *exactly* how this comments section is gonna go.” People really take others’ picky eating so personally. It’s frustrating.",
          "created_utc": 1680518536.0
        }
      ]
    },
    {
      "id": "jergnco",
      "author": "DzRythen",
      "body": "Ikr? It's like in general people understand it's wrong to judge others and usually at least try to emphasize with people. (Being generous here) But on this ONE issue that all goes out the window and they feel they can demean us all they want, call us children. People can be really horrible to us for absolutely no reason, which just makes struggling with the ED itself that much harder.\n\nAnd you are absolutely right about those shows. I've seen many episodes of eating and addiction shows, especially British ones for some reason, where the person in question very obviously has ARFID and are treated just horribly. Talked down to, told it's a choice and they just need to try new food. I remember one episode where the person could only eat fries and everyone in his life thought he was pathetic for doing so, it's not like it's a huge struggle for HIM rather than the people around him. I honestly can't watch those shows at all, I find it just disgusting they way people like us are treated in the media.",
      "created_utc": 1680509085.0,
      "score": 43,
      "context": [
        {
          "id": "jereqvr",
          "author": "Selphie12",
          "body": "I agree, and honestly fuck those commenters. I think it's hard enough living withit without others judging, because I don't thik other people realise how much of human society is built around food. You go to dinner with friends, every major holiday involves specific food, I sometimes worry i might offend someone from a different culture because as much as I'd like to try other foods, I don't eat fish or spices or meat of any kind, and too much of other cultures dishes involve those three things.\n\nI don't know if it's just that people don't recognise it's a proper disorder, but I always dread having to explain to people about my diet. I always circle back to that lady from My Strange Addiction with the French Fries. She was the butt of the joke for so many react channels, and I can recognise that objectively, eating a blue french fry and crying over it is a bit silly, but I knew exactly what she was going through, and it's kinda hard to see that if you haven't lived through it I think.",
          "created_utc": 1680507356.0
        }
      ]
    },
    {
      "id": "jesm741",
      "author": "SadisticGoose",
      "body": "Pretty much every post there is predictable. I’ve always thought that sub is just a bunch of teenagers with undeveloped brains trying to prove how mature they are by telling people to divorce or move out or go no contact.",
      "created_utc": 1680534803.0,
      "score": 18,
      "context": [
        {
          "id": "jermfup",
          "author": "jizzyjazz2",
          "body": "word of advice. the entire AITA subreddit is pretty much exclusively assholes giving advice to mostly non-assholes. it's a pretty crappy subreddit and you shouldn't mind them",
          "created_utc": 1680514435.0
        }
      ]
    },
    {
      "id": "jermrj6",
      "author": "DzRythen",
      "body": "Agreed. It's just a more blatant example of a mentality I've experienced from people throughout my life.",
      "created_utc": 1680514727.0,
      "score": 12,
      "context": [
        {
          "id": "jermfup",
          "author": "jizzyjazz2",
          "body": "word of advice. the entire AITA subreddit is pretty much exclusively assholes giving advice to mostly non-assholes. it's a pretty crappy subreddit and you shouldn't mind them",
          "created_utc": 1680514435.0
        }
      ]
    },
    {
      "id": "jetm6fo",
      "author": "MrPureinstinct",
      "body": "I feel like it varies. Some posts it's very obvious the person posting is an asshole and people are rightfully telling them such.   \n\n\nBut there are a lot where the person posting is maybe just doing something that is against the grain and they get dogpiled on for no reason.   \n\n\nAlso the mods of that sub were at one banning people who were on the subreddit Am I The Devil which I think is pretty gross to do.",
      "created_utc": 1680549054.0,
      "score": 8,
      "context": [
        {
          "id": "jermfup",
          "author": "jizzyjazz2",
          "body": "word of advice. the entire AITA subreddit is pretty much exclusively assholes giving advice to mostly non-assholes. it's a pretty crappy subreddit and you shouldn't mind them",
          "created_utc": 1680514435.0
        }
      ]
    },
    {
      "id": "jerrfde",
      "author": "Apprehensive_Suit782",
      "body": "indeed, it doesn't make sense at all. our body would rather die of nutrition deficiency or starvation than to eat foods that we don't deem safe for reasons that logically don't make sense at all, we know that we're supposed to be able to eat it, we know it's completely edible, but we just. can't. eat. which is incredibly confusing to those who don't go through it, understandable honestly even i don't think it made sense. I do wish there was more awareness surrounding the disorder though, so it's not as hard for them to have empathy, and they wouldn't be dismissing it right away as something unreal.",
      "created_utc": 1680518608.0,
      "score": 40,
      "context": [
        {
          "id": "jerpcwa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1680516963.0
        }
      ]
    },
    {
      "id": "jestl11",
      "author": "giraffemoo",
      "body": "PS, to everyone who is feeling hopeless that they'll find a life partner or friends while having ARFID, there's someone out there who will understand what an eating disorder is and not make you feel bad for it. My current partner knows all of my food quirks and he doesn't get mad at me when I can't eat something because of a weird or stupid reason (when we first started dating he would re-use his plate for my food until I told him that it squicked me out, lol).",
      "created_utc": 1680537811.0,
      "score": 19,
      "context": [
        {
          "id": "jest80q",
          "author": "giraffemoo",
          "body": "Because to \"normal\" people, food is \\*everything\\*. I literally got the ban hammer from a parenting group because I had the audacity to tell a parent of picky eaters that ARFID was a thing and that it doesn't feel good to be forced to eat things that you don't want to eat. I have a seriously messed up relationship with food as an adult because of the things that were done to me under the guise of \"healthy child rearing\".",
          "created_utc": 1680537664.0
        }
      ]
    },
    {
      "id": "jeszddd",
      "author": "Catinthehat5879",
      "body": "I've stopped clicking on them. The general public is wicked uneducated about eating disorders, and I've found trying to teach people makes them angry.",
      "created_utc": 1680540124.0,
      "score": 14,
      "context": [
        {
          "id": "jesfzs0",
          "author": "Ananyako",
          "body": "Saw the post too, It really is humiliating seeing what other people think of us.",
          "created_utc": 1680532174.0
        }
      ]
    },
    {
      "id": "jetiobd",
      "author": "None",
      "body": "Honest question. Why go to a high end restaurant if you do not want its food? This goes a bit against its principle and business model.\n\nIf it is just to chill there why not go late for just a drink?",
      "created_utc": 1680547680.0,
      "score": 0,
      "context": [
        {
          "id": "jesfzs0",
          "author": "Ananyako",
          "body": "Saw the post too, It really is humiliating seeing what other people think of us.",
          "created_utc": 1680532174.0
        }
      ]
    },
    {
      "id": "kfjj2lg",
      "author": "Prestigious-Cut116",
      "body": "I enjoy chicken nuggets and chips. Also love grated cheddar cheese on the chips",
      "created_utc": 1703934415.0,
      "score": 1,
      "context": [
        {
          "id": "jetz2sc",
          "author": "gillebro",
          "body": "Eugh, mate, I’ve seen posts like that on AITA before and they are disgusting.\n\nHow fucking hypocritical, calling people with limited diets immature and rude. THEY’RE the ones being immature and rude. Why the hell does it MATTER if somebody only eats toast and chips? How does that in any way affect them?\n\nI’m not an ARFID sufferer myself, but my partner is, and it pisses me off to no end when I see shit like that. My partner is an intelligent, hard-working, compassionate and talented woman, and going to restaurants is like torture for her because she knows she’s going to be judged for eating chicken nuggets and chips every time.",
          "created_utc": 1680554099.0
        }
      ]
    },
    {
      "id": "jes7375",
      "author": "whaty0ueat",
      "body": "My boyfriend is a experimental foodie I am not. We go to all sorts of places. Tried udon he got a full bowl and I got just noodles. We go to this pasta place and he eats down the menu and I always order the same dish. \n\nThe difference between my boyfriend and that poster is that my boyfriends not a dick head. He doesn't care that I want the same small selection he's just happy to be spending time with me, and wants me to be happy while doing so. He would never call my diet childish and always encourages me to step out my comfort zone but would never be so pushy. \n\nSometimes we have even gone somewhere fancy and I've only eaten a garlic bread side. And he does not care at all. Because he's not an ass. The op of the post should be ashamed lol",
      "created_utc": 1680528059.0,
      "score": 25,
      "context": [
        {
          "id": "jerhfqd",
          "author": "bumbumbooo",
          "body": "I just saw the post and the thing is it’s valid from both sides. Like I have afrid and i wouldn’t want to go to Chinese restaurants if I’m going to just get fries and not their signature food? The OP was right in a way where it didn’t even make sense for him why she would want to even go there in the first place. But she probably just enjoys going out to check new places and going out which is soooo fine and she has every  right to do so. \n\nBut him getting upset with her about her food choices is so weird ? And telling her she eats like a child is super disrespectful and I would dump him if I was the girl tbh. I grew up in a family that never validated or respected my afrid and it honestly hurt me so much. I really feel for the girlfriend and I would hate it if my partner hated me for that. It’s obvious they are not compatible and if he truly loved or cared for her he would do it a a genuine gentle way. He could educate himself about picky eating , talk to her more and try to understand why shes feel this way.  He was getting fed up with for a while until he exploded. He could’ve handled it so much better and actually had a proper conversation with understanding and compassion. Which he doesn’t seem to have any towards her. \n\nHe hasn’t really shown any concern for her health and the fact she might not even get nutritional value or anything. He seems too focused on the fact she’s “wasting “his money by buying food he doesn’t approve at restaurants.\n\nThe girlfriend may have afrid (high possibility) and her boyfriend acting this way is such a red flag. The way he handled the whole situation is wrong. She hasn’t really done anything wrong because he never talked to her about it. He just let it build up. I wouldn’t be surprised if her boyfriend doesn’t like her anymore. i think if he genuinely loved her, I don’t think he would see her that way and say that stuff.\n\nIt lowkey makes me scared and sad if my significant other ever thought of me like that. They really have no idea how difficult it is to be us and what we go through. I went through a lot of pain from family treating me this way, when they truly have no idea how mentally challenging it was to even think about trying new food.\n\nAs for the comments it’s sadly expected , people hate us so much and I just don’t understand why??  \nLike Why does it bother them so much what we eat. I wish they showed genuine concern or questions instead of straight up bullying and belittling. It’s so mean and it speaks so much about their character. And what if someone is just a picky eater?? Why is that a problem I don’t understand…  I guess it is when people make food their personality that behave like this . It’s just rlly not that serious. Ppl r just bullies and like to force ppl to do things they don’t want to do :)\n\nOP and his girlfriend are just not Compatible   or he has lost feelings. Like since he’s a foodie and she’s a picky eater and no honest communication… it was bound to crash.",
          "created_utc": 1680509801.0
        }
      ]
    },
    {
      "id": "jethkpk",
      "author": "None",
      "body": "The problem is that the girlfriend is the one that insisted to go there, make the OP pays dearly and took a place without permitting the waiter nor the restaurant to make their profit...\n\nWhen I bring my mostly well behaved small kid to a restaurant, I tip extra to compensate for the inconvenience.",
      "created_utc": 1680547249.0,
      "score": 0,
      "context": [
        {
          "id": "jerhfqd",
          "author": "bumbumbooo",
          "body": "I just saw the post and the thing is it’s valid from both sides. Like I have afrid and i wouldn’t want to go to Chinese restaurants if I’m going to just get fries and not their signature food? The OP was right in a way where it didn’t even make sense for him why she would want to even go there in the first place. But she probably just enjoys going out to check new places and going out which is soooo fine and she has every  right to do so. \n\nBut him getting upset with her about her food choices is so weird ? And telling her she eats like a child is super disrespectful and I would dump him if I was the girl tbh. I grew up in a family that never validated or respected my afrid and it honestly hurt me so much. I really feel for the girlfriend and I would hate it if my partner hated me for that. It’s obvious they are not compatible and if he truly loved or cared for her he would do it a a genuine gentle way. He could educate himself about picky eating , talk to her more and try to understand why shes feel this way.  He was getting fed up with for a while until he exploded. He could’ve handled it so much better and actually had a proper conversation with understanding and compassion. Which he doesn’t seem to have any towards her. \n\nHe hasn’t really shown any concern for her health and the fact she might not even get nutritional value or anything. He seems too focused on the fact she’s “wasting “his money by buying food he doesn’t approve at restaurants.\n\nThe girlfriend may have afrid (high possibility) and her boyfriend acting this way is such a red flag. The way he handled the whole situation is wrong. She hasn’t really done anything wrong because he never talked to her about it. He just let it build up. I wouldn’t be surprised if her boyfriend doesn’t like her anymore. i think if he genuinely loved her, I don’t think he would see her that way and say that stuff.\n\nIt lowkey makes me scared and sad if my significant other ever thought of me like that. They really have no idea how difficult it is to be us and what we go through. I went through a lot of pain from family treating me this way, when they truly have no idea how mentally challenging it was to even think about trying new food.\n\nAs for the comments it’s sadly expected , people hate us so much and I just don’t understand why??  \nLike Why does it bother them so much what we eat. I wish they showed genuine concern or questions instead of straight up bullying and belittling. It’s so mean and it speaks so much about their character. And what if someone is just a picky eater?? Why is that a problem I don’t understand…  I guess it is when people make food their personality that behave like this . It’s just rlly not that serious. Ppl r just bullies and like to force ppl to do things they don’t want to do :)\n\nOP and his girlfriend are just not Compatible   or he has lost feelings. Like since he’s a foodie and she’s a picky eater and no honest communication… it was bound to crash.",
          "created_utc": 1680509801.0
        }
      ]
    },
    {
      "id": "kfjiu3i",
      "author": "Prestigious-Cut116",
      "body": "There is nothing wrong with only liking certain foods. I myself am also a picky eater. I like the type of foods that the GF likes like chicken tenders and nuggets, pizzza burgers. People just like to judge. Other people for some reason.",
      "created_utc": 1703934240.0,
      "score": 1,
      "context": [
        {
          "id": "jerhfqd",
          "author": "bumbumbooo",
          "body": "I just saw the post and the thing is it’s valid from both sides. Like I have afrid and i wouldn’t want to go to Chinese restaurants if I’m going to just get fries and not their signature food? The OP was right in a way where it didn’t even make sense for him why she would want to even go there in the first place. But she probably just enjoys going out to check new places and going out which is soooo fine and she has every  right to do so. \n\nBut him getting upset with her about her food choices is so weird ? And telling her she eats like a child is super disrespectful and I would dump him if I was the girl tbh. I grew up in a family that never validated or respected my afrid and it honestly hurt me so much. I really feel for the girlfriend and I would hate it if my partner hated me for that. It’s obvious they are not compatible and if he truly loved or cared for her he would do it a a genuine gentle way. He could educate himself about picky eating , talk to her more and try to understand why shes feel this way.  He was getting fed up with for a while until he exploded. He could’ve handled it so much better and actually had a proper conversation with understanding and compassion. Which he doesn’t seem to have any towards her. \n\nHe hasn’t really shown any concern for her health and the fact she might not even get nutritional value or anything. He seems too focused on the fact she’s “wasting “his money by buying food he doesn’t approve at restaurants.\n\nThe girlfriend may have afrid (high possibility) and her boyfriend acting this way is such a red flag. The way he handled the whole situation is wrong. She hasn’t really done anything wrong because he never talked to her about it. He just let it build up. I wouldn’t be surprised if her boyfriend doesn’t like her anymore. i think if he genuinely loved her, I don’t think he would see her that way and say that stuff.\n\nIt lowkey makes me scared and sad if my significant other ever thought of me like that. They really have no idea how difficult it is to be us and what we go through. I went through a lot of pain from family treating me this way, when they truly have no idea how mentally challenging it was to even think about trying new food.\n\nAs for the comments it’s sadly expected , people hate us so much and I just don’t understand why??  \nLike Why does it bother them so much what we eat. I wish they showed genuine concern or questions instead of straight up bullying and belittling. It’s so mean and it speaks so much about their character. And what if someone is just a picky eater?? Why is that a problem I don’t understand…  I guess it is when people make food their personality that behave like this . It’s just rlly not that serious. Ppl r just bullies and like to force ppl to do things they don’t want to do :)\n\nOP and his girlfriend are just not Compatible   or he has lost feelings. Like since he’s a foodie and she’s a picky eater and no honest communication… it was bound to crash.",
          "created_utc": 1680509801.0
        }
      ]
    },
    {
      "id": "jevfuj7",
      "author": "DzRythen",
      "body": "That's awesome you found someone who accepts you for who you are! And yeah chicken tenders are what I eat most of the time in restaurants too. What baffles me is everyone on that post seemed to think all chicken tenders are cheap crap made for kids. I have had some really good Tenders at restaurants, there's a huge massive difference between paying for a nice plate of Tenders vs throwing some frozen crap into the air fryer, something everyone seemingly doesn't know over there.",
      "created_utc": 1680576980.0,
      "score": 7,
      "context": [
        {
          "id": "jevfepq",
          "author": "FunnelCakeGoblin",
          "body": "Definitely made me sad. I pretty much only eat chicken. Luckily, I can eat more than chicken tenders, but still. Just chicken. I asked my husband if that bothered his that we go out to fancy places or steakhouses and I just get chicken, and he said he loves it because it’s cheaper. 😂 And he doesn’t care as long as I’m happy.",
          "created_utc": 1680576778.0
        }
      ]
    },
    {
      "id": "jf0pcsv",
      "author": "deadmau5Rules2003",
      "body": "I agree. I see this kind of shit ALL THE TIME on Reddit and TikTok, let alone in real-life. It’s so incredibly ableist and it just makes me want to scream and cry at the same time. We deserve to be treated with respect like any other person with a disability/disorder.",
      "created_utc": 1680674192.0,
      "score": 10,
      "context": [
        {
          "id": "jerrbym",
          "author": "None",
          "body": "As soon as I saw that post I was like, “Oh god, I know *exactly* how this comments section is gonna go.” People really take others’ picky eating so personally. It’s frustrating.",
          "created_utc": 1680518536.0
        },
        {
          "id": "jes32k7",
          "author": "Apprehensive_Suit782",
          "body": "once saw a post about autistic people talking about being picky, one of the comments with the highest like count was talking about how they just can't respect since they find it annoying. incredibly frustrating.",
          "created_utc": 1680525990.0
        }
      ]
    },
    {
      "id": "jesvagt",
      "author": "Wellslapmesilly",
      "body": "Yes exactly! I’m a foodie with a partner who has ARFID. When I met them they were very limited in what they ate. I made it my goal to make them feel very safe in regards to food. Zero stress. Found ways to introduce foods in a way that was non-threatening (because that’s what they wanted). People who belittle, bully or guilt their partners over their food choices are either ignorant, jerks or both. Over time they have learned how much joy food brings me. They may not share my feelings but they’ve grown comfortable with the concept. It’s all about communication and empathy on both sides.",
      "created_utc": 1680538501.0,
      "score": 13,
      "context": [
        {
          "id": "jest80q",
          "author": "giraffemoo",
          "body": "Because to \"normal\" people, food is \\*everything\\*. I literally got the ban hammer from a parenting group because I had the audacity to tell a parent of picky eaters that ARFID was a thing and that it doesn't feel good to be forced to eat things that you don't want to eat. I have a seriously messed up relationship with food as an adult because of the things that were done to me under the guise of \"healthy child rearing\".",
          "created_utc": 1680537664.0
        },
        {
          "id": "jestl11",
          "author": "giraffemoo",
          "body": "PS, to everyone who is feeling hopeless that they'll find a life partner or friends while having ARFID, there's someone out there who will understand what an eating disorder is and not make you feel bad for it. My current partner knows all of my food quirks and he doesn't get mad at me when I can't eat something because of a weird or stupid reason (when we first started dating he would re-use his plate for my food until I told him that it squicked me out, lol).",
          "created_utc": 1680537811.0
        }
      ]
    },
    {
      "id": "jewm7iv",
      "author": "Whinersarewieners",
      "body": "I do think about this sometimes. My mum has a restricted diet but does that mean that my dad can’t go out to a high end restaurant with his wife? If they are both ok with her only eating some chicken and rice. It’s their money to spend.",
      "created_utc": 1680608153.0,
      "score": 8,
      "context": [
        {
          "id": "jesfzs0",
          "author": "Ananyako",
          "body": "Saw the post too, It really is humiliating seeing what other people think of us.",
          "created_utc": 1680532174.0
        },
        {
          "id": "jetiobd",
          "author": "None",
          "body": "Honest question. Why go to a high end restaurant if you do not want its food? This goes a bit against its principle and business model.\n\nIf it is just to chill there why not go late for just a drink?",
          "created_utc": 1680547680.0
        }
      ]
    },
    {
      "id": "jewoq9y",
      "author": "Roubaix718",
      "body": "Ambience, experience, time with your partner. All of those things might be worth the $5-$10 premium on chicken tenders in her mind.",
      "created_utc": 1680609676.0,
      "score": 6,
      "context": [
        {
          "id": "jesfzs0",
          "author": "Ananyako",
          "body": "Saw the post too, It really is humiliating seeing what other people think of us.",
          "created_utc": 1680532174.0
        },
        {
          "id": "jetiobd",
          "author": "None",
          "body": "Honest question. Why go to a high end restaurant if you do not want its food? This goes a bit against its principle and business model.\n\nIf it is just to chill there why not go late for just a drink?",
          "created_utc": 1680547680.0
        }
      ]
    },
    {
      "id": "jfe1vsi",
      "author": "concreteoverwater",
      "body": "I’m thankful that my parents took me out to restaurants growing up, even if it was plain buttered noodles for me at an Italian restaurant. It felt nice to be included.",
      "created_utc": 1680915219.0,
      "score": 1,
      "context": [
        {
          "id": "jesfzs0",
          "author": "Ananyako",
          "body": "Saw the post too, It really is humiliating seeing what other people think of us.",
          "created_utc": 1680532174.0
        },
        {
          "id": "jetiobd",
          "author": "None",
          "body": "Honest question. Why go to a high end restaurant if you do not want its food? This goes a bit against its principle and business model.\n\nIf it is just to chill there why not go late for just a drink?",
          "created_utc": 1680547680.0
        }
      ]
    },
    {
      "id": "kgf6ryu",
      "author": "gillebro",
      "body": "Ooh, grated cheddar on chips is lush. No way my partner would go for that, but I'm absolutely a cheesy chip girl.",
      "created_utc": 1704456207.0,
      "score": 1,
      "context": [
        {
          "id": "jetz2sc",
          "author": "gillebro",
          "body": "Eugh, mate, I’ve seen posts like that on AITA before and they are disgusting.\n\nHow fucking hypocritical, calling people with limited diets immature and rude. THEY’RE the ones being immature and rude. Why the hell does it MATTER if somebody only eats toast and chips? How does that in any way affect them?\n\nI’m not an ARFID sufferer myself, but my partner is, and it pisses me off to no end when I see shit like that. My partner is an intelligent, hard-working, compassionate and talented woman, and going to restaurants is like torture for her because she knows she’s going to be judged for eating chicken nuggets and chips every time.",
          "created_utc": 1680554099.0
        },
        {
          "id": "kfjj2lg",
          "author": "Prestigious-Cut116",
          "body": "I enjoy chicken nuggets and chips. Also love grated cheddar cheese on the chips",
          "created_utc": 1703934415.0
        }
      ]
    },
    {
      "id": "jez93e4",
      "author": "FunnelCakeGoblin",
      "body": "Definitely! Chicken tenders have verity!",
      "created_utc": 1680647971.0,
      "score": 1,
      "context": [
        {
          "id": "jevfepq",
          "author": "FunnelCakeGoblin",
          "body": "Definitely made me sad. I pretty much only eat chicken. Luckily, I can eat more than chicken tenders, but still. Just chicken. I asked my husband if that bothered his that we go out to fancy places or steakhouses and I just get chicken, and he said he loves it because it’s cheaper. 😂 And he doesn’t care as long as I’m happy.",
          "created_utc": 1680576778.0
        },
        {
          "id": "jevfuj7",
          "author": "DzRythen",
          "body": "That's awesome you found someone who accepts you for who you are! And yeah chicken tenders are what I eat most of the time in restaurants too. What baffles me is everyone on that post seemed to think all chicken tenders are cheap crap made for kids. I have had some really good Tenders at restaurants, there's a huge massive difference between paying for a nice plate of Tenders vs throwing some frozen crap into the air fryer, something everyone seemingly doesn't know over there.",
          "created_utc": 1680576980.0
        }
      ]
    },
    {
      "id": "kfjjgh3",
      "author": "Prestigious-Cut116",
      "body": "Also in restaurants if you get chicken tenders instead of getting chips with them your probably have a salad with them or a dip",
      "created_utc": 1703934709.0,
      "score": 1,
      "context": [
        {
          "id": "jevfepq",
          "author": "FunnelCakeGoblin",
          "body": "Definitely made me sad. I pretty much only eat chicken. Luckily, I can eat more than chicken tenders, but still. Just chicken. I asked my husband if that bothered his that we go out to fancy places or steakhouses and I just get chicken, and he said he loves it because it’s cheaper. 😂 And he doesn’t care as long as I’m happy.",
          "created_utc": 1680576778.0
        },
        {
          "id": "jevfuj7",
          "author": "DzRythen",
          "body": "That's awesome you found someone who accepts you for who you are! And yeah chicken tenders are what I eat most of the time in restaurants too. What baffles me is everyone on that post seemed to think all chicken tenders are cheap crap made for kids. I have had some really good Tenders at restaurants, there's a huge massive difference between paying for a nice plate of Tenders vs throwing some frozen crap into the air fryer, something everyone seemingly doesn't know over there.",
          "created_utc": 1680576980.0
        }
      ]
    },
    {
      "id": "jewp45c",
      "author": "None",
      "body": "Sure. But, here, it was the gf that insisted to go there. I think just drinking in the late evening would make more sense.",
      "created_utc": 1680609907.0,
      "score": 1,
      "context": [
        {
          "id": "jesfzs0",
          "author": "Ananyako",
          "body": "Saw the post too, It really is humiliating seeing what other people think of us.",
          "created_utc": 1680532174.0
        },
        {
          "id": "jetiobd",
          "author": "None",
          "body": "Honest question. Why go to a high end restaurant if you do not want its food? This goes a bit against its principle and business model.\n\nIf it is just to chill there why not go late for just a drink?",
          "created_utc": 1680547680.0
        },
        {
          "id": "jewm7iv",
          "author": "Whinersarewieners",
          "body": "I do think about this sometimes. My mum has a restricted diet but does that mean that my dad can’t go out to a high end restaurant with his wife? If they are both ok with her only eating some chicken and rice. It’s their money to spend.",
          "created_utc": 1680608153.0
        }
      ]
    },
    {
      "id": "jewqeyo",
      "author": "None",
      "body": "But her partner gets a $100 meal he did not want, the waiter gets a $2 tip on her meal instead of $20, the restaurant makes a bill of $110 instead of $200... (values are arbitrary).\n\nIf she wants the experience, maybe she should pay for it by footing the bill and tipping extra? Or go to a high end bar?",
      "created_utc": 1680610657.0,
      "score": -1,
      "context": [
        {
          "id": "jesfzs0",
          "author": "Ananyako",
          "body": "Saw the post too, It really is humiliating seeing what other people think of us.",
          "created_utc": 1680532174.0
        },
        {
          "id": "jetiobd",
          "author": "None",
          "body": "Honest question. Why go to a high end restaurant if you do not want its food? This goes a bit against its principle and business model.\n\nIf it is just to chill there why not go late for just a drink?",
          "created_utc": 1680547680.0
        },
        {
          "id": "jewoq9y",
          "author": "Roubaix718",
          "body": "Ambience, experience, time with your partner. All of those things might be worth the $5-$10 premium on chicken tenders in her mind.",
          "created_utc": 1680609676.0
        }
      ]
    },
    {
      "id": "jewqtje",
      "author": "Roubaix718",
      "body": "So the issue isn’t what she is getting, it is that he doesn’t want to go there. That is a very different issue than he posted  And do you think the restaurant has them on the menu by mistake?",
      "created_utc": 1680610882.0,
      "score": 4,
      "context": [
        {
          "id": "jesfzs0",
          "author": "Ananyako",
          "body": "Saw the post too, It really is humiliating seeing what other people think of us.",
          "created_utc": 1680532174.0
        },
        {
          "id": "jetiobd",
          "author": "None",
          "body": "Honest question. Why go to a high end restaurant if you do not want its food? This goes a bit against its principle and business model.\n\nIf it is just to chill there why not go late for just a drink?",
          "created_utc": 1680547680.0
        },
        {
          "id": "jewoq9y",
          "author": "Roubaix718",
          "body": "Ambience, experience, time with your partner. All of those things might be worth the $5-$10 premium on chicken tenders in her mind.",
          "created_utc": 1680609676.0
        },
        {
          "id": "jewqeyo",
          "author": "None",
          "body": "But her partner gets a $100 meal he did not want, the waiter gets a $2 tip on her meal instead of $20, the restaurant makes a bill of $110 instead of $200... (values are arbitrary).\n\nIf she wants the experience, maybe she should pay for it by footing the bill and tipping extra? Or go to a high end bar?",
          "created_utc": 1680610657.0
        }
      ]
    }
  ]
}