{
  "id": "12axmds",
  "subreddit": "ARFID",
  "author": "Anonymousherelol",
  "created_utc": 1680555523.0,
  "title": "Thoughts on people who shit on picky eaters?",
  "selftext": "Recently saw this thread about a guy who’s upset cause he didn’t wanna pay “$15” for chicken tenders for his girlfriend at fancy restaurant and it shocks me at how much people seem to DESPISE picky eaters. Doesn’t matter if it’s AFRID, autism, sensory issues - the majority seem to always shit on people who have a limited palate.\n\nHow do you go upon discussions like this?",
  "url": "https://www.reddit.com/r/ARFID/comments/12axmds/thoughts_on_people_who_shit_on_picky_eaters/",
  "score": 187,
  "num_comments": 45,
  "comments": [
    {
      "id": "jeu7h0u",
      "author": "CanadianWedditor",
      "body": "Honestly, dating with ARFID made it super easy to weed out controlling assholes. My partner lets  me eat what I want when I want and my life with him couldn’t be better. “My body, my choices” and all that. If someone doesn’t agree with that around chicken nuggets, how are they going to react if I get pregnant, etc. It’s a red flag to me in so many ways. But it helps to recognize a lot of people are controlling assholes, a realization people without ARFID may take longer to reach!",
      "created_utc": 1680557422.0,
      "score": 168,
      "context": []
    },
    {
      "id": "jeu3sed",
      "author": "emptyhellebore",
      "body": "My thought is - fuck ‘em. \n\nI don’t get it. So much vitriol over something they can’t control.  Oh well.",
      "created_utc": 1680555929.0,
      "score": 65,
      "context": []
    },
    {
      "id": "jeul1xx",
      "author": "None",
      "body": "Saw that thread too. I think those people are colossal assholes who only think about their own life experiences and can’t fathom anyone struggling with food.",
      "created_utc": 1680563237.0,
      "score": 45,
      "context": []
    },
    {
      "id": "jeu77cs",
      "author": "No_Tailor_9572",
      "body": "I hate those people so much. Recently made my list at the request of my new Councillor & I came up with 13. 13 & that's if we're letting gnocci & pasta be different foods like sorry I'm ill guess I'll never leave the house then lest I 'embarrass' my friends & family.",
      "created_utc": 1680557311.0,
      "score": 40,
      "context": []
    },
    {
      "id": "jev4ufk",
      "author": "nevafeva",
      "body": "I really don’t understand why people have opinions on what other people eat. When I go out to eat with someone, I barely pay attention to what they order. I don’t require anyone to eat a certain way. It’s so rude, people are assholes.",
      "created_utc": 1680571855.0,
      "score": 40,
      "context": []
    },
    {
      "id": "jew2yq0",
      "author": "qazwsxedc000999",
      "body": "They often frame it as “Well I have to plan my meals around the picky person!” No, you do not. They did not ask you to. They simply will order what they want, nothing, or get something later. Why would you force someone to get something if they won’t like it?? It doesn’t do anyone any good",
      "created_utc": 1680592126.0,
      "score": 35,
      "context": []
    },
    {
      "id": "jevzojs",
      "author": "Kimbahlee34",
      "body": "I literally found this sub from that post you’re talking about and I’m so glad I came here because I finally found my people!",
      "created_utc": 1680589363.0,
      "score": 21,
      "context": []
    },
    {
      "id": "jey790w",
      "author": "pallas3000",
      "body": "People who shit on picky eaters really made my ARFID worse as kid/teen. Now I know how to put up boundaries and they've become manageable. The access to an official diagnosis really helps as every time someone attempts to make a comment on the way I eat I just make the situation uncomfortable by saying \"well I have an eating disorder\".\n\nI think that throughout the years I also realised that most people have a really messed up relationship with food. Diet culture is so huge, clean eating and the wellness industry have such a strong grip on people's mind. Or just people who have trauma linked to poverty. My grand parents weren't always able to put food on the table (literally) for example. \n\nSo when I encounter these types comments I also try to have some empathy first. But I still speak up and tell them that people have eating disorders, sensory issues etc.",
      "created_utc": 1680632832.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jew7dot",
      "author": "somechick_92",
      "body": "Like none of them had ever gone to a restaurant and eaten something that ‘could’ be made at home. It’s not about the food for us as much as others (although I still enjoy whatever I’m eating!), but I enjoy the getting dressed up and going out, the atmosphere, watching my husband enjoy something special etc and he thinks its great that I’m so damn cheap to feed instead of complaining that I ‘could’ get fries cheaper at home. I also usually enjoy a fancy cocktail or some kind of intricate dessert.",
      "created_utc": 1680596094.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jexs6fe",
      "author": "SadisticGoose",
      "body": "They equate “picky eating” with childishness as if people don’t have eating disorders, sensory issues, or maybe just have preferences. You don’t have to like every single food out there. Limited palette doesn’t make you morally bankrupt. I’m sure other people would rather me eat what I’m comfortable with than spend the meal gagging, which I’m sure these people would also say is childish and dramatic.",
      "created_utc": 1680626924.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jeush4f",
      "author": "Nanis149",
      "body": "I hate it whenever people do that so much.",
      "created_utc": 1680566474.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jev5inv",
      "author": "ManifestoHero",
      "body": "Anyone got a link to that thread?",
      "created_utc": 1680572167.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jex5f0c",
      "author": "cupcakes17",
      "body": "I asked my ex to stop making fun of me for not wanting to try new stuff, for putting stuff on my plate without asking, for asking what’s wrong with me, for making comments about me liking “only American food” (not true), and for his parents to stop doing all the same things! Needless to say I broke up with him and learned that that wasn’t the only abuse I had been taking from him. It’s so damaging to be made fun of for an eating disorder, even after I was diagnosed he still made fun of me! People who shit on picky eaters have their own insecurities, and usually have to reflect that onto you. It doesn’t make it okay. :(",
      "created_utc": 1680617870.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jeyomo0",
      "author": "None",
      "body": "Selective eating disorder and ARFID are EATING DISORDERS. I'd ask for them to think of it like depression or anxiety. You can't just will it away, and logic and reasoning won't fix it. It's not a choice, it's a medical condition. People who can't respect that are just red flags in general like.. who cares what you eat? I'd ask them how they felt about someone randomly criticizing what they wear or the type of shampoo they use.. *it's literally weirder for you to care then it is for someone to have a limited diet.*",
      "created_utc": 1680639546.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jeyxmcg",
      "author": "Odd_craving",
      "body": "I don’t suffer from ARFID, but I’m smart enough to know that what someone else eats is not my business unless it affects me directly. \n\nIf I’m cooking for a group of people and someone requests something different, I’m happy because that person would have had a bad time attempting to eat something that they don’t want. The whole idea of getting out and enjoying yourself is to actually do that. \n\nI’m 60 and my generation loves to suffer. They brag about how bad their childhood was… or that they can put up with intense pain. Nope! I say enjoy what you like and leave people alone in their choices.",
      "created_utc": 1680643107.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jf4iqo9",
      "author": "Wolfman726",
      "body": "The dude who didnt want to pay for his GFs meal because of what it was is a total asshole. The key is to find people who will support you. They dont have to understand ARFID, they just have to not treat you differently because of it. ARFID gets a bad rap due to the fact soo many people dont get it and associate it with being a choice (aka picky eaters), its NOT a choice.",
      "created_utc": 1680741054.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jevui5s",
      "author": "KingTalis",
      "body": "Everyone I've interacted with has been nice and supportive, but luckily I don't share a lot of the social anxiety I see from others in this sub. So, if anyone wants to be nasty I will absolutely have no issue getting into a verbal confrontation on behalf of us all.",
      "created_utc": 1680585423.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jf0xhmo",
      "author": "oddistrange",
      "body": "I had to ask my partner if he seriously thought I chose to be this way because my life would be so much easier if I could just *choose* to not be picky. It's cut down the comments a bit but he still is kind of an ass about it sometimes. I think sometimes he tries to guilt me by complaining he can't get Thai food as often because I won't order anything from Thai places. Like, dude, you're making it a problem for yourself, you're actually choosing to restrict yourself there. He ordered from Thai when he was single all by himself. I don't know how my entering into a relationship with him destroys his ability to order Thai food by himself.",
      "created_utc": 1680680876.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jev3xby",
      "author": "Nate1n22",
      "body": "Don’t care about them",
      "created_utc": 1680571434.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jey10yl",
      "author": "Mysterious-Echo-1316",
      "body": "This lmao I love this thread so much y’all make me feel not alone! My friends make fun of me all the time and it’s so annoying. Thank y’all for sharing your stories again ❤️❤️",
      "created_utc": 1680630419.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jeytw8i",
      "author": "Ok_Lettuce_534",
      "body": "It’s crazy that they complain over picky eaters when in a way being picky is a plus, it’s easier to know what someone wants, now if they’re specific on the things they want and don’t want on their food I think it’s safer to understand that than get something they don’t want you and you complain over “wasting” money. So it’s honestly their own issue. Picky eaters don’t choose to be picky. I myself am very picky and I would love to try new things at restaurants but can’t due to my fear of it not tasting exactly how I’d expect it to in my head. And I think picky eaters shouldn’t blame themselves, if you have a go to comfort food then that’s wonderful and don’t let anyone ever make you feel like you “need” to try new things that you aren’t comfortable with!",
      "created_utc": 1680641599.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jey0iig",
      "author": "None",
      "body": "At this point, [I try to combat it with reason & compassion](https://www.reddit.com/r/AmItheAsshole/comments/12a7mks/aita_for_refusing_to_take_my_girlfriend_to_nice/jer53n6/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3). Sometimes it does some good, but mostly just makes me feel better. 🤷🏼‍♀️",
      "created_utc": 1680630223.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jeulcn4",
      "author": "melkncookeys",
      "body": "It seems like that guy wants companionship. When I started dating my my fiancé with ARFID we would be able to go out to certain restaurants together, but then the new became old and I got sick of eating at the same places. He was very into his routine of eating one meal a day and never at home. I was looking to cook and enjoy exploring new restaurants. I cooked for myself and would eat alone. Our meal times never matched because I would eat 2-3 meals and he needed one big meal at an awkward time. It is lonely dating someone who has restrictions, but if you both put in work and willing to compromise there shouldn’t be hard feelings about. I don’t think he’s an asshole, I think he has needs that she isn’t able to give him and it’s a question on if that leaves them completely incompatible or if they can work with each other and be able to manage expectations.",
      "created_utc": 1680563369.0,
      "score": -4,
      "context": []
    },
    {
      "id": "jev5wbs",
      "author": "purplechunkymonkey",
      "body": "Picky eater is an actual diagnosis. My daughter is a difficult feeder. \n\nYou don't like what I like so that makes you a picky eater. My family always called me a picky eater. I'm not. My diet is just very different from theirs.",
      "created_utc": 1680572341.0,
      "score": -3,
      "context": []
    },
    {
      "id": "jevsesk",
      "author": "nicekona",
      "body": "Some people think it means you’re “unadventurous” or “unwilling to try new things.”\n\nLike, no, I’ve lived in a van, traveled the entire country for months at a time, lived on hippie communes where I did the wackiest of wacky shit. I recently invited an Uber driver inside so he he could teach me how to ballroom dance lol. I just don’t wanna eat certain foods dude.\n\nLike… okay. Example. I’ve tried every weird, non habit forming drug (no heroin or meth, that’s a nah for me) that I can possibly name, just so I would know what the experience was like. My boyfriend has never so much as taken a puff of weed before in his life. However, he’ll eat anything you put in front of him.\n\nAre either of us unadventurous? No. We just have different levels of comfort about different things. Neither of us judge the other for that.",
      "created_utc": 1680583999.0,
      "score": 60,
      "context": [
        {
          "id": "jeu7h0u",
          "author": "CanadianWedditor",
          "body": "Honestly, dating with ARFID made it super easy to weed out controlling assholes. My partner lets  me eat what I want when I want and my life with him couldn’t be better. “My body, my choices” and all that. If someone doesn’t agree with that around chicken nuggets, how are they going to react if I get pregnant, etc. It’s a red flag to me in so many ways. But it helps to recognize a lot of people are controlling assholes, a realization people without ARFID may take longer to reach!",
          "created_utc": 1680557422.0
        }
      ]
    },
    {
      "id": "jeupmyv",
      "author": "geekgeek2019",
      "body": "Oof good consideration",
      "created_utc": 1680565216.0,
      "score": 14,
      "context": [
        {
          "id": "jeu7h0u",
          "author": "CanadianWedditor",
          "body": "Honestly, dating with ARFID made it super easy to weed out controlling assholes. My partner lets  me eat what I want when I want and my life with him couldn’t be better. “My body, my choices” and all that. If someone doesn’t agree with that around chicken nuggets, how are they going to react if I get pregnant, etc. It’s a red flag to me in so many ways. But it helps to recognize a lot of people are controlling assholes, a realization people without ARFID may take longer to reach!",
          "created_utc": 1680557422.0
        }
      ]
    },
    {
      "id": "jeucumc",
      "author": "Anonymousherelol",
      "body": "I love that for you 🤌🏽  I wish you and your partner continued success in the relationship!",
      "created_utc": 1680559688.0,
      "score": 15,
      "context": [
        {
          "id": "jeu7h0u",
          "author": "CanadianWedditor",
          "body": "Honestly, dating with ARFID made it super easy to weed out controlling assholes. My partner lets  me eat what I want when I want and my life with him couldn’t be better. “My body, my choices” and all that. If someone doesn’t agree with that around chicken nuggets, how are they going to react if I get pregnant, etc. It’s a red flag to me in so many ways. But it helps to recognize a lot of people are controlling assholes, a realization people without ARFID may take longer to reach!",
          "created_utc": 1680557422.0
        }
      ]
    },
    {
      "id": "jexs3mt",
      "author": "OvercookedRedditor",
      "body": "Even if it's different foods it's still good to be able to have different shapes of pasta. So far I can eat most shapes of pasta except orzo or smaller because it felt weird in between my teeth. Some options to explore from pasta is filled pasta like ravioli, cheese, meat, and vegetables or a combo is most common for store bought but anything can be homemade. Gnocchi you can try sweet potato gnocchi which has the same texture but sweet. Egg pasta (De Cecco in USA) is also another type of pasta of you like egg flavor. Ramen and other noodles taste different though.",
      "created_utc": 1680626894.0,
      "score": 5,
      "context": [
        {
          "id": "jeu77cs",
          "author": "No_Tailor_9572",
          "body": "I hate those people so much. Recently made my list at the request of my new Councillor & I came up with 13. 13 & that's if we're letting gnocci & pasta be different foods like sorry I'm ill guess I'll never leave the house then lest I 'embarrass' my friends & family.",
          "created_utc": 1680557311.0
        }
      ]
    },
    {
      "id": "jex7axa",
      "author": "bewarethelemurs",
      "body": "Right? Like I understand close friends and family being concerned if your diet is so limited that you aren't getting enough nutrients, but like, you have to know someone for a while to know what they generally eat. If you're just a friend I see every week or less, you have no idea what I'm eating the other 26 days of the month, and that's assuming we're going out go eat every time we see each other. And if you're a stranger, then wtf do you care?",
      "created_utc": 1680618661.0,
      "score": 15,
      "context": [
        {
          "id": "jev4ufk",
          "author": "nevafeva",
          "body": "I really don’t understand why people have opinions on what other people eat. When I go out to eat with someone, I barely pay attention to what they order. I don’t require anyone to eat a certain way. It’s so rude, people are assholes.",
          "created_utc": 1680571855.0
        }
      ]
    },
    {
      "id": "jvb6qus",
      "author": "Financial-Apricot906",
      "body": "I know that this is old, but why does eating everything without discrimination get applauded? That is unhealthy as well.",
      "created_utc": 1691508241.0,
      "score": 2,
      "context": [
        {
          "id": "jev4ufk",
          "author": "nevafeva",
          "body": "I really don’t understand why people have opinions on what other people eat. When I go out to eat with someone, I barely pay attention to what they order. I don’t require anyone to eat a certain way. It’s so rude, people are assholes.",
          "created_utc": 1680571855.0
        }
      ]
    },
    {
      "id": "jexjexh",
      "author": "None",
      "body": "Omg it infuriates me when people frame it like that. \"We have to plan dinner around what YOU like to eat!!!\" Uhh no? Just eat whatever the hell you want, I don't expect anyone to plan around me. I'm an adult, I can feed myself, I'll just get something else to eat before or after. Non-problem has been solved.",
      "created_utc": 1680623534.0,
      "score": 20,
      "context": [
        {
          "id": "jew2yq0",
          "author": "qazwsxedc000999",
          "body": "They often frame it as “Well I have to plan my meals around the picky person!” No, you do not. They did not ask you to. They simply will order what they want, nothing, or get something later. Why would you force someone to get something if they won’t like it?? It doesn’t do anyone any good",
          "created_utc": 1680592126.0
        }
      ]
    },
    {
      "id": "jevzt7s",
      "author": "Anonymousherelol",
      "body": "We welcome you with open arms ❤️ this is a safe space",
      "created_utc": 1680589467.0,
      "score": 10,
      "context": [
        {
          "id": "jevzojs",
          "author": "Kimbahlee34",
          "body": "I literally found this sub from that post you’re talking about and I’m so glad I came here because I finally found my people!",
          "created_utc": 1680589363.0
        }
      ]
    },
    {
      "id": "jeyyvla",
      "author": "gillebro",
      "body": "Ok, straight up, you making things uncomfortable by saying you have an eating disorder makes you my newest hero, because that is awesome. Good on you for sticking up for yourself and working out a way to call them out on their unnecessary bullshit.",
      "created_utc": 1680643628.0,
      "score": 8,
      "context": [
        {
          "id": "jey790w",
          "author": "pallas3000",
          "body": "People who shit on picky eaters really made my ARFID worse as kid/teen. Now I know how to put up boundaries and they've become manageable. The access to an official diagnosis really helps as every time someone attempts to make a comment on the way I eat I just make the situation uncomfortable by saying \"well I have an eating disorder\".\n\nI think that throughout the years I also realised that most people have a really messed up relationship with food. Diet culture is so huge, clean eating and the wellness industry have such a strong grip on people's mind. Or just people who have trauma linked to poverty. My grand parents weren't always able to put food on the table (literally) for example. \n\nSo when I encounter these types comments I also try to have some empathy first. But I still speak up and tell them that people have eating disorders, sensory issues etc.",
          "created_utc": 1680632832.0
        }
      ]
    },
    {
      "id": "jev87mj",
      "author": "ManifestoHero",
      "body": "Nevermind, I found it. What a shit show, never seen so many controlling people in a single thread.",
      "created_utc": 1680573397.0,
      "score": 18,
      "context": [
        {
          "id": "jev5inv",
          "author": "ManifestoHero",
          "body": "Anyone got a link to that thread?",
          "created_utc": 1680572167.0
        }
      ]
    },
    {
      "id": "jevt5sc",
      "author": "nicekona",
      "body": "I think a lot of people assume that picky eaters are ALL “no we cant go there, there’s nothing I can eat” and find that isolating, like you said. But I’ll happily go to a Thai place where I can only eat a bowl of white rice, or just sit there and enjoy the company without eating at all. I’ll grab fast food on the way home, whatever.\n\nNot all picky eaters demand that you work around them, you know? I think that’s what some people fail to acknowledge. Sorry your experience has been difficult.",
      "created_utc": 1680584502.0,
      "score": 13,
      "context": [
        {
          "id": "jeulcn4",
          "author": "melkncookeys",
          "body": "It seems like that guy wants companionship. When I started dating my my fiancé with ARFID we would be able to go out to certain restaurants together, but then the new became old and I got sick of eating at the same places. He was very into his routine of eating one meal a day and never at home. I was looking to cook and enjoy exploring new restaurants. I cooked for myself and would eat alone. Our meal times never matched because I would eat 2-3 meals and he needed one big meal at an awkward time. It is lonely dating someone who has restrictions, but if you both put in work and willing to compromise there shouldn’t be hard feelings about. I don’t think he’s an asshole, I think he has needs that she isn’t able to give him and it’s a question on if that leaves them completely incompatible or if they can work with each other and be able to manage expectations.",
          "created_utc": 1680563369.0
        }
      ]
    },
    {
      "id": "jewxh42",
      "author": "ohhyouknow",
      "body": "The post in question had the GIRLFRIEND choosing cool, fancy new restaurants to try out with him. He was embarrassed by her because she only ever ordered chicken tenders from those restaurants. The girlfriend picked new adventurous places she knew her bf would like and then went with him, his whole problem with her was that she didn’t try other foods. \n\nIt doesn’t sound AT ALL to me like this was a companionship issue or anything at all related to your anecdote",
      "created_utc": 1680614301.0,
      "score": 8,
      "context": [
        {
          "id": "jeulcn4",
          "author": "melkncookeys",
          "body": "It seems like that guy wants companionship. When I started dating my my fiancé with ARFID we would be able to go out to certain restaurants together, but then the new became old and I got sick of eating at the same places. He was very into his routine of eating one meal a day and never at home. I was looking to cook and enjoy exploring new restaurants. I cooked for myself and would eat alone. Our meal times never matched because I would eat 2-3 meals and he needed one big meal at an awkward time. It is lonely dating someone who has restrictions, but if you both put in work and willing to compromise there shouldn’t be hard feelings about. I don’t think he’s an asshole, I think he has needs that she isn’t able to give him and it’s a question on if that leaves them completely incompatible or if they can work with each other and be able to manage expectations.",
          "created_utc": 1680563369.0
        }
      ]
    },
    {
      "id": "jeyls8o",
      "author": "nevafeva",
      "body": "Exactly. I appreciate the people that are concerned. The ones that make a big stink about it for no particular reason just anger me. I have a family member that would see me once a year at most, but she always had something negative to say about my diet. These are the people that are the reason why I have anxiety about food.",
      "created_utc": 1680638464.0,
      "score": 6,
      "context": [
        {
          "id": "jev4ufk",
          "author": "nevafeva",
          "body": "I really don’t understand why people have opinions on what other people eat. When I go out to eat with someone, I barely pay attention to what they order. I don’t require anyone to eat a certain way. It’s so rude, people are assholes.",
          "created_utc": 1680571855.0
        },
        {
          "id": "jex7axa",
          "author": "bewarethelemurs",
          "body": "Right? Like I understand close friends and family being concerned if your diet is so limited that you aren't getting enough nutrients, but like, you have to know someone for a while to know what they generally eat. If you're just a friend I see every week or less, you have no idea what I'm eating the other 26 days of the month, and that's assuming we're going out go eat every time we see each other. And if you're a stranger, then wtf do you care?",
          "created_utc": 1680618661.0
        }
      ]
    },
    {
      "id": "jvb6ydn",
      "author": "Financial-Apricot906",
      "body": "Exactly. Watching people eat foods that will make me sick has no impact on me.",
      "created_utc": 1691508319.0,
      "score": 2,
      "context": [
        {
          "id": "jew2yq0",
          "author": "qazwsxedc000999",
          "body": "They often frame it as “Well I have to plan my meals around the picky person!” No, you do not. They did not ask you to. They simply will order what they want, nothing, or get something later. Why would you force someone to get something if they won’t like it?? It doesn’t do anyone any good",
          "created_utc": 1680592126.0
        },
        {
          "id": "jexjexh",
          "author": "None",
          "body": "Omg it infuriates me when people frame it like that. \"We have to plan dinner around what YOU like to eat!!!\" Uhh no? Just eat whatever the hell you want, I don't expect anyone to plan around me. I'm an adult, I can feed myself, I'll just get something else to eat before or after. Non-problem has been solved.",
          "created_utc": 1680623534.0
        }
      ]
    },
    {
      "id": "jezp35f",
      "author": "pallas3000",
      "body": "Aww thank you. But yeah if they are the ones trying to make me feel uncomfortable with their comments it's only fair for it to backfire.",
      "created_utc": 1680655129.0,
      "score": 5,
      "context": [
        {
          "id": "jey790w",
          "author": "pallas3000",
          "body": "People who shit on picky eaters really made my ARFID worse as kid/teen. Now I know how to put up boundaries and they've become manageable. The access to an official diagnosis really helps as every time someone attempts to make a comment on the way I eat I just make the situation uncomfortable by saying \"well I have an eating disorder\".\n\nI think that throughout the years I also realised that most people have a really messed up relationship with food. Diet culture is so huge, clean eating and the wellness industry have such a strong grip on people's mind. Or just people who have trauma linked to poverty. My grand parents weren't always able to put food on the table (literally) for example. \n\nSo when I encounter these types comments I also try to have some empathy first. But I still speak up and tell them that people have eating disorders, sensory issues etc.",
          "created_utc": 1680632832.0
        },
        {
          "id": "jeyyvla",
          "author": "gillebro",
          "body": "Ok, straight up, you making things uncomfortable by saying you have an eating disorder makes you my newest hero, because that is awesome. Good on you for sticking up for yourself and working out a way to call them out on their unnecessary bullshit.",
          "created_utc": 1680643628.0
        }
      ]
    },
    {
      "id": "jevmbay",
      "author": "Sneezing_protractor",
      "body": "May I have the link?",
      "created_utc": 1680580328.0,
      "score": 1,
      "context": [
        {
          "id": "jev5inv",
          "author": "ManifestoHero",
          "body": "Anyone got a link to that thread?",
          "created_utc": 1680572167.0
        },
        {
          "id": "jev87mj",
          "author": "ManifestoHero",
          "body": "Nevermind, I found it. What a shit show, never seen so many controlling people in a single thread.",
          "created_utc": 1680573397.0
        }
      ]
    },
    {
      "id": "jf7orvx",
      "author": "mycatisamonsterbaby",
      "body": "I can't eat in front of other people if they aren't eating. It's impossible for me. So having you sit there and stare at me while I'm eating would mean that I would just be throwing food away. It's possible to have incompatible eating habits.",
      "created_utc": 1680803422.0,
      "score": 1,
      "context": [
        {
          "id": "jeulcn4",
          "author": "melkncookeys",
          "body": "It seems like that guy wants companionship. When I started dating my my fiancé with ARFID we would be able to go out to certain restaurants together, but then the new became old and I got sick of eating at the same places. He was very into his routine of eating one meal a day and never at home. I was looking to cook and enjoy exploring new restaurants. I cooked for myself and would eat alone. Our meal times never matched because I would eat 2-3 meals and he needed one big meal at an awkward time. It is lonely dating someone who has restrictions, but if you both put in work and willing to compromise there shouldn’t be hard feelings about. I don’t think he’s an asshole, I think he has needs that she isn’t able to give him and it’s a question on if that leaves them completely incompatible or if they can work with each other and be able to manage expectations.",
          "created_utc": 1680563369.0
        },
        {
          "id": "jevt5sc",
          "author": "nicekona",
          "body": "I think a lot of people assume that picky eaters are ALL “no we cant go there, there’s nothing I can eat” and find that isolating, like you said. But I’ll happily go to a Thai place where I can only eat a bowl of white rice, or just sit there and enjoy the company without eating at all. I’ll grab fast food on the way home, whatever.\n\nNot all picky eaters demand that you work around them, you know? I think that’s what some people fail to acknowledge. Sorry your experience has been difficult.",
          "created_utc": 1680584502.0
        }
      ]
    },
    {
      "id": "jf3v7od",
      "author": "gillebro",
      "body": "100%. They’re doing it for no reason, other than that it’s fun to embarrass others, I guess?",
      "created_utc": 1680730660.0,
      "score": 2,
      "context": [
        {
          "id": "jey790w",
          "author": "pallas3000",
          "body": "People who shit on picky eaters really made my ARFID worse as kid/teen. Now I know how to put up boundaries and they've become manageable. The access to an official diagnosis really helps as every time someone attempts to make a comment on the way I eat I just make the situation uncomfortable by saying \"well I have an eating disorder\".\n\nI think that throughout the years I also realised that most people have a really messed up relationship with food. Diet culture is so huge, clean eating and the wellness industry have such a strong grip on people's mind. Or just people who have trauma linked to poverty. My grand parents weren't always able to put food on the table (literally) for example. \n\nSo when I encounter these types comments I also try to have some empathy first. But I still speak up and tell them that people have eating disorders, sensory issues etc.",
          "created_utc": 1680632832.0
        },
        {
          "id": "jeyyvla",
          "author": "gillebro",
          "body": "Ok, straight up, you making things uncomfortable by saying you have an eating disorder makes you my newest hero, because that is awesome. Good on you for sticking up for yourself and working out a way to call them out on their unnecessary bullshit.",
          "created_utc": 1680643628.0
        },
        {
          "id": "jezp35f",
          "author": "pallas3000",
          "body": "Aww thank you. But yeah if they are the ones trying to make me feel uncomfortable with their comments it's only fair for it to backfire.",
          "created_utc": 1680655129.0
        }
      ]
    },
    {
      "id": "jevmj4d",
      "author": "ManifestoHero",
      "body": "[Here it is.](https://www.reddit.com/r/AmItheAsshole/comments/12a7mks/aita_for_refusing_to_take_my_girlfriend_to_nice/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button)",
      "created_utc": 1680580452.0,
      "score": 3,
      "context": [
        {
          "id": "jev5inv",
          "author": "ManifestoHero",
          "body": "Anyone got a link to that thread?",
          "created_utc": 1680572167.0
        },
        {
          "id": "jev87mj",
          "author": "ManifestoHero",
          "body": "Nevermind, I found it. What a shit show, never seen so many controlling people in a single thread.",
          "created_utc": 1680573397.0
        },
        {
          "id": "jevmbay",
          "author": "Sneezing_protractor",
          "body": "May I have the link?",
          "created_utc": 1680580328.0
        }
      ]
    },
    {
      "id": "jevslaz",
      "author": "Sneezing_protractor",
      "body": "Thank you. That is an awful thread.",
      "created_utc": 1680584116.0,
      "score": 7,
      "context": [
        {
          "id": "jev5inv",
          "author": "ManifestoHero",
          "body": "Anyone got a link to that thread?",
          "created_utc": 1680572167.0
        },
        {
          "id": "jev87mj",
          "author": "ManifestoHero",
          "body": "Nevermind, I found it. What a shit show, never seen so many controlling people in a single thread.",
          "created_utc": 1680573397.0
        },
        {
          "id": "jevmbay",
          "author": "Sneezing_protractor",
          "body": "May I have the link?",
          "created_utc": 1680580328.0
        },
        {
          "id": "jevmj4d",
          "author": "ManifestoHero",
          "body": "[Here it is.](https://www.reddit.com/r/AmItheAsshole/comments/12a7mks/aita_for_refusing_to_take_my_girlfriend_to_nice/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button)",
          "created_utc": 1680580452.0
        }
      ]
    }
  ]
}