{
  "id": "133sy7i",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1682863773.0,
  "title": "Don’t go to the Mt. Sinai ED clinic if you have ARFID",
  "selftext": "i wish i had a better way of getting this message around online, but as im just a teen with no online presence, r/arfid is my best bet\n\n**tw anorexia, bulimia, unhealthy restrictions**\n\nThe Mt. Sinai Eating Disorder Clinic of new york is supposed to be one of the best ed clinics in new york. it might be good for anorexia and bulimia, but its bad for arfid\n\nthey will impose strict eating rules (sleeves rolled up, hands always in staff’s sight, must eat everything given to you within 30 minutes, you must talk to staff while using bathroom to prevent bulimic behavior, no washing hands after meal, etc) on you that may be helpful for anorexics etc but are harmful for arfid patients. the staff have an extremely lacking understanding of ARFID and my impression from them is that they dont even know what it is.\n\nthe group therapy they do is extremely weight-oriented and body image oriented. not for arfid patients.\n\nif you are nauseous after a meal and/or having a panic attack, they are not helpful. they had no respect for my triggers either. the staff were rude and cold and unforgiving. i left the clinic for good after 2 days wrought with trauma that i still have today.\n\nTL;DR: not trying to trauma dump but to trauma *prevent*. if you have arfid do not go to the mt sinai ed clinic, you will leave more broken than when you entered",
  "url": "https://www.reddit.com/r/ARFID/comments/133sy7i/dont_go_to_the_mt_sinai_ed_clinic_if_you_have/",
  "score": 134,
  "num_comments": 21,
  "comments": [
    {
      "id": "jibku0t",
      "author": "xX0Angel_Kitty0Xx",
      "body": "God I hate when I tell someone I have an ED and their first impression is something along the lines of “don’t worry you’re beautiful” or like “is it because you don’t like your body” (etc.) \nI get that its mostly common for EDs but ARFID isn’t that well known compared to anorexia (and others).\n\nThank you for the warning to avoid this place",
      "created_utc": 1682871822.0,
      "score": 75,
      "context": []
    },
    {
      "id": "jibmxxg",
      "author": "nueve",
      "body": "Thank you for the warning and I'm sorry you had to go through that. I wonder if you can spread the news with a review on Google maps or Yelp or some such.",
      "created_utc": 1682872705.0,
      "score": 34,
      "context": []
    },
    {
      "id": "jic31vo",
      "author": "esor_rose",
      "body": "I went to McCallum Place in St. Louis, MO for most of my treatment (I went to treatment multiple times). It was good for me gaining weight and trying some foods, but not for much else. I developed body image issues in the center because I was forced to go to that group each week. They have a three week rotation of meals. I don’t know what to call it, they have a meal schedule that are scheduled for three week then repeats. Very unhelpful for me since I needed to try different foods. Everybody there was there for more than three weeks. Eating the same foods got boring for everyone. I was in the adolescent unit all four times I was there. I was residential for the first time I was there. It was hard being the only residential person from St. Louis while everyone who was also residential were out of state. PHP (where people got to go home each night) was also with us and it was hard seeing everyone else (a majority) leave each night while I had to stay. There were also kids (11-12 year olds) that were put in the adolescent unit because there was no where else to put them. So we couldn’t talk to about teen stuff and couldn’t watch movies rated above PG. I’ve also heard of an eight year old with the adolescents. I didn’t like that place. Also, they made us sit all the time. Except when they made us stand for 5-10 minutes while waiting for the staff to check the meals (while the other units just got to sit down because their food was already checked). I basically learned that “standing is exercise and exercise is bad”. For a short while after treatment I felt bad doing yoga because it’s exercise (even though we did yoga in treatment).",
      "created_utc": 1682879255.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jic4804",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1682879741.0,
      "score": 21,
      "context": []
    },
    {
      "id": "jibwzea",
      "author": "MMTardis",
      "body": "Yikes, I'm so sorry!",
      "created_utc": 1682876766.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jiclkdd",
      "author": "two-of-me",
      "body": "There is a place called Discovery that has an ARFID program. I think they have a few campuses on the east coast.",
      "created_utc": 1682887039.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jifp4vi",
      "author": "hamforbananas",
      "body": "Don't go to Roger's behavioral health either. Absolutely traumatic.",
      "created_utc": 1682951806.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jidv8b8",
      "author": "AbundantiaTheWitch",
      "body": "No washing hands?",
      "created_utc": 1682908081.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jie3z6b",
      "author": "Disastrous_Bus1904",
      "body": "searching for clinics myself currently. thank you for the warning. 🫶 i hope you’re okay",
      "created_utc": 1682912812.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jii901c",
      "author": "SadisticGoose",
      "body": "I’ve been through ED treatment at a different facility because I’ve had multiple EDs before, including ARFID. I had a similar experience.\n\nThere was a lot of pressure to finish your plate otherwise you’d get a supplement. I would literally gag as I tried to force down foods I knew I couldn’t eat. There were foods I managed to tolerate enough just to finish the plate that I’ve never eaten again. It was so humiliating to know that every week there were certain meals where I couldn’t eat anything and would have to just sit at the table staring at it and wait until it was time to go. \n\nThey encouraged exposure therapy, but it was at my discretion and pace. They accused me of being resistant to treatment because my bigger issue was a mood disorder, NOT my ED, and therefore didn’t relate to most of the treatment methods. I did end up in recovery from atypical anorexia, but I will probably be relapsing again soon because it never really helped my extremely unhealthy relationship with food.",
      "created_utc": 1682989724.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jl37ih1",
      "author": "None",
      "body": "Same exact thing with Alsana!!! DO NOT GO TO ALSANA IF YOU HAVE ARFID!!! I BEG YOU!!!\n\nHad the worst experience with Alsana Residential St. Louis. After WEEKS of talking with their clinicians and doctors about if they treat ARFID at their programs and lots of reassurance, I starved at this treatment center.\n\nWhen I first got there, they threw me directly into meal times without meeting any members of my team (dietitian, therapist, etc.) and refused to cater to any of my safe foods/ARFID resurrections. It took me bawling my eyes out and begging for help for a staff member to finally go get me a therapist to talk to. I was gaslighted about my ARFID and told that if I didn’t eat the food available, I would have to drink Boost and no other exceptions would be made. Prior to going and filling out the paperwork, I let the clinicians know that I only had about 10 safe foods I’ve been eating for my entire life and they promised this would not be a problem and that they would offer these to me at the beginning and slowly introduce food exposures and food chaining. At meal times I begged the workers for food (I had only eaten one banana since I arrived at the beginning of the week) and even with meeting with a series of dietitians and therapists, I was told that I had to either “challenge the eating disorder” or drink Boost (which is not one of my safe foods). I have never felt so dehumanized in my life at this place.\n\nIf you are thinking about going, feel free to message me any questions. I was so eager to get better and was considered a “perfect candidate” by their staff before I got there. I want to let anyone with ARFID know my story so that they don’t make the same mistake that I did.\n\nI rearranged my entire life to go get treatment (ending my lease, moving away from my partner I’ve lived with, going on leave for my job, spending money on plane tickets, etc.) and now I find myself having to move back into my parents house and having to rebuild my life after they promised I’d be gone for months, getting better.\n\nOnce again, the sick has to become their own doctor. That’s the reality of this disorder.\n\nOpen to any suggestions for ARFID treatment options out there!!",
      "created_utc": 1684710701.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m33g262",
      "author": "Even_Business8821",
      "body": "I’m so sorry to hear that! Which one of their programs were you in?",
      "created_utc": 1734758119.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jie8hgq",
      "author": "ggpersist",
      "body": "It's an unhelpful thing to say to someone with anorexia as well. Anorexia is about a compulsive drive to control body size and shape, not about vanity. Those comments can even paradoxically reinforce anorexic behavior. People just need to stop commenting on others' bodies in general, not just for people with ARFID.",
      "created_utc": 1682915570.0,
      "score": 18,
      "context": [
        {
          "id": "jibku0t",
          "author": "xX0Angel_Kitty0Xx",
          "body": "God I hate when I tell someone I have an ED and their first impression is something along the lines of “don’t worry you’re beautiful” or like “is it because you don’t like your body” (etc.) \nI get that its mostly common for EDs but ARFID isn’t that well known compared to anorexia (and others).\n\nThank you for the warning to avoid this place",
          "created_utc": 1682871822.0
        }
      ]
    },
    {
      "id": "jibod9j",
      "author": "None",
      "body": "hm i could try…thanks for the suggestion!",
      "created_utc": 1682873301.0,
      "score": 11,
      "context": [
        {
          "id": "jibmxxg",
          "author": "nueve",
          "body": "Thank you for the warning and I'm sorry you had to go through that. I wonder if you can spread the news with a review on Google maps or Yelp or some such.",
          "created_utc": 1682872705.0
        }
      ]
    },
    {
      "id": "jicg9jm",
      "author": "None",
      "body": "oml that is horrible…(sometimes i doubt whether they help anorexics too but) its definitely so bad for arfid patients",
      "created_utc": 1682884796.0,
      "score": 5,
      "context": [
        {
          "id": "jic31vo",
          "author": "esor_rose",
          "body": "I went to McCallum Place in St. Louis, MO for most of my treatment (I went to treatment multiple times). It was good for me gaining weight and trying some foods, but not for much else. I developed body image issues in the center because I was forced to go to that group each week. They have a three week rotation of meals. I don’t know what to call it, they have a meal schedule that are scheduled for three week then repeats. Very unhelpful for me since I needed to try different foods. Everybody there was there for more than three weeks. Eating the same foods got boring for everyone. I was in the adolescent unit all four times I was there. I was residential for the first time I was there. It was hard being the only residential person from St. Louis while everyone who was also residential were out of state. PHP (where people got to go home each night) was also with us and it was hard seeing everyone else (a majority) leave each night while I had to stay. There were also kids (11-12 year olds) that were put in the adolescent unit because there was no where else to put them. So we couldn’t talk to about teen stuff and couldn’t watch movies rated above PG. I’ve also heard of an eight year old with the adolescents. I didn’t like that place. Also, they made us sit all the time. Except when they made us stand for 5-10 minutes while waiting for the staff to check the meals (while the other units just got to sit down because their food was already checked). I basically learned that “standing is exercise and exercise is bad”. For a short while after treatment I felt bad doing yoga because it’s exercise (even though we did yoga in treatment).",
          "created_utc": 1682879255.0
        }
      ]
    },
    {
      "id": "jicg3tx",
      "author": "None",
      "body": "so sorry that happened to you my guy",
      "created_utc": 1682884728.0,
      "score": 4,
      "context": [
        {
          "id": "jic4804",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1682879741.0
        }
      ]
    },
    {
      "id": "jibzcl3",
      "author": "None",
      "body": "thanks, its all good i survived ✌️i sincerely hope people dont have to go through this",
      "created_utc": 1682877731.0,
      "score": 6,
      "context": [
        {
          "id": "jibwzea",
          "author": "MMTardis",
          "body": "Yikes, I'm so sorry!",
          "created_utc": 1682876766.0
        }
      ]
    },
    {
      "id": "jihf5ig",
      "author": "None",
      "body": "idk why 💀 i begged them to let me wash my hands covered in peanut butter and they finally let while someone watched me\n\nkinda weird tbh",
      "created_utc": 1682976448.0,
      "score": 2,
      "context": [
        {
          "id": "jidv8b8",
          "author": "AbundantiaTheWitch",
          "body": "No washing hands?",
          "created_utc": 1682908081.0
        }
      ]
    },
    {
      "id": "jihf8m5",
      "author": "None",
      "body": "hey good luck !! i wish you all the best and success :)",
      "created_utc": 1682976485.0,
      "score": 1,
      "context": [
        {
          "id": "jie3z6b",
          "author": "Disastrous_Bus1904",
          "body": "searching for clinics myself currently. thank you for the warning. 🫶 i hope you’re okay",
          "created_utc": 1682912812.0
        }
      ]
    },
    {
      "id": "jihteo7",
      "author": "AbundantiaTheWitch",
      "body": "I’d hate that since I’m autistic and can’t touch most food with my hands without needing to immediately wash them",
      "created_utc": 1682982686.0,
      "score": 5,
      "context": [
        {
          "id": "jidv8b8",
          "author": "AbundantiaTheWitch",
          "body": "No washing hands?",
          "created_utc": 1682908081.0
        },
        {
          "id": "jihf5ig",
          "author": "None",
          "body": "idk why 💀 i begged them to let me wash my hands covered in peanut butter and they finally let while someone watched me\n\nkinda weird tbh",
          "created_utc": 1682976448.0
        }
      ]
    },
    {
      "id": "jiid6w8",
      "author": "None",
      "body": "i have SPD and yeah same :(\n\nis it just me or do u hate it when ppl use their phones after eating food w their hands and not washing them lol",
      "created_utc": 1682991601.0,
      "score": 1,
      "context": [
        {
          "id": "jidv8b8",
          "author": "AbundantiaTheWitch",
          "body": "No washing hands?",
          "created_utc": 1682908081.0
        },
        {
          "id": "jihf5ig",
          "author": "None",
          "body": "idk why 💀 i begged them to let me wash my hands covered in peanut butter and they finally let while someone watched me\n\nkinda weird tbh",
          "created_utc": 1682976448.0
        },
        {
          "id": "jihteo7",
          "author": "AbundantiaTheWitch",
          "body": "I’d hate that since I’m autistic and can’t touch most food with my hands without needing to immediately wash them",
          "created_utc": 1682982686.0
        }
      ]
    },
    {
      "id": "jiidej0",
      "author": "AbundantiaTheWitch",
      "body": "I feel slightly uncomfortable with people touching anything after. I deal with other EDs as well so maybe it’s related to that but I just can’t touch",
      "created_utc": 1682991691.0,
      "score": 1,
      "context": [
        {
          "id": "jidv8b8",
          "author": "AbundantiaTheWitch",
          "body": "No washing hands?",
          "created_utc": 1682908081.0
        },
        {
          "id": "jihf5ig",
          "author": "None",
          "body": "idk why 💀 i begged them to let me wash my hands covered in peanut butter and they finally let while someone watched me\n\nkinda weird tbh",
          "created_utc": 1682976448.0
        },
        {
          "id": "jihteo7",
          "author": "AbundantiaTheWitch",
          "body": "I’d hate that since I’m autistic and can’t touch most food with my hands without needing to immediately wash them",
          "created_utc": 1682982686.0
        },
        {
          "id": "jiid6w8",
          "author": "None",
          "body": "i have SPD and yeah same :(\n\nis it just me or do u hate it when ppl use their phones after eating food w their hands and not washing them lol",
          "created_utc": 1682991601.0
        }
      ]
    }
  ]
}