{
  "id": "13o8lg6",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1684708553.0,
  "title": "DO NOT GO TO ALSANA IF YOU HAVE ARFID!!! I BEG YOU!!!",
  "selftext": "Had the worst experience with Alsana Residential St. Louis. After WEEKS of talking with their clinicians and doctors about if they treat ARFID at their programs and lots of reassurance, I starved at this treatment center. \n\nWhen I first got there, they threw me directly into meal times without meeting any members of my team (dietitian, therapist, etc.) and refused to cater to any of my safe foods/ARFID resurrections. It took me bawling my eyes out and begging for help for a staff member to finally go get me a therapist to talk to. I was gaslighted about my ARFID and told that if I didn’t eat the food available, I would have to drink Boost and no other exceptions would be made. Prior to going and filling out the paperwork, I let the clinicians know that I only had about 10 safe foods I’ve been eating for my entire life and they promised this would not be a problem and that they would offer these to me at the beginning and slowly introduce food exposures and food chaining. At meal times I begged the workers for food (I had only eaten one banana since I arrived at the beginning of the week) and even with meeting with a series of dietitians and therapists, I was told that I had to either “challenge the eating disorder” or drink Boost (which is not one of my safe foods). I have never felt so dehumanized in my life at this place. \n\nIf you are thinking about going, feel free to message me any questions. I was so eager to get better and was considered a “perfect candidate” by their staff before I got there. I want to let anyone with ARFID know my story so that they don’t make the same mistake that I did. \n\nI rearranged my entire life to go get treatment (ending my lease, moving away from my partner I’ve lived with, going on leave for my job, spending money on plane tickets, etc.) and now I find myself having to move back into my parents house and having to rebuild my life after they promised I’d be gone for months, getting better. \n\nOnce again, the sick has to become their own doctor. That’s the reality of this disorder. \n\nOpen to any suggestions for ARFID treatment options out there!!",
  "url": "https://www.reddit.com/r/ARFID/comments/13o8lg6/do_not_go_to_alsana_if_you_have_arfid_i_beg_you/",
  "score": 162,
  "num_comments": 19,
  "comments": [
    {
      "id": "jl3boha",
      "author": "zwyd",
      "body": "> I rearranged my entire life to go get treatment (ending my lease, moving away from my partner I’ve lived with, going on leave for my job, spending money on plane tickets, etc.)\n\nYou likely have legal rights here if it's something you're interested in pursuing. You were promised a specific treatment that you did not receive, and incurred significant financial damages as a result.",
      "created_utc": 1684712634.0,
      "score": 124,
      "context": []
    },
    {
      "id": "jl38sgj",
      "author": "kaleidoscopichazard",
      "body": "That sounds absolutely awful, I’m really sorry that happened to you. \n\nThat’s why I don’t readily trust any “ARFID clinics”. A lot of the time they lump it in with other eating disorders when it’s an entirely different type of ED and unfortunately most clinicians don’t understand it and it shows. \n\nWhat country are you in? There should be some regulatory psychological body that you can report them to",
      "created_utc": 1684711287.0,
      "score": 51,
      "context": []
    },
    {
      "id": "jl3a25f",
      "author": "RunaroundX",
      "body": "Definitely leave a review on Google maps",
      "created_utc": 1684711864.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jl366ab",
      "author": "yoteachthanks",
      "body": "I am so sorry this happened to you :(",
      "created_utc": 1684710091.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jl40vrn",
      "author": "DreamingintheTrees",
      "body": "I had a very similar experience with a place in Denver. Even worse when I left and they offered a “nutritional” therapist to see that didn’t practice with them and she tried to sell me an MLM product. I’m sorry you went through that.",
      "created_utc": 1684724783.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jl4vyn2",
      "author": "jizzyjazz2",
      "body": "i always wondered how exactly one of those treatment facilities would accomodate if the nutritional shakes were not a safe food of yours. i guess the answer is they don't accomodate at all. sorry that happened to you",
      "created_utc": 1684747175.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jl3zmgk",
      "author": "maidensuit",
      "body": "This is dreadful. I'm so sorry you were lied to by this clinic, after it cost you so much to go there. Horrific.",
      "created_utc": 1684724134.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jl7jq14",
      "author": "nutritionwithnaia",
      "body": "I’m so sorry you had such a terrible experience. Unfortunately I’ve had a lot of clients with ARFID or Rumination Syndrome be told by a treatment center that their needs will be met only to have the program have no idea how to actually help.\n\nThe place I’d recommend most for ARFID is ERC in Denver. Their team is very knowledgeable and accommodating for Arfid and I’ve had clients go there with good results. \n\nIf you’re looking to do outpatient I’d recommend getting together a treatment team (ex - doctor, dietitian, therapist, maybe occupational therapist if you have texture or swallowing issues). When you call places, ask them what they do for clients with your symptoms. Provide a scenario from your life and ask for specifics on what they would say/do to help you. That way, you can get a feel for their knowledge, their vibe, and free advice.",
      "created_utc": 1684790764.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jl4x58a",
      "author": "BringMeYourBullets",
      "body": "Sounds a lot like my experience with the health system and the eating disorder \"specialists\" in my country.",
      "created_utc": 1684748213.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jl8ib3b",
      "author": "lakelynneee",
      "body": "Someone here suggested ERC (eating recovery center)...\nI can vouch for ERC for ARFID treatment, to an extent. I went to their Huron St location in downtown Chicago - so I can only speak for that specific location - for 11 weeks (Nov '22 - Jan '23) -- 6 weeks living in residential & 5 weeks in their partial hospitalization program -- and while I honestly despised SO many aspects of it, I do think they had my best interest at heart. There were only one or two other patients who had ARFID the whole time I was there, and I really wasn't okay with the way their dietitians handled their treatment. I thankfully was blessed with Nicole and she went about it all in the right way. I ended up trying well over 30 foods while there.\n\nSome insight on my situation: upon admission, I was VERY underweight and malnourished and was only eating pizza, \"KIND\" brand cereal with vanilla oat milk, and any and all sweets, ice cream, donuts, candy, etc. That's all. And the pizza and cereal I had maybe once every few days, otherwise all processed sugars. I was losing my hair rapidly (my prized possession tbh), and it extremely affected my mental state. I was unsafe and back in a dark place in my mind that I've been in only a couple times before. So before ERC I spent 1 week in mental health inpatient, then 2 weeks in a 5-day/wk mental health partial hospitalization program, then went straight to ERC that following Monday. This is the important thing I'm trying to note: I was at a breaking point in my mental health & eating, where my only option was to force it into a turning point (and losing my hair was honestly my main motivator to try new foods lol). So in my case, I was ready to challenge tf outta my ARFID in order to get healthy. So I don't want to be blunt, but you have to have some sort of openness to change in order to challenge the ARFID and for treatment to actually do anything for you. Idk that'sssss just my two cents on it. And *imo* most ARFID cases are near IMPOSSIBLE to treat with anything less than inpatient or residential starting out..you can only do so much living at home while just attending PHP during the day, or IOP 3-4 days/week for a few hours, or outpatient.\n\nComing out of ERC, my body image was complete dogshit - but once home and not around others using \"traditional\" (lack of better word?) ED behaviors/mentalities, I accepted my body and rn I'm pissed I'm losing my weight I put on there. MY MAIN ABSOLUTE #1 INCREDIBLY HUGE COMPLAINT is that they didn't teach us how to cook. Nothing. Nada. Someone with ARFID typically has no idea anything about foods, meals, snacks, etc outside of their small list they've been eating for years. I firmly believe that because of this, I went home and instantly relapsed. Yeah, I tried all these foods AT treatment, when presented with the foods,, but no one showed me how to make them. How in the world is someone with ARFID supposed to just have magical motivation to touch and eat food they have no idea how to make, no idea how it feels, tastes, etc with no guidance (I don't live by family and don't engage in a social life sadly). AND I was just living off short term disability checks to pay my bills while in treatment for 4 months so I'm not necessarily in a place to buy food that probably won't turn out/I won't eat anyways. So yeah. If you do get treatment, for the love of all that is mighty, make sure someone is there to motivate you to progress once you get home !! All ED dietitians in my area DON'T take health insurance, so I've been trying to survive without one 😭\n\nSorry for my rant. I know your situation probably doesn't give you the opportunity to go back to treatment any time soon, but there are deeeecent places out there. But sadly, I feel like there's little to none that actually set ARFID patients up for continual success during/after treatment. \n\nHonorable mention: I am....familiar..with the residential ED unit at Rogers Memorial Hospital in Oconomowoc, WI and I'm def biased but I think their program is great and I've seen residents even with extremely severe cases have success  😊 (but also, I can't speak for anything that happened once they discharged though).\n\n2nd honorable mention: ~7 yrs ago I had a 2 hr Skype session hypnotherapy done by Felix Economakis and I was legit cured lmao it worked for a while since I had my ex supporting and encouraging me. But I got complacent and didn't continue trying new foods and allllll my fears came right back. But it was nice while it lasted, wish I would've put in the work.\n\nIf anyone has any questions about my experiences, I'm really open about my journey and my DM's are always open. Treatment options are out there! They're just not at all practiced and perfected for us atp in time. Hopefully things will get better.\n\n\nI really hope you get the treatment and find the recovery we all desperately need 🩷🩷 stay positive and try not to let this shitty situation discourage you from continuing to seek treatment. I hope things get better and you can get back on your feet in no time 😊",
      "created_utc": 1684806168.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lsn2wk4",
      "author": "ReasonableBroccoli56",
      "body": "I am so, so sorry this happened to you. You did not deserve to be mistreated this way. \n\n\n\nAnd thank you for the PSA. \n\nI am in a virtual PHP w/ Alsana and while my experience seems to be many magnitudes less bad than yours was, they still threw me into meal times w/o meeting with anyone on my team, meal time \"support\" is led by DCs (no formal medical/ED training, only a HS degree required), there's no way to get extra support when I'm having a difficult time (I sent multiple emails to my team one day bc I was having such a hard time, and only that night did they reply offering to meet with me the next day) and we have to spend time listening to podcasts and watching webinars that are really just ads for a book they're not providing us, and they play this to us over zoom! \n\n\n\nI cannot believe they're charging like $1500/day for podcasts!! I mean that's not all it is, but that should be 0% of it. Send me a podcast to listen to as homework? Sure I guess. Use 1-2/6 hours/day to listen to them? GTFO",
      "created_utc": 1729312757.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jl3tpjc",
      "author": "randomlygeneratedbss",
      "body": "Was coming here to say the same.",
      "created_utc": 1684721274.0,
      "score": 14,
      "context": [
        {
          "id": "jl3boha",
          "author": "zwyd",
          "body": "> I rearranged my entire life to go get treatment (ending my lease, moving away from my partner I’ve lived with, going on leave for my job, spending money on plane tickets, etc.)\n\nYou likely have legal rights here if it's something you're interested in pursuing. You were promised a specific treatment that you did not receive, and incurred significant financial damages as a result.",
          "created_utc": 1684712634.0
        }
      ]
    },
    {
      "id": "jl3kbyk",
      "author": "Desert_Fairy",
      "body": "St. Louis is in the US, but they may have traveled from overseas.",
      "created_utc": 1684716837.0,
      "score": 14,
      "context": [
        {
          "id": "jl38sgj",
          "author": "kaleidoscopichazard",
          "body": "That sounds absolutely awful, I’m really sorry that happened to you. \n\nThat’s why I don’t readily trust any “ARFID clinics”. A lot of the time they lump it in with other eating disorders when it’s an entirely different type of ED and unfortunately most clinicians don’t understand it and it shows. \n\nWhat country are you in? There should be some regulatory psychological body that you can report them to",
          "created_utc": 1684711287.0
        }
      ]
    },
    {
      "id": "jl6w21y",
      "author": "stinko_bun",
      "body": "I will literally keep shouting it from the mountaintops but I find it so infuriating that arfid gets lumped in with other eating disorders,,,,",
      "created_utc": 1684781537.0,
      "score": 7,
      "context": [
        {
          "id": "jl38sgj",
          "author": "kaleidoscopichazard",
          "body": "That sounds absolutely awful, I’m really sorry that happened to you. \n\nThat’s why I don’t readily trust any “ARFID clinics”. A lot of the time they lump it in with other eating disorders when it’s an entirely different type of ED and unfortunately most clinicians don’t understand it and it shows. \n\nWhat country are you in? There should be some regulatory psychological body that you can report them to",
          "created_utc": 1684711287.0
        }
      ]
    },
    {
      "id": "lsn2zxz",
      "author": "ReasonableBroccoli56",
      "body": "oh my god i'm so sorry",
      "created_utc": 1729312809.0,
      "score": 1,
      "context": [
        {
          "id": "jl40vrn",
          "author": "DreamingintheTrees",
          "body": "I had a very similar experience with a place in Denver. Even worse when I left and they offered a “nutritional” therapist to see that didn’t practice with them and she tried to sell me an MLM product. I’m sorry you went through that.",
          "created_utc": 1684724783.0
        }
      ]
    },
    {
      "id": "jl5673t",
      "author": "Riokaii",
      "body": "I've wondered how they expect to treat me when drinking a shake vs expanding my safe foods i would take the shake (never would choose it on my own, but they are at least tolerable and I can drink them if they are all thats available)\n\nI haven't yet heard an answer, because drinking the shakes and going out the door the same as I came in doesnt sound like treatment to me.",
      "created_utc": 1684754914.0,
      "score": 10,
      "context": [
        {
          "id": "jl4vyn2",
          "author": "jizzyjazz2",
          "body": "i always wondered how exactly one of those treatment facilities would accomodate if the nutritional shakes were not a safe food of yours. i guess the answer is they don't accomodate at all. sorry that happened to you",
          "created_utc": 1684747175.0
        }
      ]
    },
    {
      "id": "lsn3gg2",
      "author": "ReasonableBroccoli56",
      "body": "I'm so sorry so much crap happened to you! You deserve to be treated better.",
      "created_utc": 1729313056.0,
      "score": 1,
      "context": [
        {
          "id": "jl8ib3b",
          "author": "lakelynneee",
          "body": "Someone here suggested ERC (eating recovery center)...\nI can vouch for ERC for ARFID treatment, to an extent. I went to their Huron St location in downtown Chicago - so I can only speak for that specific location - for 11 weeks (Nov '22 - Jan '23) -- 6 weeks living in residential & 5 weeks in their partial hospitalization program -- and while I honestly despised SO many aspects of it, I do think they had my best interest at heart. There were only one or two other patients who had ARFID the whole time I was there, and I really wasn't okay with the way their dietitians handled their treatment. I thankfully was blessed with Nicole and she went about it all in the right way. I ended up trying well over 30 foods while there.\n\nSome insight on my situation: upon admission, I was VERY underweight and malnourished and was only eating pizza, \"KIND\" brand cereal with vanilla oat milk, and any and all sweets, ice cream, donuts, candy, etc. That's all. And the pizza and cereal I had maybe once every few days, otherwise all processed sugars. I was losing my hair rapidly (my prized possession tbh), and it extremely affected my mental state. I was unsafe and back in a dark place in my mind that I've been in only a couple times before. So before ERC I spent 1 week in mental health inpatient, then 2 weeks in a 5-day/wk mental health partial hospitalization program, then went straight to ERC that following Monday. This is the important thing I'm trying to note: I was at a breaking point in my mental health & eating, where my only option was to force it into a turning point (and losing my hair was honestly my main motivator to try new foods lol). So in my case, I was ready to challenge tf outta my ARFID in order to get healthy. So I don't want to be blunt, but you have to have some sort of openness to change in order to challenge the ARFID and for treatment to actually do anything for you. Idk that'sssss just my two cents on it. And *imo* most ARFID cases are near IMPOSSIBLE to treat with anything less than inpatient or residential starting out..you can only do so much living at home while just attending PHP during the day, or IOP 3-4 days/week for a few hours, or outpatient.\n\nComing out of ERC, my body image was complete dogshit - but once home and not around others using \"traditional\" (lack of better word?) ED behaviors/mentalities, I accepted my body and rn I'm pissed I'm losing my weight I put on there. MY MAIN ABSOLUTE #1 INCREDIBLY HUGE COMPLAINT is that they didn't teach us how to cook. Nothing. Nada. Someone with ARFID typically has no idea anything about foods, meals, snacks, etc outside of their small list they've been eating for years. I firmly believe that because of this, I went home and instantly relapsed. Yeah, I tried all these foods AT treatment, when presented with the foods,, but no one showed me how to make them. How in the world is someone with ARFID supposed to just have magical motivation to touch and eat food they have no idea how to make, no idea how it feels, tastes, etc with no guidance (I don't live by family and don't engage in a social life sadly). AND I was just living off short term disability checks to pay my bills while in treatment for 4 months so I'm not necessarily in a place to buy food that probably won't turn out/I won't eat anyways. So yeah. If you do get treatment, for the love of all that is mighty, make sure someone is there to motivate you to progress once you get home !! All ED dietitians in my area DON'T take health insurance, so I've been trying to survive without one 😭\n\nSorry for my rant. I know your situation probably doesn't give you the opportunity to go back to treatment any time soon, but there are deeeecent places out there. But sadly, I feel like there's little to none that actually set ARFID patients up for continual success during/after treatment. \n\nHonorable mention: I am....familiar..with the residential ED unit at Rogers Memorial Hospital in Oconomowoc, WI and I'm def biased but I think their program is great and I've seen residents even with extremely severe cases have success  😊 (but also, I can't speak for anything that happened once they discharged though).\n\n2nd honorable mention: ~7 yrs ago I had a 2 hr Skype session hypnotherapy done by Felix Economakis and I was legit cured lmao it worked for a while since I had my ex supporting and encouraging me. But I got complacent and didn't continue trying new foods and allllll my fears came right back. But it was nice while it lasted, wish I would've put in the work.\n\nIf anyone has any questions about my experiences, I'm really open about my journey and my DM's are always open. Treatment options are out there! They're just not at all practiced and perfected for us atp in time. Hopefully things will get better.\n\n\nI really hope you get the treatment and find the recovery we all desperately need 🩷🩷 stay positive and try not to let this shitty situation discourage you from continuing to seek treatment. I hope things get better and you can get back on your feet in no time 😊",
          "created_utc": 1684806168.0
        }
      ]
    },
    {
      "id": "jl6xkzj",
      "author": "jizzyjazz2",
      "body": "yeah thats exactly what ive been wondering too. i don't really get where the treatment part comes in. you have the option between something gross and physically inedible or a tasty shake. i guess it's what happens during the CBT sessions that i'm wondering about for which i haven't gotten any answer for. i don't expect there's some magical set of words you need to hear in order to awaken your will to improve.",
      "created_utc": 1684782138.0,
      "score": 4,
      "context": [
        {
          "id": "jl4vyn2",
          "author": "jizzyjazz2",
          "body": "i always wondered how exactly one of those treatment facilities would accomodate if the nutritional shakes were not a safe food of yours. i guess the answer is they don't accomodate at all. sorry that happened to you",
          "created_utc": 1684747175.0
        },
        {
          "id": "jl5673t",
          "author": "Riokaii",
          "body": "I've wondered how they expect to treat me when drinking a shake vs expanding my safe foods i would take the shake (never would choose it on my own, but they are at least tolerable and I can drink them if they are all thats available)\n\nI haven't yet heard an answer, because drinking the shakes and going out the door the same as I came in doesnt sound like treatment to me.",
          "created_utc": 1684754914.0
        }
      ]
    }
  ]
}