{
  "id": "146swlt",
  "subreddit": "ARFID",
  "author": "Glittering-Worth-365",
  "created_utc": 1686487093.0,
  "title": "Pain",
  "selftext": "",
  "url": "https://i.redd.it/isu21fuyvd5b1.png",
  "score": 252,
  "num_comments": 5,
  "comments": [
    {
      "id": "jns60ce",
      "author": "Chagdoo",
      "body": "Can we add \"food that tastes good\" to the list. \n\nI'm very lucky have sorta healthy safe foods, but they're also high on sodium. Finding low sodium a stuff I can eat, and also taste like....food, is killing me.",
      "created_utc": 1686493000.0,
      "score": 24,
      "context": []
    },
    {
      "id": "jntwkq3",
      "author": "geekgeek2019",
      "body": "plus sucks if u have other conditions. My hormonal imbalance wants me to eat less carbs to stay healthy but my safety food is only carbs T\\_T",
      "created_utc": 1686519797.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jns23j5",
      "author": "rpgsushilyfe",
      "body": "I relate to this too much 😅",
      "created_utc": 1686491120.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jnu6rcm",
      "author": "ZombieRU",
      "body": "I've slowly developed IBS symptoms over years and years, and has gotten to the point of having to go to a doctor about it. Of course, big thing is avoiding trigger foods and eliminating them and all that. Problem is, if I did that, I'd probably starve to death. But now every meal feels like spinning a roulette wheel of either it following up with little to no pain, or excruciating cramps that come in waves. Doctor said that worse case scenario, it's a gallbladder issue.\n\nEven though I've just started to get medical help, I'm still a young adult, and have experienced gastrointestinal issues since middle school. I've had ARFID since day 1, I'm not sure what kind I have, but the health problems are catching up to me fast (other stuff besides this but I digress), and am most likely going to have to take a grocery list of medications/vitamins/supplements to be able to manage through life physically, because this condition has so much control over my every day life",
      "created_utc": 1686524633.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jnt8lsc",
      "author": "amh8011",
      "body": "Bruh I just developed a gluten intolerance and I can’t afford it. I have relied on eating mostly gluten containing foods my entire life. I haven’t found good substitutes for so many of my safe foods. Bread has always been my biggest safe food. Gluten free bread sucks.",
      "created_utc": 1686509513.0,
      "score": 2,
      "context": []
    }
  ]
}