{
  "id": "14o87uw",
  "subreddit": "ARFID",
  "author": "Butt3rcup-",
  "created_utc": 1688252005.0,
  "title": "2 years ago i went to a clinic for arfid, here’s what I learned that might help you too",
  "selftext": "*based on personal experiences\n\nI once posted a long list on this sub of the techniques i’ve learned in clinic. I have received a lot of wholesome responses. Since it’s been almost exactly two years, I figured to repost it, as I think a lot of new people have found this sub who might benefit as well from this list. But be prepared on a very long read, just scroll through whatever interests/helps you…\n(Tl;dr of the tips in the comments) \n\n- Introduction\n\nI discovered I had Arfid when I was 16 and got the opportunity to receive treatment in the form of day therapy (at location from 9-5 with 3 sessions a day) for 4 weeks. I was 17 when I had this treatment. Looking back at it, being 19 now and living on my own for uni, cooking my own meals daily, the clinic really helped me to take my first steps into broadening my menu of foods, and lowering my anxiety to try new foods. I do think I made my biggest steps after treatment, yet without it I wouldn’t be where I am today. But I still struggle sometimes, still feel embarrassed, anxious when eating out or when friends/dates cook for me, and would always rather grab mcdonalds or another safe food. Although this has become much less severe than it was 3 years ago. \n\n- Techniques / tips for you\n\nYou might not be in the position to get diagnosed or receive treatment, I acknowledge it’s a privilege having received that. So for anyone out there trying to recover by themselves, here are some techniques I learned that helped me.\n\n1. Remember your motivation.\nWhen it gets difficult, remind yourself why you are doing this. Writing down your goals is very helpful. My goal was to be able to eat with friends, and to be able to cook more interesting and healthy meals for myself. \n\n2. Start with (very) small steps.\nLiterally baby steps. I started off with grapes. But I didn’t eat a whole portion the first time. I had to eat 1/4 grape. It may sound ridiculous to a lot of people but for me that was a huge step. And if that is still too much of a challenge for you, start off with smelling the food. Then let it touch your lips or your tongue. Maybe then chew it a couple of times and spit it out. Don’t expect to be able to eat a normal bite the first time, let alone the full meal. \n\n3. Acknowledge your thoughts. \nMost useful if you write it down in a scheme. (I made a template, ask me if you want it) this is a situation you have to eat food you have a lot of difficulty with. What is going on in your mind? Your thoughts heavily influence your behavior and feelings. Replacing these negative thoughts with helpful thoughts can make a big difference. For example we automatically think “oh no this looks disgusting, I can’t eat this”.  this makes us feel anxious and stressed. Eventually our behavior most likely leads to avoiding the food. Try to replace this thought with a more helpful one. Like: “I won’t be that bad, it looks tasty.” - “It looks similar to [food you like], maybe it tastes similar as well.” To call a few examples. This will lead into feeling more relaxed, even curious about the taste. Eventually our behavior leads to actually trying the food. \n\n4. Take control of the situation. \nIt can help to take control by choosing yourself the food you want to learn to eat. Prepare it yourself, (especially if it’s a composite meal) by doing this, you know the ingredients better and this takes a bit of the tension away. Then decide yourself how much you will eat, don’t feel pressured by anyone telling you should eat a full portion of something you have never eaten before. If you think 5 bites are big enough of a challenge for you, do that. \n\n5. Find a safe environment. \nReach out to people you feel safe with. There are always people willing to help you. If you feel pressured by your environment, look for a place where you can be alone when you try out new foods. Maybe you can find people who also struggle with eating and eat together. Maybe through video call. Supporting each other can make it a lot easier. For me it was so much fun to be able to rant about food and have others around me who feel the same. \n\n6. Set up a reward system. \nThis might works best for children. If you’re a parent trying to help your child, rewards are always effective. In clinic we got a point after succeeding a session. If we went a step further, we got 2 points. After saving up a certain amount of points, you could exchange it for a reward. Younger kids often got immediate small rewards after succeeding. Think of a sticker, getting 5 more minutes playtime outside, ice cream, a small toy, etc. Rewards motivate us highly. \n\n7. Try out relaxation exercises. \nNotice the way you are sitting in your chair while trying to eat something you’re struggling with. You might feel very tense. Try to find a comfortable position. Take a deep breath. Sometimes it helps to first tighten your muscles, and then slowly let go. Try it out with your shoulders for example. Do a little breathing exercise. Maybe even meditate. \n\n8. Sometimes it’s better to not scan the food before putting it in your mouth.\nIf you’re someone who scans the food from all sides before taking a bite, you might want to consider not doing that. By scanning the food, you notice all the little imperfections it has, which sets the bar higher to actually eat it. If you keep overthinking about that one spot that looked odd, eating it might make you feel more sick than if you didn’t notice that spot.\n\n9. Use a timer.\nSet a timer and try to eat a certain amount within that time. Or count down yourself and then take the bite at 1. You could also ask others to count for you.\n\n10. Write down your accomplishments. \nIt’s not as easy as it seems to others to take a bite of something you’ve never eaten before. So it’s an enormous accomplishment when you made that step. Write that down! It’s also nice to be able to reflect on the steps you’ve made after having written them down.\n\n11. Continue to challenge yourself.\nit will become easier each time you try something new. You get used to tasting new foods and the bar will become lower by time. Also, if you have tried a certain product and you hated it, you might need some time to get used to the flavor and texture. Maybe the second time you try it, it isn’t as gross as the first. Build up over time. Compare it to exercising. After the first days your muscles are very sore, but the more you exercise, the stronger you feel. After some time if you persevere, you’ll actually start to enjoy it and even feel the need to exercise without having to force yourself. \n\n12. Some foods taste better combined. \nDon’t be too hard on yourself! Some foods just taste better with a pinch of salt. Look for recipes with the product you want to learn to eat. Individually they might taste awful. But combined with something else, they actually add that extra flavor you didn’t know you needed. The same goes the other way around. If combined feels like too much of a challenge for you, separate it. Try it all individually, get to know the texture and flavor bit by bit. \n\n\nIf you have read everything so far, thank you, I appreciate it! I hope I could have helped you in a way to take some steps to make it little easier. Don’t hesitate reaching out to me if you have questions or comments. Even though I’m also still learning day by day, I hope to share my own knowledge and resources as much as possible to help one another.",
  "url": "https://www.reddit.com/r/ARFID/comments/14o87uw/2_years_ago_i_went_to_a_clinic_for_arfid_heres/",
  "score": 84,
  "num_comments": 12,
  "comments": [
    {
      "id": "jqbeysx",
      "author": "Butt3rcup-",
      "body": "TL;DR - the tips: \n1. Remember your motivation\n2. Start with very small steps\n3. Acknowledge your thoughts\n4. Take control of the situation\n5. Find a safe environment\n6. Set up a reward system\n7. Try out relaxation exercises \n8. Don’t scan the food\n9. Use a timer\n10. Write down your accomplishments\n11. Continue to challenge yourself\n12. Some foods taste better combined",
      "created_utc": 1688252188.0,
      "score": 29,
      "context": []
    },
    {
      "id": "jqdaqg2",
      "author": "Butt3rcup-",
      "body": "the post was too long, but I originally included a list of foods and drinks i eat and drink now (on a regular basis) that i didn’t before:\n\n- tomatoes\n- mozzarella \n- eggs\n- bacon\n- pesto\n- orange juice\n- fresh spinach\n- courgette (zucchini)\n- onion (in meals)\n- olives\n- feta cheese\n- noodles\n- banana bread\n- gyoza / dumplings\n- matcha tea / latte\n- wraps\n- soy milk\n- miso soup / ramen\n- yoghurt\n- vegetarian meat\n- crème fraîche (in meals)\n- arugula (rucola)\n- fresh rosemary (in meals)\n- tomato soup\n\n(I have to mention I am not the most severe case that I only ate for example pop-tarts all day long, but my food palette was very limited, also to only certain brands or certain exact recipes)",
      "created_utc": 1688296734.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jqc83zr",
      "author": "Thatswright93",
      "body": "Excellent post, thank you so much for the tips! Definitely trying number 6 and 9",
      "created_utc": 1688267478.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jqcbcnr",
      "author": "None",
      "body": "Thank you for this 🙂",
      "created_utc": 1688269388.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jqczml3",
      "author": "Dramatic-Growth1335",
      "body": "Great advice 😃👍",
      "created_utc": 1688287483.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jqebhqz",
      "author": "RemoteBeginning3339",
      "body": "Thank you so much for this! Can I ask where were you able to do the 4 week day therapy? Our local university eating disorder clinic does not treat ARFID, just anorexia/bulimia",
      "created_utc": 1688315430.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jqfv8cg",
      "author": "hswish87",
      "body": "As a parent of a child with ARFID, I appreciate your post.  However, I want to caution against rewards for children.  This may work for some but can also backfire.  Some children experience extreme anxiety with new foods or eating in general.  Incentivizing can actually increase the anxiety.  The desire to get the reward runs up against the fear/anxiety and can compound it.\n\nMy son will fall into a complete meltdown if we use rewards systems because he desperately wants the reward but is still too afraid to try the food.\n\nWe have found greater success with a low to no stress approach where we offer him opportunities to pick out new things to try but we do not push or offer rewards. We actively seek to limit the association of stress or anxiety with food and meals.\n\nYour post has great tips for when he is older... I just want to caution on using rewards for kids.  It can backfire. I am adding a link to a book that does cover removing the stress for kids.\n\nHelping Your Child with Extreme Picky Eating: A Step-by-Step Guide for Overcoming Selective Eating, Food Aversion, and Feeding Disorders https://a.co/d/dwEsCWA",
      "created_utc": 1688340048.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jqdvp20",
      "author": "Miserable-Coffee",
      "body": "This is going to be so hard to do. Thanks for sharing I can't wait to try them out",
      "created_utc": 1688308466.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jqd9lvs",
      "author": "Butt3rcup-",
      "body": "My pleasure:) hope they work out for you!",
      "created_utc": 1688295872.0,
      "score": 3,
      "context": [
        {
          "id": "jqc83zr",
          "author": "Thatswright93",
          "body": "Excellent post, thank you so much for the tips! Definitely trying number 6 and 9",
          "created_utc": 1688267478.0
        }
      ]
    },
    {
      "id": "jqfyb4w",
      "author": "Butt3rcup-",
      "body": "In the Netherlands, not from an university ED clinic though. The clinic i went to was specialized in ARFID",
      "created_utc": 1688341546.0,
      "score": 2,
      "context": [
        {
          "id": "jqebhqz",
          "author": "RemoteBeginning3339",
          "body": "Thank you so much for this! Can I ask where were you able to do the 4 week day therapy? Our local university eating disorder clinic does not treat ARFID, just anorexia/bulimia",
          "created_utc": 1688315430.0
        }
      ]
    },
    {
      "id": "jqfyyad",
      "author": "Butt3rcup-",
      "body": "Wouldn’t say it was easy, I definitely had my panic attacks in my first week of the clinic. Although after gaining some more control of the situation, being able to suggest what I wanted to  learn to eat, it got a little bit more motivating and comfortable in a way. Some need more time than others, but after a while it will definitely become more accustomed",
      "created_utc": 1688341861.0,
      "score": 2,
      "context": [
        {
          "id": "jqdvp20",
          "author": "Miserable-Coffee",
          "body": "This is going to be so hard to do. Thanks for sharing I can't wait to try them out",
          "created_utc": 1688308466.0
        }
      ]
    },
    {
      "id": "jqwk62w",
      "author": "RemoteBeginning3339",
      "body": "Thank you!",
      "created_utc": 1688659188.0,
      "score": 1,
      "context": [
        {
          "id": "jqebhqz",
          "author": "RemoteBeginning3339",
          "body": "Thank you so much for this! Can I ask where were you able to do the 4 week day therapy? Our local university eating disorder clinic does not treat ARFID, just anorexia/bulimia",
          "created_utc": 1688315430.0
        },
        {
          "id": "jqfyb4w",
          "author": "Butt3rcup-",
          "body": "In the Netherlands, not from an university ED clinic though. The clinic i went to was specialized in ARFID",
          "created_utc": 1688341546.0
        }
      ]
    }
  ]
}