{
  "id": "14rxwf8",
  "subreddit": "ARFID",
  "author": "jskoker",
  "created_utc": 1688617864.0,
  "title": "Dating with ARFID in a sea of 'foodies' and 'let's try new resturants'",
  "selftext": "",
  "url": "https://i.redd.it/njkrb2fmv9ab1.gif",
  "score": 155,
  "num_comments": 37,
  "comments": [
    {
      "id": "jqun1oa",
      "author": "Nervous-Worry6092",
      "body": "If you don’t like Korean BBQ or sushi, you’re fucked",
      "created_utc": 1688618047.0,
      "score": 82,
      "context": []
    },
    {
      "id": "jqup64x",
      "author": "lekkermuff",
      "body": "My little sister admitted the other day she wouldnt be able to date someone with my eating habits. I appreciate the honesty but damn did it hurt a bit.",
      "created_utc": 1688619381.0,
      "score": 60,
      "context": []
    },
    {
      "id": "jquvway",
      "author": "sugark30",
      "body": "i won’t go on dates anymore. i don’t want to eat in front of any guy and it sucks",
      "created_utc": 1688624011.0,
      "score": 41,
      "context": []
    },
    {
      "id": "jqupx83",
      "author": "moonshadowwww16",
      "body": "this is going to sound fucked up, but I'm \"glad\" I found a partner who grew up in poverty because he's always saying \"it's good that you're eating anything at all\" because that was their motto when they didn't have money. different reasons, but he still can relate to an extent, which makes it much easier.\n\nin the past, I had partners who would literally yell at me for eating pizza for the 5th time this week...",
      "created_utc": 1688619866.0,
      "score": 46,
      "context": []
    },
    {
      "id": "jqwm3h6",
      "author": "JanMonet",
      "body": "Growing up my dad always used to tell me no one would ever want to date me because of my limited diet. I definitely internalized that and now am terrified of someone judging for my food choices. It is just easier not to date.",
      "created_utc": 1688659948.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jqw1i69",
      "author": "None",
      "body": "I still can't fathom why so many women (I'm sure a number of guys might too, but I never looked for men in OLD) made a point of saying no picky eaters in the profiles. Is it worth using 3 of your limited words on that? It might as well have been inscribed in blood.\n\nFine, preference but I can't see any logic in it. Friends and people I worked with don't really care what I eat after giving them the rundown.",
      "created_utc": 1688651669.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jqumxml",
      "author": "Nervous-Worry6092",
      "body": "This. So much this.",
      "created_utc": 1688617977.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jqvzab2",
      "author": "snrten",
      "body": "I'm in this sub because my partner of the last 5 years has ARFID. I can confidently say, I never want to go out to sit down and eat either, anyway lol\n\nNone of our first dates involved food at all, and that's a pretty easy route to take! Go on hikes, walk your dogs together, go bowling or skating or to the movies. We met on a dating app, too.",
      "created_utc": 1688650694.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jqw9rim",
      "author": "LolaTigre",
      "body": "I also have a lot of anxiety about this- so many profiles say “We’ll get along if… you like to try new foods” or “you’re a foodie” or “you want to cook together.” \n\nBut my lived reality is that I have found partners who were supportive & kind about it. Maybe some aspects bothered them, like never being able to cook 1 meal & eat together (I always make my own meals), but whatever annoyance they had never came close to superseding their affection for me & my myriad other great qualities. I literally lived with a chef for 8 years- he would eat anything at any time & liked to cook. But he got me and we would compromise. \n\nI guess all that to say, even tho I am single now and it feels hopeless that someone could love me, neuroses & all, it has happened & could happen again! The people who don’t care probably just don’t stand out cause no one puts “I don’t care if you have an eating disorder” in their profiles, lol.",
      "created_utc": 1688655083.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jqwoxj2",
      "author": "_FirstOfHerName_",
      "body": "Dating a foodie is why I'm in recovery.",
      "created_utc": 1688661038.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jqxh2uf",
      "author": "LokiLunatic",
      "body": "That angry stare from the crowd hits too close to home. 😂",
      "created_utc": 1688671878.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jqv3f5n",
      "author": "itsokghost",
      "body": "It’s painful ><",
      "created_utc": 1688629880.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jqvmzpt",
      "author": "LuckyNumberthe13",
      "body": "One of my biggest fears as a kid lol. So glad I ended up being aromantic",
      "created_utc": 1688644490.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jqwmbn3",
      "author": "angeltay",
      "body": "My fiancé will eat anything and everything. His favorite food is my least favorite food: meat. What we do is work hard to find restaurants that have something for both of us on the menu. Sometimes for me, it’s just an appetizer. But at the end of the day, this disorder has completely wrecked my relationship with food to the point where it brings more stress than enjoyment. So I don’t care if I can’t get a full entree. I don’t care if I just have a soda or a beer. I’m just there to hang out with him.",
      "created_utc": 1688660035.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jqupt77",
      "author": "Kelekona",
      "body": "Mom wanted to go to a steakhouse, I was cool with it because I've been wanting a baked potato, but I have a feeling that I made the waitress feel bad.  (I can eat meat, it's just not worth ordering pricey meat when I can't really chew it with no teeth.)\n\nI know it's not really the same when y'all probably can't even deal with side-dishes or watching other people eat the equivalent of chilled monkey brains.",
      "created_utc": 1688619793.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jqwe6fd",
      "author": "peanutbutternmtn",
      "body": "My wife is a foodie. Its kind of a miracle our relationship works as well as it does.",
      "created_utc": 1688656851.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jr85joy",
      "author": "The_water-melon",
      "body": "The minute I see “foodie” in someone’s bio, I swipe left cause they sure as hell ain’t gonna like me",
      "created_utc": 1688867291.0,
      "score": 3,
      "context": []
    },
    {
      "id": "krjgr5m",
      "author": "Obvious-Spread3685",
      "body": "I just watched an instagram story of my old group of friends at a Korean BBQ restaurant with a Hoard of greasy food that I would probably enjoy but be unable to get down my throat, and it not only makes me feel incredibly annoyed that I would feel sick at the sight of that food based on the thought of trying to consume it but I cannot fathom how someone could eat that much food without feeling full after 20 minutes or getting overwhelmed. It scares me, for when I try and start dating because there are most likely not a lot of people out there that will be patient or understand what I go through with food, it feels like a problem that is impossible to get over, somedays I am okay but others, even eating on my own I'll feel that nauseas feeling, it can be not just about what I'm eating but how fast, meaning I can't really keep up with everyone's pace and I've always been super slow.",
      "created_utc": 1708564245.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jqw8qaz",
      "author": "LolaTigre",
      "body": "Or tacos! So many people seem to feel that loving tacos is their personality!",
      "created_utc": 1688654666.0,
      "score": 37,
      "context": [
        {
          "id": "jqun1oa",
          "author": "Nervous-Worry6092",
          "body": "If you don’t like Korean BBQ or sushi, you’re fucked",
          "created_utc": 1688618047.0
        }
      ]
    },
    {
      "id": "jqwmjgi",
      "author": "angeltay",
      "body": "I feel so bad, my fiancé will crave sushi sometimes but he won’t order it in, because he knows I won’t want anything. I have to beg him to buy himself sushi, sometimes I convince him by ordering edamame beans or tempura vegetables 😅\n\nHe also works for a Korean company so he feels terrible because every work event is KBBQ but I’ve made it work so far 😂",
      "created_utc": 1688660121.0,
      "score": 10,
      "context": [
        {
          "id": "jqun1oa",
          "author": "Nervous-Worry6092",
          "body": "If you don’t like Korean BBQ or sushi, you’re fucked",
          "created_utc": 1688618047.0
        }
      ]
    },
    {
      "id": "jquyezu",
      "author": "nomoreadminspls",
      "body": "Yeah, I've definitely been at this point.\n\nI was fortunate enough to find someone who introduced me to this sub and got me diagnosed, but it's difficult.\n\nI will say this the only people who have rejected me because of Arfid have shown their lack of character in doing so.\n\nIt is a poor reflection on them, not you, you haven't done anything wrong.",
      "created_utc": 1688625891.0,
      "score": 17,
      "context": [
        {
          "id": "jquvway",
          "author": "sugark30",
          "body": "i won’t go on dates anymore. i don’t want to eat in front of any guy and it sucks",
          "created_utc": 1688624011.0
        }
      ]
    },
    {
      "id": "jr02d1z",
      "author": "None",
      "body": "I’m a guy and I also don’t want to eat in front of any girls, so I always ask people to go on non-foodie dates first. This was usually going for drinks but I’ve quit drinking so I have no clue what to do now😂 it does suck!",
      "created_utc": 1688720085.0,
      "score": 5,
      "context": [
        {
          "id": "jquvway",
          "author": "sugark30",
          "body": "i won’t go on dates anymore. i don’t want to eat in front of any guy and it sucks",
          "created_utc": 1688624011.0
        }
      ]
    },
    {
      "id": "jquy97g",
      "author": "nomoreadminspls",
      "body": "Yeah...",
      "created_utc": 1688625769.0,
      "score": 7,
      "context": [
        {
          "id": "jqupx83",
          "author": "moonshadowwww16",
          "body": "this is going to sound fucked up, but I'm \"glad\" I found a partner who grew up in poverty because he's always saying \"it's good that you're eating anything at all\" because that was their motto when they didn't have money. different reasons, but he still can relate to an extent, which makes it much easier.\n\nin the past, I had partners who would literally yell at me for eating pizza for the 5th time this week...",
          "created_utc": 1688619866.0
        }
      ]
    },
    {
      "id": "jqy0jwq",
      "author": "saintnobody5",
      "body": "Your dad is wrong. I know that’s so hard to believe after so long but it’s true. My parents did the same thing to me. Said any guy that wanted to date me would have to take me somewhere with a good kids menu and that would get old fast. That no one wants a wife who can’t cook a variety of meals. Well my husband and I have been together for over 5 years and he’s never once judged my eating. He even took me to red robin before proposing because he knows how much I like a simple restaurant burger and fries and makes sure his family has food for me at gatherings. Anyone that judges us isn’t worth our time, not the other way around.",
      "created_utc": 1688679398.0,
      "score": 9,
      "context": [
        {
          "id": "jqwm3h6",
          "author": "JanMonet",
          "body": "Growing up my dad always used to tell me no one would ever want to date me because of my limited diet. I definitely internalized that and now am terrified of someone judging for my food choices. It is just easier not to date.",
          "created_utc": 1688659948.0
        }
      ]
    },
    {
      "id": "jqyb40s",
      "author": "BangZhang",
      "body": "That’s just not true. My girlfriend is 100% understanding about it and never makes it a big deal. She’s encouraged me to try new foods but she knows there’s a possibility I might gag which is not a problem for her.",
      "created_utc": 1688683850.0,
      "score": 6,
      "context": [
        {
          "id": "jqwm3h6",
          "author": "JanMonet",
          "body": "Growing up my dad always used to tell me no one would ever want to date me because of my limited diet. I definitely internalized that and now am terrified of someone judging for my food choices. It is just easier not to date.",
          "created_utc": 1688659948.0
        }
      ]
    },
    {
      "id": "jqxzuif",
      "author": "saintnobody5",
      "body": "Those people just concern me… I have ARFID from a combination of my umbilical cord being wrapped around my throat at birth and a father who would physically force food down our throats(at least that’s what my therapist and I have concluded together as the causes). All I can imagine when I see any profiles like that are a bunch of potential parents who will be causing the same problems for their kids as my dad did to me.",
      "created_utc": 1688679109.0,
      "score": 7,
      "context": [
        {
          "id": "jqw1i69",
          "author": "None",
          "body": "I still can't fathom why so many women (I'm sure a number of guys might too, but I never looked for men in OLD) made a point of saying no picky eaters in the profiles. Is it worth using 3 of your limited words on that? It might as well have been inscribed in blood.\n\nFine, preference but I can't see any logic in it. Friends and people I worked with don't really care what I eat after giving them the rundown.",
          "created_utc": 1688651669.0
        }
      ]
    },
    {
      "id": "jrncftq",
      "author": "onlytoask",
      "body": "If you actually want to know and aren't just venting it's because picky eaters are a pain if you like to go out to eat as an activity. It's no fun going to a restaurant with someone that gets chicken fingers every time never mind someone that won't go out to eat at all. Since eating is one of *the* major social activities, particularly as part of a date it's not something people want to deal with. They don't want to deal with it. I've seen something to the effect of \"why does it matter what I eat, they can get whatever they want\" but that's missing the point. It's like going to an amusement park and your date won't go on any of the rides with you.\n\nIt only gets worse if the relationship gets serious because now your own dinners in your own home either have to be separate (which is a hassle and an expense) or you're locked into eating whatever couple of things this other person can stomach. \n\nFood is one of the dominant factors of life, it shouldn't be surprising that it seriously effects romantic relationships.",
      "created_utc": 1689154190.0,
      "score": 2,
      "context": [
        {
          "id": "jqw1i69",
          "author": "None",
          "body": "I still can't fathom why so many women (I'm sure a number of guys might too, but I never looked for men in OLD) made a point of saying no picky eaters in the profiles. Is it worth using 3 of your limited words on that? It might as well have been inscribed in blood.\n\nFine, preference but I can't see any logic in it. Friends and people I worked with don't really care what I eat after giving them the rundown.",
          "created_utc": 1688651669.0
        }
      ]
    },
    {
      "id": "jquy7zt",
      "author": "nomoreadminspls",
      "body": "Yuuuuuuup",
      "created_utc": 1688625743.0,
      "score": 1,
      "context": [
        {
          "id": "jqumxml",
          "author": "Nervous-Worry6092",
          "body": "This. So much this.",
          "created_utc": 1688617977.0
        }
      ]
    },
    {
      "id": "jqwei2x",
      "author": "LanaDelHeeey",
      "body": "You know what’s funny once I started eating tacos I would go to like Chipotle or whatever with my friends and they would still complain about how I’m wasting money on tacos where a bowl is the same price and full of many more calories worth of shit that’s revolting to me like beans. I know they’re just trying to get me the best value for my money, but still.",
      "created_utc": 1688656978.0,
      "score": 11,
      "context": [
        {
          "id": "jqun1oa",
          "author": "Nervous-Worry6092",
          "body": "If you don’t like Korean BBQ or sushi, you’re fucked",
          "created_utc": 1688618047.0
        },
        {
          "id": "jqw8qaz",
          "author": "LolaTigre",
          "body": "Or tacos! So many people seem to feel that loving tacos is their personality!",
          "created_utc": 1688654666.0
        }
      ]
    },
    {
      "id": "jqxy1za",
      "author": "saintnobody5",
      "body": "This makes me laugh because I survived for 8 years solely on bean and cheese tacos because that was my only safe food. So it is indeed, my personality. 😂",
      "created_utc": 1688678395.0,
      "score": 5,
      "context": [
        {
          "id": "jqun1oa",
          "author": "Nervous-Worry6092",
          "body": "If you don’t like Korean BBQ or sushi, you’re fucked",
          "created_utc": 1688618047.0
        },
        {
          "id": "jqw8qaz",
          "author": "LolaTigre",
          "body": "Or tacos! So many people seem to feel that loving tacos is their personality!",
          "created_utc": 1688654666.0
        }
      ]
    },
    {
      "id": "jquzuqn",
      "author": "sugark30",
      "body": "i guess so. but most people see my arfid as just being childish. they judge me and say “grow up” since i kind of eat like a child.",
      "created_utc": 1688626989.0,
      "score": 17,
      "context": [
        {
          "id": "jquvway",
          "author": "sugark30",
          "body": "i won’t go on dates anymore. i don’t want to eat in front of any guy and it sucks",
          "created_utc": 1688624011.0
        },
        {
          "id": "jquyezu",
          "author": "nomoreadminspls",
          "body": "Yeah, I've definitely been at this point.\n\nI was fortunate enough to find someone who introduced me to this sub and got me diagnosed, but it's difficult.\n\nI will say this the only people who have rejected me because of Arfid have shown their lack of character in doing so.\n\nIt is a poor reflection on them, not you, you haven't done anything wrong.",
          "created_utc": 1688625891.0
        }
      ]
    },
    {
      "id": "jqvyni6",
      "author": "snrten",
      "body": "It *does* sound fucked up, eh?",
      "created_utc": 1688650408.0,
      "score": 1,
      "context": [
        {
          "id": "jqupx83",
          "author": "moonshadowwww16",
          "body": "this is going to sound fucked up, but I'm \"glad\" I found a partner who grew up in poverty because he's always saying \"it's good that you're eating anything at all\" because that was their motto when they didn't have money. different reasons, but he still can relate to an extent, which makes it much easier.\n\nin the past, I had partners who would literally yell at me for eating pizza for the 5th time this week...",
          "created_utc": 1688619866.0
        },
        {
          "id": "jquy97g",
          "author": "nomoreadminspls",
          "body": "Yeah...",
          "created_utc": 1688625769.0
        }
      ]
    },
    {
      "id": "jroqyzy",
      "author": "None",
      "body": "It seemed to come up a heck of a lot for being in a non massively populated area and only set within 10 or so miles, so it was a bit curious to me why it seemed like half the people said it. I think it just irks me as seeing those words appear just reminds me that I can't walk away from it while virtually everyone can. That's probably why it all came off a bit resentful at first. I don't want to deal with this either. It's fair enough that nobody else does.\n\nNow I think more, I suppose it's just that conveyor belt format of OLD that gives it that sort of 'no fat chicks' energy that I've never noticed IRL. That's probably what I was mostly perplexed about",
      "created_utc": 1689179391.0,
      "score": 2,
      "context": [
        {
          "id": "jqw1i69",
          "author": "None",
          "body": "I still can't fathom why so many women (I'm sure a number of guys might too, but I never looked for men in OLD) made a point of saying no picky eaters in the profiles. Is it worth using 3 of your limited words on that? It might as well have been inscribed in blood.\n\nFine, preference but I can't see any logic in it. Friends and people I worked with don't really care what I eat after giving them the rundown.",
          "created_utc": 1688651669.0
        },
        {
          "id": "jrncftq",
          "author": "onlytoask",
          "body": "If you actually want to know and aren't just venting it's because picky eaters are a pain if you like to go out to eat as an activity. It's no fun going to a restaurant with someone that gets chicken fingers every time never mind someone that won't go out to eat at all. Since eating is one of *the* major social activities, particularly as part of a date it's not something people want to deal with. They don't want to deal with it. I've seen something to the effect of \"why does it matter what I eat, they can get whatever they want\" but that's missing the point. It's like going to an amusement park and your date won't go on any of the rides with you.\n\nIt only gets worse if the relationship gets serious because now your own dinners in your own home either have to be separate (which is a hassle and an expense) or you're locked into eating whatever couple of things this other person can stomach. \n\nFood is one of the dominant factors of life, it shouldn't be surprising that it seriously effects romantic relationships.",
          "created_utc": 1689154190.0
        }
      ]
    },
    {
      "id": "jqxj3hx",
      "author": "lucksh0t",
      "body": "You can get a Chipotle bowl without beans. It's one of my safe foods and I just get white race cheese and chicken.",
      "created_utc": 1688672651.0,
      "score": 3,
      "context": [
        {
          "id": "jqun1oa",
          "author": "Nervous-Worry6092",
          "body": "If you don’t like Korean BBQ or sushi, you’re fucked",
          "created_utc": 1688618047.0
        },
        {
          "id": "jqw8qaz",
          "author": "LolaTigre",
          "body": "Or tacos! So many people seem to feel that loving tacos is their personality!",
          "created_utc": 1688654666.0
        },
        {
          "id": "jqwei2x",
          "author": "LanaDelHeeey",
          "body": "You know what’s funny once I started eating tacos I would go to like Chipotle or whatever with my friends and they would still complain about how I’m wasting money on tacos where a bowl is the same price and full of many more calories worth of shit that’s revolting to me like beans. I know they’re just trying to get me the best value for my money, but still.",
          "created_utc": 1688656978.0
        }
      ]
    },
    {
      "id": "jqv7y08",
      "author": "watcher4483",
      "body": "God I relate to this so much",
      "created_utc": 1688633649.0,
      "score": 13,
      "context": [
        {
          "id": "jquvway",
          "author": "sugark30",
          "body": "i won’t go on dates anymore. i don’t want to eat in front of any guy and it sucks",
          "created_utc": 1688624011.0
        },
        {
          "id": "jquyezu",
          "author": "nomoreadminspls",
          "body": "Yeah, I've definitely been at this point.\n\nI was fortunate enough to find someone who introduced me to this sub and got me diagnosed, but it's difficult.\n\nI will say this the only people who have rejected me because of Arfid have shown their lack of character in doing so.\n\nIt is a poor reflection on them, not you, you haven't done anything wrong.",
          "created_utc": 1688625891.0
        },
        {
          "id": "jquzuqn",
          "author": "sugark30",
          "body": "i guess so. but most people see my arfid as just being childish. they judge me and say “grow up” since i kind of eat like a child.",
          "created_utc": 1688626989.0
        }
      ]
    },
    {
      "id": "jqxz09z",
      "author": "saintnobody5",
      "body": "Hey I just want you to know that they’re the ones being childish for being offended over something that literally doesn’t affect them. And that there are amazing people out there that completely respect our eating habits. My husband is the absolute sweetest at dealing with my many food problems, and has asked for a meal to be fixed many times when I was too anxious to. He’s never once made me feel weird or less than. Whether it’s friendship or a SO, supportive people are there; they just stand out less than the rude ones. But they’re so worth finding.",
      "created_utc": 1688678774.0,
      "score": 9,
      "context": [
        {
          "id": "jquvway",
          "author": "sugark30",
          "body": "i won’t go on dates anymore. i don’t want to eat in front of any guy and it sucks",
          "created_utc": 1688624011.0
        },
        {
          "id": "jquyezu",
          "author": "nomoreadminspls",
          "body": "Yeah, I've definitely been at this point.\n\nI was fortunate enough to find someone who introduced me to this sub and got me diagnosed, but it's difficult.\n\nI will say this the only people who have rejected me because of Arfid have shown their lack of character in doing so.\n\nIt is a poor reflection on them, not you, you haven't done anything wrong.",
          "created_utc": 1688625891.0
        },
        {
          "id": "jquzuqn",
          "author": "sugark30",
          "body": "i guess so. but most people see my arfid as just being childish. they judge me and say “grow up” since i kind of eat like a child.",
          "created_utc": 1688626989.0
        }
      ]
    },
    {
      "id": "jqvgsyc",
      "author": "Toasteric",
      "body": "Yeah i suspect there's pleanty on here who do.  The world has got more accepting at least, and i assume it will continue that trajectory.",
      "created_utc": 1688640595.0,
      "score": 6,
      "context": [
        {
          "id": "jquvway",
          "author": "sugark30",
          "body": "i won’t go on dates anymore. i don’t want to eat in front of any guy and it sucks",
          "created_utc": 1688624011.0
        },
        {
          "id": "jquyezu",
          "author": "nomoreadminspls",
          "body": "Yeah, I've definitely been at this point.\n\nI was fortunate enough to find someone who introduced me to this sub and got me diagnosed, but it's difficult.\n\nI will say this the only people who have rejected me because of Arfid have shown their lack of character in doing so.\n\nIt is a poor reflection on them, not you, you haven't done anything wrong.",
          "created_utc": 1688625891.0
        },
        {
          "id": "jquzuqn",
          "author": "sugark30",
          "body": "i guess so. but most people see my arfid as just being childish. they judge me and say “grow up” since i kind of eat like a child.",
          "created_utc": 1688626989.0
        },
        {
          "id": "jqv7y08",
          "author": "watcher4483",
          "body": "God I relate to this so much",
          "created_utc": 1688633649.0
        }
      ]
    }
  ]
}