{
  "id": "14skpcm",
  "subreddit": "ARFID",
  "author": "serioustransvibes",
  "created_utc": 1688675125.0,
  "title": "I was over at a friends place today, his dad is one of the mot understanding adults I’ve met",
  "selftext": "This got kinda long.. TL;DR at the end.\n\nSo I made this friend through our summer job, and just happened to tag along to his place afterwards. His dad asked if I wanted to stay over dinner “if it was something that I could eat” so I asked what they were having, it was something I could eat so I said I’d love to (I was also pretty hungry).\n\nAs we ate, everything was divided nicely into separate bowls so it was easy to take what you wanted, and avoid the other stuff. He also brought up what my friend was gonna bring for food to work tomorrow and we informed him that since it was the last day, they’re gonna give us pizza, he asked what pizzas and my friend said “margaritas, and one without tomato sauce” and he replied “ah, for you” but no, that’s for me, turns out that’s also how my friend prefers his pizzas.\n\nWe said no, it was for me and I added I had some “strange eating habits” and he said “there’s no such thing as ‘strange’ eating habits, there’s just eating habits, and they’re different for everyone.”\n\nI have never before met someone new who has that mindset immediately. Of course, this is probably because his kid seems to also be dealing with arfid, but it meant a lot to me… I often get judged by people, especially friends parents, over my eating habits, and while they often end up respecting them, they still clearly see it as a bother. But not this guy.\n\nI know this might not be the most interesting story or anything, but I felt like sharing it anyways. Since it meant a lot to me I guess.\n\nTL;DR: friends dad said there’s no such thing as strange eating habits, they’re just different. Might not sound like a lot but it meant a lot to me.",
  "url": "https://www.reddit.com/r/ARFID/comments/14skpcm/i_was_over_at_a_friends_place_today_his_dad_is/",
  "score": 106,
  "num_comments": 6,
  "comments": [
    {
      "id": "jqyal6k",
      "author": "kitty_kosmonaut",
      "body": "What a refreshing and wholesome perspective! 🥹",
      "created_utc": 1688683624.0,
      "score": 17,
      "context": []
    },
    {
      "id": "jqy6a4m",
      "author": "Agreeable_Tale1305",
      "body": "Very nice",
      "created_utc": 1688681769.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jqzlely",
      "author": "bumbumbooo",
      "body": "Omg aww it’s so refreshing to hear an adult behave kindly and maturely. It’s so true what he said , and I wish people had more compassion like this man 🥺we seriously need it. \nMy own family constantly shames me, I can’t imagine having a dad that’s so supportive and understanding  like that! It’s so sweet and I’m happy you got experience this positive encounter with an adult ❤️",
      "created_utc": 1688707048.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jqzft1j",
      "author": "sourpussmcgee",
      "body": "So kind. The exact opposite of what we all experience.",
      "created_utc": 1688703631.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jqzriwa",
      "author": "purple_bin",
      "body": "i love this",
      "created_utc": 1688711323.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jrb2ubm",
      "author": "DullSport382",
      "body": "This is so sweet thank you for sharing 😊 Im in such a habit of saying my eating is strange or weird and a friend disagreed with me when I said that and it make me feel really happy and accepted. It’s so lovely when you find someone like that",
      "created_utc": 1688928078.0,
      "score": 1,
      "context": []
    }
  ]
}