{
  "id": "163z7d0",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1693259316.0,
  "title": "Does anyone with arfid also struggle with oral sex?",
  "selftext": "Sorry if this isn’t allowed, feel free to delete. But I realized I probably am not the only one and wonder if it could ARFID related. I am a f dating a m, I’m bi but haven’t been with any women sexually, only dates. I’m with my life partner and I love him, I could list many many reasons why I love him but l save you the mush. Something I’ve always struggled with though is oral. I do it, mostly because he does it for me, and I want his needs to be met and for him to be satisfied. I’ve NEVER liked it though, and even though I’m bi, the thought of doing it for a woman scares me. I find beauty in sex, BUT people be tasting weird. Sweaty, musty, Metallicy, etc, as a vagina owner myself I’m not sure I could get down with the many flavors. My guy is very clean, hygienic, it’s not like he tastes terrible, it’s just …gross. And when there is pre-c or c it’s worse. I CANNOT WITH THE SALTY. It’s just….it’s a flavor thing? I know it’s not supposed to taste like cake but I don’t like the taste of skin, especially skin that’s trapped in undies and pants all day. To be fair I’m also a germaphobe, and a bit of an obsessive bather but I can’t be alone in this right?  Also, I’m pretty sure I’m with my forever partner, I know I won’t have yo worry about this, but I don’t like the fact that if I were with a woman I’d have troubles pleasing her and I would hate that. Is this also a problem for you? Or do we just be loving oral. Like my guy and so many other people say they love the natural taste of whatever your body is that day but like…ew?  Tell me I’m not alone in this boat please",
  "url": "https://www.reddit.com/r/ARFID/comments/163z7d0/does_anyone_with_arfid_also_struggle_with_oral_sex/",
  "score": 224,
  "num_comments": 88,
  "comments": [
    {
      "id": "jy5qz51",
      "author": "i_enjoy_music_n_stuf",
      "body": "Yes. And I feel really bad about it. I am the real life person from the “sorry I can’t eat you out, it’s a texture problem” meme",
      "created_utc": 1693265660.0,
      "score": 103,
      "context": []
    },
    {
      "id": "jy5re8g",
      "author": "kuromikillz",
      "body": "Once my ex finished in my mouth and I immediately gagged and then threw up in his sink. You’re not alone🥹",
      "created_utc": 1693265840.0,
      "score": 121,
      "context": []
    },
    {
      "id": "jy5nq63",
      "author": "WisdomNynaeve",
      "body": "You are not alone. I can really only do it if I have had a couple of drinks and am in the mood to give it. It can not be suggested or asked for from my partner. It's the same reasons you stated. I also have a very sensitive gag reflex, so it can turn out badly for both of us.",
      "created_utc": 1693264271.0,
      "score": 44,
      "context": []
    },
    {
      "id": "jy5pidc",
      "author": "saintnobody5",
      "body": "Not all the time, sometimes I actually enjoy it and initiate it. But other times, I can’t handle it and have actually thrown up on him before. My husband doesn’t care either way and would never force me, which I think has to do with why I like it sometimes (my arfid was caused by a combination of being born with my umbilical cord around my throat and a father that force fed me), I feel comfortable and know he’s not going to judge me if I randomly need to stop. He also handled being thrown up on super gracefully lmao. \n\nAll that said, he would be perfectly happy and satisfied if I never did oral again. If you really can’t handle it or even just don’t want to, your partner should respect that. Relationships realistically aren’t 50-50 all the time and that’s okay. If you DO want to do it, have him shower directly before and see if that makes it easier for you and remember you don’t need to finish him that way, we mainly use it as foreplay and hardly ever end sex that way.",
      "created_utc": 1693265033.0,
      "score": 25,
      "context": []
    },
    {
      "id": "jy5xsso",
      "author": "LolaTigre",
      "body": "I don’t personally have issues with giving oral, but I validate you as you are NOT alone. I was curious- would flavored lube help you at all? I am fond of a brand called Aloe Cadabra in peppermint. But there are loads of flavors out there. \n\nUltimately it comes down to communication with your partner. There are so many ways to enjoy each other’s bodies, and if your partner truly loves you, he wouldn’t want you to suffer just so he can orgasm a particular way. If you knew he hated going down on you, would you still want him to do it? If oral isn’t an option for you- try mutual masturbation or using toys together for different sensations. \n\nConsensual hugs to you!",
      "created_utc": 1693268568.0,
      "score": 20,
      "context": []
    },
    {
      "id": "jy683m5",
      "author": "Strict_Reflection553",
      "body": "Yes 1000%\nI also just struggle with sex in general.",
      "created_utc": 1693272988.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jy6adbn",
      "author": "Anoelnymous",
      "body": "I actually LOVE the texture of dick. Which is maybe weird now that I think about it? I'm not going to think about it. Don't jinx me! Lol.",
      "created_utc": 1693273980.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jy66s02",
      "author": "Smallchildrenirkme",
      "body": "This might be TMI but like with certain foods, i have to crave it/be in the very specific mood for it. If he wants it and im not in that mood, i gag a lot. if he wants it and i *am* in the mood for it, theres no problems. \n\nIts definitely a sensory thing for me (also like with my foods) so i get it!",
      "created_utc": 1693272404.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jy6ekwm",
      "author": "oddistrange",
      "body": "I hate oral. It always tastes like a swimming pool.",
      "created_utc": 1693275843.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jy6os41",
      "author": "scorpiusdare",
      "body": "OP you ain’t alone I cannot do anything oral related \n 😭 I can kiss but bro you put yo tongue in my mouth and with god as my witness I will THROW UP",
      "created_utc": 1693280803.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jy6rs4m",
      "author": "clobeeep",
      "body": "Literally yes. I’m better with dicks than vaginas - I’ve been with both and I feel terrible because ITS NOT THEM ITS ME IM SO SORRY TO ANYONE I GAGGED ON BC OF TASTE ITS NOT YOUR FAULT",
      "created_utc": 1693282450.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jy70yk8",
      "author": "Nostarsinthedark",
      "body": "I feel so seen",
      "created_utc": 1693288276.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jy7ijam",
      "author": "binocularbitch",
      "body": "I can do ✨most of it✨ but my hard boundary is not doing the ✨final bit✨, if you catch my drift. \n\nIt’s totally reasonable to not want to and I know many non-autistic/ARFID people who also don’t want to do *that*!",
      "created_utc": 1693301863.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jy5xrza",
      "author": "decentmealandsoon",
      "body": "No I personally don't struggle with oral sex. I really love going down on a man as long as his private parts are clean and we are sure he doesn't carry a bad disease. \n\nBut I have to say I love putting unedible things in my mouth... I have a chewing stick and an adult pacifier and when I didn't have those aids I chewed my blanket so hard blood was drawn.",
      "created_utc": 1693268560.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jy6l299",
      "author": "LustUnlust",
      "body": "No but making out is hard like I can put my tongue in their mouths but having a tongue in mine makes my brain short circuit",
      "created_utc": 1693278897.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jy6ndgv",
      "author": "racheltheangel222",
      "body": "tmi but yes i threw up one time on it 🫠",
      "created_utc": 1693280067.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jy755pf",
      "author": "None",
      "body": "My boyfriend has arfid and he doesn’t love to go down me (f)- but he does for me occasionally to make me happy. He is actually starting to get really good at it now the fear factor has reduced a bit. He just says you know I’m a fussy eater 🤣",
      "created_utc": 1693291341.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jy7ksok",
      "author": "arfidta",
      "body": "Me, ARFID Male: I have absolutely no problem giving oral, it's one of my safe foods.\n\nMy wife, non-ARFID Female: She's completely icked out by the thought of it.\n\nI've no problem with it not being reciprocated. I only wish she'd let me give her oral more often, I think she's reluctant to let me go down because she feels guilty about not going down on me.\n\nThings don't have to be transactional or reciprocal when the act in question makes you actively uncomfortable.",
      "created_utc": 1693303563.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jy60pjh",
      "author": "NoALTT",
      "body": "Yes i struggle with this too, ive been getting better though so i hope that gives you a sense of hope! Im trying to get used to the taste of someone else, sometimes ill try to just think about him feeling good and not be throwing up which helps haha.",
      "created_utc": 1693269802.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jy7agz7",
      "author": "Suspicious-Flower327",
      "body": "Yes!!! I gag a lot and am afraid to go deep. I also don’t let my partner cum in my mouth bc the texture triggers my ARFID and I’m afraid to throw up. \n\nWish it wasn’t this way so if anyone has any tips holla at me plssss!",
      "created_utc": 1693295486.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jy7w8wo",
      "author": "httpsomin",
      "body": "I can't give oral to my bf unless there's a towel or something I can use to spit out whenever I feel disgusted by the texture and liquid in my mouth. And it's not just like spitting one time. It's like stopping to spit and then continuing and then feeling the need to spit again. Loool",
      "created_utc": 1693310526.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jy63uog",
      "author": "crochetsweetie",
      "body": "only one guy",
      "created_utc": 1693271145.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy640ht",
      "author": "Xezoki",
      "body": "I actually haven’t had this experience, i think its because of my perception when I do it. To me its very sexy and I don’t think too much about, I’m not really ingesting anything but I could see how this happens though.",
      "created_utc": 1693271212.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy659r0",
      "author": "TheRealAmayan",
      "body": "If you haven't considered it, you could try flavoured lube. If it helps with oral on vagina, I don't see why it wouldn't with dick. We have a set of lube that's just different kinds of cakes. It might not mask the taste completely, but it might help a bit.",
      "created_utc": 1693271752.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy69tc2",
      "author": "willienelsonfan",
      "body": "You’re not alone. My partner and I are both AFAB and I struggle with going down on them sometimes. I don’t mind the smell or taste at all, but the texture can be a problem sometimes.",
      "created_utc": 1693273740.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy6cqm3",
      "author": "Lasagan",
      "body": "You don't have to do anything you don't enjoy, but if you do want to try and make it work, have you considered a flavoured lube or edible body oil?",
      "created_utc": 1693275027.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy6cxkg",
      "author": "Proof-Bite9650",
      "body": "I have cotton candy flavored lube and it’s great",
      "created_utc": 1693275112.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy6i822",
      "author": "Disastrous_Bus1904",
      "body": "nope you are not alone but i won’t do it at all, i do not care. maybe once in a blue moon on his birthday or sumn but it is a boundary and he is okay with that thank GOD. it makes me feel insecure as hell though.",
      "created_utc": 1693277513.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy6nct6",
      "author": "IcySolution9679",
      "body": "I hate the finishing in the mouth portion the texture to me is just horrible so I just set that boundary up front that I am happy to give oral but finishing in my mouth is just not going to happen. Honestly people have been chill with that especially when you mention it before anything happens. Communication is key!!",
      "created_utc": 1693280057.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy6ro5t",
      "author": "czzzzzzzzzzzz",
      "body": "I can’t do it either and I don’t like kissing. I honestly don’t like any sensations near my mouth at all, especially during sex. Even just thinking about it makes me nauseous sometimes. It’s a hard limit for me and I let my male partners know up front that it’s not going to happen, no matter what.",
      "created_utc": 1693282386.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy78rx5",
      "author": "None",
      "body": "I’m not sure if it has to do with my arfid. More so that my ex was just disgusting.",
      "created_utc": 1693294127.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy7cbwg",
      "author": "None",
      "body": "you’re definitely not alone! i do really enjoy the act of eating someone out but sensory wise it can be very overwhelming and feeling any hair in my mouth makes me gag 🥲 same with if she hasn’t taken a shower that day. i feel bad though because hair and taste/smells (to an extent) are natural and i never want to make someone feel ashamed of their body, it’s just not something i can control or compromise on.\n\nlike another commenter said, if someone was experiencing that amount of discomfort going down on me i would never want them to put up with it just to please me. it’s completely okay to set boundaries around this, your wellbeing and enjoyment during sex is just as important as your partner’s 🧡",
      "created_utc": 1693296989.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy7j3lg",
      "author": "thatsnuckinfutz",
      "body": "Just commenting based on the title question but it's something i truly cannot do. i have issues surrounding mouth/germs/oral hygeine and just cant bring myself to try it.",
      "created_utc": 1693302297.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy7lr1h",
      "author": "DannyPhantomRoss",
      "body": "Yes. For me it's about textures. Anything in my mouth has always been a no go. I tried out for precision in highschool so I wouldn't have to use a mouth piece. I personally think it's all related to an early encounter I shouldn't have had and now I struggle with hyperfocusing on my mouth. I'm also on the spectrum which I'm sure helps /s",
      "created_utc": 1693304242.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy9jh99",
      "author": "jade35mm",
      "body": "yes yes yes omg this made me feel so much better. I’m a lesbian and always felt out of place by how people talk about loving oral. personally, it’s too much for me. I don’t even like receiving it that much either.",
      "created_utc": 1693333558.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy6k1sz",
      "author": "Adsilom",
      "body": "I love giving oral but had some apprehension the very first time but the idea of giving my partner so much pleasure was enough of a motivation, despite my rather extreme case of ARFID (I should say that I like giving oral to any gender).",
      "created_utc": 1693278389.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jy7k6ci",
      "author": "amorphousflesh",
      "body": "Yeah same boat, peep juice is next level bitterness and the struggle is real, I love salt but can't deal with the bitter, texture isn't fantastic either if I'm being honest",
      "created_utc": 1693303106.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jy85ecs",
      "author": "Conscious-Studio8111",
      "body": "Yup. I’m dating this lovely woman, I love her so much, I want to go down. It’s so hard sometimes if I’m having a bad texture day. It sucks. Luckily, I can usually deal with it, and find other ways to please her. \n\nBut yeah, You’re not alone. It’s a real thing, and textures are the worst ™",
      "created_utc": 1693314817.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jy8mqi0",
      "author": "bossandy",
      "body": "I’ve even struggled with kissing a woman wearing lipstick before because of ARFID so you are not alone.",
      "created_utc": 1693321683.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jy8v38g",
      "author": "Putyourmoneyonme80",
      "body": "I don't for some reason. In theory I totally should. I give my husband head a LOT and I swallow every time. Not to be TMI but he usually lets me know when he's about to finish and I'll move my tongue so his cum goes under it instead of in my mouth or down my throat. That's always helped me with it.",
      "created_utc": 1693324757.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jyczvok",
      "author": "gingerstrawberrygirl",
      "body": "Holy shit, this thread makes me so seen 😭😭",
      "created_utc": 1693395126.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jy5ybax",
      "author": "funkydyke",
      "body": "Why are you letting his “needs” (oral sex is not a need) override your own comfort and mental well being? I would hope he’s at least the type of guy to not want that for you if you love him that much",
      "created_utc": 1693268786.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkkzumn",
      "author": "mvlod",
      "body": "I think I'd rather die than perform oral sex. I can't even... no.",
      "created_utc": 1724971850.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mf1d6e9",
      "author": "Interesting_Half8658",
      "body": "I am waiting for you to come over ",
      "created_utc": 1740643367.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mf1d896",
      "author": "Interesting_Half8658",
      "body": "Please tell me if you aren't going to come over ",
      "created_utc": 1740643399.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jy6kdb9",
      "author": "egoistmp3",
      "body": "omg i don’t have this problem but i sympathise!! personally i would never want my partner to perform a sex act for me that was actually uncomfortable or unpleasant for them and i bet your partner would probably feel the same way if you let him know you don’t love doing it! hopefully some suggestions here help and you can find a way to enjoy yourself but if not there’s lots of other stuff you can do that is fun for you both 💕",
      "created_utc": 1693278548.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jy916zl",
      "author": "emmthelover",
      "body": "I can do it, however I will sometimes actively avoid the finishing in the mouth part if I don’t think I can handle the texture that day. I have thrown up on him, it was not a fun time. Also my gag reflex sucks so that’s definitely a contributor.",
      "created_utc": 1693326968.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jy9ll59",
      "author": "mudsbird",
      "body": "yes it makes me feel sick during and after",
      "created_utc": 1693334325.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jya63to",
      "author": "Ru_rehtaeh",
      "body": "I gag really easily and haven’t been able to give oral in a few years now and I feel so bad. I just struggle with it so much. Same with brushing my teeth. Just having it touch certain teeth automatically makes me gag",
      "created_utc": 1693341587.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jyajilg",
      "author": "closetgeekasaurus",
      "body": "I’ve struggled with this as well with my partner. Flavored lube helped greatly if you want to give that a try",
      "created_utc": 1693346479.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jyb0rj6",
      "author": "SuddenAce",
      "body": "You could always try showering beforehand and tell him to eat more pineapple/sweet stuff. Or just not do it if you don’t like it, I’d hope BJs wouldn’t be a deal breaker.",
      "created_utc": 1693353441.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jyb0s5j",
      "author": "SuddenAce",
      "body": "You could always try showering beforehand and tell him to eat more pineapple/sweet stuff. Or just not do it if you don’t like it, I’d hope BJs wouldn’t be a deal breaker for a life partner.",
      "created_utc": 1693353448.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jyb1r9o",
      "author": "KingTalis",
      "body": "Yup",
      "created_utc": 1693353853.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jyb2ecu",
      "author": "Blah_the_pink",
      "body": "Here's the good news though...people who don't have ARFID suffer the same with oral. You're definitely not alone. \n\nAlso, OP. Just because he does it for you doesn't ever mean you have to return the favor. Talk to your partner openly and see how he responds. If this does turn into a boundary for you, he'll respect it if he respects you.\n\nEdit for typo",
      "created_utc": 1693354119.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jyb89oe",
      "author": "daiwyawergy",
      "body": "omg, thank you for sharing, i thought i was just nuts lol",
      "created_utc": 1693356564.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jybxt5s",
      "author": "nycismysavior",
      "body": "I have been thinking about this a lot. I have a longtime FWB and he’s somewhat understanding about my weak gag reflex but i really feel like my gag reflex is connected to my ARFID. And whenever he asks for head, once I taste the pre-c*m I immediately gag and feel really guilty and inexperienced.  Last week, the pre-c made me almost throw up on his bed and I felt so embarrassed. \n\nI also know he watches a lot of porn and sometimes shows examples so I feel incompetent that I can’t give head like that",
      "created_utc": 1693368394.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jyco5l0",
      "author": "Fantastic-Leopard131",
      "body": "Yep always been difficult for me but id try to push it and do it anyways. All i gotta say is after you full on puke all over a guys dick you realize its not worth pushing your boundaries for. \n\nI don’t give head anymore, not in the traditional sense. But my man always says he loves when i give him head and im like but i dont… what i do do is just lick it up and down or suck the very tip. Basically i don’t actually put it in my mouth, at least not anything’s past the very tip, ill just use my mouth to lick it and my man still absolutely loves it so he still gets his needs met and i dont have to gag and try and swallow puke back down and risk not being successful at stopping the throw up.",
      "created_utc": 1693387125.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jycpkuh",
      "author": "No_Practice_7746",
      "body": "You are within your rights to only do whatever oral you want to do, including none. Sex is meant to make both of you feel good. If you’ve got a good partner, he should more than understand, if you can talk about it. I was with a no-oral partner for 15 years",
      "created_utc": 1693388208.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jyddk4x",
      "author": "huntresswizard_",
      "body": "Yeah you’re not alone, I’ve thrown up on guys because their c was fing disgusting. My forever partner is fine, I have no problems with giving head and uh…swallowing…but that took years and years of being with the same person.",
      "created_utc": 1693401682.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jycp2ky",
      "author": "Fantastic-Leopard131",
      "body": "When i feel bad and want to do something for my man i just lick it + use my hand rather than actually put it in my mouth and my dude absolutely loves it. He always says he loves when i give head which is funny cause i dont even consider it head but he’s perfectly satisfied with it either way so that may be worth trying out. You can still do something for him without pushing your boundaries so far by putting it in your mouth.",
      "created_utc": 1693387825.0,
      "score": 7,
      "context": [
        {
          "id": "jy5qz51",
          "author": "i_enjoy_music_n_stuf",
          "body": "Yes. And I feel really bad about it. I am the real life person from the “sorry I can’t eat you out, it’s a texture problem” meme",
          "created_utc": 1693265660.0
        }
      ]
    },
    {
      "id": "jycp1pt",
      "author": "Fantastic-Leopard131",
      "body": "When i feel bad and want to do something for my man i just lick it + use my hand rather than actually put it in my mouth and my dude absolutely loves it. He always says he loves when i give head which is funny cause i dont even consider it head but he’s perfectly satisfied with it either way so that may be worth trying out. You can still do something for him without pushing your boundaries so far by putting it in your mouth.",
      "created_utc": 1693387808.0,
      "score": 2,
      "context": [
        {
          "id": "jy5qz51",
          "author": "i_enjoy_music_n_stuf",
          "body": "Yes. And I feel really bad about it. I am the real life person from the “sorry I can’t eat you out, it’s a texture problem” meme",
          "created_utc": 1693265660.0
        }
      ]
    },
    {
      "id": "jy68brk",
      "author": "shortnsweet33",
      "body": "At least you didn’t throw up on their stomach right afterwards…. (Not like I did that or anything… it was the first time it uh, fully came to fruition and yeah no. Never again) \n\nOP - you’re not alone. Can you make sure he showers beforehand? A shower together could always be something to kind of set the mood but also make sure everyone is clean. You don’t have to you know, go all the way til it’s done, ask him to give you a heads up before that happens. \n\nEven then, if it’s not your thing, there’s other things you can explore with your partner. As long as you’re open and honest and communicate with each other, that’s all that really matters!",
      "created_utc": 1693273087.0,
      "score": 26,
      "context": [
        {
          "id": "jy5re8g",
          "author": "kuromikillz",
          "body": "Once my ex finished in my mouth and I immediately gagged and then threw up in his sink. You’re not alone🥹",
          "created_utc": 1693265840.0
        }
      ]
    },
    {
      "id": "jyd08u5",
      "author": "gingerstrawberrygirl",
      "body": "This!! I feel exactly the same, thank you for putting it into words, I never was quite able to 😭",
      "created_utc": 1693395328.0,
      "score": 2,
      "context": [
        {
          "id": "jy5nq63",
          "author": "WisdomNynaeve",
          "body": "You are not alone. I can really only do it if I have had a couple of drinks and am in the mood to give it. It can not be suggested or asked for from my partner. It's the same reasons you stated. I also have a very sensitive gag reflex, so it can turn out badly for both of us.",
          "created_utc": 1693264271.0
        }
      ]
    },
    {
      "id": "jy68bhq",
      "author": "scorpiokillua",
      "body": "Wait this is so crazy I also was born with a cord around my throat with a family that tried to force feed me too!",
      "created_utc": 1693273084.0,
      "score": 6,
      "context": [
        {
          "id": "jy5pidc",
          "author": "saintnobody5",
          "body": "Not all the time, sometimes I actually enjoy it and initiate it. But other times, I can’t handle it and have actually thrown up on him before. My husband doesn’t care either way and would never force me, which I think has to do with why I like it sometimes (my arfid was caused by a combination of being born with my umbilical cord around my throat and a father that force fed me), I feel comfortable and know he’s not going to judge me if I randomly need to stop. He also handled being thrown up on super gracefully lmao. \n\nAll that said, he would be perfectly happy and satisfied if I never did oral again. If you really can’t handle it or even just don’t want to, your partner should respect that. Relationships realistically aren’t 50-50 all the time and that’s okay. If you DO want to do it, have him shower directly before and see if that makes it easier for you and remember you don’t need to finish him that way, we mainly use it as foreplay and hardly ever end sex that way.",
          "created_utc": 1693265033.0
        }
      ]
    },
    {
      "id": "jy620va",
      "author": "None",
      "body": "It could, It’s frustrating with arfid though I hate most things with flavor of any kind 😂 thank you for the kind words 🫶 i been known I need to communicate better when it comes to sex, embarrassed/ashamed to ask for what I need sometimes, working on it though !",
      "created_utc": 1693270358.0,
      "score": 5,
      "context": [
        {
          "id": "jy5xsso",
          "author": "LolaTigre",
          "body": "I don’t personally have issues with giving oral, but I validate you as you are NOT alone. I was curious- would flavored lube help you at all? I am fond of a brand called Aloe Cadabra in peppermint. But there are loads of flavors out there. \n\nUltimately it comes down to communication with your partner. There are so many ways to enjoy each other’s bodies, and if your partner truly loves you, he wouldn’t want you to suffer just so he can orgasm a particular way. If you knew he hated going down on you, would you still want him to do it? If oral isn’t an option for you- try mutual masturbation or using toys together for different sensations. \n\nConsensual hugs to you!",
          "created_utc": 1693268568.0
        }
      ]
    },
    {
      "id": "jy6xoe6",
      "author": "asmit1241",
      "body": "I love the Honey Birdette \"fairy floss\" flavoured lube. Honestly it tastes like maple syrup though, not fairy floss",
      "created_utc": 1693286043.0,
      "score": 2,
      "context": [
        {
          "id": "jy5xsso",
          "author": "LolaTigre",
          "body": "I don’t personally have issues with giving oral, but I validate you as you are NOT alone. I was curious- would flavored lube help you at all? I am fond of a brand called Aloe Cadabra in peppermint. But there are loads of flavors out there. \n\nUltimately it comes down to communication with your partner. There are so many ways to enjoy each other’s bodies, and if your partner truly loves you, he wouldn’t want you to suffer just so he can orgasm a particular way. If you knew he hated going down on you, would you still want him to do it? If oral isn’t an option for you- try mutual masturbation or using toys together for different sensations. \n\nConsensual hugs to you!",
          "created_utc": 1693268568.0
        }
      ]
    },
    {
      "id": "jy699t6",
      "author": "None",
      "body": "Sameeee",
      "created_utc": 1693273506.0,
      "score": 5,
      "context": [
        {
          "id": "jy683m5",
          "author": "Strict_Reflection553",
          "body": "Yes 1000%\nI also just struggle with sex in general.",
          "created_utc": 1693272988.0
        }
      ]
    },
    {
      "id": "jytadqh",
      "author": "Beneficial_Use_7359",
      "body": "this (to me, anyone feel free to correct me) sounds like such a real issue for people in general !! it’s crucial to feel into it / comfortable at all times your body will tell you (us maybe in more extreme ways) when it’s not for you in the ‘right now’ !!",
      "created_utc": 1693665621.0,
      "score": 2,
      "context": [
        {
          "id": "jy66s02",
          "author": "Smallchildrenirkme",
          "body": "This might be TMI but like with certain foods, i have to crave it/be in the very specific mood for it. If he wants it and im not in that mood, i gag a lot. if he wants it and i *am* in the mood for it, theres no problems. \n\nIts definitely a sensory thing for me (also like with my foods) so i get it!",
          "created_utc": 1693272404.0
        }
      ]
    },
    {
      "id": "jycew1v",
      "author": "Crissycrossycross",
      "body": "Males or females?",
      "created_utc": 1693379784.0,
      "score": 1,
      "context": [
        {
          "id": "jy6ekwm",
          "author": "oddistrange",
          "body": "I hate oral. It always tastes like a swimming pool.",
          "created_utc": 1693275843.0
        }
      ]
    },
    {
      "id": "jy8at1u",
      "author": "unicorn_in-training",
      "body": "Me too 😭❤️ I’m so glad OP decided to post this!",
      "created_utc": 1693317094.0,
      "score": 3,
      "context": [
        {
          "id": "jy70yk8",
          "author": "Nostarsinthedark",
          "body": "I feel so seen",
          "created_utc": 1693288276.0
        }
      ]
    },
    {
      "id": "jylu9dk",
      "author": "HenriettasHooman",
      "body": "Same, I also communicate a lot with my (long term) partner about what I taste and we’ve found that if he drinks more water we’re both better off for it. Me for taste of the final result, and him for hydration.",
      "created_utc": 1693532505.0,
      "score": 1,
      "context": [
        {
          "id": "jy640ht",
          "author": "Xezoki",
          "body": "I actually haven’t had this experience, i think its because of my perception when I do it. To me its very sexy and I don’t think too much about, I’m not really ingesting anything but I could see how this happens though.",
          "created_utc": 1693271212.0
        }
      ]
    },
    {
      "id": "jyby7r0",
      "author": "nycismysavior",
      "body": "Which brand 😩",
      "created_utc": 1693368626.0,
      "score": 1,
      "context": [
        {
          "id": "jy6cxkg",
          "author": "Proof-Bite9650",
          "body": "I have cotton candy flavored lube and it’s great",
          "created_utc": 1693275112.0
        }
      ]
    },
    {
      "id": "jy9ckhy",
      "author": "None",
      "body": "I bow down to you🙌 no shame either way of course but I always wished I could swallow lol",
      "created_utc": 1693331079.0,
      "score": 2,
      "context": [
        {
          "id": "jy8v38g",
          "author": "Putyourmoneyonme80",
          "body": "I don't for some reason. In theory I totally should. I give my husband head a LOT and I swallow every time. Not to be TMI but he usually lets me know when he's about to finish and I'll move my tongue so his cum goes under it instead of in my mouth or down my throat. That's always helped me with it.",
          "created_utc": 1693324757.0
        }
      ]
    },
    {
      "id": "jy60vy1",
      "author": "None",
      "body": "It’s really just a source of shame for me, he’s never and would never ask me to do something he knew I didn’t like…I just need to be better about communication. I feel like I already have so many annoying boundaries, I don’t wanna add more. It’s fully on me and something I need to work on in therapy lol, I love life 🤡",
      "created_utc": 1693269877.0,
      "score": 8,
      "context": [
        {
          "id": "jy5ybax",
          "author": "funkydyke",
          "body": "Why are you letting his “needs” (oral sex is not a need) override your own comfort and mental well being? I would hope he’s at least the type of guy to not want that for you if you love him that much",
          "created_utc": 1693268786.0
        }
      ]
    },
    {
      "id": "lui44s2",
      "author": "kristaleacompton",
      "body": "That isn't a friend ",
      "created_utc": 1730286703.0,
      "score": 1,
      "context": [
        {
          "id": "jybxt5s",
          "author": "nycismysavior",
          "body": "I have been thinking about this a lot. I have a longtime FWB and he’s somewhat understanding about my weak gag reflex but i really feel like my gag reflex is connected to my ARFID. And whenever he asks for head, once I taste the pre-c*m I immediately gag and feel really guilty and inexperienced.  Last week, the pre-c made me almost throw up on his bed and I felt so embarrassed. \n\nI also know he watches a lot of porn and sometimes shows examples so I feel incompetent that I can’t give head like that",
          "created_utc": 1693368394.0
        }
      ]
    },
    {
      "id": "jy6xf0m",
      "author": "asmit1241",
      "body": "I threw up on my ex with him still in my mouth - was banned from bjs but i was not complaining lmao\n\nI also recently had my current partner finish in my mouth for the first time and i gagged and made the most outrageous sound in doing so and had to go spit in the sink. I felt so bad, but after explaining to him that it wasn't about him or the taste or anything, it was the texture and that while some days i might be able to handle it, that day was not one of those days, it's all good. He didn't understand when we first started dating, but after one fateful day when we tried some new dumplings together he gets it and is very understanding when things like that happen now.\n\nI second the showering together. Often makes for some very steamy moments, which gets everyone going even more than they already were. And bonus - no skin or sweat from today's undies.",
      "created_utc": 1693285874.0,
      "score": 17,
      "context": [
        {
          "id": "jy5re8g",
          "author": "kuromikillz",
          "body": "Once my ex finished in my mouth and I immediately gagged and then threw up in his sink. You’re not alone🥹",
          "created_utc": 1693265840.0
        },
        {
          "id": "jy68brk",
          "author": "shortnsweet33",
          "body": "At least you didn’t throw up on their stomach right afterwards…. (Not like I did that or anything… it was the first time it uh, fully came to fruition and yeah no. Never again) \n\nOP - you’re not alone. Can you make sure he showers beforehand? A shower together could always be something to kind of set the mood but also make sure everyone is clean. You don’t have to you know, go all the way til it’s done, ask him to give you a heads up before that happens. \n\nEven then, if it’s not your thing, there’s other things you can explore with your partner. As long as you’re open and honest and communicate with each other, that’s all that really matters!",
          "created_utc": 1693273087.0
        }
      ]
    },
    {
      "id": "jycoluj",
      "author": "Fantastic-Leopard131",
      "body": "Lmaooo at least you missed his dick. Mine didnt even make it to his stomach just puke all over the poor dudes dick.",
      "created_utc": 1693387470.0,
      "score": 1,
      "context": [
        {
          "id": "jy5re8g",
          "author": "kuromikillz",
          "body": "Once my ex finished in my mouth and I immediately gagged and then threw up in his sink. You’re not alone🥹",
          "created_utc": 1693265840.0
        },
        {
          "id": "jy68brk",
          "author": "shortnsweet33",
          "body": "At least you didn’t throw up on their stomach right afterwards…. (Not like I did that or anything… it was the first time it uh, fully came to fruition and yeah no. Never again) \n\nOP - you’re not alone. Can you make sure he showers beforehand? A shower together could always be something to kind of set the mood but also make sure everyone is clean. You don’t have to you know, go all the way til it’s done, ask him to give you a heads up before that happens. \n\nEven then, if it’s not your thing, there’s other things you can explore with your partner. As long as you’re open and honest and communicate with each other, that’s all that really matters!",
          "created_utc": 1693273087.0
        }
      ]
    },
    {
      "id": "jy695sk",
      "author": "None",
      "body": "Gotta love trauma bonding 🥲",
      "created_utc": 1693273457.0,
      "score": 7,
      "context": [
        {
          "id": "jy5pidc",
          "author": "saintnobody5",
          "body": "Not all the time, sometimes I actually enjoy it and initiate it. But other times, I can’t handle it and have actually thrown up on him before. My husband doesn’t care either way and would never force me, which I think has to do with why I like it sometimes (my arfid was caused by a combination of being born with my umbilical cord around my throat and a father that force fed me), I feel comfortable and know he’s not going to judge me if I randomly need to stop. He also handled being thrown up on super gracefully lmao. \n\nAll that said, he would be perfectly happy and satisfied if I never did oral again. If you really can’t handle it or even just don’t want to, your partner should respect that. Relationships realistically aren’t 50-50 all the time and that’s okay. If you DO want to do it, have him shower directly before and see if that makes it easier for you and remember you don’t need to finish him that way, we mainly use it as foreplay and hardly ever end sex that way.",
          "created_utc": 1693265033.0
        },
        {
          "id": "jy68bhq",
          "author": "scorpiokillua",
          "body": "Wait this is so crazy I also was born with a cord around my throat with a family that tried to force feed me too!",
          "created_utc": 1693273084.0
        }
      ]
    },
    {
      "id": "jy69uec",
      "author": "shortnsweet33",
      "body": "Communication really truly is key to good intimacy! I’d say it doesn’t hurt to have a pause word (aka a safe word - this doesn’t only apply in kink related situations) which is a hey, let’s pause, I either need a second, or something hurts (I have Raynaud’s syndrome and poor circulation so definitely applicable) or a way to say you’re actually not comfortable continuing with something. It should be something that is an immediate “check in” - doesn’t mean intimate time is over necessarily. Just saying stop can be a bit of a mood changer (and “don’t stop” is often said during sexytime lol) so a random word that wouldn’t come up works better. \n\nWhich in this case, if it’s getting to be too much, or you need a break, or you want to ask something, or you want a sip of water, whatever it is, you can pause. A good partner will respect that. I’m sure your partner (whether male or female) would want you to be comfortable and enjoy the time together and remember - you can try something and decide it’s not for you and change your mind at any moment. Consent is key!",
      "created_utc": 1693273753.0,
      "score": 3,
      "context": [
        {
          "id": "jy5xsso",
          "author": "LolaTigre",
          "body": "I don’t personally have issues with giving oral, but I validate you as you are NOT alone. I was curious- would flavored lube help you at all? I am fond of a brand called Aloe Cadabra in peppermint. But there are loads of flavors out there. \n\nUltimately it comes down to communication with your partner. There are so many ways to enjoy each other’s bodies, and if your partner truly loves you, he wouldn’t want you to suffer just so he can orgasm a particular way. If you knew he hated going down on you, would you still want him to do it? If oral isn’t an option for you- try mutual masturbation or using toys together for different sensations. \n\nConsensual hugs to you!",
          "created_utc": 1693268568.0
        },
        {
          "id": "jy620va",
          "author": "None",
          "body": "It could, It’s frustrating with arfid though I hate most things with flavor of any kind 😂 thank you for the kind words 🫶 i been known I need to communicate better when it comes to sex, embarrassed/ashamed to ask for what I need sometimes, working on it though !",
          "created_utc": 1693270358.0
        }
      ]
    },
    {
      "id": "jy7in80",
      "author": "binocularbitch",
      "body": "If you don’t mind sweet flavours, there’s a peach one on Amazon that’s amazing — obvs not for internal use though",
      "created_utc": 1693301952.0,
      "score": 2,
      "context": [
        {
          "id": "jy5xsso",
          "author": "LolaTigre",
          "body": "I don’t personally have issues with giving oral, but I validate you as you are NOT alone. I was curious- would flavored lube help you at all? I am fond of a brand called Aloe Cadabra in peppermint. But there are loads of flavors out there. \n\nUltimately it comes down to communication with your partner. There are so many ways to enjoy each other’s bodies, and if your partner truly loves you, he wouldn’t want you to suffer just so he can orgasm a particular way. If you knew he hated going down on you, would you still want him to do it? If oral isn’t an option for you- try mutual masturbation or using toys together for different sensations. \n\nConsensual hugs to you!",
          "created_utc": 1693268568.0
        },
        {
          "id": "jy620va",
          "author": "None",
          "body": "It could, It’s frustrating with arfid though I hate most things with flavor of any kind 😂 thank you for the kind words 🫶 i been known I need to communicate better when it comes to sex, embarrassed/ashamed to ask for what I need sometimes, working on it though !",
          "created_utc": 1693270358.0
        }
      ]
    },
    {
      "id": "jycpcdo",
      "author": "No_Practice_7746",
      "body": "Dick, surely",
      "created_utc": 1693388032.0,
      "score": 3,
      "context": [
        {
          "id": "jy6ekwm",
          "author": "oddistrange",
          "body": "I hate oral. It always tastes like a swimming pool.",
          "created_utc": 1693275843.0
        },
        {
          "id": "jycew1v",
          "author": "Crissycrossycross",
          "body": "Males or females?",
          "created_utc": 1693379784.0
        }
      ]
    },
    {
      "id": "jytal8l",
      "author": "Beneficial_Use_7359",
      "body": "same this sub can be such a blessing for me at times :)",
      "created_utc": 1693665703.0,
      "score": 2,
      "context": [
        {
          "id": "jy70yk8",
          "author": "Nostarsinthedark",
          "body": "I feel so seen",
          "created_utc": 1693288276.0
        },
        {
          "id": "jy8at1u",
          "author": "unicorn_in-training",
          "body": "Me too 😭❤️ I’m so glad OP decided to post this!",
          "created_utc": 1693317094.0
        }
      ]
    },
    {
      "id": "jylhumy",
      "author": "Proof-Bite9650",
      "body": "Lube life!",
      "created_utc": 1693527337.0,
      "score": 1,
      "context": [
        {
          "id": "jy6cxkg",
          "author": "Proof-Bite9650",
          "body": "I have cotton candy flavored lube and it’s great",
          "created_utc": 1693275112.0
        },
        {
          "id": "jyby7r0",
          "author": "nycismysavior",
          "body": "Which brand 😩",
          "created_utc": 1693368626.0
        }
      ]
    },
    {
      "id": "jy9nkrb",
      "author": "Putyourmoneyonme80",
      "body": "I never could (nor did I want to) until my husband. I guess he was just the one. 😂",
      "created_utc": 1693335028.0,
      "score": 1,
      "context": [
        {
          "id": "jy8v38g",
          "author": "Putyourmoneyonme80",
          "body": "I don't for some reason. In theory I totally should. I give my husband head a LOT and I swallow every time. Not to be TMI but he usually lets me know when he's about to finish and I'll move my tongue so his cum goes under it instead of in my mouth or down my throat. That's always helped me with it.",
          "created_utc": 1693324757.0
        },
        {
          "id": "jy9ckhy",
          "author": "None",
          "body": "I bow down to you🙌 no shame either way of course but I always wished I could swallow lol",
          "created_utc": 1693331079.0
        }
      ]
    },
    {
      "id": "jy8hvpp",
      "author": "funkydyke",
      "body": "Your boundaries are not annoying. You deserve to have whatever boundaries you need to feel safe and comfortable in your relationship",
      "created_utc": 1693319885.0,
      "score": 3,
      "context": [
        {
          "id": "jy5ybax",
          "author": "funkydyke",
          "body": "Why are you letting his “needs” (oral sex is not a need) override your own comfort and mental well being? I would hope he’s at least the type of guy to not want that for you if you love him that much",
          "created_utc": 1693268786.0
        },
        {
          "id": "jy60vy1",
          "author": "None",
          "body": "It’s really just a source of shame for me, he’s never and would never ask me to do something he knew I didn’t like…I just need to be better about communication. I feel like I already have so many annoying boundaries, I don’t wanna add more. It’s fully on me and something I need to work on in therapy lol, I love life 🤡",
          "created_utc": 1693269877.0
        }
      ]
    },
    {
      "id": "jyev2ge",
      "author": "shortnsweet33",
      "body": "Unfortunately I’ve done that before too 🙃 you think I’d learn by now. Pretty nasty, but at least we both just started laughing our asses off cause it was a 100% mood killer. Went and played video games instead lol",
      "created_utc": 1693421289.0,
      "score": 2,
      "context": [
        {
          "id": "jy5re8g",
          "author": "kuromikillz",
          "body": "Once my ex finished in my mouth and I immediately gagged and then threw up in his sink. You’re not alone🥹",
          "created_utc": 1693265840.0
        },
        {
          "id": "jy68brk",
          "author": "shortnsweet33",
          "body": "At least you didn’t throw up on their stomach right afterwards…. (Not like I did that or anything… it was the first time it uh, fully came to fruition and yeah no. Never again) \n\nOP - you’re not alone. Can you make sure he showers beforehand? A shower together could always be something to kind of set the mood but also make sure everyone is clean. You don’t have to you know, go all the way til it’s done, ask him to give you a heads up before that happens. \n\nEven then, if it’s not your thing, there’s other things you can explore with your partner. As long as you’re open and honest and communicate with each other, that’s all that really matters!",
          "created_utc": 1693273087.0
        },
        {
          "id": "jycoluj",
          "author": "Fantastic-Leopard131",
          "body": "Lmaooo at least you missed his dick. Mine didnt even make it to his stomach just puke all over the poor dudes dick.",
          "created_utc": 1693387470.0
        }
      ]
    },
    {
      "id": "jyevs1i",
      "author": "Fantastic-Leopard131",
      "body": "Hahaha yeah puke on the dick os definitely one way to kill the vibe😂 first time it happened to me where i fully puked on them i was like 18 and it was hookup not a bf so i was mortified. I definitely mostly learned my lesson there and i really try to avoid pushing myself and i mostly just stick to licking now rather than putting it all the way into my mouth.",
      "created_utc": 1693421537.0,
      "score": 1,
      "context": [
        {
          "id": "jy5re8g",
          "author": "kuromikillz",
          "body": "Once my ex finished in my mouth and I immediately gagged and then threw up in his sink. You’re not alone🥹",
          "created_utc": 1693265840.0
        },
        {
          "id": "jy68brk",
          "author": "shortnsweet33",
          "body": "At least you didn’t throw up on their stomach right afterwards…. (Not like I did that or anything… it was the first time it uh, fully came to fruition and yeah no. Never again) \n\nOP - you’re not alone. Can you make sure he showers beforehand? A shower together could always be something to kind of set the mood but also make sure everyone is clean. You don’t have to you know, go all the way til it’s done, ask him to give you a heads up before that happens. \n\nEven then, if it’s not your thing, there’s other things you can explore with your partner. As long as you’re open and honest and communicate with each other, that’s all that really matters!",
          "created_utc": 1693273087.0
        },
        {
          "id": "jycoluj",
          "author": "Fantastic-Leopard131",
          "body": "Lmaooo at least you missed his dick. Mine didnt even make it to his stomach just puke all over the poor dudes dick.",
          "created_utc": 1693387470.0
        },
        {
          "id": "jyev2ge",
          "author": "shortnsweet33",
          "body": "Unfortunately I’ve done that before too 🙃 you think I’d learn by now. Pretty nasty, but at least we both just started laughing our asses off cause it was a 100% mood killer. Went and played video games instead lol",
          "created_utc": 1693421289.0
        }
      ]
    }
  ]
}