{
  "id": "16jnpu8",
  "subreddit": "ARFID",
  "author": "racheltheangel222",
  "created_utc": 1694809205.0,
  "title": "“Do i have AFRID?” guide",
  "selftext": "I see a ton of posts asking if they have arfid, and I decided to make this post to help people with these questions. I am getting all of my information from “Cognitive behavioral therapy for avoidant/restrictive food intake disorder” by Jennifer j. Thomas and Kamryn T. Eddy a Cambridge medicine book. I am not a doctor, but i want to help people in my situation. \n\nAvoidant/restrictive food intake disorder is a common feeding or eating disorder diagnosis that describes people who cannot meet their nutritional needs, typically because of sensory sensitivity, fear of adverse consequences and/or apparent lack of interest in eating food. \n\n- limited variety (avoidance of certain foods, such as fruits and vegetables) and/or volume (restriction of amount) \n\n- sensory sensitivity\n\n- fear of adverse consequences (ex. choking, allergic reaction or vomiting) \n\n- lack of interest in eating or food (ex. low hunger, lack of enjoyment eating.)\n\nTo qualify for the AFRID diagnosis, a persons pattern of eating must be associated with significant negative consequences. These include one or more of the following: significant weight loss/growth, nutritional deficiencies, dependence on tube feeding or reliance on energy-dense supplements, or psychological impairment. \n\nClinically speaking, anxiety and depression seem to co-occur in ARFID. Autism spectrum disorder, oppositional defiant disorder, ODC, and ADHD may be more common in those with ARFID. \n\nARFID is not motivated by weight or shape concerns. If avoidant/ restrictive eating co-occurs with other psychiatric or medical illnesses, the eating disturbance must be severe enough to require independent clinical attention to warrant an ARFID diagnosis.",
  "url": "https://www.reddit.com/r/ARFID/comments/16jnpu8/do_i_have_afrid_guide/",
  "score": 106,
  "num_comments": 27,
  "comments": [
    {
      "id": "k1iohph",
      "author": "None",
      "body": "Can you have ARFID if your sensory sensitivity feels like it changes day by day hour to hour? I’m really struggling with figuring out what I have, and ARFID sounds like the closest but I’m not sure. \n\nI’m not “picky” at all in the sense where I won’t try new foods. I’ve eaten a crazy amount of variety, probably more than most people ever or will ever have. It’s just at certain times almost everything will gross me out and just thinking about it will make me feel nauseous. I’ll usually default to “safe” foods like plain rice, plain bread, chicken nuggets and fries or the like where there’s little to no seasonings or flavor when I’m feeling that way. This is only recent development though, I used to just starve and take painkillers to avoid having to eat certain days because I didn’t figure out why I didn’t want to eat until years later. \n\nI do have ADHD and I know people with it might be more likely to have it than some others but nobody has described ARFID the way I’ve described it so I’m not sure :(((. I’m even wondering if I’m gaslighting myself into thinking I have an eating disorder but it’s actually all just a trauma response\n\nI LIKE eating. I LIKE trying new foods. It’s just that it’s never consistent.",
      "created_utc": 1695268340.0,
      "score": 15,
      "context": []
    },
    {
      "id": "k15kxf2",
      "author": "reconverting",
      "body": "After going down the rabbit hole here I have discovered that I very well might have ARFID. Mine doesn't sound as bad as some here but I definitely have sensory sensitivity to a lot of foods and an anxiety with allergies and eating. I also have a recently diagnosed ADHD so this is making a lot of sense if I have it. Will ask my doctor about it next time I'm there. This sub has made some of my behaviors feel validated!",
      "created_utc": 1695058837.0,
      "score": 11,
      "context": []
    },
    {
      "id": "k1jr4wi",
      "author": "CursedImpala16",
      "body": "What if I have been steadily losing weight for 3 years but my drs refuse to do anything past keep checking my normal thyroid levels? I try to explain to them the issues I have with eating, and that it isnt my thyroid but they just say to come back in 6 months to check thyroid again.\n\n I guess what I am asking is: How do I know if I am vitamin deficient? Or that there has been psychological impairment past depression and anxiety spiking? I feel as if my dr would still dismiss me if it is still only my weight and my issues with food. It is like they believe that I am purposely putting myself through this torturous hell for 3 years...",
      "created_utc": 1695295035.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lgoqva5",
      "author": "Spidercreams",
      "body": "I’m 17, I Think I might have it, when I eat food I’m not in the mood for I throw up. I don’t mind trying things but textures and colors get me, like I’ll try something and if it wasn’t for the feeling or look I’d like it.  I use to go through binge eating then not eating at all, but I started to smoke weed and it’s helped so much with that. I went through a lot in my childhood, from having adult size portions forced onto me, to having food restricted, to stealing to be able to eat it could just be a whole mental health issue, idk let me know what yall think and how I can help myself.",
      "created_utc": 1722899568.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lcs56vm",
      "author": "Obvious_Drag2110",
      "body": "im 14 and i think i have afrid because ever since i was a little kid ive gotten so much anxiety from trying new foods. And when i eat smth new, its like my brain CANT process that its good, even tho i know it technically is, i can't bring myself to want to eat it again. Like, i had salmon, and i was like \"oh its not bad, but i dont really like it either\" like it didnt make my brain happy when i ate it, like foods normally do. When mt anxiety gets worse (from hormones), eating becomes harder snd i lose weight. im on this sub because im looking for reassurance and to know that this is ISNT as big of a deal as my family makes it out to be.",
      "created_utc": 1720754696.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkkz6if",
      "author": "mvlod",
      "body": "I'm 19 and I'm pretty sure I have it, my younger brother has it too. I don't think I would be able to get a formal diagnosis and I don't feel I need one right now but I'm glad I came across this post, if anything just to reassure myself that there are others out there who get it and I'm not alone.",
      "created_utc": 1724971614.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ll797g7",
      "author": "aechrapre",
      "body": "What about extreme phobia of new foods and almost never eaten fruits and vegetables? Does that count as enough psychological impairment?",
      "created_utc": 1725309114.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lk8tnih",
      "author": "None",
      "body": "I totally have afrid then i’m finally getting somewhere with my doctor about it and she’s gonna get another doctor to diagnose it",
      "created_utc": 1724795661.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ltsrc99",
      "author": "Heyyyyyythere8",
      "body": "Some of these I can relate to but I don’t know, I don’t have anxiety about eating foods and I never have that part I don’t connect with but I just don’t have an interest in eating at all, like it doesn’t please me and it just seems like a waste. I just feel like I’m eating for no reason but, I have been starting to feel like food just isn’t that good especially out food it’s not enjoyable as I imagined it to be which makes me just no want to eat because I know the outcome. And I my throat does tighten up when I eat so I guess that’s another thing I have to drink something with like everything I eat or I’ll get hiccups or just choke and throat starts like feeling sore. But I don’t really mind that I’m used to it",
      "created_utc": 1729914944.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mza7fiw",
      "author": "existentialcrisesyay",
      "body": "I've always had ARFID, as an autistic kid growing up with food allergies as well my ARFID kinda got worse as I grew up. I think something I didn't realize is that it can become an eating disorder similar to others where it can become dangerous. My ARFID used to be rooted in my autism & anxiety but after getting food poisoning, streptococcus pneumonie, norovirus, then the flew in the span of a year my ARFID has become very rooted in trauma. (As of rn I'm dealing with ARFID very very bad & am trying to get help, it's just kinda hard to take in that ARFID comes in many forms)",
      "created_utc": 1750657709.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzg62e9",
      "author": "Fancy-Resort-8838",
      "body": "Can I have ARFID if I'm technically overweight? I don't like a lot of different foods, I just eat a lot of what I DO like.",
      "created_utc": 1750734306.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2gjuy9",
      "author": "Specialeffects10",
      "body": "I was recently diagnosed with autism last year. I’m an 18 year old female and I have always struggled with eating, and let me preface, this has nothing to do with the way my body looks. I’m very happy with my body. Anyways. I will only eat certain foods. I have safe foods that I will go back to. But I also don’t feel hunger. I am a number of medications due to other neurological disorders. But I’ve always had a problem with hunger and eating. I can go days without eating food and still not be hungry. My parents suspect I have AFRIDs. But I don’t know. If you have any information or insight or suggestions I’d be happy to read them. Thank you.",
      "created_utc": 1752191671.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k5z01zx",
      "author": "nutnutmeg",
      "body": "Dude I feel exactly the same way as you and came to this sub wondering the exact same things!!!!! I feel like my eating habits change so frequently & I relate so hard to feeling nauseous at the thought of eating. It drives me crazy that one day food is great and the next the thought of eating anything but butter pasta sends me into a spiral. It's low-key awkward going out with friends because I know they're concerned that I'm not eating enough but I feel like the anxiety from thinking about eating knocks my appetite sometimes (along with everything else).",
      "created_utc": 1697986327.0,
      "score": 10,
      "context": [
        {
          "id": "k1iohph",
          "author": "None",
          "body": "Can you have ARFID if your sensory sensitivity feels like it changes day by day hour to hour? I’m really struggling with figuring out what I have, and ARFID sounds like the closest but I’m not sure. \n\nI’m not “picky” at all in the sense where I won’t try new foods. I’ve eaten a crazy amount of variety, probably more than most people ever or will ever have. It’s just at certain times almost everything will gross me out and just thinking about it will make me feel nauseous. I’ll usually default to “safe” foods like plain rice, plain bread, chicken nuggets and fries or the like where there’s little to no seasonings or flavor when I’m feeling that way. This is only recent development though, I used to just starve and take painkillers to avoid having to eat certain days because I didn’t figure out why I didn’t want to eat until years later. \n\nI do have ADHD and I know people with it might be more likely to have it than some others but nobody has described ARFID the way I’ve described it so I’m not sure :(((. I’m even wondering if I’m gaslighting myself into thinking I have an eating disorder but it’s actually all just a trauma response\n\nI LIKE eating. I LIKE trying new foods. It’s just that it’s never consistent.",
          "created_utc": 1695268340.0
        }
      ]
    },
    {
      "id": "lgk43kj",
      "author": "UnableKaleidoscope31",
      "body": "I am super late but AFRID can be a trauma response. From what I know it's only causes are really over stimulation in neurodivergent people and/or food related trauma (thats more the anxiety over allergy/choking side or food scarcity). So it's both but it can be just one or the other for you personally",
      "created_utc": 1722830784.0,
      "score": 2,
      "context": [
        {
          "id": "k1iohph",
          "author": "None",
          "body": "Can you have ARFID if your sensory sensitivity feels like it changes day by day hour to hour? I’m really struggling with figuring out what I have, and ARFID sounds like the closest but I’m not sure. \n\nI’m not “picky” at all in the sense where I won’t try new foods. I’ve eaten a crazy amount of variety, probably more than most people ever or will ever have. It’s just at certain times almost everything will gross me out and just thinking about it will make me feel nauseous. I’ll usually default to “safe” foods like plain rice, plain bread, chicken nuggets and fries or the like where there’s little to no seasonings or flavor when I’m feeling that way. This is only recent development though, I used to just starve and take painkillers to avoid having to eat certain days because I didn’t figure out why I didn’t want to eat until years later. \n\nI do have ADHD and I know people with it might be more likely to have it than some others but nobody has described ARFID the way I’ve described it so I’m not sure :(((. I’m even wondering if I’m gaslighting myself into thinking I have an eating disorder but it’s actually all just a trauma response\n\nI LIKE eating. I LIKE trying new foods. It’s just that it’s never consistent.",
          "created_utc": 1695268340.0
        }
      ]
    },
    {
      "id": "k182t9w",
      "author": "racheltheangel222",
      "body": "this sub has been really validating for me too, it feels like no one else truly understands except the nice people here, i wish you luck!",
      "created_utc": 1695093355.0,
      "score": 7,
      "context": [
        {
          "id": "k15kxf2",
          "author": "reconverting",
          "body": "After going down the rabbit hole here I have discovered that I very well might have ARFID. Mine doesn't sound as bad as some here but I definitely have sensory sensitivity to a lot of foods and an anxiety with allergies and eating. I also have a recently diagnosed ADHD so this is making a lot of sense if I have it. Will ask my doctor about it next time I'm there. This sub has made some of my behaviors feel validated!",
          "created_utc": 1695058837.0
        }
      ]
    },
    {
      "id": "kwaigux",
      "author": "Micspacego",
      "body": "Is there a psych department you could contact? How I was assessed with AFRID was through emailing my primary doctor my concerns regarding a possible eating disorder and wants to meet a specialist. I’m not sure if you’ve tired this yet, but requesting a direct number to the psyc department and getting in contact might work to help sort out an intake or something similar. I hope this helps at least a little bit, wishing you the best",
      "created_utc": 1711250326.0,
      "score": 4,
      "context": [
        {
          "id": "k1jr4wi",
          "author": "CursedImpala16",
          "body": "What if I have been steadily losing weight for 3 years but my drs refuse to do anything past keep checking my normal thyroid levels? I try to explain to them the issues I have with eating, and that it isnt my thyroid but they just say to come back in 6 months to check thyroid again.\n\n I guess what I am asking is: How do I know if I am vitamin deficient? Or that there has been psychological impairment past depression and anxiety spiking? I feel as if my dr would still dismiss me if it is still only my weight and my issues with food. It is like they believe that I am purposely putting myself through this torturous hell for 3 years...",
          "created_utc": 1695295035.0
        }
      ]
    },
    {
      "id": "lgk3oxw",
      "author": "UnableKaleidoscope31",
      "body": ">And when i eat smth new, its like my brain CANT process that its good, even tho i know it technically is, i can't bring myself to want to eat it again.\n\nI've been going through this a lot lately and it's hard. It feels easy to be upset at yourself, at least for me, but it's not your fault you feel that way yk\n\nIt is kind of a big deal because it's hard to deal with, in the way I hope they're looking to support you in this. But it's definitely not life ending or even that horrible to live with, even living on my own in my 20s now - it's actually kind of easier without critique of what I'm eating from my family. It's frustrating to not be able to even eat solid foods sometimes, but I'm able to forgive myself because I'm not wrong in any way - and neither are you! You'll be okay and you can still be happy and healthy with AFRID, it's just something to work around, not against. You should try your best to eat as nutrient-rich as you can but self-care (as in, making sure your needs are met like sleeping well, hygiene, having a safe place to unwind, helping yourself before you help others) does help the symptoms lessen a little when you're less overstimulated and stressed. Its never your fault for having symptoms though.\n\nI hope they're not making it a big deal as in trying to talk you out of having AFRID, because it's not a choice and that is such a horrible feeling. Wishing you the best. You'll be okay",
      "created_utc": 1722830583.0,
      "score": 1,
      "context": [
        {
          "id": "lcs56vm",
          "author": "Obvious_Drag2110",
          "body": "im 14 and i think i have afrid because ever since i was a little kid ive gotten so much anxiety from trying new foods. And when i eat smth new, its like my brain CANT process that its good, even tho i know it technically is, i can't bring myself to want to eat it again. Like, i had salmon, and i was like \"oh its not bad, but i dont really like it either\" like it didnt make my brain happy when i ate it, like foods normally do. When mt anxiety gets worse (from hormones), eating becomes harder snd i lose weight. im on this sub because im looking for reassurance and to know that this is ISNT as big of a deal as my family makes it out to be.",
          "created_utc": 1720754696.0
        }
      ]
    },
    {
      "id": "mrmnx5o",
      "author": "extra_scum",
      "body": "Yes",
      "created_utc": 1746902500.0,
      "score": 2,
      "context": [
        {
          "id": "ll797g7",
          "author": "aechrapre",
          "body": "What about extreme phobia of new foods and almost never eaten fruits and vegetables? Does that count as enough psychological impairment?",
          "created_utc": 1725309114.0
        }
      ]
    },
    {
      "id": "mzga6r4",
      "author": "racheltheangel222",
      "body": "hi! afrid is not tied to weight- personally i have afrid and i am also overweight.",
      "created_utc": 1750735929.0,
      "score": 2,
      "context": [
        {
          "id": "mzg62e9",
          "author": "Fancy-Resort-8838",
          "body": "Can I have ARFID if I'm technically overweight? I don't like a lot of different foods, I just eat a lot of what I DO like.",
          "created_utc": 1750734306.0
        }
      ]
    },
    {
      "id": "k6064lr",
      "author": "None",
      "body": "Heya it’s been about a month since I commented and since then figured I might as well “self diagnose” with ARFID until I have the money and resources to get it professionally checked lol.\n\nI’m sorry you’re struggling in a similar way as me, I hope you’ll be able to figure out something that works for you as eating is so important for health and it just sucks that it’s so hard for some of us. \n\nFrom what I’ve seen, ARFID doesn’t require it to happen all the time 24/7. So if you think the stories relate to you and the resources that are out there for it is helpful for your situation, I think it’s safe to say you might have it",
      "created_utc": 1698002269.0,
      "score": 4,
      "context": [
        {
          "id": "k1iohph",
          "author": "None",
          "body": "Can you have ARFID if your sensory sensitivity feels like it changes day by day hour to hour? I’m really struggling with figuring out what I have, and ARFID sounds like the closest but I’m not sure. \n\nI’m not “picky” at all in the sense where I won’t try new foods. I’ve eaten a crazy amount of variety, probably more than most people ever or will ever have. It’s just at certain times almost everything will gross me out and just thinking about it will make me feel nauseous. I’ll usually default to “safe” foods like plain rice, plain bread, chicken nuggets and fries or the like where there’s little to no seasonings or flavor when I’m feeling that way. This is only recent development though, I used to just starve and take painkillers to avoid having to eat certain days because I didn’t figure out why I didn’t want to eat until years later. \n\nI do have ADHD and I know people with it might be more likely to have it than some others but nobody has described ARFID the way I’ve described it so I’m not sure :(((. I’m even wondering if I’m gaslighting myself into thinking I have an eating disorder but it’s actually all just a trauma response\n\nI LIKE eating. I LIKE trying new foods. It’s just that it’s never consistent.",
          "created_utc": 1695268340.0
        },
        {
          "id": "k5z01zx",
          "author": "nutnutmeg",
          "body": "Dude I feel exactly the same way as you and came to this sub wondering the exact same things!!!!! I feel like my eating habits change so frequently & I relate so hard to feeling nauseous at the thought of eating. It drives me crazy that one day food is great and the next the thought of eating anything but butter pasta sends me into a spiral. It's low-key awkward going out with friends because I know they're concerned that I'm not eating enough but I feel like the anxiety from thinking about eating knocks my appetite sometimes (along with everything else).",
          "created_utc": 1697986327.0
        }
      ]
    },
    {
      "id": "lfkx6pq",
      "author": "Curious_Count8117",
      "body": "I feel this way too and I also have adhd",
      "created_utc": 1722301984.0,
      "score": 1,
      "context": [
        {
          "id": "k1iohph",
          "author": "None",
          "body": "Can you have ARFID if your sensory sensitivity feels like it changes day by day hour to hour? I’m really struggling with figuring out what I have, and ARFID sounds like the closest but I’m not sure. \n\nI’m not “picky” at all in the sense where I won’t try new foods. I’ve eaten a crazy amount of variety, probably more than most people ever or will ever have. It’s just at certain times almost everything will gross me out and just thinking about it will make me feel nauseous. I’ll usually default to “safe” foods like plain rice, plain bread, chicken nuggets and fries or the like where there’s little to no seasonings or flavor when I’m feeling that way. This is only recent development though, I used to just starve and take painkillers to avoid having to eat certain days because I didn’t figure out why I didn’t want to eat until years later. \n\nI do have ADHD and I know people with it might be more likely to have it than some others but nobody has described ARFID the way I’ve described it so I’m not sure :(((. I’m even wondering if I’m gaslighting myself into thinking I have an eating disorder but it’s actually all just a trauma response\n\nI LIKE eating. I LIKE trying new foods. It’s just that it’s never consistent.",
          "created_utc": 1695268340.0
        },
        {
          "id": "k5z01zx",
          "author": "nutnutmeg",
          "body": "Dude I feel exactly the same way as you and came to this sub wondering the exact same things!!!!! I feel like my eating habits change so frequently & I relate so hard to feeling nauseous at the thought of eating. It drives me crazy that one day food is great and the next the thought of eating anything but butter pasta sends me into a spiral. It's low-key awkward going out with friends because I know they're concerned that I'm not eating enough but I feel like the anxiety from thinking about eating knocks my appetite sometimes (along with everything else).",
          "created_utc": 1697986327.0
        }
      ]
    },
    {
      "id": "n2hqtlp",
      "author": "Tough-Rise1578",
      "body": "Me too! Lots of times, I can tolerate peanuts, but that's it.",
      "created_utc": 1752207500.0,
      "score": 1,
      "context": [
        {
          "id": "k1iohph",
          "author": "None",
          "body": "Can you have ARFID if your sensory sensitivity feels like it changes day by day hour to hour? I’m really struggling with figuring out what I have, and ARFID sounds like the closest but I’m not sure. \n\nI’m not “picky” at all in the sense where I won’t try new foods. I’ve eaten a crazy amount of variety, probably more than most people ever or will ever have. It’s just at certain times almost everything will gross me out and just thinking about it will make me feel nauseous. I’ll usually default to “safe” foods like plain rice, plain bread, chicken nuggets and fries or the like where there’s little to no seasonings or flavor when I’m feeling that way. This is only recent development though, I used to just starve and take painkillers to avoid having to eat certain days because I didn’t figure out why I didn’t want to eat until years later. \n\nI do have ADHD and I know people with it might be more likely to have it than some others but nobody has described ARFID the way I’ve described it so I’m not sure :(((. I’m even wondering if I’m gaslighting myself into thinking I have an eating disorder but it’s actually all just a trauma response\n\nI LIKE eating. I LIKE trying new foods. It’s just that it’s never consistent.",
          "created_utc": 1695268340.0
        },
        {
          "id": "k5z01zx",
          "author": "nutnutmeg",
          "body": "Dude I feel exactly the same way as you and came to this sub wondering the exact same things!!!!! I feel like my eating habits change so frequently & I relate so hard to feeling nauseous at the thought of eating. It drives me crazy that one day food is great and the next the thought of eating anything but butter pasta sends me into a spiral. It's low-key awkward going out with friends because I know they're concerned that I'm not eating enough but I feel like the anxiety from thinking about eating knocks my appetite sometimes (along with everything else).",
          "created_utc": 1697986327.0
        }
      ]
    },
    {
      "id": "mza81ea",
      "author": "existentialcrisesyay",
      "body": "It can come down to lots of things, mine used to be rooted in autism & anxiety, as I've gotten older & gotten much sicker than I used to my ARFID is very based in trauma & anxiety as the ways illnesses show up IS through nausea & various things to do with the stomach. I used to be able to manage it when it was just autism & anxiety, it's much harder to manage when it's rooted in trauma.",
      "created_utc": 1750658027.0,
      "score": 1,
      "context": [
        {
          "id": "k1iohph",
          "author": "None",
          "body": "Can you have ARFID if your sensory sensitivity feels like it changes day by day hour to hour? I’m really struggling with figuring out what I have, and ARFID sounds like the closest but I’m not sure. \n\nI’m not “picky” at all in the sense where I won’t try new foods. I’ve eaten a crazy amount of variety, probably more than most people ever or will ever have. It’s just at certain times almost everything will gross me out and just thinking about it will make me feel nauseous. I’ll usually default to “safe” foods like plain rice, plain bread, chicken nuggets and fries or the like where there’s little to no seasonings or flavor when I’m feeling that way. This is only recent development though, I used to just starve and take painkillers to avoid having to eat certain days because I didn’t figure out why I didn’t want to eat until years later. \n\nI do have ADHD and I know people with it might be more likely to have it than some others but nobody has described ARFID the way I’ve described it so I’m not sure :(((. I’m even wondering if I’m gaslighting myself into thinking I have an eating disorder but it’s actually all just a trauma response\n\nI LIKE eating. I LIKE trying new foods. It’s just that it’s never consistent.",
          "created_utc": 1695268340.0
        },
        {
          "id": "lgk43kj",
          "author": "UnableKaleidoscope31",
          "body": "I am super late but AFRID can be a trauma response. From what I know it's only causes are really over stimulation in neurodivergent people and/or food related trauma (thats more the anxiety over allergy/choking side or food scarcity). So it's both but it can be just one or the other for you personally",
          "created_utc": 1722830784.0
        }
      ]
    },
    {
      "id": "m2d57nz",
      "author": "TarinnWokeUpTooLate",
      "body": "Reading this is so validating, I'm a very anxious person so I'm almost always stressed especially because of school pressure and this just limits me to only certain types of food because I just want to eat something that makes me feel good otherwise I would prefer to starve\nI'm 18 and my parents don't really want to work around me and my problem has been getting worse with time, hopefully when I live alone I will be able to fix this ",
      "created_utc": 1734373038.0,
      "score": 1,
      "context": [
        {
          "id": "lcs56vm",
          "author": "Obvious_Drag2110",
          "body": "im 14 and i think i have afrid because ever since i was a little kid ive gotten so much anxiety from trying new foods. And when i eat smth new, its like my brain CANT process that its good, even tho i know it technically is, i can't bring myself to want to eat it again. Like, i had salmon, and i was like \"oh its not bad, but i dont really like it either\" like it didnt make my brain happy when i ate it, like foods normally do. When mt anxiety gets worse (from hormones), eating becomes harder snd i lose weight. im on this sub because im looking for reassurance and to know that this is ISNT as big of a deal as my family makes it out to be.",
          "created_utc": 1720754696.0
        },
        {
          "id": "lgk3oxw",
          "author": "UnableKaleidoscope31",
          "body": ">And when i eat smth new, its like my brain CANT process that its good, even tho i know it technically is, i can't bring myself to want to eat it again.\n\nI've been going through this a lot lately and it's hard. It feels easy to be upset at yourself, at least for me, but it's not your fault you feel that way yk\n\nIt is kind of a big deal because it's hard to deal with, in the way I hope they're looking to support you in this. But it's definitely not life ending or even that horrible to live with, even living on my own in my 20s now - it's actually kind of easier without critique of what I'm eating from my family. It's frustrating to not be able to even eat solid foods sometimes, but I'm able to forgive myself because I'm not wrong in any way - and neither are you! You'll be okay and you can still be happy and healthy with AFRID, it's just something to work around, not against. You should try your best to eat as nutrient-rich as you can but self-care (as in, making sure your needs are met like sleeping well, hygiene, having a safe place to unwind, helping yourself before you help others) does help the symptoms lessen a little when you're less overstimulated and stressed. Its never your fault for having symptoms though.\n\nI hope they're not making it a big deal as in trying to talk you out of having AFRID, because it's not a choice and that is such a horrible feeling. Wishing you the best. You'll be okay",
          "created_utc": 1722830583.0
        }
      ]
    },
    {
      "id": "k61figh",
      "author": "nutnutmeg",
      "body": "Thank you! It's nice knowing someone is going through the same and I'm not gaslighting myself like you mentioned also. I hope that you can heal and find yourself in a good place as well!! Thank you for posting",
      "created_utc": 1698020021.0,
      "score": 1,
      "context": [
        {
          "id": "k1iohph",
          "author": "None",
          "body": "Can you have ARFID if your sensory sensitivity feels like it changes day by day hour to hour? I’m really struggling with figuring out what I have, and ARFID sounds like the closest but I’m not sure. \n\nI’m not “picky” at all in the sense where I won’t try new foods. I’ve eaten a crazy amount of variety, probably more than most people ever or will ever have. It’s just at certain times almost everything will gross me out and just thinking about it will make me feel nauseous. I’ll usually default to “safe” foods like plain rice, plain bread, chicken nuggets and fries or the like where there’s little to no seasonings or flavor when I’m feeling that way. This is only recent development though, I used to just starve and take painkillers to avoid having to eat certain days because I didn’t figure out why I didn’t want to eat until years later. \n\nI do have ADHD and I know people with it might be more likely to have it than some others but nobody has described ARFID the way I’ve described it so I’m not sure :(((. I’m even wondering if I’m gaslighting myself into thinking I have an eating disorder but it’s actually all just a trauma response\n\nI LIKE eating. I LIKE trying new foods. It’s just that it’s never consistent.",
          "created_utc": 1695268340.0
        },
        {
          "id": "k5z01zx",
          "author": "nutnutmeg",
          "body": "Dude I feel exactly the same way as you and came to this sub wondering the exact same things!!!!! I feel like my eating habits change so frequently & I relate so hard to feeling nauseous at the thought of eating. It drives me crazy that one day food is great and the next the thought of eating anything but butter pasta sends me into a spiral. It's low-key awkward going out with friends because I know they're concerned that I'm not eating enough but I feel like the anxiety from thinking about eating knocks my appetite sometimes (along with everything else).",
          "created_utc": 1697986327.0
        },
        {
          "id": "k6064lr",
          "author": "None",
          "body": "Heya it’s been about a month since I commented and since then figured I might as well “self diagnose” with ARFID until I have the money and resources to get it professionally checked lol.\n\nI’m sorry you’re struggling in a similar way as me, I hope you’ll be able to figure out something that works for you as eating is so important for health and it just sucks that it’s so hard for some of us. \n\nFrom what I’ve seen, ARFID doesn’t require it to happen all the time 24/7. So if you think the stories relate to you and the resources that are out there for it is helpful for your situation, I think it’s safe to say you might have it",
          "created_utc": 1698002269.0
        }
      ]
    },
    {
      "id": "m2uw0ge",
      "author": "UnableKaleidoscope31",
      "body": "I'm glad it helped you. Again, to you specifically - it'll be okay! I'm sorry they're giving you such a hard time. School gave me a lot of traumas I had to work through, micro and macro lol, and it did get much better for a time once I was away from my parents. \n\nThe only reason I regressed back into AFRID territory as an adult is because I overloaded myself on work... If you even suspect you could have any disability co-morbid like being autistic, I know being away from parents who are like that makes it better for a time. But it might be worth it to invest in therapy and confidence building to not have the cycle repeat from being in the workforce. Or getting a very affordable roommate situation.... being stressed about money doesn't help AFRID at all. I would never go back in time to continue living with my parents, but I went from home cooking meals to only being able to drink a specific protein shake for every meal due to financial stress. If you can bare your parents, work with a therapist to build confidence to say \"mom/dad/guardian, you need to back off\" before continuing a cycle of stress elsewhere. \n\nEither way it will be okay, genuinely. There is always time and room to improve  - as of the last 6 months, I'm back to home cooking for the first time in three years. But when I can't, I don't punish myself. Stress reduction is hard but it's so possible and your future is so bright! You sound like how I was at 18, and I'm doing alright. I'm rooting for you friend! :D",
      "created_utc": 1734632382.0,
      "score": 1,
      "context": [
        {
          "id": "lcs56vm",
          "author": "Obvious_Drag2110",
          "body": "im 14 and i think i have afrid because ever since i was a little kid ive gotten so much anxiety from trying new foods. And when i eat smth new, its like my brain CANT process that its good, even tho i know it technically is, i can't bring myself to want to eat it again. Like, i had salmon, and i was like \"oh its not bad, but i dont really like it either\" like it didnt make my brain happy when i ate it, like foods normally do. When mt anxiety gets worse (from hormones), eating becomes harder snd i lose weight. im on this sub because im looking for reassurance and to know that this is ISNT as big of a deal as my family makes it out to be.",
          "created_utc": 1720754696.0
        },
        {
          "id": "lgk3oxw",
          "author": "UnableKaleidoscope31",
          "body": ">And when i eat smth new, its like my brain CANT process that its good, even tho i know it technically is, i can't bring myself to want to eat it again.\n\nI've been going through this a lot lately and it's hard. It feels easy to be upset at yourself, at least for me, but it's not your fault you feel that way yk\n\nIt is kind of a big deal because it's hard to deal with, in the way I hope they're looking to support you in this. But it's definitely not life ending or even that horrible to live with, even living on my own in my 20s now - it's actually kind of easier without critique of what I'm eating from my family. It's frustrating to not be able to even eat solid foods sometimes, but I'm able to forgive myself because I'm not wrong in any way - and neither are you! You'll be okay and you can still be happy and healthy with AFRID, it's just something to work around, not against. You should try your best to eat as nutrient-rich as you can but self-care (as in, making sure your needs are met like sleeping well, hygiene, having a safe place to unwind, helping yourself before you help others) does help the symptoms lessen a little when you're less overstimulated and stressed. Its never your fault for having symptoms though.\n\nI hope they're not making it a big deal as in trying to talk you out of having AFRID, because it's not a choice and that is such a horrible feeling. Wishing you the best. You'll be okay",
          "created_utc": 1722830583.0
        },
        {
          "id": "m2d57nz",
          "author": "TarinnWokeUpTooLate",
          "body": "Reading this is so validating, I'm a very anxious person so I'm almost always stressed especially because of school pressure and this just limits me to only certain types of food because I just want to eat something that makes me feel good otherwise I would prefer to starve\nI'm 18 and my parents don't really want to work around me and my problem has been getting worse with time, hopefully when I live alone I will be able to fix this ",
          "created_utc": 1734373038.0
        }
      ]
    },
    {
      "id": "ktkk6yo",
      "author": "Sad_Television_8802",
      "body": "I think it’s considered ARFID. Our tolerance for things is built up from societal pressures and external factors. When we’re stressed we close off to our safe space, reverting back to what is familiar and safe; bland, easy to eat food to prevent further sensory overload.",
      "created_utc": 1709703525.0,
      "score": 3,
      "context": [
        {
          "id": "k1iohph",
          "author": "None",
          "body": "Can you have ARFID if your sensory sensitivity feels like it changes day by day hour to hour? I’m really struggling with figuring out what I have, and ARFID sounds like the closest but I’m not sure. \n\nI’m not “picky” at all in the sense where I won’t try new foods. I’ve eaten a crazy amount of variety, probably more than most people ever or will ever have. It’s just at certain times almost everything will gross me out and just thinking about it will make me feel nauseous. I’ll usually default to “safe” foods like plain rice, plain bread, chicken nuggets and fries or the like where there’s little to no seasonings or flavor when I’m feeling that way. This is only recent development though, I used to just starve and take painkillers to avoid having to eat certain days because I didn’t figure out why I didn’t want to eat until years later. \n\nI do have ADHD and I know people with it might be more likely to have it than some others but nobody has described ARFID the way I’ve described it so I’m not sure :(((. I’m even wondering if I’m gaslighting myself into thinking I have an eating disorder but it’s actually all just a trauma response\n\nI LIKE eating. I LIKE trying new foods. It’s just that it’s never consistent.",
          "created_utc": 1695268340.0
        },
        {
          "id": "k5z01zx",
          "author": "nutnutmeg",
          "body": "Dude I feel exactly the same way as you and came to this sub wondering the exact same things!!!!! I feel like my eating habits change so frequently & I relate so hard to feeling nauseous at the thought of eating. It drives me crazy that one day food is great and the next the thought of eating anything but butter pasta sends me into a spiral. It's low-key awkward going out with friends because I know they're concerned that I'm not eating enough but I feel like the anxiety from thinking about eating knocks my appetite sometimes (along with everything else).",
          "created_utc": 1697986327.0
        },
        {
          "id": "k6064lr",
          "author": "None",
          "body": "Heya it’s been about a month since I commented and since then figured I might as well “self diagnose” with ARFID until I have the money and resources to get it professionally checked lol.\n\nI’m sorry you’re struggling in a similar way as me, I hope you’ll be able to figure out something that works for you as eating is so important for health and it just sucks that it’s so hard for some of us. \n\nFrom what I’ve seen, ARFID doesn’t require it to happen all the time 24/7. So if you think the stories relate to you and the resources that are out there for it is helpful for your situation, I think it’s safe to say you might have it",
          "created_utc": 1698002269.0
        },
        {
          "id": "k61figh",
          "author": "nutnutmeg",
          "body": "Thank you! It's nice knowing someone is going through the same and I'm not gaslighting myself like you mentioned also. I hope that you can heal and find yourself in a good place as well!! Thank you for posting",
          "created_utc": 1698020021.0
        }
      ]
    }
  ]
}