{
  "id": "17b4xok",
  "subreddit": "ARFID",
  "author": "mg72501",
  "created_utc": 1697672555.0,
  "title": "Found this out and cried",
  "selftext": "Did research on ARFID today after being food avoidant all my life and when I saw that it may have all started from birth brought me to tears. When I was born the umbilical cord was suffocating me and I was an emergency c-section. Knowing that event may have been carried with me into my 20s and beyond is both a heartbreaking and illuminating realization and I just wanted to share how much this moved me.",
  "url": "https://i.redd.it/d4b1wxa4s1vb1.png",
  "score": 432,
  "num_comments": 54,
  "comments": [
    {
      "id": "k5hgcyl",
      "author": "BassWild2634",
      "body": "I mean my childhood was. Shit from the start, and I have choked on food. NUMEROUS times (including a french fry as a toddler, FUN).\n\nBut also my parents often forced me to eat foods I loathed (read: baked mother*fucking* beans) and thus I puked and WHOOPS I'm a 5 year old who is actively not eating because she keeps getting given foods she hates and she *tells* her parents but. They give no fucks.\n\nI now have an incredibly short list of safe foods. Pizza, cheeseburgers, pasta, mozzarella sticks, and a few other things. There are 'okay' foods I'll eat if they're put on my plate (mashed potatoes, steak, porkchop, etcetera) but I'm definitely not happy about it. I only eat it because financially I'm not in a situation where I can stick to my safe foods.\n\nAnd also I'm severely underweight, so that. Doesn't help.",
      "created_utc": 1697677397.0,
      "score": 70,
      "context": []
    },
    {
      "id": "k5hmsl7",
      "author": "Princeax",
      "body": "Holy shit. I had the umbilical cord wrapped around my neck 3 times and the only way I survived birth was because my arm was in between the cord and my neck. Not to mention that my dad would sit around and drink while cooking and I’d not get fed until very late, so I filled up on fruit. And then when food was finally served, it was always super tense at the table and often times there would be yelling. Holy fucking shit.",
      "created_utc": 1697680147.0,
      "score": 31,
      "context": []
    },
    {
      "id": "k5hebka",
      "author": "None",
      "body": "I choked on a peice of bacon when I was 5. Didn't start eating bacon again until around age 31, but it's gotta be crispy. My mom also got t boned by a truck when she was 8 months pregnant with me.",
      "created_utc": 1697676539.0,
      "score": 23,
      "context": []
    },
    {
      "id": "k5iaysz",
      "author": "First_Rip3444",
      "body": "I was also an umbilical cord strangulation baby\n\nMy dad has always called me his little Smurf bc I was blue from oxygen deprivation 🙃 \n\nInteresting to learn, could you point me towards where you saw this so I could look into the studies more? Thanks for sharing",
      "created_utc": 1697692632.0,
      "score": 22,
      "context": []
    },
    {
      "id": "k5hpfzo",
      "author": "oddistrange",
      "body": "I always had a weird palate, but I think what really sped up the trajectory was when I was eating bread at a restaurant as a kid. Still had some baby teeth, and a tooth came out while tearing at the tough bread. I was chewing and thought there was a hard corn kernel in the bread and then pulled it out and realized it was my tooth. It's not really rational at all but I just remember being so disturbed by the unexpected texture.",
      "created_utc": 1697681307.0,
      "score": 14,
      "context": []
    },
    {
      "id": "k5ixxpl",
      "author": "m24b77",
      "body": "What is the source of this please?",
      "created_utc": 1697710077.0,
      "score": 12,
      "context": []
    },
    {
      "id": "k5ic3jb",
      "author": "None",
      "body": "I am in this group for my child. When she was born for the first minute she didn’t cry because she had swallowed amniotic fluid and they had to get it out.\n\nReading this reminded me of that because I was so scared.",
      "created_utc": 1697693378.0,
      "score": 12,
      "context": []
    },
    {
      "id": "k5hq7eq",
      "author": "A-U-R-A",
      "body": "My mom gave me chicken with bones in it without teaching me how to eat it.  I ate some bones.  Haven’t touched chicken with bones in it since I was 4.",
      "created_utc": 1697681640.0,
      "score": 9,
      "context": []
    },
    {
      "id": "k5haa47",
      "author": "borderline_cat",
      "body": "That’s neat!\n\nI had the umbilical cord wrap around my neck 3 weeks before my moms due date. They rushed her for induction. \n\nShe also had a horrendous pregnancy with me in general",
      "created_utc": 1697674849.0,
      "score": 19,
      "context": []
    },
    {
      "id": "k5hl4n8",
      "author": "Ok-Asparagus3749",
      "body": "I was not aware of this! I was born with the umbilical cord wrapped around my neck as well and didn’t realize that something like that could have an effect on me",
      "created_utc": 1697679428.0,
      "score": 8,
      "context": []
    },
    {
      "id": "k5ij8ft",
      "author": "Nah__me",
      "body": "The birthday parties one. There was always anxiety before a birthday party, I missed many of them. It's a very sucky thing. I have missed out on all school trips and many of the day trips. I have carried this fear that people will know about my 'dirty secret' my entire school life- seriously since nursery- in fact 'fearing' is one of my earliest memories.",
      "created_utc": 1697698431.0,
      "score": 9,
      "context": []
    },
    {
      "id": "k5hyn5o",
      "author": "Lilymoon2653",
      "body": "This is perfection and so true in too many ways. \n\nFor me as a baby out of the womb I had the most absolute extreme colic for months on end until my parents were able to find a formula that I could use",
      "created_utc": 1697685579.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k5hs8qy",
      "author": "vsvpmaddest",
      "body": "i was an emergency c section because my mom fell down some stairs. so crazy!!",
      "created_utc": 1697682549.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k5i1w47",
      "author": "thumperoo",
      "body": "I had a malrotated intestine and malformed epiglottis that resulted in me choking every time I nursed for the first 11 weeks of my life until I had surgery wow wow wow",
      "created_utc": 1697687277.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k5i4xmu",
      "author": "calmingthechaos",
      "body": "I was born with my umbilical cord wrapped around my neck. I don't know if that's necessarily causation, but it is an interesting correlation. I'm not diagnosed or anything,  but I definitely have my safe foods and a lot of food avoidance.",
      "created_utc": 1697688951.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k5k032l",
      "author": "Dabbbler",
      "body": "Calling bullshit. I’m in the middle of 3 generations of extremely picky eaters and it seems to be from an enhanced smell/taste sensory. No",
      "created_utc": 1697728478.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k5igc00",
      "author": "Zealousideal-Eye273",
      "body": "Umbilical cord wrapped around my shoulder and neck while my mom had to push me out. I was born with a conehead cause I got stuck. I'm sure that didn't help.",
      "created_utc": 1697696299.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k5iw2mp",
      "author": "SB_Wife",
      "body": "I personally don't remember choking, but I have been told I almost died the day after I was born. I apparently turned blue.\n\nMost of the trauma I have around food is my mom had eating disorders and when I started to have major sensory issues, she was verbally abusive. Who calls a two year old a bitch?",
      "created_utc": 1697708651.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k5ixmbh",
      "author": "_throw_away_KOBE",
      "body": "As a toddler I drank kerosene oil, almost died. Even into adolescence I had a decent chunk of safe foods (like 15+), but my family would always push me (trigger foods were water, veggies, fruits), and shame me and shit. So much so that I there was a giant argument at my 7th grade birthday party. It was terrible. \nHoly fuck this is so relateable",
      "created_utc": 1697709843.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k5jytao",
      "author": "None",
      "body": "This actually makes so much sense. My mom says I ate all kinds of things when I was a very young toddler, and one of my first memories is of when I was mistreated at a daycare by an employee because I didn’t like green beans. TW— she tried to force me to swallow them and left bruises on my face. I was probably 4. 20 now and I have not tried a new food since then.",
      "created_utc": 1697727998.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k5kcj1z",
      "author": "JazzyAngel4646",
      "body": "I’m not officially diagnosed…but for me my restrictive eating has no association with a fear of choking…for me it’s a combination of sensory issues…and a phobia of vomiting…I’ve never really worried about choking, but I do worry about throwing up or gagging or unpleasant sensory feelings \n\nI was a completely normal birth, no issues other than being born 2 weeks late\n\nI do have diagnosed ADHD though and strongly suspected OCD \n\nSo for me I think my restrictive eating is more attributed to a combination of sensory issues and obsessive compulsive behavior surrounding the obsession of avoiding vomiting and gagging \n\nI have always had a particularly sensitive gag reflex",
      "created_utc": 1697733017.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k5kjth5",
      "author": "pasghetti_n_meatbals",
      "body": "My child had a cord wrapped around his neck too (needed emergency C-section). I've always wondered if he had any memory of that event because many times in playing between ages 4-6.5 years he has wrapped tape, ribbon, etc around himself. Once I explained that we can't wrap things around our head for safety, it  became a \"forbidden fruit\" scenario and he wanted to hide from me and do it. He told me that he hid because he didn't want me to be scared, that he was going to be safe, but I was always close and used distractions to play something else. We started seeing a great counselor to help with several things (anxiety, ARFID, general parenting, etc). He told me a couple times that he was playing spider and bug and that he was a bug caught in a web, wrapped up and the spider was going to eat him. (he saw this once in a book). I still don't truly know all that he was thinking/playing at those times. When he's older I plan to let him know about the cord at birth, just in case there is some subconscious impact there . Overall I feel there's a lot more contributing to his ARFID too like sensory issues and lack of regular hunger signals.\n\nI'm so sorry that reading that made you cry. It certainly doesn't paint a hopeful picture and it does highlight the trauma that can be carried throughout a lifetime. I view my child's ARFID as a part of the human experience, and just like many other experiences, it requires understanding, education, meeting needs, getting support. It doesn't make the experience easier, but it helps me to look for the ways to help and support. I hope to help prevent him from withdrawing, avoiding, and feeling shame for ARFID. This involves a lot of identifying, modifying, and eliminating societal and cultural expectations and norms surrounding food. (For instance I'm completely restructuring our Thanksgiving holidays going forward) And to help him develop what he needs inside of himself to prevent that withdrawing and avoiding. \n\nI know that article was tough to read, but I hope that I can send a little bit of positivity and hope to you today!!",
      "created_utc": 1697735615.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k5i563o",
      "author": "nomoreadminspls",
      "body": "This ALL tracks.",
      "created_utc": 1697689085.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k5j8i8q",
      "author": "AndykinSkywlker",
      "body": "Well, that last paragraph really hit home.",
      "created_utc": 1697716690.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k5keh30",
      "author": "biscottiapricot",
      "body": "now im curious if i had any complications like that.. my arfid might just be because im autistic though :p",
      "created_utc": 1697733717.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k5j7gie",
      "author": "CBunny9",
      "body": "I wonder how they can know that something in-utero or during birth is affecting a person in adolescence or adulthood? I’d like to read about how they found this out. It would be amazing if they know our bodies start building memory before birth. And how do you prove something like that?",
      "created_utc": 1697716124.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k5iqki7",
      "author": "Chagdoo",
      "body": "Oh wow they got my childhood and most of my safe foods to a T. Neat.",
      "created_utc": 1697704242.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k5iqvn5",
      "author": "lamemo",
      "body": "Oh my god. My umbilical cord was knotted around my neck…",
      "created_utc": 1697704492.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k5j4e54",
      "author": "marlon_tmh",
      "body": "How do you feel finding out this way?\n\nMay I ask where you found this article/info?",
      "created_utc": 1697714365.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k5krqxn",
      "author": "serioustransvibes",
      "body": "I got an ear infection as a baby/toddler and the antibiotics I got for it made me throw up, according to my mum the doctors kept telling her to just keep giving it to me for like a week until they changed it to a different one (and I threw up every time I got it). She thinks it probably started around there, according to her, I ate more or less normally before that (I think I was around 1-2 years old when this happened). So.. that does sound about right.",
      "created_utc": 1697738472.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k5kyk83",
      "author": "Colombian-",
      "body": "I’m in this group for my son, he had umbilical cord wrapped around his neck 3 times, he has ASD and he hasn’t tried new foods since he was 2, he has never been forced to eat anything he doesn’t like but he runs from food when is offered like if he’s scared of it. He just eats his comfort foods that basically are just carbs (crackers, pizza and nuggets) and we In the process of seeing a gastroenterologist. This information is important to know.",
      "created_utc": 1697740957.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k5l3ypm",
      "author": "littleghool",
      "body": "Couldn't have said it better myself 👏",
      "created_utc": 1697742903.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k5lebn3",
      "author": "purplechunkymonkey",
      "body": "My daughter is an umbilical cord baby. It was wrapped around her neck 3 times. What I find odd was that she ate absolutely everything especially if my dad was eating it. And the spicier the better. Then she hit the typical toddler picky phase and stopped eating almost everything. She's 13 now.",
      "created_utc": 1697746650.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k5lteko",
      "author": "Enzoid23",
      "body": "The only relevant pre-ARFID thing I know of is my mom said she had to quit eating strawberries while I still had to be breastfed because I would get rashes or something but I don't know if it was traumatic for me, in my case it's probably the autism\n\n(Not denying the research! I just like sharing about myself)",
      "created_utc": 1697752252.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k5luspk",
      "author": "shorty_12",
      "body": "i have arfid and my birth was totally normal. let’s remember correlation doesn’t equal causation! i’m sure it’s still validating to see for some ppl tho :)",
      "created_utc": 1697752788.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k5mkbuu",
      "author": "dogluver_99",
      "body": "Oh my god, I had the umbilical cord wrapped around my neck! My mom had to have a c-section so I wouldn’t suffocate. My safe foods are also incredibly similar to those listed. OP, where is this from? I’d love to learn more about the connections between birth trauma/injury and ARFID. I always thought my ARFID was mainly childhood trauma/anxiety based.",
      "created_utc": 1697763359.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k5r0161",
      "author": "None",
      "body": "Hm, I only got afrid after serving in the military.",
      "created_utc": 1697838998.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k60u723",
      "author": "Pink_Dreams713",
      "body": "My Montessori school had a rule where you couldn’t say you didn’t like something until you tried it first when it came to snack time. There were no exceptions and no substitutions. Even if I knew I didn’t like it, I had to try it and if I didn’t try it I would be punished and that usually included shaming me in front of the whole class and forcing me to sit alone with the food while everyone else went to recess. One time they forced a piece of string cheese into my mouth and thus I threw up. Pretty sure that’s where my food aversion came from lol.",
      "created_utc": 1698011063.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kih6f4d",
      "author": "Specific_Future_776",
      "body": "well uh my mum was told i was going to die from 8 weeks fast forward a bunch of problems a different blood type to her (i’m o positive she’s o negative) and then i got the cord wrapped round twice apparently 🙃i’ve also got a childhood memory of me choking on chicken and i now cannot stand it i’ve also choked on bacon and now needed almost burn crispy to even go near it i also have intolerances which makes me fearful of food as i get pain",
      "created_utc": 1705605542.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k5kb9hl",
      "author": "narcoed",
      "body": "I have a similar childhood- choked on a piece of candy at funeral when I was really young and my parents constantly forced fed me food that I didn’t like. That shit was traumatizing and they wonder why I don’t talk to them anymore now.",
      "created_utc": 1697732564.0,
      "score": 16,
      "context": [
        {
          "id": "k5hgcyl",
          "author": "BassWild2634",
          "body": "I mean my childhood was. Shit from the start, and I have choked on food. NUMEROUS times (including a french fry as a toddler, FUN).\n\nBut also my parents often forced me to eat foods I loathed (read: baked mother*fucking* beans) and thus I puked and WHOOPS I'm a 5 year old who is actively not eating because she keeps getting given foods she hates and she *tells* her parents but. They give no fucks.\n\nI now have an incredibly short list of safe foods. Pizza, cheeseburgers, pasta, mozzarella sticks, and a few other things. There are 'okay' foods I'll eat if they're put on my plate (mashed potatoes, steak, porkchop, etcetera) but I'm definitely not happy about it. I only eat it because financially I'm not in a situation where I can stick to my safe foods.\n\nAnd also I'm severely underweight, so that. Doesn't help.",
          "created_utc": 1697677397.0
        }
      ]
    },
    {
      "id": "k5oas8f",
      "author": "mmm-soup",
      "body": ">But also my parents often forced me to eat foods I loathed (read: baked motherfucking beans) and thus I puked and WHOOPS I'm a 5 year old who is actively not eating because she keeps getting given foods she hates and she tells her parents but. They give no fucks.\n\nI felt this in my soul. I had that same throwing up experience when I was 6. My mom tried to force me to eat these weird fried spaghetti egg things she made, and I ended up vomiting on the wall after sobbing in front of the plate for an hour. My parents would also literally ignore me if I didn't eat what they wanted me to, so my brain associated food with emotional distress and fear of punishment, and to this day eating still gives me anxiety. It doesn't help that I'm kind of an emotionally avoidant person, so if I'm already stressed out with other things, I avoid eating just so I don't have to deal with the added emotional stress and anxiety that comes with it.",
      "created_utc": 1697800658.0,
      "score": 6,
      "context": [
        {
          "id": "k5hgcyl",
          "author": "BassWild2634",
          "body": "I mean my childhood was. Shit from the start, and I have choked on food. NUMEROUS times (including a french fry as a toddler, FUN).\n\nBut also my parents often forced me to eat foods I loathed (read: baked mother*fucking* beans) and thus I puked and WHOOPS I'm a 5 year old who is actively not eating because she keeps getting given foods she hates and she *tells* her parents but. They give no fucks.\n\nI now have an incredibly short list of safe foods. Pizza, cheeseburgers, pasta, mozzarella sticks, and a few other things. There are 'okay' foods I'll eat if they're put on my plate (mashed potatoes, steak, porkchop, etcetera) but I'm definitely not happy about it. I only eat it because financially I'm not in a situation where I can stick to my safe foods.\n\nAnd also I'm severely underweight, so that. Doesn't help.",
          "created_utc": 1697677397.0
        }
      ]
    },
    {
      "id": "k5lhvrm",
      "author": "badgurlvenus",
      "body": "dude same. they broke my collar bone yanking me out so i wouldn't die. parents didn't find out for two weeks.",
      "created_utc": 1697747936.0,
      "score": 9,
      "context": [
        {
          "id": "k5iaysz",
          "author": "First_Rip3444",
          "body": "I was also an umbilical cord strangulation baby\n\nMy dad has always called me his little Smurf bc I was blue from oxygen deprivation 🙃 \n\nInteresting to learn, could you point me towards where you saw this so I could look into the studies more? Thanks for sharing",
          "created_utc": 1697692632.0
        }
      ]
    },
    {
      "id": "k5vv3k4",
      "author": "mg72501",
      "body": "Here is my source! [Source Link](https://www.nationaleatingdisorders.org/blog/what-exactly-arfid)",
      "created_utc": 1697923304.0,
      "score": 2,
      "context": [
        {
          "id": "k5iaysz",
          "author": "First_Rip3444",
          "body": "I was also an umbilical cord strangulation baby\n\nMy dad has always called me his little Smurf bc I was blue from oxygen deprivation 🙃 \n\nInteresting to learn, could you point me towards where you saw this so I could look into the studies more? Thanks for sharing",
          "created_utc": 1697692632.0
        }
      ]
    },
    {
      "id": "k5ltou5",
      "author": "Enzoid23",
      "body": "I used to airways accidentally bite my teeth when they fell out, once I bit so hard it got jammed back inside for a few years straight 💀",
      "created_utc": 1697752361.0,
      "score": 2,
      "context": [
        {
          "id": "k5hpfzo",
          "author": "oddistrange",
          "body": "I always had a weird palate, but I think what really sped up the trajectory was when I was eating bread at a restaurant as a kid. Still had some baby teeth, and a tooth came out while tearing at the tough bread. I was chewing and thought there was a hard corn kernel in the bread and then pulled it out and realized it was my tooth. It's not really rational at all but I just remember being so disturbed by the unexpected texture.",
          "created_utc": 1697681307.0
        }
      ]
    },
    {
      "id": "k5t2l0e",
      "author": "-zo_oz-",
      "body": "not the op but think I've found it :)  https://www.nationaleatingdisorders.org/blog/what-exactly-arfid",
      "created_utc": 1697878962.0,
      "score": 1,
      "context": [
        {
          "id": "k5ixxpl",
          "author": "m24b77",
          "body": "What is the source of this please?",
          "created_utc": 1697710077.0
        }
      ]
    },
    {
      "id": "k5k6u4z",
      "author": "SuccessPutrid7349",
      "body": "Hello fellow supertaster 👋",
      "created_utc": 1697730962.0,
      "score": 2,
      "context": [
        {
          "id": "k5k032l",
          "author": "Dabbbler",
          "body": "Calling bullshit. I’m in the middle of 3 generations of extremely picky eaters and it seems to be from an enhanced smell/taste sensory. No",
          "created_utc": 1697728478.0
        }
      ]
    },
    {
      "id": "k7opxvx",
      "author": "NoWheel7780",
      "body": "just because something doesnt apply to you doesnt mean its fake",
      "created_utc": 1699036855.0,
      "score": 2,
      "context": [
        {
          "id": "k5k032l",
          "author": "Dabbbler",
          "body": "Calling bullshit. I’m in the middle of 3 generations of extremely picky eaters and it seems to be from an enhanced smell/taste sensory. No",
          "created_utc": 1697728478.0
        }
      ]
    },
    {
      "id": "k5m3ecr",
      "author": "Trid12345",
      "body": "I don't know if this helps you or not. I had my umbilical cord wrapped around my neck in the womb just once. My parents have footage of me before the picky eater phase eating a jam sandwich. After that phase I refused to even entertain the idea. I'm now 24 turning 25 in a couple of months and still to this day struggle with ARFID.",
      "created_utc": 1697756285.0,
      "score": 1,
      "context": [
        {
          "id": "k5lebn3",
          "author": "purplechunkymonkey",
          "body": "My daughter is an umbilical cord baby. It was wrapped around her neck 3 times. What I find odd was that she ate absolutely everything especially if my dad was eating it. And the spicier the better. Then she hit the typical toddler picky phase and stopped eating almost everything. She's 13 now.",
          "created_utc": 1697746650.0
        }
      ]
    },
    {
      "id": "k5kbpkz",
      "author": "BassWild2634",
      "body": "GODS. Yeah if I wasn't financially dependent on my parents I would be no-contact.\n\nCertainly didn't make things better that my Mom constantly talking about her weight through my *entire* childhood led to me developing anorexia as well. It's **GREAT.** /heavy sarcasm\n\nSchist, I distinctly remember a time I was forced to take a DISGUSTING tasting med for vomiting and uh. Well. My parents shoved it in a grape and thought that'd do the trick.\n\nCue more vomiting.\n\nSIGH.",
      "created_utc": 1697732724.0,
      "score": 8,
      "context": [
        {
          "id": "k5hgcyl",
          "author": "BassWild2634",
          "body": "I mean my childhood was. Shit from the start, and I have choked on food. NUMEROUS times (including a french fry as a toddler, FUN).\n\nBut also my parents often forced me to eat foods I loathed (read: baked mother*fucking* beans) and thus I puked and WHOOPS I'm a 5 year old who is actively not eating because she keeps getting given foods she hates and she *tells* her parents but. They give no fucks.\n\nI now have an incredibly short list of safe foods. Pizza, cheeseburgers, pasta, mozzarella sticks, and a few other things. There are 'okay' foods I'll eat if they're put on my plate (mashed potatoes, steak, porkchop, etcetera) but I'm definitely not happy about it. I only eat it because financially I'm not in a situation where I can stick to my safe foods.\n\nAnd also I'm severely underweight, so that. Doesn't help.",
          "created_utc": 1697677397.0
        },
        {
          "id": "k5kb9hl",
          "author": "narcoed",
          "body": "I have a similar childhood- choked on a piece of candy at funeral when I was really young and my parents constantly forced fed me food that I didn’t like. That shit was traumatizing and they wonder why I don’t talk to them anymore now.",
          "created_utc": 1697732564.0
        }
      ]
    },
    {
      "id": "k5ob32o",
      "author": "BassWild2634",
      "body": "Same on the food with distress & fear bit. So fluffin' much.\n\nLots of nights stuck at the table, sitting in front of a plate of foods they know full well I don't eat.\n\nOh and also loads of nights where they got chinese or mexican takeout and uh. Those nights I just. Didn't eat. Hundreds if not thousands of meals missed all the way until I was a teenager and thus forced to feed myself for most meals.\n\nYeah.",
      "created_utc": 1697800833.0,
      "score": 5,
      "context": [
        {
          "id": "k5hgcyl",
          "author": "BassWild2634",
          "body": "I mean my childhood was. Shit from the start, and I have choked on food. NUMEROUS times (including a french fry as a toddler, FUN).\n\nBut also my parents often forced me to eat foods I loathed (read: baked mother*fucking* beans) and thus I puked and WHOOPS I'm a 5 year old who is actively not eating because she keeps getting given foods she hates and she *tells* her parents but. They give no fucks.\n\nI now have an incredibly short list of safe foods. Pizza, cheeseburgers, pasta, mozzarella sticks, and a few other things. There are 'okay' foods I'll eat if they're put on my plate (mashed potatoes, steak, porkchop, etcetera) but I'm definitely not happy about it. I only eat it because financially I'm not in a situation where I can stick to my safe foods.\n\nAnd also I'm severely underweight, so that. Doesn't help.",
          "created_utc": 1697677397.0
        },
        {
          "id": "k5oas8f",
          "author": "mmm-soup",
          "body": ">But also my parents often forced me to eat foods I loathed (read: baked motherfucking beans) and thus I puked and WHOOPS I'm a 5 year old who is actively not eating because she keeps getting given foods she hates and she tells her parents but. They give no fucks.\n\nI felt this in my soul. I had that same throwing up experience when I was 6. My mom tried to force me to eat these weird fried spaghetti egg things she made, and I ended up vomiting on the wall after sobbing in front of the plate for an hour. My parents would also literally ignore me if I didn't eat what they wanted me to, so my brain associated food with emotional distress and fear of punishment, and to this day eating still gives me anxiety. It doesn't help that I'm kind of an emotionally avoidant person, so if I'm already stressed out with other things, I avoid eating just so I don't have to deal with the added emotional stress and anxiety that comes with it.",
          "created_utc": 1697800658.0
        }
      ]
    },
    {
      "id": "k5li1z7",
      "author": "First_Rip3444",
      "body": "Damnnn no shit\n\nThey just had to cut my cord while I was still in the birth canal because it didn't have enough length after being around my neck\n\nMy dad said it was like a bungee cord I shot out and he almost dropped me XD",
      "created_utc": 1697748000.0,
      "score": 3,
      "context": [
        {
          "id": "k5iaysz",
          "author": "First_Rip3444",
          "body": "I was also an umbilical cord strangulation baby\n\nMy dad has always called me his little Smurf bc I was blue from oxygen deprivation 🙃 \n\nInteresting to learn, could you point me towards where you saw this so I could look into the studies more? Thanks for sharing",
          "created_utc": 1697692632.0
        },
        {
          "id": "k5lhvrm",
          "author": "badgurlvenus",
          "body": "dude same. they broke my collar bone yanking me out so i wouldn't die. parents didn't find out for two weeks.",
          "created_utc": 1697747936.0
        }
      ]
    },
    {
      "id": "k5vxsyo",
      "author": "First_Rip3444",
      "body": "Thanks!!",
      "created_utc": 1697924441.0,
      "score": 1,
      "context": [
        {
          "id": "k5iaysz",
          "author": "First_Rip3444",
          "body": "I was also an umbilical cord strangulation baby\n\nMy dad has always called me his little Smurf bc I was blue from oxygen deprivation 🙃 \n\nInteresting to learn, could you point me towards where you saw this so I could look into the studies more? Thanks for sharing",
          "created_utc": 1697692632.0
        },
        {
          "id": "k5vv3k4",
          "author": "mg72501",
          "body": "Here is my source! [Source Link](https://www.nationaleatingdisorders.org/blog/what-exactly-arfid)",
          "created_utc": 1697923304.0
        }
      ]
    },
    {
      "id": "k5m4oth",
      "author": "purplechunkymonkey",
      "body": "I have put her in charge of her food. Most nights she cooks her own dinner. She's making pancakes right now. Sometimes she eats what I cook but sometimes she can't eat it even if she likes it. This is treated as normal in our house and with friends and family.",
      "created_utc": 1697756832.0,
      "score": 3,
      "context": [
        {
          "id": "k5lebn3",
          "author": "purplechunkymonkey",
          "body": "My daughter is an umbilical cord baby. It was wrapped around her neck 3 times. What I find odd was that she ate absolutely everything especially if my dad was eating it. And the spicier the better. Then she hit the typical toddler picky phase and stopped eating almost everything. She's 13 now.",
          "created_utc": 1697746650.0
        },
        {
          "id": "k5m3ecr",
          "author": "Trid12345",
          "body": "I don't know if this helps you or not. I had my umbilical cord wrapped around my neck in the womb just once. My parents have footage of me before the picky eater phase eating a jam sandwich. After that phase I refused to even entertain the idea. I'm now 24 turning 25 in a couple of months and still to this day struggle with ARFID.",
          "created_utc": 1697756285.0
        }
      ]
    },
    {
      "id": "k5pt9zq",
      "author": "stonerxmomx",
      "body": "they pushed me back inside my mom to unravel it and then right back out 😭",
      "created_utc": 1697822863.0,
      "score": 3,
      "context": [
        {
          "id": "k5iaysz",
          "author": "First_Rip3444",
          "body": "I was also an umbilical cord strangulation baby\n\nMy dad has always called me his little Smurf bc I was blue from oxygen deprivation 🙃 \n\nInteresting to learn, could you point me towards where you saw this so I could look into the studies more? Thanks for sharing",
          "created_utc": 1697692632.0
        },
        {
          "id": "k5lhvrm",
          "author": "badgurlvenus",
          "body": "dude same. they broke my collar bone yanking me out so i wouldn't die. parents didn't find out for two weeks.",
          "created_utc": 1697747936.0
        },
        {
          "id": "k5li1z7",
          "author": "First_Rip3444",
          "body": "Damnnn no shit\n\nThey just had to cut my cord while I was still in the birth canal because it didn't have enough length after being around my neck\n\nMy dad said it was like a bungee cord I shot out and he almost dropped me XD",
          "created_utc": 1697748000.0
        }
      ]
    }
  ]
}