{
  "id": "17ih7k5",
  "subreddit": "ARFID",
  "author": "WampaCat",
  "created_utc": 1698509999.0,
  "title": "Why is mayo an assumed ingredient in EVERY sandwich??",
  "selftext": "I had a thing for work a few months ago where lunch was provided from a local cafe. We had the menu ahead of time and I had to give three options. So I chose the only three that didn’t have mayo in the list of ingredients while everything else did. 2 out of the three options ended up including mayo anyway. Whyyyyy. Mayo doesn’t belong anywhere near a caprese sandwich/wrap!\n\nMy most recent experience really pushed me over the edge though and I’m still mad about it. Stopped into a sandwich place while out on a job that was really more of a deli/market. The menu just said stuff like “turkey sandwich” and “ham sandwich” with no more information. I order the turkey sandwich and they ask me what I want on it. So I said lettuce and cheese. I had a feeling they might put other stuff on it but thought no, that’s your anxiety, she asked what you wanted on it and you told her. Grabbed the sandwich and left. Sat down outside to eat somewhere else and it was a massive sandwich with massive globs of mayo in it. I was so frustrated I wanted to cry. Because I didn’t have time to go anywhere else and I’d spent $12 on this abomination. \n\nI have gotten past so many trigger foods as an adult, but it’s like for every food I add to my list of safe things, it makes something else even more offensive to me. I can actually eat tomatoes now, sometimes even enjoy them, and don’t have a fear of new foods if I know everything that’s in it first. Lots of other stuff I was finally able to get past. But now mayo, mushrooms, olives and basically anything that comes out of the water are that much worse for me. \n\nBut maybe I’m the one that wrong??? Like I didn’t tell her I wanted bread for my sandwich because bread is implied so I got bread. Is mayo implied for everything too? \n\nWhy is everyone so adamant on having massive globs of this stuff on their sandwiches I can’t",
  "url": "https://www.reddit.com/r/ARFID/comments/17ih7k5/why_is_mayo_an_assumed_ingredient_in_every/",
  "score": 146,
  "num_comments": 48,
  "comments": [
    {
      "id": "k6uou4p",
      "author": "Pink_Dress",
      "body": "No, I completely agree! I wish sandwiches for work functions or whatever came without condiments so people can change it as needed! I can take a tomato off my sandwich and be fine, but it’s a heck of a lot harder to remove condiments",
      "created_utc": 1698517014.0,
      "score": 63,
      "context": []
    },
    {
      "id": "k6updu8",
      "author": "Sea-Argument7634",
      "body": "Just give me plain food. I'll add other things if I want to. I hate when people just add things to food when it wasn't even supposed to be there. Mostly ketchup/tomato sauce.",
      "created_utc": 1698517232.0,
      "score": 33,
      "context": []
    },
    {
      "id": "k6uzq6g",
      "author": "Scorpiodancer123",
      "body": "I totally agree with you. I absolutely despise mayo. \n\nIt's totally replaced butter in sandwiches now. I'm guessing because it can be squirted onto bread by machine for pre-packaged sandwiches. \n\nI've tried so many times to just tolerate it but I hate it.",
      "created_utc": 1698521470.0,
      "score": 16,
      "context": []
    },
    {
      "id": "k6uwr16",
      "author": "purplechunkymonkey",
      "body": "I'm 47 and just getting over my hatred of mayo. I still don't like it.",
      "created_utc": 1698520237.0,
      "score": 12,
      "context": []
    },
    {
      "id": "k6wsgbp",
      "author": "littleghool",
      "body": "Sandwiches are not safe foods for me partly for this reason! When you get a sandwich, it should come without any sauces, IMO. And then sauces can be added upon request. Not everyone wants sauces, and even when they do, sometimes they add WAY too much or too little. Bleh. Too many variables. I'll stick to homemade PB&J",
      "created_utc": 1698550512.0,
      "score": 11,
      "context": []
    },
    {
      "id": "k6vvfqe",
      "author": "Cressio",
      "body": "Mayo is trash. I don’t think it’s even an ARFID thing for me. I just genuinely think it doesn’t taste good/anything it’s in would be better without it. I purposefully had it in a mcchicken the other day to remind myself if it was as bad as I remembered. Yup. Managed to get through eating it fine but, again, just would’ve been better without it.",
      "created_utc": 1698534577.0,
      "score": 10,
      "context": []
    },
    {
      "id": "k6vxnnw",
      "author": "Athyrical",
      "body": "I feel you. Grilled cheese is one of my favourite safe foods and this one time, a grilled cheese at a cafe said it had mayo in it. It was the only thing I could eat and I thought maybe it was just a little bit, maybe even just grilled it in mayo. That seemed manageable. NOPE, I bit into it and there was a layer of mayo over the cheese that was like 5cm thick. It oozed out as I bit into it. This made me go from kind of tolerating mayo to really disliking it for a while. \n\nWhy why why can't we just use a thin spread of butter instead of mayo?? Why do we even need condiments that ooze out and make sandwiches soggy for no reason? \"Dry\" sandwiches aren't so bad, let me just choose the condiments myself if I want them. Mayo is so overrated.",
      "created_utc": 1698535568.0,
      "score": 12,
      "context": []
    },
    {
      "id": "k6wao1e",
      "author": "katieb2342",
      "body": "I hate mayo too, but the fact that restaurants just skip ingredients in descriptions bothers me so much! If they think mayonnaise IS an ingredient worth pointing out on some sandwiches, everything with mayo should specify it's there!\n\nI had the same thing happen once, an old boss offered to buy us lunch from this barbeque place that she wanted to try. I hate barbeque sauce, so I went through the entire menu and ordered a chicken sandwich which was the ONLY item that didn't list barbeque sauce in the ingredients. Guess what was on it? Clearly you thought it was important to specify the others had it, so why not this one?",
      "created_utc": 1698541453.0,
      "score": 10,
      "context": []
    },
    {
      "id": "k6ybjqe",
      "author": "throwaway_185051108",
      "body": "I FEEL SO HEARD!!!! \n\nfr you guys make me feel way less alone in so many of my food preferences. MAYO SUCKS. I HATE IT. WHY DOES IT HAVE TO BE ON *EVERYTHING*????? \n\neither its mayo, or some mayo-adjacent-hellmonster thats just mayo with more bad ingredients creamed into it. fuck aioli. aioli is mayo in a fancy suit trying to act all esteemed but its just fucking mayo with things in it. you could add anything to mayo and its still mayo, i dont care. it doesn’t change it. and it ruins all sandwiches. i can’t stand most condiments in general, i don’t like chewing on cream unless its ice cream",
      "created_utc": 1698588565.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k6ve6rh",
      "author": "rilo_cat",
      "body": "are you me??",
      "created_utc": 1698527265.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k6xphw3",
      "author": "Mikaay99",
      "body": "What drives me insane is when you get a ton of condiment that you did not ask for, is not necessary and ruins the entire meal but they can't be bothered to but more veggies in it. Like a sandwich oozing with mayo but it only has two pickles so it can't even be balanced out.",
      "created_utc": 1698575366.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k6ygf49",
      "author": "youcantmakemeeeeee",
      "body": "I hate all condiments, but mayo is everywhere!!! Even when I specifically ask for no mayo, it’s still there. I assume any work function that includes sandwiches means I’m only eating chips that day.",
      "created_utc": 1698590737.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k6xa65h",
      "author": "yamiryukia330",
      "body": "I agree entirely. I have a strong distaste for many condiments and mayo especially. It's hell trying to remove them.",
      "created_utc": 1698562767.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k6wvvmr",
      "author": "PrimaryQuiet8105",
      "body": "Omg yes!! Literally today my brother bought burgers for everyone and he asked for no mayo, what did they do? PUT FREAKING MAYO ON EVERYTHING, but really the only condiments I can tolerate alrd on a lunch is bbq and that it",
      "created_utc": 1698552535.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k6x3bxu",
      "author": "httpsomin",
      "body": "I hate mayo. I just make sure to tell anyone that when I buy sandwiches or burgers. Sometimes the workers would reply, \"Oh we don't really put mayonnaise in this\" and I'd be a bit embarrassed but it saves the day for me.",
      "created_utc": 1698557424.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k6xty8a",
      "author": "Lilymoon2653",
      "body": "Sandwich glue",
      "created_utc": 1698578740.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k6xup7h",
      "author": "Lemortheureux",
      "body": "At my work the restaurants/catering will change the order for me but I need to be very specific. You could be allergic to eggs, they should be able to accommodate that. Don't feel ashamed; you don't need to give a reason or feel like you are making their job harder. You deserve to feel safe when eating even if you need to insist on only bread + ham.\n\nIn some situations you might be caught offguard though so I always keep safe snacks in my bag. My go-to is cliff bars and almonds.",
      "created_utc": 1698579268.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k6wu3ec",
      "author": "Ok-Heart9769",
      "body": "I like real mayonnaise, but mayo substitutes are 🤢 grew up eating miracle whip on some sort of white bread sandwich basically 5 days a week for my whole elementary and middle school life. Now I can't stomach the stuff",
      "created_utc": 1698551463.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k6vk3wx",
      "author": "G0ld3nGr1ff1n",
      "body": "#YES!\nAnd sushi 😭 we will eat teriyaki sushi when it's done right but when that white sauce is found after a bite... 🤢🤮",
      "created_utc": 1698529679.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k6y2u8f",
      "author": "hesutu1989",
      "body": "I feel for you I'm not the one with arfid in my family but too much mayo like that gives even me the ick 🤢🤢🤢🤢🤢",
      "created_utc": 1698584239.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k6yi2a8",
      "author": "matchstrike",
      "body": "In too many of them, yes. Gross.",
      "created_utc": 1698591435.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k6yv0iw",
      "author": "avvocadhoe",
      "body": "Mayo is my safe food lol.",
      "created_utc": 1698596635.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k6z8ivk",
      "author": "AkiliDaniels",
      "body": "I also CAN'T eat eggs - so that's a potential allergy they should be listing...*sighs*",
      "created_utc": 1698601668.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k6wfjpg",
      "author": "ohhyouknow",
      "body": "I cannot a sandwich or burger without a gratuitous amount of Mayo personally!",
      "created_utc": 1698543825.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l3hki4o",
      "author": "Dazzling_Type_2943",
      "body": "the worst part about mayo in the sandwich is the fact that if its there you have to eat it right away and cant wait till you are hungry if ur at work or something bc ur doing ur job and want food at lunch time bc the entire sandwich gets soaked through and becomes a pile of fucking mush",
      "created_utc": 1715375302.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k6xooib",
      "author": "not-patrickstar",
      "body": "I enjoy Mayo as long as the rest of the sandwich is plain",
      "created_utc": 1698574713.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k6z1vmx",
      "author": "fwmh_royale",
      "body": "i feel so seen by this 😭 when i have a break between uni classes i often like to grab some lunch, my safe food recently is plain cheese sandwiches, and even though my uni has tons of shops nearby, all but one of them decides to slap mayo in the sandwich ☺️ so i have to pray that the one shop i go to still has plain cheese sandwiches in stock because they often run out!",
      "created_utc": 1698599289.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7orj8g",
      "author": "NoWheel7780",
      "body": "You're not in the wrong. You clearly said lettuce and cheese and didnt specify a sauce.",
      "created_utc": 1699037444.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k6upnmt",
      "author": "WampaCat",
      "body": "One time, another work thing, someone went around and took sandwich orders, very generously writing every detail down and going to order for 20+ people exactly what they asked for. Lunch time rolls around and mine is nowhere to be found. Turns out someone else didn’t have time to sit and eat so they just grabbed whatever sandwich (my sandwich) and took off. The one she had ordered and left behind was the most disgusting sandwich I’ve ever seen. Couldn’t even stomach one bite even though I was starving. Like someone went out of their way to get us exactly what we wanted. And OF COURSE I’m the one who ends up with something they can’t eat. This was over ten years ago and I’m still pissed about it. What an asshole.",
      "created_utc": 1698517341.0,
      "score": 49,
      "context": [
        {
          "id": "k6uou4p",
          "author": "Pink_Dress",
          "body": "No, I completely agree! I wish sandwiches for work functions or whatever came without condiments so people can change it as needed! I can take a tomato off my sandwich and be fine, but it’s a heck of a lot harder to remove condiments",
          "created_utc": 1698517014.0
        }
      ]
    },
    {
      "id": "k6v3yih",
      "author": "WampaCat",
      "body": "I've tried so many times too. Logically, i don't hate the ingredients that go into it so I try to remind myself of that every time. If it's a very thin layer on the bread and it doesn't overpower any of the other parts of the sandwich, I can kind of handle it. it's just so offensively goopy",
      "created_utc": 1698523166.0,
      "score": 6,
      "context": [
        {
          "id": "k6uzq6g",
          "author": "Scorpiodancer123",
          "body": "I totally agree with you. I absolutely despise mayo. \n\nIt's totally replaced butter in sandwiches now. I'm guessing because it can be squirted onto bread by machine for pre-packaged sandwiches. \n\nI've tried so many times to just tolerate it but I hate it.",
          "created_utc": 1698521470.0
        }
      ]
    },
    {
      "id": "k6v3f1h",
      "author": "WampaCat",
      "body": "i got curious about this and found some older reddit threads about mayo. Apparently most of the world thinks it's insane not to like mayo and \"how could anyone eat a dry sandwich\". I mean if all the other ingredients are good then it doesn't feel dry right?? i wouldn't turn away a sandwich with a very thin spread of it. How can anyone enjoy a sandwich when every bit has more goop in it than actual food, that seems to be how the majority of people use it. sorry for the rant lol",
      "created_utc": 1698522952.0,
      "score": 11,
      "context": [
        {
          "id": "k6uwr16",
          "author": "purplechunkymonkey",
          "body": "I'm 47 and just getting over my hatred of mayo. I still don't like it.",
          "created_utc": 1698520237.0
        }
      ]
    },
    {
      "id": "k6wa3vl",
      "author": "WampaCat",
      "body": "Marry me.",
      "created_utc": 1698541188.0,
      "score": 5,
      "context": [
        {
          "id": "k6vvfqe",
          "author": "Cressio",
          "body": "Mayo is trash. I don’t think it’s even an ARFID thing for me. I just genuinely think it doesn’t taste good/anything it’s in would be better without it. I purposefully had it in a mcchicken the other day to remind myself if it was as bad as I remembered. Yup. Managed to get through eating it fine but, again, just would’ve been better without it.",
          "created_utc": 1698534577.0
        }
      ]
    },
    {
      "id": "k6wa8gc",
      "author": "WampaCat",
      "body": "Also like, why can’t it even just be a thin layer of mayo. Why is it always SO MUCH",
      "created_utc": 1698541248.0,
      "score": 9,
      "context": [
        {
          "id": "k6vxnnw",
          "author": "Athyrical",
          "body": "I feel you. Grilled cheese is one of my favourite safe foods and this one time, a grilled cheese at a cafe said it had mayo in it. It was the only thing I could eat and I thought maybe it was just a little bit, maybe even just grilled it in mayo. That seemed manageable. NOPE, I bit into it and there was a layer of mayo over the cheese that was like 5cm thick. It oozed out as I bit into it. This made me go from kind of tolerating mayo to really disliking it for a while. \n\nWhy why why can't we just use a thin spread of butter instead of mayo?? Why do we even need condiments that ooze out and make sandwiches soggy for no reason? \"Dry\" sandwiches aren't so bad, let me just choose the condiments myself if I want them. Mayo is so overrated.",
          "created_utc": 1698535568.0
        }
      ]
    },
    {
      "id": "k6x5a85",
      "author": "marzzyy__",
      "body": "That is absolutely horrid. Who ruins a grilled cheese like that",
      "created_utc": 1698558856.0,
      "score": 6,
      "context": [
        {
          "id": "k6vxnnw",
          "author": "Athyrical",
          "body": "I feel you. Grilled cheese is one of my favourite safe foods and this one time, a grilled cheese at a cafe said it had mayo in it. It was the only thing I could eat and I thought maybe it was just a little bit, maybe even just grilled it in mayo. That seemed manageable. NOPE, I bit into it and there was a layer of mayo over the cheese that was like 5cm thick. It oozed out as I bit into it. This made me go from kind of tolerating mayo to really disliking it for a while. \n\nWhy why why can't we just use a thin spread of butter instead of mayo?? Why do we even need condiments that ooze out and make sandwiches soggy for no reason? \"Dry\" sandwiches aren't so bad, let me just choose the condiments myself if I want them. Mayo is so overrated.",
          "created_utc": 1698535568.0
        }
      ]
    },
    {
      "id": "k6wnfdd",
      "author": "WampaCat",
      "body": "Yes omg it makes no effing sense. Like you went out of your way everywhere else why leave it out on this one thing.",
      "created_utc": 1698547749.0,
      "score": 4,
      "context": [
        {
          "id": "k6wao1e",
          "author": "katieb2342",
          "body": "I hate mayo too, but the fact that restaurants just skip ingredients in descriptions bothers me so much! If they think mayonnaise IS an ingredient worth pointing out on some sandwiches, everything with mayo should specify it's there!\n\nI had the same thing happen once, an old boss offered to buy us lunch from this barbeque place that she wanted to try. I hate barbeque sauce, so I went through the entire menu and ordered a chicken sandwich which was the ONLY item that didn't list barbeque sauce in the ingredients. Guess what was on it? Clearly you thought it was important to specify the others had it, so why not this one?",
          "created_utc": 1698541453.0
        }
      ]
    },
    {
      "id": "k6ytwa7",
      "author": "Sea-Argument7634",
      "body": "Sometimes it feels like a waste of money. Because they haven't mentioned the ingredients/condiments, how can I know that an ingredient/condiment will be added to the food? I need to see it written so if I don't I just assume it's plain but end up disappointed most of the time. And I don't even know what to do with the food now because I CAN'T eat it, I just wasted money buying it and and I'm still hungry.",
      "created_utc": 1698596203.0,
      "score": 2,
      "context": [
        {
          "id": "k6wao1e",
          "author": "katieb2342",
          "body": "I hate mayo too, but the fact that restaurants just skip ingredients in descriptions bothers me so much! If they think mayonnaise IS an ingredient worth pointing out on some sandwiches, everything with mayo should specify it's there!\n\nI had the same thing happen once, an old boss offered to buy us lunch from this barbeque place that she wanted to try. I hate barbeque sauce, so I went through the entire menu and ordered a chicken sandwich which was the ONLY item that didn't list barbeque sauce in the ingredients. Guess what was on it? Clearly you thought it was important to specify the others had it, so why not this one?",
          "created_utc": 1698541453.0
        }
      ]
    },
    {
      "id": "k6yt242",
      "author": "Sea-Argument7634",
      "body": "And I can even remember or know what condiments they're going to add to it so I can tell them not to. That's why I don't like ordering food.",
      "created_utc": 1698595877.0,
      "score": 2,
      "context": [
        {
          "id": "k6xphw3",
          "author": "Mikaay99",
          "body": "What drives me insane is when you get a ton of condiment that you did not ask for, is not necessary and ruins the entire meal but they can't be bothered to but more veggies in it. Like a sandwich oozing with mayo but it only has two pickles so it can't even be balanced out.",
          "created_utc": 1698575366.0
        }
      ]
    },
    {
      "id": "k6ysmi4",
      "author": "Sea-Argument7634",
      "body": "I don't even try removing it because the taste will still be there. I just avoid the food altogether.",
      "created_utc": 1698595708.0,
      "score": 2,
      "context": [
        {
          "id": "k6xa65h",
          "author": "yamiryukia330",
          "body": "I agree entirely. I have a strong distaste for many condiments and mayo especially. It's hell trying to remove them.",
          "created_utc": 1698562767.0
        }
      ]
    },
    {
      "id": "k6wu90h",
      "author": "WampaCat",
      "body": "Yeah I agree it’s like a whole different food. I don’t love the stuff but it’s miles better than miracle whip",
      "created_utc": 1698551553.0,
      "score": 1,
      "context": [
        {
          "id": "k6wu3ec",
          "author": "Ok-Heart9769",
          "body": "I like real mayonnaise, but mayo substitutes are 🤢 grew up eating miracle whip on some sort of white bread sandwich basically 5 days a week for my whole elementary and middle school life. Now I can't stomach the stuff",
          "created_utc": 1698551463.0
        }
      ]
    },
    {
      "id": "k6zhse2",
      "author": "WampaCat",
      "body": "As a mayo person do you feel like it’s an implied ingredient? Like when you don’t see it on a list of ingredients for a sandwich do you expect it anyway? I am a confused why places will list it on the menu for some things and not others where they plan to include it",
      "created_utc": 1698604991.0,
      "score": 3,
      "context": [
        {
          "id": "k6yv0iw",
          "author": "avvocadhoe",
          "body": "Mayo is my safe food lol.",
          "created_utc": 1698596635.0
        }
      ]
    },
    {
      "id": "k6ur3w0",
      "author": "Pink_Dress",
      "body": "Omg I feel that so hardcore. I ordered lunch for my friends one time and me and one other guy got the same base sandwich but different toppings. I even told him, “check the sandwiches before eating them, ours are the same but different toppings”. The delivery took five ever so I asked if someone could bring mine by my classroom while I was teaching (grad school) once they were delivered. My friend brought a sandwich but upon further inspection (not even like hard core inspecting, this sandwich had bright yellow mustard, mine did not) so I frantically texted my friends to stop the guy and that he had my sandwich. I decided to dip out for a second to just get it myself AND MF ATE HALF MY SANDWICH. If I wasn’t in the middle of teaching, I would have ripped him a new one; I was so livid. \n\nI still gave him an earful, but I’m still pissed about it. He even knew the sandwich was wrong but still was like oh well. People who don’t check because they don’t care are the WORST",
      "created_utc": 1698517930.0,
      "score": 28,
      "context": [
        {
          "id": "k6uou4p",
          "author": "Pink_Dress",
          "body": "No, I completely agree! I wish sandwiches for work functions or whatever came without condiments so people can change it as needed! I can take a tomato off my sandwich and be fine, but it’s a heck of a lot harder to remove condiments",
          "created_utc": 1698517014.0
        },
        {
          "id": "k6upnmt",
          "author": "WampaCat",
          "body": "One time, another work thing, someone went around and took sandwich orders, very generously writing every detail down and going to order for 20+ people exactly what they asked for. Lunch time rolls around and mine is nowhere to be found. Turns out someone else didn’t have time to sit and eat so they just grabbed whatever sandwich (my sandwich) and took off. The one she had ordered and left behind was the most disgusting sandwich I’ve ever seen. Couldn’t even stomach one bite even though I was starving. Like someone went out of their way to get us exactly what we wanted. And OF COURSE I’m the one who ends up with something they can’t eat. This was over ten years ago and I’m still pissed about it. What an asshole.",
          "created_utc": 1698517341.0
        }
      ]
    },
    {
      "id": "lmzh1qv",
      "author": "Perciprius",
      "body": "Well? Did your job compensate you in any way?",
      "created_utc": 1726259527.0,
      "score": 1,
      "context": [
        {
          "id": "k6uou4p",
          "author": "Pink_Dress",
          "body": "No, I completely agree! I wish sandwiches for work functions or whatever came without condiments so people can change it as needed! I can take a tomato off my sandwich and be fine, but it’s a heck of a lot harder to remove condiments",
          "created_utc": 1698517014.0
        },
        {
          "id": "k6upnmt",
          "author": "WampaCat",
          "body": "One time, another work thing, someone went around and took sandwich orders, very generously writing every detail down and going to order for 20+ people exactly what they asked for. Lunch time rolls around and mine is nowhere to be found. Turns out someone else didn’t have time to sit and eat so they just grabbed whatever sandwich (my sandwich) and took off. The one she had ordered and left behind was the most disgusting sandwich I’ve ever seen. Couldn’t even stomach one bite even though I was starving. Like someone went out of their way to get us exactly what we wanted. And OF COURSE I’m the one who ends up with something they can’t eat. This was over ten years ago and I’m still pissed about it. What an asshole.",
          "created_utc": 1698517341.0
        }
      ]
    },
    {
      "id": "k6v3wiw",
      "author": "purplechunkymonkey",
      "body": "Yep, it's sort of crazy but Boar's Head makes a gourmaze that is mayo (don't like), mustard(can't stand), and ground black peppercorn. And yet I like it.",
      "created_utc": 1698523145.0,
      "score": 8,
      "context": [
        {
          "id": "k6uwr16",
          "author": "purplechunkymonkey",
          "body": "I'm 47 and just getting over my hatred of mayo. I still don't like it.",
          "created_utc": 1698520237.0
        },
        {
          "id": "k6v3f1h",
          "author": "WampaCat",
          "body": "i got curious about this and found some older reddit threads about mayo. Apparently most of the world thinks it's insane not to like mayo and \"how could anyone eat a dry sandwich\". I mean if all the other ingredients are good then it doesn't feel dry right?? i wouldn't turn away a sandwich with a very thin spread of it. How can anyone enjoy a sandwich when every bit has more goop in it than actual food, that seems to be how the majority of people use it. sorry for the rant lol",
          "created_utc": 1698522952.0
        }
      ]
    },
    {
      "id": "k7li1bj",
      "author": "Athyrical",
      "body": "fr who actually likes that??",
      "created_utc": 1698977244.0,
      "score": 2,
      "context": [
        {
          "id": "k6vxnnw",
          "author": "Athyrical",
          "body": "I feel you. Grilled cheese is one of my favourite safe foods and this one time, a grilled cheese at a cafe said it had mayo in it. It was the only thing I could eat and I thought maybe it was just a little bit, maybe even just grilled it in mayo. That seemed manageable. NOPE, I bit into it and there was a layer of mayo over the cheese that was like 5cm thick. It oozed out as I bit into it. This made me go from kind of tolerating mayo to really disliking it for a while. \n\nWhy why why can't we just use a thin spread of butter instead of mayo?? Why do we even need condiments that ooze out and make sandwiches soggy for no reason? \"Dry\" sandwiches aren't so bad, let me just choose the condiments myself if I want them. Mayo is so overrated.",
          "created_utc": 1698535568.0
        },
        {
          "id": "k6wa8gc",
          "author": "WampaCat",
          "body": "Also like, why can’t it even just be a thin layer of mayo. Why is it always SO MUCH",
          "created_utc": 1698541248.0
        }
      ]
    },
    {
      "id": "k7lhzij",
      "author": "Athyrical",
      "body": "tysm it was DISGUSTING",
      "created_utc": 1698977223.0,
      "score": 2,
      "context": [
        {
          "id": "k6vxnnw",
          "author": "Athyrical",
          "body": "I feel you. Grilled cheese is one of my favourite safe foods and this one time, a grilled cheese at a cafe said it had mayo in it. It was the only thing I could eat and I thought maybe it was just a little bit, maybe even just grilled it in mayo. That seemed manageable. NOPE, I bit into it and there was a layer of mayo over the cheese that was like 5cm thick. It oozed out as I bit into it. This made me go from kind of tolerating mayo to really disliking it for a while. \n\nWhy why why can't we just use a thin spread of butter instead of mayo?? Why do we even need condiments that ooze out and make sandwiches soggy for no reason? \"Dry\" sandwiches aren't so bad, let me just choose the condiments myself if I want them. Mayo is so overrated.",
          "created_utc": 1698535568.0
        },
        {
          "id": "k6x5a85",
          "author": "marzzyy__",
          "body": "That is absolutely horrid. Who ruins a grilled cheese like that",
          "created_utc": 1698558856.0
        }
      ]
    },
    {
      "id": "k6zqmlg",
      "author": "avvocadhoe",
      "body": "I feel like in sandwiches it is an implied ingredient. But I’ve learned to always be super specific everywhere. Like onions seem to be in everything and I CANNOT do onions so I learned to ask for no onions even when onion is not listed in the ingredients. I ask for Mayo on sandwiches though just to be sure",
      "created_utc": 1698608197.0,
      "score": 3,
      "context": [
        {
          "id": "k6yv0iw",
          "author": "avvocadhoe",
          "body": "Mayo is my safe food lol.",
          "created_utc": 1698596635.0
        },
        {
          "id": "k6zhse2",
          "author": "WampaCat",
          "body": "As a mayo person do you feel like it’s an implied ingredient? Like when you don’t see it on a list of ingredients for a sandwich do you expect it anyway? I am a confused why places will list it on the menu for some things and not others where they plan to include it",
          "created_utc": 1698604991.0
        }
      ]
    },
    {
      "id": "k6v2f04",
      "author": "WampaCat",
      "body": "I am mad for you lol. Seriously though why does everyone expect other people don't care or shouldn't care about their food. Like maybe you'd ordered different toppings bc of an allergy. I mean even just not being in the mood for mustard that day should be enough reason to warrant the two seconds it takes to check. ugh",
      "created_utc": 1698522559.0,
      "score": 13,
      "context": [
        {
          "id": "k6uou4p",
          "author": "Pink_Dress",
          "body": "No, I completely agree! I wish sandwiches for work functions or whatever came without condiments so people can change it as needed! I can take a tomato off my sandwich and be fine, but it’s a heck of a lot harder to remove condiments",
          "created_utc": 1698517014.0
        },
        {
          "id": "k6upnmt",
          "author": "WampaCat",
          "body": "One time, another work thing, someone went around and took sandwich orders, very generously writing every detail down and going to order for 20+ people exactly what they asked for. Lunch time rolls around and mine is nowhere to be found. Turns out someone else didn’t have time to sit and eat so they just grabbed whatever sandwich (my sandwich) and took off. The one she had ordered and left behind was the most disgusting sandwich I’ve ever seen. Couldn’t even stomach one bite even though I was starving. Like someone went out of their way to get us exactly what we wanted. And OF COURSE I’m the one who ends up with something they can’t eat. This was over ten years ago and I’m still pissed about it. What an asshole.",
          "created_utc": 1698517341.0
        },
        {
          "id": "k6ur3w0",
          "author": "Pink_Dress",
          "body": "Omg I feel that so hardcore. I ordered lunch for my friends one time and me and one other guy got the same base sandwich but different toppings. I even told him, “check the sandwiches before eating them, ours are the same but different toppings”. The delivery took five ever so I asked if someone could bring mine by my classroom while I was teaching (grad school) once they were delivered. My friend brought a sandwich but upon further inspection (not even like hard core inspecting, this sandwich had bright yellow mustard, mine did not) so I frantically texted my friends to stop the guy and that he had my sandwich. I decided to dip out for a second to just get it myself AND MF ATE HALF MY SANDWICH. If I wasn’t in the middle of teaching, I would have ripped him a new one; I was so livid. \n\nI still gave him an earful, but I’m still pissed about it. He even knew the sandwich was wrong but still was like oh well. People who don’t check because they don’t care are the WORST",
          "created_utc": 1698517930.0
        }
      ]
    },
    {
      "id": "k6v9rnf",
      "author": "Pink_Dress",
      "body": "EXACTLY",
      "created_utc": 1698525496.0,
      "score": 6,
      "context": [
        {
          "id": "k6uou4p",
          "author": "Pink_Dress",
          "body": "No, I completely agree! I wish sandwiches for work functions or whatever came without condiments so people can change it as needed! I can take a tomato off my sandwich and be fine, but it’s a heck of a lot harder to remove condiments",
          "created_utc": 1698517014.0
        },
        {
          "id": "k6upnmt",
          "author": "WampaCat",
          "body": "One time, another work thing, someone went around and took sandwich orders, very generously writing every detail down and going to order for 20+ people exactly what they asked for. Lunch time rolls around and mine is nowhere to be found. Turns out someone else didn’t have time to sit and eat so they just grabbed whatever sandwich (my sandwich) and took off. The one she had ordered and left behind was the most disgusting sandwich I’ve ever seen. Couldn’t even stomach one bite even though I was starving. Like someone went out of their way to get us exactly what we wanted. And OF COURSE I’m the one who ends up with something they can’t eat. This was over ten years ago and I’m still pissed about it. What an asshole.",
          "created_utc": 1698517341.0
        },
        {
          "id": "k6ur3w0",
          "author": "Pink_Dress",
          "body": "Omg I feel that so hardcore. I ordered lunch for my friends one time and me and one other guy got the same base sandwich but different toppings. I even told him, “check the sandwiches before eating them, ours are the same but different toppings”. The delivery took five ever so I asked if someone could bring mine by my classroom while I was teaching (grad school) once they were delivered. My friend brought a sandwich but upon further inspection (not even like hard core inspecting, this sandwich had bright yellow mustard, mine did not) so I frantically texted my friends to stop the guy and that he had my sandwich. I decided to dip out for a second to just get it myself AND MF ATE HALF MY SANDWICH. If I wasn’t in the middle of teaching, I would have ripped him a new one; I was so livid. \n\nI still gave him an earful, but I’m still pissed about it. He even knew the sandwich was wrong but still was like oh well. People who don’t check because they don’t care are the WORST",
          "created_utc": 1698517930.0
        },
        {
          "id": "k6v2f04",
          "author": "WampaCat",
          "body": "I am mad for you lol. Seriously though why does everyone expect other people don't care or shouldn't care about their food. Like maybe you'd ordered different toppings bc of an allergy. I mean even just not being in the mood for mustard that day should be enough reason to warrant the two seconds it takes to check. ugh",
          "created_utc": 1698522559.0
        }
      ]
    }
  ]
}